{
    "symbol": "SMSI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 22:48:04",
    "content": " Those cost rationalization efforts began in the third quarter, resulting in $1 million in sequential quarter-over-quarter reductions in operating costs. In addition, we've taken further actions thus far in fourth quarter to continue to execute on our plan to reduce quarterly operating expenses by over $3 million compared to the $14.1 million in operating expense that we reported in the second quarter of this year. For the third quarter, we posted revenue of $11.7 million compared to $16.4 million for the same quarter last year, a decrease of approximately 29% as a result of the decline in CommSuite revenues coupled with a decrease in family safety revenues when compared to the second quarter of 2022, revenue decreased by approximately $1 million or 8%. Year-to-date revenues through September 30, 2022, were $37.1 million versus $43.7 million through the third quarter of last year. During the third quarter of 2022, family safety revenue decreased by $2.3 million or 20% compared to the third quarter of last year, primarily as a result of the reduction of the legacy Safe & Found platform revenue related to the continued attrition of legacy Sprint subscribers driven by T-Mobile's acquisition of Sprint. During the third quarter of 2022, CommSuite revenue was $1.1 million, which decreased approximately $2.4 million compared to the $3.5 million in revenue produced in the third quarter of last year. ViewSpot revenue was approximately $1 million for the third quarter of 2022, which was essentially flat compared to the third quarter of last year and decreased by approximately $100,000 compared to the second quarter of 2022. For the third quarter, gross profit was $8.1 million compared to $12.8 million during the same period last year. For the year-to-date period ended September 30, 2022, gross profit was $26.2 million compared to $35.1 million during the corresponding period last year. GAAP operating expenses for the third quarter were $16.2 million, a decrease of $15 million or 48% compared to the third quarter of last year. GAAP operating expense for the year-to-date period ended September 30, 2022, was $49.8 million, a decrease of $12.3 million or 20% compared to last year. Non-GAAP operating expenses for the third quarter were $13.1 million compared to $12.9 million in the third quarter of 2021, an increase of approximately $200,000 or 2%. Sequentially, non-GAAP operating expenses decreased by $1.1 million or 8% from the second quarter of 2022, primarily due to decreases in personnel-related costs and in contractor costs related to the SafePath migration. As Bill mentioned in his remarks, we are anticipating that these actions will result in quarterly savings of over $3 million by the second quarter of 2023 compared to the $14.1 million of non-GAAP operating expenses incurred in the second quarter of this year. Non-GAAP operating expense for the year-to-date period through September 30, 2022, was $40 million, an increase of $5.1 million or 15% compared to last year, primarily driven by the addition of the Avast business in April 2021. The non-GAAP net loss for the third quarter was $5.2 million or $0.09 loss per share compared to a non-GAAP net loss of approximately $300,000 or breakeven from a loss per share perspective in the third quarter of last year. The non-GAAP net loss for the year-to-date period ended September 30, 2022, was $40 million or a $0.25 loss per share compared to a non-GAAP net income of approximately $100,000 or breakeven from a diluted earnings per share perspective last year. For the third quarter, the reconciliation includes adjustments for intangible amortization of $1.5 million; stock compensation expense of $1.1 million, convertible note and stock offering fees of $1 million and severance-related costs of approximately $100,000, partially offset by fair value adjustments of $1.6 million. For the year-to-date period, the reconciliation includes adjustments for intangible asset amortization of $4.8 million, stock compensation expense of $3.8 million, convertible note and stock offering fees of $1 million and severance-related costs of approximately $800,000, partially offset by fair value adjustments of $1.6 million. Also, I misspoke with regards to year-to-date non-GAAP operating expenses, which were $40.6 million for the nine months ended September 30, 2022, resulting in a non-GAAP net loss of $14.6 million or a $0.26 loss per share on a non-GAAP basis."
}