{
    "symbol": "SMSI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 19:13:23",
    "content": " Please note that some of the information you'll hear during today's discussion consist of forward-looking statements, including without limitation those regarding the company's future revenue and profitability, our future plans, new product development, new and expanded market opportunities, future product development, migration and growth by our new and existing customers, operating expenses, company cash reserves and the expected impact of last year's acquisition of Avast Family Safety Mobile Business, on our business strategy, operations and financial positions going forward. Overall, we are anticipating that these synergies would result in a quarterly operating expense reduction of over $3 million versus Q2 2022, by the end of Q1 2023. For the second quarter, we posted revenue of $12.7 million compared to $15.9 million for the same quarter last year, a decrease of approximately 20% as a result of the decline in CommSuite revenues coupled with a decrease in Family Safety revenues. Year-to-date revenues through June 30, 2022 were $25.4 million versus $27.3 million during the second quarter of last year. During the second quarter of 2022 Family Safety revenue decreased by about $1 million or 9% compared to the second quarter of last year, primarily as a result of the reduction of the legacy Safe & Found platform revenue related to the continued attrition of legacy Sprint subscribers driven by T-Mobile's acquisition of Sprint. During the second quarter of 2022 CommSuite revenue was $1.4 million, which decreased approximately $2.5 million compared to $3.9 million in revenue produced in the second quarter of last year. ViewSpot revenue was approximately $1.1 million for the second quarter of 2022, which increased by approximately $300,000 compared to the second quarter of last year and up approximately 16% compared to the first quarter of 2022. For the year-to-date period ended June 30, 2022 gross profit was $18.2 million compared to $22.4 million during the corresponding period last year. GAAP operating expenses for the second quarter were $17.5 million, a decrease of approximately $200,000 or 1% compared to the second quarter of last year. GAAP operating expenses for the year-to-date period ended June 30, 2022 was $33.6 million, an increase of $2.8 million or 9% compared to last year. Non-GAAP operating expenses for the second quarter were $14.1 million compared to $12.9 million in the second quarter of 2021, an increase of approximately $1.3 million or 10%. Sequentially, non-GAAP operating expenses increased by 6% from $13.4 million in the first quarter of 2022 due to the increase in contractor costs related to the SafePath migrations. Non-GAAP operating expenses for the year-to-date period through June 30, 2022 was $27.5 million, an increase of $5.5 million or 25% compared to last year, primarily driven by the addition of the Avast business in April 2021. The non-GAAP net loss for the second quarter was $5.1 million or $0.09 loss per share compared to a non-GAAP loss of approximately $300,000 or $0.01 loss per share in the second quarter of last year. The non-GAAP net loss for the year-to-date period ended June 30, 2022 was $9.4 million or $0.17 loss per share compared to a non-GAAP net income of approximately $400,000 or $0.01 of diluted earnings per share last year. For the second quarter the reconciliation includes adjustments for intangible asset amortization of $1.6 million, stock compensation expense of $1.1 million and severance-related costs of approximately $700,000, including approximately $600,000 of additional stock based compensation expense."
}