{
    "symbol": "CNSL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 13:45:21",
    "content": " I'll note our 2023 build target is a moderated level versus the prior 2 years as we focus on driving penetration within our existing base of fiber passing, and we benefit from broadband revenue growth as a result of reaching the previously mentioned critical fiber coverage level of nearly 40%, and also actively pursue any grant or infrastructure funding opportunities that align with our build plans that we can maximize the economies of our builds for complete areas. Fiber broadband revenue normalized for Kansas was $23.7 million, up 51% year-over-year and 12% increase from the third quarter, and positive traction we are generating in fiber contributed to overall consumer broadband revenue growth of 5% in the fourth quarter and 3% for the full year of 2022. We completed 2022 with roughly 123,000 consumer fiber broadband customers or penetration of 12% on our fiber passings of 1 million. Normalized consumer broadband revenue was $67.9 million, up 5.3% driven by strong consumer fiber revenue growth of 51%. Data services revenue normalized was $53.7 million in the fourth quarter, up 1.3% year-over-year, primarily driven by direct Internet access growth. Network access revenues normalized totaled $26 million, down $1.2 million or 4.3%, primarily due to declines in special access circuit revenue as carriers move from TDM to Ethernet-based transport solutions. Cost of services and products expense declined $4.2 million, largely due to savings from lower video programming costs, including the impact of the sale of our Kansas operations and a decline in IRU fiber costs related to additional PPP initiatives in the prior year, partially offset by higher utility and fuel expense. Selling, general and administrative expenses increased $8.9 million, primarily due to marketing and advertising expenses related to the expansion of the company's consumer fiber product, higher professional fees for customer service and process improvement initiatives as well as severance costs. The lower level of projected EBITDA in our guidance versus 2022 includes approximately $50 million resulting from 2022 asset sales, including Kansas and our wireless partnerships, an expected $20 million reduction in legacy voice, the fiber-to-the-tower contract pricing step downs of approximately $10 million in the carrier business, as well as increased marketing and sales expenses."
}