{
    "symbol": "LRFC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 15:44:04",
    "content": " Specifically, as of June 30, 2022, 42% of the company's investment portfolio at fair value was originated by BC Credit -- BC Partners credit platform with ample cash and unused borrowing capacity under our new credit facility available for future deployment. During the 12 months ended June 30, 2022, we've successfully monetized and/or realized just under $150 million of the legacy portfolio we inherited from the former adviser. In spite of this, due to successful execution of our business plan and prudent portfolio management, we successfully monetized and/or realized almost $150 million in legacy portfolio we inherited from the former adviser over the last year which represents approximately 64% of the initial portfolio at fair value. As a result, 42% of the company's investments, investment portfolio at fair value was invested in assets originated by the BC Partners Credit platform as of the quarter end June 30, 2022. Additionally, the company has $29.5 million in cash as well as $34.4 million of unused borrowing capacity available for deployment and investments originated by the BC Partners Credit platform as of June 30, 2022. This includes the refinancing and recapitalization transaction completed by Esports Holdings LLC as that closed on June 29, 2022, whereby Logan Ridge received $16.5 million  in cash and $19.3 million in principal of a new debt security in exchange for all its previous debt and equity securities, generating a realized gain of approximately $16 million . As of June 30, 2022, we had debt investments in 2 portfolio companies on nonaccrual status with an aggregate cost of $12.1 million and a fair value of $6.4 million which represented 6.5% and 3.6% of the investment portfolio, respectively. For the second quarter of 2022, we reported a net investment loss of $900,000 compared to a net investment loss of $1.1 million in the prior quarter and net investment income of less than $100,000 during the second quarter of 2021. Net realized gain on investments was $15.5 million for the second quarter of 2022 compared to a net realized loss of less than $100,000 in the prior quarter and a net realized gain of $6.9 million during the second quarter of 2021. For the 3 months ended June 30, 2022, the company reported a net decrease in net assets resulting from operations of $5 million or a net loss per share of $1.86."
}