{
    "symbol": "LOPE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 20:25:08",
    "content": " First, GCUâ\u0080\u0099s traditional campus saw an increase of 8.9% in new students in the fall of 2022 over prior year, an increase of 8% in total ground traditional enrollment and an increase of 10.5% in residential enrollment approximately 69.9% of ground traditional students live on campus. The quality and relevancy of GCUâ\u0080\u0099s academic programs, the low-class sizes in support of its faculty that has less than a 5% turnover rate, the quality of counseling services via 20 advisory boards with over 500 companies represented who are creating internships and employment opportunities for GCU students in a very affordable tuition, which hasnâ\u0080\u0099t been raised in 15 years are all important contributing factors. The increase year-over-year in service revenue was primarily due to an increase in GCUâ\u0080\u0099s traditional campus enrollments of 8% and increases in revenue per student year-over-year partially offset by a decrease in online enrollments at GCU of 1.6% and to a lesser extent, students in our university partnerâ\u0080\u0099s Occupational Therapy Assistants program of 11.3%. Revenue per student continues to grow on a year-over-year basis, primarily due to the service revenue impact of the growth in the GCU traditional campus enrollments between years, which has a higher revenue per student due to room board and other ancillary revenues and the higher revenue per student at off-campus classroom and laboratory sites. GCE CapEx in the fourth quarter of 2022, including CapEx for new off-site classroom, campus classroom and laboratory sites was approximately $8.9 million or 3.5% of service revenue with total CapEx for 2022 of $35 million. As Brian discussed earlier, hybrid growth will remain below our long-term objectives during the first half of 2023, but we are hopeful that we will see acceleration beginning in the fall semester due to new site openings, and the impact of the prerequisite initiative on the number of eligible students that could start in our partnersâ\u0080\u0099 programs."
}