{
    "symbol": "SRDX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-27 15:36:05",
    "content": " Starting with our third quarter financial performance, which was in line with our expectations, we grew revenue 4% to $24.9 million in the third quarter compared to $23.9 million in the prior year quarter. Revenue for the third quarter of fiscal 2022 grew 4% to $24.9, compared to $23.9 million in the prior year quarter. Our In Vitro Diagnostics business revenue grew 3% to $7.3 million, compared to $7.1 million in the prior year quarter. Product revenue increased 15% to $13.9 million in the third quarter, compared to $12.1 million in the prior year quarter. In our Medical Device business, product revenue grew 23% or $1.2 million to $6.7 million on broad based growth across our medical device products and coating reagent, with growing contribution from our Pounce arterial and Sublime radial commercialization efforts. Product sales of our medical devices in the third quarter grew 64% from the year ago period, which includes contract manufactured balloon catheters, especially catheters partnered with Coating and Medtronic and our Pounce arterial thrombectomy and Sublime radial device products. Turning to the fourth quarter of fiscal 2022, as Gary discussed, the commercialization timing of our Pounce Venous product has been delayed, which is one factor unfavorably impacting our revenue guidance for the full year. R&D services revenue of $2.1 million in the third quarter was down $850,000 compared to the same prior year period, primarily as a result of the completion of a customer development program in our IVD business. R&D expense, including costs of clinical and regulatory activities was $13 million in the third quarter or 52% of revenue, compared to $12.2 million in the year ago period. SG&A expense in the third quarter of fiscal 2022 was $12.9 million, or 52% of revenue, compared to $7.9 million in the year ago period. Our Medical Device business reported an operating loss of $7.3 million in the third quarter, compared to an operating loss of $2.5 million in the year ago period. In addition to sales and marketing investments, our third quarter performance includes the addition of $1 million in operating expenses, of which $520,000 is an intangible asset amortization, related to our fourth quarter fiscal 2021 Vetex acquisition. Our IVD business reported operating income of $3.4 million in the third quarter, and was consistent with the prior year quarter. We recorded an income tax benefit of $1.5 million in the third quarter of fiscal 2022 compared to income tax expense of $780,000 in the year ago period. So historically, last couple of years, you've invested 50% plus of revenue in R&D, I'm expecting a fairly significant acceleration in revenue growth and profitability as we get SurVeil approval, and some of these other products move into commercialization."
}