{
    "symbol": "SRDX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-03 12:57:05",
    "content": " For the first quarter of fiscal 2022, revenue grew 3% to $23 million, compared to $22.3 million in the prior-year quarter. Our Medical Device business revenue grew 4% year-over-year to $16.9 million, driven by strong product sales, which offset lower than expected royalty revenue. 18:19 Our first quarter royalty and license fee revenue totaled $8.1 million, down $1.2 million from the same prior-year period. 21:25 R&D services revenue of $2.6 million was down 11% or $300,000 compared to the same prior year period, driven by lower customer demand for Medical Device coating services due in part to supply chain challenges related to customer supplied components. 22:14 R&D expense including cost of clinical and regulatory activities was $11.7 million in the first quarter, or 51% of revenue compared to $10.9 million or 49% of revenue in the year-ago period. 22:38 While our team continues as always to exercise disciplined expense management, we expect that our quarterly R&D spend will increase several million from Q1 levels as we continue to accelerate our Ponce venous commercial readiness activities as well as our Pounce and Sublime product development initiatives over the remainder of the year. 23:27 Our Medical Device business reported an operating loss of $3.8 million in the first quarter compared to an operating loss of $590,000 in the year-ago period. And I'll tell you, we are -- here is the decision, as I thought it would be much more difficult to compete for salespeople, I could share my bias now, like I don't think we can get to 10 or 12 as we have done so brilliantly, but as we are able to get them if we are able to recruit talented  we will keep going, but we're not, we're going to stay within the confines of the plan of how much internally, we've decided we want to get too, but as we're getting them, I don't see a reason to say no to a talented person on the street. First of all, few things, if you take a look at kind of historically Q1 tends to be a bit of -- when I would compare the both sides, in terms of products revenues for the coatings business and we saw that last year, so it could be easier comp, but I will say that we have been trending higher with product revenue and there could be some folks that maybe you're carrying a bit more inventory just to be prepared in the event that there might be some supply chain challenges."
}