{
    "symbol": "SRDX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-12 20:45:03",
    "content": " In the fourth quarter of fiscal 2022, we achieved total revenue of $26 million, representing growth of 8% year-over-year. Our total revenue growth in the fourth quarter was exclusively driven by medical device revenue, which increased 12% year-over-year, offset slightly by a 1% decrease in -- In Vitro Diagnostics or IVD revenue. Within our Medical Device business, the outperformance that we saw in the fourth quarter relative to our expectations was driven by a combination of stronger-than-anticipated product sales, including sales of our Pounce and Sublime products, along with higher-than-anticipated license fee revenue related to our SurVeil agreement. Normalizing for this milestone payment, we grew total revenue by 5% year-over-year in fiscal '22, driven by 6% growth in our Medical Device business on a normalized basis and 3% growth in our IVD business. As you can see from -- some of the progress that I've highlighted in recent months, we're not taking our foot off the gas in fiscal 2023 with respect to our 3 strategic objectives, which are as follows: first, to achieve the PMA for SurVeil and support Abbott's commercialization efforts; second, to advance the initial commercialization of our Sublime radial and Pounce arterial thrombectomy platforms, turning the corner from market entry to rapid growth. The year-over-year increase in product revenue was primarily driven by medical device product revenue, which increased $1.6 million or 26% year-over-year due to strong sales of our devices, including growing contributions from sales of our Pounce arterial thrombectomy and Sublime radial platforms. We also saw contributions from growth in IVD product revenue, which increased $240,000 or 4% year-over-year, driven by growth across several IVD product lines, which was partly offset by unfavorable order timing for distributed antigen products. Before I continue down the P&L, let me remind you that in the fourth quarter of fiscal 2021, we had a $3.6 million benefit to operating income related to the employee retention credit or ERC, through the CARES Act. This $3.6 million benefit represents a headwind to our year-over-year performance for the fourth quarter of fiscal 2022, impacting product gross margin, R&D expense and SG&A expense. R&D expense, including cost of clinical and regulatory activities, increased $1.5 million or 14% year-over-year to $12.3 million in the fourth quarter. Our Medical Device business reported an operating loss of $6.2 million in the fourth quarter compared to $800,000 loss in the prior year period. We recorded income tax expense of $7.9 million in the fourth quarter of fiscal 2022 compared to income tax benefit of $270,000 in the prior year period. GAAP net loss in the fourth quarter of fiscal 2022 was $14.7 million or a loss of $1.06 per diluted share compared to a loss of $290,000 or a loss of $0.02 per diluted share in the prior year period. Adjusted EBITDA loss in the fourth quarter of fiscal 2022 was $2.5 million compared to adjusted EBITDA of $510,000 in the prior year period. We expect fiscal 2023 revenue to range from $103 million to $107 million, representing an increase of 3% to 7% compared to the prior year. The revenue that would be recognized in fiscal 2023, assuming a $27 million milestone payment would be approximately $25 million, and the earnings per share impact would be approximately $1.75 per share."
}