{
    "symbol": "COMM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 22:34:36",
    "content": " For the third quarter of 2022, core CommScope delivered net sales of $1.99 billion and core adjusted EBITDA of $353 million, the highest on record since the ARRIS acquisition. For the third quarter, consolidated CommScope reported net sales of $2.38 billion, an increase of 13% from the prior year, driven by an increase in all core segments and partially offset by a decline in Home Networks. Adjusted EBITDA of $348 million increased 34% as a result of our volume growth, pricing actions to offset inflation and operational efficiencies through our CommScope NEXT actions. For core CommScope, net sales of $1.99 billion, grew 18%, and adjusted EBITDA of $353 million, grew 29% from prior year. Consistent with our expectations, as we indicated on our previous call, with our increases in capacity, modest improvement in supply availability and overall lead times coming down, core CommScope backlog declined 4% from the previous quarter, ending at over $3.6 billion. NICS adjusted EBITDA of $25 million, grew $33 million from the prior year driven by volume, growth and price, representing strong execution in a challenging chip supply market. OWN net sales of $382 million, grew 7% from the prior year, primarily driven by price and strength in the Integrated Solutions and HELIAX businesses. OWN adjusted EBITDA of $82 million, grew 36% from the prior year, driven by price to offset inflation, higher volumes and improved regional and product mix. ANS adjusted EBITDA of $58 million, declined 43% from the prior year, driven by the mix change to lower-margin hardware-centric products found on the network edge. Home Networks net sales of $391 million, declined 6% from the prior year driven by declines in our Broadband Gateway business. Specifically, with current line of sight, we are reaffirming the expectations that we shared with you on our December 2021 Investor Day of a core adjusted EBITDA in the range of $1.35 billion to $1.5 billion, and net leverage target of 5.5x to 6.5x for the full year 2023. But as we've moderated this inventory, I mean, I think how -- I think how I would answer your question, which may be a little bit different than what you asked, I think we feel like there's a couple of hundred million dollars of inventory that we should be able to work out of the system over the next few quarters as we think about managing just our planning process better, particularly as the supply chain situation gets a little bit better."
}