{
    "symbol": "COMM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 11:44:04",
    "content": " From a financial perspective, for the full year 2022, consolidated CommScope net sales of $9.23 billion increased 7% and adjusted EBITDA of $1.28 billion, increased 14% from the prior year. The strong revenue and aggressive execution on our cost programs resulted in core adjusted EBITDA of $1.25 billion, an increase of 15% from the prior year. Shifting to the fourth quarter, consolidated net sales of $2.32 billion increased 4% and adjusted EBITDA of $376 million increased 44% from the prior year. For Core CommScope, fourth quarter net sales of $1.93 billion increased 10% and adjusted EBITDA of $381 million increased 50% from the prior year. For the full year, Core CommScope reported net sales of $7.52 billion an increase of 12% from the prior year. Core adjusted EBITDA for the full year was $1.25 billion, an increase of 15% from the prior year and at the high end of our expected range for the full year 2022. For the fourth quarter, consolidated CommScope reported net sales of $2.32 billion, an increase of 4% from the prior year. Adjusted EBITDA of $376 million increased approximately 44% from the prior year, driven by the growth in CCS and NICS. Core CommScope net sales of $1.93 billion increased 10% from the prior year, driven by strength in CCS, NICS and ANS. Core adjusted EBITDA of $381 million increased 50% from prior year, driven by the strong performance in CCS and NICS. As Chuck previously mentioned, these lower order rates have been incorporated into our expectation to deliver full year 2023 core adjusted EBITDA within the range of $1.35 billion to $1.5 billion. OWN adjusted EBITDA of $41 million declined 23% from prior year, primarily driven by the decline in volume, in addition to a $21 million bad debt charge related to one specific OWN customer. In our ANS business, net sales of $375 million, increased 15% from the prior year, primarily driven by growth in Access Technologies. Adjusted EBITDA of $95 million declined approximately 2% from the prior year driven by the negative mix impact of operator spend shifting to the edge, discussed at length in previous calls. As a result, also indicated on prior earnings calls, this significant cash generation drove our full year positive with cash from operations, free cash flow and adjusted free cash flow to $190 million, $89 million and $198 million, respectively. As we indicated during the fourth quarter, we would expect the midpoint of our EBITDA guidepost for 2023 to deliver $400 million to $500 million of free cash flow for the year. However, based on conversations with our customers about 2023 and our backlog position, we are reaffirming our expectations to deliver full year 2023 core adjusted EBITDA in the range of $1.35 billion to $1.5 billion. CCS and NICS are a testament to the progress we've made in 2022, given their combined 21% year-over-year net sales growth and combined adjusted EBITDA improvement of $262 million."
}