{
    "symbol": "COMM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 04:05:24",
    "content": " As we head into the second half, we maintain our core adjusted EBITDA expectation for the full year to be in the range of $1.15 billion to $1.25 billion. Overall, demand for CommScope products and solutions continues to be encouraging, evidenced by the strong top line performance of our core portfolio, growing net sales 9% from the prior year and 8% from the first quarter. While there is significant uncertainty in the global macroeconomic environment, demand for core CommScope products and solutions remain resilient in the second quarter as backlog grew 5% from the first quarter, ending at approximately $3.8 billion. That said, we expect second half OWN adjusted EBITDA margins to be above the second half of last year and first half of this year, driven by price recovery to offset inflation and operating efficiencies. For the second quarter, consolidated CommScope reported net sales of $2.3 billion, an increase of 5% from the prior year, driven by growth in our CCS and OWN segments and offset by declines in NICS, ANS and Home. Adjusted EBITDA of $300 million declined 3% as a result of input cost inflation an unfavorable mix, offsetting another quarter of strong top line growth. Starting with CCS, net sales of $987 million increased 26% from the prior year and across all businesses, driven by another quarter of strength in fiber. As noted, we expect continued margin improvement in our CCS business through the balance of the year as price increases continue to work through backlog and the business drives operating leverage in our manufacturing plants as capacity ramps. NICS adjusted EBITDA of negative $15 million declined by approximately $20 million from the prior year, driven by lower volumes related to chip shortages, higher input costs driven by inflation and our continued investment in RUCKUS and ONECELL. While ANS was also supply constrained during the quarter, looking forward, we expect through a combination of increasing material flow, internal production ramping and project timing, the business should deliver a stronger second half compared to the first of this year. I guess just to start off, I mean, you're reiterating the full year guide today and you had a strong quarter and expecting an improvement in profitability in the back half but that's unchanged kind for the full year does still leave engine in terms of outcomes for the second half. So I think as we think about that first wave of capacity, think about it as we're probably about 2/3 of the way of having that stuff online and the rest will come on in the second half of the year and then we'll be in a position to think about what the next investment is."
}