{
    "symbol": "COMM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 21:00:04",
    "content": " 02:48 Although the environment remains challenged, including COVID challenges in China, based on current visibility, we maintain the expectation to deliver core adjusted EBITDA in the range of $1.15 billion to $1.25 billion for the full-year in 2022. For consolidated CommScope, which includes our Home Networks business, we reported net sales of $2.23 billion, up 8% and adjusted EBITDA of $253 million, down 13%. And to round out consolidated CommScope, Home Network net sales of $496 million were essentially flat to the prior year, and adjusted EBITDA improved 20% or by $4 million. For the first quarter, consolidated CommScope reported net sales of $2.23 billion, an increase of 8% from the prior year, driven by growth in our CCS and OWM segments. For core CommScope, net sales of $1.73 billion grew over 10% from the prior year and adjusted EBITDA of $230 million declined 15%. 15:29 Turning now to our segment highlights on Slide seven, starting with CCS, net sales of $838 million increased 24% from the prior year, with particular strength in network cabling and connectivity. 18:06 Demand remains very strong in NICS as we ended the first quarter with a backlog of $675 million, an increase of 22% from the end of last year. ANS adjusted EBITDA of $74 million, declined 31%, primarily driven by the mix and timing factors Chuck discussed earlier, which essentially represent a shift in our customer spending towards more hardware-centric and lower-margin products like our nodes and amplifiers. Although our external environment remains challenged with issues such as chip supply, inflation, and COVID lockdowns in China, we maintain our expectation for the core business to deliver 2022 adjusted EBITDA in the range of $1.15 billion to $1.25 billion. 22:07 We expect modest sequential improvement of core net sales and adjusted EBITDA in the second quarter and much stronger improvement in the second half as we see the full impact of our price increases, project-related orders, improved supply position, and capacity expansions. As we shared with you during our December transformation update and on this morning's call, despite challenges in supply, constraints and inflation, we maintain our expectation to deliver on full-year 2022 adjusted EBITDA targets and margin improvement as we progress towards our overall CommScope NEXT transformation goal, exiting the end of 2023 at a run rate of $1.6 billion of core adjusted EBITDA."
}