{
    "symbol": "OTEX",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-02 22:19:11",
    "content": " OpenText had a truly superb Q2, achieving overall constant currency revenue growth of 7.8%, which reflects very strong cloud revenue growth of 16%, excellent renewals performance and continued focus on efficiency with 37.7% adjusted EBITDA margin, even as many of our team members also worked very hard to prepare for the close and integration of Micro Focus. In addition, you'll hear today that we're on a path to deliver $6 billion in annual revenues, a $2 billion cloud revenue business and over $2 billion in adjusted EBITDA dollars with upper quartile free cash flows based on the trust of our customers. We delivered $945 million in total revenues or 7.8% growth, $423 million of cloud revenues or 16% growth, and with Micro Focus, our cloud revenues are going to approach $2 billion a year. Adjusted EBITDA dollars between $2.1 billion to $2.24 billion or between 36% to 38%, approximately $800 million to $900 million of reported free cash flow. A reinvestment strategy for growth with customer-informed R&D and sales and marketing, building a digital business that removes cost, improves productivity via higher automation, upper quartile adjusted EBITDA margins, strong free cash flow with a yield of 20% plus our capital allocation plan, as I previously noted, and continued acquisitions. As you can see, the margin target for the combined company are at 36% to 38% for fiscal 2024 and a solid $2 billion plus in adjusted EBITDA dollars. You will notice our targets of $500 million to $600 million for fiscal 2023 and $800 million to $900 million for fiscal 2024, and a rapid growth trajectory to $1.5 billion in fiscal 2026. We expect revenue of $1.18 billion to $1.22 billion, inclusive of $310 million to $325 million of Micro Focus revenues; ARR of $0.96 billion, to $1 billion, inclusive of $245 million to $260 million of Micro Focus revenues. Our exchange rates being forecasted, FX would be a headwind of $30 million to $35 million, adjusted EBITDA on a year-over-year basis, margin percentage down 600 to 700 basis points, reflecting Micro Focus integration costs. We expect cloud revenue to be 35% to 37% of total revenue, ARR to be 82% to 84%, our license revenue 9% to 11%, non-GAAP gross margin of 74% to 76%, R&D of 17% to 19%, and sales and marketing of 21% to 23%, G&A of 9% to 11%; total operating expenses 52% to 54%, interest expense of $115 million to $125 million. Our fiscal 2026 aspirations of 38% to 40% adjusted EBITDA and free cash flow of $1.5 billion plus, they fully reflect continued OpenText growth, particularly cloud growth and return to organic growth by Micro Focus, completion of the cost reduction program and the integration program with its related investments. And in our F '24 plan, we're looking to deliver $5.75 billion to $5.8 billion in total revenues, $2.1 billion to $2.24 billion in adjusted EBITDA and up to $900 million of free cash flow. It's the same preannouncement as it is today, and we have the confidence to present to you today our F '24 plan of $2.2 billion to $2.24 billion in adjusted EBITDA, 15% Enterprise Cloud bookings growth and revenue is up to $5.8 billion."
}