{
    "symbol": "DYNT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-12 08:19:04",
    "content": " Three key takeaways for our first quarter: one, we continue to execute against our differentiated strategy, which has led to an increase of 6.8 percentage points in gross margin from Q4 of fiscal year â\u0080\u009822, which has now grown to 30.2% in the current quarter. Second, our first quarter net sales represents the sixth consecutive quarter of exceeding our baseline sales expectation and represents a 1.7% increase from prior year after the exclusion of $0.5 million of discontinued product net sales disclosed in the prior quarter. Selling, general and administrative expenses increased 21,000 or 0.5% to $4.11 million for the quarter ended September 30, 2022, compared to $4.09 million for the quarter ended September 30, 2021. Turning to Slide 4, we will continue to provide guidance on metrics that we are confident with and we are affirming our expectation of net sales in fiscal year â\u0080\u009823 to be in the range of $45.0 million to $48.0 million. The company expects the distribution of net sales in fiscal year â\u0080\u009823 across the quarters to align with historical trends, highest in the first quarter, lower in the second and third quarters with a bounce back in the fourth quarter. Net sales are expected to be in the range of $45.0 million to $48.0 million, the midpoint of this range, $46.5 million represents 5% organic revenue growth. We expect that the changes we have made to deliver higher annual net sales, higher annual gross margin, operating income and cash flow from operations as we move through fiscal year â\u0080\u009823. We have delivered sales growth for six consecutive quarters, well above market growth and grown our $9.25 million continued product sales baseline set in April 2021. First, congrats on the margins less than 30% and it looks like your Slide 6, youâ\u0080\u0099re targeting $30 million to $35 million for the full year."
}