{
    "symbol": "SPOT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 20:33:02",
    "content": " So if you recall, at our Investor Day in June, I said that I suspect many of you think Spotify is a great product, yet at the same time, you may also think that we're a bad business or at least a business with bad margins for the foreseeable future. And as Paul said, on the structural side, on podcasting, we believe that to long term be a much higher gross margin business than the one we're currently in the music, simply because the way to mimic that would be to look at platform type of businesses that usually end up having a higher gross margin than normal services. And then last point I would just add is to say that structurally, as the revenue mix shifts to more and more nonmusic content, so both podcasting but also audiobooks, et cetera, those gross margins in those categories is going to be significantly higher than the ones we've had in the music business, too. And in a way, I actually think about that -- if you want an analogy, there's probably healthy ones on the B2B business sides, where the hard thing was to get distribution and get the customers in the door, but then a Salesforce or someone else then kept adding more and more products to leverage that existing distribution channel that they've built. So when you look at what we've reported, obviously, any -- we talked about overall gross margins, but any of the overall weakness or softness in Q3 on the ads -- the revenue side is going to impact the ads business from a gross margin perspective, and they won't hit the Premium side. So when you think about our product road map, I would suspect that when you compare that to some of the other platform companies, they probably have to realign and redo quite a lot of their product road maps based on the headwinds that they're seeing because it's just pretty material for them, whereas for us, this is a much smaller part of our business. But as I said a couple of times, I think you can expect that dynamic of revenue growth and expense growth to flip from where it's been over the past couple of years and start to see that focus shift in sort of how we manage the business. And my only addition to that is, as we said at Investor Day, we were expecting margins to improve in 2023, and that's obviously a function of us growing revenue faster than we're growing content cost."
}