{
    "symbol": "SPOT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 12:06:04",
    "content": " At this time, I would like to welcome everyone to Spotifyâ\u0080\u0099s Second Quarter 2022 Earnings Call and Webcast. I would now like to turn the call over to Bryan Goldberg, Head of Investor Relations. Thanks, operator and welcome to Spotifyâ\u0080\u0099s second quarter 2022 earnings conference call. Joining us today will be Daniel Ek, our CEO; and Paul Vogel, our CFO. And afterwards, we will be happy to answer your questions. Questions can be submitted by going to slido.com, slido.com and using the code #SpotifyEarningsQ222. And to the extent you have got follow-ups, we will be happy to address them, time permitting. If for some reason, you donâ\u0080\u0099t have access to Slido, you can e-mail Investor Relations at ir@spotify.com and we will add in your question. During this call, we will be making certain forward-looking statements, including projections or estimates about the future performance of the company. Actual results could materially differ because of factors discussed on todayâ\u0080\u0099s call, in our shareholder deck and in filings with the Securities and Exchange Commission. During this call, we will also refer to certain non-IFRS financial measures. Reconciliations between our IFRS and non-IFRS financial measures can be found in our shareholder deck, in the Financials section of our Investor Relations website and also furnished today on Form 6-K. And with that, I will turn it over to Daniel. Hey, everyone and thank you for joining us. Because as I mentioned on our Investor Day, we want to improve how we communicate with you. And with that, letâ\u0080\u0099s jump into the quarter. And we had a very strong beat on MAU growth, coming in about 5 million users ahead of forecast. As a reminder, this was one of the weak spots for us in Q2 of 2021, so I am really glad to see the hard work from our teams has paid off. In addition, our global subscriber growth exceeded expectations by 1 million, while revenue was in line. Going forward, while the macro environment continues to present uncertainty, we are currently not seeing any material impact on our expectations for users or subs growth from the economic downturn. In fact, we are seeing several markets trending ahead of our forecasts. That said, in anticipation of a potential slowdown, we already shared that we proactively reduced our hiring by 25% and instituted a double-down weekly revenue monitoring. I have said this before, I do believe only the paranoid survive, and we are preparing as if things could get worse, but itâ\u0080\u0099s hard to be anything but optimistic given what I am currently seeing. Looking further ahead, recession or not, my confidence in our business and the unique Spotify machine that we are building is really unwavering. Hopefully, after last monthâ\u0080\u0099s Investor Day, this is a term you are all familiar with. And for those needing a refresher, we believe the Spotify machine is what differentiates us from other tech platforms. It leverages one consumer experience, powered by three revenue-generating business models: subscriptions, ads and marketplace. And as I detailed last month, we are confident in our ambitions to get to 1 billion users by 2030, while at the same time, we are also focused on improving our gross margins and continuing to generate positive free cash flow. Not only will this investment benefit Spotify and its shareholder, but it also creates tremendous upside for listeners, artists, songwriters, creators and advertisers. And for those who want to learn more, Iâ\u0080\u0099d really encourage you to go to our investor site to capture a replay of our recent event. We highlight the big bets we are making, the incredible opportunity on the horizon and detail how we are measuring success. And with that, I will hand it over to Paul to go deeper into the numbers and then Bryan will open it up to the Q&A. Thanks, Daniel and thanks everyone for joining us. As Daniel mentioned, we have moved away from our shareholder letter, transitioning to a slide-based presentation. And now turning to the quarter, Iâ\u0080\u0099d like to add a bit more color on our strong operating performance and what we are seeing with respect to the macro environment and a touch upon our outlook. This result was 5 million ahead of our guidance and was the largest Q2 net additions in our history after adjusting for our exit from Russia and the March outage, which we discussed prior. Moving to premium, we finished the quarter with 188 million subscribers, 1 million ahead of guidance, thanks in part to broad-based strength across regions, particularly in Europe and Latin America, where upside was helped by an extra week of promotional activity and traction in our multi-user products like Family Plan and Duo. Revenue finished ahead of guidance, which was helped by currency movements and we saw another strong quarter in advertising, which grew 31% year-on-year. With respect to gross margin, on a reported basis, Q2 finished below guidance, but gross margin was modestly ahead of our expectations when adjusting for one-time charge related to our decision to stop manufacturing Car Thing as well as the positive net royalty impact we saw from prior period accrual adjustments. So, looking specifically at Car Thing, our decision to stop manufacturing the device was made based on a few factors. First, we tested a number of price points and we frankly havenâ\u0080\u0099t seen the volume at the higher prices that would make the current product financially viable. Second, rising inflation and component costs, coupled with the expanded lead time needed to order parts, has significantly altered the risk reward of continuing to lean into further product development. Our decision resulted in a one-time charge of $31 million, impacting gross margin by 109 basis points in this quarter. As we discussed during our recent Investor Day, much of our operating expense growth we saw in Q2 was a result of decisions we made through the end of 2021, mainly to expand our global sales team, invest in our platform and increase marketing to drive user growth. We have also added incremental cost associated with our acquisitions of Podsights, Chartable and Whooshkaa. And lastly, while we did forecast higher growth, a significant portion of our operating expenses are in U.S. dollar denominated and foreign exchange foreign exchange movements added nearly 1,000 basis points of growth in expenses and this was more than expected. And despite the increase in operating expense, we generated our ninth straight quarter of positive free cash flow. And we are looking at our free cash flow growth on a trailing 12-month basis, which smooths out seasonality, it shows a very consistent trend. So, looking at Q3 and beyond, as Daniel said, we continue to monitor the global macro outlook, but to-date, have seen no real impact on our user or subscriber outlook. Specifically, we expect to see another quarter of accelerating MAU net adds and expect subscriber net additions similar to Q3 of last year. On the premium side, which is still the majority of our revenue, we expect ARPU to be up in the mid single-digits. And for advertising, we did see some softening in trends over the last 2 weeks of June, but with that as context, we still expect solid growth in Q3, albeit slower than we might have forecast earlier in the year. Our gross margin outlook of 25.2% for Q3 is in line with our full year commentary and reflects our expectation for continued core operating improvements across our music and podcasting business, offset by select growth initiatives. We anticipate elevated operating expense growth consistent with Q2â\u0080\u0099s run-rate for the next few quarters, with the benefits of our previously announced 25% slowdown in new headcount additions, showing up later in the year. In closing, despite an uncertain macroeconomic environment, we continue to be highly encouraged by the trends we have seen year-to-date. And with that, I will hand things back over to Bryan for Q&A. So, in general, really positive trends, so we still know â\u0080\u0093 we havenâ\u0080\u0099t seen any change at all in the trajectory of gross intake or churn. But I can tell you, churn was in line with expectations and down on a year-over-year basis. And the extra week, it definitely helped a little bit in the quarter. I would say some of the outperformance came from the extra week, but not all of it, but we see that carrying through into Q3. And so the Q3 number, the expected growth in Q3 is the same that we thought heading into Q3 as it is heading into â\u0080\u0093 sorry, heading into Q2 as it is heading into Q3. So, the outperformance was strong in Q2 and we also see strong growth in Q3 as well. I would just really kind of say itâ\u0080\u0099s early days on experimentation on our Live initiatives, both the sort of physical and digital ones. Obviously, itâ\u0080\u0099s been hard to do that with physical live events, but we did a bunch of them on the digital side. I think the reality is much of those learnings are inconclusive, because much of the world that we are in now, in a sort of post-pandemic world, if you can call it that, is just very different from the experiences that people were willing to pay for and experience during the pandemic. So there, you see a great bunch of everything from live shopping to formats, where you see NFTs, you see consumers wanting to participate in the live stream with their favorite creators. Thatâ\u0080\u0099s where we are looking at for inspiration, but itâ\u0080\u0099s not something that you should expect to be a rapid improvement in the near quarters, but this is a multiyear effort from us. At your Investor Day, you talked about new categories, having closed on your audio books acquisition. So, happy to do that integration work now and starting to work with the team. So think sort of coming â\u0080\u0093 early coming months, coming weeks, something to the market and then rapidly improve and iterate upon that proposition. And itâ\u0080\u0099s really kind of first half of â\u0080\u009823 to second half of â\u0080\u009823, you start seeing some of our work in some of the other categories that we are doing as well, but there is nothing that I can announce at this point about what those will be or what kind of investments we are doing in those categories at this moment. So Iâ\u0080\u0099d say if you take a step back and look at advertising in general, I think there is a number of factors that we think will grow the ads business. I think for us, we are focused on a couple of things. So, one of the best ways to actually get increased inventory is to increase engagement. So we are constantly improving and testing products within the free offering and you will continue to see more innovation on the free side to drive more usage and more engagement, because we think thatâ\u0080\u0099s actually the best way to increase impressions, is actually to have people come back more often and to actually see both the engagement up and the DAU to MAU ratio improve from that stand. So, thatâ\u0080\u0099s a little bit of what you saw in the positive accruals that we accounted for in Q2. And there will be a minor small benefit to gross margin moving forward, but itâ\u0080\u0099s pretty minor. So for the most part, the ruling has pretty minimal impact on our numbers or our forecasts. And then with respect to advertising and podcast not being experimental, I mean, I will start, I donâ\u0080\u0099t know if Daniel have any comments on this. We have seen strong â\u0080\u0093 continued strong growth on the podcasting side, significant year-over-year growth. Again, we are seeing increased number of advertisers, increased demand. Itâ\u0080\u0099s always tough to know, but we are really encouraged with the trajectory and the year-over-year growth we saw again in Q2. My only addition is, if you think about it broader and not just around podcasting, but think about audio more as a category, one of the very unique things about audio and the properties around audio is really how differentiated it is from all the other media thatâ\u0080\u0099s out there. So, to take that into consideration, there is no other media format that can reach consumers in the car. The car is a massive use case, and particularly in North America. Similarly, when you think about â\u0080\u0093 as people are walking around outside, more and more of us with our headphones and earbuds in, there is a huge opportunity in local advertising, too. So as you think about it from a structural standpoint, I think itâ\u0080\u0099s â\u0080\u0093 and more from a principal standpoint, I think itâ\u0080\u0099s kind of obvious that audio and audio advertising is going to be a massive sort of category in and on itself because it reaches people at times where no other mediums reach them and they have certain properties that other mediums donâ\u0080\u0099t have. And then you have, in addition to that, lots of qualitative factors that people â\u0080\u0093 when you see host-read ads, when you see it adjacent to the first-party data about the topics that weâ\u0080\u0099re seeing people engage with, youâ\u0080\u0099re seeing great response for advertisers in addition to that. And so we are seeing despite a very higher macro environment, advertisers take up to the format really, really well. But the retention of the advertisers that we have is also going up, and that clearly shows that the format is working for them. Next question from Rich Greenfield, you are generating cash and youâ\u0080\u0099re sitting on nearly $3 billion of cash on the balance sheet. I mean, not surprisingly, we talk about cash and capital allocation all the time. Given the uncertainty, on the one hand, and also given some of the acquisitions we made and the pipeline weâ\u0080\u0099ve had, our new was coming from an acquisition, weâ\u0080\u0099ve been comfortable with the cash weâ\u0080\u0099ve had on hand. And obviously, with interest rates rising and some of the uncertainty, itâ\u0080\u0099s always safer to have a little more cash on hand and not ever need to have to go back to the market for anything we wanted to do, either internal investments, which, obviously, weâ\u0080\u0099re making a lot, or continued M&A, which weâ\u0080\u0099ve done as well. My only addition to that would be, if you think about it, there is three ways we can utilize our cash. The second is to do share buybacks and the third is to do dividends, in that order. Every now and then, we see more opportunities to continue to invest in the business than we do in share buybacks or dividends. And so for all of those reasons, weâ\u0080\u0099re investing in the business. And we feel really good about it, with the expansion of the formats that weâ\u0080\u0099re going into, with the podcast investments weâ\u0080\u0099ve been making, etcetera. So I think the primary thing, and we said this before, is that â\u0080\u0093 and we talked a little bit about this during our Investor Day, too. And then in addition to that, you mentioned some sort of one-time events that typically are very strong for ad businesses, like elections and sporting events, etcetera, those are obviously going to be impactful for Spotify, too. But I think in essence, itâ\u0080\u0099s really about increasing the inventory available for advertisers and increasing the targeting so that they can drive even better results. No, just to sort of touch on these specific questions, I think a lot of the investments weâ\u0080\u0099re making, international will really bear fruit in 2023, maybe some of the tail end of this year, but definitely more from that standpoint. Actually, at this point, we honestly donâ\u0080\u0099t know. And as Daniel said, I think on the measurement side, thatâ\u0080\u0099s definitely been a help, and we will continue to lean into improving, measurement and tracking and attribution and all the things that advertisers are looking for. Historically, weâ\u0080\u0099ve seen operating income dollars improve sequentially from the second quarter to the third quarter. I mean, for starters, itâ\u0080\u0099s hard to not include FX. And so just to sort of refresh, and most people know this, but we report in euro, and pretty much every currency that we operate in, particularly the U.S. dollar, has appreciated relative to the euro. We have got â\u0080\u0093 if you look at revenue and gross margin, they are fairly matched up from a revenue and cost perspective. Outside of that, itâ\u0080\u0099s kind of the same things I mentioned. We had already planned over â\u0080\u0093 probably 6 months ago to continue to grow that â\u0080\u0093 our global sales force and as well as increase marketing to grow users, particularly in some of our newer markets. Next question from Justin Patterson, on subscriber conversion opportunities, Daniel, MAU growth in the rest of the world continues to be a bright spot, but sub conversion is still in the early innings. So I think the first piece of context, I just want to give everyone because I think itâ\u0080\u0099s very important, is what generally happens is what we call the bandwagon effect at Spotify. And one likes to believe that there is a one-to-one analogists part where both of these two trends have been linear, of user growth and then subscriber growth. So in some points of the Spotify history, we focus more on user growth, and some point â\u0080\u0093 part of the history, we focused more on conversion, because that became a bigger priority. But the trend line that weâ\u0080\u0099ve seen now, as indicated since really our launch in 2008 is once we go through these growth spurts in MAU, it always, always leads to better subscriber numbers over time. So I look at this as â\u0080\u0093 I donâ\u0080\u0099t know what the specific pricing and plans will be, if it might even be a more of a marketing challenge in some of these markets, etcetera. But I think the general recipe is, the team has been very much focused for the past year in growing users. And Iâ\u0080\u0099m very, very pleased with the results weâ\u0080\u0099re seeing of that effort, as you can see about the reacceleration of MAUs. At our scale, to reaccelerate MAUs, itâ\u0080\u0099s very, very difficult to do, and itâ\u0080\u0099s not very many platforms that do that. And we are very, very positive over the impact that, that will have for the remainder of the year, as you can see in our guidance, too. And thatâ\u0080\u0099s what the team will be working on now, too. If history is any indicator of the future, what will happen is, roughly a year from now, youâ\u0080\u0099ll start seeing probably an acceleration in subscriber growth as evident from that. I believe thatâ\u0080\u0099s whatâ\u0080\u0099s going to happen now, too. So as a general reminder, one of the reasons why weâ\u0080\u0099re so excited about the Barcelona partnerships is just really around the impact the club has around the world, in particular, in LatAm, but in Southeast Asia, our number one growth markets that we have, but also, in particular, with the younger audiences, Gen Zs that the club has. So a good framing for investors will probably be to look at this as, this gives us a tremendous amount of exposure organically to a customer base thatâ\u0080\u0099s notoriously difficult to market towards in many markets, which is very, very hard to reach them in. I would just highly recommend you to go to both Instagram and YouTube and all, TikTok and all these channels and subscribe to the FC Barcelona social channels and see the amount of content that they are putting out now, thatâ\u0080\u0099s jointly with the Spotify team, where music and soccer/football is coming to life. So, so far, so good, but the expectation you should have is not that this will come into fruition in the second half of this year. Doubling down on what worked, stopped doing what didnâ\u0080\u0099t work and itâ\u0080\u0099s trial and error. The most important thing is we have a very, very great partnership team from our side, and we have a great partnership team from the Barcelona side that are focused on delivering results. And yes, itâ\u0080\u0099s early innings. But if this proves out to be right, you should see it as being probably the most efficient channel that we can reach Gen Z in LatAm and Southeast Asia. And Paul, I donâ\u0080\u0099t know if you want to talk about the specifics around the OpEx. First, in general, I will just echo what Daniel said. If you guys donâ\u0080\u0099t know, Barcelona is out playing a bunch of friendlies in the U.S. The combination of athletes love musicians and musicians love athletes, and the mutual love we have seen on social media has been pretty fun to watch. So, thatâ\u0080\u0099s actually been great. And as Daniel mentioned, many of them in Latin America and emerging markets, and places where our next real phase of growth is going to be. And then from an OpEx standpoint, we have absorbed, I would say, probably about 80% of the incremental costs. So, that is a little bit of the marketing spend in the back half of the year as some of the costs related to that. And then again, as we get into 2023, we will be able to sort of cycle through. And as Daniel said, we will be reallocating some marketing dollars to sort of fully cover the incrementality of Barcelona. Next question from Steven Cahall on gross margin, the vast majority of your gross profit comes from premium subscribers. And actually, conveniently, thereâ\u0080\u0099s a follow-up from Steven Cahall in the queue. On premium â\u0080\u0093 on pricing, premium ARPU reportedly benefited from price increases in the quarter. I will start, and if Daniel has any comments. So, first, just on churn, in general, we have seen no impact in churn. And we have talked about that over the last couple of quarters, that we saw no material change in churn relative to any of our price increases. And just in general, just as a macro question, which I think we addressed earlier, but we havenâ\u0080\u0099t seen any impact at all in churn, either with respect to some of the questions we are getting about the macro uncertainty. So, the churn levels have been right in line with expectations. And as I said, our core churn been â\u0080\u0093 was down year-on-year in Q2 versus Q2 of last year. And then on price increases, we obviously arenâ\u0080\u0099t commenting on anything. That being said, there is a lot of macro uncertainty. So, I donâ\u0080\u0099t know, Daniel, if you have anything to add to that. I would just say, we feel really confident in our ability, of the value that we are providing to consumers and that over time, we should be able to translate that value into price increases. But given the macro uncertainty in the marketplace, we are obviously going to be very careful before making any such moves. So, long-term, we definitely believe we have pricing power, short-term, obviously very concerned about the uncertainty in the marketplace, and we are going to evaluate that uncertainty into any decisions we make. I mean look, I think itâ\u0080\u0099s a couple of things. I think one is, if you look at the acquisitions we have made, those have been geared towards bringing more measurement, more attribution, more personalization for advertisers, so that the value that they get on Spotify is higher, which will bring more people into SPAN and more people want to put their inventory into SPAN. So, itâ\u0080\u0099s really about, I guess kind of the obvious, which is continuing to build out the ad tech, the ad stack, both through our own internal development as well as some of the acquisitions we have made, integrating those in and then offering those up to a wider way of advertisers. We are going to continue to increase and build out our self-serve tools, which will bring in more small and midsized advertisers. And so all of that will go towards bringing in both more publishers to opt-in and the more advertisers, who can both effectively and easily advertise on Spotify. I would just probably add, if you think about it, itâ\u0080\u0099s a trifecta of three things. So, itâ\u0080\u0099s â\u0080\u0093 the trifecta, what us as a platform can contribute, itâ\u0080\u0099s the number of advertisers and the number of publishers. So, what we can add to the table is obviously all the things that Paul talked about better data, better targeting abilities, better formats. And if there is enough advertisers, it should also means the publishers are getting a better deal. But in addition to that, we also have a pretty sizable ad sales team now, which help cover a lot of advertisers and publishers relationships in many markets around the world. And thatâ\u0080\u0099s something that we tend to always underestimate, but itâ\u0080\u0099s a very powerful thing. Like on the audio network side, there is no platform that can truly get to this scale in as many markets as Spotify does. So, when you are a publisher and if â\u0080\u0093 letâ\u0080\u0099s say, you have audience in many more markets, I just donâ\u0080\u0099t see any alternative to Spotify, because, frankly speaking, we have more data to bring to the table. So, advertisers are getting better value. And because we have our sales force in many markets, we can also help sell their inventory in many more markets than say they could do on their own or even through a much smaller reseller of their inventory. So, bar sort of host-read ads, which are perhaps more sort of unique and novel in their delivery, on scale, Spotify should win with all the advantages that we bring to bear. And those are kind of the similar talking points on SPAN 2, because even though they are off platform, we can still leverage a lot of what we know around our audience and our sales force and what we know around advertisers as well, and bring that to bear for people off the platform, too. I will start and then maybe, Paul, you can add. Obviously, naturally so, when you think about the TAM, the emerging market or rest of world is obviously far greater in future potential than the existing markets. So, the way I think about it is, if you create a mental model, the near, mid and long-term, and then think about sort of developed and developing or rest of world, and then you think about sort of growth in users and growth in revenue, I think you would see most in the near to mid-term, most of the user growth should come from more of the emerging markets than not. But given what we talked about during our Investor Day, we think more of our revenue story in the near to mid-term should come from our already developing markets â\u0080\u0093 sorry, developed markets. And the great story there is that we believe we can up-sell more of these into podcasting, which means more people will spend more time, and then subsequently, audio books, which also means that they will spend more time and increase our revenue opportunities there, too. And then overall, on the platform growth side, we think, obviously, more of the user growth should come from emerging markets where they are more mid to long-term in terms of monetization opportunities. So, it is true that developed markets were slowing down. And then on the emerging markets side, we have probably more work to do on the monetization side, and that will take a little bit longer, but thatâ\u0080\u0099s the mid to long-term story. I will start, and then Paul maybe can add. So, we are obviously super early in the integration efforts with Findaway, and we are still trying to create any plans. But just like you should imagine, and as we have talked about before, you should imagine us to start experimenting, getting this up and live. If we are seeing great results, we will double down on that investment. And that might, in turn, obviously, impact OpEx. However, the gross margin considerations for this vertical will be substantially different than other verticals, and that should be positive to us. And the only thing I would add is, I think Daniel mentioned that with Findaway, having closed, our expectation is that the first iteration of audio books will occur in Q3. And so you can assume that there has been some of the OpEx that we have talked about has gone to making sure that we have been building up the resources, that potential to quickly integrate Findaway. And then again, as it ramps, we will give you more guidance as we get closer to 2023 when we give that guidance. We have got time for one more question, and thatâ\u0080\u0099s going to come from Doug Anmuth on net additions. So, letâ\u0080\u0099s start with MAU first. I think as you have seen both now through Q2 and then our guidance for Q3, we are pacing pretty well for MAU through the â\u0080\u0093 for the year. And while we arenâ\u0080\u0099t giving Q4 guidance, you can â\u0080\u0093 the numbers would definitely imply that we are on pace to do kind of similar to or better than that for 2022 on the MAU side. And on the sub-side, we have done really well on subs as well. There is â\u0080\u0093 when you kind of think about those numbers, there are some moving parts with respect to pulling out Russia as well as some of the expected growth we had in Russia for 2022 as well. So, on the sub-side, I would say, yes, kind of, I would say, roughly similar types of growth when you kind of normalize for the Russia stuff. On the MAU side, we definitely look like we are kind of on pace to do a little bit better than what I said already. So, thatâ\u0080\u0099s going to conclude our Q&A session on todayâ\u0080\u0099s call. Well, thank you, everyone, for joining the call. And hopefully, this quarter was just great testament to all of that. So, thank you everyone for joining. So, thanks everyone for joining."
}