{
    "symbol": "EXPI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 20:12:04",
    "content": " We're doing that through what we're referring -- what's referred to as segmenting, and one of the reasons why I did that is because of the challenging market, we wanted to show to our agents, staff shareholders, and others that at scale eXp Realty is, as we've said for a long time, we believed it would be profitable in good times and bad times. Because of that backdrop, we've been able to scale to really tens of thousands of agents and hundreds of millions of dollars, actually billions of dollars in revenue, in North America within really a fairly short period of time without much in the way of competition. To drive the next phase of eXp's growth, we're actually really and one of the reasons why I came back as CEO of eXp Realty was to really continue our focus on the agent-centric nature of the real estate brokerage, leveraging our scale with the ultimate goal being the number one worldwide real estate brokerage and brand, and we've done a great job so far. In fact, we've made a shift, which Jeff will talk to in a little bit, in terms of how we're thinking about it in terms of the financial management side because we believe that now is the time to actually grow in a down market, now that we've actually broken out these segments, and you can see that we actually have a scalable profitable model at scale in North America. And then we've also continued to build out eXp Realty's website and web presence and we've got some cool innovations that we're going to be talking about not today, but very shortly, which is going to give agents a significant advantage in relation to the company-owned website for leads and for agents. In his most recent book, which I've also shared with the entire management team and the Board, Winning on Purpose, he introduced a concept called earned revenue growth or earned growth rate, and that's a really important concept because what it does is it breaks down for long-term shareholders why the most important metric that you want to be measuring is what is -- what do customers feel about the differentiated product or service offering that a company provides. And so, we've really focused on it, and what I believe that it really does, from my perspective, is it helps us teach the organization at scale to actually think like a small company founder who's focused really closely on the customer and getting close to, in our case, the agent, and understanding that they are the ones that ultimately we're building it for. We have -- this is the first time we're actually breaking it out, but I've talked about it several times throughout the year is that we're very, very fortunate in our business, to have the North American business really driving growth and profitability that allows us to invest not only in North America but international and in our technologies. But I think the idea is that we are -- as long as we're focused on building a really great agent value proposition, we don't take our eye off that ball, and we continue to work on what do we need to do to do better by our agents then eventually we'll get there."
}