{
    "symbol": "EXPI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 16:24:04",
    "content": " In some countries, we actually have a lot of ability to create aligned interest with our agents in the U.S. Itâ\u0080\u0099s a little bit tougher to do affiliate services, mainly just because of sort of the way the RESPA laws work, but weâ\u0080\u0099re still working on building a really cool platform for them. We have grown from $500 million in revenue in 2018 with 15,000 agents, $3.7 billion in revenue year-to-date 2022 with plus 85,000 agents and as Glenn mentioned, as we started the conversation today, although there will clearly be challenges in our economy in the short-term, we believe we have a long road of material growth opportunities ahead of us at EXPI and remain confident in our ability to gain market share over the long-term. So thereâ\u0080\u0099s opportunity in that area and thatâ\u0080\u0099s where a lot of the current savings is going to come from â\u0080\u0093 weâ\u0080\u0099re also looking around our business as we do on a continual basis and look at our business units to see what makes sense from an investment standpoint and whatâ\u0080\u0099s changing, right, and shifting resources I think that thereâ\u0080\u0099s a tremendous amount of opportunity for us from a productivity standpoint. I think weâ\u0080\u0099re actually investing in other â\u0080\u0093 I think there was a little bit of a cash call, just a small one, about $0.5 million and I think itâ\u0080\u0099s our first cash call in that, but itâ\u0080\u0099s just because the market has slowed more dramatically than we had anticipated when we launched this in 2021. So I think weâ\u0080\u0099re looking at is we are in a market thatâ\u0080\u0099s dramatically slowing and â\u0080\u0093 but weâ\u0080\u0099re able to â\u0080\u0093 because weâ\u0080\u0099re actually forming these businesses in a down market, weâ\u0080\u0099re actually better positioned to build out the infrastructure or when the market gets back to normal, weâ\u0080\u0099re â\u0080\u0093 I actually think weâ\u0080\u0099re growing it at exactly the right time because itâ\u0080\u0099s actually tougher to grow in some respects in an upmarket because loan officers, theyâ\u0080\u0099re doing a lot of business. And so weâ\u0080\u0099re â\u0080\u0093 that opportunity might be a little bit too big for us to completely match today but we believe that thereâ\u0080\u0099s lots of those opportunities that weâ\u0080\u0099ll be able to go in with build a coaching curriculum training relative to the goals that, that organization has and be able to bring a number of already pre-vetted SUCCESS certified coaches to that. And what weâ\u0080\u0099re having right now as weâ\u0080\u0099re having this large amount of churn, especially in that low production category of agents, but weâ\u0080\u0099re also starting to really see agents that are higher producing taking a serious look at eXp, and they could be doing 4, 5, $800 million a year of historical production, say, 2021, 2022 might be down for them, too. Weâ\u0080\u0099re going into â\u0080\u0093 weâ\u0080\u0099re in November, December and January, and those brokerages will be feeling a lot of pressure financially, I suspect that weâ\u0080\u0099re going to see a number of broker owners and we saw this in the 2008, 2009 period 2007, where weâ\u0080\u0099re going to see a lot of broker owners that, unfortunately, will have to declare bankruptcy just because the economy from their perspective and the way that they run their brokerage and no fault to them it just is the economics for them do not work in a down market, and thatâ\u0080\u0099s where we find ourselves."
}