{
    "symbol": "EXPI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 15:38:01",
    "content": " I think the other piece and certainly as we look at what took place in eXp, we definitely saw, us start to retrench based on the market, we introduced some new education around what we're calling level up, we've got internal external outreach, something to note, that's not even part of Q2, but we'll be part of Q3 is we have the largest agent run event in the entire industry is going to actually take place this month in Dallas. So we're still seeing a lot of agents looking to join, a lot of agents exposing the business model to other agents, we're supporting them with a lot of technology and tools, we've got some cool things, we'll be announcing in the next month or so around a marketing suite, which we're excited about. And so you look at the fact that personal development coaching has about a $20 billion a year TAM with some good profit margins, we're actually pretty excited about the fact that we are really in a position to be actually making money in SUCCESS and starting to actually grow into that business, we introduced a new coaching model, we did that actually at shareholders, so anybody who attended there, got to hear a little bit about that. So we've had a number of great strategic conversations and meetings to create alignment to expand Zoocasa across most of Canada and starting to expand in the U.S., starting to get leads into the hands of agents and other markets outside of their primary market of Toronto, Canada, and so that's starting to get some traction as well. So all of those make us attractive, and I think it's one of the reasons why we're picking up market share across not just the U.S., but actually now the globe in 21, 22 countries, and starting to grow with a very similar model, even internationally, which is quite attractive. And so there's a lot of markets in Canada that even this month, we'll start to be able to put leads into agents hands in a high accountability type of format, which we're pretty excited about. We've got, it's either this month or next month, we're actually rolling out a new marketing suite of tools, which we're really excited about to automate a lot more marketing for agents. And what we're seeing which is really interesting is given a little bit of the slowdown in the market, we're actually seeing our top producing agents and brokers and those who have grown large organizations, actually doing more on the education and attraction and in retention side of the business, because they basically all have many effective brokerages inside the brokerage just through the way that the compensation model is designed. As you know, we're continuing to look at tools and technologies mean, Zoocasa, is one a way that we're looking at improving lead to agents and then we're putting in some lead qualification scrubbing systems that we're excited about to help agents when they do get leads from either eXp realty.com or anywhere that the leads come in as something that's actionable, and then we're providing more accountability around those leads, which will help agents be more productive just by getting better training."
}