{
    "symbol": "ONTO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 23:13:07",
    "content": " And good afternoon, everyone. With these efforts, and in spite of elevated supply chain costs, we expect our corporate gross margin for the second half of 2022 to return to recent norms of 54% to 55% for the remainder of the year, and that includes the projected shipment of two Jet subsystems in the third quarter and three in the fourth quarter. In the second quarter, revenue from Iris grew 49% over last year, and we are on track to meet or exceed our goal of achieving $50 million in revenue from this market segment by the end of the year. And good afternoon, everyone. As Mike mentioned, we had another record quarter, with second quarter revenues of $256.3 million, approximately $8 million above the high end of our previous guidance range supported by the recognition of the X500 lithography systems within the quarter. Specialty device and advanced packaging, which benefited from the X500 revenue within the quarter, achieved $117.3 million, grew 28% year-over-year and represents 46% of revenue. Software and services revenue of $44.5 million, setting another quarterly record, grew 19% year-over-year and represents 17% of revenue. As was mentioned during Q1, once able to recognize the revenue on lithography systems, this will create a headwind on the quarterly gross margins, which were 52%, down from 54% in the first quarter. So, we announced the product, we had â\u0080\u0093 I think it was over 11 or over 10 customers, add up to $75 million in backlog and customers â\u0080\u0093 or let's say, the customers wanted the tools in the first, I don't know, several quarters, first two quarters. So, you take all these different shots on goal and you can add them up and take a factor for some of the negativity and we still see the stronger second half and some of the numbers we talked about for growth â\u0080\u0093 30% advanced node systems and 20% or more for packaging and specialty."
}