{
    "symbol": "ONTO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 21:40:23",
    "content": " We're happy to report the Onto Innovation team delivered another strong quarter of $254 million in revenue, an increase of 27% over the prior year. This year, we're on track to exceed $50 million in revenue, a 34% increase over 2021 with additional growth projected in 2023. As Mike highlighted, we had another strong quarter with third quarter revenues of $254 million, up 27% over the same period last year and $4 million above the midpoint of our previous guidance. Our record level net income in the third quarter was $67 million or $1.35 per share, up 38% over the same period last year and $0.03 above the midpoint of our previous guidance. We ended the third quarter with cash of $553 million, up $41 million since the start of the year, generating $87 million of year-to-date cash flow from operations, representing 12% of revenue. Inventory increased to $308 million in the quarter to support the increasing certain safety stock levels as a hedge against ongoing supply chain disruptions and to prepare for 2023, given the long lead time nature of our components. However, as Mike noted earlier, with approximately $80 million of our projected revenue for 2023 being impacted by the recent China restrictions, we are now reassessing our optimum levels of inventory and would expect to return to the mid-$200 million range for inventory levels in 2023. We currently expect revenue for the fourth quarter to be between $244 million and $256 million, reflecting the impact of approximately $10 million in projected China revenue, Mike had mentioned earlier. At this level of global decline, we expect our revenue in 2023 to decline about 10% to 15%, including the negative impact of about $80 million from new restrictions on equipment sales to China. But you have to remember, these tools we've already done let's say $30 million or so in revenue in 2021 and we're on track to do another $50 million this year."
}