{
    "symbol": "NTGR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 19:19:03",
    "content": " Net revenue for the quarter ended December 31, 2022 was $249.1 million which came in at the high end of our guidance range flat on a sequential basis and down 0.8% year-over-year. In the fourth quarter, the team executed well to overcome supply challenges for these in-demand products, and this effort resulted in another record quarter of revenue for SMB business led by ProAV and strong growth of our 5G mobile hotspots with our service provider partners. In conjunction with a challenging supply chain environment throughout the year, unfavorable foreign exchange conditions also reduced the profitability and led to full year non-GAAP operating loss of $15.6 million and non-GAAP operating margin of negative 1.7%. For the fourth quarter 2022, net revenue for the Americas was $159.2 million, flat year-over-year and a decrease of 6% on a sequential basis. Now turning to the fourth quarter results for our product segments, the Connected Home segment, which includes our industry-leading Orbi, Nighthawk, Nighthawk Pro Gaming, Armor and Meural Brands generated net revenue of $149 million during the quarter, down 14.4% on a year-over-year basis and 1% sequentially. Despite a year-over-year double-digit decline in the consumer networking market overall in Q4, the premium WiFi mesh category and leading-edge 5G mobile hotspots outperformed the market in that same period, giving us confidence that focusing on these innovative premium products is a key to returning to growth and profitability. For the full year, we delivered revenue of $932.5 million, a decline of 20% year-over-year, a reflection of - in a saturating SMB business and a steady service provider business, but offset by the retail CHP business coming off of pandemic buying levels. We're also laser focused on expanding our service revenue, which ended the fourth quarter at $8.9 million up 23.9% year-over-year and up 5.3% sequentially. Given the strong performance in the fourth quarter, which allowed our service provider customers to improve their supply positions, we expect first quarter revenue from the service provider channel to decrease to approximately $25 million."
}