{
    "symbol": "NTGR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 19:42:19",
    "content": " Net revenue for the quarter ended April 3, 2022 was $210.6 million, down 33.8% year-over-year and within our recently revised guidance range. For the first quarter of 2022, net revenue for the Americas was $144.6 million, a decline of 34% year-over-year and down 9.3% on a sequential basis. The Connected Home segment, which includes our industry-leading Nighthawk, Orbi, Nighthawk Pro Gaming and Meural brands generated net revenue of $130.3 million in the quarter, which is down 45.9% on a year-over-year basis and down 25.2% sequentially. 11:37 The SMB segment continued to perform well in the face of supply chain challenges and generated net revenue of $80.2 million for the first quarter of 2022, which was up 4.2% on a year-over-year basis and up 4.1% sequentially. 14:27 As a matter of fact, we saw our service revenue growth over 47% year-over-year to reach $7.6 million for the first quarter of 2022. So you could see if we are the one driving it, of course our revenue portion of these things are higher in NETGEAR, so that's why we're encouraged by this continue rise, as I discussed in the opening of this call that I'll be introducing Orbi 8 and then Orbi 9, we are very confident that we have discovered the user group that really resonate with this group -- this set of products and as we found out just like anything, electronics be it HiFi, be it phones, there are always people who're really up for absolute the best. 36:19 Hey Patrick before your response to the balance of my question, I'm just a little more confused, in previous quarters, I think about 4Q ‘20 when you referenced the premium market, you referenced the market at premium 25%, then 1Q was 30% and then it went up to 38% 4Q, that 16% that you're referencing now is clearly a different market than what you referenced on previous calls relative to the premium. But ultimately, we're looking for subscriber service revenue, which we disclosed for the first time today that our subscriber service revenue is at $7.6 million, which is a 43% growth year-over-year, which is faster, and our number of subscriber growth, which is only about 30% some."
}