{
    "symbol": "NEO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:58:14",
    "content": " I would now like to turn the call over to the host, Executive Chair of NeoGenomics, Lynn Tetrault. Joining me to this call from our Fort Myers headquarters are Bill Bonello, our Chief Financial Officer, Doug Brown, our Chief Strategy and Corporate Development Officer, and Charlie Eidson, our Director of Investor Relations. Joining on the call via phone is Dr. Shashi Kulkarni, our Chief Scientific Officer and Executive Vice President of Research and Development. Before we begin our prepared remarks, Charlie will discuss the forward-looking statements and the non-GAAP measures used on this call. This conference call includes forward looking statements about our 2022 initiatives, 2022 financial outlook, growth opportunities and anticipated operating results and performance. Additional information regarding these risk factors appears under the heading forward looking statements in the press release we issued this morning and in the risk factors section of our annual report on Form 10-K for the year ended December 31, 2021, that is filed with the Securities and Exchange Commission. The forward looking statements made during this call speak only as of the original date of the call, and we undertake no obligation to update or revise any of these statements. In addition, during this conference call in order to provide greater transparency regarding our operating performance, we refer to certain non GAAP financial measures that involve adjustments to GAAP results. These non GAAP financial measures presented should not be considered to be an alternative to financial measures required by GAAP, to not be considered to be measured with liquidity, and are unlikely to be comparable to non-GAAP financial measures provided by other companies. Any non-GAAP financial measures referenced on this call are reconciled to the most directly comparable GAAP financial measure, and a table available in the press release we issued this morning. Before turning the call back to Lynn, I want to let everyone know that we will be making a copy of our prepared remarks for this morning's call build on the Investor Relations section of our website shortly after the call is completed. For today's call, I will begin by sharing my perspective on the state of our company and the actions we have taken since we announced the departure of our Chief Executive Officer on March 28. Bill Bonello will then review our first quarter financial results, including some of the factors underlying the underperformance of the business and outlined the near term actions we are taking to improve our performance and return to profitable growth. Finally, I will introduce our new Chief Scientific Officer Dr. Shashi Kulkarni and the new President of our Clinical Division. These two talented executives are experts in oncology diagnostics, and will play leading roles in our company's future. I have served on the board of NeoGenomics for seven years, and became lead independent director in 2020, before taking over the board chair role in October 2021. During the majority of that time, our business performed very well with consistent top line growth, strong operational efficiency, increasing market share and a world-class culture. Unfortunately, our performance over the past year has been inconsistent with that historical track record, as evidenced by slowing growth and decreased profitability. The company experienced a number of challenges in 2021, including the transition of our long standing Chairman and Chief Executive Officer, Doug VanOort, continuing headwinds from COVID and shifting dynamics in the external environment. Though the company's market position remains strong, and our overall strategy is sound, our execution over the last year was poor. I and other members of the management team have visited many of our sites, and met with leaders and employees at all levels to share our direction, hear their feedback and engage them in our efforts. Second, the Office of the CEO, together with other members of the management team have worked swiftly and collaboratively to identify actions to improve performance. The addition of Dr. Kulkarni and Dr. Sholehvar to the management team, with their extensive experience and deep expertise has helped us identify additional opportunities for improvement, and you will hear from them later on in our prepared remarks. In summary, we recognize that there's significant work to be done. But we're confident that in time, we will return to the growth and operating efficiency that drove our success for many years. In particular, we see great strategic value in marrying new technology such as RaDaR. And finally, the board and I are confident that our strong executive leadership team will advance the execution of our strategy while we recruit an outstanding Chief Executive Officer. This morning, I would like to review our first quarter financial results, provide some additional color on the factors that have been impacting revenue growth and margin and provide some detail on some of the actions that were already taking to return to profitable growth. While we will not be providing formal revenue or EBITDA guidance today, we will provide some directional commentary with respect to both revenue growth and profitability. Before I walk through the numbers, I wish to point out that the growth rates we cite exclude prior period revenue from COVID-19 PCR testing. With clinical services revenue up 4% year-over-year, and pharma services revenue down 4% year-over-year, clinical revenue was $99 million in the quarter. The Omicron variant had a significant impact on test volume during the month of January, with volume down 7% month-over-month and flat on a year-over-year basis. Well, volume grew both sequentially and year-over-year in both February and March, we have not yet returned to pre-COVID growth rates Our volume growth is being impacted by a couple of factors. First, our test mix is weighted to legacy modalities and disease specific NGS offerings. While the market is moving towards larger, more comprehensive panels. Second, operational challenges have made it difficult to add new business at our historical rates. We are taking a number of steps to upgrade our NGS product offering and improve our lab operations, which Dave and Shashi will discuss in greater detail later in the call. Pharma services bookings were $41 million in Q1, and we ended the quarter with a backlog of $282 million, which was up 6% sequentially, and 30% year-over-year. While backlog was up, pharma services revenue decreased 4% year-over-year to $18 million. We view this year-over-year decline as an anomaly and not a trend, as we faced a very tough prior year comp. Revenue was quite a bit lower than we had been expecting in March of this year, as one large project got pushed out to later in the year. By contrast, March 2021, was a record revenue month for pharma services. We are taking action to drive near term pharma revenue, including increasing our efforts to secure preclinical business, which tends to convert more quickly than clinical trials work, even as we continue to build out our backlog of large clinical studies. Our informatics business, which is reported as pharma services revenue continues to grow at a rapid clip, and we're excited about the progress of these initiatives. Our GAAP gross margin was 32.6%, adjusted gross margin, which includes Inivata related which excludes Inivata related non-cash amortization expense was 36.8%. There are several factors that contributed to the decline in adjusted gross margin, and we are taking immediate action to mitigate these trends. First, in late 2021, we significantly increase the size of our laboratory workforce in preparation for return to pre-COVID growth rates. As noted earlier, volume growth did not rebound to the extent that we had expected. As a result, we have scaled back our laboratory hiring plans to better align with near term volume trends. Second, like most companies, we've experienced wage and supply cost inflation. In response to this cost pressure, we are implementing price increases in both our clinical and pharma businesses, and pursuing strategic reimbursement opportunities to increase value capture for the services that we are providing. Third, we did have extra cost associated with the transition to our new Fort Myers lab. While, this move will drive productivity and efficiency improvements over time, we incurred extra costs related to operating two different Fort Myers facilities during the transaction. In addition to these factors, we've seen a notable decrease in lab efficiency over the course of the past year. This decrease is largely attributable to increased complexity of both our product offerings, and our lab processes, due in part to efforts to respond to customer requests for customization. These actions include eliminating low margin services, streamlining our NGS processes to drive reductions in labor, supplies and bioinformatics costs while simultaneously improving turnaround time, and implementing AI to increase lab tech productivity. Moreover, we have every expectation that we will identify additional near term actions as we continue to engage the organization. Finally, as we've discussed in the past, our pharma lab expansions, including both our international labs and our La Jolla facility, continue to be a drag on adjusted gross margin. While our international labs are important to our long term growth strategy, and allow us to bid on larger global clinical trials. Our La Jolla Lab, which we acquired through the acquisition of the oncology assets of human longevity in 2020, and which is where we perform whole exome and whole genome sequencing is also operating below capacity. While, lab expansion remains an important component of our pharma growth strategy, we are working to better align capacity expansion with growth. In addition to these near term actions, we're also developing a long term plan to drive step function improvements in productivity and efficiency. We will do this through automation, process improvement, product payer and customer mix and pricing. Operating Expenses increased $34 million year-over-year, and $3.8 million sequentially to $90 million. Approximately $13 million of the year-over-year increase is related to ongoing operating expense at both in Inivata and Trapelo, which were acquired in the second quarter of last year. In particular, we continue to make significant investments in RaDaR, supporting what we believe is a leading assay for minimal residual disease and recurrence testing. In addition, another $11 million of the annual increase is related to non cash stock option compensation expense, and other non-recurring items that have been excluded from our calculation of adjusted EBITDA. The sequential increase in operating expense is related to increase legal and accounting costs associated in part with operations of Inivata and Trapelo, as well as the ongoing compliance matter, CEO transition costs and increased product development expense related to our informatics business. We are taking steps to reduce our G&A expense run rate, but there's more work to be done. Given the factors we just discussed, adjusted EBITDA loss was $19 million. Turning to the balance sheet, we exited quarter one with $481 million in cash and marketable securities. The increase in DSOs, primarily driven by the inter-company cadence of revenue, with March being the highest month of the quarter. Having reviewed the first quarter results, and the immediate actions that we are taking to improve both revenue growth and margins, I'd like to spend a little time discussing our outlook for the remainder of the year. As a reminder, we went through our 2022 revenue and EBITDA guidance in March in conjunction with the departure of our CEO. That said, we understand that our decision to withhold formal revenue and EBITDA guidance makes it difficult for investors to assess our current financial situation, or evaluate our near term prospects. Therefore, we would like to share some additional thoughts regarding near term trends in both revenue and profitability. We view 2022 as a rebuilding year, where our primary focus is to improve our current product offering, drive operational efficiency, generate clinical evidence in support of RaDaR and lay a foundation to support sustainable profitable growth in 2023 and beyond. Similarly, we expect that our quarterly adjusted EBITDA will improve modestly sequentially each quarter as the year progresses. Looking to 2023, we expect revenue growth to accelerate and we expect to be adjusted EBITDA positive exiting the year. I will now turn the call back to Lynn, who will introduce Dr. Kulkarni and Dr. Sholehvar. I've asked them both to provide some background on some of their relevant experience, express why they chose to join NeoGenomics and discuss some early areas of focus for them, including any quick wins they see for improving our business. With that, I'd like to introduce our new Chief Scientific Officer, Dr. Shashi Kulkarni. My career in clinical genomics spans over 30 years, and most of my career has been spent in the field of molecular genetics and next generation sequencing. I've held numerous academic, scientific and operational leadership positions at Washington University's School of Medicine in St. Louis, Baylor College of Medicine, and help build and facilitate operational and financial turnarounds at both institutions. I've also authored many best practices guidelines related to NGS by co-working with organizations such as EMP , ASCO-CAP and CDC. I see the company's long standing customer relationship with pathologists and apologists as a key strategic asset and believe that the fundamentals are there to be a market leader for many, many years to come. While my focus will be primarily on next generation sequencing, I believe I can help drive improvements in operational productivity through process improvement and automation across the laboratories. NeoGenomics has a strong market position covering the continuum from diagnosis to monitoring, and I'll be proactively working to optimize a service menu with sound business principles. In my short tenure here at Neo, we have identified several operational and informatic improvements that we're already working to implement. I'm immensely impressed with the scientific talent of Neo, as evidenced by over a dozen presentations at the recent ACR conference in New Orleans. What exciting action that we have already completed is the launch of our new lung cancer DNA, RNA, NGS-only offering. This comprehensive panel includes genomic and transcriptome and multimodal readouts driven by clinical evidence, which differentiates it from other leading lung cancer offerings on the market. Additionally, we're bringing -- beginning validation on larger pan-cancer panels, NGS panels. Outside of our NGS products for test  selection, I'm impressed with the outstanding sensitivity and strong data from RaDaR assay for minimal residual disease and recurrence testing. I share the team's belief that RaDaR could be a leading MRD solution and in 2022, we are prioritizing data generation and are actively involved -- engaged in discussions with several different pharma companies for larger late-stage opportunities. I'm also pleased to introduce our new Clinical Division President, Dr. David Sholehvar. Including my time in medical school and residency for pathology, I spent over 30 years my career in and around diagnostics and laboratory space. Over that time, I have served in significant commercial and general management leadership positions at both J&J and Quest Diagnostics in the IBD, and Lab Services businesses respectfully. As a result, I have experienced with a wide range of relevant diagnostic technologies, including liquid biopsy, molecular diagnostics, NGS, anatomic pathology, and digital pathology. I often assume these positions when the businesses were experiencing challenging circumstances, and I have a demonstrated track record of helping to drive, improve business performance. Personally, I feel there is no more relevant field to be in healthcare than helping cancer patients, as well as their caregivers and physicians navigate the increasingly complex world of cancer diagnostics and care. I also believe that Neo is well placed to be a market leader, emerging from a position of strength between earlier stage companies that lack breadth of menu and large diagnostic labs that have difficulty selling specialty testing. During my time at Neo as far as Shashi has, I been digging in with the team and working to prioritize areas of immediate focus. I believe that there are some near term actions we can take to improve commercial productivity, operational efficiency and our overall service to customers. We have launched new high value tests, and make our turnaround times more reliable. But I also see near term commercial benefits by expanding our already excellent sales force with precision medicine managers, focusing on the oncology channel, as well as introducing new tools to manage the sales process and pipeline more effectively. In addition, we are establishing cross functional process excellence teams to streamline our approaches in the lab, and develop tools in a few key areas to increase productivity and expand margins. Longer term, I'm focused on reinforcing our foundation and building a platform for sustainable growth, while there is significant work ahead of us, I see the challenges we are facing as familiar and addressable. In closing, while we are disappointed in our Q1 results, we are taking immediate actions to improve our performance. This year, as Bill said, we'll be one of rebuilding to improve our lab operations and drive greater cost efficiency. In addition, we will continue to make strategic investments to improve our current product offering, drive clinical evidence in support of RaDaR and lay a foundation to support sustainable profitable growth in 2023 and beyond. At this point, we would like to open up the call for questions. Incidentally, if you're listening to this conference call via webcast only, if you'd like to submit a question, please feel free to email us at charlie.eidson@neogenomics.com. During the Q&A session, and we will address your questions at the end if it's subject matter hasn't already been addressed by our call and listeners. As mentioned at the beginning of this call, we would like to ask each person to limit their number of questions to one, so that we may hear from everyone and still keep within the one hour a lot of for this call. Operator, you may now open up the call for questions. Please pose your question. Your line is live. You've identified some Neo specific things, obviously. Do you anticipate that there's a kind of a broader slowdown that may be contributing to some of this recognizing, of course, that there are some very clear issues that you guys have to deal with. And then, for Shashi, question for you on the panels here, and the expansion there. Thanks, Brian for you question. When we take a look at our legacy business, I mean, there's no doubt that a lot of those modalities are mature, in their market segments, and over time, have seen some price, price pressure. So, I think that that's the biggest dynamic related to the legacy business. When it comes to the market dynamics related to NGS, we actually touched on this as well. We are seeing bigger and bigger panels coming from some of these emerging companies, more than emerging at this point where we have not kept up. And internally, we're talking about how do we get to the standard before we can become the standard, if you will. So, to just to summarize it, I'll emphasize actually what Bill said previously, I think the market dynamics and our legacy business are probably not unfamiliar to more mature modalities. And then with the NGS and the new stuff, we actually have to get better to responding to the market needs as they evolve. I think, I was asked about the timeline. And the validation work for that big panel, which will be not only competitive, but would be the best-in-class would be ready in six months timeframe. Please pose your question. Your line is live. Maybe one for you, Bill. So thanks for the question, Matt. In terms of the cost saving, so we are already beginning the actions. And so, I think those will increase throughout the year. So, that's really going into 2023 with $15 million of annualized cost and reimbursement benefit based on the activities that we have already identified and started to pursue. Actually, I'll respond to the budget question, too, if that's okay. And if it wasn't clear from Shashi' comments earlier, the exciting thing about the improvements that we're going to be making is, in addition to ending up with a better product that also has improved turnaround time, we will end up with a product that has lower ongoing costs than what we're currently performing. Please pose your question. Your line is live. Hey, everyone, thanks for the questions here. Maybe first, just kind of a high level one on some of the comments around optimizing the service menu. And when we talk about rationalized or optimizing the menu, I don't know that we're necessarily talking about some of the assays that we have launched on the advanced diagnostic side that folks like. We're finding that given our customer breadth if you will from smaller community, based on oncologists and pathologists, all the way through to large medical centers that having that variety of targeted versus comprehensive panels and things like that does have relevancy. I think when we're talking about optimizing the -- our -- the complexity of our offerings and things like that, it's more about some of the lower margin, lower volume tests that still required time in the lab to produce the result, and really streamlining it on the lower end, rather than rationalizing the higher end. In terms of I think, Bill, you mentioned some of the costs stemming from the compliance matter. Please post your question. Your line is live. So, I'm going to ask Bill to address that. I just guess, I'd reiterate what we talked about earlier. In that, we are seeing some increased competition on the NGS front as panels move, or as customers move to demanding larger, more comprehensive NGS only panels and our offering is more oriented towards smaller targeted panels. So, I think that is the competitive dynamic that we're experiencing, and probably why you see a differentiation in our growth rate relative to those of some of our competitors. I mean, honestly, it's still a work in process for us. Please post your question. Your line is live. And they're just when you go back a year ago, Neo had a very different cost profile than we do now. So thanks for the question, Alex. One, obviously, we did acquire two companies, both Trapelo and Inivata. Two, not unique to us, but obviously, it's an inflationary environment. Three, as I mentioned, we did staff up in our laboratory to prepare for a rebound in volumes coming out of COVID. For we talked about the increased complexity of our lab operations, which is driving a decrease in efficiency or productivity and causing us to take more people to do the same amount of work that used to be done with less people. I guess, it's the simplest way of putting that. As I mentioned, we've identified a number of immediate actions and we put $1 amount around that. We're still in the process of developing a more comprehensive plan to drive as I said, step function improvements in productivity and efficiency and a return to profitable growth. And until we have that plan established, I just don't want to throw out any preliminary targets. Please pose your question. Your line is live. Thanks for the questions. So in terms of the content of our new offering in NGS comprehensive genomic profiling, the content we are looking at would be more than 500 genes. And as far as the whole exome is concerned, yes, I think once we like, like Dr. Sholehvar mentioned, we have to get to the standard and then set the standard later on. One very exciting thing, which I'm looking forward to develop is using whole exome sequencing as the diagnostic therapeutic selection, test, and then using the data from that for our bespoke RaDaR Assay, so that it has -- it creates a single solution from diagnosis to disease monitoring. So whole exome, whole transcriptome tumor normal, and then following up with minimal residual disease is what I would be working on once we get to the next stage. So with regard to your question, Mark, about RaDaR, we are in active discussions with MolDX as we speak, and we anticipate either we will be on that mid year timeline, or we won't be. I mean, we are hiring for the -- we call the PMMs. And then as far as internal preparation for training for the broader organization, and all the other things that you do in prep for launch, we are continuing those as well. Please pose your question. Your line is live. So first of all, in terms of the year-over-year decrease, we did mention a couple of things. As I noted, March of 2021, was the strongest revenue quarter that we've ever had in our firm of services business. Secondly, we did have one big project that we were expecting a lot of work to happen in March that got pushed out until later into the year so that caught us a little bit by surprise on that front. In terms of conversion from backlog to revenue, you're absolutely right that we have seen a slowdown there for a while. Part of that was obviously attributable to COVID and trial activity, slowing down during COVID. And it's possible that some of it is, still related to a maybe slower than anticipated bounce out of COVID. Early on, we had a weight of business that was heavily on preclinical work, which tends to convert very quickly. Over time, more and more of the backlog consists of clinical trials work, sometimes work that takes four years or longer to totally complete. In light of that, that's why we are pursuing some of the activities that I described, one, trying to secure more preclinical work, not at the expense of trial work, but in addition to so that we can better balance out on the revenue front. And two, there are things that we can do to pull through revenue more quickly than we typically would on given on given projects. In terms of inflation, we talked about 6% inflation on wage and supply cost. No, that's very helpful. On the oncology piece, can you just clarify, both for NGS and MRD side. I think at one point you had plans to increase the sales force to 50 or so reps, maybe even more. As I mentioned, we're trying to get everybody on board by the end of May, so that we can continue their training, the new people's training as we continue to train those that we have and also expose the TBMs as well, that are calling on oncologists in preparation for RaDaR. Please pose your question. Your line is live. I guess, the multi part question. I guess the first one is just on your base business, based clinical business X NGS, I think we've come to understand that business grows volumes, high single digit, you have a little pricing pressure. So the revenue growth rate, some are still in the high single digits. Obviously, this year things are off the table. But given the pressure on the base business that you've discussed from these larger NGS offerings, I'm just wondering if you could address that, and specifically within those -- within your key modalities, IHC, FLOW and FISH. I think in terms of growth in our legacy modalities, candidly, the jury's out a little bit. Clearly, growth was impacted over the last two years because of COVID. We expected to see a greater rebound coming out of COVID, then what we have seen. And so, we are in part getting our arms around what is the sort of real market growth rate in those underlying modalities today, and what is our ongoing opportunity to continue to take share. Because remember, historically, our growth has been a combination of underlying market growth and market share gains. But in terms of what the underlying market growth is, we probably need to do a little bit of work on that. In terms of the modalities that are most impacted by NGS, I would say, where we see it in the most pronounced way is probably in solid tumor FISH testing where things that were looked at using that modality can now effectively be analyzed through an NGS panel, particularly when you have combination RNA, DNA panels, and you can do fusions by NGS. And so, I think that that's probably where the greatest impact is. There's certainly no real cannibalization at this point, I would say of cytogenetics or flow cytometry, we see it last in HEME FISH. And candidly, most of the NGS work that happens today on the solid tumor side still needs to be accompanied by IHC work. I mean, one to a certain degree, the front runners that have spent the vast majority of the resources and money and time, honestly, as well, are really driving into new ground and new territory, and to a certain degree, some of the things that we're doing as a fast are not so fast follower will benefit from them plowing that field a little bit for us. So, I would say that being the first mover when it comes to some of these technologies in proving them out both analytically but also clinically, there's a higher cost than that with us now trying to prove analytical equivalency. The second part, I'll talk a little bit about to something that Bill mentioned, which is -- I think was, it was a quick comment, but one that actually benefits us. So, lot of these technologies actually are being used and capacity is available through the facilities for pharma as well that we can actually tap into. So as leveraging that infrastructure allows us to keep the cost somewhat constant in that regard, but then also improving utilization of those facilities at the same time. So, it sounds like, I know, that guide has been for a while mid-year. I mean, I understand making timelines on regulatory decisions is really difficult, because it is out of your hands, but net-net, the guidance has been consistently mid-year. And then related to that, I guess, we had been anticipating high single digit revenue contribution. So, I'll have Dave comment on first and then Bill on the last question. So I mean, the timing of the MolDX thing is really not for anybody that's submitted something for reimbursement or for a coverage decision. It's basically the request for additional samples, if you will, additional statistics, and not a large amount. So, we're actually negotiating with them right now. We're not negotiating, discussing with them right now, what that looks like. We're going to review that plan, hopefully in early May with them. And if the plan is accepted, then we'll be moving forward and if there's additional questions, then we'll respond to them in time. What I would say on the revenue standpoint is that we had not expected any kind of meaningful clinical revenue from RaDaR, probably, before 2024, for all practical purposes. So while we were going to have launch related activity, to kind of see the market, so to speak, the revenue that we had pointed from was on the pharma side. We certainly have a lot of ongoing conversations with pharma companies for RaDaR related projects, and some of them are actually quite sizable. And if I could just also, because then that begs the question, what are we doing with 20 something PMMs, if there's a -- if it doesn't go our way. So, just to kind of get ahead of that question, I'm sure it's on people's minds. So we actually have these other launches that Shashi was talking about with the DNA, RNA long and comprehensive. So, we're actually expanding the bag that the PMMs will carry regardless of what happens with RaDaR. So those will not be stranded costs, those will actually be productive costs as the plan is. Please pose your question. Your line is live. Thanks for the questions. So, let me let me answer the second question first, which is, it will take some time to see a meaningful shift in the rate of backlog conversion. And while we will work to add more quicker converting projects to that mix, it's going to take some time for you to see it in terms of percentage. I would say, today the backlog is comprised, probably 75% to 80% of clinical trial work versus preclinical work. Or just pricing increases in general, I think was the question. At this time, I would now like to turn the floor back over Lynn Tetrault for any closing remarks. As we end the call, I'd like to recognize that over 2,125 NeoGenomics team members around the world for their dedication and commitment to building a world class oncology diagnostics and information company. And on behalf of our NeoGenomics team, I want to thank you for your time and joining us this morning. And for those of you listening who are investors or are considering an investment in NeoGenomics, we thank you for your support and interest in our company."
}