{
    "symbol": "NEO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 12:36:10",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the NeoGenomics Second Quarter 2022 Earnings Call. At this time, all participants have been placed on a listen-only mode and the floor will be open for questions and comments after the presentation. Joining me for this call from our Fort Myers headquarters are Bill Bonello, our Chief Financial Officer; Dr. David Sholehvar, President of our Clinical Division; Vishal Sikri, President of our Pharma Services Division and President of Inivata; and Charlie Eidson, our Director of Investor Relations. Joining on the call via phone are Dr. Shashi Kulkarni, President of Lab Operations and Chief Scientific Officer; and Chris Smith, our incoming Chief Executive Officer and member of our Board of Directors. Before we begin our prepared remarks, Charlie will discuss the forward-looking statements and non-GAAP measures used on this call. This conference call includes forward-looking statements about our 2022 initiatives, 2022 financial outlook, growth opportunities, and anticipated operating results and performance. Additional information regarding these risk factors appears under the heading Forward-Looking Statements in the press release we issued this morning and in the Risk Factors section of our Annual Report on Form 10-K for the year ended December 31, 2021 that is filed with the Securities and Exchange Commission. The forward-looking statements made on this call speak only as of the original date of the call, and we undertake no obligation to update or revise any of these statements. In addition, during the conference call, in order to provide greater transparency regarding our operating performance, we refer to certain non-GAAP financial measures that involve adjustments to GAAP results. The non-GAAP financial measures presented should not be considered to be an alternative to financial measures required by GAAP, should not be considered to be measures of liquidity, and are unlikely to be comparable to non-GAAP financial measures provided by other companies. Before turning the call back to Lynn, I want to let everyone know that we will be making a copy of our prepared remarks for this morningâ\u0080\u0099s call available on the Investor Relations section of our website shortly after the call is completed. For todayâ\u0080\u0099s call, I will begin by sharing an update on the state of our company and the exciting progress we have made since our last earnings call, including an update on recent leadership appointments and progress on our RaDaR assay. Finally, I will introduce new CEO, Chris Smith who will provide his perspective on why he chose to join NeoGenomics and his plans during his first few months on the job. Chris will officially join Neo on Monday, August 15 and we are thrilled that he is taking over as our companyâ\u0080\u0099s next leader. Since our prior CEO transition, we committed to three key priorities: hiring a permanent CEO, stabilizing the company including key additions to the executive leadership team, and developing a plan to drive improvements in our operating performance. We said that we would not stand still during this transition, and we are pleased to report that we have made considerable progress on all fronts. During a challenging time in our business, our people have rallied together as we welcome talented new leaders, embark on Project Catalyst, and continue to move RaDaR forward. First and foremost, we are excited that we successfully completed the search for a permanent CEO in less than four months and that our incoming CEO, Chris Smith will start on Monday. The Board prioritized four key criteria in seeking CEO candidates: diagnostic industry experience, a strong cultural fit, a track record of operational execution, and a strategic growth orientation. Not only does Chris possess all of these attributes in spades, but he brings other important qualities such as prior public company CEO experience. In addition to recruiting a new CEO, we made excellent progress toward addressing priority number two in stabilizing the leadership team and our workforce as a whole. Just last week, with the endorsement of Chris Smith, we confirmed the appointment of Ali Olivo as General Counsel and Corporate Secretary. Ali previously served as interim General Counsel, has been with the company for three years and is a talented leader and lawyer. Together with Hutan Hashemi, a very experienced leader whom we appointed as Chief Compliance Officer in March, we have excellent oversight of our legal and compliance functions, policies and programs. We have added some exceptional talent to our leadership team over the last six months, and the leadership team and I have prioritized visible leadership and meaningful engagement with our people at all levels. I am confident that the organization is stabilized, and that the leadership team is motivated, aligned and stronger than ever. Since April, we have worked to diagnose the causes of underperformance and have developed a plan, Project Catalyst, to drive improvements over the next 18 months. As we launch more comprehensive Project Catalyst initiatives, incoming CEO Chris Smith will be heavily involved. Before I hand the call over to Bill, I would like to update you on the progress of RaDaR, which remains an important part of our future. In parallel, we are pursuing reimbursement in additional cancer types and we anticipate being able to file a second submission for breast cancer to MolDx in the first half of 2023. The buzz at ASCO for RaDaR was significant, including a plenary session highlighting the value of RaDaR across multiple cancer types that received a standing ovation, and we are confident that we will sign several opportunities in the coming quarters. Clinical test volume increased 3% sequentially, but was down 3% year-over-year. These factors include operational challenges that are having a short-term impact on customer service and an ongoing market shift from smaller, targeted panels to larger, more comprehensive offerings. We ended the quarter with a backlog of $299 million, which was up 6% sequentially and 26% year-over-year. While pharma services revenue increased 6% sequentially to $19 million, revenue was down 4% year-over-year. While we will increase our emphasis on near-term revenue growth, we will also continue to build out our backlog of large clinical studies and companion diagnostic opportunities. Our informatics revenue, which is reported in pharma services continues to grow at a rapid clip. Adjusted gross margin, which excludes Inivata related non-cash amortization expense, was 39%. The year-over-year decline was driven by wage inflation, higher supply costs, and increasing logistics costs. While we are encouraged by the sequential improvement in gross margin, we still have significant room for improvement. The primary driver of this increase absorbing a full quarter of operating expense at Inivata, which was acquired in June of last year. Also, we have continued to make significant investments in RaDaR, supporting what we believe is a leading assay for minimal residual disease and recurrence testing. Adjusted EBITDA loss was $16 million for the quarter, which is a $3 million improvement from Q1. Turning to the balance sheet, we exited quarter two with $466 million in cash and marketable securities. As a reminder, we withdrew our 2022 revenue and EBITDA guidance in March in conjunction with the departure of our previous CEO, but we did provide some guardrails on our Q1 call. We continue to view 2022 as a rebuilding year where our primary focus is to improve our current product offering, drive operational efficiency, generate clinical evidence in support of RaDaR, and lay a foundation to support sustainable, profitable growth over time. From a seasonality standpoint Q2 is typically our strongest quarter of the year, thus itâ\u0080\u0099s possible that Q3 revenue could come in modestly below Q2. In terms of profitability, we expect the Q3 adjusted EBITDA loss to be similar to or modestly greater than what we reported in Q2. I will now turn the call back to Lynn who will provide more details around Project Catalyst before introducing our incoming CEO, Chris Smith. As I mentioned, we have engaged our entire organization with the recent launch of Project Catalyst, an 18-month plan to improve our business that will take us through the end of 2023. Over the past two months, we have engaged employees at all levels to identify initiatives to drive improvements in efficiency, and effectiveness in these key areas. Some projects are already underway, and others will kick off in the coming months. While in the early stages of implementation, Project Catalyst is a significant focus for our team and we are excited about the level of engagement we have around the initiative internally. In the meantime, to better illustrate our efforts, I want to share two specific examples of the kinds of â\u0080\u009cNo Regretsâ\u0080\u009d changes we have already undertaken within our laboratory to improve our efficiency and margins. This early readout may have made sense at one time for one particular customer, but this process had been scaled to become our standard procedure. As technology has evolved, not only has that early readout become less impactful, but we are also incurring duplicate and unnecessary costs due to running multiple tests without the corresponding ability to bill for both instances. Shifting the discussion to the most exciting development of the call, I would like to introduce our incoming CEO Chris Smith. Before I share a few details about Chrisâ\u0080\u0099 background, I want to underscore that the CEO search process was thorough and competitive, and the opportunity attracted many impressive candidates from the diagnostic industry. After prioritizing the list of interested candidates, the Search Committee interviewed nearly ten individuals, and then all Board members and our Chief Culture Officer interviewed several finalist candidates. First, Chris brings to Neo a very impressive background and a successful track record of delivery as a CEO in the diagnostic industry. During his leadership, Ortho Clinical successfully completed an initial public offering, raising $1.45 billion, and achieved accelerated revenue growth alongside improved profitability. Chris also served as CEO of Cochlear, a publically traded med-tech company, from 2015 to 2018. During his tenure, Chris oversaw 35% organic improvement in annual revenue and increased profitability. In addition to his proven success in operational delivery, profitable growth and the creation of shareholder value, Chris stood out from the others because of his dynamic and inspiring leadership style. What especially impressed us is how mission driven and patient focused Chris is, coupled with his passion for leading through people and culture. We concluded that out of all of the candidates we met in the search process for a CEO over the past several years, Chris is far and away the best fit for the culture of Neo. Please note that because Chris has not officially started yet, he will not participate in the Q&A portion of this call. As a clear market leader in the cancer testing and information market, NeoGenomics has had a critical role to play in the lives of millions of cancer patients. Given the companyâ\u0080\u0099s longstanding relationships with community pathologists and oncologists, I believe Neo remains ideally positioned to bring world class cancer care to where it is needed the most. Strategically I see meaningful value in combining a strong clinical business with Pharma Services capabilities, Informatics information, and Inivataâ\u0080\u0099s liquid biopsy technology platform. Just as important, NeoGenomics is a company that puts patients first and has a very mission driven culture. As I join NeoGenomics officially on Monday, I plan to spend the next few months out in the market with customers, patients, and our teammates both in our laboratories and in the field to gain a deep understanding of the flow of our business. In summary, during a challenging time in our business, our people have rallied together as we welcome talented new leaders, embark on Project Catalyst, and continue to move RaDaR forward. On the leadership front, we have added some exceptional talent over the last six months highlighted by the announcement of our incoming CEO Chris Smith who joins on Monday. I would like to take this opportunity to thank the Board of Directors, the leadership team and our entire organization for the terrific support you have provided to me and the leadership team during this transition. At this point, we would like to open the call for questions. Incidentally, if you are listening to this conference call via webcast only and would like to submit a question, please feel free to email us at charlie.eidson@neogenomics.com during the Q&A session and we will address your questions at the end if the subject matter hasnâ\u0080\u0099t already been addressed by our call-in listeners. As mentioned at the beginning of this call, we would like to ask each person to limit their questions to one so that we may hear from everyone and still keep within the hour allotted for this call. Operator, you may now open up the call for questions. Hi Chris, if youâ\u0080\u0099re still listening, welcome aboard and Lynn, I heard a deep side of relief from you. Weâ\u0080\u0099ll have kind of higher level questions at some point, but really wanted to kind of dig into a little bit of the, the near term dynamics here. Can you just, and maybe sequentially, can you talk about what â\u0080\u0093 just whatâ\u0080\u0099s going on that youâ\u0080\u0099re seeing in terms of market dynamics there weâ\u0080\u0099ve heard from other companies that there may have been a little bit of a weakness in the second quarter, in terms of volumes in the space. So, I think that there, there probably is some hangover there, but I think that most of what we see impacting our volume is really internal. So not discounting a hangover from COVID, but we believe that volume decline is mostly in our control and our parts of the business that weâ\u0080\u0099re actively trying to improve on. As we look forward we do think we should continue to have some modest benefit from the price increase that we put into effect at the beginning of July, that takes a while to flow through. And so AUP is always going to bounce around a little bit from quarter-to-quarter but in general, we feel confident that this is a relatively sustainable level. Hi Chris, welcome to NeoGenomics. Can you maybe expand a bit on why the resubmission here until MolDX and then regarding these recurrence tests, thereâ\u0080\u0099s now two tests out in the market with two different indications. So with the resubmission to MolDX for colorectal, we had some discussions with them and they asked for some additional information around our whole exome sequencing data, which we were able to provide. And thatâ\u0080\u0099s what led to the resubmission and were quite confident based off our, our ongoing discussions with them, that we have met the criteria for the approval through MolDX. And weâ\u0080\u0099ll find out in the next couple of months, obviously on this. In terms of, the other assays which are on the market, we feel that weâ\u0080\u0099re well positioned for, from a clinical perspective, not just in colorectal, but as we go through other cancer types, like breast cancer and lung cancer, looking at both, looking at recurrence, looking at monitoring a neoadjuvant and so on, we believe that the value of the RaDaR technology will shine, especially in those indications as well. Is there any seats still that you need to do, and do you feel comfortable with kind of the layers below management that, you really have the solid team in place and, like weâ\u0080\u0099re looking at a Neo thatâ\u0080\u0099s, that stable, steady yet a good customer service orientation that weâ\u0080\u0099ve always thought it to be. So firstly, I would say, as I said in the prepared remarks that I think we have added significant talent to the team. And so the senior team as of now, those roles are filled and we have a really motivated I think, and committed team. That said, we have obviously Chris Smith joining on Monday and he needs to get in and learn the business, get to know the team and determine what the needs are for the company going forward. So we want to give him space and time to do that, but he appreciates the great leaders we have on the team and as I mentioned, has met all of them on the executive team. In terms of the bench strength below, we have continued to add some great leaders as well over the past number of months. I think as with any company, we can always continue to strengthen. I would expect that as Chris comes in, he will want to put his own imprint on the business and look to where we can strengthen certain capabilities in the organization. So just one on pharma for me, and then just briefly on NGS. On pharma, it was a bit softer versus sort of the strong backlog that we have seen before. And also on NGS contribution in the quarter, what could you provide us there and wondering if the ASP uptake was part of that was NGS contribution. So on the pharma backlog, it continues to grow, which is great for us, and we see positive growth there. We are seeing some softness on the revenue conversion, and thatâ\u0080\u0099s something that weâ\u0080\u0099re addressing a lot of it, we believe right now, it has to do with the sample makeup from the different clinical trials that weâ\u0080\u0099re getting. So for NGS, I mean, we continue to see that we have the value in a more comprehensive panel. Since our Q1 call, we have evaluated and identified a few solutions on a broader panel and continue to validate those for future launch. And from an AUP perspective, ASP perspective, depending on your acronym, we actually are seeing favorable mix and NGS as part of our offering mix is actually driving some of the as ASP, AUP favorability. And then maybe Iâ\u0080\u0099m just wondering on the second half outlook Bill, if Iâ\u0080\u0099m doing the math, right, it looks like youâ\u0080\u0099re kind of implying Q4, maybe down low-single digits to now maybe as much as like high-single digits on a revenue basis. So I mean, when we take a look at the core business and modalities, I mean, we are below where we think the market rates are for those modalities. But we think that the majority of the volume decline is back to the two main things that weâ\u0080\u0099ve talked about before, which is our operational challenges in the lab, as well as the offering for NGS. And I donâ\u0080\u0099t think we comment on specific modalities, so Iâ\u0080\u0099ll just keep it general like that. I think we can walk through offline sort of the specifics, but I donâ\u0080\u0099t think itâ\u0080\u0099s necessarily our expectation that, that Q4 would be down on a year-over-year basis. We did say on the call that on a sequential basis, Q3 could be down sequentially relative to Q2 because Q2 is â\u0080\u0093 now is our strongest quarter of the year. Hey, thanks for the question and welcome, Chris as well. Maybe just a high level one, thinking about the financials a little bit, I donâ\u0080\u0099t think Bill, you commented on the prior comment about EBITDA breakeven exiting 2023. And I know historically youâ\u0080\u0099d said, EBITDA would improve quarter-over-quarter, and it sounds like now thinking about 3Q, thatâ\u0080\u0099s not necessarily the case. So I guess, maybe just walk through kind of some of the moving parts there, whether that 2023 exit rate is still on the table and how we should be thinking about the pathway to improving profitability through the 18-month Project Catalyst program. Thatâ\u0080\u0099s simply a function of â\u0080\u0093 if we do see a sequential decline in revenue, it wouldnâ\u0080\u0099t be typical or atypical then to see that pressure flow through on the profitability standpoint. We do continue, as I said on the call, do expect to drive improvement as we move into Q4 and some of these catalyst initiatives take on more of a hold. But obviously, we have a new CEO coming in on Monday and heâ\u0080\u0099s going to want to take a look at the business and think about the places that we need to make investments and think about the tradeoffs between cost improvement and accelerating growth. And so I think at this point, we just donâ\u0080\u0099t want to commit to any 2023 metrics. And Chris, welcome to NeoGenomics. I guess, can you expand a little bit on essentially what youâ\u0080\u0099re thinking about in terms of â\u0080\u0093 actually this is on the therapy selection side in terms of expanding to broader panels. I know in the past, youâ\u0080\u0099ve talked about looking to be perhaps more competitive with other larger labs in the space on the DNA, RNA side. So as we mentioned at the Q1 call, I mean, we have evaluated, we do recognize the need for the broader panel, and we are validating actually a couple of candidates right now. So I donâ\u0080\u0099t know that I want to say by the end of the year or early next year as a timing, but we are actively validating candidates for a more competitive offering. So IVFL, we are seeing modest growth on small numbers. So IVFL is showing modest growth, but we are also gearing up for RaDaR as well, operationally. I mean, if your ASPs are stable and yet youâ\u0080\u0099re still expecting to see 4Q growth in clinical services to the extent. And at this point, I donâ\u0080\u0099t think weâ\u0080\u0099re going to get into discussing specifics of the individual business lines as you saw our pharma services revenue was down in the first quarter of the year. We are taking a number of actions to try and accelerate that growth, but it doesnâ\u0080\u0099t necessarily mean that weâ\u0080\u0099ll be effective at achieving those outcomes in time to impact the third and fourth quarters of the year. Weâ\u0080\u0099re confident that we can grow over the long-term, but we really want to shy away from giving any short-term guidance. First, Lynn, based on your conversations with Chris is the view that the company needs to commit â\u0080\u0093 is the view, the company needs to commit to an accelerated portfolio pivot to newer NGS modalities. First of all, Chris hasnâ\u0080\u0099t started yet. So I want to make sure that we give him ample time to get into the business, learn it and come up with his own perspective on the business. I would say, as of right now, we continue to be very committed to an NGS product offering that will be competitive in the marketplace, and continue to invest in those areas that are going deliver value over time. And then as a follow up, some of your industry peers are reporting delayed decision to commit to a project and some cases also reducing the number of project that enter the pipeline with efforts underway now to secure more earlier stage preclinical business, that convert more quickly. Yes, I mean, we definitely are seeing delays for the later stage project in terms of enrollment in the oncology space in particular, because of still getting out of the COVID side of things. However, we do know that opportunities are there to get these samples and from the early stage trials and get that conversion going to revenue. So thatâ\u0080\u0099s where our focus is starting to become continuing actually, but also accelerating in that space. Great to hear Chris is starting Monday, looking forward to working with him again. So volume wise, weâ\u0080\u0099re not going to provide exact guidance on the exact numbers there, but I think from the interest that we have seen at ASCO on the pharma site, itâ\u0080\u0099s been extremely positive. ASCO, I would say was where with the plenary session, the starting ovation and the data that was shown across multiple cancer types in particular. We can really say that the RaDaR technology it works in across multiple cancers and will have value there, and pharma is recognizing that. So, our goal is to get some of these deals signed over the next couple of quarters, and announce those. On the clinical side, I mean, weâ\u0080\u0099re gearing up for the MolDX, assuming a positive result from the resubmission with MolDX, and weâ\u0080\u0099ll look hopefully within the fourth quarter pending a positive feedback to launch it into the market, and weâ\u0080\u0099re geared up, weâ\u0080\u0099ve we have the precision medicine manager, the sales reps that we had planned for this year already. Our next questioner is Mike Matson, Needham. Good morning, thanks for taking my questions. So Mike, I donâ\u0080\u0099t think that the sort of duplicative operations or redundant operations really impacted our service levels in a meaningful way that, that probably wasnâ\u0080\u0099t one of the contributors. Our next questioner is Mason Carrico from Stephens, Inc.\n Hi guys, thanks for taking the question. So with RaDaR, in particular with pharma, what weâ\u0080\u0099re seeing as more interest initially on the early state site, which should then get the revenue conversion happening faster. So the initial focus early stage trial, faster revenue recognition, and then in the future will be on the more on the later stage trials that would be placed Phase 2, Phase 3 trials. At this time, I would like to direct the floor back to Lynn, our host for final thoughts. As we end the call, Iâ\u0080\u0099d like to recognize the over 2,125 NeoGenomics team members around the world for their dedication and commitment to building a world-class oncology diagnostics and information company. On behalf of our NeoGenomics team, I want to thank you for your time in joining us this morning. For those of you listening that are investors or are considering an investment in NeoGenomics, we thank you for your support and interest in our company. Thank you, ladies and gentlemen, this does conclude todayâ\u0080\u0099s conference call."
}