{
    "symbol": "NEO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 13:06:05",
    "content": " So that historically wasn't a call points, or whether it's, things like NGS that we've had for a while for a full menu, we think we're going to get more pull through from that group, rather than just the radar product or NGS. And I think you're seeing that come through, I will say one of the new ones, it's we've already gotten traction on even in the short time that I've been here is his revenue cycle management. And I think creating a focus to do a much better job there, I think you'll see a lot more cohesive, and a lot broader sales reach next year, I think that's one of the places that from a company perspective that we can do a, I think a much better job is optimizing the field organization. And candidly, we're starting to call it enterprise operations, because it really is the end to end where we think we can get significant improvement on the margin in the labs, and some of this includes a footprint, which you heard me just touch on briefly, but it's also about doing what we do better every single day. As you look at this company's horizon for the next three to five years and we're cancer care is going, I think it's going to be one of the major innovators. And I think that's where we're starting to see the start, we've actually integrated in Nevada pharma team and the Neo Pharma teams together, because the call points were the same. And I think, where we probably haven't done as good a job as we talked about units, but you have to remember if I'm selling three single gene tests, and now I'm moving to an NGS panel, you're actually growth has gone down negative two units, right, because you're doing one test versus three, but our revenue has increased significantly, as is our margin. And that's what I think you're really going to start to see in the business going forward is this accelerated growth in NGS which is going to improve AUP is going to improve operating profit, but it will have an impact there on units. So I think every quarter look, I would tell you that we've talked about what we're going to disclose on NGS, I don't think we've settled in on that, but I would tell you every single quarter that is like one of the two or three metrics that I keep an eye on, because most of these customers that we maybe not gotten the NGS business from, we own all their other testing. And I think that look, if you think about antibody as a business, I think it was back in kind of the heyday of a lot of these cancer companies that were running really hard at innovation, and ultimately trying to get the revenue and spending I don't think is under control. And I think that's something we just have to accelerate going forward and basically focus on projects, where we see that are going to add more value, not just from a formal perspective, but also from a clinical perspective, which really means focusing on modalities like molecular, like, we can't give up stuff like IHC, because we know that's part of oncology anyway, but where the growth will occur is more on the molecular side, and the whole exome side, and so on and transcriptome, that's where we see a lot of requests coming from pharma. I mean, again, I don't think we want to provide quantification, but one of the things that Chris mentioned is that we've seen continuous improvements in our turnaround time over the course of the last several months, and as you start to see improvements in customer service, then you start to see improvements in growth as well."
}