{
    "symbol": "FANG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 12:21:09",
    "content": " I think also on top of that, Neal, we're going to be growing oil production per share significantly in 2023 through two well-timed acquisitions and a significant amount of buybacks in 2022. Certainly, well productivity enhancements add to that, but that's really an output of a very difficult decision we made in 2019 to pivot away from kind of the best two zone development strategy and embrace the multi-zone full section development strategy, which we're seeing benefits of today. I don't think it's going to be 10, 15 plus, but I think generally, promising results from the deeper zones across the basin and the benefit of our position is that we hold a lot of those deeper zones, and we have a significantly large mineral company that owns mineral rights to the center of the earth forever in all those zones. And so those two deals have a higher decline rate than the base business, but I think we've managed that in our guidance and also manage that in how we're going to complete wells across the pro forma position. We kind of have shorter cycle pricing agreements I think generally, we're exposed to market pricing across the board, and we certainly have some protections in place on some of our consumables, but if we start seeing the market soften, which we feel like is a pretty good likelihood with where we see gas prices today, that should trickle down into the oil basins, particularly on the drilling services side of things first. First, we're fairly exposed to the power market, and we rode through the back half of last year fairly unhedged through the -- we're up in gas prices and that really impacted our real-time power pricing, and you've seen kind of real-time power pricing kind of stay a little elevated through the first part of 2023 here. I will say if they're -- it's going to be harder for us to sell operated midstream assets versus non-op midstream assets like the JVs that we highlighted in the back of our deck like you inferred, operated midstream assets do have an impact on LOE and financials."
}