{
    "symbol": "XENE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 22:10:08",
    "content": " Chris Kenny will provide an overview of our XEN1101 Phase 3 epilepsy program, as well as a brief summary of additional supporting X-TOLE data we released in December, and I will summarize our financial results, progress within our partnered programs, and our anticipated company milestone events. Please be advised that during this call, we will make a number of statements that are forward-looking, including statements regarding the timing of and potential results from clinical trials; the potential efficacy, safety profile, future development plans, addressable market, regulatory success, and commercial potential of our and our partners' product candidates; the efficacy of our clinical trial designs; our ability to successfully develop and achieve milestones in our XEN1101 and other development programs; the timing and results of our interactions with regulators; our ability to successfully develop and obtain regulatory approval of XEN1101 and our other product candidates, anticipated enrollment in our clinical trials, and the timing thereof; and our expectation that we will have sufficient cash to fund operations into 2026. This year, we are sharply focused on advancing XEN1101 in our Phase 3 X-TOLE2 and X-TOLE3 clinical trials in focal onset seizures, while in parallel, evaluating the efficacy of XEN1101 in primary generalized tonic-clonic seizures or PGTCS in our Phase 3 EXACT clinical trial, as well as generating important data from our Phase 2 X-NOVA study in major depressive disorder. Our team connected with many physicians and key opinion leaders at the American Epilepsy Society meeting where we presented the growing body of supportive evidence gathered to-date for advancing XEN1101 in the clinic, including additional sub-analysis of the X-TOLE data, as well as additional interim data from the ongoing X-TOLE open-label extension in focal onset seizures. So, we haven't -- as I mentioned in the prepared remarks, we haven't given formal guidance on when we expect topline data for Phase 3 and specifically for the X-TOLE2 clinical trial. So, Brian, as you mentioned, obviously, we've got a broad Phase 3 program going on in focal epilepsy and primary generalized tonic-clonic seizures and a Phase 2 study in major depressive disorder. As we're in a Phase 3 program, we do have obligations to do pediatric work, both in focal epilepsy and primary generalized tonic-clonic seizures and Chris can kind of walk you through the extrapolation rule and how we get into younger patients in both of those indications. Maybe I can start a little bit on the Phase 3 patient population and then add in and then specifically, why don't we get into a few details on urinary retention and at least what we're seeing with those two patients in open-label extension, which I think is maybe the more relevant data just because they've been on the drug a lot longer. So, our Phase 2 study that we've completed, we call X-TOLE, our two Phase 3 clinical trials in focal onset seizures or X-TOLE2 and X-TOLE3, those are identical and very similar to the design of the X-TOLE study. And in particular, on the R&D side, we're going to see an increase, and that's largely driven by the fact that we are now well underway with our Phase 3 1101 epilepsy program, and we're going to have three studies running in parallel as well as the open-label extension for the Phase 3. I think I mentioned earlier, the Phase 2 study in focal onset seizures that they're running is a smaller study than we ran in our Phase 2b X-TOLE study quite significantly smaller."
}