{
    "symbol": "XENE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 17:01:07",
    "content": "  Please be advised that during this call, we will make a number of statements that are forward-looking, including statements regarding our and our collaboratorsâ\u0080\u0099 development plans; anticipated regulatory interactions and submissions; anticipated results and related timelines; the potential efficacy, safety profile, addressable market and commercial potential of our proprietary and partnered product candidates; the efficacy of our clinical trial designs and anticipated enrollment; the potential receipt of milestone payments and royalties from our collaborators; our expectation of having sufficient cash to fund operations into 2026; and the timing of potential release of future clinical data. I will then turn the call over to Chris Kenney who will provide additional color around our XEN1101 end of Phase 2 meeting with the FDA and our next steps within our Phase 3 program, including our expansion into the additional epilepsy indication of primary generalized tonic-clonic seizures, or PGTCS. Within XEN1101, the clinical data generated today, along with feedback from KOLs and primary research â\u0080\u0093 market research findings support our belief that XEN1101 could play a particularly important role in treating epilepsy with a differentiated profile and desirable attributes such as an only in-class potassium channel mechanism and a dosing regimen of 1 pill once a day with no titration, providing meaningful seizure reduction after only 1 week of dosing. Additionally, we have strong scientific rationale, supporting the use of XEN1101 to address primary generalized tonic-clonic seizures and we are looking forward to initiating our Phase 3 X-ACKT clinical trial in PGTCS. These further support our Phase 3 development plans for XEN1101, including a time course to efficacy analysis demonstrating that all doses of XEN1101 rapidly reduced the frequency of focal onset seizures within 1 week compared to placebo. Turning to another program within our proprietary pipeline, we continue to support our ongoing XEN496 Phase 3 EPIC pediatric clinical trial evaluating XEN496 in patients aged 1 month to less than 6 years with KCNQ2-DEE. So I will pause here and ask Chris Kenney to provide some more detailed comments on our end of Phase 2 meeting with FDA, our Phase 3 clinical trial designs, as well as some additional supporting data from X-TOLE and the X-TOLE OLE, which continues to support our high level of confidence and conviction in our XEN1101 program. This meeting was supported by non-clinical and clinical data, including results from our previously completed Phase 1 trials and the positive Phase 2b X-TOLE clinical trial, evaluating XEN1101 in adult patients with focal onset seizures. As a reminder, the X-TOLE top line efficacy data demonstrated that the primary and secondary seizure reduction endpoints were statistically significant across all three dose groups, with p values of less than 0.001 for the 20 and 25 milligram groups and XEN1101 was generally well tolerated. Relying with the FDA on key elements of the Phase 3 program to support a new drug application or NDA submission, we plan to submit an NDA upon completion of the first XEN1101 Phase 3 clinical trial, X-TOLE2 if successful. And we plan to submit the NDA upon completion of the first XEN1101 Phase 3 clinical trial, X-TOLE2 if successful and we will use the existing data package from the Phase 2b X-TOLE clinical trial, along with additional safety data from other clinical trials to meet regulatory requirements. Additionally, in our Phase 2b X-TOLE clinical trial, XEN1101 demonstrated broad impact across all focal seizure subtypes, including focal seizures that progressed to generalized seizures. As I noted earlier, we have recently generated additional efficacy data from subgroup analyses from our Phase 2b X-TOLE clinical trial and these further support our Phase 3 development plans for XEN1101 and they suggest that XEN1101 may offer a compelling and differentiated option for patients seeking to quickly reduce seizure frequency. So, based on the strong Phase 2b efficacy data, we are including a secondary endpoint of Week 1 median percent change in seizure frequency within the statistical hierarchy of the Phase 3 focal onset seizure studies to build upon this differentiated profile of XEN1101. Additionally, within our analysis of the open label extension population, we are seeing seizure frequency continuing to improve after the double-blind period, along with increased periods of seizure freedom, subjects remaining in the X-TOLE OLE for at least 3 months and 12 months experience a greater than 70% and 80% reduction respectively in median monthly seizure frequency when compared to baseline. Based on current assumptions, which includes fully supporting our XEN1101 clinical development program, which includes the completion of our planned Phase 3 epilepsy studies, XEN496 and preclinical and discovery programs, we anticipate having sufficient cash to fund operations into 2026, excluding any revenue generated from existing partnerships or potential new partnering arrangements. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}