{
    "symbol": "XENE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:50:08",
    "content": " Please be advised that during this call, we will make a number of statements that are forward-looking, including statements regarding our and our collaborators' development plans, anticipated regulatory interactions and submissions anticipated results and related time lines; the potential efficacy, safety profile, addressable market and commercial potential of our proprietary and partnered product candidates; the efficacy of our trial designs and anticipated enrollment; the potential receipt of milestone payments and royalties from our collaborators; our expectation of having sufficient cash to fund operations into 2026 and the timing of potential release of future clinical data. I'm truly excited to open today's call with confirmation that we have launched our XEN1101 Phase 3 program, thereby continuing to build upon our leadership position in the KB field and driving our mission to provide new therapies for patients with epilepsy. The Xenon team is focused on executing on our ambitious development plans for XEN1101, including our 2 Phase 3 clinical trials in focal onset seizures called X-TOLE2 and X-TOLE3 and a Phase 3 clinical trial in primary generalized tonic-clonic seizures called Exact. These comprehensive Phase 3 plans build upon the foundation of the compelling data generated with XEN1101 to date, including statistically significant reduction in every seizure reduction endpoint at all doses tested in and even greater seizure reduction data in the open-label extension with greater periods of seizure freedom. Based on the strong Phase 2b efficacy data as reviewed by Ian, we're including the secondary endpoint of week 1 median percent change in seizure frequency within the statistical hierarchy of the Phase 3 focal-onset seizure trials to build upon from the differentiated profile of XEN1101. On the regulatory front, following the release of our compelling Phase 2b data, from our XEN1101 X-TOLE study, we aligned with the FDA during an end of Phase 2 meeting on key elements of our Phase 3 program to support a new drug application or NDA. To briefly summarize, we plan to submit an NDA upon successful completion of X-TOLE2, our first XEN1101 Phase 3 clinical trial along with the existing data package from the Phase 2b X-TOLE clinical trial and additional safety data from other clinical trials in order to meet regulatory requirements. Your line is open. Your line is open. But I think we're really comfortable just on where we are in the development of 1101 and the profile that's starting to emerge for that product as well, not just the compelling efficacy and you and others know about some of the subgroup analysis we've done but also the other attributes of the drug in terms of no titration, the week 1 efficacy, I think there's some really desirable attributes specifically of XEN1101 that we've seen in the clinic that we haven't seen being matched with another molecule. when we think about a rapid onset of efficacy, the lack of requirement for titration, QD dosing, all of these things are potentially unique to 1101 and while other KV7 may emerge, they'll have to compete with what is, from our perspective, a very, very compelling clinical profile that's likely to be used broadly once introduced into the marketplace. So I think it's going to be really interesting to see both a lower dose, 10 milligrams and a higher dose to 20 milligrams given the AE profile and the activity we're seeing at those 2 doses in X-TOLE and the epilepsy study. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}