{
    "symbol": "ARVL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 11:53:07",
    "content": " Our proposed plans include the realignment of the organization that we believe would allow us to deliver business priorities through at least 2023, utilizing almost $530 million cash on hand as of the end of the second quarter, plus the expected proceeds from the ATM. Moving start of production in Charlotte not only reduces our near-term cash spend, it also allows us to take better advantage of the lessons learned at Bicester to further reduce both capital and operational spending in the Charlotte microfactory, where we expect to produce both our L and XL platforms. We ended Q2 with approximately $513 million of cash and cash equivalents, have begun a restructuring of the business to reduce costs, including a targeted 30% reduction in our global workforce and today are establishing a $300 million ATM platform to sell equity into the market from time to time. And the third one is we actually taken a very conservative view because originally, we wanted to make like many shifts to push the volumes for the end of the year, but we are switching our mode to more preserving the cash, because like anything you do an extreme level, so it just costs more. I don't want to give you a particular number that to make it promise, but we are -- we believe that the Charlotte factory is going to be jewel in our -- like in our business in the way that we will -- like we are â\u0080\u0093 as I said like extremely pleased like what's happening in Bicester, but as we saw, we know many things we want to optimize. So again, to Dennis's point, we're not discussing 2023, but we do have a very unique production facility in the micro factory that lets us scale in parallel at 20,000 square meters regular warehouse like we've talked about before, off-the-shelf equipment and all our own internal processes. I think looking, sort of, out beyond 2022, we're targeting -- it's going to be lumpy as we go throughout the year, but somewhere between $100 million and $150 million of cash a quarter depending on which quarter that we're in, and sort of, how we're looking at the cash burn next year."
}