{
    "symbol": "VST",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 13:39:02",
    "content": " As it relates to 2022, while we were considerably hedged coming into the year, our open position in the summer months could now benefit from the power price environment which we expect to remain intact given the likely continued strength of natural gas prices, as I just discussed. We grew our business by acquiring Dynegy, Crius and Ambit, moving from a Texas-only company to one operating in over 20 states, delivering over $850 million a year in annual value drivers while pivoting the company to being predominantly a natural gas-powered fleet serving over four million retail customers and well positioned for future growth with Vistra Zero. Given the marks as of April 29, we now anticipate a risk-adjusted midpoint in the range of $3.5 billion to $3.7 billion for adjusted EBITDA from ongoing operations for the years 2023 through 2025. So philosophically, we are departing a bit and we are looking to hedge '24, '25, I suspect just given the way that the energy commodity price -- world markets are set up, we think this is going to be around a while and we'll roll hedges into '26, '27 and beyond because we believe that you're going to see a strong natural gas market for many years to come. But I think it's important to also note that I think the skews to the upside, especially given that commodity prices have moved up and that 3.5% to 3.7% range was a 4.29%  vintage and we've seen a pretty big move up this week alone. So think about that as $333 million a year minimum, so that gets to our $3.5 billion to $3.7 billion which is higher than where anyone was really thinking we were ahead of this commodity moves where they -- we said we're a $3-plus billion business. So we're taking that delta and saying assume $300-plus million a year, that gets you to this midpoint of the range we're talking about for three years is $1 billion. Well, Jim, I don't want to -- because I'm not going to be here after obvious one but I would expect that just the way we've normally done is later this year, after we get through the summer and also, we've done some more hedging, my guess is we'll talk about at least about '23. Sorry about the greedy question but I was just curious because it seems the biggest delimiter that you guys probably have, to your point, is really just maintaining adequate liquidity as well as probably just sourcing liquidity in the markets, especially as we probably get out past '24, '25, '26, I would think that it probably gets a little bit more thin out there and so you might have to take some discount to sort of get those hedges on."
}