{
    "symbol": "VST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 12:41:05",
    "content": " As forward power curves increased, we announced Q1 2022 that we saw ongoing operations adjusted EBITDA midpoint potential in a $3.5 billion to $3.7 billion range for years 2023 through 2025. Looking forward to the target share repurchases and dividends under the capital allocation plan between now and year end 2023, we have $1.2 billion of remaining authorization for share repurchases that we expect to utilize by year end 2023 plus $375 million in dividends targeted for payment Q4 2022 through Q4 2023. Starting on slide nine, as Jim mentioned, Vistra delivered strong financial results during the third quarter with ongoing operations adjusted EBITDA of approximately $1.038 billion, including negative $2 million for retail and $1.04 billion for generation. Despite rapidly rising power prices this year, retail's results this quarter and year-to-date are bolstered by continued strong margins and customer counts in ERCOT, along with robust large business market sales performance, partially offset by higher bad debt expense, and ex-ERCOT headwinds. Moving now to generation, the results of the generation segment this quarter and year-to-date have benefited from higher prices in the summer months coupled with outstanding performance of the fleet to be available to capture those higher prices, offset by lower prices in Q1 2022, lower generation volumes from coal plants due to industry-wide fuel delivery challenges, and higher than expected migration of customers to default service providers. As Jim mentioned earlier, we have initiated guidance for ongoing operations adjusted EBITDA with a $3.7 billion midpoint for 2023. Not only do these curves support our 2023 guidance range, but they also continue to give us confidence in the $3.5 billion to $3.7 billion of potential ongoing operations adjusted EBITDA midpoint for each of years 2024 and 2025. We were able to hedge through some of that, but the curves have come off, and we are actually still through this chart showing that through October 31 curves, which is certainly much lower than where they were at the peak of the summer, because we've increased our hedge percentage now to 70% across the years, we still feel good about the $3.5 billion to $3.7 billion. And just real quick, the last one, again, kind of back to the bridge to 2023, what are the positives on the retail side, if I just look at kind of where you are year-to-date, something like $564 million and then the range for next year, it's kind of close to $1 billion. We continue to talk about being able and in position to spend $300 million a year on the dividend and $1 billion -- at least $1 billion a year on share repurchases and paying down debt to get to three times, which primarily, we can get there, as you can see, as working capital comes back -- as margin positives come back, we could use that money to pay down debt."
}