{
    "symbol": "SPSC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 19:50:25",
    "content": " We will make certain statements today, including with respect to our expected financial results, go-to-market strategy and efforts designed to increase our traction and penetration with retailers and other customers. Please note that these forward-looking statements reflect our opinions only as of the date of this call, and we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Please refer to our SEC filings and specifically our Form 10-K, as well as our financial results press release for a more detailed description of the risk factors that may affect our results. These documents are available at our website, spscommerce.com, and at the SEC's website, sec.gov. In addition, we are providing a historical data sheet for easy reference on our Investor Relations section of our website, spscommerce.com. During our call today, we will discuss adjusted EBITDA financial measures and non-GAAP earnings per share. Thank you, Irmina and welcome, everyone to SPSâ\u0080\u0099 50th earnings conference call. SPS continues to capitalize on the retail industryâ\u0080\u0099s ongoing investments in supply chain management efficiency, digital transformation and cloud migration. Since the pandemic, trading partners have been under pressure to implement agile, seamless and resilient workflows to ensure business continuity and that need has been amplified by ongoing macro challenges. SPS is uniquely positioned to support our customers with full-service EDI, which includes access to resources to help manage increasingly complex trading partner communications and help retailers and suppliers across various industries successfully navigate challenging supply chain dynamics while they focus on achieving their business objectives. Daikin Industries, the world's number one indoor comfort solutions company and largest HVAC manufacturer has over 90 production sites worldwide. Garnet Hill, an online boutique retailer specializing in fashion and home goods chose to replace an existing order fulfillment process and adopt EDI to improve the customer experience with efficient inventory management, order tracking and increasing speed to shelf. PV Industries, a leading farm and ranch supply retailer in Canada offers a unique product mix that differentiates the company in the marketplace with an assortment of 45,000 SKUs from more than 1400 vendors. Ooni, a pizza oven company, expanded operations beyond UK and now partners with SPS across North America and Europe. Global companies such as Crocs are leveraging sell through data across their sales channels to help drive visibility, profitability, and predictability to mitigate inventory pressure across their supply chain. In summary, increasing complexity in omnichannel retail and supply chain management, continue to fuel investment in digital transformation as trading partners strive to improve collaboration and successfully deliver on today's consumer expectations. The total number of recurring revenue customers increased 12% year-over-year to approximately 38,650 and wallet share increased 4% to 10,550. In addition, the Board of Directors has authorized a new program to repurchase up to $50 million of common stock, which becomes effective on August 26, 2022, and is expected to expire on July 26, 2024. The company's November 21 program, the previously authorized repurchase of up to $50 million will terminate when the new program goes into effect. Now turning to guidance, we acknowledge the evolving dynamics of inflationary pressure and the uncertainties in the global economy, which may impact the retail industry and our customers. However, given our limited exposure to foreign exchange rate fluctuations, our pricing structure, and the role we play in supporting trading partners across all retail channels, our operating model and growth expectations remain unchanged. For the current third quarter of 2022 we expect revenue to be in the range of $113.4 million to $114.4 million, which represents approximately 16% growth year-over-year. We expect non-GAAP diluted earnings per share to be in the range of $0.51 to $0.52 with stock based compensation expense of approximately $8.5 million, depreciation expense of approximately $4.5 million and amortization expense of approximately $3 million. We expect non-GAAP diluted earnings per share to be in the range of $2.13 to $2.15 with stock based compensation expense of approximately $34.2 million, depreciation expense of approximately $17.3 million and amortization expense for the year of approximately $11.1 million. For the remainder of the year on a quarterly basis, investors should model with 30% effective tax rate calculated on GAAP pre-tax net earnings. Beyond 2022, we maintain our annual revenue growth expectations of 15% or greater and we continue to expect adjusted EBITDA dollar growth of 15% to 25% as we invest in the business to capitalize on market dynamics and support current and future growth. In the long term, we maintain our target model for adjusted EBITDA margin of 35%. In summary, SPS Commerce is well positioned for long-term growth as macrodynamics, digital transformation and the growing need for trading partner collaboration continue to fuel demand for SPSâ\u0080\u0099 full-service EDI. In other words, as eCommerce goes down, if it's going into brick and mortar, that's the first thing. What we've found in the past is, even if overall retail sales drop, what we've seen historically is the transaction volumes tend not to fluctuate. In fact, in times of uncertainty, sometimes it will actually go up as, instead of ordering a hundred shovels, they'll buy 45 twice. So, and that's the way we're paid. We're paid by trading partner relationships, primarily trading partner relationships, and then a small portion from transaction volume. So we don't, as GMV goes up as it has in the past, you're not going to see a boom for SPS Commerce in the flip side is also true. If I look back historically on time periods where it has been a little bit more difficult economy, we have seen that churn historically go up by about a percent, but that is not something that we're currently seeing. There again, there have been times in the past where there's been sort of more difficult economy, and even during those time periods, the amount of impact that it's had to our overall revenue has been quite nominal, again a percent or so. Please stand by for our next question. You know, Archie, I think in the past, you've said a lot of times ERP replacement decisions prompt a rethinking of how people are conducting ERP. A couple of things, one, I think frankly, in the supply chain world and retail, this is my personal opinion, youâ\u0080\u0099re going to continue to see some investments. And the primary reason is what retailers and suppliers did during the pandemic is they start fulfilling on the consumer's demands, but they didn't necessarily do that efficiently. And I think that includes the cloud migrations because tech typically, especially with the cloud migrations, it tends not to be a big CapEx. I will tell you what we've historically seen, which we're not seeing today, we have been not overall affected or minimally affected in a down economy. On the flip side, we've seen a little tougher sales cycle in analytics and on the supplier side. Again, we're not seeing that today, but history would tell you that is put, that is a potential. So the acquisition which closed in July, so you'll see it reflected in our Q3 results added about a net 500 additional customers. The ARPU for that 500 net new customers is around 12,000. So all in, when we combine the two together, it's very, very nominal impact to that overall combined ARPU. A reminder when we announced that acquisition, we said in 2022 we anticipated it would add about $2.5 million of revenue and be slightly negative on adjusted EBITDA, again about 300,000. We think we have additional ways to add value to those customers, which would potentially allow us to monetize that. Please stand by for our next question. Your line is open. Hi Archie and Kim, congrats on the good quarter, and thanks for taking my questions. When you consider the secular demand for fulfillment solutions, if you look back at 2008 or 2009, I think you would characterize that as a very strong demand environment, especially for cloud because it was building momentum. Yes, overall we think it's, there's a ton of potential. And actually we think what's happened over the last two years should benefit us for some time, as again, retailers in my opinion really fought to meet the demands of the consumer over the last two years, but they aren't doing that necessarily efficiently or effectively. And again, we went public off our numbers in 2009, which were very strong and in 2009 what we saw was a weakening -- a strengthening of our retailer leads, as retailers, this became a higher priority for retailers. And then Kim, your revenue outperformance in the quarter was one of your, we'll call it smallest that I can remember off the top of my head, yet your customer additions, your net customer additions were actually quite strong in the quarter at roughly, I think 750 by my count. But to your point, one thing that was a bit different than we had anticipated, we actually had a higher net customer adds of 700 plus in the quarter, which is higher than it's been the last couple of quarters. And so that part was a bit different than we thought in a positive direction, but do keep in mind, typically what happens is when we add more customers through enablement campaigns, et cetera, a lot of times those are going to end up being smaller revenue customers initially, and then we certainly have the opportunity to grow that book of business with those customers over time. And when you look at those customers, there certainly is an aspect of that, that they're smaller than average customers. Please stand by for our next question. Your line is open. We continue to see probably a little more momentum in the distribution area than any place, but overall it's been relatively consistent. Yes, well a couple places, in Europe that is, we're primarily attacking Europe with our analytics product and we continue to see really nice momentum. Now that could be just a factor of we're off a very, very small base, but we aren't seeing any slowdown on that side. And then finally the Carrier Service solution, I think it's been a couple of quarters since it's been introduced. Yes, I think it -- well, it's contributing as we had mentioned a very small portion. Please stand by for our next question. Your line is open. In Europe, it's a little bit different story just because we're coming off a small scale. So yes, again, we've we got a big place to fish and we're not seeing that. Again, I think if you go into continued recession, history would tell you, and we're not seeing that right now, history would tell you that the puts and takes under the covers of our business is we would see stronger retail business. Overall, it would look more or less the same, but a lot of puts and takes underneath. We didn't see that many retail bankruptcies and those are always factored in if itâ\u0080\u0099s 1, it might be 1%. So a lot of times when somebody goes bankrupt, there's a small fee from many suppliers that gets -- you bring the revenue down from those suppliers. I would say overall, I mean, a lot has been made about bankruptcies and retail over last four or five years, but really when you look at who has primarily gone bankrupt its companies that had big debt infrastructures did not invest into their business, you take like a five, six years ago, sports authority, big they hadn't invested in their stores. So, obviously always a risk, but with over 3000 retailers in the network, feel pretty good about the minimal exposure. Your line is open. Kim, you did mention that your customer ads were stronger on the small side than usual, yet you did have a really nice solid Q-over-Q increase in ARPU. When you think about the comment that I was making is, we had a pretty high net adds of approximately 700. Ladies and gentlemen, please stand by. Ladies and gentlemen, please stand by. Nehal to answer the question that you had, you were asking as it related to customer, as well as the wallet share. So the comment that I was making is that in the quarter we had approximately call it 700 net customer adds, a little bit higher than we've had the last couple of quarters. And just as a reminder, the vast majority of our net customer adds comes through community campaigns. So the comment that I was making is typically when we get those customers for the first time through community, they tend to be a smaller than average ASP size and then we have the opportunity to grow that business over time. So, that's reflected to the -- my comment as related to the 700 customers. If you look at it from a growth rate perspective, last quarter, it was a 5% increase. If you look at the wallet share increase on a Q-over-Q basis and then annualize that, it's even better than the 4%. So if you look at the overall results of our business, we had very strong performance on both fulfillment and analytics. And then the output of that is, there's also a concept of number of customers and then in the wallet share. So if you look at the strength of our business and fulfillment and analytics, you can also look on analytics that increased about a percent sequentially in year-over-year growth that went from 11% to 12%. Our expectation is overall, the growth rate of the combined companies will remain at what we have stated where -- which will be 15% or greater for the foreseeable future. Our next question comes from the line of Joe Goodwin, JMP Securities. Your line is open. Although of course we'll hire in all areas, weâ\u0080\u0099ll in particular focused on the customer success area, as well as sales, made nice progress in the quarter, in both of those areas and will continue to make investments to meet not only our existing customersâ\u0080\u0099 needs and expectations, but also in the growth opportunities we see going forward. One of the things we've done over a long, long period of time is get to know the people in the industry and the competitors. So Steve Smith, the CEO there, I've known for a decade and had different conversations along the time and all of these, the seller needs to be prepared to sell at a reasonable price and want to sell. So most of these, a lot of these are multi-year relationships where you've build trust over a period of time and watch their business. Ladies and gentlemen, this concludes today's conference call."
}