{
    "symbol": "WEAV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 14:12:02",
    "content": " Meanwhile, we've increased subscription and payments revenue $6.6 million with only addition of $2.4 million in operating expense, much of which was due to us becoming a public company in November of last year. While the financial benefits of these positive trends and our outlook on ongoing customer engagement may take time to realize, it is clear that during 2022, we have realigned our capabilities and resources to support the next phase in the company's evolution, including significant year-over-year improvements in both non-GAAP gross margins and operating margins, and we will aggressively focus on profitable growth and continuing improvement in free cash flow with an emphasis on getting to breakeven. In addition, our gross revenue retention rate remained at 94%, where it has been for the last four quarters, with signals that our specialty health care customers remain stable and avid users of the Weave platform even during the evolving economic conditions. During Q3, our non-GAAP operating expenses increased by roughly $2.4 million, compared to a year ago period versus a $6.6 million increase in subscription and payments revenue for the same period. We made the decision to offer our customers a more fully integrated Digital Forms product built by Weave, and our full-year 2022 revenue guidance provided throughout this year anticipated that the transition from the partner product to an in-house product would occur in 2023. For the full-year, we expect total revenue to be in the range of $140.5 million to $141.5 million, which is $3 million higher than the initial 2022 expectation we provided on our March 2 earnings call, but is a $1 million decrease versus our previous midpoint expectation given on August 3 due to the forms product transition. We expect our full-year fiscal 2022 non-GAAP operating loss to be in the range of $34 million to $33 million, which assumes improvement in our operating loss as a percent of revenue."
}