{
    "symbol": "WEAV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 22:35:05",
    "content": " Joining me on the call today are Roy Banks, Chief Executive Officer and Alan Taylor, Chief Financial Officer. Full details of our results and additional management commentary are available in our earnings release, which can be found on the Investor Relations section of the website at investors.gateweaeve.com. Before we start, I would like to remind you that the following discussion contains forward-looking statements within the meaning of the federal securities laws, including but not limited to statements regarding Weave's future financial results and management's expectations and plans for the business. Factors that could cause actual results to differ from the forward looking statements can be found on our form 10-K filed on March 23, 2022, which is accessible on the SEC's website at www.sec.gov and also available on our website at investors.gateweave.com as may be supplemented in subsequent periodic reports we filed with the SEC. Any forward-looking statements made in this conference call including responses to your questions are based on current expectations as of today and Weave assumes no obligation to update or revise them, whether as a result of new developments or otherwise except as required by law. For reconciliation of each of these non-GAAP financial measures to the most directly comparable GAAP metric, please see our earnings press release which is available in the IR section of our corporate website at investors.gateweave.com. Now I will turn the call over to Roy, Chief Executive Officer of Weave. First and foremost, I want to share my appreciation for all of the hard work our Weave team has put in this quarter to make it as successful and exciting time. As mass mandates lifted and COVID cases dropped over the course of the last few months, we saw a more lively office here in our beautiful Lehi, Utah headquarters, combined with a renewed focus and commitment to our customer base. We had a great first quarter to open 2022 as we continue to deliver a leading communications and engagement platform that unifies, modernizes and personalizes customer interactions. As we meet with customers, they continue to emphasize a few things. Next, consumers increasingly expect seamless purchasing and interaction experiences on devices and services that they're accustomed to using in their everyday lives. Lastly, is the challenge of personalizing customer interactions. We implemented a number of changes and improvements meant to evolve our company and better serve the needs of our customers in our core vertical markets which are dental, optometry and veterinary. On our last earnings call, we announced several important changes to our go-to-market strategies to build a more efficient and productive sales and marketing function that included the following; we sharpened our focus on our digital marketing capabilities to better generate higher quality top of the funnel inbound sales opportunities. We implemented updates to how we manage and distribute leads, drive daily sales activity and prepare customers for successful onboarding onto our platform. We continue to attract, hire and train highly engaged and motivated sales personnel to accelerate our revenue growth. With these changes, we're seeing early signs of improvement in our overall sales motion through higher lead quality, more efficient lead distribution and increased conversion rates. Collectively, we expect that these changes will enhance the predictability of future sales performance. In addition to optimizing our internal go-to-market processes, we have expanded our nascent IT channel partner program since its launch in Q3, 2021. Meanwhile, we continue to benefit from the resilience and strength of our customer base. Last quarter, we announced the signing of our largest ever customer engagement dental care alliance, which operates more than 370 locations across the country. In addition to the go-to-market improvements we made in the quarter we also made progress across our payments, strategic partner and technology areas of the business. This continued positive trend reflects recent updates to our payment solution, including enhancements to our support for level two processing and our text to pay pricing, both of which have resulted in a higher net yield rate. Provet Cloud integration with Weaves platform includes a seamless synchronization of pet information, appointments, and billing collections data along with recalls and vaccine reminders. This new version of digital forms provides expanded capabilities, including right back for key integration partners like Dendrix, Eagle Soft and Open Dental, an updated user interface and usability designed for easier and faster navigation,  activities, pages and filters so staff can quickly identify patients with missing forms, and the introduction of kiosk mode, allowing patients to use a self service kiosk in the office to finish incomplete forms. These updates give practices more flexibility and help patients schedule appointments directly from the website, saving them time each day and capturing more business. These updates include customization of the offices online calendar with appointment types, provide and schedule availability, giving patients the information they need to book the most convenient appointment without picking up the phone. As mentioned on our last conference call over the past year, we've continued to build out and strengthen our executive leadership team to grow and scale our business as a public company. Our April 21 press release outlined expansion of our leadership team that will further drive improvements in our strategic planning, operational discipline and execution, and most importantly, our financial results. He will now serve as our President and Chief Operating Officer to leverage the extensive staff and payments experience he gained as the former Chief Operating Officer and Chief Financial Officer of Mind Body where he scaled operations, completed acquisitions and raised private and public capital. He comes to us with an extensive background in product development, and will play a critical role in driving our vision of helping small and mid market businesses thrive by using our own one communications and engagement platform. I'm excited to share the results of Q1, 2022 with you as our quarterly revenue of $33.3 million reached a new record high and exceeded our guidance. Additionally, we improved our non-GAAP gross margin to 59.1% from 57.4% in Q4 of 2021. And we also improved our non-GAAP operating margin to negative 30.3% from negative 33.3% in Q4, 2021. Our total revenue grew 30% year-over-year to reach $33.3 million, reflecting continued strength in our net revenue retention of 103% and continued adoption of our payment solution. However, the value we drive through our core offering gives us a stage to deliver value added products and services to our customers such as payments, reviews and forms enabling them to unify, modernize and personalize every customer interaction. The value of the Weave platform is manifest in the strong gross revenue retention rate we enjoy, which was 94% again this quarter. Once customers have onboarded to our communication and engagement platform, our payments offering is a natural extension of the customer interaction. In Q1 of last year that program contributed $800,000 in non-recurring revenue. These IT providers now engage directly with our customers to configure hardware, install software and assist with upgrades. These improvements reflect the positive effects of replacing third party product offerings with internally developed solutions, such as our forms and reviews products, economies in our own hardware costs, and the cost savings associated with the elimination of the partner installation program just referenced. We are beginning to see the scale of customer hardware cost, which increased by only 14% less than half the rate of our revenue growth through a combination of fully depreciated hardware and actions to reduce the initial outlay of new customer installation costs. The Q1, 2022 non-GAAP operating loss of $10.1 million represents a negative 30.3% operating margin and is $900,000 better than the top end of our guidance range. Q1, 2022 operating loss of 30.3% decreased 350 basis points compared to Q1 of 2021 and improved by 300 basis points compared to the prior quarter. Additionally, Q1, 2022 expenses reflect the first full quarter of being a publicly traded company compared to the prior quarter the 300 basis point improvement is due to 170 basis point improvement in gross margin and 130 basis point improvement in operating expenses. Non-GAAP net loss was $10.4 million, or $0.16 per share in the first quarter, based on 64.6 million weighted average shares outstanding. Adjusted EBITDA EBIT loss was $9.1 million, representing a negative 27.4% margin and a $2.8 million increase from a loss of $6.3 million in Q1, 2021. And upon adoption, we adjusted the balance sheet to reflect the operating lease liabilities of $52.8 million, the majority of which is related to the office space lease agreement for our corporate headquarters. Additionally, in Q1, we had a free cash flow usage of $5.1 million which was an improvement of $2.5 million compared to the prior year period. This improvement reflects the lower usage of operating cash flow and reduced purchases in property, plant and equipment as we completed the opening of a new office last year. As of March 31, we had $128.9 million in cash and cash equivalents. For the second quarter, we expect total revenue in the range of $33.0 million to $34.0 million and a non-GAAP operating loss in the range of $11 million to $10 million. For the full year fiscal 2022 we are raising our guidance for total revenue to $139 million to $142 million which represents a $2.5 million increase compared to our previous midpoint expectation and we reiterate a non-GAAP operating loss in the range of $40 million to $36 million. I guess first one, just on the changes you're making to the sales and marketing organization, obviously, certainly you guys talked at length on the last quarter's call. So first and foremost, yes we're very happy and encouraged by the progress that we've made so far. The real outcomes and benefits that we've seen thus far, some of which have been reflected in the performance of Q1. But it's really been around our insights into the top of the funnel, and all the metrics that give us more clarity, visibility, predictability, and ways to increase our sales capacity or performance and the sales activity and ultimately productivity. The systems that we've implemented, we really think that we're, we're tracking right where we thought we would be. In terms of expectations going forward, I think, as we look into the second half of the year, I think that's where you'll start to see a lot of the benefits of what we've done in the first part of the year really start to take hold and really gain traction. So just in the prepared remarks, it sounds like at least in the first quarter there seems to be kind of a refocusing on core verticals. And maybe being a little more deliberate about going after new verticals, especially with these go-to-market changes going on. Any color you can give on kind of the vertical, sorry, the perspective that you have on the vertical expansion strategy from here and especially as it pertains to some of the opportunities you mentioned in home services and others in recent quarters\n Yes, yet, we still very much believe in the vertical dominant growth strategy. However, given the opportunities in the near term that we see with the core markets of dental, Opto and vet, we're very excited about those markets. And given that we're less than 10% penetrated in each one of those verticals, we really just want to go deep in those. We continue to find new customers, we've done that this quarter. Just kind of wanted to see if you guys can provide in the update, or if you guys are providing the update on your customer account, as well as any improvement in gross additions that COVID has pulled back. The customer count, we determined to disclose that on a once a year basis. We continue to grow, but yes, we'll be providing the customer count just on an annual basis. Well, we continue to maintain cautious optimism about the return to live events. So but in terms of like our efforts to continue to develop, and really hone in our digital marketing and demand generation efforts, we remain very committed to that. We hired our CMO, Chris Baird earlier this year, and very happy with the progress that we're making there and really excited about the multi prong strategy that we have now in our demand generation and lead acquisition efforts. And so when events continue to make a surge or come back, we're going to be prepared to take advantage of those. Well, as you all know we're not unique in the labor market challenges that have affected companies throughout the country. But we have seen a little bit of a slowdown, especially in the sales area through some of the go-to-market actions that we've taken. So we've been able to really kind of, really I think, address that in a positive way. But Weave in particular, given where we are located here in Silicon slopes, we continue to be recognized as an employer of choice, both within and outside of Utah quite frankly. So as long as we continue to treat our people well and do right by them, I think we're going to continue to be able to weather the hiring challenges in the labor market issues that we've been competing in. Thank you very much. But we also in particular with the changes that we made in our go-to-market area, based on the changes there we kind of moved away from the SDR model went to a full cycle  model that has really attracted a lot of impressive talent, people that really want the sales opportunity and the compensation alignment that we have in the rewards that we provide. So with a lot of the efforts that we've made in that group and within the go-to-market areas, I think that we've really put ourselves in a great position to acquire and hire excellent talent within the company. So right now, our onboarding schedules that we have in boarding new customers from that deal are in line with the needs and resources of the customer and our capacity here at Weave to support that effort. We do not report on our clients, individual location progress, but I can tell you that we're very comfortable that by the end of the year we expect to have most if not, all of that entire customer base on boarded onto the Weave platform. But we have been watching that, and I think it's going across the board in the first quarter. This is not only because of the P&L benefit that Alan described during his opening remarks, but quite frankly, the experience that we're delivering to our customers, because they are dealing with a local IT professionals that are on-site, on the scene and can provide a much better service experience than we were providing previously. Secondly, we've developed a great referral relationship out of our IT channel partner. So when you look at the referrals because we now have that commercial and partnership relationship, they're part of a program, we're able to derive referral leads that we can then bring in house and work in close. And they've done a wonderful job building a very world class program in their selection of partners, their curation of partner and bringing partners on board, training them on Weave, and really getting them excited about the weave opportunity. Thank you very much. We've continued to refine the sales process, making sure that once the product is sold, that the equipment is registered and the usage is going up. And let me just add, one of the things that we're excited about is when we recently and we announced that we hired a payment sales leader to really kind of drive more focus on payments and that was evident in the performance of the company in Q1. And so we're looking really at efforts to not only attach at the point of sale, but also on an upsell basis so that we can increase the awareness of the benefits of our payment solution. And also, keep in mind we're starting to see the results of that as more and more existing and new customers understand the different modalities of payment, acceptance that they can use to hasten their cash flow and their revenue. We're going to get existing customers who are looking for communication and engagement platform or solutions reaching out to us and also we're going to be able to go and approach customers, may not to be aware of Weave or the benefits of our solution or platform. But because we have that integration, we can give them a full enriched Weave experienced because, as you know, integrations with PMS platforms or systems of record is really how you recognize and realized the full benefit of the Weave platform are offering. And I might say that, look we're really excited about Provet. We're excited to be their partner, they chose us, they recognized us as a leading provider of communication and engagement solution technology. As always, I'd like to thank everyone for being on the call, taking an interest in Weave and your support. Thank you very much."
}