{
    "symbol": "EIC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 13:23:12",
    "content": " Before we begin our formal remarks, we need to remind everyone that the matters discussed on this call include forward-looking statements or projected financial information that involve risks and uncertainties that may cause the company's actual results to differ materially from those projected in such forward-looking statements and projected financial information. A replay of this call can be accessed for 30 days via the company's website, www.eaglepointincome.com. Thank you, Peter, and welcome everyone to Eagle Point Income Company's second quarter earnings call. And with a rising rate environment, our portfolio we believe is very well positioned to generate significant additional income through our investments in floating rate CLO junior debt. For the quarter, our net investment income and realized gains were $0.41 per share. Our recurring cash flows were $5.7 million, which is a 12% increase from the first quarter and exceeded our regular common distributions and expenses by $0.21 per share. Due to our confidence in the portfolio and EIC's outlook, we raised our monthly common distribution by 12% to $0.14 per common share beginning in October. Quite simply, the rapid increase in LIBOR has been materially positive for our junior CLO debt portfolio, and should further increase the Company's net investment income in the third quarter of 2022. Frankly, it is an exciting time for our portfolio, and the rising rate environment increasing cash flows and our confidence in our future outlook drove last week's announcement of a 12% increase in our monthly common distribution. Along with the rising rate environment, our proactive management of our portfolio mix to increase its allocation to CLO equity has further assisted the company to increase its cash flows and net investment income. While we continue to keep a close eye on the U.S. economy, we expect to continue deploy capital at attractive levels and believe the Company is positioned to do quite well over the coming quarters. Looking at the market overall, there were mere two syndicated loan defaults in the second quarter, and as a result of the 12-month trailing default rate remain near historic lows ending June at 28 basis points. For the second quarter of 2022, the company recorded net investment income and realized capital gains of approximately $2.9 million or $0.41 per share. When unrealized portfolio depreciation is included, the Company recorded the GAAP net loss of approximately $17.9 million or $2.56 per share. The Company's second quarter net loss was comprised of total investment income of $4.4 million and de minimis net realized gain upset by unrealized depreciation of $20.8 million and total expenses of $1.5 million. During the second quarter, we paid three monthly distributions of $12.5 per share, and they will also pay that amount monthly till September. As of June 30 2022, the company had outstanding warrants from revolving credit facilities, and preferred equity which total approximately 39% of total assets, less current liabilities. Due to lower portfolio valuations at the end of the quarter, the leverage ratio was above our target leverage ratio range of 25% to 35%, at which we expect to operate the Company under normal market conditions. As of June month end, the Company's net assets volume was approximately $95.6 million or $13.66 per share. Moving on to our portfolio activity in the third quarter to July month end, management and audited estimate of the Company's NAV as of July 31 was between $14.18 and $14.22 per share, with the midpoint of the range up 4% from our NAV as of June 30. As in July month end, net of pending investment transactions, the Company had approximately $7.0 million of cash and revolver capacity available for investment. It was certainly a solid first half for EIC with our portfolios, current construction and the rising rate environment that we're in, EIC is poised to generate increased cash flows moving forward, which will be directly beneficial to our NII and our ability to continue disturbing large amounts of cash to our shareholders. The potential for higher returns compared to similarly rated corporate securities, and then the benefits CLO debt offers in markets with rising rate environments and indeed today we are seeing significantly rising interest rates. Along with the locked in nature of the financing of CLO's that is longer than a CLO's assets, we believe our portfolio construction and the rising rate environment position us well and remain confident that EIC is well positioned to continue generating compelling risk adjusted returns and value for our shareholders."
}