{
    "symbol": "FICO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-09 23:07:10",
    "content": " For the full fiscal year, we delivered $374 million of GAAP net income and $14.18 of earnings per share. Full year non-GAAP net income was $454 million, up 19% over last year, and non-GAAP EPS of $17.22 was up 32% over the previous year. Q4 free cash flow was $144 million, bringing the fiscal year total to $503 million up 21% from the previous year. In our Software segment, we delivered $175 million of revenue, up 5% from last year. Total revenue for the fourth quarter was $349 million, an increase of 4% over the prior year. In our Scores segment, revenues for the quarter were $174 million, up 3% from the same period last year. Our B2C revenue was down 3% from the same period last year, due primarily to the impact of fewer new subscribers on our myFICO.com platform, a trend we highlighted on last quarter's earnings call. For the full year, Scores revenues were $707 million up 8% from last year despite sizable headwinds in the mortgage origination space. Software segment revenues in the fourth quarter were $175 million, up 5% versus the same period last year. Full year software revenues were $671 million, up 1% from the previous year and up 9% after adjusting for our 2021 divestitures. Our Software ARR at the end of the fourth quarter was $569 million, a 9% increase over the prior year quarter. Our platform ARR was $114 million, representing 20% of our total fourth quarter ARR, and a growth rate of 52% versus the prior year. Our non-platform ARR was $455 million in the fourth quarter, which was 1% higher than the prior year. Turning now to our expenses for the quarter, total operating expenses were $215 million this quarter versus $219 million in the prior year. As a reminder, last year's GAAP net income included a gain of $100 million on product line asset sales and business divestitures. For the full year, free cash flow was $503 million up 21% from last year's $416 million. Non-GAAP net income of $487 million and non-GAAP earnings per share of $19.42, increases of 7.5% and 13% respectively. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}