{
    "symbol": "FICO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-03 23:09:08",
    "content": " As you can see on Page 2 of the presentation, we reported revenues of $349 million, an increase of 3% over the same period last year or 7% when adjusted for last yearâ\u0080\u0099s sale of our collections and recovery products. We delivered $93 million of GAAP net income and GAAP earnings of $3.61 per share, up 21% and 36%, respectively, when adjusted for last yearâ\u0080\u0099s gain on sale. On a non-GAAP basis, net income was $116 million, up 17%, and earnings per share of $4.47 was up 32% from last year. In our Software segment, we delivered $170 million of revenue, up 2% from last year and 11% after adjusting for the divestiture. Total revenue for the third quarter was $349 million, an increase of 3% over the prior year or 7% after adjusting for the divestiture of our Collections and Recovery product line last June. In our Scores segment, revenues were $179 million, up 4% from the same period last year. As Will mentioned, we continue to see a decline in mortgage origination revenues, which were down 25% from the same quarter last year. FICOâ\u0080\u0099s Software segment revenues in the third quarter were $170 million, up 2% versus the same period last year or 11% after adjusting for the divestiture of our Collections and Recovery business. Those revenues were $27 million this quarter, up slightly from last quarter, but down 24% from the same period last year, much of it due to last yearâ\u0080\u0099s divestiture. Our Software ARR at the end of the third fiscal quarter of 2022 was $561 million, a 9% increase over the prior year quarter. Platform ARR was $108 million, representing 19% of our total third quarter ARR, with a growth rate of 60% versus the prior year. Our non-Platform ARR was $453 million in the quarter, up 1% from the prior year. Software sales were again strong this quarter, with annual contract value bookings of $19 million versus $11.6 million in the prior year, an increase of 64%. GAAP net income this quarter was $93 million, and our GAAP EPS was $3.61, which was down from last year when we had a $93 million pretax gain on sale of our collections and recovery product line. Our non-GAAP net income was $116 million for the quarter, up 17% from the same quarter last year. Free cash flow for the quarter was $115 million, up 16% from the same period last year."
}