{
    "symbol": "PAM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-13 15:39:10",
    "content": " In 2022, we raised our peak gas production to more than 11 million  per day and currently working to ramp it up to 60 million in 2023, thanks to the plan as last tender. The adjusted EBITDA amount to $183 million, 7% less year-on-year, mainly because of lower PPA income and some contracts mature in Loma in late 2021 and Varadan  in April last year as well as Loma gas line number 5 outage, higher payroll in dollar terms and lack regulated tariffs affecting . As seen on Slide 5, we posted an adjusted EBITDA of $86 million in Q4, down 19% year-on-year and 4% quarter-on-quarter, mainly due to the end of some PPAs, the outages at Loma number 5 unit and higher pace expenses offset by better spot prices, higher dispatch and lower maintenance costs. This is mainly due to the last year's overhauls at Loma and , more gas for Central Piquirenda; outstanding water import in PCP Corfu and capacity factor at wind farms, partially offset by Lomas number 5 unit outage and West liquids and Bolivian gas. 57% higher year-on-year because of the plan gas deliveries, gas export prices and higher oil and gas -- oil demand and prices, offset by lesser gas export volume and increased costs related to the growing activity and payroll. In Q4, our total production averaged almost 62,000 barrels per day -- so mining, crude oil represented 9% of our output, still it reached 22% of the segment's revenue, mostly because of export prices linked to Brent and export volumes which tripled compared to last year. Furthermore, regarding the tender tapping the first stage of the new gas pipeline to be online on July 23, Pampa  got awarded 4.8 million out of the 11 million cubic meters per day at a similar price previous tenders until 2028. Our gas production in Q4 was 6% up year-on-year but 11% down quarter-on-quarter due to seasonality, averaging 9.5 million cubic meters per day and outpacing the levels that only grew 2%. 72% of the quarter's production came from Evangruco, where we commissioned the second gas treatment plan last November with a capacity of 4.8 million cubic meters per day replacing temporary facilities and covering subsequent winter ramp-up. The average gas price of the quarter was $3.9 per mmBTU, 24% up year-on-year due to export prices but 20% down quarter-on-quarter because of seasonality. Once the new pipeline is online by mid-winter, we expect to be able to jump our production to 16 million cubic meters of natural gas per day. And in the fourth quarter during our spring and with the new pipeline working, we expect our production -- our sales to be in the range of 12 million to 13 million cubic meters per day. But -- so these months, so far, CAMMESA has burned liquids in an equivalent to almost 11.6 million cubic meters of natural gas per day. 11.5 million cubic meters of natural gas per day at $21 per million of BTU for 7 months, that is -- that amount to $1.9 billion. Once the new pipeline is ready, the country will be able to replace all these consumption of liquids with local natural gas that -- thanks to the plan gas, Argentina is going to be able to buy from producers at $3 per million cubic meters per day -- sorry. In terms of volume, we are expecting first and second quarter, while there is no new infrastructure capacity to extract the gas from the Neuquina Basin to our volumes to remain below 10 million cubic meters of natural gas per day. Once the new pipeline is ready during the winter, our production should jump to around 16 million cubic meters of natural gas per day. And by the end of the year, during our spring going back probably to 13, hopefully 14 -- between 12 million and 14 million cubic meters of natural gas per day. But also, it may happen that even with the new pipeline that will bring an increase in evacuation capacity from the Neuquina Basin of 11 cubic meters of natural gas per day. And for E&P, we will be certainly doing the most aggressive CapEx plan over the past few years in order to be able to increase our production from 11 cubic meters of natural gas per day to 16 million cubic meters of natural gas per day."
}