{
    "symbol": "PAM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 10:06:07",
    "content": " Revenues increased by 32% year-on-year to $555 million, driven by gas exports, commodity prices updated legacy prices and Energia Plus. The adjusted EBITDA amounted to $226 million, 11% up year-on-year and 13% up quarter-on-quarter, explained by the same reasons detailed before, offset by higher expenses, intense E&P activity and lower petchem margins. As seen on Slide 4, we posted an EBITDA of $121 million in Q1, 5% up year-on-year and 15% up quarter-on-quarter, mainly contributed by higher spot prices and thermal B2B margin besides the outage that happened Barragan last year. Even though it was an off-peak season, we posted an adjusted EBITDA of $56 million in Q1, 30% up year-on-year and 22% up quarter-on-quarter, mainly boosted by export volumes and prices, higher industrial gas demand, offset by increased costs related to the growing activity and export expenses. Our total lifting costs increased by 32% year-on-year, but it's 27% down quarter-on-quarter, explained by the increased activity to keep a high production level to export more and prepare for the 2022 cash winter commitment. On the oil side, which represented 24% of the segment's revenue in the quarter, the volume sold was 62% up year-on-year and 12% up quarter-on-quarter, being 5,200 barrels per day. Regarding gas, as shown on Slide 8, our volumes still maintained at 9 million cubic meters per day since the  2021 winter, placing the off-peak surplus on exports and local industries. So everything has to happen very soon and without any major complications, but it's still possible to reach -- to have the new pipeline ready that will add 11 million cubic meter more of production -- evacuation capacity out of the Neuquen Basin for next winter. Regarding facilities, we are currently -- we have been working for the past 1.5 years, I think, already on a big expansion in El Mangrullo, a new gas treatment plant for almost 5 cubic meters of natural gas per day. And regarding drilling, we have just finished the campaign we are finishing the campaign that elevated our production capacity from the level of 9 million cubic meters per day that has been what we have been producing throughout all the summer in the third quarter of last year and the first quarter of this year. Now that the PPA, the old PPA expire and the new PPA is ramping up by the third quarter, fourth quarter of this year, pro forma a year for, it's around $130 million of EBITDA, bulk -- the combined cycle."
}