{
    "symbol": "FORG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 20:49:03",
    "content": " ForgeRock is a growth company with a huge opportunity, and we remain focused on making measured investments to drive robust and durable long-term growth in the range of 30% as we march towards achieving our non-GAAP operating margin profitability sometime in the back half of 2023. And lastly, we are marching towards reaching non-GAAP operating margin profitability sometime in the back half of 2023 through measured investments to support the growth of our business the long term and achieving operating leverage as our revenue growth begins to more closely align with our ARR growth, which has been impacted by our SaaS transition in the most recent periods. For the third quarter of 2022, ForgeRock expects total ARR of $208 million to $211 million, representing 28% year-over-year growth at the midpoint. For the full year 2022, ForgeRock now expects total ARR of $225 million to $232 million, representing 25% year-over-year growth at the midpoint. Your line is open. And so we did build some of those strategic reductions, but also with an eye towards really importantly, all running our 3-year plan out, looking at that, looking at making sure we're feeding that the future, obviously, around R&D customer success, sales and marketing but also really importantly, to ensure that we could reaffirm that target around that profitability somewhere in that back half of 2023. Your line is open. Your line is open. Your line is open. And I was fine with one of our larger financial services customers over the past couple of days who are just are looking at opportunities to further use ForgeRock and other business lines as they continue to grow as an organization or I talk to brand new prospects, a technology company here in Silicon Valley that has done a takeoff and selected ForgeRock they're now in our pipeline here this quarter. Your line is open. Your line is open. Your line is open."
}