{
    "symbol": "WTFC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 16:19:11",
    "content": " Second, as we experience increasing rates, we continue to believe each 25 basis point increase in rates will generate in excess of $40 million of pretax net interest income on an annualized basis, which equates to approximately a 10 basis point improvement in margin. Starting with the net interest income, for the second quarter of 2022, net interest income totaled $337.8 million, that was an increase of $38.5 million as compared to the prior quarter and an increase of $58.2 million as compared to the second quarter of last year. The net interest margin improvement of 32 basis points from the prior quarter brought us to 2.93%, a beneficial increase of 36 basis points on the yield on earning assets and a 3 basis point increase in the net free funds contribution, combined with an offsetting 7 basis point increase for the rates paid on liability resulted in the improved net interest margin. Although the provision expense was higher in the second quarter, I want to make clear that the increase was largely a result of providing for this quarter's exceptional loan growth of approximately $1.9 billion, excluding the PPP loans. However, mortgage banking revenue decreased by $43.9 million from the first quarter, primarily due to the valuation changes related to the mortgage servicing rights and early buyout loans guaranteed by the US government agencies, which are also held at fair value. We recorded investment losses, as Ed mentioned, of $7.8 million during the second quarter compared to net losses of $2.8 million in the prior quarter -- related primarily to equity valuations being impacted by market conditions on a portion of our securities portfolio. If we turn to noninterest expenses, they totaled $288.7 million in the second quarter and were up just 2% or approximately $4.4 million when compared to the prior quarter. Lending related expenses were down approximately $2.6 million from the prior quarter, primarily as a result of lower mortgage banking related expenses and travel and entertainment expenses increased by $1.2 million over the prior quarter as the work environment continues to revert back to pre pandemic business customs and relationship managers are able to engage more routinely with clients and potential clients. The net overhead ratio, as Ed mentioned, stood at 1.51% for the second quarter and was negatively impacted by the $7.8 million of security losses and $2.5 million of the property charges."
}