{
    "symbol": "WTFC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-19 15:17:07",
    "content": " Grew earnings per share of fourth quarter $144 million, $145 million, compared to $142 million, $143 million in the third quarter and about $99 million in the fourth quarter of 2021, earnings per share $2.23 for the quarter, $8.02 for the year, compared to $7.58 for the previous year. The approximately $1 billion of growth for the fourth quarter was 11% loan growth on an annualized basis, which continues to be spread nicely across all major loan categories. For the fourth quarter, capital ratios were stable to up slightly and remain appropriate given our risk profile and with the higher net interest margin and currently forecasted loan growth, the companyâ\u0080\u0099s earnings are projected to result in organic improvement to our capital levels in the coming quarters. As a 38-basis-point improvement in the margin brought it to 3.73% in the fourth quarter, a beneficial increase of 84 basis points on the yield on earning assets and a 22-basis-point increase in the net free funds contribution, combined with the negative impact of a 68 basis point increase on the rate paid on liabilities resulted in that improved net interest margin. Turning to the provision for credit losses, Wintrust recorded a provision for credit losses of $47.6 million in the fourth quarter, compared to a provision of $6.4 million in the prior quarter and a $9.3 million provision expense recorded in the year ago quarter. In the non-interest income section, our wealth management revenue was down $2.4 million from the prior quarter and was at the level of $30.7 million for the quarter, decline in revenues for this quarter were primarily related to less fees associated with our tax deferred like kind exchange business, which had been very strong in the prior quarters and slowed just a bit in the fourth quarter. Consistent with overall industry trends and the impact of relatively higher home mortgage rates, our mortgage banking operation experienced a revenue decline of $9.8 million from the third quarter due to lower loan origination volumes and lower production margins during the quarter. The company recorded net losses on investment securities of approximately $6.7 million during the fourth quarter, compared to a $3.1 million net loss in the prior quarter as market conditions and equity valuations continue to affect a portion of our securities portfolio. Other miscellaneous expense increased by $4.8 million during the quarter, which included a $1.1 million additional charitable contributions and a variety of other normal operational fluctuations, none of which I think are worth noting for this call. Iâ\u0080\u0099d add sort of an interesting fact here during the last quarter or two quarters, rather, we have helped clients purchase almost $1 billion worth of short-term treasuries that previously had been held at deposits at the bank and as the gap between deposit pricing and treasury starts to narrow again, we expect we will get an opportunity at some of that money."
}