{
    "symbol": "WTFC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 17:57:10",
    "content": " To turn out to be a case, sort of appears we're back on $1 billion growth level per quarter as we're up just a little over $100 million in total assets. Management's income and the margin both improved as expected, 10 basis points of the margin PPP and $3 million on net interest income despite two fewer days in the quarter in each state with approximately $3 million plus or minus. The number side of things, I'm not going to repeat everything but $127.4 million, 29% over the fourth quarter. In addition to the $800 million and the 9% loan growth, important to note that period-end loan balances, excluding PPP, were over $500 million ahead of the quarter average which should help our second quarter results. PPP loans continue to run down as they are forgiven and at roughly $250 million at quarter end, they're no longer material and will largely be gone by midyear. For the first quarter of 2022, net interest income totaled $299.3 million. This was an increase of $3.3 million as compared to the prior quarter, an increase of $37.4 million as compared to the first quarter of 2021. The margin improved 6 basis points from the prior quarter to 2.61%, a beneficial decline of 3 basis points for the rates paid on liabilities combined with a 3 basis point increase on the yield on earning assets, resulted in the improved net interest margin. I think it's important again to note that the net interest income expanded despite less interest income from the PPP portfolio and the two fewer days in the quarter and also the net interest margin, excluding the impact of the PPP portfolio increased by 10 basis points. Provision expense in the first quarter was driven largely by loan growth, excluding PPP loans of approximately $796 million, offset by a small decrease in net charge-offs and an improvement in the loan portfolio characteristics during the quarter, including improving loan risk rating migration. In the noninterest income section, our wealth management revenue declined by $1.1 million to a level of $31.4 million in the first quarter. Consistent with overall industry trends and the impact of higher home mortgage rates, our mortgage banking operations saw lower loan origination volumes during the first quarter with lock adjusted origination volumes down approximately 24%. However, our mortgage banking revenue actually increased $24.1 million to $77.2 million in the first quarter of '22. Looking forward to the second quarter, based on the current pipeline activity and the market conditions, we expect mortgage originations to be very similar to the origination volumes experienced in the first quarter with production margins in the 2% to 2.25% range. Turning to noninterest expenses, they totaled $284 million in the first quarter of 2022 and were relatively consistent with the prior quarter total of $283.4 million. In fact, looking back over the last six quarters, total noninterest expenses have remained in a very tight band ranging from $280.1 million to $286.9 million and the current quarter lands well within that range. Additionally, approximately $2.9 million of the increase was related to employee benefit expenses which were due to higher payroll taxes and 401(k) match contribution accruals which tend to be elevated in the first quarter of the year. The miscellaneous expense category totaled $23.1 million in the first quarter compared to $24.3 million in the fourth quarter, representing a decrease of $1.2 million and this decrease was primarily impacted by a lower level of travel and entertainment expenses. As detailed on Slide 7 of the deck, loan growth for the quarter, net of PPP, was just under $800 million or 9% annualized. Equally as important and similar to the past few quarters, we saw loan growth across the portfolio, specifically life insurance premium finance loans which were up $311 million; core CRE loans which were up $245 million; commercial premium finance loans which were up $82 million and residential real estate and core C&I loans both showed solid growth. And choosing gears and think about mortgage expenses, Dave, when I think about kind of what you described about a year or so ago when we saw a pretty decent decline in volumes in the second quarter of last year, you spoke to the potential for the commission line related mortgages stepped down by about $8 million or so."
}