{
    "symbol": "TLRY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-10 18:35:03",
    "content": " Through the completion of our business combination last year, we positioned Tilray as a disruptive cannabis industry leader with a portfolio of highly sought after brands that bring people together in a memorable and positive way, contribute significant operation scale, benefit from a broad global distribution footprint, and last, but not least, that are flourishing from hands-on CBG expertise and operational excellence across the board. The economic engine driving shareholder value is our model that seeks to generate current cash flow, positive EBITDA, while adding the infrastructure, production facilities and distribution networks to capitalize on long-term growth opportunities that come with increasing acceptance of medical and recreational use of cannabis globally and ongoing cannabis legalization. Importantly, even in this intensive price competitive market, we have maintained our number one leading market share position in Canada and leading positions across our portfolio of brands, with top rankings across adult use product categories, such as concentrates, edibles, flower, oils, pre-rolls, topicals, vapes, and beverages based on recent HiFyre sales data in Canada for the months of September through November. Right before year-end, SweetWater announced the acquisition of Alpine Beer and Green Flash, iconic West Coast craft beer brands to be brewed in our new Fort Collins facility for West Coast distribution, all which complements SweetWater's existing product offerings and give us a strong foothold in California and the west part of the United States, the largest state economy in the US and the largest legal cannabis market in the world. On a pro forma basis, for example, if Aphria's cost structure had been applied to the legacy Tilray brands in Canada during Q2, we believe that our adjusted gross profit would have been $3.8 million higher. I think one day when this does happen that the opportunity to replace alcohol with THC, and I've said just before, the brands that are out there today, whether it's SweetWater, whether it's Breckenridge are brands that consumers know, and we will have the opportunity to get into the markets with THC products. And I think what's important is what Tilray has, we're going to have brands, we're going to have innovation, we're going to have products that consumers want because we're going to build our brands and that's why we change the name to the Tilray branded company. What's important is, as we brought these two businesses together in May/June of last year and taking the costs of these businesses and setting the floor for the brands, the products with their SKU rationalization – and I hear from people, you're down quarter over quarter. Gaurav, you might see margins go down because of price compression, and we out there are dropping some price, whether it's vapes or some other things, but on the other side where we have the opportunity, and you heard me say today, we are increasing our cost savings and the costs that we're taking out of the combination of Tilray and Aphria going to $100 million."
}