{
    "symbol": "PCYO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-11 15:50:08",
    "content": " We're adding about 40 customers a month, mostly through two active developments that we are working with, the Sky Ranch community for ourselves and then the Elbert Highway 86, which is another water utility that we acquired a couple of years ago, but this really just shows a projected absorption model for the number of connections. Also want to talk a little bit about our single-family rental business and one of the things that we looked at was that the value of us creating an attractive community, the curb appeal, what we're doing for parks and open space, what we're doing for amenities, what we're doing for schools, what we're doing for the commercial value, all increases the value of these lots. So, it gives you kind of an annualized basis and then we do have a terrific team of professionals that are helping us construct a portion of our water system as well as our land development activities, which allow us to be able to operate and maintain these homes ourselves and this give you a bit of a pro forma on that where we're going to generate not only sufficient money to be able to cover the vertical cost of that and what we look to do was, we wanted to roll forward the equity value that we have in the land and the improved lot as well as the utilities and then finance the vertical component of that at a very attractive rate, so we were able to line up some very attractive financing for that. Please announce your affiliation, then pose your question. Please announce your affiliation, then pose your question. And as we continue to reach farther and farther out for water, we defer that capital costs for a number of years, because we can continue to use -- of water that's close in and so we're really looking at a balance of making sure that we keep growing that portfolio, we keep partnering with regional entities such as the WISE Project that you see in our financial statements from the disclosure in our MD&A sections and really working with other providers to be able to bear the cost of some of that infrastructure on a regional project basis. Please announce your affiliation, then pose your question. Please announce your affiliation, then pose your question."
}