{
    "symbol": "PCYO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-15 14:42:03",
    "content": " And then we hold back some of those lots that we develop for our homebuilder customers and we keep them for an opportunity to build homes on them and enter into the single-family rental market, where we continue to have an ongoing cash flow from an appreciating asset that provides terrific margins for us because we're able to carry forward the equity value that we have both in the land and the water utility segment. One of those is new residential connections, whether that's going to be in our Master Planned Community of Sky Ranch, whether that's going to be commercial users, both in Sky Ranch as well as another service area that we have, a little bit south of the Sky Ranch area called the Wild Pointe service area, and then existing industrial customers. We have multiple operators that are developing the field in this area, multiple formations, and so we distribute raw water and reclaim water sources to our oil and gas customers and generate high volume of water supply as well as high volume for selling that water to our customers, and really had a record year this year in selling water to the oil and gas segment, and that's largely a function of the price of oil, the regulatory climate in Colorado kind of settling down, operators being more comfortable with how they're operating within the heightened regulatory climate that Colorado offers them. Our first phase, we're looking at about 3 houses per acre, and if you carry that through our whole project, we really would fall short of what the whole project -- the capacity for the whole project would not get us up to that 3,500 or 3,200 lots. And so we want to develop these lots into single-family rentals mostly for the appreciation that we're getting and seeing in the Master Planned Community, we're actually causing that appreciation as we do what we do well on the development side, creating a nice place of home on that. As Dirk was highlighting, we've delivered 100% of the Phase 1, both in terms of the water and the land development revenues on Phase 2A, we're about 76% complete on that, maybe a wee bit more than that and really have delivered all of those lots to our homebuilder customers. So what you're seeing is, to the extent that those former buyers that would be out there and maybe they lose the ability to qualify for the same house that they would have wanted at 4% compared to 7%, we're really getting a lot of referrals from our homebuilders to say, well, if you like the community, why don't you go talk to the developer who's got some units that are coming online for rental because it puts them -- it locks them into the market, right? You look at the water rights and similar to the previous caller, it's nice, but when you're a public company in the market, just gives you no credit for the water assets you have, that might not be the best use of capital either. We've been over the back and one thing, I think, just in terms of looking at how you guys are approaching this, you mentioned investing in your own currency, but really, I think the correct way to view that is, if you put the first sale sign up and the company is worth, say, $25 a share, if you're capitalizing on an $8 print, you're creating immense value for the shareholders that continue to stay along for the ride. Do you have any concern about the stigma , I don't know, let's say, it's Five years from now, I live in an area where developers were supposed to put in affordable housing in the neighborhood, and there was a stigma in the resale market that when something came up that -- well, this wasn't built by the builder this was built by -- and therefore, the valuation is not going to be the -- retail is not going to be different."
}