{
    "symbol": "ZVIA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 12:16:04",
    "content": " Zevia continues to experience strong category-leading consumer demand, adding well over 1 million new households, growing consumption and delivering dollar and volume growth well ahead of the category, even in the midst of a challenging macroeconomic environment. In Q3, we delivered net sales of just over $44 million, 14% of our prior year-end revenue growth and 2.3% volume growth. Zeviaâ\u0080\u0099s household penetration for the 12 months ending Q3 grew again on a sequential basis to 6.3% from 6.1% for the 12 months ending Q2 â\u0080\u009822, adding 1.3 million more households to the brand versus last year. In the third quarter of 2022, we delivered net sales of $44.2 million, growing 13.6% versus prior year same time. Gross profit delivered in the period was $19.2 million up $1.4 million or 7.9% versus a year ago, reflecting growth in net sales, partially offset by higher cost of goods sold. Adjusted EBITDA loss was $2.1 million compared to an adjusted EBITDA loss of $3.5 million in the third quarter of 2021, a year-on-year improvement of $1.5 million or 41.7%, showing progress managing towards profitability. Itâ\u0080\u0099s important to remember that scanned data demonstrates super healthy growth, 20% essentially through the quarter and even in the October read continues at a 20% growth clip and double-digit in volume as well, and that leads the category both in dollar growth as well as in volume where the category is either flat to declining. And then the other thing thatâ\u0080\u0099s been a win for us, as I mentioned in prepared remarks, is expanding into new parts of the store with our first time ever single-serve soda offering now has us penetrating open air coolers in the deli section and in two customers front-end merchandising, which for us is a small growth brand is a really big win. Our opportunity and our success rate so far in growing in-store presence in our existing customers has been tremendous, and we need to keep that clip and then stay very focused on, for example, filling out the gap in 2,500 mass channel stores where we are not yet sold for Zevia or filling out the third of the three drug operators that donâ\u0080\u0099t yet sell Zevia, or addressing food service and convenience that donâ\u0080\u0099t yet sell Zevia and they need to sell Zevia at the right time, at the right price, with the right rep to market."
}