{
    "symbol": "ZVIA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 01:05:54",
    "content": " Zeviaâ\u0080\u0099s growth doubled that of the broader non-alcoholic beverage category and leads zero diet CSD by a wide margin, growing 23% in measured channels in Q2, according to IRI scan data, while zero diet CSDs grew a still healthy 16%. New distribution and new item growth was bolstered by the club channel, by expansion of our kids line, where we gained 4,800 new food and mass merch channel store selling versus prior year and by energy drink performance in a natural channel, where new energy drink flavors accounted for 34% of overall brand growth. So into this healthy environment, weâ\u0080\u0099ve introduced an additional price increase at a blended 10% across the full soda portfolio in all packs, channels and geographies, which went into effect August 1. Gross profit of $17.4 million was up $1.1 million or 7% versus a year ago, reflecting growth of net sales, partially offset by higher cost of goods sold. Selling and marketing expense increased 30% to $13.9 million, reflecting higher freight and warehousing costs related to volume growth as well as inflationary pressure, some stemming from a challenging transportation market. Based on our results and strong consumer metrics, we are reaffirming our 2022 annual net sales guidance of $177 million to $182 million, an increase of 28% to 32% over 2021, including $46 million to $48 million in Q3 of this year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. So a trusted yet â\u0080\u0093 premium yet accessible brand with a better-for-you product with strong historical multi-pack sales and a less price-sensitive consumer, we donâ\u0080\u0099t â\u0080\u0093 we see a lot of opportunity to optimize growth by channel by introducing more multi-packs and multi-packs oftentimes that are unique to a channel, which then allows for pricing power within that channel."
}