{
    "symbol": "HBNC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-31 10:26:05",
    "content": " Other notable financial metrics for the quarter ended, as reported pretax pre-provision net income of $29.1 million, which represents a 13.1% increase over the prior quarter's pretax pre-provision net income; a 3% reduction in our efficiency ratio to 55.6%; a return on average assets of 1.33% and a return on average tangible equity at 19.9%. Driving the first quarter's results, annualized double-digit organic commercial and consumer loan growth, additional revenue from the acquired offices, cost saves achieved from last year's branch closures and an increase in net interest margin. To further support that we are a growth company, Horizon's compounded annual growth rate in 2002 through 2021 were 13% for total assets and 20% for net income. Horizon manages and deploys capital efficiently, as evidenced by our recent acquisition of 14 branches in the Fall of 2021, a dividend yield at 3.7% as of June 30, a dividend guidelines to increase dividends aligned with earnings growth and effective deployment of capital to organic growth initiatives. The 10.6% increase in adjusted pretax pre-provision income compared to the first quarter of 2022 demonstrates the successful strategies put in place to increase interest-earning assets along with maintaining an asset-sensitive balance sheet, which are driving core income growth. Comparing to the second quarter of 2021, the second quarter of 2022 absorbed a reduction of $6.8 million in revenue from PPP, gain on sale of mortgages and mortgage servicing net of impairment revenues while increasing adjusted net income by 9.1%. As a result of our deposit betas lagging as interest rates rose, helped to increase the margin and the growth in interest-earning assets during the second quarter, the base case for net interest income increased $21 million. With a higher margin, growth in earning assets, along with growth in adjustable rate assets at a 100 basis point increase as of June 30, we would generate an increase in net income of approximately 3.13% or $7 million. Slide 17, the adjusted margin increased 19 basis points during the quarter due to rising interest rates, the growth in higher-yielding assets and disciplined deposit cost management. We reported strong commercial loan growth for the second quarter and year-to-date, excluding PPP and sold participation, commercial loans reported $108 million in growth for the quarter at an annualized growth rate of 19.7%, as we continue to see loan growth across most business sectors. In addition, we reported excellent consumer loan growth in the first quarter at a pace of 50.5% annualized in loan balances as we continue to experience strong consumer loan demand for home equity, car loans and increase in line of credit balances. We are pleased with our second and first quarter consumer loan productions of $195 million and $147 million, respectively, which compares favorably to the total production for the entire year of 2021 at $397 million. To summarize Horizon Bancorp's key franchise highlights, Horizon is a growth company as evidenced by our 20% compounded annual growth rate for net income and 13% compounded annual growth rate for total assets over the past 19 years. The combination of Horizon's higher returns on tangible capital of 19.9% and lower balance sheet risk profile is a sweet spot for investors, especially given the volatility related to rising interest rates, wage inflation and supply chain disruptions. Horizon is positioned well for earnings growth in '22 and 2023 as a result of an increase in commercial and consumer loan demand, our recent acquisitions of 14 new branches and expanded footprints, low operating cost discipline, investments made in our commercial and consumer lending teams, our disciplined approach to branch rationalization. Hey, good morning guys. Hey, good morning guys."
}