{
    "symbol": "SBCF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 21:41:04",
    "content": " Turning to our results, the Seacoast team delivered another outstanding quarter of earnings, generating $46.4 million pretax pre-provision earnings, up 11% from the prior quarter, driven by improved operating leverage. Adjusted pretax pre-provision net revenue was $46.4 million, an increase of 11% compared to the prior quarter, and an increase of 23% compared to the prior year quarter, the result of higher net interest income, driven by expanding margin, increasing non-interest income, and a reduction in non-interest expense. Net interest income on a tax equivalent basis increased $5.1 million or 7% compared to the prior quarter, with both higher balances and higher yields on loans and securities. Assuming the forward curve as of the first week in July, which included an additional 50 basis point rate hike in September, we expect an increase of approximately $5 million to net interest income in the third quarter, with the core NIM excluding purchase accounting accretion, expanding to around 3.50. If not for the $103 million increase in prepayments compared to the prior quarter, loan growth would have been over 13% annualized. Turning to slide 15, at quarter end, deposits outstanding were $9.2 billion, a decrease of $55 million quarter-over-quarter, with non-interest bearing demand deposits growing at an annualized rate of 8% during the quarter, offset by declines in money market and CD accounts. Turning to slide 18, our capital position continues to be very strong, tangible book value per share is $16.66, a decline from last quarter that's attributed solely to the decline in accumulated other comprehensive income, the result of recording unrealized losses in the securities portfolio. Return on tangible common equity was higher in the second quarter on both a GAAP and adjusted basis, with the second quarter benefiting from higher net interest income and the first quarter negatively impacted by the day one provision of $5.1 million on loans acquired from Sabal Palm and Business Bank of Florida."
}