{
    "symbol": "SBCF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 15:12:02",
    "content": " Pre-tax, pre-provision earnings continued to increase with 7% growth quarter-over-quarter to $46 million and when adjusted for merger related costs and amortization of acquired intangibles in each period, pre-tax, pre-provision earnings increased 36% to $66.6 million and as a percentage of tangible assets to 2.28%. The quarterly provision for credit losses is $14.1 million including $15 million in initial provision on the Apollo and Drummond acquired loans, offset by the release of $2.1 million in reserves we established in the third quarter to provide for losses potentially resulting from the impact of Hurricane Ian, that did not materialize. Net interest income expanded 36% during the quarter, adding $31.5 million with higher yields and higher loan balances. Comparing overall performance to the prior year quarter, the decrease relates to lower mortgage banking activity impacted by rising rates with mortgage related income of $2 million in the fourth quarter of 2021 compared to about $400,000 in the fourth quarter of 2022. Looking ahead, we continue to focus on growing our broad base of revenue sources and with the benefit of the expanded franchise, we expect first quarter non-interest income in a range from $20 million to $23 million, which includes the partial quarter activity from Professional Bank. Salaries and benefits on an adjusted basis increased $12.3 million, reflecting the increase in staff to support Seacoast's expanded statewide franchise as well as increases in incentives related to higher commercial production during the quarter. Amortization of these assets during the fourth quarter was $4.8 million and we expect the full-year amortization, including the addition of Professional Bank to be approximately $28 million. And so I think as we look forward, accretion kind of a difficult number to model as you point out, but with about 9.7 in the fourth quarter and the addition of Professional Bank in the first, our model shows about $10 million or $11 million in the first quarter, and you'll see it move a little higher after that. When you look at our trends, quarter-over-quarter we look very similar to the national banks in terms of deposits shrinkage and what will be a part of that was driven and we saw it, we had about $150 million lower balances across title companies and attorneys and that's just the fact that there is a lot less transactions happening in the marketplace."
}