{
    "symbol": "AFG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 18:03:07",
    "content": " As you'll see on Slide 3, AFG's core net operating earnings were $11.63 per share for the full year 2022, generating a core operating return on equity of 21.2%, which was even better than the excellent 18.6% core ROE achieved in 2021. Pretax unrealized losses on AFG's fixed maturity portfolio were $630 million at the end of the fourth quarter, reflecting the increase in market interest rates and widened credit spreads compared to year-end 2021. In the current interest rate environment, we're able to invest in high-quality, medium duration, fixed maturity securities at yields of approximately 5.5%, which compare favorably to the 4.15% yield earned on fixed maturities at our P&C portfolio during the fourth quarter of 2022. Excluding the impact of alternative investments, net investment income at our Property & Casualty insurance operations for the 3 months ended December 31, 2022, increased 64% year-over-year as a result of the impact of rising interest rates, enhanced by the strategic positioning of our portfolio coming into 2022 and higher balances of invested assets. For the 12 months ended December 31, 2022, P&C net investment income was approximately 3% higher than the comparable 2021 period and included a return on investments on alternative investments of 13.2% for 2022 compared to the remarkably strong 25.3% earned on alternative investments in 2021. Excluding alternative investments, net investment income at our property and casualty insurance operations for 2022 increased 29% year-over-year as a result of the impact of rising interest rates and higher balances of invested assets. For the 12 months ended December 31, 2022, AFG's book value per share plus dividends increased by 4.8%, reflecting very strong earnings, partially offset by the increased unrealized losses on fixed maturities from the impact of rising interest rates and widened credit spreads. Excluding unrealized losses related to fixed maturities, we achieved growth in adjusted book value per share plus dividends of 6.3% during the fourth quarter and 18.5% for the full year. When we look at year-over-year comparison of our Property & Casualty results for the fourth quarter, it's easy to lose sight of the strong fourth quarter results in 2022, especially noting the average crop results achieved in 2022 following the extremely results reported in our crop business in the comparable prior year period. As you'll see on Slide 9, the fourth quarter 2022 combined ratio was an excellent 86.6%, although 5.9 points higher than the exceptional 80.7% reported in the comparable prior year period. Catastrophe losses in this group, net of reinsurance and inclusive of reinstatement premiums were $7 million in the fourth quarter of 2022 compared to $15 million in the comparable last year period and were primarily attributable to Winter Storm Elliott. Fourth quarter 2022 gross and net premiums in this group were up 8% and 1%, respectively, when compared to the 2021 fourth quarter, primarily due to higher winter wheat commodity prices and new business opportunities attributed to crop products with higher sessions. The businesses in the Specialty Casualty Group achieved an outstanding 81.3% calendar year combined ratio overall in the fourth quarter, 3.3 points higher than the exceptionally strong 78% achieved in the comparable prior year period. In fourth quarter 2022, gross and net written premiums both increased 4% when compared to the same prior year period, with the vast majority of businesses in this group reported growth during the quarter. Now the finance -- Specialty Financial Group continued to achieve excellent underwriting margins and reported an 83.1% combined ratio for the fourth quarter of 2022, an improvement of 2.4 points over the prior year period. Fourth quarter 2022 gross and net written premiums were up 12% and 15%, respectively, when compared to the prior year period due primarily to the growth in our financial institutions and commercial equipment leasing business. Core net operating earnings at the midpoint of our 2023 guidance, excluding income from alternative investments would increase 10% year-over-year from 2022's results on a similar measure. Now we expect the Specialty Financial Group's combined ratio to be in the range of 83% to 87%, with all businesses in this group projected to produce strong underwriting margins, and we expect growth in net written premiums for this group to be in the range of 4% to 8% based on projected growth in nearly all of the businesses across this group."
}