{
    "symbol": "BSIG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 06:16:02",
    "content": " Good morning, and welcome to BrightSphereâ\u0080\u0099s conference call to discuss our results for the second quarter ended June 30, 2022. Additional information regarding these risks and uncertainties appears in our SEC filings, including the Form 8-K filed today containing the earnings release, our 2021 Form 10-K and our Form 10-Q for the first quarter of 2022. We reported ENI per share of $0.41 for the second quarter, 3% higher, compared to $0.40 that we reported for the second quarter of 2021. The EPS for second quarter of 2021 included about $0.07 of contribution from a couple of affiliates: ICM and Campbell Global, both of which have since been divested. And so on an apples-to-apples basis, the EPS of $0.41 for 2Q 2022 is 24% higher than 2Q 2021. The adjusted EBITDA for our sole operating business Acadian decreased by 26.9% to $38.8 million in the second quarter of 2022, compared to $53.1 million in the second quarter of 2021, primarily because Acadianâ\u0080\u0099s AUM declined 23% due to the depreciation and in equity markets globally in 2022 and also a stronger U.S. dollar given a substantial portion of our AUM is invested outside the U.S. However, our sizeable share buybacks over the last several quarters more than offset this decline in EBITDA and earnings to drive EPS higher year-over-year. First, Acadian announced launch of an effort to expand into the large credit market where systematic credit strategies are currently nascent but poised to grow well as industry dynamics become more and more conducive. Second, in Q4 of this year, we will be seeding Acadianâ\u0080\u0099s multi-strategy equity alternative platform, which will house several equity alternative strategies that are uncorrelated to the broader markets. Our net client cash flows in 2Q 2022 were negative $2.8 billion, primarily driven by portfolio reallocations from a couple of clients. And from a longer-term perspective, we have several irons in the fire, including credit and equity alternatives that I just touched on, that should benefit from secular tailwinds and that you would expect to drive more consistent organic growth for us. As a reminder, this is a facility that supports Acadianâ\u0080\u0099s seasonal needs in the first quarter and is typically paid down subsequent quarters. Our cash balance was $92 million as of June 30, 2022. To reiterate our capital management priorities, as our business continues to generate strong free cash flow, we expect to continue deploying capital to support our organic growth and to buy back shares. Acadian generated $38.8 million of adjusted EBITDA in 2Q 2022, compared to $53.1 million in 2Q 2021. And secondly, performance fee in the second quarter was lower at $2 million versus $10 million in the first quarter. Last quarter, we spent some time to discuss the unique capabilities of Acadianâ\u0080\u0099s platform, which include a powerful combination of a team with deep quant experience, wealth of data on traded assets around the globe and our technology platform, all of which have been built up over decades. There continues to be an explosive growth in alternative data and Acadianâ\u0080\u0099s advanced techniques to extract useful signals from the data are continually improving, which should increase our ability to produce higher sales for the clients. Today, Iâ\u0080\u0099d like to discuss our newest initiative of systematic credit and equity alternatives platform a bit more. The plan is to initially focus on corporate credit markets, which is a $14 trillion market and since the data and resources between corporate credit and equity have meaningful overlap, and we have a unique advantage in this segment. There is a growing demand for strategies with truly low correlations with the broader markets, but this remains severely underserved because often correlations turn out to be much higher than investors expected. In the fourth quarter, we will be seeding Acadianâ\u0080\u0099s overall equity alternatives platform, which will combine Acadianâ\u0080\u0099s unique capability in multi-asset macro, equity long-short, alpha signal research, alternative data and portfolio construction techniques. We will continue using our free cash flow to support organic growth and for share repurchases, and we remain focused on maximizing shareholder value. And our capital deployment is an example of that in terms of using it in the places where itâ\u0080\u0099s best used either repurchases or leading our organic growth strategies because that will ultimately help generate a better multiple, whether itâ\u0080\u0099s public markets multiple or an acquisition multiple, and we remain open to strategic discussions as and when as they would happen. You talked about a priority for free cash flow to support organic growth, and you mentioned the systematic credit and equity alternatives platform. Itâ\u0080\u0099s only about â\u0080\u0093 for those two combined, we would probably expect about $15 million to $25 million per year for the next, call it, three years. So about $15 million to $20 million this year, another $20 million to $25 million next year and then in 2023 and then maybe another $20 million or so in 2024."
}