{
    "symbol": "BSIG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 00:27:05",
    "content": " Please note this call is being recorded today, Thursday, May 5, 2022 at 11 a.m. Eastern Time. Good morning and welcome to BrightSphere’s conference call to discuss our results for the first quarter ended March 31, 2022. Before we get started, please note that we may make forward-looking statements about our business and financial performance. Additional information regarding these risks and uncertainties appears in our SEC filings, including the Form 8-K filed today containing the earnings release and our 2021 Form 10-K. Any forward-looking statements that we make on this call are based on assumptions as of today, and we undertake no obligation to update them as a result of new information or future events. Information about any non-GAAP measure referenced, including a reconciliation of those measures to GAAP measures, can be found on our website, along with the slides that we will use as part of today’s discussion. The increase in EPS compared to 1Q ‘21 was primarily driven by share repurchases, including the large tender offer we did in the fourth quarter of 2021. Turning to our investment performance, we are pleased that our multifactor client investment process continues to produce outperformance for our clients across most of our strategies through what was a very challenging macro and geopolitical environment. As of March 31, ‘22, 96%, 86%, 88% and 90% of our strategies by revenue beat their benchmarks over the prior 1, 3, 5 and 10-year periods respectively. Our net client cash flows in 1Q ‘22 were negative to $2.2 billion, but the annualized revenue impact of the flow was negative $1.1 million, which is about 0.3% of Acadian’s management fee revenue for 2021. Looking past one or two quarters, we are very well positioned on our flows trajectory. And from a longer term perspective, we are very excited about our newer strategies, such as ESG, equity alternative and China since these strategies have secular tailwinds that we expect to drive long-term growth for us. Turning to capital management, in 1Q ‘22, we bought back about 9% of our outstanding shares for $100 million. We also completed the previously announced redemption of $125 million of senior notes, which now leaves $275 million of executional premier notes maturing 2026 as our only long-term debt. As of March 31, ‘22, we did have $88 million outstanding on our Acadian’s revolving credit facilities, which is a facility that’s been in place to support our regular first quarter seasonally. We had a cash balance of $89 million as of March 31, ‘22. And as our business continues to generate strong free cash flow, we expect to continue deploying capital to support our organic growth and buyback our shares. Now, turning to some operating highlights for Acadian on Slide 7, Acadian generated $48.1 million of adjusted EBITDA in 1Q ‘22 compared to $45.5 million in 1Q ‘21. The EBITDA in the prior sequential quarter 4Q ‘21 was $87.6 million, which was driven by seasonality as we typically earn majority of our performance fees in the fourth quarter. Given our continuing strong investment performance and the stronger performance fee we are seeing in 1Q ‘22 compared to 1Q ‘21, we are optimistic about our performance fees for the full year ‘22, a majority of which is expected to accrue in the fourth quarter. Turning to Slide 9 briefly, I would just like to highlight that our investment performance is very strong across short and long-term horizons and we believe this performance will generate positive growth in due course. I want to end my prepared remarks with Slide 14, to summarize some of our ongoing initiatives that we expect to drive growth over the medium to long-term. First, as we discussed last quarter, institutional investors around the globe are looking for yields, but with downside protection and low correlation to broader markets. We are very well positioned to meet this secular demand and we have created some strategies a few years ago, which are now getting ready to be marketed more broadly. One example of that are our systematic macro strategies, such as Multi-Asset Absolute Return and Commodities Absolute Return strategies. With these strategies, we basically apply our multifactor models, including macroeconomic factors, across asset classes like equity, fixed income, currency, commodities and others to generate uncorrelated absolute returns. Another example is our group of equity alternative strategies, which includes a few different strategies that use new signals, alternative data and unique portfolio construction techniques to produce uncorrelated returns. ESG factors are anyway a key part of our core investment process, because ESG factors such as sustainability are often not given due consideration by the markets and are mispriced allowing our models to generate excess returns. For example, on the environment factor, in some cases they want to make their portfolios carbon free or in other cases, it’s a 3 or a 5 or a 10-year glide path to getting to zero carbon. We are increasingly deploying this capability for clients across our strategy and expect this to help retain existing assets and win new assets, especially with regards to ESG-focused mandates. Lastly, I will touch on China market in which we see as a strategy a few years ago for China A shared market, which is coming along well. Over time, we expect to similarly apply our quant edge in other parts of the market that we haven’t yet touched on, such as credit. Your line is now open. Yes, we are not seeing any particular patterns yet in terms of first quarter. And I guess specifically, any question about the managed vol, we didn’t have some outflows from managed vol, but that again is sort of as we have touched on last quarter that’s been reducing. And now actually, when we turn to performance, as you see that more than 85% of our strategies are beating the benchmarks on a longer term basis, but to look at the 1-year, it’s 96%. So, of course, that includes managed vol and performance in managed vol has – at least a near-term performance has been great, beating core benchmarks, because this environment has produced a rather good environment for managed vol. So, we would expect given the performance that at some point, it should – that should actually be inflows. But as I mentioned earlier that essentially if you go – if you look past one or two quarters, then the base is loaded well, in the sense the performance is good, pipeline is healthy. And then we have the – looking out even further, we have these – the growth drivers that we expect to kick in. But specifically this quarter, nothing specific to really point to that, it was just a few idiosyncratic things that, sort of, determine the outcome. Yes, so we think going forward, our focus is a lot more on growth and we’re actually looking and have been investing in our – in these new initiatives. It’s reflected in our OpEx P&L, we would also be seeding these newer strategies. But one area where we are looking to continue to be disciplined in expenses and reduce, as we have touched on, is the center and that we continue to evaluate, and are looking probably more kind of towards the end of the year, beginning of next year, when we would, sort of, see that fully baked in. Your line is now open. Yes, we don’t, sort of, allocate any specific budgets. Those two are definitely the primary uses, the seeding new strategies and repurchasing our shares. And as we, sort of, continue to go forward and cash will build up more, we will look to spend it on organic growth and repurchases. It’s hard to say, sort of, a specific allocation at this point as the timing could vary. And we will also, generally, be opportunistic and both with regards to repurchases and also with regards to opportunity to deploy capital towards growth in the sense if a great team becomes available for a new asset class, that could – where we could leverage our quant capability, that could be interesting. Maybe you could just help flesh out, sort of, what costs we should be thinking about. Yes, generally, our ENI is a pretty good proxy for the cash generation because of course we do have to pay interest and taxes so that ENI is a fair proxy. In the fourth quarter, it’s generally higher because of the performance fees, the 4Q events. Yes, so the repurchases that we did in 1Q were open market repurchases because there was enough time in the entirety of the quarter to put that capital to work. And we think that that’s clearly a good option, open market repurchases, to take advantage of whenever levels are very attractive. So we think we could do open market or if there is capital building up and levels are attractive, when we’re going into an earnings window, we could – there is 10b5-1 Safe harbor available as well. Your line is now open. That’s a possibility that has happened in the past, over the last few years, as we’ve been selling Affiliate. But other than that, no, there aren’t other restrictions that could prevent us from repurchasing our shares. I guess, it’ll be in the Q – in the 10-Q, which should be upcoming shortly. Your line is now open. Just broadly thinking about strategic actions, you mentioned the possibility of maybe adding a team. Just curious how your views on M&A and strategic actions, whether strategic alternatives, but similarly on potential additions to the platform, how that thinking is evolving. We’re basically focused on really leveraging our unique platform, right, to other asset classes to really fully monetize what we have. It, sort of – it goes really right along with the quant capability. Similarly, our uncorrelated returns, we’ve seeded these strategies and build the teams and the capabilities, as well as China. But there are others where we haven’t invested as much historically, but these are great opportunities and that align well with what we are able to do and what our capabilities are. So we would essentially, if – we are investing organically both through our P&L and seeding strategies to access these areas, but if there was an opportunity to – if there was a team available to accelerate these things, we would look at it. And by definition, they would be generally smaller things, like a team is a good example of that. And maybe just on the retail point, I was hoping you might be able to elaborate a bit, how you think about accessing the retail channel. Yes, a bit of it is opportunistic when something right becomes available, but yes, it could take many forms. It could be a JV or a revenue-share relationship with somebody who has that or if it’s a merger-type partnership, of course, that’s one of the things that can be very synergistic. So we’re looking at it from multiple angles and it would just depend on what, sort of, comes through It’s a little bit of – there is this opportunistic element to it."
}