{
    "symbol": "MMMB",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-15 11:09:09",
    "content": " On our call today is MamaMancini’s Chairman and CEO, Carl Wolf; President and COO, Matthew Brown; and CFO Larry Morgenstein. Before we get started, I’ll read a disclaimer about forward-looking statements. Forward-looking statements include but are not limited to statements that express the company’s intentions, beliefs, expectations, strategies, predictions, or any other statements relating to its future earnings, activities, events or conditions. These statements are based on current expectations, estimates and projections about the company’s business based in part on assumptions made by management. These statements are not guarantees of future performance and involve risks, uncertainties and assumptions that are difficult to predict, therefore actual outcomes and results may and are likely to differ materially from what is expressed or forecasted in the forward-looking statements due to numerous factors discussed from time to time in this report and in other documents which the company files with the U.S. Securities and Exchange Commission. In addition, such statements could be affected by risks and uncertainties related to factors beyond the company’s control. Matters that may cause actual results to differ materially from those in the forward-looking statements include, among other factors, the loss of key management personnel, availability of capital, and any major litigation regarding the company. This call also includes the following GAAP measure: adjusted EBITDA, which is not a measure of financial performance under GAAP and should not be considered as an alternative to net income as a measure of financial performance. The company believes this non-GAAP measure when considered together with the corresponding GAAP measures provides useful information to investors and management regarding financial and business trends relating to the company’s results of operations; however, this non-GAAP measure has significant limitations in that it does not reflect all the costs and other items associated with the operation of the company’s business as determined in accordance with GAAP. In addition, the company’s non-GAAP measures may be calculated differently and are therefore not comparable to similar measures by other companies, therefore investors should consider non-GAAP measures in addition to and not as a substitute for or superior to measures of financial performance in accordance with GAAP. For a definition and reconciliation of EBITDA to net income, its corresponding GAAP measure, please see the reconciliation table shown in the earnings press release that crossed the wire at market open today. In addition, this conference call contains time-sensitive information that reflects management’s best analysis only as of the date and time of this conference call. The company does not undertake any obligation to publicly update or revise any forward-looking statements to reflect future events, information or circumstances that arise after the date of this conference call. At this time, I’d like to turn the call over to Carl Wolf, the company’s Chairman and Chief Executive Officer. As shared in our fourth quarter fiscal 2022 earnings call a few weeks ago, we have a strong, growing preference in the fresh prepared foods segment. To support these initiatives, we are focusing on product innovation based on customer feedback, creating promising favorites such as our new original meatballs in a cup product which quickly sold out in its first ever QVC showing. To better meet our customers’ multifaceted needs, this product has the potential to efficiently service the exciting convenience store, supermarket and university food service opportunities. On the financial front, with non-recurring acquisition-related expenses largely behind us, we return to profitability and are beginning to enhance margins by rapidly passing along price increases to our customers. I’d like to touch on a few of these now as you already know that we often hit 500,000-plus likes on our social media and some campaigns have several million views. Looking ahead to continue this momentum, we continue to see attractive multiples in the food product space and will evaluate additional acquisition opportunities that are immediately accretive and have complementary products that are good candidates for our national distribution network. In summary, the last several months were a time of foundation building for the year ahead from which our vision for MamaMancini’s as a national platform company will emerge. I’d now like to turn the call over to Larry Morgenstein, our Chief Financial Officer to walk through some key financial details from the first quarter of 2023. The revenue increase for the quarter was primarily a result of the first quarter from the December 20, 2021 acquisition of T&L Creative Salads Inc. and Olive Branch LLC. The margin compression was caused by inflation in raw materials, packaging and freight costs, as well as lower margins in the T&L Creative Salads and Olive Branch LLC business lines, partially offset by the lower overhead of the acquired businesses. Management believes the balance between inflated raw material costs and the company’s price increases will normalize in the second quarter, returning gross profits to its historical range. As a percentage of sales, operating expenses totaled 16.5% in the first quarter of fiscal 2023 as compared to 24.2% in the same year-ago quarter. Operating expenses in the first quarter increased mainly due to transportation rate increases, fuel surcharges and acquisition-related expenses. Adjusted EBITDA, a non-GAAP term totaled $0.7 million for the first quarter of 2023 as compared to $1.1 million in the same year-ago quarter. As mentioned on our 10-K call, the acquisition of T&L and Olive Branch required numerous trips between facilities to help learn the operations and meet the team. On the production front, both T&L and MamaMancini operations continued to work together on sharing common raw material suppliers for protein and other volume items where our buying power enabled us to at least keep inflationary price increases to a minimum. While no one can predict with certainty where the commodity market is heading, we have seen some signs that prices just might start to be softening and we can take advantage of better margins during this softening period. At MamaMancini’s, we have taken steps at further reducing our labor costs through the implementation of better technology to record the hours of our employees and in turn have reduced overtime. MamaMancini’s and T&L had its first joint appearance at the recently attended International Deli, Dairy, Bakery Association conference, or IDDBA. We are incredibly well positioned to create sustainable long term value for my fellow shareholders, and I look forward to a strong cadence of operating execution in the quarters ahead. With that, I’ll turn it over to the Operator to begin our Q&A session. Right now, our adjusted EBITDA, which was a minor adjustment of $55,000 for acquisition expenses, is running around 3.5% of sales. Our norm is around 8.5%, so most of that will come from gross margins, so we should see 3% to 4% increase in gross margin, and as our sales grow, our expenses should come down, so we should be significantly above 20% as things normalize. Freight should be a direct variable of sales; however, we just added some logistics admin support, so we think that there’s a good possibility that freight will go down as a percentage of sales. We have other commitments which will occur this summer that have already been authorized and first ships are actually coming this month, and then we have several additional likely occurrence, so we see very substantial sales coming from MamaMancini’s expansion of T&L and we see some opportunities as well for T&L expansion of MamaMancini’s products. Right now, I think we have three commitments other than QVC, so we’ll see what happens soon, but the reaction is tremendous. When you say adjusted EBITDA is now running at 3.5%, are you saying that’s what it’s running now in the second quarter, and when you say normal--\n First quarter. And so when you say your plan is to get to normal, which is 8.5%, does that incrementally slowly increase as the year goes on and that you’d hit that run rate in the fourth quarter, or do you anticipate sooner than that or later than that? By the fourth quarter, we definitely hope to be running at $100 million in sales or more, could be substantially more, and so that’s $8.5 million EBITDA. And while we’re just staying on that note, that 8.5% percent as, quote-unquote normal, is that a longer term normal for you or do you see that growing beyond that as I look at--\n Long term is 9% to 10% as we take efficiencies in our overheads. Mm-hmm, and then my second question is on liquidity, as you guys have obviously been investing in inventory and other working capital, and there was a cash burn in the first quarter. There was a substantial reduction in accounts payable in the first quarter, and we had, because of very heavy sales increases, increases in inventory and receivables. We anticipate an increase of our working capital bank line, which is now $4.5 million going up to $5.5 million, and as of the first quarter we have around $12 million of assets supporting that. We’ll be paying down some of our long term debt and we may look at some very modest increase in equity in the next few months, just as a safety valve. Well, there’s three different ways you can handle it: one, you can get debt from the seller; two, depending on the numbers, we can get debt from outside capital; and three, it’s by--the three is equity with the seller and four is equity from the markets, so you have to look at each thing and the cash flow and make a decision. I would say there should be this year at least one more investment, and then we’ll want to--we are growing so fast, we want to absorb that, and then I think we’ll come back on later this year. It’s products more than distribution and the key is to move products into or national network, and also some distribution as well, so--anyway, yes, but we have--right now, we have focused upon fresh prepared foods, ready-to-eat foods to eat at home, so that has been our focus up to now. That’s a growing category, and although in the last two years because of COVID, the center of the store has done much better, but over time as habits come back to normal, that will not be a growing area. As you’ve just seen in dry goods, a number of retailers have been--have overstocked certain segments of their inventory because consumers have very rapidly moved back to their old patterns, so the core part of the business for us is the take-home prepared foods segment."
}