{
    "symbol": "MMMB",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-12 22:08:06",
    "content": " This conference is being recorded today, December 12, 2022, and the earnings press release accompanying this conference call was issued after the market closed today. On our call today is MamaManciniâ\u0080\u0099s CEO, Adam Michaels; COO, Matt Brown; and CFO, Anthony Gruber. Forward-looking statements include, but are not limited to, statements that express the companyâ\u0080\u0099s intentions, beliefs, expectations, strategies, predictions, or any other statements relating to its future earnings, activities, events or conditions. These statements are based on current expectations, estimates and projections about the companyâ\u0080\u0099s business based in part on assumptions made by management. Therefore, actual outcomes and results may and are likely to differ materially from what is expressed or forecasted in the forward-looking statements due to numerous factors discussed from time to time in this report and in other documents which the company files with the U.S. Securities and Exchange Commission. Matters that may cause actual results to differ materially from those in the forward-looking statements include, among other factors, the loss of key management personnel, availability of capital, and any major litigation regarding the company. And finally, this conference call contains time-sensitive information that reflects managementâ\u0080\u0099s best analysis only as of the date and time of this conference call. The company does not undertake any obligation to publicly update or revise any forward-looking statements to reflect future events, information or circumstances that arise after the date of this conference call. At this time, Iâ\u0080\u0099d like to turn the call over to CEO, Adam Michaels. Thank you, operator, and thank you everyone for joining us today, I'd like to welcome you to our third quarter fiscal '23 financial results conference call. As this is my first quarter as CEO of MamaMancini's, I wanted to thank my leadership team and our Board for the opportunity to help lead this storied company. I've used the past three months to spend time in the field, speaking with consumers, customers and our sales partners. It is inspiring to hear what our brands mean to them and how they're using them to thrive during the pandemic, and make family time even more special. Throughout the third quarter, we continued to execute delivering what we believe is a sustainable return to profitability, further building the foundations for a national deli solutions company, all with the goal of accelerating and expanding our existing portfolio brands while strategically leveraging incremental consumer-driven innovation and accretive near-in acquisitions to fill out gaps in our portfolio. Our vision is to become a one-stop shop for prepared foods for grocery, mass, club and convenience channels, addressing the $30 billion plus food service and prepared foods market with our grocer partners. This approach fits well with the significant pandemic-related lifestyle changes that consumers faced in the last three years, with many focusing more than ever on quick, clean and fresh meals made with better ingredients at a price more affordable than eating out. On the other side of the counter, retailers continue to face significant supply chain and labor challenges and are seeking labor efficient, reliable solutions for their hot bar, deli and grab-and-go offerings. As the country continues to evolve stronger out of the pandemic, recessionary pressures will continue to focus our consumers and retailers on high quality, easy to prepare and affordable meal solutions, all of which MamaMancini's delivers on. My immediate term focus has been and will continue to remain on the continuous improvement of our three C strategy; cost, controls and culture. On the cost front, we have designed and implemented new approaches to cost management, driving noticeable improvements in procurement, manufacturing and logistics management capabilities. As Matt will mention later, our efforts to more efficiently manage labor costs, particularly overtime, outbound logistics and cold storage are realizing noticeable returns, allowing us to reinvest in our business. Commodity costs continue to improve in the quarter as well, providing significant tailwinds for our margin profile. While Q3 gross margins improved over 1,100 basis points as compared to the first half, we believe there is even more opportunity to drive operational efficiencies across both of our facilities. On the controls front, we brought in our new CFO, Anthony Gruber, to help build a strong foundational finance rigor along with the entrepreneurial spirit critical to succeed. The weekly and monthly cadence of meetings as well as the clear and actionable KPIs we put in place are allowing our teams to communicate easier, make decisions faster with more information. Our enhanced approach to costing and pricing are already driving margin expansion and we expect to continue to capture this profit growth, while also reinvesting some of this new margin to serve as rocket fuel for our accretive marketing and trade promotions. And last, but certainly not least, building a company culture that is geared for and incentivizes profitable growth. We speak of our vision often to reaffirm, reinforce and remind all of our employees that our one-stop shop deli solution strategy. For example, our new Controller started today as well as filling critical needs in logistics and soon procurement. Our teamâ\u0080\u0099s enhanced commitment to quality, including my personal favorite, our monthly grandma quality meetings to ensure our products are as good as Mama made them, are already being realized and is what drove us to once again win number one in four categories during the 2022 QVC Customer Choice Awards. Supported by strong organic growth as well as growth from our recent acquisitions, we made a sustainable return to profitability and achieved our previously announced goal of $100 million annualized sales run rate, a full quarter earlier than expected. In addition, while it's still very early, preliminarily, the fourth quarter is shaping up well and we are on a healthy trajectory moving into calendar year '23 and beyond. Turning to specific wins in the third quarter, we launched into three new customers and drove double digit new items into existing customers, half of which were through our cross selling of our new T&L products into legacy relationships. Looking ahead to the fourth quarter, we have already successfully sold in and received orders from three new customers and shipped an incremental double digit portfolio of new items into existing customers, further expanding the breadth and depth of our coverage. While we are aware and actively discuss potential headwinds, particularly in recessionary pressures and commodity inflation, we believe we are building a more resilient, flexible organization that is prepared to pivot as needed. I firmly believe that we are well positioned to build significant additional momentum in calendar year '23 as we drive organic growth, grow the team, expand our capabilities, and seek to become brilliant at the basics. With that, I'd like to now turn the call over to Anthony Gruber, our recently appointed Chief Financial Officer to walk through some key financial details from the third quarter of fiscal '23. The increase in revenue for the third quarter was driven by organic growth across all divisions, chiefly through cross selling as well as by inorganic growth through the acquisition of T&L and Olive Branch. Gross profit increased in the third quarter back to targeted levels based on normalization of commodity costs, successful pricing actions and strong sales growth. As a percentage of sales, operating expenses decreased to 19.7% in the third quarter of fiscal 2023 as compared to 24.4% in the same year ago quarter. Adjusted EBITDA, a non-GAAP term, increased to 2.1 million for the third quarter of fiscal 2023 as compared to 0.3 million in the same year ago quarter. Taken in tandem with our credit line, which we paid down by 1.5 million in the quarter and positive 3 million in cash flow from operations in the quarter, I'm comfortable with our liquidity position relative to our near-term requirements. I'd like to now turn the call over to Chief Operating Officer, Matt Brown, for an operations update. Just as the price increases went into effect, commodity prices on our largest purchase proteins fell back from Q2 highs, accentuating the margin tailwinds. As Adam mentioned earlier, I had been tasked with handling the first of the three Cs, cost. To that end, my management team continued to chip away at labor overtimes and was able to pick up yet another point of margin against cost of goods sold, representing greater than 100 basis points in savings over the quarter. We've been addressing the need to take advantage of synergies across our business units, helping to gain efficiencies spanning every aspect of the supply chain. In fiscal Q3, we created a dedicated shipping team to focus on consolidating both inbound and outbound freight across our New Jersey and New York facilities. As MamaMancini's Holdings is first and foremost a manufacturer and marketer of deli solutions, we recognize that we currently leverage the expertise of others when it comes to cold storage. Fiscal Q3 began the process of consolidating these third parties down from six to four strategic locations, eliminating additional storage costs that were not creating value. We continue to research our cold storage options, including, but not limited to, investing in a centralized facility between the business units that we would control. Our dedicated costing models have empowered the sales team to make smarter decisions with regards to pricing products to our retailers that not only reflect fair perceived value to shoppers, but also provide margin to invest back to help promote our products and keep us top of mind. Finally, in Q3, I took our management team to PACK EXPO International in Chicago where we walked the show in a continued effort to find better technology to further increase the plant's efficiencies. Before we begin our question-and-answer session, I'd like to turn the call back to Adam for some closing remarks. The significant revenue growth we saw this quarter reflects our transition to a national deli solutions company, a vision I outlined on our last earnings call. Our profitability, which certainly benefited from significant sequential commodity cost improvements and successful pricing actions, was concurrently driven by a keen eye on cost controls and synergy realization. As we move through the holiday season and into '23, I anticipate the third quarter will have marked the beginning of a sustainable return to profitability for MamaMancini's as we prepare to embark on the next leg up on our growth trajectory. Yes, I think it's been great. The sales team, obviously it's easier to sell in when you have a product that's moving with better velocities, getting greater distribution. The opportunity to actually cross sell different products, so for all intents and purposes, we have sort of doubled the portfolio, which allows us to sell in multiple products to our customers. I know that we got a big West Coast customer, actually, that's selling in now. So Dan Mancini, Dan is literally the guy going to many of these calls and there's nothing like Dan talking about MamaMancini's products. So it's really easy for a customer that -- I'm going to make it up, say they already have our meatballs or our sausage and peppers. The customers see the quality, see the service and quite honestly, it's easier for them. If they make one phone call to fill the entire deli case, that's much easier than having to call 25 people to do that. So I've come in three months in, so I'm not going to tell you what I thought a month ago, a year ago, but what I think we're seeing is that we're being responsive. So we historically or in the past have been selling these kits, which make it -- allows the customersâ\u0080\u0099 labor to be doing some of the work. As the labor got tighter, we are actually responsive and we created our Meals for One program, which allows them really no labor on the customer side. So what I think is really special about our sales team, we're good listeners, understanding different customers want different things. And the beauty is we're able to provide those things, the needs of the customer. So as we're growing more and more top line revenue, that's allowing us to do one of two things. So the goal that we have as a leadership team is to drive top line revenue, that's going to allow us to invest additional capabilities in the G&A level without seeing it actually go up on a percentage basis. Yes, it's going well. We actually just got another actually full authorization, itâ\u0080\u0099s not even a test rollout to another major grocer. But equally, I think it's important, we're doing it very intentionally with the right cadence, because we're learning a lot. And we were able to actually do that, because we didn't just go all the way out full bore, we were able to identify those pieces of feedback and we've actually already addressed it and have a solution for it. So now we're able to go out with a much longer shelf life, customers are really loving that. So I think the fourth quarter, just first of all, is historically a softer quarter on the top line. We hired a new person, a new woman in freight and she's really doing an incredible job, more than 100 basis points of improvement already in freight. So I actually still think we're still staying in line with what we said, which is mid 20s gross margins and high single digits for -- probably mid to high single digits for the bottom line. We're seeing -- like I said earlier, I see more opportunity ahead than I do behind. Thank you, operator, and thank you again to each of you for joining us on today's earnings conference call. Ladies and gentlemen, this does conclude today's teleconference."
}