{
    "symbol": "TMDI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 12:59:12",
    "content": "  Operator: Good morning, and welcome to Titan Medical's Third Quarter 2022 Earnings Conference Call. As a reminder, certain statements made during this conference call constitute forward looking statements that reflect management's current expectations of the company's future growth, results of operations, performance and business prospects and opportunities. Many factors could cause company's actual results, performance or achievements to be materially different from any future results performance or achievements that may be expressed or implied by such forward looking statements including without limitation, as listed in the caution regarding forward looking statements and risk factors sections of the company's annual report for the fiscal year ended December 31, 2021, which may be viewed at sedar.com and sec.gov. Joining me on the call today, we have Cary Vance, Titanâ\u0080\u0099s President and Chief Executive Officer; and Stephen Lemieux, Titanâ\u0080\u0099s Chief Financial Officer. Good morning, and welcome to Titan Medicalâ\u0080\u0099s third quarter 2022 financial update call. We had many accomplishments over the past several weeks, the most exciting being that the Enos System is in production at our partner benchmarks manufacturing plant. We also announced that after careful consideration, we will be holding a special meeting on January 12 2023, to see shareholder approval for a consolidation of Titanâ\u0080\u0099s common shares to be affected by the company's Board of Directors at their sole discretion. Compliance with the NASDAQ minimum bid price requirement is required to maintain our NASDAQ listing, which Management and the Board of Directors deemed critical to provide accompanying with continued exposure to the largest capital market in the world and potentially provide an increased catalyst for Institutional Investor ownership. Steven will provide additional details later in our discussion, but our focus remains on bringing the Enos System to market. Additionally, we aim to make surgical procedures easier, more comfortable and more effective for surgeons using an ergonomically designed system. We wanted to ensure that the Enos System would be instinctive and easy to learn, use and master. These instruments have been designed with increased versatility to allow surgeons to operate close to the abdominal wall for surgical entry point in a small surgical volume, as well as in multiple quadrants when required without having to reposition the patient card. The Enos System patient card is designed to deliver an integrated through the HD camera with illumination, in addition to the dexterous and steerable 3D HD endoscope camera with additional illumination and two multi articulating instruments through a single insertion to. Importantly, the patient card is designed to offer swift docking, easy to load instruments and easy great intellectual property provides the technological breadth and depth of coverage in RAS, including covering novel aspects of highly dexterous articulating instruments, high definition surgery vision systems and ergonomic surgeon hand controllers. With over 225 patents and applications, Titanâ\u0080\u0099s portfolio includes patent families with early coverage states, setting us apart from newer entrants in RAS. Importantly, our IP portfolio provides the company with potentially valuable protection and defense from competitive technologies to storing possible commercial gains and benefits including further licensing opportunities. Currently, the market is dominated by multi-port surgical systems. While the market adoption for single exit systems has been slow, our research suggests that an opportunity exists for an innovative single exit system, such as the inner system to comprise a more significant segment of the overall RAS market. During these studies we collected a wide range of data in support of several procedures, including gynecology, urology, general surgery and colorectal surgery. Titanâ\u0080\u0099s initial indication for the Enos System is planned for gynecology procedures, for which the benefits of single access are compelling, upon regulatory marketing authorization and launch of the Enos System. Their Insight has been and will continue to be a critical part of our Innovation Pathway, influencing how the Enos System can address current unmet needs, but also providing advice on next generation technology enhancements to meet future surgical needs. I want to share with you our progress to date and review the opportunity that we see for Titan in the RAS space and our ability to innovate in advanced single access robotic surgical technology to positively change the surgical paradigm for patients, surgeons and hospitals. Titan has shared several accomplishments during the third quarter in the weeks following including, we have participated in the MedTech conference in Boston in October, sponsored by AZAMED. During the conference, we met with many members of the medical technology community and investors and shared Titanâ\u0080\u0099s story, for our upcoming milestones and how we believe our Enos System will improve the surgical experience. Recently, Eric served as Director of Business Development for Smith an& Nephew, consultant at Zimmer Biomet, and served as a Product Manager over the $500 million instruments accessories and video system portfolio at Intuitive Surgical. As I mentioned earlier, we completed design transfer to our manufacturing partner Benchmark, for capital components of the Enos System, including the surgeon workstation and patient card. We continued expanding our intellectual property portfolio, which now includes over 225 patents and applications and includes innovations in next generation single access RAS technology, including those designed to support three instruments that are simultaneously positionable within an insertion conduit. Looking forward, we are proceeding with plans for market authorization utilizing the De Novo classification request pathway. And as I mentioned, we expect to take receipt of our first system next month and then begin the verification and validation testing process. Together with the knowledge and experience of our talented team, we will continue to strengthen the company and promote our position within the industry. Our team will continue to engage with new potential investors to share Titans narrative for the Enos System, and the effect we believe the system will have on improving surgical outcomes. Importantly, we plan to meet with multiple audiences, including shareholders, physicians and members of the media and others to communicate the exciting prospects of the Enos System and how it is uniquely positioned to positively impact patient outcomes, provide performance benefits to surgeons and improve hospital economics. As we look at the long term opportunity for our company and for our shareholders, we remain optimistic. We strongly believe that our innovative and differentiated single access robotic consistent Enos surgical platform, when authorized for marketing by the FDA will improve patient outcomes and be well received by surgeons in the hospital. As of September 30 2022, we had cash and cash equivalents of $11.6 million compared to $32.3 million at December 31 2021. For the three months ended September 30 2022, total expenses were $10.6 million and decrease from $14.1 million in Q3 2021. For the nine-months ended September 30 2022, total expenses were $35.4 million, compared to $37.9 million for the same period in 2021. R&D expenses was $7.6 million in the third quarter of 2022, compared to $10.7 million in the third quarter of 2021. The decline in R&D expenses is related to the transition from development to manufacturing, that the company awaits delivery of its first manufacturing Enos System by Benchmark, later this year. For the nine-months ending September 30 2022, R&D expenses were $26.7 million versus $28.4 million for the same period in 2021. R&D expenses for the nine-month period ending September 30 2022, are related to the development of the Enos System, and an increase in labor costs. In the comparative period, R&D expenses related to the development of the Enos System, and the development work required to achieve the milestones under the development agreement with Medtronic. G&A expenses decreased to $3 million for the quarter ending September 30 2022, compared to $3.4 million for the quarter ending September 30 2021. For the nine-month period ended September 30 2022, G&A expenses were $8.7 million, compared to $9.6 million in the comparative period. The decrease in G&A expenses in the nine-month period is primarily related to a decrease in stock based compensation of $1.8 million and a decrease in professional and consulting fees partially offset by an increase in severance costs, public company costs and the recruitment fees related to filling open roles on the senior leadership team. We remain focused on our IDE application submission, commencing and completing our IDE clinical trials and ultimately commercialization of the Enos System. As Cary mentioned, we will be seeking shareholder approval to implement a shared consolidation to provide the company with the option of effecting a share consolidation, including for the purposes of demonstrating compliance with the NASDAQ rules, which requires an issuer to maintain a minimum bid price by at least $1 for a minimum of 10 days, but generally not more than 20 consecutive business days. As we have previously shared, NASDAQ granted us an extension to regain compliance with minimum bid price requirement. Should the company not be able to evidence compliance prior to December 26 2022, company expect NASDAQ notify Titan that its shares are subject to delisting. At such time, the company would likely appeal such determination, and it is expected that the company's securities would continue to be listed and available to trade on NASDAQ, at least pending the completion of the appeals process. The share consolidation, if approved, would likely be the last option available to the company to regain compliance with the minimum bid price requirement. If approved by shareholders and affected by the company, the consolidated shares, the anticipated resulting price may also provide a catalyst for Institutional Investor ownership provide the company with continued exposure to the largest capital market in the world and liquidity from the company's common shares. As a reminder, should the share consolidation be approved and affected the book value per share on Titans common shares would be increased by the same share consolidation ratio, so that the share consolidation would have no impact on the book value of an investor's total share position. On August 25 2022 our Form F3 registration statement or short form base shelf prospectus became effective, while many factors under securities regulations in Canada and the U.S., so also company's market capitalization impact the exact amount of capital the company may qualify to raise pursuant to the F3 registration statement. The F3 provides the company the ability to raise up to $90 million on common shares, warrants and or units in the U.S. over a period of 36 months, providing the company with additional flexibility in managing cash resources. Under certain circumstances, it may shorten the time period required to close a financing, and is expected to increase the number of potential investors that may be prepared to invest in the company. Weâ\u0080\u0099d like to thank our Board, our partners, our employees, and importantly, our shareholders. So we've announced the transfer design specifications for our workstation patient card, and that's been completed with Benchmark our OEM manufacturer. So we expect the Enos System consisting of both a patient card and workstation to be delivered to Chapel Hill next month, December. Next question, there is several actually regarding today's announcement of a special meeting on January 12 2023, seeking shareholder approval for stock consolidation. So as people know, we weren't granted an extension to continue, we continue to undertake initiatives directed to increasing shareholder value. However, should the company not be able to evidence compliance prior to December 26, we do expect the NASDAQ to notify Titan, that it shares would be subject to delisting. The share consolidation, if approved at our shareholders meeting will likely be the last option available to the company to regain compliance with the minimum bid requirement. We've got a lot of value creating milestones in the next 12 months, which include our manufacturing bills and the delivery of the Enos System next month, like Cary mentioned. And we expect to deliver the instruments and cameras early next year, which is in accordance with their purchase order on time. As far as turning into a larger agreement, I mean, right now, we're focused on meeting this current commitment, on time and with high quality and reliable technology. We believe the best course of action is to concentrate on creating value, and to execute on value creating milestones, like, execution of product development, manufacturing builds, delivery of the Enos System, clinical success, and then ultimately, regulatory marketing authorization, which leads to commercialization. And every time we execute on a milestone, like the delivery of a system next month, it's a big deal in terms of reducing that risk. Now, in parallel, as reducing risk, we also want to continue to create awareness and excitement about what this kind of technology can do, and with our future customers and their patients, we want to make sure everyone's aware of how we can impact the market and how we can impact care. And in addition, we've increased our public relations program and we're seeing interest and uptake with journalist as a story becomes widely heard. So in August, we -- our F3 registration team became effective, and it provides the company's ability to potentially raise up to $90 million of common shares, warrants and or units in the U.S. over a period of 36 months. So, from time to time employees, officers and board members, they may be granted restricted share units RSUs. So we're seeing a steady increase in the amount of ownership the company has, we've got a couple programs in place. So we're in our first six-month window for that period, as well as the board is put in share ownership restrictions for members of the board and the C-suite. And I think what's important about a launch strategy is that it's very real, because it can be a strategy but the ability to execute on it's really important and having experience in launching products and some of the hurdles that you see. Because for us, it's not just about launching a product, but it's about customers using it and liking it once they use it. And that's extremely important not only for them, but for future customers that will look to them as reference sites. Additionally, we plan to build out our integrated delivery network customers to expand into large integrated hospital networks in rural medical centers with several 100 hospitals. As you mentioned, we have completed over 80, preclinical animal and cadaver cases and we've done so in the areas of gynecology, gynecology, oncology, urology, general surgery, colorectal surgeries, and we've done these at esteem centers, including places like IHEU in Strasbourg, France, Columbia University Medical Center in New York, and the Advent Health Nicholson Center in Celebration, Florida. Now that being said, we're focused on advancing the Enos System, which supports two instruments and it'll be extremely competitive. Now concurrently with that, and necessarily, as an innovation leader in single access RAS, we continue to innovate for the future. So this patent application documents such innovations for potential next generation system that could incorporate three instruments, along with an independent endoscope. And they're interested in learning more about the benefits of the Enos System, and Titan in general, and what the system brings to single access surgical robotics. We're committed to make sure we have the strongest partnerships, greatest opportunities to accelerate our path to market and the most innovative tools for our current system and the next generation. We're very excited about Titanâ\u0080\u0099s future and we remain focused on bringing our innovative single axis robotic assisted surgical system to the market for the benefit of patients, surgeons and hospitals."
}