{
    "symbol": "LGVN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 18:40:04",
    "content": "  Operator: Good morning, and welcome to Longeveron's call today to discuss the company's 2022 Fourth Quarter and Full Year Financial Results. I would now like to turn the call over to James Clavijo, Longeveron's Chief Financial Officer. Good morning, everyone, and welcome to Longeveron's Fourth Quarter and Full Year 2022 Call. Today, we will provide a business update and discuss financial results for the fourth quarter and full year of 2022. I am joined on the call today by the following members of Longeveron's management team: Mr. Waâ\u0080\u0099el Hashad, Chief Executive Officer; Dr. Chris Min, Chief Medical Officer; and Dr. Joshua Hare, Co-Founder, Chief Scientific Officer and Chairman. Mr. Hashad will begin with a brief corporate overview, Dr. Min will follow by a review of updates from Longeveron's clinical programs and Hypoplastic Left Heart Syndrome or HLHS, Alzheimer's disease and aging-related frailty, after which I will review our 2022 fourth quarter and full year financial results. We believe that Lomecel-B has multiple mechanisms of action that may lead to anti-inflammatory provascular regenerative responses and therefore, may have broad application for a range of rare and aging-related diseases. In the fourth quarter of 2022, we continue to make progress in advancing Lomecel-B for our suite of rare diseases and aging-related diseases. We have ongoing Phase II trial in Hypoplastic Left Heart Syndrome, also known as HLHS, Alzheimer's disease and aging-related relate. In HLHS, we are currently conducting our ELPIS II Phase II randomized controlled study to determine whether Lomecel-B improves the conditions of infants with this life-threatening condition. In addition, in our aging-related frailty program, we are conducting a Phase II study in Japan and expect to randomize our first patient in this study by the end of this quarter. I'll now turn the call over to Dr. Chris Min, Longeveron's Chief Medical Officer, who will provide additional updates on the progress we made in our clinical program. There exists a tremendous unmet need for additional interventions beyond the current standard of care, and we believe that Lomecel-B with its proregenerative, provascular and anti-inflammatory properties when administered concurrently with surgical intervention can fill that gap by improving cardiac performance in patients with HLHS. Based on the previous Phase I study in 10 patients with HLHS, the FDA has granted Lomecel-B rare pediatric disease, orphan drug and fast track designations for the treatment of HLHS. This quarter, we continue screening patients for our Phase II study evaluating Lomecel-B in patients with aging-related frailty in Japan in partnership with the National Center for Geriatrics and Gerontology and Nagoya and Juntendo University Hospital in Tokyo. The Phase II clinical trial is a 3-arm parallel design randomized, placebo-controlled, double-blind, single infusion study of 2 different dose levels of Lomecel-B. The primary objective of the study is to evaluate the safety of Lomecel-B as a treatment for aging-related frailty, with an overarching goal of providing support for an eventual limited approval under the Act on the Safety of Regenerative Medicine, or ASRM, which recognizes the tremendous therapeutic potential of cell therapies. A potential ASRM approval could enable us to enter the Japanese market based on demonstrated safety in Japanese patients with an expectation of efficacy which can be established through the conduct of a small, well-controlled trial in Japanese patients combined with our previous data in aging-related frailty. Such an approval would allow us to administer Lomecel-B as a treatment for aging-related frailty at select clinical sites, addressing a crucial unmet need amongst the Japanese population and we expect to randomize our first patient in this Phase II trial this quarter. As a reminder, this trial called the CLEAR MIND trial, is a 48-patient 4-arm parallel design, randomized and placebo-controlled trial of Lomecel-B designed to evaluate the safety of single and multiple infusions of 2 different dose levels of Lomecel-B compared to placebo in patients with mild Alzheimer's disease. Based on a robust study of preclinical and clinical data, we believe Lomecel-B may prevent, slow or even reverse the clinical progression of Alzheimer's disease by reducing disease-related brain information. In preclinical models of Alzheimer's disease MSCs like Lomecel-B have been shown to cross the blood brain barrier potentially with an anti-inflammatory effect, improving endothelin function and promoting neurogenesis, the process of new neuron formation in the brain. In our previously completed Phase Ib in the study -- Phase Ib study in alzheimer's patients, we demonstrated the preliminary safety of Lomecel-B in patients with wild-to-moderate Alzheimer's disease. With that, I'd now like to turn the call over to James Clavijo, our Chief Financial Officer, to discuss our financial results for the fourth quarter and full year of 2022. Most of what I'll be covering this morning will be presented in more detail in our condensed financial statements and our management's discussion and analysis of operations for the year ended December 31, 2022. The fourth quarter and full year ended December 31, 2022, revenue. Clinical trial revenue was $0.9 million for '22 compared to $0.7 million for 2021, an increase of $0.2 million or 29%. Revenue was $0.3 million for '22 compared to $0.6 million for '21, a decrease of $0.3 million or 53%, which was primarily due to a reduction in grant funds available due in part to the completion of some of our grant-funded clinical trials. General and administrative expenses for full year '22 were $8.1 million compared to $9.7 million for '21, the decrease of approximately $1.6 million or 16% was primarily related to a decrease of $3 million in equity-based compensation expenses allocated to G&A expenses. However, employee benefit expenses did increase by $0.5 million, which included a $0.4 million increase in expenses related to employee recruitment, and insurance and professional fees increased by . The increase was offset by a decrease in equity-based compensation allocated to research and development expenses, which decreased from $2.2 million in 2021 to $1.1 million in 2022. Further, and as disclosed in Note 13 reclassification of prior year presentations on the Form 10-K during 2021, $0.9 million in expenses related to investor and public relations that were recorded as general and administrative expenses and were reclassified as selling and marketing expenses as they were in 2022. Our cash and short-term investments was $19.6 million compared to $35 million as of December 31 in 2022 and 2021, respectively. As a reminder, during 2021, we received gross proceeds from our initial public offering in February 2021 and our subsequent private placement offering in December 2021 of over $49.6 million. Based on the company's current operating plan and financial resources, we believe that our existing cash and short-term investments will be sufficient to cover expenses and capital requirements well into the first quarter of 2024. We are doing here in -- at Longeveron, we're doing all the right setup for our trial to hopefully meet the criteria if we are able to achieve the results that we hope to achieve to possibly have it filed with the FDA and potentially get an indication once the trial is being concluded. And then just on the HLHS program, I'd like to see if you could provide a bit more color on the enrollment and how you view that regulatory pathway given your existing interactions with FDA, as you mentioned, it's an ultra rarepediatric disease. However, I would acknowledge, as you pointed out that given that this is an ultra-rare indication, that there are potential -- there is a potential that our current Phase II trial, if it has a positive outcome could serve potentially as a pivotal study, we would be planning depending on the outcome of the study to ask those questions of the agency and even prior to submission. Because we do have these avenues of communication with the orphan disease, rare disease and fast track designations, we intend to utilize our access to the agency to ask questions even before the completion of the study regarding aspects of that future end of Phase II/discussion of what the study could represent."
}