{
    "symbol": "CHMI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 19:02:02",
    "content": "  Operator: Thank you for standing by, and welcome to the conference call, the Cherry Hill Mortgage Investment Corporation's Fourth Quarter '22 Earnings Call. On today's call, management's prepared remarks and answers to your questions may contain forward-looking statements that are subject to risks and uncertainties that could cause actual results to differ from those discussed today. Examples of forward-looking statements include those related to interest income, financial guidance, IRRs, future expected cash flows, as well as prepayment and recapture rates, delinquencies and non-GAAP financial measures, such as earnings available for distribution, or EAD, and comprehensive income. Forward-looking statements represent management's current estimates, and Cherry Hill assumes no obligation to update any forward-looking statements in the future. Today's conference call is hosted by Jay Lown, President and CEO; Julian Evans, the Chief Investment Officer; and Michael Hutchby, the Chief Financial Officer. High inflation and a well-supported U.S. employment market led the Fed to hike rates 125 basis points during the fourth quarter, and it appeared that the Fed was making headway with its efforts to lower inflation back to its target level. Given the expectation of continued interest rate hikes and the evolving macro environment, we remain positioned for additional rate hikes. To that point, we continue to utilize TBAs to partially offset spread widening risk as we await the Fed to convey when it expects to end its tightening cycle, at which point, we could look to increase our risk profile. For the fourth quarter, while we generated a GAAP net loss applicable to common stockholders of $1.59 per diluted share, we generated earnings available for distribution, or EAD, a non-GAAP financial measure, of $5.3 million or $0.24 per share. Thus, while not aligned this quarter, our Board continues to monitor our earnings capabilities to ensure our dividend is at an appropriate level. Book value per common share finished at $6.06 as of December 31, up $0.01 from the prior quarter. When you consider that our preferred stock makes up a significant portion of our overall equity profile, we were pleased that on an NAV basis and before taking into account any issuances of equity through our common stock ATM program, we posted a stable NAV relative to the third quarter. As such, during the second half of 2022, NAV was off approximately 5.1%, which we believe compares favorably to the performance of many others in our industry, and speaks well to our ability to navigate a very challenging macro environment and the unprecedented speed of Fed rate hikes. During the fourth quarter, we acquired approximately $780 million in UPB, Fannie and Freddie MSRs via flow and bulk purchases. At the end of the year, financial leverage improved modestly to 3.8 times as we took a more targeted and disciplined approach in the fourth quarter with respect to deploying capital. Additionally, we anticipate our hedge ratio will likely remain elevated given our expectations of ongoing Fed rate hikes to further combat stubborn inflation. With that, I'll turn the call over to Julian, who will cover more details regarding our investment portfolio and its performance over the fourth quarter. Post the inflationary numbers, spread sector and equity markets tightened and interest rate markets firmed as investor sentiment changed. With that said, most inflationary measures have moderated but remained elevated above the Fed's 2% target for the first two months of 2023. As a result, we continue to employ a thoughtful hedging strategy in the fourth quarter to protect our book value and we believe those efforts have largely been working as intended. At year-end, our MSR portfolio had a UPB of $21.7 billion and a market value of approximately $280 million. During the quarter, we purchased approximately $780 million UPB of new MSRs through our bulk and flow programs. At year-end, the MSRs and related assets represented approximately 38% of our equity capital and approximately 30% of our investable assets, excluding cash. Meanwhile, our RMBS portfolio accounted for approximately 45% of our equity capital. As a percentage of investable assets, the RMBS portfolio represented approximately 70%, excluding cash, at year-end. During the quarter, we continued to experience CPR improvements in both our MSR and RMBS portfolios. Our MSR portfolio's net CPR averaged approximately 5% for the fourth quarter, down from approximately 7% net CPR in the previous quarter. The decline was mainly driven by seasonality and the change in mortgage production coupons, which drove slower prepayment speeds in the quarter. Moving forward, we continue to expect low recapture rates and stable or  (ph) net CPRs for the foreseeable future, given the current levels of interest in mortgage rates. For the quarter, the RMBS portfolio's weighted average three-month CPR reduced to approximately 3.8% compared to approximately 4.7% in the third quarter. As of December 31, the RMBS portfolio, inclusive of TBAs, stood at approximately $646 million compared to $759 million at the previous quarter end. Quarter-over-quarter, the spec pool portion of the portfolio continue to grow as we opportunistically took advantage of higher interest rate levels and lower price premiums by putting new cash to work, as well as converting a few dollar rolls into pools as dollar rolls weaken further. We also continue to proactively change the portfolio's composition, moving into higher coupons and reducing spread duration for the portfolio. At the end of the fourth quarter, the 30-year securities position represented the entire RMBS portfolio, up from 96% at the end of third quarter. For the fourth quarter, we saw an increase in RMBS net interest spread to 3.77% as compared to 3.49% net interest spread reported for the third quarter. One, we took advantage of wider mortgage spreads and higher yield levels by putting new money to work throughout the quarter. Two, we rotated our portfolio swapping out of low yielding assets and purchasing higher coupon mortgages with better yields. At year-end, the portfolio's financial leverage stood at approximately 3.8 times at the aggregate portfolio and the portfolio was managed with a negative duration gap. Looking forward, we remain mindful of the current environment as we expect the investment markets to remain choppy until there is a clear sense that the Fed is reaching its terminal rate. While comprehensive income attributable to common stockholders, which includes the mark-to-market of our held for sale RMBS, was $6.2 million or $0.29 per weighted average diluted share. Our book value per common share as of December 31, 2022 was $6.06 compared to a book value of $6.05 as of September 30, 2022. At the end of the fourth quarter, we held interest rate swaps, TBAs, treasury futures and options on treasury futures, all of which had a combined notional amount of $930 million. On December 15, 2022, the Board of Directors declared a dividend of $0.27 per common share for the fourth quarter of 2022, which was paid in cash on January 31, 2023. We also declared a dividend of $0.5125 per share on our 8.2% Series A cumulative redeemable preferred stock and a dividend of $0.515625 on our 8.25% Series B fixed to floating rate cumulative redeemable preferred stock, both of which were paid on January 17, 2023. With respect to the dividend, look, I think you've heard from us before and you'll continue to hear that we consider EAD as a measure. We obviously, think about where rates may go and how sustainable the dividend is over time. And broadly speaking, the Board meets every quarter and we'll continue to evaluate strength of the dividend relative to earnings power and the requirements of the market relative to our space. If interest rates do keep sort of breaking through the 5.25% to 5.75% expected rate, if we start going into a 6%  (ph), how do you start thinking about your portfolio then? Look, I think the early read is that we have preferred our agency RMBS at these particular levels, which we would say is kind of in the mid-teens that we kind of see the returns. We have a large -- rather large swap portfolio, which has kind of moved -- kind of coincided with repo rates rising almost on a one-to-one basis for us. So, if the Fed is moving higher, that portfolio has kind of benefited us. In terms of MSR and the kind of the returns that we're seeing right now in terms of the portfolio, I would say kind of low to mid-teens is kind of what we're seeing for those type of returns. But I would say just from a spread widening perspective, agency RMBS looks rather attractive. I look at your sensitivities and in terms of interest rates, it's nothing one way or the other, the book doesn't change all that much. And in the statements, he has kind of alluded to interest rates and Fed funds rates moving kind of higher. I would say, if we just take a month ago outside of the more improved data that we got from January, the market was probably expecting the Fed to stop somewhere between 5% and 5.25% at that point in time. I think if we get greater clarity from the Fed in terms of the directionality or how high they want to take rates, I think that becomes your opportunity time to kind of take -- probably increase leverage and take more advantage of the market. Can allude to that at some point if continuing to raise, the Fed's funds rate proves to be ineffective that they might try to do something on the balance sheet. And then, look, moving to servicing, I mean, it's been a great asset and a great strategy for you. How do you -- I mean, if you look at it where MSR values are today, and obviously rates, you have a low coupon and underlying coupon in servicing, would you look -- I mean, if there's a scenario where -- some are forecasting the Fed to cut at some point maybe later this year, early next year, would you look to reallocate more MBS, the servicing sort of run its course, should you feel like that profile with your recapture is still going to be a core asset going forward if the interest rate cycle does change? So, the portfolio has a note rate of, let's just call, 3.5%. And the current interest rate on mortgages is, let's just round it, 6.5%. So, from the perspective of that portfolio, the way we look at that portfolio is there's a lot of runway in terms of having pretty strong cash flows before that portfolio is in danger of refinancing outside of normal life events. And so, we really feel good about the strength of the cash flows in that portfolio despite the rates at this point given the duration and the complexity of that portfolio, which is almost non-existent at this point. And from our vantage point, given the  (ph) characteristics that are inherent in the portfolio today, we think that asset is going to continue to perform pretty strong. Look, the speeds -- I mean, what were they under 5 -- I've never seen them this low in my lifetime -- in my career. I don't know if you've seen -- I don't know how much lower they can go, but, I mean, it's been just incredible to see the speeds fall where they  (ph). And so, we absolutely look and see -- look at and see a lot of those portfolios on a regular basis. But there is an opportunity to acquire the asset at levels that, I would say, were -- that are slightly lower than the craziness in the fourth quarter. Well, look, I'll just say that the performance has been terrific, I mean, the yield curve is inverted and you guys are generating this positive economic return that looks just terrific, and really congratulate on really some great results and hopefully a very strong 2023."
}