{
    "symbol": "CHMI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 22:27:04",
    "content": " Examples of forward-looking statements include those related to interest income, financial guidance, IRRs, future expected cash flows, as well as prepayment and the capture rates, delinquencies and non-GAAP financial measures, such as earnings available for distribution or EAD and comprehensive income. Central bank policy and macro economic pressures persisted in the third quarter, which drove volatility higher and certainly impacted most mortgage assets. Persistently high inflation and a well supported employment market led the Fed to enact 275 basis point rate hikes in July and September, and provided the Fed to cover to again raise rates earlier today. Additionally, the US Treasury 2s10s curve inverted 51 basis points over the quarter moving from plus 6 basis points at 6.30 to minus 45 basis points at the end of September, signaling potential for a forthcoming recession. While the US 10 year treasury finished the quarter at 3.8%, 78 basis points above its closing level at June 30th, it surpassed 4.25% at one point in October. The increase in rates and the shape of the yield curve were relevant to the performance of RMBS assets in our sector, and much has been discussed about how the rising treasury rates and increased volatility has impacted mortgage spread widening this year and its impact to REIT book values. For now, we have positioned our portfolio for additional rate hikes and further mortgage spread widening as investors look to assess where the fed will signal a slowdown in this tightening cycle. We were proactive in terms of our hedging strategy and coupon selection, which began at the end of the prior quarter, rotating out of lower coupon MBS into higher coupon MBS. For the third quarter, we generated GAAP net income applicable to common stockholders of $38.3 million or $1.90 per diluted share, and we generated earnings available for distribution or EAD, a non-GAAP financial measure, of $5.1 million or $0.26 per share. Our primary focus this quarter was to protect book value, given our view on MBS spread widening. Book value per common share finished at $6.05 as of September 30th, and a material amount of this is simply a function of preferred stock still making up a significant portion of our overall equity profile. On an NAV basis, which does not account for the difference in common or preferred equity, our strategy of pairing RMBS with agency MSRs continues to effectively minimize risk and moderate the impact of spread widening on agency RMBS. During the third quarter, we acquired approximately 1.2 billion UPB in Fannie and Freddie MSRs by a flow and bulk purchases. We would expect recapture rates should further decline at these higher interest rate levels though, prepayment speeds net of recapture should continue to remain low. At the end of the quarter, financial leverage increased modestly to 4.2 times as we saw opportunities late in the quarter to deploy capital opportunistically. We ended the quarter with $43 million of unrestricted cash on the balance sheet, maintaining a solid liquidity profile. Looking ahead, we will continue to selectively deploy capital where we see clear risk adjusted opportunities, as we closely monitor central bank monetary policy actions and their impact on global markets and MBS spreads. We expect to maintain an elevated hedge ratio as we remain positioned for a bias towards further Fed tightening of monetary policy and a higher rate environment for the foreseeable future as inflation persists, and we expect economic headwinds to carry into 2023. With that, I'll turn the call over to Julian who will cover more details regarding our investment portfolio and its performance over the third quarter. According to Bloomberg, the mortgage index underperform hedges by 169 basis points for the quarter, a performance number that was worse than all of 2020, the year of the pandemic. Since the start of 2022, the Fed has raised the Fed funds rate significantly inclusive of today's rate increase, leading to a significant weighing on the mortgage sector. At quarter end, our MSR portfolio had a UPB of $21.4 billion and a market value of approximately $279 million. During the quarter, we purchased approximately $1.2 billion UPB of new MSRs who are bulk in flow programs. At the end of the third quarter, the MSR and related assets represented approximately 38% of our equity capital and approximately 27% of our investable assets excluding cash. Meanwhile, our RMBS portfolio also accounted for approximately 49% of our equity. As a percentage of investable assets, the RMBS portfolio represented approximately 73% excluding cash at quarter end. During the quarter, we continue to experience CPR improvements in both our MSR and RMBS portfolios. Our MSR portfolioâ\u0080\u0099s net CPR averaged approximately 7% for the third quarter, down from approximately 10% net CPR in the previous quarter. The decline mainly driven by the continued rapid rise in interest rate and the change in mortgage production coupons, which drove slower prepayment fees in the quarter. The portfolio's recapture rate was lower at 7% versus 12% in the second quarter, which was expected as interest and mortgage rates rose making the incentives to refinance less. As of September 30th, the RMBS portfolio inclusive of TBA stood at approximately $759 million compared to $831 million at previous quarter end. The quarter-over-quarter respectful portion of the portfolio grew as we attempted to take advantage of higher interest rates and lower price premiums by putting new cash to work, as well as converting dollar rolls into spec pools as the dollar rolls weakened. We also continue to proactively change the portfolio's composition, moving into higher coupons and reducing spread duration for the portfolio. At the end of the third quarter, the 30 year securities position represented 96% of the RMBS portfolio, up from 93% at the end of the second quarter. For the third quarter, we posted a  49 RMBS net interest spread versus a three spot 46% net interest spread reported for the second quarter, a modest increase. The higher finance costs were offset by resetting LIBOR expenses on our swap portfolio, as well as new asset purchases at the higher yield levels and lower dollar prices. At the quarter end, the portfolio's financial leverage stood at approximately 4.2 times at the aggregate level and the portfolio is managed with a small negative duration gap. Looking forward, especially in the fourth quarter, we remain guarded as we expect the investment markets to remain volatile for the foreseeable future until there's greater clarity as to the Fedâ\u0080\u0099s reaction to inflation and unemployment. While comprehensive loss attributable to common stockholders, which includes the mark-to-market of our held for sale RMBS was $7.3 million or $0.36 per weighted average diluted share. At the end of the third quarter, we held interest rate swaps, TBAs, Treasury futures and options on Treasury futures, all of which had a combined notional amount of $1 billion. On September 15th, our Board of Directors declared a dividend of $0.27 per common share for the third quarter of 2022, which was paid in cash on October 25, 2022. We also declared a dividend of $51.25 cents per share on 8.2% Series A cumulative redeemable preferred stock and a dividend $51.5625 cents on our 8.25% Series B fixed to floating rate cumulative redeemable preferred stock, both of which were paid on October 17, 2022. Even today, since the end of the third quarter, we continue to manage the portfolio, continue to adjust on the asset side as well, not just on the liability side, I would say. So a percentage of assets wise, I think you could see RMBS going higher as a percentage of equity, not significantly, I would say. I noticed you guys went from about 19.6 million shares to just under 21 million quarter-over-quarter, and putting that capital to work. And finally, if I may add a third, just a quick update on book value thus far in the fourth quarter. But I would tell you that, you know, again, as we get closer to -- I think, we would consider the wides for the RMBS at a point where we think the Fed sort of taps out in terms of the terminal rate for rates. But from what we have put together, we see October 31st book value down about -- book value per share down about 1% from where it was at September 30th and that is of course before any fourth quarter dividend accrual as the board has not yet met to review and approve a dividend for the quarter. Thank you, everybody for joining us for our third quarter conference call."
}