{
    "symbol": "PTRA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 20:40:07",
    "content": " All in, even with the declines in charging installations in the quarter growth in battery system, deliveries drove Proterra Powered and Energy revenue up 97% year-over-year to $23 million. It’s the problem next week you don’t know about that is a bigger issue than the problem you knew about last week and we are already working on fixing, but we all continue to lay more groundwork to cope with continued supply chain disruptions to first normalize and then improve production through the balance of the year. On top of the order from Chicago’s pace for 20 buses, we announced last month, we also received a follow line order from CapMetro, which exercise its first option and fourth order overall for an additional 14 ZX5 Max electric transit buses following its order for 26 we announced last year. And Proterra Transit may still be facing supply chain constraints, but improved supply chain management enabled significant improving in production rates by the end of Q1, that set the stage for improvement in our output through the rest of the year. However, deliveries improved sequentially and were the highest since the second quarter of last year Switching to Proterra Transit, revenue in the quarter was $35 million, a decline of approximately $7 million versus the prior year. On the production side, in our Transit business unit, it took 9% more incremental labor hours to complete a bus, ready for delivery in Q1 2022 versus prior year and 25% longer versus Q4 2021. We look forward to our next leg of growth beyond that, which remains larger function of one new battery capacity coming online at Greer, South Carolina, and two Transit adding a second production shift once supply chain fluidity and predictability improved. Supply chain and production capacity constraints are limiting growth in 2022, but at the end of the day third-party forecast for electric penetration of trucks and buses from Morgan Stanley suggests a market for commercial vehicle batteries in North American and Europe of close to 90,000 megawatt hours in 2030."
}