{
    "symbol": "PTRA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 19:10:27",
    "content": " Not only did we report record quarterly revenue of $96 million, almost 30% above our prior record in Q2 2022, but this was driven by new hires in revenue across both of our business units, along with record production and deliveries at Proterra Transit. As our team works hard to execute while navigating a still challenging supply chain, beyond our own results, significant progress has been made over the last few months with multiple new US government funding programs, supporting our target market of electric commercial vehicles with the bipartisan infrastructure law funding awarded over the last few months and the passage of the Inflation Reduction Act that should have a transformational impact on commercial vehicle electrification in the quarters and years that lie ahead. Proterra Powered and Energy revenue grew more than three times year-over-year to a new high of $40 million, driven by both Proterra Powered deliveries more than tripling year-over-year to 292 battery systems as well as Proterra Energy delivery is jumping to a new record of more than 22 megawatts, up 765% year-over-year. On Proterra Powered in particular, we continue to experience strong demand with delivery to nine different OEMs in the quarter, spanning a wide range of vehicles from school buses to coach prices to Class 3, 5, 7, 8 and off-highway commercial vehicles. Following the announcement of Daimler Truck Groups, Thomas Built Buses a delivery of its 200th Proterra Powered C2 Jouley electric school bus, approximately $900 million was awarded just last week, specifically for the purchase of electric school buses to 377 school districts across the country. With our new factory in Greer, South Carolina, which we are calling Powered 1, scheduled to come online by year end our battery production output should continue to grow materially in 2023, just as we expect our OEM partners to hit critical milestones in the development of their Proterra Powered vehicles on the way towards start of production. Lastly, on Proterra Transit, revenue grew 12% year-over-year to a new high of $56 million, as we achieved a new record in delivery of 60 new electric transit buses along with 5 pre-owned buses in the quarter. Based on our performance through the first three quarters and our current views on Q4, which has 17% fewer working days than Q3 due to the holidays, and downtime for year-end inventory, we are maintaining our 2022 revenue guidance range of $300 million to $325 million, representing growth of 24% and to 34% year-over-year. This included $14 million in CapEx, almost all of which was related to the construction of Powered One, $25 million related to a strategic equity investment in a privately held entity that we expect to diversify our domestic cell supply into other chemistries, which Gareth will discuss in greater detail in a few minutes, a $20 million increase in accounts receivable due to a significant portion of our bus deliveries landing late in the quarter, as well as a $16 million increase in inventory. On electric transit buses, recipients are funding from the Low or No Emission Vehicle Program were announced in August with $829 million explicitly dedicated to zero emission buses and related infrastructure, suggesting significant growth in orders across the industry over the next few quarters. Now beyond this funding dedicated to zero-emission transit and school buses, the new Inflation Reduction Act passed in August 2022 provides an even greater level of funding to support the electrification of other commercial vehicles from delivery vans to Class 8 trucks to off-highway vehicles. We have also made a strategic equity investment in a battery cell manufacturer that we expect will provide us preferred access to lithium iron phosphate or LFP as it's more widely known battery cells that will be manufactured in the United States, which will not only help us expand our product portfolio to a broader set of the electric commercial vehicle market that we don't target today, but also helps us secure a local supply of LFP battery cells. One, we reported record results in Q3 with triple-digit delivery growth at both Proterra Powered and Proterra Energy complementing record transit production and deliveries to drive record revenue of $96 million in the quarter. We had $25 million in strategic investments, $16 million tied really to the inventory growth as we get ready to start production in Powered 1, and then $20 million in our accounts receivables due to the late delivery â\u0080\u0093 deliveries late in the quarter that were monthly deliveries so those don't come due."
}