{
    "symbol": "ROVR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 22:33:06",
    "content": " Before we begin, I'd like to remind everyone that management will make certain forward-looking statements within the Safe Harbor provisions of the Securities Litigation Reform Act of 1995 on this call including future GAAP and non-GAAP financial and operating results, business performance in 2023 guidance, marketing and other strategies, future growth, prospects, profitability and liquidity, expected investments and initiatives, macroeconomic, public health and travel factors and trends, partnership and expansion opportunities, statements regarding our share repurchase program, other future events, industry and market conditions in domestic and international market growth opportunity. Turning to the fourth quarter, we recorded revenue of $52 million, gross booking value of $218 million and adjusted EBITDA of $11.2 million or 22% margin. First, we attracted a record number of customers to Rover Group this year, in 2022, the Rover marketplace new customer bookings were 939,000, the highest level ever, up 17% year-over-year, we expanded our marketing mix, including opening up new distribution as a vehicle to drive customer acquisition. For the fourth quarter, non-GAAP operations and support expenses were $7 million or 14% of revenue, flat compared to the third quarter of 2022 and up from 12% of revenue in Q4, 2021. Adjusted EBITDA was $11.2 million or a margin of 22%, up from the adjusted EBITDA of $7.6 million, or a margin of 20% in Q4 of last year. For the full year 2023, we expect revenue of $205 million to $215 million, which at the midpoint would be a 21% increase in revenue over 2022. For the first quarter, we expect $37 million to $39 million in revenue, which at the midpoint would be a 37% increase in revenue over Q1, 2022 and negative $5 million to negative $3 million in adjusted EBITDA, reflecting the seasonally low nature of Q1. As a reminder, the Q1 this year is also a little bit weird, because we're seeing some of the leftover effects of Omicron last year, says we kind of overlap a period that probably had a little bit of suppression in it, we would expect for the growth rates to be a little bit higher, but we are modeling and kind of increasing the impact as the year goes on for the macro piece."
}