{
    "symbol": "ROVR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 19:31:09",
    "content": " Forward-looking statements are based on then current expectations, estimates, forecasts, and projections, and the beliefs and assumptions of management, and relate to our future financial performance, such as our second quarter 2022 and full year 2022 financial guidance, trends for our GAAP and non-GAAP marketing expense as a percentage of revenue, marketing investments and initiatives, bookings upside, financial impacts of our warrant redemption, other future events in industry and market conditions, and forward-looking statements about Rover, its platform, and its domestic and international market opportunity. First-quarter revenue of $27.8 million was up a 128% year-over-year Gross Booking Value, or GBV grew a 137% to a $153.7 million. Cost of revenue in the first quarter was $7.8 million, or 28% of revenue, compared to $4.2 million, or 34% of revenue in the prior-year period. Non-GAAP marketing expenses were $7 million in the first quarter, up 173% over the prior year, as we've continued to ramp our marketing investment in mid and upper funnel channels as noted earlier by Brent. First quarter non-GAAP operations and support expenses were $5 million or 19% of revenue compared to 18% of revenue in Q1 2021, driven by hiring ahead of the seasonal increases we expect for summer travel. First quarter, non-GAAP general and administrative expenses were $9.2 million or 33% of revenue compared to $6.1 million or 50% of revenue in Q1 2021. Your line is open. Your line is open. Your line is open. I was just taking a look, we got some aided and unaided awareness stats in from Europe and it's interesting that Europe fairly quickly from both in the aided and unaided awareness standpoint has snapped similar to where we are in Canada, about 11% unaided and bouncing between 20% and 40% in aided and I think what we make of that is that the work that the Rover blog has done before market entry, and then the investments we've made in our content practice have really led the presence of the marketplace in terms of letting -- creating broad awareness of the Rover brand and also allowing us to communicate what and who we are ahead of the marketplace. Your line is open. Your line is open."
}