{
    "symbol": "AMCR",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-07 22:43:03",
    "content": " First half reported net sales were up 6%, which includes approximately $670 million of price increases related to higher raw material costs. Reported first half sales grew 5%, which included recovery of higher raw material costs of approximately $460 million, representing 9% of growth. Excluding the raw material impact and negative currency movements, sales grew 3% for both the first half and December quarter, driven by favorable price mix benefits of 4%, partly offset by modestly lower volumes. First half sales increased by 12% on a reported basis, which included approximately $210 million or 13% of sales related to the pass-through of higher raw material costs. For the half year, cash outflow of $61 million was lower than last year, largely reflecting the unfavorable impact on the working capital cycle related to higher levels of inventory and higher raw material costs. The opportunities and investments I've outlined today in our health care business, our innovation across a range of substrates and our increasing access to advanced recycled materials are just a few examples of the initiatives we have underway, giving us confidence that we have built and continue to build a strong foundation for growth and value creation. But we also had really good mix benefits, particularly from the strong health care performance, particularly in the half where we saw a double-digit growth, which is above average growth for that part of the business and a bit of rebound versus the prior year. And then the proceeds of over $400 million, $430 million, as Michael alluded to, a bit ahead of our expectations, we think it's a good use of cash to reinvest in the business and take cost out, structural cost-out, to help offset the $80 million to $90 million of EBIT that we've divested. Yes, I mean just following on from that, so we announced today we're going to use part of the proceeds to help divest -- to help offset the divested earnings, and we announced today around $120 million of cash will be put to work in cost-saving initiatives, things like footprint and SG&A and the like, and that's in addition to $50 million cash that we allocated back in August as well. So those are some of the things that really fuel double-digit growth globally across both the medical device and pharmaceutical segments for us in the first half, and we believe that the business will continue to grow at healthy rates but will revert more towards long-term trends that we've seen over a long period of time in the kind of mid-single-digit range, and that would apply going into FY '24 as well. Michael, it looks like you've booked, I think, off the top of my head, it's about $15 million of costs related to Russia below the line in the quarter."
}