{
    "symbol": "AMCR",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-01 21:29:05",
    "content": " Turning to our key messages for today on Slide four, first message to leave you with is the business has delivered another strong quarterly result highlighting the relative stability of our end markets, our relentless focus on recovering higher raw material costs and staying ahead of inflation, and our proactive approach to driving costs out of the business in a volatile and challenging operating environment. Excluding this pass through impact, organic sales grew 3%, both the flexibles and rigid segments generated price mix benefits and have done an excellent job recovering general inflation of approximately $75 million as a result of non-material costs increasing at double digit rates. Net sales were up 6% on a reported basis, which includes recoveries of higher raw material costs of approximately $270 million, representing 10% of quarterly sales growth. Adjusted EBIT was up 11% in comparable constant currency terms for the quarter, reflecting overall sales growth, price mix benefits and outstanding cost performance, including quick actions taken to flex the cost base in regions where the operating environment has been more challenged. These drivers include opportunities and priority segments, emerging markets and innovation, and they've not changed and when combined with our ability to deliver continual cost improvements by leveraging our scale advantages and capabilities, these drivers give us the confidence we'll continue to consistently deliver solid organic earnings growth from the underlying business, even in the face of continued challenging and evolving macroeconomic conditions. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I guess I wanted to ask, just to be clear, in the five to 10% organic EBIT growth in for fiscal 23, what are the assumed volumes in, in in that, in that range and, and I guess associated with that the strong mix and non-resin price that you generated in the flexibles business in the quarter. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}