{
    "symbol": "SGH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-05 19:54:08",
    "content": " We delivered another strong operating quarter at SGH, with total second quarter revenues of $449 million, above the midpoint of our guidance range, non-GAAP gross margins at the high end of our guidance range at 26% and non-GAAP earnings of $0.87 per share which also came in well above the midpoint of our guidance. We announced a $75 million share repurchase authorization today, demonstrating confidence in our business and the growth opportunities that we see over the long term, and we continue to improve our corporate governance with the appointment of Penny Herscher as Chair of our Board of Directors, and we now have a fully independent Board except for me in my role as a CEO. Let me turn to a review of each of our businesses, starting with Intelligent Platform Solutions Group, or IPS, where revenue came in at $82 million for the second quarter. That said, business is performing very well with the first half fiscal '22 IPS revenue of just over $200 million, which is up 33% compared with the first half of fiscal '21. Revenues were $107 million in Q2, with product revenues up approximately 5% when compared with Q2 fiscal 2021 when this business was still part of Wolfspeed. In our Memory Solutions Group, operating under the SMART Modular brand name, revenues totaled $260 million, which was up 9% compared with the prior quarter and up 19% compared with Q2 of the prior fiscal year. In the second quarter of 2022, sales came in at $449 million, and non-GAAP gross margin was 26%. Net sales were $449 million, a 48% increase year-over-year for the second quarter of fiscal 2021. That being said, the first half of 2022 for IPS was very strong with sales over $200 million and a growth of 33% from the same period a year ago. Our LED Solutions Group had revenues of $107 million in the second quarter, which was in line with our expectations from last quarter, and product sales were up approximately 5% when compared to the year ago quarter when this business was still a part of Wolfspeed. Our Memory Solutions Group had revenues of $260 million in the second quarter, 19% higher than the second quarter of the previous fiscal year and was higher both for our Specialty Memory and Brazil businesses. We expect that net sales for the third quarter of 2022 will range from approximately $435 million to $475 million, up slightly at the midpoint from the second quarter and impacted by some of the supply chain constraints we highlighted earlier."
}