{
    "symbol": "SGH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-06-29 22:21:02",
    "content": " In addition, we expanded service revenue in the third quarter to $34 million, up 105% compared with Q3 of the prior fiscal year. For the third quarter, IPS had revenue of $95 billion, up approximately 16% sequentially, driven by growth in commercial and federal sales. Our Memory Solutions Group had revenue of $266 million in the third quarter, which was 11% higher than the third quarter of the previous fiscal year, driven by growth in our Specialty Memory business. Lead the industry and high availability, fault-tolerant platforms, software and services, bolster our existing IPS technology offerings, allowing us to more comprehensively address our customer needs, increase our services capabilities and infrastructure, resulting in an additional $80 million of higher margin recurring revenue for IPS. Strengthen SGH's large-scale customer base as Stratus serves a global set of customers, including more than 50% of the Fortune 100 at an estimated $150 million in annual revenue and to be immediately accretive to non-GAAP gross margin, non-GAAP EPS and free cash flow. No, I mean that's the -- I mean we're kind of it's interesting because as we're sitting here telling you a little bit about the LED in China and Brazil and the consumer business, we've got a record backlog in IPS, $0.5 billion backlog and quarter-over-quarter growth of 30-plus percent. And you might imagine that with these type of customers, the type of names and logos that they have in their user base, you might imagine that there's a lot of investment in terms of AI and machine learning that will open the doors for us to go market our high-performance compute and portfolio of products and services, which is, I think, is really the revenue synergies I'm referring to, we haven't even contemplated when we talk about the transaction. But we haven't modeled in as far as the accretion that Ken discussed, we haven't noted any revenue synergies, of which we think there's relatively strong opportunities to convert and really market into Stratus' customer base on high-performance compute and some of our edge portfolio."
}