{
    "symbol": "SGH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-04 23:03:07",
    "content": " We had record quarterly revenue of $470 million, record non-GAAP gross margins of 27%, and non-GAAP earnings per share of $2.16, which was at the upper end of our guidance range, with excellent performance across all of our businesses. Starting with the Intelligent Platform Solutions Group, or IPS which turned in another record quarter with revenue of approximately $119 million, 80% higher than the same quarter last year and more than 20% higher compared to the prior quarter, our Q4 '21. In our Memory Solutions Group, operating under the SMART Modular brand name, revenues grew by 6% to $239 million in fiscal Q1 of 2022 versus the same quarter a year ago. Net sales for the first quarter were $470 million, another record for the company and an increase of 61% on a year-over-year basis from the first quarter of fiscal 2021 and up slightly from Q4. In addition, non-GAAP gross margin came in at a record 27% and non-GAAP diluted earnings per share was $2.16 for the first quarter, both at the higher end of our guidance ranges. Non-GAAP diluted earnings per share for the first quarter of fiscal 2022 was $2.16 per share, equal to the record $2.16 achieved in the prior quarter and up 177% from $0.78 per share in the year ago quarter. Our breakdown of net sales by end markets for the first fiscal quarter of 2022 was as follows: mobile and PCs was 21%; network and telecom was 10%; servers and storage was 12%; AI, data analytics and machine learning was 15%; advanced lighting was 24%; and industrial, defense and other was 18%. We expect that net sales for the second quarter of 2022 will range from approximately $415 million to $455 million, lower than the first quarter, primarily due to seasonality from our LED business as well as the expected quarter-to-quarter variability of our IPS business. Non-GAAP gross margin for the second quarter of 2022 is expected to be approximately 24% to 26%, driven primarily by lower overall sequential sales and lower mix from sales in our LED and IPS businesses. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}