{
    "symbol": "MNRO",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-25 10:18:29",
    "content": " While these initiatives are aligned with delivering an outstanding guest experience, they have been strategically designed to boost customer traffic at our locations, enable us to drive additional sales of our higher margin service categories and fulfill our commitment to maintain a balanced approach between tire and service categories to deliver enhanced profitability at our stores, grow market share and position us as an even stronger competitor in every market we serve. These stores delivered comp store sales growth of approximately 12% in the third quarter, which is on top of the double digit comp growth in the first half of this fiscal year. As we continue to drive our business stores consistently delivering mid-single digit comp store sales growth, we also remain committed to a more balanced approach between the tire and service categories. The largely nondiscretionary nature of our business gives us confidence that as long as our stores are properly staffed, our pricing is competitive with the right assortment and we continue to improve our in store execution, weâ\u0080\u0099ll be able to capture market share gains in both our tire and service categories. During the third quarter, we continued our long standing policy of sharing our results with our shareholders through our dividend and we continue deploying cash on our share repurchase program, which authorizes us to repurchase up to $150 million of the company's common stock. Turning to slide eight, sales decreased 1.9% year-over-year to $335.2 million in the third quarter, which was due to the divestiture of our wholesale tire and distribution assets in the first quarter of fiscal 2023. When adjusted for one additional selling day in the current year quarter due to a shift in the timing of the Christmas holiday from the third quarter in fiscal 2022 to the fourth quarter in fiscal 2023, comparable store sales increased 4.4%."
}