{
    "symbol": "APPF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 19:20:02",
    "content": " I am Lori Barker, Investor Relations for AppFolio and I'd like to thank you for joining us today as we report AppFolio's third quarter 2022 financial results. For greater detail about our risks and uncertainties, please see filings with the SEC, including our Form 10-K for the year ended December 31, 2021, which was filed with the SEC on February 28, 2022, as well as the company's other filings with the SEC. Thank you, Lori and welcome to everyone joining us for AppFolio's third quarter 2022 financial results. With inflationary pressures, it is an important time for our customers to continue investing in AppFolio solutions to save cost and increase efficiency. For those of you who did attend, you heard Fay Sien talk about how we are focused on returning to profitability and in this third quarter, we delivered positive free cash flow. This three day event was an excellent opportunity for customers to get a pulse on real estate trends, gain industry insights, connect and learn from each other and deepen their understanding of what AppFolio offers. Anthony Luna, Chief Executive Officer of Coastline Equity, with nearly 1,000 units throughout California on AppFolio Property Manager Plus, or APM PLUS, told us, \"It's incredible how far AppFolio has come over the last ten years. A significant part of Coastline Equity's success is because of the tools we use and without a doubt, AppFolio has been a pillar in our growth. During AppFolio's customer conference, we learned about the innovation that will be added to their platform and how prop tech will continue to shape professional property management companies in the real estate industry.\" This customer quote is a perfect endorsement of keeping customers happy, one of the key elements of our long-term strategy. Smart Insurer uses AI to detect when an insurance policy no longer covers a unit, which results in that unit being automatically added to the customer's liability insurance policy. We've also introduced another new capability, Report Builder, for our larger customers with more complex reporting requirements. We featured a demo of Report Builder in our recent investor meeting, and it's another example of a product innovation influenced by customer feedback. Report Builder, Bank Feed and Smart Insurer are just a few ways we keep our customers happy and we're constantly evaluating new and innovative opportunities to continue doing so. With our push up market, we will continue to position APM PLUS to corporate customers and also to the upper end of mid-market for those customers poised to take advantage of this platform's purpose-built capabilities. We are also driving growth upmarket by expanding our capabilities through additional property types and through integration partnerships with AppFolio Stack, which has seen strong and immediate adoption in our customer base. This partner fueled innovation allows our customers to seamlessly integrate the security deposit alternative into APM, and this is a type of service where a single platform gives us the ability to quickly roll out new, powerful solutions to a large customer base. After a successful pilot earlier this year, we expect to add this new payment method to our online portal for all our customers. In addition to incremental revenue generation in our payments value-added service, Apple Pay adds additional convenience to the payment process, helping us achieve greater adoption for the entire platform while contributing to growth and retention. Our long-term growth strategy is rooted in keeping our customers happy, acquiring new customers, expanding adoption and usage and moving into adjacent markets. This is AppFolio's debut on the list marking a big win for our organization, bolstering our reputation among customers as well as among current and future team members as an innovation leader. This is an exciting time at AppFolio, our long-term strategies and investments are showing traction as we continue our leadership in SMB, win upmarket and grow value-added services. As Jason said, at $125.1 million in revenue, we grew revenue 31% year-over-year in the third quarter. This growth is an excellent example of how AppFolio is landing new customers, expanding our units served and growing our ARPU through APM PLUS and value-added services. Core Solutions revenue was $33.9 million in Q3, another strong quarter and a 26% year-over-year increase. At the end of the second quarter, we managed approximately 7.1 million property management units from 18,109 Property Management customers compared to 6 million Property Management units from 16,844 Property Management customers a year earlier. Regarding value-added services revenue in Q3, we experienced a strong 35% year-over-year growth to $88.4 million. The expansion of our offering and the increased adoption and utilization of our value-added services, especially our electronic payment services, as is typically the case in the third quarter, our streaming business declined slightly in Q3 on a sequential quarterly basis and we expect another sequential decline in Q4. While a mix â\u0080\u0093 while a higher mix of value-added services and related expenses for third-party service providers are increasing our cost of revenue, additional headcount efficiencies offset that in the current quarter. Turning now to operating expenses, our year-over-year increase in operating expenses for Q3 is primarily related to additional headcount growth of 13% to 1,758 employees. R&D expenses, as a percentage of revenue increased from 16% in Q3 last year to 20% this year as we continue to expand our product capabilities including projects like Stack, stay manager, affordable housing and the other capabilities that make our products easier to use. Meanwhile, our G&A expenses as a percentage of revenue decreased from 15% in the same quarter last year to 13% this year as we continue to scale and find efficiencies. It was $11.9 million or approximately 10% of revenue in Q3, compared to $6.8 million or 7% in the same quarter last year. Please note, as mentioned earlier, we typically see a sequential decline in value-added services revenue in the fourth quarter as fewer residents move during the winter months, impacting tenant screening, insurance and payments for security deposits. We continue to expect full year 2022 cost of revenue, exclusive of depreciation and amortization to increase slightly as a percentage of revenue compared to prior year due to changing product mix. Our foundation for long-term growth is paying off, with substantial new units added to the platform and growth in ARPU driving revenue expansion. In the recent investor meeting, you heard the underpinnings of our success, keeping our customers happy, acquiring new customers, expanding adoption and use, entering and expanding into adjacent markets and building a skilled foundation of operational excellence."
}