{
    "symbol": "PCSA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 16:14:06",
    "content": " What Processa has done is to take these three widely used chemotherapy treatments, capecitabine, gemcitabine, and irinotecan, and all showed how the body handles them, specifically altering how the drugs are distributed in the body or how the body metabolizes the next-generation chemotherapy drugs. As you can see the bottom -- at the bottom of the slide, from a corporate and investor perspective, having these next-generation chemotherapy drugs in our pipeline helps us to be more efficient in drug development, increases the probability of FDA approval, and differentiates our products from existing products and products presently in development. Fortunately, for us, we've used the principles of Project Optimus within our regulatory science approach for a number of other non-oncology FDA drug approvals and have already started to use the Project Optimus approach prior to the announcement by the FDA for our next-generation drugs. The combination of our pipeline of next-generation chemotherapy drugs, our regulatory science approach that already includes the principles of Project Optimus, and our experience with the principles of Project Optimus in non-oncology FDA submissions are more reasons why we can more efficiently develop each of the next-generation drugs. We concluded that besides now being an FDA requirement for oncology drugs, the principles of Project Optimus need to be used for next-generation irinotecan because the justification of their dosage regimen for approval needs to evaluate the adverse event exposure and the efficacy exposure relationships, which do not appear to follow a parallel path for next-generation irinotecan. The major milestones we expect to achieve in 2023 are: For next-generation capecitabine, we expect to meet with FDA in mid-April to discuss the Phase 2b safety efficacy trial with interim analysis and next-development steps; we expect to complete the Phase 1b trial to refine our understanding of the adverse event exposure relationship; and lastly, we hope to initiate the Phase 2b study sites in 2023 -- at the end of 2023, with the goal to have our interim analysis mid-2024 and complete enrollment in 2024. With these drugs and the implementation of our regulatory science approach, including the principles of Project Optimus, these next-generation chemotherapy drugs can be more efficiently developed, have a greater probability of approval, and will be better treatment options than the existing FDA-approved drugs. The goals for the meeting with FDA mid-April are to actually discuss their view of Project Optimus, given our next-generation capecitabine and then come to an agreement and negotiate out what would be the best dosage regimen or designs to put into the Project Optimus Phase 2b trial."
}