{
    "symbol": "AEE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 14:59:14",
    "content": " Building on the strong execution of our strategy and our robust earnings growth over the past several years, we expect to deliver 6% to 8% compound annual earnings per share growth from 2023 through 2027 using the midpoint of our 2023 guidance, $4.35 per share, as the base. Our plan includes strategically allocating capital to all four of our business segments, and importantly, includes investment in a signed MISO long-range transmission planning projects of approximately $800 million and renewable energy projects of approximately $2.5 billion through 2027. In light of the Rush Island and Sue Energy Centers approaching retirement by 2025 and 2030, respectively, only approximately 3.5% of the capital expenditures in our 5-year plan are expected to be spent on coal-related projects, focusing on investments needed for safety, reliability and environmental compliance. Here, we provide an overview of our $19.7 billion of planned capital expenditures for the 2023 through 2027 period by business segment that supports the approximately 8% projected compound annual rate base growth. For Ameren Illinois Electric Distribution, earnings are expected to benefit in 2023 compared to 2022 from additional infrastructure investments made under Illinois performance-based ratemaking. We expect weather-normalized Missouri kilowatt-hour sales to be in the range of flat to up approximately 0.5% compounded annually over a five-year plan, excluding the effects of MIA energy efficiency plans using 2022 as the base year. Missouri PSC staff recommended a $199 million revenue increase including a return on equity range of 9.34% to 9.84% and an equity ratio of 51.84% based on the Ameren Missouri capital structure at September 30, 2022. Finally, in January, Ameren Illinois Natural Gas requested a $160 million revenue increase from the ICC based on a 10.7% return on equity and an approximately 54% equity ratio and a $2.9 billion rate base using our future 2024 test year."
}