{
    "symbol": "XPRO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 19:53:02",
    "content": " Six months into the integration, we have identified and actioned approximately 80% of the expected $55 million in cost savings, and we are confident in our ability to deliver this total $55 million in annual run rate cost synergies within the first 12 months following close with the opportunity to deliver $70 million of total cost savings in 24 to 36 months. To recap, we reported revenue of $280 million for the March quarter, which was up $29 million or approximately 12% relative to the combined revenue of Expro and Frank's in Q1 2021 and was down $16 million or approximately 5% relative to the December quarter. Adjusted EBITDA for Q1 2022 was approximately $37 million, representing a $13 million or 54% increase year-over-year relative to the combined adjusted EBITDA of Expro and Frank's in Q1 2021 and a sequential decrease of approximately $14 million or 27% relative to the December quarter. Q1 support costs at $71 million totaled 25% of group revenue and were down approximately $5 million relative to the combined support costs of Expro and Frank's in Q1 2021, and down approximately $1 million relative to the December quarter. The increase was primarily driven by well construction services in the U.S. and Mexico as a result of higher customer activity and equipment sales, partially offset by lower subsea well access and well flow management revenues in the U.S. due to both lower activity and subsea equipment sales during the December quarter that did not reoccur during the just completed March quarter. NLA segment EBITDA for the three months ended March 31, 2022, was $22 million, or approximately 21% of segment revenue and was up approximately $1 million quarter-over-quarter. For the ESSA segment, revenue in Q1 was $82 million, which was down $12 million or approximately 13% quarter-over-quarter. ESSA segment EBITDA for the March quarter was $12 million or approximately 14% of segment revenue, a decrease of approximately $8 million quarter-over-quarter. The MENA segment revenue in the first quarter was $51 million, an increase of approximately $2 million or about 4% quarter-over-quarter. MENA segment EBITDA in the March quarter was approximately $15 million or about 30% of segment revenue, a decrease of about $1 million or about three percentage points quarter-over-quarter. APAC segment EBITDA for the March quarter was $5 million or about 12% of segment revenue, a decrease of approximately $7 million or about 12 percentage points quarter-over-quarter. As discussed in our last earnings conference call, during the fourth quarter, we identified an actioned cost savings representing more than 50% of our previously stated $55 million of run rate cost synergies within the first 12 months following the merger close. Looking at a couple of quarters out, we continue to expect that our revenue run rate will approach that of the pre-pandemic 2019 revenues of legacy Expro and legacy Frank's on a combined basis, implying quarterly revenue of approximately $325 million to $350 million."
}