{
    "symbol": "XPRO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 12:38:04",
    "content": " Excluding $17 million of commissioning costs on a subsea project, which I'll come back to in a moment, adjusted EBITDA in Q3 was $65 million or 19% of revenue, primarily driven by a more favorable activity mix and faster than anticipated realization of merger-related synergies. Finally, as was noted in our press release, Expro's third quarter results in Asia Pacific were impacted by $17 million of start-up and commissioning costs related to a vessel deployed wire through water, light well intervention or what we call LWI solution that Expro is introducing to the market. To recap, we reported revenue of approximately $334 million for the September quarter, which was up sequentially $20 million or approximately 7% relative to the second quarter of 2022. Excluding the $17 million impact of the commissioning costs on the subsea project that was covered in Mike's remarks, adjusted EBITDA would have been $65 million and adjusted EBITDA margin would have been approximately 19%, reflecting fall-through on incremental revenue, a more favorable business mix and lower support costs as a result of merger-related synergies. The Third quarter support costs at $66 million totaled 20% of group revenue and were down approximately $4 million sequentially or approximately 2 percentage points relative to the second quarter of 2022 and were down $12 million or approximately 11 percentage points relative to the combined support costs of Expro and Frank's in Q4 2020, which was the last full quarter prior to the announcement of the merger. As highlighted in our press release, increases in net working capital in the just completed quarter and year-to-date were $29 million and $99 million, respectively, primarily reflecting a growth in customer receivables, which we expect to reverse beginning in Q4 and into 2023. For the fourth quarter of 2022, the company is planning for capital expenditures in the range of approximately $30 million to $40 million, implying total CapEx for 2022 of $81 million to $91 million or approximately 7% to 7.5% of expected revenue. ESSA segment EBITDA for the third quarter was $18 million or approximately 18% of segment revenue, a sequential increase of $3 million. For the MENA segment, revenue in the third quarter was $50 million, an increase of $5 million or approximately 11%. MENA segment EBITDA was $15 million or approximately 29% of segment revenue, a sequential increase of $1 million quarter-over-quarter. For APAC, revenue in the third quarter was $50 million, which was an increase of $2 million or approximately 4% sequentially. As previously noted, the reduction in segment EBITDA was primarily due to the $17 million in start-up and commissioning costs on a large subsea project that were incurred during the quarter. Excluding $17 million and $4 million, respectively, of the above-mentioned start-up and commissioning costs during the 3 months ended September 30th and June 30th, segment EBITDA was about $8 million for both the third quarter and the second quarter. Consistent with prior guidance, we continue to expect that our revenue run rate will approximate that of the pre-pandemic 2019 revenues of legacy Expro and legacy Frank's on a combined basis, and we, therefore, reaffirm our guidance that Q4 revenue should fall within a range of $325 million to $350 million."
}