{
    "symbol": "CMBM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 17:05:07",
    "content": " Cambium continued growth in our third quarter with revenues of $81.2 million, increasing 17% sequentially, ahead of the high end of our outlook of between $72 million to $76 million announced during the Q2 '22 quarter call. We had an exceptional quarter for our enterprise solutions, with record demand, growing 60% sequentially and increasing 257% year-over-year, including record Wi-Fi 6, Wi-Fi 6E, and switching revenues. Our PMP business revenues decreased 8% sequentially and decreased 48% year-over-year, due to lower demand as service providers move from our legacy PMP 450 products ahead of the ramp of new gigabit technologies including both 28 GHz cnWave 5G Fixed technology and the introduction of 6 GHz products expected during Q4 '22. The PTP business decreased by 2% sequentially during Q3 '22, while year-over-year revenues improved 11% due to higher shipments for our federal defense business using Cambium's PTP 700 technology for fixed wireless broadband communications. Our enterprise business had record revenues of $38.3 million during Q3 '22, increasing by $14.4 million or 60% sequentially, and higher by $27.6 million or 257% year-over-year, due to record demand for our Wi-Fi 6 and 6E solutions, record switching revenues, and increased growth in SaaS solutions. After our Q3 '22 quarter end, Cambium landed one of our largest PMP contracts in our company's history, a multi-million-dollar per year, multi-year deal, for 28 GHz cnWave 5G Fixed, from a customer in the CALA region. In Q3 '22, our non-GAAP gross profit dollars of $41.6 million increased by $5.4 million compared to the prior year due to higher volumes and improved mix of enterprise products, and increased by $7.8 million sequentially, due to higher volumes, improved pricing and a higher product mix of enterprise products and lower freight costs. Non-GAAP operating expenses, including amortization in Q3 '22 increased by approximately $300,000 when compared to Q3 '21, and stood at $27.9 million, or 34.3% of revenues. Non-GAAP net income for Q3 '22 was $11.3 million, or $0.40 per diluted share, above the previous outlook of between $0.16 to $0.20 per diluted share and compared to $6.7 million, or $0.23 per diluted share for Q3 '21, and non-GAAP net income of $5 million, or $0.18 per diluted share for Q2 '22. Adjusted EBITDA for Q3 '22 was $14.7 million or 18.2% of revenues, compared to $9.6 million or 12.6% of revenues for Q3 '21, and compared to $7.8 million or 11.3% of revenues for Q2 '22. We expect revenues of between $80 to $84 million, representing approximately 1% sequential growth at the midpoint, we remain supply constrained in certain components, our non-GAAP gross margin we expect to be between 48.7% to 49.7%, non-GAAP operating expenses of between $30.6 million to $31.6 million and non-GAAP operating income of between 8.4 and $10.2 million. Interest expense net of approximately $500,000, and non-GAAP net income of between 6.6 and $7.8 million or net income per diluted share of between $0.23 and $0.27, adjusted EBITDA between 9.5 and $11.3 million, and adjusted EBITDA margin between 11.9% and 13.4%, a non-GAAP effective tax rate of approximately 17% to 20% and approximately a 28.5 million weighted average diluted shares outstanding. We delivered a solid quarter of results and are expecting a strong finish to the year, ending on a high-note with increased revenues, strong profitability, significant new product introductions, increasing chip supplies, and a return to growth for our PMP business driven by 60 GHz cnWave, 28 GHz cnWave 5G Fixed, and the imminent launch of affordable 6 GHz fixed wireless solutions."
}