{
    "symbol": "DLTH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-02 12:32:06",
    "content": " Our reported net sales for the first quarter were nearly $123 million, and were planned to be down to the prior year due to expected inventory delays and a strategic shift to carry meaningfully lower levels of clearance inventory. For the first quarter, we reported net sales $122.9 million, down 7.9% compared to $133.4 million last year and up 11.8% compared to the same period in 2020, a decrease in sales between this year and last was roughly $11 million. As we shared on our last call, we anticipated softer sales in the first quarter due to the heavier clearance position we are in last year and continue transportation delays our new seasonal and core year around products. During the quarter, average order value and sales per customer overall increased mid-single digits driven by the demand strength of our core offering and being strategically less promotional compared to last year. The amount of clearance inventory was down almost 70% at the beginning of the quarter, relative to last year driving significant improvement to our product gross margins and an increase of 470 basis points in our reported gross profit margin to 54.6% compared to 49.9% last year. Turing to expenses, SG&A for the first quarter increased 5.2% to $68 million compared to $64.6 million last year. Selling expenses as a percentage of net sales increased 80 basis points to 15.8 compared to 15% last year, driven by the higher hourly wage rates implemented across our store fleet and fulfillment center network in the back-half of 2021. As planned advertising and marketing costs as a percentage of net sales increased 160 basis points to 10% compared to 8.4% last year, as a result of the development of creative content for our new brand positioning of Duluth and AKHG. Adjusted EBITDA for the first quarter was $7.9 million, the 17.5% decrease from last year and 80 basis points of adjusted EBITDA margin contraction. Our net loss was $1.3 million or a loss of $0.04 per diluted share, compared to a net income of $500,000 or $0.02 per diluted share reported in the first quarter last year."
}