{
    "symbol": "GRMN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:28:15",
    "content": " I would now like to hand the conference over to your first speaker today to Teri Seck, Director of Investor Relations. Any statements regarding our future financial position, revenues, earnings, gross margins, operating margins, future dividends or share repurchases, market shares, product introductions, future demand for our products and plans and objectives are forward-looking statements. The forward-looking events and circumstances discussed in this earnings call may not occur, and actual results could differ materially as a result of risk factors affecting Garmin. This means that results could change at any time, and any statement about the impact of COVID-19 on the company's business results and outlook is the best estimate based on the information available as of today's date. Presenting on behalf of Garmin Ltd. this morning are Cliff Pemble, President and Chief Executive Officer; and Doug Boessen, Chief Financial Officer and Treasurer. At this time, I would like to turn the call over to Cliff Pemble. As reported earlier today, consolidated revenue increased 9% to $1.17 billion, representing a new first quarter record. Four business segments reported revenue growth in the quarter, 3 of which delivered double-digit growth. We generated $229 million of operating income, down 8% from the prior year. Operating margin was 19.5% and was negatively impacted by gross margin performance, which declined due to historically high freight costs, combined with the strengthening of the U.S. dollar. In addition, operating expenses increased for a variety of reasons, including higher associate head count, increased compensation costs and the increase of certain operational expenses as business activities continue to normalize. Supply chain constraints persist, which limited the orders we could fill. Despite these challenges, demand for our products remains strong and we are optimistic about the future. Our Board of Directors recently approved a $300 million share repurchase plan, which is in addition to the proposed $2.92 per share dividend that will be considered by shareholders at the upcoming annual meeting. Before turning the call over to Doug, I'll provide highlights by segment and a summary of what we see ahead. Starting with business, revenue decreased 28% to $221 million. Gross and operating margins were 48% and 0%, respectively. All product categories declined, but the normalization of demand for cycling products was the main contributor. While revenue from fitness wearables declined, on a combined basis, wearable device revenue across all segments at Garmin experienced robust growth. While the decline was greater than expected, we believe these trends will moderate in the back half of the year as we move past the pandemic swings of 2021 and benefit from new product introductions. Gross and operating margins were 64% and 39%, respectively, resulting in operating income of $149 million. During the quarter, we announced sweeping updates to our adventure watch lineup, including our flagship fenix 7 series featuring a distinctive new design with a touchscreen display, and the Instinct 2 series available in 2 sizes, including versions that can operate indefinitely using our exclusive solar power technology. Gross and operating margins were 73% and 23%, respectively, resulting in operating income of $40 million. Gross and operating margins were 51% and 23%, respectively, resulting in operating income of $59 million. LiveScope has proven to be a halo technology for Garmin, and the new LiveScope Plus sonar system raises the bar with higher resolution images and improved target separation. Revenue increased 11% to $138 million, with growth from both OEM and consumer categories. Gross margin was 38%, and we recorded an operating loss of $20 million driven by investments in auto OEM programs. In consumer auto, we continue to diversify our product offerings with the launch of the Instinct 2 dezl edition smartwatch for truck drivers. In the OEM category, we made significant progress preparing for the launch of the next-generation BMW computing module platform. BMW approved our new Poland factory, giving it a rare green rating for mass production readiness. Before I turn the call over to Doug, it's important to remember that our diversified business model offers many different paths to achieve our consolidated growth goals. Regarding our outlook for the rest of the year, I mentioned several new and existing headwinds we face, and we cannot predict the impact that these might have on the business. Also, the first quarter represents the lowest seasonal quarter of our financial year and much of the year remains ahead of us. With these things in mind, we are maintaining our 2022 guidance issued in February, which called for consolidated revenue of $5.5 billion and EPS of $5.90 a share. Next, Doug will walk you through additional details on our financial results. I begin by reviewing our first quarter financial results and provide comments on the balance sheet, cash flow statement and taxes. We posted revenue of $1.173 billion in the first quarter, representing 9% increase year-over-year. Gross margin was 56.5%, 330 basis point decrease from the prior quarter. Operating expense as a percentage of sales was 37%, a 50 basis point increase. Operating income was $229 million, 8% decrease. Operating margin was 19.5%, 300 basis point decrease. Next, we look at our first quarter revenue by segment and geography. In the first quarter, we achieved double-digit growth in 3 of our 5 segments, led by the outdoor segment, robust growth of 50%; followed by the marine segment, 21% growth; and the auto segment, 11% growth. By geography, 21% growth in APAC, 13% growth in Americas was partially offset by 1% decline in EMEA, which was negatively impacted by foreign exchange rates during the quarter. Research and development increased $20 million year-over-year, primarily due to engineering personnel costs. SG&A increased $19 million compared to the prior year quarter, primarily due to increases in personnel-related expenses, information technology costs. A few highlights on the balance sheet, cash flow statement and taxes. We ended the quarter with cash, marketable securities approximately $3 billion. Accounts receivable decreased sequentially to $600 million following a seasonally strong fourth quarter and grew year-over-year, relatively in line with our sales growth. We're executing our strategy, increase days supply to support our increasingly diversified product lines to optimize the mix of ocean versus air freight shipments to carry sufficient levels of raw material safety stock to mitigate increased lead times. In the first quarter of 2022, we generated free cash flow of $126 million, a $206 million decrease in the prior quarter, primarily due to increased working capital needs and higher capital expenditures, also reported effective tax rate of 10.3% compared to 12.2% in the prior quarter. First up, you had a very nice head start in outdoor off the strength of fenix and other product releases. I think in terms of the update to the year, we basically are still seeing things the way that we've laid them out, and it's very early in the year to really make any conclusions based on the start that we've had. But we do have a strong product lineup right now, and we have more new products coming throughout the year in all of our segments. So there's lots of moving pieces, lots of dimensions to this. But if you look at it from a different angle, the operating profit was mostly affected by FX and freight costs. If those things would have been under normal circumstances, we would have been pretty much in the range of where our gross margin and operating margin profiles are for the segment. And then lastly, Doug, on free cash flow. And the share buyback messaging, that's new. Regarding free cash flow, yes, still early in the year, but there's a couple of things you need to consider, one of which is our working capital needs. We did have some of those working capital needs here in Q1, where we saw inventory increased more than the previous year. You also need to factor in last year, we had a large amount of inventory increases in the back of the year. So hopefully, we won't have as much of an increase in the inventory, I'll say, year-over-year than we did last year in there. But the working free cash flow and other things, CapEx is pretty consistent year-over-year for the full year in there. It depends also on the operating side of things, but we'll give you more guidance on that in Q2. As it relates to the share buyback, it's something that we evaluate with the Board, and we felt that was something that was appropriate at this point in time. Regarding the amount that we're going to be doing, it's really depending upon market conditions, business conditions at a point in time, the amount that we buy back during the period. I think we, and you all noted, there were some particularly tough cycling comps year-over-year, but it sounds like there was some year-over-year weakness in the other fitness categories, too. I think that as we mentioned, all categories in this segment were weaker year-over-year. And then you can't discount the impact of our overall wearable product lineup across the company and particularly the release of the new adventure wearables on the outdoor side, which probably impacted things as well. So as I mentioned, we experienced robust growth across all wearables at Garmin. Cliff, it'd be great to get a little more color as to what you're seeing kind of real-time across Europe. It's really not just European, but it's global, but they particularly are impacted by much higher fuel prices and concern and worry over the economy. So I think those factors impacted us in Europe, but we saw a much stronger growth in Americas and APAC. I mean it sounds like it's really built just on the diversity of the business, and I recognize we're still early in the year. As you said, we're maintaining what we said in February. It is early in the year, and this is our lowest seasonal quarter. I would say that in general, we see positive indicators, as I said in my remarks, across many of our segments. And at the same time, the uncertainties have increased and the complexities have increased, so we recognize that as well. Doug and Cliff, first question on gross margin for fitness. Obviously, I think FX headwind, if anything, is probably going to increase in 2Q sequentially and the logistics piece is probably not changing much. As it relates to gross margin for fitness, yes, 2 of the big drivers there, obviously, are freight and FX. And actually, FX is a bigger impact on the fitness business just given our EMEA side of the business in there. So as it relates to the year, it's still early in the year here, but we have to manage through those headwinds, and we'll have to see how those mitigate hopefully. We're doing things, hopefully, help mitigate some of the freight. But FX, that's something -- and we've seen more of the strengthening of dollar there and increases. And then, Cliff, I think you mentioned in your remarks that you're starting to see some improvement in aviation in the aftermarket business as it relates to component supply. We've started to see that improve, especially as we rolled into the month of March and onward. There's been some signs of moderation of retail boating demand, and I know you're exposed more on the aftermarket side. We still see very strong demand for our most popular products and especially driven by the technology developments that we've made in the area of live sonar, and our display systems are all very good and sought after. I would say in terms of retail boating or I would say the OEM side is what we would call that, but in general, we still hear our OEM partners say that they're sitting on years of backlogs in their business and working very hard to deliver the boats that have been ordered. I think in terms of inventory, it varies by product line, but the one that we've been talking about most is the indoor trainer inventory. Retailers do have a lot of inventory in the indoor training category, and they're selling through that, of course. In terms of other categories, it really depends by geography, by retailer, by product line. But in general, we think channel inventory levels are reasonable, and we don't see any concern there. I think in terms of what will happen going forward, as our deliveries increase, we will be able to experience scale in that business. So it should improve our overall operating margin performance, although we're not expecting that to swing to a positive number in the near term. But as we start to deliver the new products to BMW and as our production scale increases, it should generally improve. I think in terms of the customer profile of our wearables, it really depends by product line and by segment. But at the highest level, if you look across all our wearables, we are mostly selling to brand-new customers to Garmin who are registering a new device for the first time and creating a Garmin Connect account. But we also have, of course, a sizable amount of business that we do with people who love to stay current on the latest products that we release. But right now, it's still more of an -- it's still a majority of people that are new to our wearables. The other different question, can you remind us on the revenue recognition methodology with BMW. So as revenue recognition standpoint, probably shouldn't be that much different than we have at this point in time in the different models that come out from that standpoint -- from a revenue recognition standpoint. I think actually, Ben, the content per vehicle on the newer platforms that we're delivering is much higher per vehicle than what we're seeing on the current products delivered out of China as well as out of the U.S. factory here. In some cases, once we get to full production mode with BMW, they've adopted it across all of their platforms. Yes, I think that's a very good question. During the first half of 2021, we saw elevated demands for all cycling products, including the indoor trainers where every factory -- and speaking broadly beyond just Garmin every factory and every manufacturer of those devices were delivering all that they could make to the market because of the demand. In terms of the levels we're seeing, generally, we continue to see that the levels we're settling at for cycling products are in line with reasonable growth of the overall market over the past 2 to 3 years. So what that means is the CAGR is probably somewhere in the 5% to 10% range of the overall market, and it's settling in at some reasonable growth level over 2019 or even early 2020 type numbers. Starting with one clarification question, Cliff. And Cliff, you mentioned earlier about channel inventory levels being reasonable. And then in your -- in the prepared remarks, in the presentation deck, you made similar comments in outdoor, aviation, marine, calling out positive indicators. Well, I think if we just look at those one by one, I would say, in outdoor, our new product releases and the adventure watches are -- we continue to work to fill all of the demand that we're seeing for those. And in addition, there's some golf products that we've struggled to match the demand popularity of some of the products that we have there. On the marine side of things, our new Panoptix LiveScope Plus system is extremely popular. And so we're working to fulfill a lot of back orders on that product, which also drives display systems. And then finally, in aviation, I think our biggest opportunity right now is the aftermarket side of things. And as I mentioned, we're starting to see that get better incrementally, but it will take some time to really fully recover. I think most certainly, we tried to time the launch of the new products optimally, and we felt like it was not the best time to launch in late Q4. I think for our initial plan, we definitely were able to fill the channel. At this time, I would like to turn the call back over to Teri Seck, Director of Investor Relations, for closing remarks."
}