{
    "symbol": "MATW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-28 15:19:03",
    "content": " First, our consolidated sales were $438.6 million for the current quarter, compared to $386.7 million a year ago, representing an increase of $51.9 million or 13.4%. Second, the company's Industrial Technology segment, which includes the energy solutions, warehouse automation and product identification businesses reported sales of $74.3 million for the fiscal 2022 first quarter compared to $53.4 million last year, representing an increase of $20.9 million or almost 40%. This was a significant factor in the reported GAAP net loss of $0.62 for the quarter, but resulted in a reduction in the company's accrued pension liabilities of over $50 million from September 30, 2021. Fifth, the company reported an increase in adjusted earnings per share to $0.74 for the current quarter, compared to $0.68 for the same quarter a year ago. As I noted, the company's consolidated sales were $438.6 million for the quarter ended December 31, 2021, compared to $386.7 million a year ago, representing an increase of $51.9 million or 13.4%. On a GAAP basis, the company reported a net loss of $19.8 million or $0.62 per share, compared to a net loss of $1.8 million, or $0.06 per share for the same quarter last year. GAAP earnings for the current quarter included non-service pension costs of $31.1 million, which is mainly related to the settlement of the company's principal pension plan. Consolidated intangible amortization expense was $21.5 million or $0.51 per share for the fiscal 2022 first quarter, compared to $15.2 million or $0.36 per share a year ago. On a non-GAAP adjusted basis, adjusted EBITDA, which represents net income before interest expense, income taxes, depreciation, amortization and other adjustments for the fiscal 2022 first quarter was $53.3 million, compared to $54.8 million last year. Investment income for the quarter ended December 31, 2021 was $1 million compared to $1.1 million for the same quarter a year ago. Interest expense for the fiscal 2022 first quarter was $6.5 billion, compared to $7.7 million a year ago. Other income and deductions net for the quarter ended December 31, 2021, represented a reduction to pre-tax income of $31.7 million, compared to $1.7 million a year ago. The company's consolidated income taxes for the quarter ended December 31, 2021 were a benefit of $6.6 million, compared to expense of $4 million a year ago. Sales for the Industrial Technology segment were $74.3 million for the fiscal 2022 first quarter, compared to $53.4 million a year ago, representing an increase of $20.9 million or 39%. Adjusted EBITDA for the Industrial Technology segment more than doubled to $7.2 million for the fiscal 2022 first quarter, compared with $3 million a year ago. Memorialization segment sales for the fiscal 2022 first quarter were $210.7 million, compared to $183.3 million a year ago, representing an increase of $27.4 million or 15%. Memorialization segment adjusted EBITDA for the fiscal 2022 first quarter was $43.4 million, compared to $44.1 million a year ago. Sales for the SGK brand solution segment were $153.5 million for the quarter ended December 31, 2021, compared to $150 million a year ago, representing an increase of 2.4%. Changes in foreign currency rates had an unfavorable impact of $2.4 million on the segment's current quarter sales, compared with the same quarter last year. In addition, as a result of the termination related funding of our pension plan, the company's accrued pension liabilities declined $51 million during the current quarter from $85 million at September 30, 2021 to $34 million at December 31, 2021. And we expect to begin to demonstrate that group this year, as we work to deliver exceptionally high backlogs of over $200 million in the combined Industrial Technology segments of which the backlog of our energy storage business represents over $100 million. In fact, this segment -- we expect this segment to have revenues of well over $300 million in adjusted EBITDA margins of over 15%, which will help us mitigate the impact of inflationary pressures elsewhere in the company. Although we only deliver $20 million of revenue during the quarter for our energy storage business, which was a significant increase from last year, we are still on track to deliver over $100 million for fiscal '22. We had $20 million worth of energy storage business that was delivered during the quarter and I said, we're going to deliver around $100 million, who we have $80 million yet to be delivered over the next couple of quarters, which right now is producing at pretty good margins in that range that we spoke about. Scott in total for the company on revenues, it was about a $4 million headwind compared to a year ago."
}