{
    "symbol": "MATW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-29 12:50:03",
    "content": " Second, the company's industrial technology segment which includes the energy solutions, warehouse automation, and product identification businesses reported sales of $78.2 million for the fiscal 2022 second quarter compared to $65.3 million last year representing an increase of $12.9 million or almost 20%. On a non-GAAP basis adjusted EBITDA which represents net income before interest expense, income taxes, depreciation and amortization, and other adjustments for the fiscal 2022 second quarter was $55.2 million compared to $60.9 million last year. For the six months ended March 31, 2022 consolidated sales increased $883.6 million compared to $803.8 million a year ago, representing an increase of $79.7 million or almost 10%. On a non-GAAP basis adjusted EBITDA for the six months ended March 31, 2022 was $108.5 million compared to $115.7 million last year. Investment income for the quarter ended March 31, 2022 was a loss of $327,000 compared to an income of $1 million for the same quarter a year ago. Investment income for the six months ended March 31, 2022 was $676,000 compared to $2 million last year. Other income and deductions net for the quarter ended March 31, 2022 represents pre-tax income of $562,000 compared with net expense of $2.6 million a year ago. The company's consolidated income taxes for the quarter ended March 31, 2022 were $3.3 million compared to $972,000 a year ago. For the six months ended March 31, 2022, the company's consolidated income taxes reflected a benefit of $3.4 million compared to an expense of $5 million last year. Sales for the Industrial Technology segment were $78.2 million for the fiscal 2022 second quarter compared to $65.3 million a year ago, representing an increase of $12.9 million or approximately 20%. Year-to-date sales for the industrial technology segment were $152.5 million for March 31, 2022 compared to $118.7 million a year ago, representing an increase of $33.8 million or approximately 28.5%. As a result of this sales growth, adjusted EBITDA for the Industrial Technology segment was $14.4 million for the fiscal 2022 second quarter compared with $8.3 million a year ago. On a year-to-date basis, adjusted EBITDA for the Industrial Technology segment nearly doubled to $21.6 million compared with $11.3 million last year. Memorialization segment sales for the fiscal 2022 second quarter were $220 million compared to $205.5 million a year ago, representing an increase of $14.5 million or 7.1%. Memorialization segment adjusted EBITDA for the fiscal 2022 second quarter was $42.9 million compared to $51.6 million a year ago. Memorialization segment adjusted EBITDA for the six months ended March 31, 2022 was $86.3 million compared to $95.7 million last year. Sales for the SGK Brand Solutions segment improved to $146.8 million for the quarter ended March 31, 2022 compared to $146.4 million a year ago. Fiscal 2022 second quarter adjusted EBITDA for the SGK Brand Solutions segment was $13.5 million compared to $18.4 million a year ago. Outstanding debt was $753 million at March 31, 2022 compared to $836.1 million at the end of the first quarter and $763.7 million at September 30, 2021. Cash flow provided by operating activities for the six months ended March 31, 2022 was $72.7 million compared to $92.2 million last year."
}