{
    "symbol": "MATW",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-18 16:14:06",
    "content": " For the fiscal 2022 fourth quarter, we reported consolidated sales of $457.1 million compared to $438.8 million for the fourth fiscal quarter last year. On a constant currency basis with last year, consolidated sales for the fiscal 2022 fourth quarter were $41.8 million, or 9.5% higher than a year ago. For the year ended September 30, 2022, we reported consolidated sales of $1.76 billion compared to $1.67 billion last year, representing an increase of $91.4 million or 5.5%. On a constant currency basis, consolidated sales for fiscal 2022 were $147.7 million, or 8.8% higher than a year ago. Changes in foreign currency rates had unfavorable impacts of $23.6 million and $56.3 million, respectively, on consolidated sales compared to the same quarter and year-to-date period last year. On a GAAP basis, the company reported a net loss of $81 million, or $2.63 per share for the current quarter compared to a loss of $3.7 million or $0.12 per share for the same quarter last year. As a result, primarily of the impact of European market conditions on recent operating results, we recorded a non-cash goodwill impairment charge of $82.5 million, or $2.59 per share for the SGK Brand Solutions segment in the fiscal 2022 fourth quarter. For the year ended September 30, 2022, the company reported a net loss of $99.8 million, or $3.18 per share compared to net income of $2.9 million, or $0.09 per share last year. On a non-GAAP adjusted basis, adjusted EBITDA, which represents net income before interest expense, income taxes, depreciation and amortization and other adjustments was $55.9 million for the fiscal 2022 fourth quarter compared to $52 million last year. In addition, currency rate changes had an unfavorable impact of $3.5 million on consolidated adjusted EBITDA for the current quarter compared with a year ago. For the year ended September 30, 2022, consolidated adjusted EBITDA was $210.4 million. For the year ended September 30, 2022, the company's consolidated income taxes were a benefit of $4.4 million compared to expense of $6.4 million last year. The Industrial Technologies segment reported sales of $104.6 million for the current quarter compared to $84 million a year ago, representing an increase of almost 25%. For the year ended September 30, 2022, sales for the Industrial Technologies segment were $335.5 million compared to $284.5 million a year ago, representing an increase of $51 million or 17.9%. On a year-to-date basis, adjusted EBITDA for the Industrial Technologies segment increased approximately 63% from $34.9 million last year to $56.8 million for the current quarter -- current fiscal year. For the year ended September 30, 2022, Memorialization sales were $840.1 million compared to $769 million last year. For the year ended September 30, 2022, memorialization adjusted EBITDA was $151.8 million compared to $165.7 million last year. For the year ended September 30, 2022, the segment reported sales of $586.8 million compared to $617.5 million last year, representing a decrease of $30.8 million. For the year ended September 30, 2022, adjusted EBITDA for this segment was $60.1 million compared to $91.4 million last year. In addition, changes in currency rates had unfavorable impacts of $1.6 million and $5.1 million, respectively, on the segment's adjusted EBITDA compared to the same quarter and year-to-date period last year. Cash flow provided by operations for the quarter ended September 30, 2022, was $42.5 million compared to $56 million a year ago. For the year ended September 30, 2022, cash flow provided by operations was $126.9 million compared to $162.8 million a year ago. Outstanding debt for the current year reflected the impacts of the acquisitions of Olbrich and R+S, which approximated $45 million and the contributions in the fiscal 2022 first quarter toward the settlement of the company's pension plans, which approximated $36 million."
}