{
    "symbol": "MATW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-29 15:23:01",
    "content": " For the fiscal 2022 third quarter, we reported consolidated sales of $421.7 million compared to $428.4 million for the third fiscal quarter last year. Excluding currency impacts, fiscal 2022 third quarter sales for the Industrial Technologies segment also improved relative to a year ago. On a GAAP basis, the company reported net income of $2.9 million or $0.9 per share, compared to $3.4 million or $0.10 per share for the same quarter last year. On a non-GAAP basis, adjusted EBITDA, which represents net income before interest expense, income taxes, depreciation and amortization and other adjustments, for the fiscal 2022 third quarter was $46 million, compared to $60 million last year. In addition, currency rate changes had an unfavorable impact of $2.5 million on consolidated adjusted EBITDA for the current quarter compared with a year ago. Adjusted earnings per share was $0.58 for the current quarter compared to $0.91 last year, primarily reflecting the reduction in adjusted EBITDA. Investment income for the quarter ended June 30, 2022, was $59,000 compared to $959,000 for the same quarter a year ago. Interest expense for the fiscal 2022 third quarter was $6.7 million, which was relatively consistent with the third fiscal quarter last year. Other income and deductions net for the quarter ended June 30, 2022, represented expense of $448,000 compared with $2.4 million a year ago. Year-to-date, other income and deductions net for fiscal 2022 represented net expense of $31.6 million compared to $6.8 million last year. The company's consolidated income tax expense for the quarter ended June 30, 2022, was $1 million compared to a benefit of $2.3 million a year ago. For the 9 months ended June 30, 2022, the company's consolidated income taxes reflected a benefit of $2.3 million compared to expense of $2.6 million last year. Memorialization segment sales for the fiscal 2022 third quarter were $203.2 million compared to $184.3 million a year ago, representing an increase of $18.8 million or 10.2%. Year-to-date, sales for the Industrial Technologies segment were $230.9 million for June 30, 2022, compared to $200.5 million a year ago, representing an increase of 15.2%. Sales for the SGK Brand Solutions segment were $140.1 million for the quarter ended June 30, 2022, compared to $162.2 million a year ago. Cash flow provided by operating activities for the 9 months ended June 30, 2022, was $84.4 million compared to $106.9 million last year."
}