{
    "symbol": "SHCR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 09:50:31",
    "content": "  Operator: Good day, everyone and welcome to the Sharecare Third Quarter 2022 Earnings Call and Webcast. On todayâ\u0080\u0099s call we have Mr. Jeff Arnold, Chairman and CEO; Mr. Justin Ferrero, President and Chief Financial Officer, as well as Mr. Jaffry Mohammed, Chief Operating Officer, who will join for the question-and-answer session. Before we begin, we would like to remind you that certain statements made during this call will be forward-looking statements within the meaning of the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995, which includes statements regarding potential strategic reviews and our guidance. These forward-looking statements are subject to various risks and uncertainties and reflect our current expectations based on our beliefs, assumptions and information currently available to us. Descriptions of some of the factors that could cause actual results to differ materially from these forward-looking statements are discussed in more detail in our filings with the SEC, including the Risk Factors section of our Form 10-K for the year ended December 31, 2021. In addition, please note that the company will be discussing certain non-GAAP financial measures that we believe are important in evaluating performance. For the third quarter of 2022 we delivered revenue of $114.6 million and adjusted EBITDA of $7.2 million, reflecting our continued momentum across the business. During the quarter, we executed on our strategy as evidenced by signing a multi-year strategic agreement with Carelon, the healthcare service subsidiary of Elevance Health, expanding our EBITDA margin, reducing our cash burn and tracking to hit our core KPIs of $12 million eligible lives and $6 million medical records processed by year-end. I'm pleased to report that we've increased our pipeline by 300% on a year-over-year basis and nearly doubled our RFPs, which doesn't account for the up sell opportunities with existing clients across our installed base. With $203 million on our balance sheet, we are very secure financially and well positioned to fund our continued growth. In the enterprise channel, we continue to focus on delivering value to our customers through well-being engagement, lifestyle and disease management, cost of care optimization, and improved quality and access to care. As mentioned, we took another important step in expanding our relationship with Elevance by closing the contract for our multi-year strategic partnership with Carelon. Together, we are integrating our digital first advocacy solution, Sharecare Plus and to their health guide services for hundreds of thousands of their members, which speaks to our ability to drive member engagement and increase value for our strategic partners. As a reminder, Sharecare Plus is our digital-first comprehensive advocacy solution designed to deliver value through benefits navigation, clinical engagement, virtual care and chronic case and utilization management. We continue to invest in our capabilities to aggregate longitudinal clinical data with digital connectivity with health systems, advanced clinical, cost of care analytics and deliver high touch care utilizing telephonic and in-home care models through our CareLinx network. We also continue to build out our digital therapeutic ecosystem, including investing in Sharecareâ\u0080\u0099s clinically validated programs. Related to that, we continue to invest in retaining and recruiting talent on our teams, including the recent appointment of our new Chief Medical Officer, Dr. Jud Brewer, a renowned psychiatrist, neuroscientists and Co-Founder of MindSciences, which Sharecare acquired in June of 2022. And from a financial perspective, Sharecare Plus moves Sharecare into higher PMPMs associated with the benefits navigation space with the ability to take upside and downside risk on the cost and quality of care. Even as uncertainty in these markets may persist, we anticipate we will continue to see increased demand for the value added and cost efficient advocacy solutions. Additionally, with our ability to leverage employees longitudinal data alongside Sharecareâ\u0080\u0099s proprietary community well-being data and insights, we can deliver actionable precision analytics they yield high ROI, helping employers improve well-being and optimize the overall cost of benefits. Simply put, we believe, Sharecare is uniquely positioned to deliver the impactful member experience that they're looking for with the ease of implementation, whether onboarding an entire population for the first time, for introducing new clinical capabilities within the platform, such as advocacy for home health. In addition to Sharecare Plus agreement with Carelon, we've experienced diversified growth in our enterprise channel during the quarter with strength in our home health offering. This quarter marks the one-year anniversary of our acquisition of CareLinx, which has been very successful both in opening us to new markets and datasets and expanding the capabilities we offer to our health plan, employer, government and provider customers. Since we acquired this asset, CareLinx has delivered excellent results in achieving and exceeding the medicare supplemental benefit targets for our Medicare Advantage customers. To-date, we have grown the Medicare Advantage members we serve from 300,000 to over 1.8 million, and we expect that market to continue to expand as we look to 2023 and beyond. We have successfully integrated CareLinx capabilities into our core advocacy offering, increasing our precision for engagement. We continue to invest in and expand CareLinxâ\u0080\u0099s capabilities to deliver clinical services, to reduce the cost of care through high quality, transitional care services to optimize readmission rates. This was our largest quarter in the company's history with $29 million in revenue, an increase of 20% year-over-year and an expansion in margins. It is important to note that we hired Harsha Panyadahundi, who has an extensive payer and provider ecosystem expertise as our Chief Technology Officer in the quarter. In Life Sciences, we saw success in continuing to grow our top 20 pharma clients and brands and maintained solid client retention in the quarter. Like others in the industry, we're seeing reduced media spend for pharma DTC. According to IQVIA's Channel Dynamics data from July 2022, pharma DTC promotional spending through July was down more than 14%, compared to the prior year. And from what we can see, we'll continue to trend in that direction for the rest of the year. We're also seeing fewer new pharma brands being supported, especially compared to last year, which was a particularly robust year for new brand indications. It's worth noting that the Life Science channel has historically performed very well, growing organically over 35% in 2021, and has also grown year-over-year through the third quarter even in a challenging macro environment. Despite the headwinds, we're optimistic about growth from our 2023 Life Sciences product suite and confident our positive performance metrics will continue to drive renewals, and keep Sharecare at the forefront of buying decisions. Additionally, capitalizing on assets and talent realized through our 2021 Doc AI acquisition, Sharecare recently introduced the next generation of the Smart Omix platform, our proprietary no code solution that enables real world data collection and digital biomarker creation by empowering researchers, clinicians and academic institutions to conduct digitally enabled research studies independently. By expanding Smart Omixâ\u0080\u0099s capabilities, Sharecare not only broadens the scope of its opportunity in Life Sciences beyond the point of commercialization, but also plays an important role in advancing relevance, equity and data integrity and clinical research across the healthcare continuum. Given our expertise in engaging consumers, we will continue to invest in capabilities to bring efficiencies to clinical research for our pharma and non-pharma customers. Regarding our previously discussed strategic review, we continue to actively evaluate a number of potential opportunities to enhance shareholder value. We have seen a lot of excitement around Sharecare, so there remains an array of potential comes, but we won't be commenting further unless and until additional disclosure is necessary or appropriate. Additionally, we have $50 million still available in our stock buyback program. With the strength of our balance sheet and our belief in the value of our assets, we will continue to evaluate future use of that alternative to drive value for our shareholders as well. Now let me turn the call over to Justin, who will review our financial results for the quarter and share some additional commentary regarding the remainder of fiscal 2022. As Jeff shared, we delivered strong results for the third quarter of 2022 for both revenue and adjusted EBITDA. Year-over-year growth was impacted by our previously disclosed decision to sunset certain businesses, which resulted in a revenue reduction of approximately $9 million over the prior year period. When normalizing for the sunsetting of those products, our overall year-over-year growth was 19%. Our adjusted EBITDA performance was due to a combination of factors, including cost management, as well as gross margin expansion in both our Provider and Life Sciences channels. Note that the third quarter adjusted EBITDA margin of 6.3%, represents a significant increase from Q2 adjusted EBITDA margin of 2%. In addition, we remain in a very strong financial position with $203 million in cash in our balance sheet and over $250 million in available cash. I will note that our cash burn in the quarter was reduced to $9 million, which represents a significant reduction to cash burn from Q2. Last quarter, we suspended guidance for the remainder of 2022 and stated that we would hold an Analyst Day in Q4. To close out my comments, I want to reiterate that we remain confident in Sharecare's long-term outlook. So far in 2022, we have enhanced our product offerings with our home health and advocacy solutions, significantly grown our pipeline and reduced cash burn. We also have a very strong balance sheet, enabling us to continue to invest in growth. Please go ahead with your question. We'll have almost 900,000 members on Sharecare Plus heading into 2023, so a new product launch higher PMPMs, nearly 900,000 members to start. Enterprise margins are right around 50%, 49% to 50%, but we believe with our digital-first platform that we can expand those to the mid-50s over the long-term. Well, as you know, we're a single reporting. So we don't break out EBITDA margin by division, but our long-term goal is 20% plus and think of that over a three to four year period. And then I think, I heard you say that you're helping the plans bear risk. And Jaffry, maybe have you answered that, since Sharecare, kind of, looks as these contracts are moving towards risk, kind of, how are we positioned to participate there. I mean, as you know, David, the trend is going towards the direction where more and more risk based contracts are coming up. Now we would take very pragmatic approach towards taking the risk both for our fees, for PMPM, plus the upside and downward risk. We're proud of it too, especially the growth over Q2, 6.3% versus 2%. And a lot of what we've talked about historically, Dave is that we're fully invested and that there's a lot of leverage in our model. Please go ahead with your question. And I think on the last call, you talked about or maybe in our follow-up with respect to the importance of getting Carelon signed and that maybe others were waiting to see execution on that, but so what you're saying here is you're going to have 900,000 individuals live on Sharecare Plus January 1, did I hear that correctly? Well, I was making the point that the macro environment for Life Sciences for direct-to-consumer advertising is down for the year. But it's a great division for us, I mean, it grew 35% last year, pays for all the amazing content that we produce that we use in enterprise and we're holding serve, meaning that even in these headwinds, we're still growing in Life Sciences, we're just not growing as fast as we were last year. But there's headwinds and 35% of our Life Science revenue comes in Q4, and so we expect softness in that area in Q4. But on a positive side is we're seeing some momentum in the upfronts, and so for 2023 and we're seeing some new brand indications and retaining existing clients. So on the consumer side, we were call it $20.7 million and Provider, we were $28.7 million and then in enterprise $65.2 million. And my final question is just like on enterprise, it sounds like you guys have a lot of momentum there. Well, we are seeing some trends like we've seen finalist meetings get delayed or RFPs been pulled back. And also now we've got 900,000 new members that are going to be onboarding into Sharecare Plus at a higher PMPM. And at the same time, we're building out a bigger sales force and we're building better relationships with the brokers and taking that new offering back into the installed base. And so that's contributing to a big pipeline that's contributing to renewals, that's contributing to new sales. But yes, overall, I mean, everybody is cautious in every area of making ensure they're making the right decisions and sometimes those decisions get delayed. For Sharecare Plus, it's just the example. The first account to get Sharecare Plus was our 2,500 associates and the implementation was so easy. Please go ahead with your question. Just staying on enterprise, I know there's been a lot of growth in the sales force that you just mentioned. Yes, I believe -- hey Craig, it's Justin. Thank you, I think Jeff touched on this is -- we continue to make those investments and we've brought in a great leader. We've expanded the team, we've expanded the areas of their focus from the benefits consultants to government, to commercial, to MA, so across the board. Our pipeline is up 300% and so the combination of significantly expanded pipeline as we look to 2023 and 2024, and a more experienced team over that time, plus you've add -- we've now added the Carelon relationship that our enterprise business is in a really good place for the foreseeable future. No, I think Justin covered that, plus the packaging of our product and what Jeff mentioned in terms of having the ecosystem to deliver quality, to deliver access, and also to impact the cost of care is one of the driving factor for our enterprise business group. And the fortunate thing is, Jaffry, who's on the call with us, this is he comes from this world and managed tens of thousands of outsourced resources in his past position, and we'll start to see the benefits of that start in Q4, then we'll do other transitions of the work force in Q1 and Q2 and start to see the full benefit in the second half of â\u0080\u009823. We're referring to hundreds of employees, but we're very smart on who we're targeting the frontline workers that are touching our customers. Please go ahead with your question. Justin, so of the $65.2 million in enter price. So, CareLinx, we don't break it out exactly as we've talked about on last calls, but CareLinx is trending up. And that acquisition has been tremendous for the shareholders and our customers and it continues to grow quarter-over-quarter, but you're directionally in the right place. I was just wondering if you gave it, but I don't think -- yes, I usually it's -- I have to go back, I'll calculate the PMPM, because I was thinking maybe CareLinx is around $10 million or so. So like maybe enterprise is like $55 million, so I was just -- so I'll go back and do that, but yes. Let me say, yes, I'll say it this way, Cindy, because that we talked about the PMPM a lot. So we're not receiving full value of that contract yet, but that will ultimately increase our PMPM on an aggregate basis. Like you said, it still grew if it was $20.7 million. And yes, we're very serious about the strategic review and carefully reviewing all options. I just wanted to go back to the adjusted EBITDA, because we've had the number of add backs, the transaction and closing costs for a while, it's still running like $9.3 million and I think that's cash cost. And then just also to what is the other expense, the $2.4 million of just if you could give any color? The -- so again, as we continue to right size the infrastructure really that's been driven by increased severance for this quarter. We're investing in things like ERP systems and workday, it's one-time things that go below the line. So we're going to see it, it's going to be there in fourth quarter. I mean, a lot of it should be gone, but again, there could be -- there's areas that are in that number that are earn out accruals that are depending on do they -- are they earned or not, but we need to accrue form. Please go ahead with your question. It looks like it's a little bit lower than, I think consensus in us we're expecting. And so it would be those two areas that CareLinx is growing faster, and then we're now adding advocacy, and so that would be the slight drag to gross margins. They're still at 49%, which isn't much different than our last quarter. And then you said there's a lot of leverage in your business model, particularly when it comes to Q4. So my comment on operating leverage, that's really across the business. In the G&A side of the business, I think that we'll continue to expand there. And as Jeff talked about earlier on one-one, we have a significant onboarding of close to 1 million lives. And ladies and gentlemen, with that we'll be concluding today's question-and-answer session. Well, in closing, I wanted to highlight a few key takeaways from our third quarter. As I believe, we've made a lot of progress that sets us up for a successful 2023 and beyond. Number one, recruiting and retaining the talent, we've been able to assemble internally is of great importance to us. We've expanded our relationships with Elevance by closing our partnership with Carelon, which as we mentioned is one of the largest annual contract that we've signed to-date at the company. As everyone knows, Elevance invested in Sharecare, pre-IPO. And with all that momentum, we were able to secure hundreds of thousands of Carelon members for Sharecare Plus that you will see all of them represented in our financials for 2023. So it was our biggest quarter ever and that business continues to operate really well, continues to give us tons of cross-selling opportunities and access to data that we think is going to be critical as we start to look at-risk models. Our Life Science channel is facing challenging macro conditions as we discussed, but we are still up year-to-date and believe set up for a solid 2023. From a financial perspective, as Justin said, our revenue is growing, our adjusted EBITDA is positive, we've continued to reduce our cash burn. And ladies and gentlemen, with that we'll conclude today's conference call."
}