{
    "symbol": "UPS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 12:25:02",
    "content": " For the third quarter of 2022, GAAP results include a non-cash after-tax mark-to-market pension gains of $782 million, a onetime non-cash after tax charge of $384 million resulting from accelerated vesting of restricted performance units in connection with the change in incentive compensation program design, a non-cash after tax charge of $58 million from a reduction in the residual value of our MD11 aircraft and after tax transformation and other charges of $41 million. Consolidated revenue was $27 billion, down 2.7% from last year, and operating profit was $3.8 billion, a decrease of 3.3%. Consolidated operating profit in 2022 totaled $13.9 million, 5.4% higher than last year, and consolidated operating margin reached 13.8%. Consolidated revenue was $27 billion, down 2.7% from the fourth quarter of last year, and operating profit was $3.8 billion, a decrease of 3.3% compared to the fourth quarter of last year. In the fourth quarter, average daily volume was down 3.8% versus the same time period last year, with about half of the decrease coming from our largest customer, per the mutually beneficial contractual agreement we reached some time ago. Looking at customer mix, SMBs made up 26.5% of our total U.S. domestic volume in the fourth quarter, an increase of 70 basis points from one year ago, and the 10th consecutive quarter of increased SMB penetration. The U.S. domestic segment delivered $2.3 billion in operating profit, up 7.5% compared to the fourth quarter of 2021. In the fourth quarter, international revenue was $5 billion, down 8.3% from last year, due to the decline in volume and a $321 million negative impact currency. Revenue per piece was relatively flat year-over-year, but there were a number of moving parts including a 660 basis point decline due to a stronger U.S. dollar, a 540 basis point increase from fuel surcharges and the remaining increase of 100 basis points was due to the combination of multiple factors including favorable product mix, base price increases and lower demand related surcharge revenue. Operating profit in the international segment was $1.1 billion, down $240 million from last year due to $139 million reduction in demand related surcharge revenue and a $98 million negative impact from currency. Now looking at Supply Chain Solutions, in the fourth quarter revenue was $3.8 billion, down $846 million year-over-year. In the fourth quarter, Supply Chain Solutions generated an operating profit of $403 million and operating margin was 10.5%. In 2022, we generated operating profit of $13.9 billion, an increase of 5.4% over full year 2021 consolidated operating margin was 13.8%, an increase of 30 basis points. And in the segments for the full year, a U.S. domestic operating profit was $7.6 billion up 12.8% and we expanded operating margin to 11.8%, a year-over-year increase of 70 basis points. And Supply Chain Solutions delivered operating profit of $1.9 billion, an increase of $153 million and operating margin was 11.3% an increase of 150 basis points over 2021. Turning to Supply Chain Solutions, we expect revenue to be around $14.6 billion as forwarding volumes will remain challenged and market rates will fall from year-end 2022 levels. In U.S. domestic, we reduced expected enterprise and SMB volume growth rates, resulting in a full year volume decline of around 3% versus 2022. Bringing it all together for the full year 2023, we expect consolidated revenues to be between $97 billion and $99.4 billion and consolidated operating margins to be between 12.8% and 13.6%, with more than half of our operating profit coming in the second half of the year. Above the line, we expect the combination of these two factors will reduce operating expenses by approximately $420 million in 2023, with around 90% of the reduction in the U.S. domestic segments. Below the line, we expect pension income of around $260 million for the full year 2023, which is $930 million less than in 2022 primarily due to higher interest rates, resulting in an increase in pension interest expense and a reduction in the value of our pension assets for market performance in 2022. And to dimensionalize the investment that we're making in smart package smart facility, it's about $140 million of expense this year, which will not repeat the following year, and about $106 million of capital."
}