{
    "symbol": "UPS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 12:32:03",
    "content": " For the third quarter, consolidated revenue rose 4.2% from last year to $24.2 billion and operating profit grew 6% to $3.1 billion. In the third quarter, we grew U.S. SMB average daily volume, including platforms, by 1.9% and SMBs made up 28.3% of our total U.S. volume in the quarter, an increase of 90 basis points from last year. For the third quarter diluted earnings per share was $2.99, up 10.3% from the same period last year. In the third quarter, average daily volume was down 1.5% versus the same time period last year, but the growth rate was an improvement over the first half of 2022 as new volume from the record number of wins we had in the second quarter came into the network. In the third quarter, we grew SMB average daily volume, including platforms, 1.9% and SMBs made up 28.3% of our total U.S. domestic volume in the quarter, an increase of 90 basis points from 1 year ago. Cost in U.S. domestic came in as we expected due to our planned productivity initiatives, which drove our cost per piece growth rate to be lower in the third quarter than it was in the second quarter and partially offsetting wage and benefit increases. Domestic segment delivered $1.7 billion in operating profit, an increase of $272 million or 19.2% compared to the third quarter of 2021. These changes enabled us to move volume for our customers where it was available, maintain high levels of service and achieve a payload utilization of over 98% on our Asia outbound intercontinental flights in the third quarter. In the third quarter, international revenue increased 1.7% and to $4.8 billion, which included a negative currency impact of $335 million and a fuel benefit of $363 million. Operating margin in the third quarter was 20.9%, which was down from the same period last year due to the delevering of our fixed costs and the impact of a stronger U.S. dollar. In the third quarter, revenue was $4 billion down $268 million year-over-year, which included a $92 million negative impact from currency. In the third quarter, Supply Chain Solutions generated operating profit of $459 million and delivered a record third quarter operating margin of 11.5%, an increase of 100 basis points over last year. Starting with U.S. domestic, we anticipate fourth quarter 2022 revenue growth of around 4.5% driven by strong revenue quality, and we expect fourth quarter operating margin to expand year-over-year to around 12.4%. We anticipate our share growth and revenue quality initiatives will offset the weaker macroeconomic environment and negative currency impacts, and we expect international operating margin to increase sequentially in the fourth quarter of 2022 to around 21.5% as we continue to respond to market changes with agility. In Supply Chain Solutions, we expect revenue in the fourth quarter to be above $4 billion as we partially offset declines in the air and ocean freight forwarding revenue with continued growth in logistics and our healthcare business."
}