{
    "symbol": "PDD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-28 12:12:03",
    "content": " My name is Chen, and I will help host the earnings call. PDD earnings release was distributed earlier and is available on IR website at investor.pddholdings.com, as well as through GlobeNewswire services. Before we begin, I would like to refer you to our Safe Harbor statement in the earnings press release, which applies to this call, as we will make certain forward-looking statements. Also, this call includes discussions of certain non-GAAP financial measures. Joining us today on the call are Chen Lei, our Chairman and Chief Executive Officer; Liu Jun, our VP of Finance. Jun will then take us through our financial results for the third quarter ended September 30, 2022. During the Q&A session, Lei will answer questions in Chinese and I will help translate. Over the past quarter, we worked closely with our merchant partners to serve our customers. During the past few months, many product categories such as agriculture, consumer electronics, beauty and cosmetics they all enjoyed positive consumer feedback. We are happy to keep creating value for our consumers, but the meanwhile we still have areas to improve and the current industry competition remains intact. We need to continue to deepen our value creation, increase our R&D investment to help further improve the supply chain efficiency, support upgrade of the price side and facilitate agricultural digital inclusion. We celebrated our seventh anniversary last month and we are extremely grateful for the support and trust from our consumers, merchants, farmers and society. From the very beginning, we committed to introducing technology to improve the efficiency of supply chain and create value to all the parties through digitalization. In the past year or so, we increased our investment in technology and focus on driving innovation through research and development. We have built a young, energetic, innovative team with strong technology background and we are encouraged to see that our investment in technology is creating positive impact to society. In agriculture, we keep promoting our holistic approach to digitalize the agricultural sector so that more and more people can benefit from advances in science and technology. Our approach at agriculture is a holistic way of creating inclusive growth by leveraging the resources of Pinduoduo, we hope that more farmers will adopt agricultural technology to improve their productivity and put their farming practices in a more sustainable city. In September, Pinduoduo launched a dedicated amid availing for the platform to support annual harvest festival to its exclusive e-commerce platform pattern. During the harvest festival, we worked with CCTV and assemble professors from the Chinese Academy of Agricultural Sciences and the China Agricultural University to promote agricultural technology. In harvest festival, we also showcased a series of new and improved wheat varieties cultivated by China Agriculture University with the support of our 10 billion agricultural initiative. In addition, we continue to support various events to promote the adoption of agricultural technology. Participating teams will compete to produce letters in shipping containers, using lightning, cross modeling and algorithms to consume input variables. We hope that this initiative can inspire more young researchers, bring more research findings to the market and support the development of agriculture. And in the past several years, we have helped to intubate nearly 1,000 manufacturing brands through technology. And since the beginning of this year, we have launched several activities to support the manufacturing industry. For example, this year, we launched a new craftsman campaign to help local craftsmen and the manufacturers by bigger market for their products through e-commerce. The new craftsman program is now in many regions across the country, helping local manufacturing to build their brand. I will go through our performance in the quarter ended September 30, 2022. In terms of P&L, our total revenues in the quarter were RMB35.5 billion, up 65.1% from RMB21.5 billion in the same quarter of 2021. Revenues from online marketing services and others to RMB28.4 billion this quarter, up 58.4% compared with the same period of 2021. Moving on to cost and expenses, our total cost of revenue increased 13% from RMB6.6 billion in Q3 2021 to RMB7.4 billion this quarter. Our investment in certain projects, including a few agricultural related projects, which have factored in Q3 and such our total operating expenses as a percentage of our total revenues have declined from 59.6% in Q3 2021 to 49.7% in this quarter. Looking into specific expense items, our non-GAAP sales in the marketing expenses this quarter RMB13.4 billion, 39% versus the same quarter of 2021. On a non-GAAP basis, our sales and marketing expenses as a percentage of our revenue this quarter was 37.9%, compared with 44.9% for the same quarter in 2021. Our non-GAAP research and development expenses were RMB2.1 billion, an increase of 15% from RMB1.9 billion in the same quarter of 2021. Non-GAAP net income attributable to ordinary shareholders was RMB12.4 billion, compared with RMB3.1 billion in the same quarter last year. On the other hand, we continue to see user engagement, which contributed to revenue growth. As such, we think is unlikely that profit level of the past quarter can be maintained. As of September 30, 2022, the Company had RMB137.8 billion in cash, cash equivalents and short-term investments. For today's Q and A session, Lei and Jun will take questions from analysts on the line. Operator, we may now take questions on the line. Joyce, so let me take your two questions. With regards to your first question on growth, during the third quarter, we worked closely with our merchants to create value for our consumers. And we keep bringing our consumers more savings, more short-term experience in the Pinduoduo platform and we adopted different methods including coupons and also promotional events to better serve our consumers. And at the same time, we saw that our consumers demand for high quality products are growing. And this year, more and more brands have started to cooperate with us. They provide more choices for consumers and categories such as agricultural produce, electronics, home appliances, as well as cosmetics. And as for your second question for our international business in our last quarter's earnings conference call, we share with you the international business that we are working out. And for our team, the international business is a new area to tour and we will start from the fundamental needs of consumers and apply the operation and supply chain knowhow and experiences that we have gained over the years and strive to create our own unique value. But I'm pretty certain that, the experience that we gain along the way will be very valuable for our company and also for our team. So operator, we are ready to move on to the next question. So let me address your second question around our support for the manufacturing sector and the supply chain, first. From the beginning, we have been leveraging our technical background to help improve the efficiency in the manufacturing sector. And in the process, it helps the brands create, their own brands will manufacture. So over the past seven years, Pinduoduo has helped to boot up nearly 1,000 brands through technology. In addition, we also provide one stop digital solution covering the entire value chain to our manufacturing partners. In order to help traditional manufacturers and factories to go through digital transformation and we cooperate with these manufacturers, prior product designs and adjustment. This in turn can create a virtuous cycle amongst consumers, our manufacturing partners and also the Pinduoduo platform. And this year, we have introduced several dedicated initiatives to support manufacturers with technology. This includes many industries, such as consumer appliances, apparel, sports, cosmetics, homecare as well as our furniture. Well, in the third quarter, we worked closely with our merchants to serve our consumers and improve their shopping experience. As the consumer activities and engagement grow, we think the merchants are actually coming to our platform for growth and opportunities. And for financial metrics such as GMV and revenue, they are mainly the reflection of the value we create. So, for us, the most important thing is to constantly increase value creation. We will continue to invest to deeper use much engagement and for the build up our technology capabilities, this will lay the foundation for our long-term development. So for this question, we always start from consumers' fundamental need. And we also fully understand that to improve consumer experience and deepen their trusting us, it takes time, and it is a gradual process. And for shopping festival and promotions, they are just one of the many ways to serve our consumers well. So when we plan shopping festivals and events, we remain consumer-centric and we use simple rules to provide consumers with an enjoyable shopping experience. This year, we have incorporated with many brands as well as merchants to bring more quality products to consumers in order to satisfy their diversified needs across different categories and different consumption scenario. And at the same time, if we look at the industry, we do see the competition remains intense and we need to invest patiently in the supply side. Well, first of all, our international business currently in a very early stage. Operator, we can move on to the next question. And for many of our efforts, we are still in the early stage of our agricultural strategy but we already see a lot of areas to create value. During the third quarter, in our dedicated promotional events such as the harvest festival and agricultural festival we cover thousands of production regions and help farmers broaden their market access. On top of that, sales volume can also help commercialize agritech solutions and supports research efforts and improve the -- how commercialization happens. So for example, in our harvest festival event, we introduced many agricultural products created with the help of agritech and with resources that we devote into agriculture. As for our 10 billion agricultural initiative, we recently introduced a few new wheat varieties developed by China Agriculture University with support from this initiative. In agriculture, we will continue to remain down to earth and make long-term patient investment as well as bring more agritech results to the market. Well, first of all, I would like to point out the high profitability level for Q3 is unlikely to continue. Over the past quarter, some of our projects, such as a few agriculture-related projects, as I just mentioned in my remarks, were impacted in terms of project time line and investment pace. So the expense line items on our quarterly results were affected and on the other hand, our quarterly revenue increased as a result of increased merchant activities. In addition, we are still in the development stage and profitability is not our current priority. We will continue to step-up investments, especially to support agriculture and manufacturing industry through technology. If you have any further questions, please feel free to reach out to the IR team."
}