{
    "symbol": "PDD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-27 10:43:04",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to Pinduoduo’s First Quarter 2022 Earnings Conference Call. Pinduoduo earnings release was distributed earlier and is available on IR website at investor.pinduoduo.com, as well as through GlobeNewswire services. Before we begin, I would like to refer you to our Safe Harbor statement in the earnings press release, which applies to this call, as we will make certain forward-looking statements. Also, this call includes discussions of certain non-GAAP financial measures. Joining us today on the call are Chen Lei, our Chairman and Chief Executive Officer; Liu Jun, our VP of Finance. Jun will then take us through our financial results for the first quarter ended March 31, 2022. During the Q&A session, Lei will answer questions in Chinese and I will help translate. Our total revenue for this quarter, excluding revenue from merchandise sales, was RMB23.7 billion. Our annual active buyers reached RMB881.9 million for 12 months ending on March 31, with RMB751.3 million average quarterly MAU. Given our current scale, our user growth will inevitably slow down. A key plank of our strategy has been to develop a tech-driven agricultural infrastructure, less responsive, sustainable and likely meet a need of different stakeholders. And here, I would like to take this opportunity to express my thanks to our consumers, producers, merchants and other partners for their continued support. During the Chinese New Year period in the first quarter, we partnered with our merchants and logistics service providers to offer uninterrupted delivery services. We attracted orders from consumers who could not fulfill their needs previously due to lengthy delivery time, high cost and wastage. Their relatively short shelf life and less supply has previously confined to a local region, aided by our agricultural infrastructure, it now takes just a few hours for the fresh produce to arrive at warehouses. As work continues on agricultural infrastructure, we are also pushing ahead on the technology front. And now, I'm happy to share with you some of the tangible results for a second Smart Agriculture Competition, a lot of distance to make a growing challenge that concluded in April. Over the last six months, we work closely with China Agriculture University, Zhejiang University, the UN FAO and Wageningen University to encourage young scientists and technologies to develop practical and cost-effective Agritech solutions that farmers can use to improve their livelihood. First, they developed precision greenhouse management solution that substantially improved crop production. To conclude, we started last year to transition from a phase of hyper growth to one of the more measured development. Let me first walk you through our operating results for the first quarter ended March 31, 2022. At this current scale, it is inevitable for us to see slower use of growth. Next, I will go through our financial performance in quarter ended March 31, 2022. In terms of P&L, our total revenue in the quarter was RMB23.8 billion, up 7% from RMB22.2 billion in the same quarter of 2021. This was mainly driven by an increase in revenues from online marketing services and revenue from transaction services, offset by the decrease in revenue from 1P trials. Excluding revenue from our 1P trials, our total revenue was RMB23.7 billion in Q1 2022, up 39% from RMB17 billion in the same quarter of 2021. Revenues from online marketing services and others were RMB18.2 billion this quarter, up 29% compared with the same period of 2021. Our transaction services revenue this quarter were RMB5.6 billion, up 91% versus the same period of 2021. The increase in our transaction services revenue was due to; first, the increase in total transaction processing fee as a result of higher transaction volume; and second, more diversified services that we provide to merchants such as fulfillment services. Moving on to cost and expenses, our total cost of revenue decreased from RMB10.7 billion in Q1 2021 and to RMB7.2 billion this quarter. On a non-GAAP basis, our total operating expenses as a percentage of revenue, excluding 1P has been declined from 86% to 55% for Q1 of 2021 and 2022, respectively. Looking to specific expense items, our non-GAAP sales and marketing expenses this quarter RMB10.7 billion, down 16% versus the same quarter of 2021. As we continue to shift away from our previous forecast on sales and marketing, we remain disciplined on our sales and marketing spending this quarter. As a result on a non-GAAP basis, our sales and marketing expenses as a percentage of our revenue this quarter was 45%, compared with 57% for the same quarter in 2021. Our non-GAAP, general and administrative expenses were RMB208.8 million versus RMB160.7 million in the same quarter of 2021. Our non-GAAP research and development expenses were RMB2 billion, an increase of 30% from RMB1.7 billion in the same quarter of 2021. To better maintain evolving consumer demand and to boost our sustainable growth of our platform, we are committed to further growing our R&D capabilities and stepping up our R&D spending. Operating profit for the quarter was RMB2.2 billion on a GAAP basis, compared with operating loss of RMB4.1 billion in the same quarter of 2021. Net income attributable to ordinary shareholders was RMB2.6 billion, compared with a net loss of RMB 2.9 billion in the same quarter of 2021. Non-GAAP net income attributable to ordinary shareholders was RMB4.2 billion, compared with a net loss of RMB1.9 billion in the same quarter last year. The process gives us more confidence and resources to devote to key areas, such as R&D and agriculture initiatives. Notably, our profit this quarter narrowed significantly versus last quarter. Our net cash flow used in operating activities was RMB9.1 billion, compared with outflow of RMB3.7 billion in the same quarter of 2021, primarily due to changes in working capital as a result of seasonality offset by an increase in online marketing services revenues. As of March 31, 2022, the company had RMB95.2 billion in cash, cash equivalents and short-term investments. For today’s Q&A session, Lei and Jun will take questions from analysts on the line. Operator, we may now take questions on the line. Please ask your question. And given the outbreak of pandemic in recent months, can management share about some of the thoughts about what we are seeing in terms of the recent monthly trend. Over the past period of time, we have been going through adjustments and development strategies to focus more on technology and agriculture in order to pursue long-term high-quality growth. In addition, as we reach our current scale, investors should not expect us to continuously deliver high growth. So as the user base reaches its current scale, our focus now is on, how to serve our 880 million users and improve their trust and mind share to remain to be user-centric. So, we will continue to pay more attention to technology and Agri investment and to promote our differentiation in agriculture to help create more value for our consumers. Well, as we have been communicating, we always remain committed to investing to create long-term value. Instead, we hope investors would focus on whether what we are doing is generating value and whether it can bring about high-quality development. Well, our focus has always been to better serve our users, as just mentioned by a Lei, with this being said, take rate or monetization rate is not a metric to forecast. So, we recommend you now look at quarter-to-quarter changes and in the long run, our monetization rate depends on how much value we create. Hence, we definitely will continue to support agriculture merchants for example, offering more traffic exposure. Also, we have communicated before, we will step-up investment in agriculture for better consumer experience. Well, as the proportion of agricultural product increases, our monetization rates might be affected. Operator, we will now take questions from the next analysts in the queue. Please ask your question. But on the other hand, we do see some livestreaming e-commerce platform seems to be very aggressive in the user acquisition and expansion. And a follow-up question is about the, \"10 Billion Agriculture Initiatives\". Eddy, so for your question around competition landscape, I think the current landscape versus two, three months ago, it has not changed much. As industry infrastructure continues to develop and as our consumer needs continue to evolve, more-and-more companies will join e-commerce. We believe that in the long run the emergence of new platforms, as well as new formats will have a positive impact on consumers and on the industry itself. For us, if you look at the -- under the perspective of the recent pandemic, and if you look at areas where other peers have done well, we think that for ourselves, there is still a lot of room to further improve from our current level of service offerings. Just as I introduced, we are now stepping up investments in core technology especially in agricultural technology. We believe in the long run, these investments can create more value for consumers. So here, let me also address your second question. When we announced it, we also mentioned that we hope this initiative can facilitate the advancement of agritech, promote digital inclusion and also to make a sense of fulfillment for agri workers and agri scientists. Over the past year, our team and myself have been devoting a lot of time and efforts to diligently evaluate and study various proposals and projects in order to deport resources to where they are needed the most. In my previous remarks, I also have given you some examples of how a technology empowers agriculture, including our smart agriculture competition. In addition, we are also cooperating with top agronomic universities and research institutions to jointly work on some research projects. Admittedly, to empower agriculture through technology requires a lot of thinking, deep understanding and extra patience. So we need to compare various options side-by-side and evaluate each options carefully, and we have to leverage our past experiences in agriculture as well as our team's technical background to make the best options and choices. In this area our strategy is long-term, and our investment in agriculture are still in early stage. Please ask your question. On user, we noticed that despite a high base, AAC and MAU both see accelerating sequential growth. Despite the fast revenue growth, our control over sales and marketing have been very effective with amount continue to come down on a year-on-year basis. Last year, Pinduoduo said that we are shifting from sales and marketing to R&D focus. So let me address your question, user number. By the first quarter last year, our annual active buyers and our MAU was approximately 820 million and 720 million, respectively. And by the first quarter this year, our ASC and MAU further increased to about 880 million and 750 million. Though there might be call it fluctuations, I think, it is inevitable that our user growth would be slower, while over the course from the past few quarters, we also have shared this view with you. As for the strategic shift, we are going to basically amid the changes in infrastructure upgrade and the evolving user needs what we are doing in terms of investing in technology is to find opportunities and improve ourselves to serve our users better. And I'm glad to see that through our efforts, we have indeed created value for consumers, especially in the area of agricultural produce. And in terms of understanding user's needs, and keeping up with the changes in their behaviors and their demand, we need to do better. So, we will continue to explore the evolving needs and preferences of our users, and to continue enhance our capabilities. So if we look at the financials, it is possible that our efforts would show up and be reflected in the future financial results as well, especially around technology. And hope or what I just have just shared, I may provide you with more color and give you some insights on our user number and its growth going forward. Well as you just said, we are going through a shift with low forecast towards R&D from marketing. For example, sales and marketing expenses fell 14% year-over-year in Q1, which represents 47% of total revenue and down from 59% of Q1 last year. And at the same time, R&D expenses increased by 20% right away. Well, for every investment, we carefully evaluate the ROI and we allocate resources to generate long-term and high-quality development. And in addition, in terms of serving user needs, we're not doing well enough and there's still plenty of room for us to further improve. In fact, recent pandemic also shows certain areas for us to improve. So as we see good opportunities, we will continue our investments to create more value for our consumers. And to us, we firmly believe that R&D investment can generate high-quality development. Instead of the stable stage for financial numbers, we suggest you look at the long-term trends and the value we create from this investment. Operator, I think we still have time to take questions from the next analyst, and that will be the last one. And also, what is your outlook towards the second quarter results during current pandemic status. Well, Natalie, so let me take your question on how the pandemic has affected us and our operations. Well, I think one area that the pandemic has shown us is that, for our business, we need to build it to be more resilient, and there are certain areas that we need to further improve, especially in terms of how we can effectively meet user’s need. And under the current situation, I think our peers have shown certain aspects that we may also learn from. During the pandemic, we were also actively leveraging our differentiation to create a value for consumers and to fulfill our social responsibilities. First, in Shanghai, we launched a 48-hour supply packages for Shanghai residents through aggregating their ordering and the fulfillment staff, we strive to meet the basic needs from as many households as possible. Another important point that I want to make during this pandemic time is that, we also see many young talents writing up to challenges, and they are growing up rapidly, in the face of these real-world challenges. So based on what I just said, what I see really has given me more conviction in how our team would perform and in the young talent from our team. First, I would like to point out -- just note, our current priority and over the past few quarters, our profits will remain due to our operating leverage, especially from sales and marketing. And as mentioned last quarter, we have also controlled our spending in the face of slower growth. And under current intensified competition, we also see we still have many of our room to improve in terms of certifying users. As you may see, this quarter's profit has decreased sequentially versus last quarter. Meanwhile, the profitability over the past few quarters also gives us greater confidence to continue our long-term investments."
}