{
    "symbol": "XAIR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-28 22:29:02",
    "content": " It is important to point out that for over 22 years in the United States, the use of 20 parts per million inhaled nitric oxide in PPHN has been the standard of care for term and near-term neonates, which are defined as greater than 34 weeks gestation with hypoxic respiratory failure associated with clinical or echocardiographic evidence of pulmonary hypertension in conjunction with ventilatory support and other appropriate agents. Jeff Griebel, joined Beyond Air at the end of last year and is responsible for our clinical services team in the U.S. Jeff is a registered respiratory therapist with a distinguished record in the nitric oxide industry and is well known to key opinion leaders and customers in the U.S. Jeff has gathered a group of respiratory therapists to lead our clinical training and education program as we introduced LungFit PH to the market. As we now look at LungFit PH as the commercial product, we believe more than ever that the benefits of the LungFit PH design have the power to transform the way nitric oxide is delivered to patients in the U.S. As Steve mentioned, LungFit PH is the first and only FDA-approved system that generates nitric oxide using room air. As Steve mentioned, LungFit PH was designed by the same inventors who developed the first nitric oxide delivery system launched in the U.S. With this experience, when the LungFit PH system was designed, we recognize the importance of keeping features that are working well and are familiar to users. Once we get past Phase 1, we will then enter Phase 2, where we will expand our commercial team and target the next 25% to 50% of U.S. hospitals that use nitric oxide. General and administrative expenses for the fiscal year ended March 31, 2022, increased to $18.4 million from $10.5 million for the fiscal year ended March 31, 2021, mainly due to the structural investments required to prepare the company for a commercial launch in the U.S. Other operating expenses for the fiscal year ended March 31, 2022, were $10.5 million, entirely related to the contingent liability for the Circassia settlement from May of 2021. For the fiscal year ended March 31, 2022, the company had a net loss of $44.1 million of which $43.2 million or $1.68 per share was attributable to the shareholders of Beyond Air, Inc. compared to a net loss of $22.9 million or $1.27 a share for the fiscal year ended March 31, 2021. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question."
}