{
    "symbol": "DCBO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 11:37:20",
    "content": " We're implementing our solution, customers are not weighted down by silos, but instead can leverage for the rated ownership model where a single LMS serve as a multi-department system with multiple owners  both external and internal use cases as well as displacement and greenfield opportunities. We're also seeing new and existing enterprise customers choosing to include products like Docebo Connect, Docebo Content and Shape for the training programs right from the start, especially after having made a commitment to upgrade from their under featured legacy system. So if we see as a total addressable market in learning, North America only, US and Canada mainly has 8 billion, two-third of this is external, but the exciting data is not only that  (ph) is external, and we are very good on those use cases, but 70% is greenfield. I was speaking with the BBR team yesterday in Toronto, and they say, you know, every time a customer coming for an internal use case  them also for an external training, they are shocked because they never think that there is an external training opportunity and so for us, it is a great segue to increase the ACV during our sales pitch the ACV potential during the sales pitch. We use that terminology internally to refer to the ability of an organization to effectively consolidate multiple needs, whether it's various internal use cases such as onboarding enablement, professional education, compliance to name a few or external use cases, customer add, the partner add and others to name a few into an all in one solution. But that gives you a flavor of that we continue to see strength on the expansion side of the business as well as what is important to note and one of the data point I gave in addition this quarter was that, 80% of our customers use us for multiple use cases with 61% of that customer using us for external and hybrid use case. When you heard Alessio talk about the fundamental growth drivers being LC see and they are intact, where we see the external use case being twice the size of the internal use case, I think it's fair to assume that Docebo will remain at rule of 40 business with growth being the bigger contributor and the focus from our perspective with us driving some incremental leverage, operating leverage and profitability into the Rule of 40. Complex business required scalabilities and multi-use cases, you know that we started stressing the market with the -- with the concept of fulgurated learning, that means one technology that over multiple use cases and that from the internal uses then point to the admin is perceive as is old technology because it's so tied to give use case that the admin as perceive Docebo as its own technology  another peer in another department is using the same technology with a different solution or use case. On the upsell front, you're correct that new products and new modules are a big driver of it, it's not the only one, because we monitor and manage adoption of our software and we like the report that many of our upsells that actually uses plan increases, which is a testament to the fact that our customers not only buy a software they use it, they adopt it, they exceed their user plan and to come back in for more usage."
}