{
    "symbol": "LNTH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 11:07:18",
    "content": " I'm pleased to announce that PYLARIFY, the U.S. market leader in PSMA-targeted PET imaging, generated net sales of $143.8 million and was used in over 30,000 patient scans during the quarter. And I think I would add, as I've mentioned in the past, where we have certainly added customers from an imaging center perspective, going from 300 roughly at the end of last year to 900 at the end of the second quarter, and they were now a 1,000. And with our third quarter results and what we've seen them, the annualized market for PSMA PET imaging in the U.S. is already now over $700 million just 1 quarter later. Paul was just completing his comments talking about the growth in the future for PYLARIFY will also come from activating more patient pools as we engage with those physicians who are generating demand for -- currently for imaging done with conventional approaches, which will -- we believe will translate over to PSMA PET-based imaging. And I make an analogy here to what we've seen happen with PSMA-based PET imaging with the availability of PYLARIFY per se the 2 academic products and then -- and closely after PYLARIFY, we've seen -- I think it's fair to say, a wholesale switch from what is used as standard of care imaging for prostate cancer. And so I think our numbers are -- you could say we continue to be slightly conservative because we are not -- we're still not fully aware of how large the intent is with the medical community to embrace PYLARIFY across the entire disease spectrum of prostate cancer, and that continues to be an opportunity for us that -- we work on from a demand generation perspective within our labeled indication, but we also note what the medical community is choosing to do with these products. So from the perspective of -- are we going -- as we think about how models that we see from a street perspective look, we're comfortable that we're going to be able to continue to grow this business, do so profitably and see our free cash flows, as you saw what we did here in the third quarter with a record free cash flow number of nearly $90 million, that -- those kinds of numbers are going to continue to grow, and we're going to be able to really kind of strengthen the position of this company as we think into the near-term planning horizon that we're discussing. However, if we look at the 2 major markets we're in now, as we've repeatedly kind of tried to offer here, we see significant continued growth in the PSMA imaging market, not only for the demand of generating that we've already generated for patients for initial staging and for recurrence, but also because of the continued -- what will be the continued entrance of therapeutic agents into that market."
}