{
    "symbol": "LNTH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 14:41:04",
    "content": " PYLARIFY generated net sales of $527.4 million for the full year 2022 with fourth quarter revenues of $160.6 million, up nearly 12% sequentially from the third quarter. While much of our effort since launch has focused on demand satisfaction including activating our PMF network and ensuring 90% of covered lives have access to PYLARIFY, we focused our promotional efforts in the second half of 2022 on driving brand awareness of PSMA PET with PYLARIFY to the 5,000 healthcare professionals that clinically manage the vast majority of prostate cancer patients. TechneLite net revenue was $24.7 million, up 12.2% from the prior year quarter due to approximately $5.5 million in opportunistic sales stemming from competitive supply chain challenges. During 2022, total opportunistic sales contributed approximately $10.7 million of TechneLite's full year $88.9 million performance, which was down 2.7% from the prior year. Radiopharmaceutical oncology contributed $161 million of sales in the quarter, up 352.8% from the prior year attributable to the continued sequential and year-over-year growth of PYLARIFY sales of $160.6 million in the quarter as noted by Paul earlier. The resulting reported net income for the fourth quarter was a loss of $119.2 million and a profit of $96.6 million on an adjusted basis, an increase of 460.4% over the prior year period. GAAP fully diluted earnings per share for the fourth quarter was a loss of $1.74 and a profit of $1.37 on an adjusted basis, an increase from the prior year of 450.8%. What we had highlighted last year in May at the Investor Day was an incremental approximately, you're correct, 100,000 scans, $400 million to $500 million potential, but that was for both the addition of intermediate favorable in the initial education as well as the potential advancement into pre-chemo setting, in other words first and second line for patient selection for the prostate cancer community. But I think what you're hearing us explain is that, there continues to be additional potential in this market not only from new indications, which would be awarded to therapeutic candidate, but also from physician adoption of using PYLARIFY â\u0080\u0093 PSMA PET with PYLARIFY either in different areas across what's already within our indications or using it more frequently. We conducted a thorough third-party market research to assess how physicians across urologists, oncologists, radiation oncologists are assessing the market, how they're using PSMA PET imaging specifically PYLARIFY, and there's certainly a range out there depending on how many scans and how this is going to be used whether a course of therapeutic treatment for Radioligand therapy as you mentioned could be four courses or six courses. And so, as we've mentioned, since really the middle of last year, where we were adding a new account, we expect the majority of our growth to come from being able to raise awareness on who the right patient keynote types are to receive PYLARIFY imaging, to refer those to the right imaging centers and then for PYLARIFY to continue to be the PSMA PET imaging agent of choice. In the second half of the year in the middle -- really in the second half of 2022, we shifted our focus from a promotional perspective classic sales and marketing to referring physicians to the 5,000-plus physicians that make up the majority of management of prostate cancer patient to ensure they understand the benefits of PSMA PET with PYLARIFY."
}