{
    "symbol": "VRA",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-09 12:38:04",
    "content": " On a two-year comparison, Pura Vida’s revenues grew over 40% versus the first quarter of fiscal 2020, and Vera Bradley comp sales were flat with fiscal 2020 first quarter results. We have seen our core customers age in terms of kind of the fastest growing group, the one we’re targeting is really in that 25 to 35 year range, which is a significant change from the past, and I think it really underscores between all the collaborations, the sustainability, the new approach to marketing, the focus on social media advertising, influencers, all of that has made us more relevant with that millennial group. One, the data analytics and the targeted marketing, customer journey reactivation, really owning our customer data particularly at the Vera Bradley brand, having first party data I think becomes super critical not only today but as we’re moving through the iOS updates, the pending Google updates, and we think that will be really critical to continuing to grow our direct own digital. Obviously those collections are limited, but we’re learning a lot about the customer, what she’s responding to, sizing, and we definitely think that really building up Pura Vida from a lifestyle brand over multi years just provides some real significant opportunity, because I think that Pura Vida can become much more balanced instead of just so heavy on the jewelry category. We started down the environmental path really by focusing on what we felt would have the biggest impact, which was fabrications, and we felt, one, that that could have the biggest impact short term on the environment, being a good corporate citizen, but second of all, it was a way to really position Vera Bradley more in the forefront of what’s going on out there addressing the environmental needs, and we’re seeing a younger customer respond to that, so I would encourage everybody to kind of watch as we continue to move more fabrications to the sustainable platform becomes really important. As we’re looking how important the charity bracelet program is to Pura Vida, the impact of the charity on the apparel business at Pura Vida, everything that Vera Bradley has done over the years from the foundation to Blessings in a Backpack, we really think that this younger customer really expects brands that they want to be part of, and brands part of the community to have a very strong social as well as environmental positioning, so that’s how we’re looking at this. Yes, I would only add that I think versus two years ago, when we were looking for our first acquisition, I think there’s more activity or more inbound activity with us now that we’ve completed our first acquisition, so I think if you’re just looking apples-to-apples for Vera Bradley, there’s probably a little bit more activity--\n Or deal flow, yes."
}