{
    "symbol": "VRA",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-09 11:05:27",
    "content": " At the beginning of the year, we set out to further enhance our two strong brand franchises, Vera Bradley and Pura Vida, and drive revenue and earnings growth through four-key strategies: executing our digital-first strategy, enhancing our product innovation pipeline, further engaging our communities through marketing, and continuing to evolve our distribution channels. Our Vera Bradley brand had a solid year of revenue growth, with year-over-year total sales increasing over 18%, as customers responded to our product innovation and collaborations supported by data driven and targeted marketing. At Vera Bradley, we continued another year of high-profile product collaborations with several iconic brands, including Disney, Harry Potter and Peanuts, accelerated our robust fabric innovation process and launched our cotton reimagined collection, expanded our apparel collection, continued to strengthen and rationalize our store base, continued to expand options for customers to shop, including launching our Canadian website and added distribution on chewy.com. Vera Bradley Direct segment revenues for the current fiscal year totaled $354.9 million, a 22.7% increase over $289.3 million in the prior year. Net capital spending of approximately $10 million to $12 million compared to $5.5 million in the prior year, reflecting investments associated with new Vera Bradley factory stores, new Pura Vida stores and technology and logistics enhancements. And now we're really working on bringing in talent, bringing in analytics like we did at Vera Bradley a couple of years ago to really balance out that marketing platform, to make sure that we're leveraging out influencers, more traditional avenues like looking at and evaluating direct mail campaigns and other ways to be more focused on first-party marketing as opposed to being so reliant upon third-party marketing. And if we see that continue as we open up three more stores this year, we think that we have the ability to ramp up that growth and store growth for Pura Vida, which could become a very important part of not only the growth story, but also the marketing customer acquisition story as we move forward."
}