{
    "symbol": "VRA",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-01 14:39:10",
    "content": " Second quarter Vera Bradley brand revenues continued to improve as customers responded to product innovation, stores were fully operational and sales of travel related products rebounded despite anniversarying exceptionally strong mass sales from the prior year. Consolidated net revenues totaled $147 million for the current year second quarter, an increase of 11.6% over $131.8 million in the prior year second quarter. For the current year second quarter, Vera Bradley Incorporated consolidated net income totaled $9.5 million or $0.28 per diluted share compared to net income in the prior year of $10.9 million or $0.32 per diluted share. Vera Bradley in indirect segment revenues totaled $16.8 million, a 5.1% decrease from $17.7 million in the prior year’s second quarter, reflecting reduction in orders primarily related to mass sales, partially offset by a rebound in specially in key account orders and other product categories that were negatively impacted by COVID-19 in the prior year. Consolidated SG&A expense totaled $68 million or 46.2% of net revenues for the current year second quarter, compared to $58.6 million or 44.5% of net revenues in the prior year. We are updating our estimates for fiscal 2022 based on our second quarter performance, current business trends and consideration of certain macro industry and economic conditions that could impact a company's sales and gross margin performance for the balance of the year. We expect year-over-year revenues to increase by high single digits for the Vera Bradley brand, and by over 20% for Pura Vida. The expected SG&A increase is primarily related to Vera Bradley stores being opened for the full year, non-comparable compensation and Cares Act savings in fiscal 2021, and general variable increases associated with higher sales expectations. Cash, cash equivalents and investments at quarter end totaled $76.5 million compared to $77.1 million at the end of last year’s second quarter, and $65.5 million at last fiscal year end. Even though Pura Vida’s business temporarily slowed in the second quarter due to the iOS update, we believe we are positioned to generate a 15% to 20% revenue growth for the second half of the year, driven by our new product launches wholesale growth, the marketing initiatives and adjustments we have put into place and our new store opening. We are continuing to enhance our product innovation pipeline collaborations and category extensions as evidenced at Vera Bradley by the launch of our Cotton Reimagined collection, the introduction of other alternate alternative fabrics, our commitment to sustainability, and countless product collaborations and the continual newness and excitement in Pura Vida’s jewelry collections as well as expanding into the new Pura Vida lifestyle categories such as apparel, backpacks and accessories. In evolving our distribution channels, we are continually looking for new ways to reach our customers and to reinvent the shopping experience from our verabradley.com website redesign to partnering with thredUP to the opening of our first ever Pura Vida store."
}