{
    "symbol": "TLS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 14:45:26",
    "content": " Mark will discuss our financial performance later in this call, but at a high level, we delivered $55.8 million of revenue in the second quarter, above our guidance range of $50 million to $54 million, up 4% year-over-year and 11%, sequentially. Before I turn the year-over-year comparison, I just wanted to remind everyone again, as I did in our last earnings call, that we had a large delivery on a lower margin program in our Secure Networks business last year thatâ\u0080\u0099s pulled forward from the second quarter of 2021 to the first quarter of 2021 per the request of our customer. The accelerated delivery caused with Secure Networks contribution to total revenue to shift from 60% in the first quarter of 2021 to 40% in the second quarter of 2021 and gross margin to shift from 25.9% in the first quarter of 2021 to 42% in the second quarter of 2021, thereby skewing some of the second quarter year-over-year comparisons this year. For the second quarter, total sales were $55.8 million, up 11% sequentially and up 4% year-over-year. Security Solutions sales were $30.8 million, up 15% sequentially and down 4% year-over-year, due to lower revenues on a classified program and the completion of the U.S. Census program, partially offset by growth in other pre-existing programs. Secure Network sales were $25 million, up 7% sequentially and up 17% year-over-year, due to continued strong supply chain management, higher revenues on major programs and favorable year-over-year comparison due to the previously mentioned large delivery that pulled forward from the second quarter of 2021 to the first quarter of 2021. Turning to profitability and cash flow, second quarter gross margin was 37.5%, above our guidance range of 33% to 35%, primarily due to the margin outperformance in Security Solutions. Security Solutions revenues as a percentage of total company revenues declined from 60% in 2021 to 55% in 2022, as Secure Networks gross margin contracted nearly 700 basis points to 18%. Security Solutions revenues as a percentage of total company revenues increased from 50% in 2021 to 54% in 2022 and Security Solutions, gross margin expanded 638 basis points to 54.5% due to the ramp of high margin progress. Lastly, free cash flow was $10.3 million higher due to favorable working capital dynamics, driving significantly better cash flow from operations in the first and second quarters. For the third quarter, we forecast sales in a range of $58 million to $62 million, up 4% to 11% sequentially and down 10% to 15% year-over-year. We forecast Security Solutions revenues to be down mid- to high-teens year-over-year, primarily due to the completion of the 2020 Census Program in 2021, lower orders expected on a single pre-existing program and lumpiness of perpetual licensing. We expect gross margins to be down approximately 350 basis points to 500 basis points year-over-year, primarily due to a slightly lower weighting of revenues to our high margin Security Solutions segment and revenue within both Security Solutions and Secure Networks mixing lower in the quarter. Reduction at the high end of the range reflects lower assumption on TSA PreCheck revenues and new business in the second half, partially offset by higher revenues on pre-existing programs within Security Solutions. The reduction at the low end of the range primarily reflects the impact of lower than previously forecasted gross margins on Secure Networks in the second half, including on new business. Overall, we have performed ahead of forecast in the first half, our core business is performing well and we expect that to continue, pre-existing programs are performing well, sequential sales growth is expected to continue into the third and fourth quarters as originally planned, and we are taking a slightly more cautious approach to new business in the second half in part as a result of the more complex macro environment, which could create some headwinds for our new business growth initiatives in the short-term. Your line is open. And then at the low end, no change to sales, but what you are seeing in the $3 million of lower adjusted EBITDA is lower gross margin on Secure Networks, primarily in new business in the second half. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}