{
    "symbol": "TLS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 15:16:02",
    "content": " Mark will discuss our financial performance later on this call but at a high level, we delivered $63.6 million of revenue in the third quarter, above our guidance range of $58 million to $62 million, up 14% sequentially and down 8% year-over-year. We delivered $8.6 million of adjusted EBITDA, above the high end of our guidance range of $3.5 million to $5 million and a 13.5% adjusted EBITDA margin. Security Solutions sales were $32.4 million, up 5% sequentially and down 6% year-over-year due to the completion of the U.S. census program in 2021 and quarterly variability of perpetual license sales. Secure Networks sales were $31.2 million, up 25% sequentially and down 10% year-over-year due to the ongoing wind down of large programs coming to a successful completion as expected. Security Solutions gross margin contracted approximately 850 basis points to 48%, primarily due to higher investment in a single large program as well as the previously mentioned variability of perpetual license sales. The midpoint of the fourth quarter revenue guide implies approximately a $19 million sequential decline, including approximately $4 million from Security Solutions and $15 million from Secure Networks. Lastly, as John described earlier, Secure Networks has not won sufficient new business so far in the second half of 2022 to backfill declining revenues on pre-existing programs in the fourth quarter. To be clear, Secure Networks has won approximately $37 million of new business so far in the second half of 2022. We expect gross margin to be down approximately 300 to 450 basis points year-over-year primarily due to Security Solutions mixing lower, partially offset by higher margin Security Solutions contributing a greater proportion of total company revenues. The other $5 million is in Security Solutions and is spread across software sales, a step down in large programs and TSA PreCheck. But I guess -- as a follow-up to that, if I could, I mean on Secured Networks, I mean, you're basically saying you're missing your mark in Q4 by $15 million to $20 million on Secured Networks due to not hitting your new business targets."
}