{
    "symbol": "FUL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-22 15:37:04",
    "content": " Our strategic mix shift to a more highly specified product portfolio through innovation, market share gains and customer collaboration, together with our responsible pricing actions, are delivering impressive results this year and position us very well for margin expansion in the year ahead and continued long-term profitable growth. In the third quarter, organic revenues increased 18% year-on-year, with all three of our global business units generating exceptional growth. In Hygiene, Health and Consumable Adhesives, organic revenue was up 23%, with strong organic growth across all end markets and particular strength in the packaging, hygiene, tissue and towel and health and beauty markets. Adjusted EBITDA for Hygiene, Health and Consumable Adhesives increased $17.3 million or 39% year-on-year. In Engineering Adhesives, the strong organic growth trend continued with organic revenue growth of 17.5% and nearly every end market contributing to the impressive results. Despite this, organic revenue grew 7% year-on-year on strong pricing actions and strength in the utilities and infrastructure market. With that said, organic revenue still grew double digit, up 16% versus the third quarter of last year. On a consolidated basis, adjusted EBITDA increased 24.4% year-on-year to $137.7 million. All 3 GBUs had strong organic growth versus 2021, with HHC, up 23%; Engineering Adhesives, up 17.5%; and Construction Adhesives, up 7% year-on-year. Adjusted gross profit was up 27.3% year-on-year, reflecting strong pricing actions and operational efficiencies and adjusted gross profit margin of 26.5% was up 280 basis points compared to the third quarter of last year. Adjusted earnings per share of $1.06 increased 34%, driven by pricing gains and operational efficiencies which more than offset raw material cost increases, unfavorable currency and higher interest rates. Cash flow from operations was $58 million, up $49 million sequentially versus the second quarter, reflecting strong revenue growth and improving margins but down versus last year due to temporarily higher year-on-year working capital requirements. Based on the normal seasonality of our business, we are planning for working capital to return to more normal levels by the end of the year and to be in the range of 16% to 17% of annualized net revenue, resulting in full year cash flow from operations similar to last year. Regarding our outlook for the rest of this year, we continue to remain on track to deliver results in line with or at the upper end of the full year guidance ranges we provided in the first quarter of the year with respect to organic revenue growth, adjusted EBITDA and adjusted EPS. Lastly, we expect fourth quarter adjusted EPS in the range of $1.15 to $1.30, resulting in a full year increase in adjusted EPS of between 19% and 23% versus fiscal 2021, reflecting strong underlying operating profit growth, offset by unfavorable currency and significantly higher interest rates. Raw materials have gone up significantly and there's -- just based on your comments, it seems like we're sort of hitting that plateauing point and perhaps even some deceleration going into next year, just given the macro backdrop."
}