{
    "symbol": "FUL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-19 11:45:26",
    "content": " On a year-over-year basis, adjusted EBITDA was up 5% in the fourth quarter to $141 million and adjusted EBITDA margin remained stable year-on-year at 14.7% despite significantly higher raw material costs. Adjusting for those items, organic revenue was up 6.4% with pricing having a favorable impact of 11.4% year-on-year in the quarter and volume down 5%, reflecting a slowdown in end market demand, particularly in Construction Adhesives and softness in China due to COVID-related lockdowns. Adjusted gross profit margin was 26.2%, down 90 basis points versus last year, as raw material inflation and lower volumes more than offset significantly higher pricing. Adjusted EBITDA for the quarter of $141 million was up 5% versus last year, reflecting strong pricing actions, lower SG&A and the impact of the extra week, which more than offset significantly higher raw material costs and unfavorable foreign currency translation. We expect adjusted EBITDA to be between $580 million and $610 million, representing a 9% to 15% year-on-year increase, up 11% to 17%, adjusting for the extra week in 2022 as the benefits from net changes in prices and raw material costs and strong expense management more than offset unfavorable foreign exchange. We estimate that extra week will have an unfavorable impact on full year revenues of approximately 2% compared with full year 2022 and an unfavorable impact on full year EBITDA of approximately $10 million versus 2022, all occurring in the fourth quarter. Taking into consideration low construction demand in the first half of the year and continued disruptions in China as well as the typical seasonality of the business, we expect first quarter revenue to be down low to mid-single digits and to realize approximately 17% to 18% of full year EBITDA in the first quarter. Fuller has stepped up to those challenges and delivered for our customers, our employees and our shareholders, while consistently outperforming the competition.\\ We expect 2023 to be no less challenging, but we are confident in our team's abilities and resolve â\u0080\u0093 and we believe, based on the improvements that we've made in our business over the last several years and our ability to bring innovation to the diverse set of end markets we serve, that we are well positioned to continue to drive growth and expand margins, while delivering outstanding cash flow. Your line is open. Your line is open. And I think as we move forward, I think it's important for 2023, especially early in the year like this, that we really start talking about price and raw materials as one big bucket, as John described, where we are -- we believe there's $130 million to $160 million of value in that bucket. Your line is open. Your line is open. Your line is open. Your line is open."
}