{
    "symbol": "GNRC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 15:25:02",
    "content": " Residential product sales declined at a double digit rate as compared to the prior year, primarily driven by lower home standby shipments in the quarter resulting from higher field inventory levels. Consistent with the comments provided in our third quarter earnings call in early November, we expect home standby sales to decline for the full year 2023 due to significant weakness in first half shipments, resulting from elevated levels of field inventory with the first quarter expected to mark the trough for shipments during the current channel destocking process. Additionally, we are making good progress towards our next generation energy storage system and we will begin alpha testing of these products in the second quarter of this year with an anticipated launch to the market in 2024. ecobee sales continued to grow at a strong rate in the fourth quarter, despite aggressive promotional activity from competitors, which underscores the strong competitive positioning of ecobee's feature-rich solutions. Switching gears, now I want to provide some commentary on a part of the business that has continued to outperform our expectations, as our C&I products experienced and outstanding quarter globally as sales grew by 27% as compared to the prior year, benefiting from very strong demand and higher production levels resulting from capacity expansion initiatives. Adjusted EBITDA before deducting for noncontrolling interest, as defined in our earnings release, was $174 million or 16.6% of net sales in the fourth quarter as compared to $220 million or 20.7% of net sales in the prior year. Domestic segment total sales, including intersegment sales, decreased 3% to $881 million in the quarter as compared to $909 million in the prior year, with the impact of acquisitions contributing approximately 7% revenue growth for the quarter. As Aaron previously discussed, shipments of residential products are expected to face significant headwinds in the first half of the year due to elevated field inventory levels for home standby generators and the continued build out of our clean energy product and distribution capabilities. We anticipate continued growth for C&I product sales across several channels domestically and internationally, resulting in expected C&I net sales growth in the mid to high single digit range for the full year with higher growth rates anticipated in the first half of the year. Specifically, with the return to normal seasonality and the destocking of home standby field inventory, we expect first quarter total sales to decline by approximately minus 25% to minus 26% from the prior year with growth in C&I product sales more than offset by residential product headwinds. Looking at our gross margin expectations for the full year 2023 compared to 2022, we expect favorable price cost impacts driven by previously implemented pricing actions that have not yet fully annualized, certain cost reduction initiatives and lower input costs to more than offset the negative impact of unfavorable sales mix resulting from lower home standby generator shipments. Sequential quarterly improvements in gross margins are expected as the year progresses due to improved sales mix from higher shipments of home standby generators, along with lower input costs, improved overhead absorption and realization of cost reduction initiatives as we move throughout the year. From a seasonality perspective, we expect adjusted EBITDA margins to improve significantly as we move throughout the year, primarily driven by the sequentially improving gross margins as previously discussed in detail and to a lesser extent, improved leverage of operating expenses on the expected higher sales volumes in the second half of 2023."
}