{
    "symbol": "GNRC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 16:37:08",
    "content": " Home consultations or sales leads continue to point to strong underlying demand for home standby generators, growing at a mid-teens rate despite a prior -- a strong prior year comparable period driven by the Texas winter storm event in February of 2021. For the full year 2022, we expect net sales of these clean energy products and solutions to approximately double from the prior year to more than $500 million in sales, with strong core and inorganic growth contributions and an even larger opportunity in the years ahead. Strong momentum also continued in our international segment, with total sales increasing 43% year-over-year during the second quarter, with 34% core sales growth when excluding the benefit of the Deep Sea and Off Grid Energy acquisitions and the unfavorable impact of foreign currency. Looking at second quarter 2022 results in more detail, net sales increased 40% to $1.29 billion during the second quarter of 2022, another all-time record, as compared to $920 million in the prior year's second quarter. Briefly looking at consolidated net sales for the second quarter by product class, residential product sales grew to $896 million as compared to $600 million in the prior year, representing a 49% increase despite a strong prior year comparable. Domestic segment total sales, including intersegment sales, increased 42% to $1.13 billion in the quarter as compared to $793 million in the prior year, with the impact of acquisitions contributing approximately 6% of the revenue growth for the quarter. But there's so much deferred -- if you just -- if you didn't have the Electrify Everything trend, if you just took that away for a second, and you dealt with the more severe climate experiences that we're having and just the decarbonization of the grid in general and that kind of generating fleet, those sources being -- they're moving to a more intermittent nature, and because the technologies have not kept up, like battery technology is just not there yet commercially to be a viable storage technique. And we want to get that down because that's how -- we think that serving the market with shorter back -- with shorter lead times is really important to winning in the market, in particular, on those sales leads that we've talked about."
}