{
    "symbol": "GNRC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 15:50:34",
    "content": " Year-over-year, overall net sales increased 41% to $1.14 billion and also grew sequentially from the fourth quarter of 2021, which was the previous all-time record. Strong momentum in core sales, which excludes the impact of acquisitions and foreign currency, continued in the quarter with 33% growth over the prior year, led by our residential product category. Importantly, we expect growing realization of the previously announced price increases as 2022 progresses as well as incremental favorable margin impacts from additional pricing actions, which were enacted during the second quarter, further execution on cost reduction projects and easing input cost headwinds, resulting in sequentially improving margins throughout the year. Strong momentum also continued in our International segment as well with shipments increasing 49% year-over-year on an as-reported basis during the first quarter, with 27% core net sales growth when excluding the benefit of the Deep Sea and Off Grid Energy acquisitions and the unfavorable impact of foreign currency. First quarter adjusted EBITDA margins expanded to 15.2% from 6.2% in the prior year period due to the accretive margin profiles of the Deep Sea and Off Grid acquisitions, improved overhead absorption and better operating leverage on significantly higher volumes. Net sales increased 41% to $1.14 billion during the first quarter of 2022, another all-time record as compared to $807 million in the prior year first quarter. Strength in aftermarket service parts continues to be a key driver of the core sales growth in this category due to the heightened power outage activity in recent years and a larger and growing install base of our products in the field, which is also leading to higher levels of extended warranty revenue. Adjusted EBITDA, before deducting for noncontrolling interest as defined in our earnings release was $196 million or 17.3% of net sales in the first quarter as compared to $214 million or 26.5% of net sales in the prior year. Domestic segment sales increased 39% to $965 million in the quarter as compared to $693 million in the prior year, with the impact of acquisitions contributing approximately 5% of the revenue growth for the quarter. As a result of these factors, we are raising our top line guidance for full-year 2022 as net sales are now expected to increase between 36% to 40% as compared to the prior year on an as-reported basis, which includes an approximate 5% to 7% net impact from acquisitions and foreign currency. As we ramp capacity and our supply chain for home standby and clean energy products and as incremental price realization kicks in over the remainder of the year, we're expecting quarterly revenue to increase sequentially over the next couple of quarters, with net sales in the first half approaching 47% weighted as a percent of full-year sales. We expect that the first quarter marked the low point for adjusted EBITDA margins for the year with the progression of sequential improvement approximately level loaded by a quarter, resulting in fourth quarter 2022 adjusted EBITDA margins returning to the 26% range, similar to Q1 2021 levels. For full-year 2022, we now expect interest expense to be approximately $42 million to $44 million, an increase from the previous guidance of $41 million to $43 million, reflecting higher than previously expected levels of LIBOR rates throughout 2022, while still assuming no additional term loan principal payments during the year. In terms of where we'll go with pricing, Q3, Q4, I mean, I would tell you right now the guidance contemplates that additional pricing because we're taking the somewhat extraordinary step of repricing the backlog as of June 1, that's going to read through a lot quicker than previous price increases. And a lot of that, because of that 5% to 6% kind of reading through the back -- through the balance of the year here, alongside some additional cost reductions, plus previous pricing actions that we've done also reading through to get the full impact of all the pricing."
}