{
    "symbol": "GNRC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 16:14:06",
    "content": " The residential product sales while still growing compared with the prior year were weaker than expected in the quarter driven by lower shipments of home standby generators, and clean energy products relative to our prior expectations. Even when assuming no major outage events, in the second half of 2023, we expect significant sequential sales growth from the first half of the year and only a modest decline in sales on a year-over-year basis as we maintain a new and higher baseline level of demand. Our C&I products continue to perform exceptionally well in the quarter, as global C&I net sales increased 20% on an as-reported basis and 23% on a core sales basis, which excludes the impact from acquisitions and foreign currency as compared to the prior year. Our International segment continued to experience very strong momentum, as total sales increased 14% year-over-year during the third quarter with 22% core total sales growth when excluding the benefit of acquisitions and the unfavorable impact of foreign currency. Looking at third quarter 2022 results in more detail, net sales increased 15% and to $1.09 billion during the third quarter of 2022, as compared to $943 million in the prior year third quarter. Domestic segment total sales, including intersegment sales, increased 18% to $947 million in the quarter, as compared to $802 million in the prior year with the impact of acquisitions contributing approximately 8% of the revenue growth for the quarter. Your line is now open. Hey, good morning, guys. Your line is now open. Hey, good morning, guys. Yeah, I mean, again, that's a big part of the headwind for the first half of next year is the comp, because we're â\u0080\u0093 obviously, we were bringing that backlog down heavily in the first two quarters of this year and so we'll be comping against that without having the benefit of that backlog kind of as we get into next year. Your line is now open. And then, for my second question, can you just clarify exactly what you're saying about 2023 one more time in terms of â\u0080\u0093 I think that you said total company in the prepared remarks, it's all about total company and that you'd be down modestly for the full year, up sequentially first half to second half. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}