{
    "symbol": "DTC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 12:55:06",
    "content": " During the quarter, we continued to invest in our long-term strategic initiatives in data, product innovation and international and delivered adjusted EBITDA of $11.2 million and adjusted EBITDA margin of 11%. Just kind of trying to get a feel for maybe where you think long-term margins may sit versus the last couple years and so on and so forth, because again, I think what the market is trying to understand is where the profit margins kind of adjust to longer term after we get through the fourth quarter and especially considering that the consumer feels choppy, but your business feels okay right now against the more conservative sales backdrop of guidance for the fourth quarter, which probably feels kind of conservative, which is great. Whenever we can leverage our customer list with new innovation to drive purchases itâ\u0080\u0099s going to lower our customer acquisition costs, and ultimately, not only drive customer acquisition cost down, but what we saw with Mesa early signs is that the LTV-to-CAC ratio goes up as we are able to pull those customers, those new customers and convert them not only to Mesa, but then upgrade them to a larger firepit down the line. We are really pleased with the launch of Pi this year and what itâ\u0080\u0099s done for us in terms of bringing, again, new enthusiasts gets us a little bit more into the kind of the food space -- the backyard food space, which we like, at least as it pertains to some of these more gathering, good moment, lasting memory type products that Pi obviously creates and allowing families and friends to gather and make pizzas. I mean, with so much innovation, we are finding that thereâ\u0080\u0099s so many ways for us to drive retention in the business in addition to driving new acquisition, which we all have been saying for the last year that we are very early and thereâ\u0080\u0099s a huge addressable market that we havenâ\u0080\u0099t tapped into on just our core products, particularly the firepit business."
}