{
    "symbol": "BEKE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 15:51:13",
    "content": " In 2022, the national existing home market GTV fell by 31% year-over-year, and sales of the top 100 new home developers fell by 42% year-over-year. In 2022, the first year for us to advance our â\u0080\u009cone body, two wingsâ\u0080\u009d strategy, our home renovation and furnishingâ\u0080\u0099s contracted sales reached RMB6.9 billion, increasing 31% year-over-year on a pro forma basis, also bucking the market trend. According to data from the Beike Research Institute, full-year GTV of existing home sales in China were RMB4.83 trillion in 2022, dropping by about 31% year-over-year and declining by about 3% year-over-year in the fourth quarter; whereas existing home transactions GTV on Beikeâ\u0080\u0099s platform fell by only 23% year-over-year in 2022 and rose by 1.5% year-over-year in the fourth quarter. On the market front, according to data from the National Bureau of Statistics, GTV of new residential home sales in China amounted to RMB11.7 trillion in 2022, down 28% and 27% year-over-year for the full year and the fourth quarter, respectively. In comparison, GTV of new home sales on our platform declined by 42% year-over-year in 2022 and by 26% in the fourth quarter. Our home renovation and furnishing business generated contracted sales of RMB6.9 billion in 2022, rising by 31% year-over-year on a pro forma basis. New retail home furnishingâ\u0080\u0099s contribution to our total contracted sales grew from 12% in the first quarter to 26% in the fourth quarter of 2022, further extending the platformâ\u0080\u0099s business beyond low-frequency transactions. In particular, our net revenues from existing home transaction services decreased by 11.8% year-over-year to RMB5.3 billion in Q4. Our GTV of existing home transactions actually increased by 1.5% year-over-year in Q4, with GTV by connected agents increased by 24.3% year-over-year in Q4, however, they were recorded on a net basis in revenues. Our net revenues from new home transaction services decreased by 26.8% year-over-year to RMB8.3 billion in Q4, primarily due to the decrease of new home GTV of 26.1% to RMB263.5 billion in the period. The increase was primarily due to: A, a shift of revenue mix towards the existing home transaction services and home renovation and furnishing, with relatively higher contribution margins than new home transaction services; B, a higher contribution margin for both existing and new home transaction services, as a result of effective cost control, and C, a relatively lower percentage of costs related to stores and other costs of net revenues in Q4. Thanks to the stronger monetization ability of our new home and existing home businesses, as well as the increase in the proportion of home renovation and furnishing services with a high monetization rate, our revenues declined by only 25% year-on-year, a much smaller contraction compared with the market adjustment. Although the profitability of our existing home transaction services fluctuated quarter-over-quarter due to the pandemic impacts, on a full-year basis, the contribution margin of existing home business reached 39.8%, up 2.8 percentage points from 2021, driven by stronger operating leverage due to fixed cost optimizations and higher revenue contribution from platform services. In the full year of 2022, contribution margin of new home transaction services reached 23.6%, up 4.4 percentage points from 2021, mainly driven by increased percentage of high-profitability projects and significant fixed-cost reductions, validating our strategy of strictly balancing risks and profits in a high volatile market. With the increases in existing home and new home contribution margin, our gross margin for the full year of 2022 expanded notably to 22.7%, up 3.1 percentage points year-over-year. Thirdly, in terms of operating expenses, while maintaining our investments in new businesses including home renovation and furnishing, our total non-GAAP expenses in 2022 declined by 20% year-over-year to RMB11.8 billion. In February, our new home subscriptions increased by 148% year-over-year from their low base in 2022, reaching the level of June 2021, driving year-over-year new home sales growth since February of this year. We believe that there is plenty of upside for the market given that transaction units of existing and new homes in China accounted for only 3.5% of total number of existing homes in 2022, and that the turnover rate for existing homes was only 0.7%, versus the normal rate of at least 1% historically."
}