{
    "symbol": "SQ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 20:56:09",
    "content": " Given we're integrating Afterpay into both our Square and Cash App ecosystems and expect it to benefit the growth of each, we've decided to allocate 50% of Afterpay revenue and gross profit to each of Square and Cash App. Cash App generated $624 million of gross profit in the first quarter, an increase of 26% year-over-year and 94% on a three-year CAGR basis. Cash App Card was one of our fastest-growing monetization streams, with gross profit growth in the first quarter of more than 50% year-over-year despite strong growth in the prior year period and more than 170% growth on a three-year CAGR basis. For Cash App, in April, we expect gross profit excluding Afterpay to grow by more than 15% year-over-year or around 85% on a three-year CAGR basis. As we shared on our last earnings call we continue to believe Cash App's year-over-year gross profit growth rate excluding Afterpay will improve in the second half of the year compared to the first half, as comparisons become more favorable as we introduce new product innovations across our commerce and financial services priorities and with the benefit from pricing adjustments in certain areas. Also, consistent with what we mentioned last quarter for the remainder of 2022 we expect Cash App and Square to sequentially grow gross profit each quarter throughout the year even excluding Afterpay, assuming the macroeconomic environment remains stable. Your line is open. Your line is open. Your line is open. You also layer on top of that that we have some newer products that are just beginning to ramp whether it's reaching out to families whether it's driving inflows through direct deposits whether it's things like Cash App Pay or in the longer term the opportunities to build an integrated commerce platform with Afterpay, we see significant opportunity here to continue to drive growth through our Cash App platform. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}