{
    "symbol": "SQ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 18:18:06",
    "content": " For Cash App, in 2022, we achieved an efficient cost of acquisition of $10 or less on average, as we grew to 51 million monthly transacting actives in December, adding our largest annual cohort of customers on a gross profit basis. For the month of January and February, we estimate overall company gross profit growth to be approximately 33% year-over-year on a reported basis, and we expect growth for the full first quarter to be a few points below this. On a combined company basis, we estimate overall company gross profit growth in January and February of approximately 25% year-over-year, an improvement from 21% in the fourth quarter. For Cash App, we expect gross profit growth to be greater than 50% on a reported basis year-over-year for the months of January and February. Cash App Card achieved strong growth in monthly actives and spend per active and delivered more than $750 million in gross profit for the year, up 56% year-over-year and making up more than one-quarter of overall Cash App gross profit. For Square, we expect gross profit growth to be approximately 15% on a reported basis year-over-year through January and February. Even with these shifts in macro trend line, the Square ecosystem, excluding PPP and our BNPL platform had a gross profit growth rate of 17% year-over-year in the fourth quarter and is expected to grow 21% year-over-year in January and February. Your line is open. Your line is open. Your line is open. Your line is open. From a growth perspective, we expect Cash App to grow faster than Square, which is a continuation of Q1 where you've seen consumer trends relatively stable for Cash App versus some moderation in a few discretionary verticals that we believe are macro related for Square. Within Cash App, we expect to see -- when we think about our inflows framework of active inflows per active, which is the amount of money our customers bring in to Cash App and then monetization rate, we expect to see continued year-over-year growth across each of those three drivers of the Cash App business during 2023. Your line is open. Your line is open. Your line is open. And when you look at that combined company growth, what we see is overall Block gross profit growth of approximately 25% year-over-year in January and February, which we expect to be relatively consistent for the full quarter as well and which is an improvement from what we saw in Q4 of 21% year-over-year growth on a combined company basis. Within each of those, Cash App, we expect to grow at more than 50% on an as-reported basis in January and February, albeit March, we expect to see a slower growth rate as we lap the pricing changes."
}