{
    "symbol": "SQ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 20:58:06",
    "content": " For the second quarter, our BNPL platform, which we acquired through the acquisition of Afterpay, contributed $150 million of gross profit, split across Square and Cash App. Cash App generated $705 million of gross profit in the second quarter, an increase of 29% year-over-year and 88% on a three-year CAGR basis. Excluding our BNPL platform, Cash App gross profit was $630 million, up 15% year-over-year and 82% on a three-year CAGR basis. For Cash App in July, we expect gross profit, excluding our BNPL platform, to grow by 32% year-over-year and be relatively consistent with the 82% three-year CAGR in the second quarter. JULY spend per active on Cash App Card achieved positive growth on a year-over-year basis, with a three-year CAGR also in the mid-teens and July spend on Cash App Card increased compared to the monthly average in the second quarter. As we shared on our last earnings call, we continue to believe Cash App year-over-year gross profit growth rate, excluding Afterpay, will improve in the second half of the year compared to the first half, as comparisons become more favorable as newer commerce and financial services products ramp, and with the benefit of certain pricing adjustments. Also consistent with what we mentioned last quarter, for the remainder of 2022, we expect Cash App and Square to sequentially grow gross profit each quarter throughout the year, even excluding Afterpay, assuming the macroeconomic environment remains stable. Your line is open. Your line is open. Your line is open. Let's unpack a little bit of what we've seen here across our product set, which we believe provides diversity and breadth of utility for our Cash App customers, across engagement, which we would measure as transactions and inflows per active, and then across monetization or sort of our revenue streams. And so, that's led to an overall diversification of our revenue streams and our monetization across various business models, which ultimately has enabled us to continue to invest in the business across a variety of at scale revenue streams and with some newer ramping revenue streams like Cash App Pay, which obviously Jack was just talking about as well as Cash App Borrow and other banking and commerce products. Your line is open. Your line is open. Your line is open. And I'd just add, Josh, that I think you're right that from a synergy perspective, we should expect to see opportunities that span beyond just the Buy Now, Pay Later platform into each of the Square and Cash App revenue streams and lines of opportunity as we think about increasingly creating that marketplace that connects sellers and consumers alike. Your line is open. Your line is open."
}