{
    "symbol": "PEGA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 23:24:16",
    "content": " Factors that could cause the company's results to differ materially from those expressed in forward-looking statements are contained in the company's press release announcing it’s Q1 2022 earnings and in the company's filings with the Securities and Exchange Commission, including it’s annual report on Form 10-K for the year ended December 31, 2021 and other recent filings with the SEC. It's also important to point out, as we discussed on our Q2 2021 earnings call, we had an unusually high mix of client cloud last year, in the first half of 2021 which makes for a tougher quarterly revenue compare when thinking about the first half of 2022. So I would say that the client receptivity to Pega Cloud as opposed to -- look, the message of Cloud Choice, I think, is a terrific company message to have is differentiated from a lot of companies and I think it gives customers and will in the future give customers a level of sort of intellectual freedom that they're making something that they will approve the choices of. Just like I don't want to predict -- I didn't want to predict the end of COVID, I'm a little cautious on predicting the end of high attrition but I would say that every statistic that you see in the market would suggest that the attrition is not getting worse in Q1 and Q2 than it was last year. So that's a good sign for us because naturally we're going to see attrition, too and then it's hard to -- so I would hope that by the end of 2022 we would be no worse off than we are now and hopefully slightly better in terms of the percentage of sales reps that would be getting kind of into that productivity. Because we are trying for -- Ken's commentary on trying to make sure we're being financially responsible, if we are, in fact, raising comp, we need to make sure we're getting -- we're hiring assets, topnotch people, getting tremendous value from them, retaining."
}