{
    "symbol": "PEGA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 20:21:06",
    "content": " First, our non-GAAP EPS reached $0.72, an increase of over 200% year-over-year. Our non-GAAP EPS performance was primarily driven by more disciplined expense management, especially in sales and marketing. In fact, total sales and marketing costs were down slightly year-over-year. Second, Pega Cloud gross margin improved approximately 300 basis points to 70%. First, our non-GAAP EPS reached $0.72, an increase of over 200% year-over-year. Our non-GAAP EPS performance was primarily driven by more disciplined expense management, especially in sales and marketing. In fact, total sales and marketing costs were down slightly year-over-year. Second, Pega Cloud gross margin improved approximately 300 basis points to 70%. So I think that -- I think it's not a surprise that we would expect to start to see better engagement with our target organizations, our existing clients because more -- there's so much more focus and capacity in the company around those clients, those clients are precious to us, not only because they actually -- we got $1 billion of ACV from them, but also because there's tens of billions of dollars of opportunity within those clients for the future. But now we're seeing that, and it's -- I just think a conscious result of the increased focus, the increased staff of understanding and really working to be more trusted advisers with these clients, which is an investment in a lot of energy and a much more consultative approach as opposed to a transactional approach. If we're in a position where we have account execs and account teams who are focused on a very, very specific target organization, that's a very different and candidly, a tremendously more efficient model when you already know people in that organization to get to know more people and to have the trusted credibility in that organization than the alternative, which we had much more of what I would describe as a lead response approach where we would be looking for people in often new organizations who had the classic qualification activity of bans, they have a budget authority we needed a time line."
}