{
    "symbol": "LPTH",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-10 21:51:03",
    "content": " Selling, general and administrative costs were approximately $2.6 million for the first quarter of fiscal 2023, a decrease of approximately $231,000, or 8%, as compared to approximately $2.9 million in the same period of the prior fiscal year. Net loss for the first quarter of fiscal 2023 was approximately $1.4 million, or $0.05 basic and diluted loss per share, compared to $632,000, or $0.02 basic and diluted loss per share, for the same quarter of the prior fiscal year. The increase in net loss for the first quarter of fiscal 2023, as compared to the same period of the prior fiscal year was primarily attributable to lower revenue and gross margin, which was partially offset by lower operating expenses and income taxes. The decrease in EBITDA in the first quarter of fiscal 2023 was primarily attributable to lower revenue and gross margin, partially offset by lower operating costs. Cash used in operations was approximately $415,000 for the first three months of fiscal 2023, compared to approximately $1.6 million for the same period of the prior fiscal year. Cash used in operations for the first three months of fiscal 2023 reflect a higher net loss in the comparable period, with an outflow of approximately $69,000 from the net change in operating assets and liabilities. The first three months of fiscal 2022 also reflected an increase in accounts receivable due to higher sales in the previous sequential quarter, whereas for the first three months of fiscal 2023 reflect a decrease in accounts receivable due to the lower sales than the previous sequential quarter. Help us with the timing of when we would know if it in fact is a game changer and how do you define a game changer of $2 million, $5 million per year, I mean could you talk about some... Freeform Optics is a key technologies that sort of gave us a second win for the PMO for the Molded Optics, but it's one of multiple technologies that we use as differentiators."
}