{
    "symbol": "EOLS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 21:36:02",
    "content": " Our projected growth this year puts us on a trajectory toward achieving $500 million in sales in 2028 through a combination of a fundamentally strong aesthetic neurotoxin market, continued market share gains in the U.S., and meaningful contribution from international markets. In the fourth quarter, net cash used for operating activities was $8.8 million, which was nearly 50% lower than the amount used in the third quarter, and a continuation of the favorable trends we've seen this year. Our quarterly revenue assumptions assume a return to historical seasonal revenue patterns and adjusted growth margin to be in the range of 68% to 71%, full-year non-GAAP operating expenses to be between $145 million and $150 million, which consists mainly of continued investments in the growth of Jeuveau in the U.S. plus Nuceiva launch expenses internationally and achieving positive non-GAAP operating income in the fourth quarter. Please proceed with your question. Your $500 million guidance assumed, I think a constant market share after this year in standard market growth, but no contribution from other products or even from this extra-strength. Please proceed with your question. We look at this expansion internationally in phases clearly getting the international business to represent 15% to 20% of our overall revenue by 2028 is a significant idea and getting each of those markets right, finding the right partners as we enter them, as well as executing on a launch strategy with the team that we've deployed in Europe. Please proceed with your question. Please proceed with your question. As it relates to the $500 million guidance, yes, we did say we anticipate roughly 15% to 20% of that revenue to be generated outside of the U.S. As it relates to 2023 phasing, we see us returning to typical aesthetic market seasonality as opposed to being on a ramp curve associated with our initial launch, which really was mostly in 2021. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}