{
    "symbol": "F",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 20:20:06",
    "content": " We introduced the Ford+ plan for growth and value creation two years ago, and the investment thesis had three drivers: leveraging our iconic vehicles, our strengths, both geographically and nameplates; number two, add to that, integrated hardware, software and connectivity into those vehicles; and then expand the total addressable market and unlocking value with Conquest EVs, new commercial vehicles, connected services and physical services as well as mobility. We will introduce a lineup of not first, but second cycle EVs that are not only fully software updatable and constantly improving, but they will generate an 8% plus margin, an amazing array of software-enabled services, not just BlueCruise L3, but many others, video services for software -- for safety and security, and weâ\u0080\u0099re already shipping a broad range of Ford Pro productivity tools and 100% uptime services for our commercial customers. Our year-over-year basis for our â\u0080\u009822 adjusted EBIT target assumes significantly higher earnings in North America; aggregate profitability in the rest of the world; Ford Credit EBT at about $2.7 billion, with strong, though lower, auction values in the fourth quarter as the supply of new vehicles improves and higher borrowing costs; continued strong pent-up demand in orders for Fordâ\u0080\u0099s newest products; continued strength in pricing; higher commodity and broad-based inflationary costs of about $9 billion; no further deterioration in supply chain; and continuation of a strong dollar. So kind of think of that â\u0080\u009823 to â\u0080\u009825 time frame is Ford completely refreshing its EV lineup globally, introducing fully updatable electrical architectures and in-house software development for controlling the vehicle, leveraging all of our experience of now weâ\u0080\u0099ve done 5 million OTAs and on enhanced Level 2+ and Level 3 system."
}