{
    "symbol": "NUVA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 21:08:05",
    "content": " NuVasive delivered fourth quarter 2022 net sales of $305.4 million, an increase of approximately 1% on a reported basis and approximately 5% on a constant currency basis compared to the prior year period. In our international business, we achieved double-digit growth of approximately 11% on a constant currency basis compared to the prior year period, led by corresponding growth, the continued return of MAGEC and PRECICE titanium products. For the full year, our 2022 net sales came in at $1.202 billion, an increase of 5.5% on a reported basis and 8.5% on a constant currency basis compared to the prior year. Worldwide net sales for the fourth quarter were $305.4 million, a 1.1% increase as reported and a 4.8% increase on a constant currency basis. Worldwide net sales for the full year 2022 were $1.202 billion, a 5.5% increase as reported and an 8.5% increase on a constant currency basis. International net sales for the fourth quarter were $68.4 million, which was a decrease of 4.9% as reported and an increase of 10.7% on a constant currency basis. For the full year 2022, international net sales were $282.3 million, a 4.9% increase as reported and a 17.7% increase on a constant currency basis. U.S. Spinal Hardware net sales for the fourth quarter of 2022 were $167.8 million, representing a 4.6% increase. For the full year 2022, U.S. Spinal Hardware net sales were $652.1 million, a 6.8% increase. U.S. Surgical Support net sales for the fourth quarter of 2022 were $69.2 million, roughly flat compared to the prior year period. For the full year 2022, U.S. Surgical Support net sales were $267.5 million, a 3.3% increase. Non-GAAP gross margin as a percentage of net sales for the fourth quarter of 2022 was 70.3%, a decrease of 220 basis points compared to 72.5% in the prior year period. Non-GAAP gross margin as a percentage of net sales for the full year 2022 was 72%, a decrease of 110 basis points compared to 73.1% in the prior year period. For the full year 2022, non-GAAP operating expenses were $716.9 million, an increase of 4.3% compared to $687.3 million. Fourth quarter 2022 non-GAAP operating margin was 11.3%, a decrease of 160 basis points compared to 12.9% in the prior year period. For the full year 2022, non-GAAP operating margin was 12.4%, a decrease of 40 basis points compared to 12.8% in the prior year, primarily due to lower gross margins. For the fourth quarter of 2022, we reported GAAP net income of $24.1 million or diluted earnings per share of $0.42 compared to a net loss of $36.7 million or diluted loss per share of $0.71 in the prior year period. On a non-GAAP basis, we reported fourth quarter net income of $22.6 million or diluted earnings per share of $0.43 compared to net income of $20.7 million or diluted earnings per share of $0.40 in the prior year period. For the full year 2022, GAAP net income was $40.4 million or diluted earnings per share of $0.76 compared to GAAP net loss of $64.1 million or diluted loss per share of $1.24 in the prior year. On a non-GAAP basis, we reported full year 2022 net income of $103.9 million or diluted earnings per share of $1.98 compared to non-GAAP net income of $87.8 million or diluted earnings per share of $1.68 in the prior year. Given those factors, we expect worldwide net sales growth of between 6% to 8% for the full year 2023 on a constant currency basis compared to the prior year. I mean, if you look at, like I said before, our ability to access the enabling tech capability that Globus possessed and continues to innovate around what we've done, like I said, other 360 portfolios, things like Simplify, our global footprint, the NSO and PRECICE opportunity, coupled with their orthopedic and trauma portfolio, I think we're stronger in every market we play in just as a rule."
}