{
    "symbol": "NUVA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 21:52:04",
    "content": " Our U.S. surgical support business delivered mid-single digit year-over-year growth in the third quarter driven by procedure volume recovery, and NuVasive clinical services, growth and interruptive neuro monitoring disposables, and pulse platform sales. Third quarter worldwide net sales were $295.3 million, an increase of 9% as reported compared to the prior year period. On a constant currency basis, third quarter net sales were $305.8 million, a 12.9% increase compared to the prior year period. International net sales for the third quarter showed continued strong momentum at $68.8 million, representing growth of 5.3% as reported and 21.3% on a constant currency basis compared to the prior year period. Third quarter 2022 non-GAAP operating expenses were $174.3 million, an increase of 4.7% compared to $166.6 million in the prior year period. On a GAAP basis, we reported a net loss of $2 million or diluted loss per share of $0.04 in the third quarter of 2022 compared to a net loss of $21.6 million or diluted loss per share of $0.42 in the prior year period. On a non-GAAP basis, we reported third quarter net income of $28.3 million or diluted earnings per share of $0.54 compared to net income of $16.9 million or diluted earnings per share of $0.32 in the prior year period. We've even through the pandemic really accelerated a lot of our R&D to produce a lot of the technology that you're seeing translating into growth today and we'll continue that translation over the next couple of quarters into 2023, 2024 and beyond. If those were to come back into Q4, not only we'll be well positioned in the lower acuity where we're seeing a lot of our growth now and allows us to actually grow as you're seeing double digit in what I'd consider to be a flattish market, but also positions us to take very much -- take an opportunity to really pick back up the upswing in some of the lower acuity -- I'm sorry, the higher acuity cases complex cases."
}