{
    "symbol": "NUVA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 21:37:12",
    "content": " NuVasive delivered second quarter 2022 net sales of $310.5 million, an increase of 5.3% on a reported basis or 7.8% on a constant currency basis compared to the prior year period. Our second quarter results reflect strong net sales growth compared to the prior year period, as well as sequentially, that said our bottom line results were pressured by macro environmental issues, including inflationary costs, supply chain delays, volatility of foreign exchange rates and the ongoing impact of COVID. International sales of $73.6 million in the second quarter, demonstrated continued strength with double digit constant currency growth compared to the prior year period. Turning now to U.S. net sales by product line, U.S. spinal hardware net sales were $165.1 million in the second quarter of 2022, representing a 3.1% increase over the prior year period. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Hi, thanks for taking the questions. Some of the complex cases were down and then areas that we've made a lot of investment like in cervical, I think even with the downward pressure, we saw some strength just because we were all out share taking so it's hard to kind of get to glean the underlying market growth. Please proceed with your question. Hi, thanks for taking the questions. Please proceed with your question. Yeah, I said earlier, I quoted the number that I've seen a few days ago that 50 plus may maybe even 50 to 60 plus surgeons that sort of started out using Simplify have now adopted other parts of the cervical portfolio, which tells me that, that it's bringing along the interior cervical plate, and we're launching Reline C late at this quarter. I just want to just reiterate the fact that we're excited, happy with the performance in the quarter, continue to focus on this idea of multiple vectors of growth, extending our leadership in less invasive surgery, taking share in those underrepresented segments, delivering on enable technology roadmap and our starting point here is Pulse."
}