{
    "symbol": "DD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 12:17:08",
    "content": " Fourth quarter revenue included a 5% organic growth versus the year ago period, strong volume in water and auto adhesives, as well as ongoing strength in industrial end markets such as healthcare and aerospace, helped mitigate volume declines in consumer electronics end markets and softening conditions in North American construction markets. In 2023, we expect to allocate CapEx at about 5% of sales as we wrap up some larger scale projects this year and we target R&D spending at about 4% of sales on a consolidated basis longer term, investing differentially within our business lines based on growth potential. Turning to our financial highlights on Slide 6, fourth quarter net sales of $3.1 billion decreased 4% as reported and increased 5% on an organic basis versus the year ago period. As we exited the year, we saw lower volumes in areas we have highlighted with total December organic sales up 2% year-over-year, including down high single-digits in China, driven by acceleration of COVID disruptions and low single-digit organic sales growth in the U.S. and Canada due to muted demand in construction and destocking by customers. From an earnings perspective, operating EBITDA of $758 million increased 1% versus the year ago period despite currency headwinds and the impact of portfolio. Our tax rate for the quarter was 22.2%, up notably from 18.6% in the year ago period, resulting in a $0.06 tax headwind to adjusted EPS driven primarily by geographic mix of earnings and currency. Full year operating EBITDA of $3.26 billion increased 3% due primarily to volume gains as pricing gains were mostly offset by continued pressure associated with higher raw material, logistics and energy costs. For the full year, E&I net sales of $5.9 billion increased 7% versus 2021, up 5% on an organic basis as the portfolio benefit from last yearâ\u0080\u0099s Laird acquisition was partially offset by currency headwinds. From a line of business view, organic sales growth was led by Semi Tech, up low double-digits and Industrial Solutions up high single-digits, partially offset by mid single-digit declines in Interconnect Solutions related to weakness in smartphones and personal computing end markets during the second half of 2022. Full year operating EBITDA of $1.8 billion increased 4% as volume gains, a full year of earnings associated with the Laird acquisition and higher pricing more than offset inflationary cost pressure and weaker mix in interconnect. For the full year, W&P net sales of $6 billion increased 7% versus 2021 as organic growth of 11%, partially offset by a 4% currency headwind. For the first quarter of 2023, we anticipate continued weakness in these consumer-driven short-cycle end markets, resulting in a first quarter net sales expectation of about $2.9 billion or down mid-single digits on an organic basis versus the year ago period. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}