{
    "symbol": "CBRL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-06-07 14:27:06",
    "content": " Three things in particular impacted our sales during the quarter: first, over 65-year-old guests have been slower to return to in-person dining than other demographics in our guest base; second, the challenging economic environment caused some of our guests to manage frequency and check during the quarter; finally, we believe that high gas prices disrupted traditional spring break travel patterns, resulting in lower travel visits. The positive side, our off-premise business continued to meet our expectations, and we partially offset our dine-in headwinds with continued strong retail performance as we grew comparable store retail sales by 9.7% over the prior year quarter by 21.6% compared to the third quarter of 2019. Despite the challenges of the third quarter, many of which are likely to continue to one degree or another for the balance of our fiscal year, we're actively pursuing strategies and initiatives that I believe position us well both for the near and longer term. By enhancing the things that make Cracker Barrel one of the most differentiated and beloved brands in the industry and investing in technology to improve our appeal across our guest base, we're pursuing initiatives that we believe will make us a destination of choice for our guests and our employees for years to come. Whether they are about menu initiatives that we believe will appeal to core guest or the guest space, we're trying to drive either more traction or more frequency, or our technology assets that we think will both be attractive to our guests, things like mobile pay where we think that's a very attractive component of the guest experience, and it results in more productivity for our cashiers. Well, there's still a great deal of uncertainty in the near-term consumer and inflationary environment, but as we continue to navigate these pressures, we look to the future and are confident that the strategic plans we outlined for you today, both those to drive further sales recovery and those that will strengthen our business model are the right plans and will position us well over the long term."
}