{
    "symbol": "GMBL",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-15 23:07:04",
    "content": " Revenues for the quarter came in at $16.4 million, which is up 86% from the fiscal 2021 fourth quarter and up dramatically from the $220,000 that we reported in the prior year period. Our iGaming revenues for the quarter, came in at $14.7 million and across all our brands we'd over 71,000 active players in the period, representing a 45% growth quarter-over-quarter. On July 14th, we completed our acquisition of Bethard bringing it in-house a rapidly growing traditional B2C sports betting operator, Bethard also brings EEG more than $30 million of revenues on an annualized basis as well as valuable sports betting licenses in Sweden and Spain. Shifting gears to EEG games, EEG games’, first quarter revenue was $1.8 million marking a significant growth from our prior year period, as you know, completely integrated the acquisition of EGL, Helix and ggCircuit. These funds allow us to make our final payment to Gameday Group for the Bethard acquisition, which leaves us with several million in cash on our balance sheet to continue executing our growth strategy, to achieve our goal of exceeding the $100 million of revenue this fiscal year. As Grant mentioned, we're pleased to announce that we generated $16.4 million of net revenue for the quarter, up $16.2 million compared to the first quarter of fiscal 2021 and up $7.6 million or 86% versus the fourth quarter of fiscal 2021 revenue of $8.8 million. Sales and marketing expenses were $7.4 million, up from $5.1 million last quarter, driven by a full quarter of that high marketing costs, as well as the expansion of our roster of professional sports team partnerships with new agreements signed in the quarter, including the Indianapolis Colts, Tampa Bay Buccaneers, and the LA Chargers. General and administrative costs on an adjusted EBITDA basis was $7.0 million, up from $5.7 million in Q4 fiscal 2021, driven by acquisition of Bethard operational costs and the continuation of our investment in our technology team related to the ongoing development of our in-house Phoenix betting platform. With all these new initiatives in mind, underpinned by the marketable cross-sell opportunities within the iGaming division, we are still guiding to annual revenue of a $100 million in fiscal 2022, split approximately 85/15 between our iGaming and emerging EEG games businesses."
}