{
    "symbol": "MUR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 16:12:02",
    "content": " In the fourth quarter, we produced 173, 600,000 barrels of oil equivalent per day at 62% liquids due to the significant impact from our Khaleesi, Mormont, Samurai field development, we achieved nearly 30% growth in our oil volumes to $97,000 per day of oil since the first quarter of 2022. Slide 7; we closed out the year with outstanding financial results as our fourth quarter 2022 net income totaled $199 million or $1.26 per diluted share and the full year 2022 net income was $965 million or $6.13 per diluted share, which is the highest Murphy has had since 2019 and second highest in the last 10 years. After accounting for net property additions and acquisitions, we achieved positive adjusted cash flow of $321 million and $1.07 billion for the fourth quarter 2022 and full year 2022, respectively. Slide 11; our Eagle Ford Shale wells produced an average 32,000 barrels of oil equivalent per day in the fourth quarter with 85% liquids. For the year, production was slightly above at 34,000 barrels of oil equivalent per day as we brought 27 operated wells and 15 gross non-operated wells online. Slide 12; the -- our Tupper Montney business produced 288 million cubic feet per day for the fourth quarter, which included a 17% royalty rate for the quarter as anticipated. For full year 2022, we produced 6,000 barrels of oil equivalent per day with 74% liquids and brought on line 3 operated wells. I decide to say that our cash flow supports our 10% increase in our quarterly dividend that was announced today and allows us to set a $500 million debt reduction goal for 2023 using $75 oil pricing -- WTI oil pricing, all with a low reinvestment rate of only 45% of our operating cash flow. Onto Slide 21; our first quarter 23 production guidance of 161,000 to 169,000 equivalents per day includes approximately 92,000 barrels of oil or 56%, with 62% of our volumes being liquids. I'd like to note that while this production range is lower in the fourth quarter, it reflects our natural production decline due to the first tax weighted CapEx that we use yearly as we haven't brought on and operated well in our Eagle Ford jail since September and in the Tupper Montney since July. For the full year '23, forecast production range of $175.5 million to 183,500 barrels equivalent per day with 99,000 barrels of oil per day or 5% and Overall, with lower forecast CapEx for '23, this guidance represents a 10% oil growth for the year and a 7% in total production growth. Our total onshore budget for '23 is $455 million, which we forecast will generate an average production of 90,000 equivalents per day with 35% liquids. In our Eagle Ford Shale business, we plan to spend $325 million to bring online 35 operated and 17 gross non-operated wells with the majority coming online in the second and third quarter. And our Tupper Montney asset or 23 plans $125 million, is forecasting to bring online 16 operated wells and produced approximately 313 million cubic feet per day, assuming a C4 per 1,000 AECO price for the year, we forecast that to equal a 14% royalty rate for 2023. Our plan here calls for $365 million budget, which is forecast to generate 89,000 barrels equivalent oil per day, representing a 20% increase from full year 2022. For full year '23, we estimate production will be 82,000 equivalents per day in the offshore business in the Gulf with 79% oil volumes and 72,000 equivalents per day and 2022 was produced. We plan to spend $30 million for our non-operated offshore Canada assets in 2023 to generate production of approximately 7,000 barrels of oil equivalent per day. We forecast that this will maintain an average of 55% oil weighting in our business and have 195,000 equivalents per day of average production, representing a combined annual growth rate of 8% through 2025 while also supporting our targeted exploration program. Longer term in '26 and '27, we see Murphy maintaining a sustainable business and targeting investment-grade metrics and we forecast average annual production of approximately 210,000 barrels equivalent per day with 53% oil weighting, further our ongoing reinvestment of approximately 40% of operating cash flow forecast ample free cash flow to fund additional debt reductions in our capital allocation framework and enhanced shareholder returns as well as fund high-returning investment opportunities. The Eagle Ford Shale stand alone with approximately 12 years of inventory are 360 wells with a breakeven of $40 per barrel or less, assuming an annual 30 well delivery program across these 2 basins, we hold more than 60 years of inventory in Murphy Oil today. Our offshore development opportunities on Slide 29; our very successful offshore business will also be maintained at an average of 90,000 to 100,000 barrels equivalent per day with an average annual CapEx of approximately $325 million a year through 2027. As you look across our production from '23 onwards, as I look at our onshore business, as you just mentioned and Eric greatly answered about our increase in the Montney -- so when you look across our onshore business today, this year, as we just disclosed this morning, 89,000 barrels a day, that's creeping up 90, 110, 112, primarily around the Montney and maintaining the Montney and toward the end of the program, increased close to 40 in the Eagle Ford at this time."
}