{
    "symbol": "MUR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 15:25:26",
    "content": " Murphy produced 70,000 barrels of oil equivalent per day in the second quarter was 79% oil volumes, approximately 80% of our Gulf of Mexico Capex budget for the year is dedicated to our major projects at Khaleesi, Mormont, Samurai and the non-operated St. Malo waterflood and we are pleased that they remain on schedule. Together the additional working interest and the three new wells online later this year, an estimated incremental production of approximately 1,500 barrel of oil equivalent per day for the annualized full year 2022 and 4,100 barrels of oil equivalent per day, estimated for the full year 2023. Importantly due to outstanding Eagle Ford Shale and Gulf of Mexico execution as well as Bolton acquisitions, we're increasing our full-year 2022 production guidance today to a new range of 168,000 to 176,000 barrels equivalent per day at 52% oil and 58% liquids. On our capital plan on Slide 20, Murphy is maintaining our 2022 Capex guidance range $900 million to $950 million, excluding acquisitions, approximately 6% of our spending occurred in the first half of the year, in part to support our onshore program as more than 90% of our operated wells are online year-to-date. By maintaining the spending level, our increased production volumes and stronger oil prices, provide a significant free cash flow to allocate toward our increasing dividend of $1 per share annualized as well as nearly $450 million and announced debt reduction transaction is at this time with further debt reduction plan for the remainder of the year. To expand on our previously announced 2022 debt reduction goal of $600 million to 650 million, the board of directors has approved a multi-tier capital allocation framework allowing for additional shareholder returns, beyond the quarterly base dividend of $0.25 per share advancing towards a long-term debt target of $1 billion. We will soon start flowing the last well in the Khaleesi Mormont project and that will add significant production as we head toward the end of the year, we expect to be approaching the nameplate capacity of King's Quay facility, which is 85,000 barrels of oil per day. But we have a high bar on M&A, we're not looking at M&A to grow or do anything like that it must make unique investment criteria that we focus on and but sure any company that has a incredible deal and we've had some incredible deals and these two today are very good, you would have to delay that a few months as you state, but then during that time, there's a good bit of cash on the balance sheet as well, Roger. We like to operator, or we like to work that's ongoing, It's just a totally different advantage with very low EBITDA multiples incredibly high rates of return, and you have to be in that game and understand that game to make hay when the sun shines and we just don't see that in the on shore today and that's why we're well positioned with a diverse portfolio that allows us to move in and out of things in the Gulf that we make a lot of money on, Paul."
}