{
    "symbol": "MUR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 16:24:05",
    "content": " We're generating strong cash flows with higher oil prices and well performance exceeding expectations as we have been able to increase our shareholder returns through quarterly dividend raises, as well as accelerate our debt reduction goals. We're projected to achieve the high end of our $650 million debt reduction goal by year-end and forecast total debt at that time of $1.8 billion, which positions us to again Murphy 2.0 of our capital allocation framework in 2023, which will advance cash returns to shareholders. We now have six of seven producing wells from the Khaleesi, Mormont and Samurai field development projects with gross production volumes significantly exceeding expectations and achieving a record 120,000 barrel equivalents per day gross at the facility. Onshore, we continue to see superior well reserves in Eagle Ford Shale from our 2022 program and we're pleased to drill and complete Tupper Montney wells in 2022 for an average price of just under $5 million per well with exceptional payout results. Slide 16, the Khaleesi Mormont Samurai field development project and the Murphy-operated King's Quay floating production system has been a tremendous success for the company since achieving first oil in April. This incredible execution coupled with production exceeding expectations across all of our oil-weighted assets, including the Eagle Ford Shale has led to significant free cash flow generation, enabling Murphy to achieve its debt reduction goal by the end of 2022, increase our dividend and advance our capital allocation framework. We have Khaleesi, Mormont, Samurai wells adding 5,700 barrels more production in the fourth quarter than we expected, based on really strong results. We expect that the future production rates from the field will be in about that level on a gross basis for the foreseeable future, including up to the next say three years, as we bring online additional Samurai wells the Samurai-4, which will come online in the fourth quarter; and the Samurai-5 well, which will come online in the second quarter of 2023. So if you think about how you would kind of model us there, once we bring online the third Samurai well in the second quarter of 2023, we ought to have a pretty stable business and again, a total gross production, quite similar to what we're experiencing right now."
}