{
    "symbol": "MUR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 15:50:27",
    "content": " We continue to generate strong cash flow with higher oil prices realized this year, we’ve been able to increase our shareholder returns through quarterly dividend raises as well as accelerate our debt reduction goals. As we announced in early April, we reached a significant milestone of first oil, the King’s Quay floating production system, the two wells from the Khaleesi, Mormont, Samurai field project currently flowing with field uptime far exceeding our expectations. We’ve been granting an additional expiration period in the Block 5 offshore Mexico by the regulator, and we are advancing plans to drill the Tulum exploration well, later this year, we’re also working with partners on our 23 expiration program, which we anticipate to include two operated wells in the Gulf of Mexico. With ongoing strong operational and financial execution, we achieved the first steps in 2021 and announce new targets for this year in January with prices much higher than forecast in the first quarter and first production now achieved from the Khaleesi, Mormont, Samurai project, we’re in great position to reach our debt reduction targets with the first redemption of $200 million announced earlier this week, which will be executed in June. Additionally, while we’ve seen significant rise in AECO price in this quarter, we estimate a royalty impact of 1,100 barrels of oil equivalent per day for full year 2022, assuming C$4.82 AECO price for the year. On Slide 14 in the Gulf of Mexico, our assets there produce 59,000 barrels equivalent per day for the quarter with 80% oil, overall, approximately 80% of our 2022 capital plan is designating for advancing our major projects, with remainder spending on development and tieback wells and activity scheduled later this year, The non-operated St. Malo Waterflood Project is also ongoing. We’ve seen great results so far with the two wells produced and combined growth 30,000 barrels equivalent of oil per day at approximately 89% oil and the FPSO achieving significant 97% uptime, which is simply unheard of. On Slide 20, Murphy remains focused on this long-term strategy through 2024, we continue to accelerate our delevering goals at higher oil prices, including optionality for $900 million to $1 billion of net reduction in 2023, a conservative prices to today’s strip. So we – if we tweaked that a little bit higher, I’ll just give you a number basically to say that that three year average for 2022, 2023, 2024 is probably up about $40 million or 5% or something like that. We’re glad to make the payments, because we’re getting a piece of it and we’ve done very well in the M&A by contingent payments, but $100 oil that came on the roost and we’re glad it did, because we’re making a lot of money on these projects and we didn’t pay it up front two years ago."
}