{
    "symbol": "DNA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 21:55:25",
    "content": " Think like running an animal study or synthesizing a chemical, whereas when they're coming to Ginkgo, it's really to outsource work that they can't do themselves internally. And so even if it is a bit of a mouthful, we'll be updating our filings to refer to it in this way going forward, so we did not make this decision in time to get it incorporated into this 10-K. As Jason mentioned, we added 20 new cell programs to the cell engineering platform in the fourth quarter of 2022, which brought us to 59 new cell programs for the full year 2022. So last year, we got a fair bit of feedback that people didn't like us combining services and downstream value share together as part of the cell engineering revenue we guided to in 2022. It goes one of two ways, either similar to the small company, they're looking to drive efficiency, open their eyes to an external provider that is a variable cost option on the services side and so on or they say, actually, we're going to cut back our R&D budgets and just like maintain our internal stop and cut our external spending. I guess I just wanted to ask in terms of behind that rationale, the inherent unpredictability of that downstream value is, I'm sure, a key part of that because I know we deal with that, too, on our end -- has there been any change in terms of the cadence or pacing of potential downstream value like have projects been extended and things like that, that makes it sort of elongate that process or is it really just about the inherent unpredictability of that -- of those milestones and royalties. I think -- I don't think we'll do it quarterly because part of the challenge is that, like this year was the first year where like it was big enough that by not, like, I wouldn't have just told you what a customer who didn't want to publicly announce the milestones have done with us. The only thing I might add, Steve, and I know we've talked about this in the past is that there is an interesting dynamic where when R&D budgets are getting pressured, the idea of laying people off or closing a facility or something like that, it's a really hard thing that R&D leads don't want to be faced with us. Like, I'm sure Apple somehow predicts their app store revenue, even though they don't know exactly like which apps are going to fire next quarter because there's just so many of them and it's sort of just like moving with the Internet or something. But I do think you're seeing at least on the like as a consequence of COVID, you are seeing countries wanting to shore up critical infrastructure like onshore or like I think it's called like, I don't know, whatever, friendly country shore basically -- and it's changing where certain activities, like, for example, API manufacturing is done. So you might see opportunities in API manufacturing that just weren't there a couple of years ago, not because of like particularly on the economics, but because countries are putting their foot on the scale to make sure they have access to critical drugs in the event of a more polarized world, as one example I could think of."
}