{
    "symbol": "FSK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 11:34:10",
    "content": " In terms of our fourth quarter results, we generated net investment income totalling $0.80 per share and adjusted net investment income totalling $0.81 per share as compared to our public guidance of $0.74 and $0.75 per share respectively. As part of this distribution, we're also pleased to be raising our quarterly-based dividend to $0.64 per share, which represents approximately 5% increase over our last quarterâ\u0080\u0099s $0.61 per share based dividend and approximately a 7% increase in our base dividend from a year ago. Additionally, based on the overall strength of the company's earnings power, we expect our quarterly supplemental distribution to total a minimum of $0.06 per share throughout 2023 and possibly beyond, equating to a minimum of $0.70 per share per quarter of quarterly distributions during 2023. In addition to this EBITDA growth, by continuing to focus on larger companies, we have increased the weighted average EBITDA of our portfolio companies to $204 million as of the end of the fourth quarter as compared to $164 million at the end of 2021. Our new investments combined with $1.1 billion of net sales and repayments, when factoring in our sales to our joint venture equated to a net portfolio decrease of $221 million during the fourth quarter. Benefiting from our incumbency position, during the fourth quarter of 2022, we led a $790 million unitranche and DDTL financing to support the acquisition of the company by a new sponsor with more attractive economics and a lower leverage point than our original investment. During the fourth quarter, excluding the impact of merger accounting, we experienced net portfolio depreciation on investments of approximately $105 million. As Michael mentioned earlier, we are pleased to be able to reward shareholders with an increase in our base dividend as well as to communicate the company's positive view that our supplemental distribution should equate to a minimum of $0.06 per share per quarter during 2023 and possibly longer, resulting in a total minimum distribution of $0.70 on per share per quarter. On an annualized basis, our distribution totals $2.80 per share, representing an 11.3% yield on our December 31, 2022 net asset value of $24.89 per share. Our dividend and fee income during the fourth quarter is summarized as follows: $53 million of recurring dividend income from our joint venture, other dividends from various portfolio companies totaling approximately $24 million and fee income totaling approximately $12 million. From a forward-looking guidance perspective, we expect first quarter 2023 GAAP net investment income to approximate $0.77 per share, and we expect our adjusted net investment income to approximate $0.74 per share. As a reminder, the $0.03 per share difference between our GAAP net investment income and our adjusted net investment income related to the expected accretion of our investments during the quarter due to merger accounting. In an effort to link our fourth quarter 2022 results through our first quarter 2023 guidance, the primary considerations are as follows: starting with our $0.81 per share of 4Q adjusted net investment income, we subtract $0.05 per share of adjusted net investment income to account for the expiration of the fee waiver. I mean, I think what we're saying is we believe in the strength of these companies, the size and scale of these companies probably between the 2 of them, there's an average of $500 million or so of sort of equity sort of beneath the loans and the loans we sort have made."
}