{
    "symbol": "LQDT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-08 12:47:02",
    "content": "  Operator: Welcome to the Liquidity Services, Inc. Fourth Quarter of Fiscal Year 2022 Financial Results Conference Call. On the call today are Bill Angrick, Liquidity Services' Chairman and Chief Executive Officer; and Jorge Celaya, its Executive Vice President and Chief Financial Officer. The following discussion and responses to your questions reflect Liquidity Services management's view as of today, December 8, 2022 and will include forward-looking statements. Additional information about factors that could potentially impact the financial results is included in today's press release and in filings with the SEC, including the most recent Annual Report on Form 10-K. As you listen to today's call, please have the press release in front of you, which includes Liquidity Services' financial results as well as metrics and commentary on the quarter. During this call, Liquidity Services management will discuss certain non-GAAP financial measures in its press release and filings with the SEC, each of which is posted on its website. Liquidity Services management also use certain supplemental operating data as a measure of certain components of operating performance, which they also believe is useful for management and investors. I'll review our Q4 performance and the progress of our business, and next, Jorge will provide more details on the quarter. We delivered strong EPS and adjusted EBITDA results during the quarter despite macro challenges, which limited the supply of vehicles in our marketplace. During Q4, the strength of our buyer liquidity and a recessionary environment was on display as the number of auction participants and registered buyers on our platform grew 34% and 24% year-over-year, respectively. For the full year fiscal 2022, we generated a record number of auction participants and completed transactions on our platform, which provided outstanding results for our sellers. For our full fiscal year 2022, we're proud of the focus and execution of our team. We continue to advance our strategic and operational objectives, which translated into a record $1.1 billion of GMV, up 29% over the prior year, GAAP net income of $40.3 million and $42.7 million non-GAAP adjusted EBITDA. As we commence fiscal year 2023, we remain focused on expanding our mindshare and position with commercial and government clients as the most trusted marketplace to manage value and sell surplus assets in the circular economy. Despite near term headwinds in vehicle supply, we have a strong business pipeline and continue to see opportunities to reach $1.5 billion in annualized GMV and expand our technology enabled asset-light services to drive long-term shareholder value. Our expertise in diverse sectors, strong buyer base across numerous asset categories and global reach are continuing to provide advantages for our clients as they navigate this current volatile macro environment. Additionally, we continue to make progress penetrating our GovDeals customer relationships as a one stop solution for all asset sales, including their highest value assets. For example, since fiscal '20, our GMV per seller and a number of assets sold per seller on GovDeals have grown 44% and 19%, respectively. The beta version of our new GovDeals marketplace was shared with select bidders in Q4 and was extremely well received, resulting in a 2 times increase in our customer net promoter score. As client vehicle replenishment cycles normalize, federal infrastructure spending takes hold and we continue our pace of account acquisition, we see the opportunity to significantly grow the size of our GovDeals business over the next three to five years. In our Retail segment, our flexible service offerings have been well received by the marketplace as customers utilize both self-directed and fully managed solutions, leveraging our distribution center network to reduce supply chain costs and the sale of returns and shelf-pulled goods. Whilst some clients have held onto returned inventory to offer customers compelling early holiday deals, we have a strong new business pipeline and have won several new programs in the big box, omnichannel and pharmacy sectors, which has continued to diversify and grow our business portfolio in the Retail segment. For example, according to the National Retail Federation, retailers expect about 18% or $158 billion of merchandise sold during the holiday shopping season to be returned. Our value-added services, in particular, have been highly prized by our Retail segment customers as they help our clients reduce their supply chain costs. For example, in a recent auction for biopharma assets in Europe for multiple Fortune 500 clients, we had over 100 bidders from 27 countries, including 17 bidders from China, where 60% of the assets were ultimately sold. We grew our consignment heavy equipment vertical 36% year-over-year in fiscal 2022 and finished the year ahead of plan for signed contract, new sellers, transacted opportunities and net new revenue. Finally, we've opened a new Machinio sales office in China and believe there is a significant growth opportunity for our Machinio classifieds marketplace and storefront platform in the China market over time. We've continued to enhance our brand awareness in the marketplace and plan to double our core business over the next three to five years, which will be aided by the normalization of supply chains and our leverage of the fixed investments we've made in sales, branding and marketing, technology and operational capacity. Moreover, our capital efficient business with a strong operating cash flow, $98 million in cash and zero debt, provides us with ample flexibility to execute our plans. We've increased our authorized share repurchase capacity to $15 million and we will continue to deploy our capital on organic growth initiatives, share buybacks and tuck-in acquisitions. In closing, we thank our team members across Liquidity Services for their dedication to our mission to power the circular economy to benefit sellers, buyers and the planet. We completed the fourth quarter of fiscal year 2022 with $283.3 million in GMV, which was up 16% from $244.4 million in the same quarter last year. Revenue for this fiscal fourth quarter was $75.2 million, up 7% from $70.3 million in the same quarter last year and includes the completion of a high purchase transaction volume by our CAG segment. As a reminder, for our business model trend, higher growth of consignment, including growth in the real estate sector will lower our ratio of revenue as a percent of GMV and cause revenue to grow at a slower rate percent than GMV. Specifically comparing segment results for this fourth quarter to the same quarter last year, our GovDeals segment was up 20% on GMV and 8% on revenue, including Bid4Assets. And our CAG segment was up 13% on GMV and up 6% on revenue, reflecting an increase in sales conducted with partner organizations that are fully reflected in GMV. This includes a $4.5 million, or $0.14 per share non-cash gain from the reduction in fair value of the Bid4Assets earn-out liability as the expectation of the timing of real estate asset flows continued to shift outside of the earn-out period. Non-GAAP adjusted EPS for the fourth quarter was $0.19, including approximately $0.03 of unfavorable impact to tax expense in the quarter for estimates of stock-based and other variable compensation. Non-GAAP adjusted EBITDA was $12.3 million, up from the same quarter last year, primarily due to the higher revenue and reduced variable compensation expense versus the fourth quarter of last year to close out fiscal year 2022. We hold $97.9 million in cash, cash equivalents and short-term investments. In the near term, our quarterly results can experience uncertainty in predictability as the current macroeconomic environment lends itself to hesitation by sellers and buyers in the timing of transactions for surplus assets in any given period. Relative to the fourth quarter of fiscal year '22 sequentially, seasonality is a factor as GovDeals' GMV may experience a seasonal decline sequentially going into this next fiscal first quarter. Despite the expected year-over-year improvements in volume and buyer and seller activity, we also expect CAG GMV to decline sequentially on lower purchase transaction volume completed during this last fourth quarter of fiscal year '22. The Retail segment expects to continue to diversify its seller base, transitioning product flows in terms of sellers and categories. Number one, you talked about the GMV being less than or being hit by headwinds on the vehicle side $10 million, and then you mentioned lower conversion rates on real estate. Regarding the comment on the government real estate vertical, what we've observed, Gary, is that local counties have made decisions to defer share of sales in part due to consumer friendly advocacy, which is highlighting some residual COVID policies to allow people to get back current with their real estate forbearance or current recessionary pressures giving policy positions to defer some of these sales. The other thing I would note in the real estate area is, we have a very good pipeline and we have contracts that have been awarded that just haven't been implemented yet, and I think there has been somewhat of a backlog and how government agencies have been able to process their business. So again, part of a larger picture for us is that we do think these things, this logjam will clear out in 2023 and that will give us more visibility and actual GMV traction in the real estate vertical. According to a municipal fleet agency, they have said to us, there is at least 5 million orders on the books for vehicles that have been backlogged industry wide. So it gives you a sense of the order of magnitude that agencies and commercial owners, they want the vehicles, they have the money for the vehicles, it's just they're not being produced at the rate that fulfill their demand. No, that's a great question, and I think it's a very important thing. The GovDeals user experience on the front end has been largely intact for over a decade, and there's a lot of functionality there, but it is not at the same level responsive design and data driven search and one-to-one marketing as you would see on our AllSurplus platform. And therefore, it's really about the front end user experience, it's about the taxonomy and the path to purchase being improved, it's about putting artificial intelligence tools in place like we have in our AllSurplus marketplace to guide buyers to the right assets quickly. We think it's going to improve better participation and we think it's going to improve the ultimate GMV realized, all things equal, for everything we sell and the leverage there is meaningful because it's a good-sized marketplace. So we think as that unfolds in 2023, it's just going to improve the path to purchase and the bidding activity and will improve pricing realized for the assets we sell for our government clients on GovDeals. Well, in terms of the macro trends, one, you want to have robust growth in online sales -- online retail. And that is the catalyst for our business, because the more that's sold online, as I noted, the NRF data, the more that's going to be returned, so over $150 billion of return system in the holiday season. In terms of the retailers themselves, I think retailers are kind of balancing wanting to have good deals and stock and we all got emails probably in October for holiday sales. But I think as you get out of the holiday season, you're going to see normalization of flows into our reverse supply chain, and I think retailers are going to be looking to be continuing to invest in omnichannel experiences, continuing to invest in convenience through their core e-commerce platforms. And ultimately, we think that's helpful for us, the more spending on goods, the better we -- we have commented, George, how during the course of 2022 people have shifted their behavior from buying goods to buying services and experiences. And I commented earlier in the year that we feel like that's going to reverse and people will normalize their spending behavior in 2023.So I don't have the crystal ball, are we going to have a soft landing as the Fed tightens or something that's a little harsher. And I think if retailers have to cut costs and hollow out their corporate resources, they'll be more reliant on value-added services and facilities that Liquidity Services offer. Well, we -- yeah, well, I can tell you that we've had conversations with wholesale automotive dealers who are looking, in many cases, for the first time to utilize our marketplace platform and create a new channel for Liquidity. If vehicles are sitting unsold, that's not a good thing for these automotive wholesale dealerships. So we present our marketplaces another avenue for that asset class to be monetized, and we sell, as you know, a lot of vehicles in the used market and that Liquidity is an asset for anyone looking to manage their balance sheet in the vehicle industry. And last question, I don't know if it was simply a throwaway line in your text, but you mentioned expanding mindshare with customers this year and that being a focus. Well, we've invested in expanding our corporate communications team to do, I think, very targeted brand awareness campaigns with these large corporate clients, and in many cases, government organizations to bring them the receipts, if you will, on the work that we've done, the actual transactions that we've completed. And so its content that's created and then delivered through very targeted communication to influencers and decision makers that may not necessarily be direct clients of ours, but have oversight of the supply chain, operations, the CFO's office, the compliance office within global manufacturers, global retailers, government agencies and that might be delivered digitally, and it might deliver you to a case study or landing page and allow you to learn more. We also have industry specific insights that we're delivering, for example, in automotive, energy and biopharma that gives you I think relevant data on the market making activity in those areas. So if you're CFO, I think it's really helpful to know what amount of balance sheet can I monetize to raise capital in a period where maybe we have to pull back some of our spending. So we are really just linking the data of our marketplace with insights and delivering that in a scalable way through a lot of digital marketing activities and we do have recognition happening, George, through sustainability awards, through vendor excellence awards with many of our clients, and those are shared through more of a traditional corporate communications, press release format. That's fair and the headcount associated with operationalizing his ideas, we've already accounted for. I mean, last year, you said, you were going through a -- another kind of spending investment on sales, technology et cetera. I mean, your sales were up 8% last year. In terms of the investments in expanding staff and operational capacity, you're correct, we took a step-up in fiscal '22. I mentioned, we have three new facilities that we funded essentially over a 12 month period to support demand in the Retail segment in terms of the sales team and coverage. And it is an e-commerce platform, but we also know that having access to our team and our insights, that's helpful in attracting new clients and organizations, both in the government market and the commercial market. So areas like Florida, Southeast region, which has had a huge migration in terms of population, and therefore, flush with municipal revenues, that's an area that's under penetrated for us. And when I talked about the GovDeals monetization, we're leveraging technologies that we've already deployed to other places within Liquidity Services. So we're always looking to be prudent and acquisitive if we can get great engineering talent through direct hires or outbound hires, but we don't see structurally any major step function increases in our spending."
}