{
    "symbol": "UMC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 14:27:06",
    "content": " Despite softening demand in consumer end markets, strength in certain wireless communication area drove further expansion in our 22/28 nanometer business, which accounted for 25% of overall third quarter revenue and lift wafer average selling price. Well, I mean, we -- after the quarter from last quarter, given the rising macro uncertainties and ongoing inventory correction, like I said, in the PC and the smartphone space and as well as the high inflationary cost pressure and we do foresee the semi and foundry industry will decline in 2023 now. And while this inventory correction continued to worsen and our customers are trading this LTA, while theyâ\u0080\u0099re trading it seriously, but they are reprioritized on their product mix and reflect the end markets as well as minimize the -- in order to minimize some of the obligation to avoid some of the LTA penalties. Next question, Gokul Hariharan, JP Morgan. Thatâ\u0080\u0099s my first question. We -- however, the lighter 8-inch utilization in Q4, I mentioned, it was impacted by the continuous mobile and TV inventory correction and our 12-inch product portfolio come with a more higher differentiation with the leading specialty technology as well as some of the diversified market segment and sub-segment. Thatâ\u0080\u0099s my first question. So which means that given the current 90% utilization rate, you have no plan to change your pricing or for the first quarter next year, most likely is going further south and you have no plan to change your pricing assumption as well. Well, I mean, with -- like the -- Bruce just asked earlier, is our target to reaching greater than 40% by 2025 with that revenue can come from the mega trend. Thatâ\u0080\u0099s my first question. Well, we currently -- we are investing in growing our 28/22 technologies, like you said and along with the capacity expansion because we believe -- we expect the increase of market potential with increase in customer adoption. Next question, Gokul Hariharan, JP Morgan."
}