{
    "symbol": "RBA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 18:04:08",
    "content": " So overall, we are very pleased with our second quarter growth, given the very low levels of useful equipment in the market and the FX headwinds to GTV due to the strong dollar total service revenue increased 13% compared to last year on an organic basis, excluding the impact of smart equip total service revenue increased approximately 11% total service revenue continues to exceed total GTV growth in line with the evergreen model laid out at the 2020 investor day. And the overall mix of equipment with regards to earnings are adjusted EBITDA increased 11% on strong revenue performance, even with the impact of higher SGNA costs, which was expected as we continually to prudently invest in our growth initiatives and marketplace vision. Last year, we expect the effect of tax rate, excluding the impact of adjusted items to be between 25 to 27% for the full year corresponding to a GAAP tax rate of 22% to 24% turning now to our oxygen and marketplace segment A&M services revenue increased 11% and our A&M take rate or A&M service revenue is a percentage of total GTV came in at a robust 14% for the quarter up approximately 10 basis points compared to last year, the increase was primarily driven by an uplift in the buyer fee. Additionally, like many companies we're seeing inflationary pressures on our operating costs, as it relates to labor, durable goods, consumables, and travel, the team is working hard to offset these increases through improved productivity, and we will remain diligent in managing our costs within an acceptable range for the third quarter of 2022, we expect our SG&A expenses exclusive of share based payments and non-recurring expenses to be between $128 million and $133 million turning to cash flow and liquidity. We're trailing 12 months operating free cash flow of 428 million, which is 179% of our non-GAAP adjusted net income delivering well above our stated evergreen model target at the end of the quarter, our adjusted net debt to TTM non-GAAP adjusted EBITDA ratio with 0.7 X, as Anne also mentioned, we are very pleased to announce an 8% increase in our quarterly dividend to $0.27 delivering on our stated capital allocation priorities of growing dividends. When we when this team set forward our 20 our new strategic plan in 2020 about becoming the global trusted marketplace for insight services and transaction solutions, the commitment we made in the evergreen model was to take that growth rate, go from low single digits to mid-single digits, to high single digits, to low double digits, that kind of thing, and how we got there and how we're continuing to get there as a test and learn model. When times are tough and equipment is tight prices go up great when times are, loose and equipment and equipment comes to us, prices go down, we're naturally hedged, however, in no way, shape or form, does the pricing ever offset the volume for us because of the services you hit the nail on the head services because we can't attach, if we only have one piece of equipment to sell and it's prices up, we can't attach multiple services to that piece of equipment. And then I guess, if we look at the SJ, a commentary in terms of the different initiatives that you're working on in the press release seems to be quite a, quite a few things that are going on, I guess, from your perspective, where are you looking to direct capital kind of what are the big bucket spending items that we should expect over the next four to six quarters in terms of whether there's investment specific capabilities or other functional, whether it's hiring, just want to get some perspective on that. And so the way we think about capital deployment is obviously returns and being very, very flexible, whether they are organic growth initiatives, like the yards, like the sales coverage model, like Richie Brothers financial services, and I can keep going on and on like the technology investments that we are making to ensure that this digital marketplace is robust, healthy allows us to be even lower the friction and doing business with our customers. But then as Jim said, open up new revenue streams for us, and then obviously the flexibility of M&A and as Eric said, we're, we're below our kind of leverage ratio if you will, when we when the Euro deal Euro auction deal didn't happen, but we remain very bullish on that ability for this business to scale through either M&A organic or technology investments. And so whether it's something like a Euro auction where it just gave us, almost overnight a significantly enhanced coverage model on which we can then sell services, all of these kinds of things that business wasn't doing or whether it's Ralph an incredible data business, allowing us to leverage the footprint of Richie brothers to be able to help that business grow, but then also leverage routes in kind of helping our own understanding of the industry as we do at risk deals or anything else or a smart equip that allows us to tap into the parts and service ecosystem by actually making it better for our dealer partners to attach parts at the time of purchase. So kind of from that anemic, very low single digits to mid-single digits, to high, to low double digits and how those pieces come together is by the various pieces that are all under Jim's purview as president, I think Richie brothers financial services is the perfect example of how they're thinking about the world. But what's also great about it is if you're the second, third bidder in any of our auctions, and you still need to go out, find an equipment, because you have a job coming up, their ability to use Richie Brothers financial services and that transaction as we've been going through this tough supply time, we're seeing a lot more of that taking place."
}