{
    "symbol": "CZOO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 17:37:02",
    "content": " Whilst the challenging macroeconomic backdrop for the U.K. consumer has impacted demand across most retail sectors and our competitors, with many businesses reporting declining demand and sales in recent months, we bugged the trend and seen record demand with U.K. retail unit sales growing over 100% year-on-year to 18,889 units as consumers continue to embrace our offering. In Q3, we made strong progress on our operating metrics, including our U.K. retail GPU, which was up 58% compared to Q2 '22 at the same time as reducing our U.K. SG&A per retail unit by 30% versus Q2. At the same time that our U.K. retail GPU is increasing steadily quarter-on-quarter, we've seen a material decrease in our U.K. SG&A cost per unit of over 30% in Q3 as our strong growth, combined with our focus on cost control, is starting to have a notable positive impact on our unit economics. As we've said previously, the U.K. market opportunity is so large that with just a 3% market share and a prudent medium-term GPU target of Â£2,000, we would generate gross profit of close to Â£0.5 billion annually and meaningful free cash flows. Despite the weak macroeconomic environment affecting growth amongst our peers and across all other retail sectors, we've maintained our very strong Q3 momentum into October, where we expect to maintain our growth rate of over 100% year-on-year and to continue to increase our market share. We expect to see continued strong progress through the remainder of Q4 with U.K. retail unit sales growth continuing at over 100% year-on-year, along with significant further improvements to our U.K. retail GPU as we continue to optimize our operations, increase the proportion of cars sourced directly from consumers, lower our reconditioning costs and increase our financing and ancillary revenue streams. So in summary, against a very tough economic backdrop, we've had a very strong quarter of growth, achieving record sales levels, taking significant market share, and we've become one of the biggest players in the market, having sold almost 100,000 cars entirely online in less than three years since our launch. When we're thinking about pricing for retail units for the remainder and maybe into the early half of next year, I think you've already saw a 3% quarter to quarter decline in Q3."
}