{
    "symbol": "AKYA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 00:00:04",
    "content": " We reported record revenue of $21.2 million in the fourth quarter and $74.9 million for the full year of 2022, a 36% growth over the prior year. As Brian highlighted, the total revenue for the fourth quarter of 2022 was a record $21.2 million, 31% growth over Q4 2021 and full year revenue was $74.9 million, 36% growth over full year 2021. Product revenue, which includes instruments, reagents and software was $15.7 million for the fourth quarter and $57.7 million for the full year, representing 30% growth over full year 2021. Instrument revenue was $11.1 million for the fourth quarter and $38.6 million for the full year, representing 35% growth over full year 2021. As of yearend 2022, a total of 120 Fusion instruments have been shipped since the full commercial launch at the start of the year and we now have a total installed base of 105 for the combined PhenoCycler Fusion system sold either directly as a combined system or upgraded from a previous standalone PhenoCycler instrument. Reagent revenue was $4.5 million for the fourth quarter and $18.4 million for the full year, representing 29% growth over full year 2021. With an annualized pull-through in the mid-$30,000 range per instrument for the PhenoCycler and the PhenoImager HT, we project the pull-through to increase significantly by as much as 2 times to 3 times over the next several years as more PhenoCycler Fusion are up and running, along with our rollout of new consumable offerings and instrument field upgrades. The new highly optimized PhenoCode signature panels and higher plex PhenoCode discovery panels, which will be rolled out throughout 2023, will not only contribute meaningfully to pull-through and accelerate time to answer, but weâ\u0080\u0099ll also increase our share of reagent revenue as the panels are wholly offered through Akoya as ready-to-use. Services and other revenue totaled $5.5 million for the quarter and $17.2 million for the full year, representing an increase of 65% over full year 2021. With significant investments on business expansion efforts throughout 2022, we have laid the groundwork for the commercial rollout of the PhenoCode panels throughout the year, field upgrades for the PhenoCycler Fusion, partnered software expansion and a full end-to-end discovery to clinical workflow. To summarize, we had another record-breaking quarter with $21.2 million in revenue and $74.9 million for full year 2022, 36% growth over the prior year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}