{
    "symbol": "AKYA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 22:38:04",
    "content": " We remain focused on the following targeted initiatives for the balance of the year: first, drive the continued adoption of the PhenoCycler-Fusion as the best-in-class in C2 imaging platform for the spatial discovery market; second, drive further workflow and speed improvements as well as launch additional protein panels, RNA capabilities and our new universal chemistry. So that's the value to the customers, the value to us, it really drives pull-through because we're getting antibody and detection reagents and we're hopefully driving increased utilization as that universal chemistry gets to launch becomes more prominent. And on the high plex RNA side, one of the reasons why we look at -- we've talked about on prior calls and that Joe alluded to, one of the reasons why we look at the attractiveness of the PhenoCycler-Fusion pull-through isn't just because we're scaling up the speed, we're scaling up the protein plexing, but also that we're going multi-omics, we'll be layering in our own RNA reagents. And it's -- I'm going to take some liberties to pull back a little bit and say there's no dialog in the marketplace around products that sometimes unless you're kind of living in the forest in the weeds like we are, maybe you don't see the forest. So there's going to be an existing population of customers that may want to do readouts on other methodologies like a sequencing-based readout, but I think that's a small minority in the future, maybe 10% of spatial on the discovery side. And I think what you're going to see is that that's going to be the growing market requirement that people recognize, I think as -- I think as Neil was asking, as people recognize that to get real high powerful spatial data, imaging is the way to do that. I would say per Joe's prior comment, while we -- as you noted, while we've got a really diversified portfolio that hits across multiple market segments, instruments, reagent software services, that gives us lots of opportunities for growth, and we're hitting across all of those. A lot of great benefit kind of viewed by the customers because it's kind of -- it's a really clean hand off, Mark, because we've got this high-volume, high-quality CLIA-based service lab, generating real high-value data. And as we start layering in RNA and multi-omics and people seeing where we're going, I think the existing capabilities and what we're doing in the future, I think, are giving our customers a lot of hope that purchasing the PhenoCycler-Fusion as an example, is a powerful box today that's also future-proof that we're going into multi-omics. It's going to be really the central pillar of a single purchase, where you can -- as I noted in my opening comments, where you can discover with the PhenoCycler and the Fusion in a multi-omic fashion or protein-only or an RNA-only, you can do discovery and then you can use the fusion as a stand-alone to validate."
}