{
    "symbol": "DQ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 13:13:04",
    "content": " So today, I will read -- so before we begin, the formal remarks, I would like to remind you that certain statements on today's call, excluding expected future operational and financial performance and industry growth are forward-looking statements that are made under the Safe Harbor provisions of the U.S. Our annual polysilicon production volume 33,812 metric ton in 2022, exceeding our guidance of 130,000 to 132,000 metric ton and a 54.5% higher than the 86,587 metric ton produced in 2021. Thanks to the robust demand for solar PV products globally, polysilicon ASPs increased by approximately 50% year-over-year from $21.76 per kg in 2021 to $32.54 per kg in 2022.As one of the most profitable and fastest-growing polysilicon manufacturers in the world. Gross margin improved to 74.0% in 2022 from 65.4% in 2021, and net income attributable to our shareholders was US$1.86 billion in 2022, an increase of 148.4% compared to US$749 million in 2021. As a result of the above, net income attributable to Daqo New Energy Corp shareholders was $372.9 million, compared to $223.4 million in the third quarter of 2022, a 1.13  million in the fourth quarter of 2021. Adjusted net income attributable to Daqo New Energy shareholder, excluding noncash share-based compensation costs was $403.3 million compared to $590.4 million in the third quarter of 2022 and $143.6 million in the fourth quarter of 2021. The net income attributable to Daqo New Energy shareholders for the year was $1.86 billion, compared to $748.9 million in 2021. For the 12 months ended December 31, 2022, net cash provided by operating activities was $2.46 billion, compared to $639 million the same period of 2022. And for the 12 months ended December 31, 2022, net cash used in investing activity was $1 billion, compared to $782 million in the same period of 2021. And the for the 12 months ended December 31, 2022, net cash provided by financing activity was $1.47 billion, compared to $736 million in the same period of 2021. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. I think we announced our results for 2022, you can see our cash generation, or current cash balance on hand, while I think forecast and the expectations of poly pricing for this year, right, given that you're around US$30 per kilogram. Please go ahead with your question. And in terms of CapEx for 2023, I think for the full year, we're expecting roughly $1.2 billion of CapEx for the full year, of which roughly US$900 million to a US$1 billion is for  in the Mongolia, around US$300 million is for our -- the remaining payment for our Phase 5A Inner Mongolia."
}