{
    "symbol": "DGICA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 22:11:08",
    "content": " The fourth quarter loss ratios were comparable for 2022 and 2021, as higher weather-related losses in the fourth quarter of 2022 were largely offset by a higher benefit of net favorable development of reserves for losses incurred in prior accident years, compared to the prior-year quarter. Weather-related losses totaled $16.5 million, or 7.7 percentage points on the loss ratio for the fourth quarter of 2022. We experienced favorable net development of reserves for losses incurred in prior accident years of $14.2 million, or a   reduction in the loss ratio for the fourth quarter of 2022, compared to $5.3 million, or a   reduction in the loss ratio for the same period last year. Large fire losses contributed 6.2 percentage points to our fourth quarter of 2022 loss ratio, slightly higher than the 5.5 percentage-point impact to the loss ratio of the prior-year quarter, with an increase in commercial fire severity, due in part to higher costs of repairing damaged properties. Moving to claim trends in the quarter, although claim frequency generally remained in-line with historical averages, we continued to see elevated severity trends across most of our commercial lines of business as inflationary pressures continued to drive increases in loss costs, particularly in our property and auto physical damage coverages. The personal auto core loss ratio was elevated, compared to the prior-year quarter due to higher loss severity related to ongoing inflationary impact to loss trends due to supply chain disruption and labor shortage that we have talked about throughout 2022, as well as modestly higher claim frequency from higher driving activity. As for the homeowners line of business, the winter freeze event at the end of December caused a spike in the loss ratio, with weather-related losses comprising 24 percentage points of the homeowners loss ratio in the fourth quarter of 2022, compared to 17.7 percentage points for the prior-year quarter."
}