{
    "symbol": "CM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-01 11:38:02",
    "content": " While our structural expense growth remained in the mid single-digits, investments in strategic initiatives as well as employee-related compensation and a normalization of business development activities drove year-over-year expense growth of 11%. In Canadian Personal & Business Banking, we demonstrated positive momentum with our strongest client growth since 2017, where we added over 350,000 net new clients to our bank, 38% of which are from the affluent segment, almost 3x the index of our market share in that segment. Our client growth and success in franchising drove year-over-year deposit and asset growth of 9% and 12% respectively, which resulted in market share gains versus the big 6 Canadian bank peer group. Our Canadian Commercial Banking and Wealth Management business also demonstrated strong momentum throughout 2022, with loan and deposit growth of 20% and 12%, respectively, along with higher net wealth flows. Revenue of $5.4 billion was up 6%, driven by strong volume growth across all businesses and solid trading partly offset by lower market-related fees. Excluding severance, year-over-year expense growth of 10% was lower than prior quarters in 2022 as our increase in strategic investment starts to peak. Net income in Personal & Business Banking was $485 million, down 20% from the same quarter last year, primarily due to higher provisions for credit losses. Our strategic focus in 2022 resulted in strong net client growth and franchising success, driving net client growth of over 350,000 as Victor covered and growth in loans and deposits of 12% and 9% respectively. Expenses of $1.3 billion were up 13% from the same quarter last year and 3% sequentially, driven by higher strategic investments, including the impact of the acquired co-brand portfolio. Pre-provision pre-tax earnings of $658 million were up 11% from last year benefiting from strong results in Commercial Banking that helped drive 28% growth in NII, net of market headwinds to our wealth management business. Slide 18 shows U.S. Commercial Banking and Wealth Management results in U.S. dollars, where we delivered net income of $125 million, down 42% from the prior year due to higher credit provisions. Over 2022, our strategy allowed us to grow and deepen our U.S. client franchise generating above-market loan and deposit growth 13%, 17% and 7% respectively as well as strong private wealth management net flows in a challenging market."
}