{
    "symbol": "FUBO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 22:00:02",
    "content": " Before we begin, I would like to remind everyone that the following discussion may contain forward-looking statements within the meaning of the federal securities laws, including but not limited to statements regarding our financial condition, anticipated financial performance, including quarterly and annual guidance and cash flow and adjusted EBITDA targets, market opportunity, acquisition strategy and ability to integrate those acquisitions, expected synergies of the technology platforms, business strategy and plans. In Rest of World streaming, we were pleased to end the quarter ahead of expectations with approximately 305,000 total paid subscribers and $5.5 million in total revenue. This was also our first full quarter with volatile in our Rest of World streaming segment, generating $5.5 million of revenue in the quarter on a base of 305,000 subscribers with both metrics ahead of guidance. So the question is really, you raised about $200 million in an ATM in the first quarter at record low share prices and your AMG filing looks like you continue to sell shares after the quarter closed, I'm curious what you expect to continue to do in an ATM to fund the business. I think I mentioned in my in the shareholder letter, that's, according to a recent Nielsen survey 64% of surveyed were unhappy that they're not able to find the content that they're looking for, which is very interesting because when we had started this business back in '17, '18, I remember there was a survey that came out this is 64% of people very unhappy with cable because it was for whatever reason, expensive, the ads, etcetera, but it looks like we're coming full circle. Even with the step down sequentially in terms of the full-year guidance we're hovering around 30% growth in the marketplace at least obviously on the, on the traditional side which is declining and so we feel great about our market share gains, even assets, but I'll just throw it out there as well in terms of just with the path we need to get to if you think about profitability."
}