{
    "symbol": "MTD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 22:59:12",
    "content": " We are very pleased with these results, particularly since our operating profit increased almost 50% and our margins were up more than 400 basis points in the first quarter of last year. For the full year 2022, we now expect local currency sales growth to be approximately 8%. We expect full year adjusted EPS to be in the range of $38.20 to $38.50, which is a growth rate of 12% to 13% and a growth rate of 16% to 17%, excluding foreign currency. For the second quarter, based on market conditions today, we expect local currency sales growth of approximately 7% and expect adjusted EPS to be in a range of $8.70 to $8.80, a growth rate of 7% to 9% and growth of 11% to 13%, excluding currency. With respect to the impact of currency on sales growth, we expect currency to decrease sales growth between 3% and 4% for the full year and decreased sales between 4% and 5% in Q2. And kind of behind that, we would be assuming about a 4% price realization for the full year, which is a little bit better than what we were looking at last quarter when we spoke, which we were saying about 3.5%. I mean if you look at - we're talking margins, it's also important to look at our full year operating margin, which we think currency neutral will be up about 100 basis points, which we're pretty happy with because that's pretty much the top end of our typical guidance. In terms of the guidance, Rachel, we're looking at high single-digit growth for Q2, that compares to 35% growth last year in Q2, and for the full year, we're still maintaining our full year guidance of approximately 10%. The same, by the way is to for the software company that we acquired last year Scale-up Systems, that also helps to drive a lot of sales in the AutoChem business and just choose that when you bring these smaller companies in, and you're the right partner for them with the right portfolio that again makes accelerated growth. And then, for China, as I already mentioned, we're guiding high single digit for Q2, and approximately 10% for the full year."
}