{
    "symbol": "MTD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 10:48:04",
    "content": " Laboratory sales increased 15%, Industrial increased 10%, including 12% growth in Core Industrial and product inspection up 7%. SG&A amounted to $242.2 million, a 6% increase in local currency over the prior year, which includes increased investments in sales and marketing. We're very pleased with this adjusted EPS growth, especially given that adjusted EPS was up more than 50% in the second quarter of last year. Finally, as you think through our sales guidance, keep in mind, our sales growth will be reduced by approximately 1% for the remainder of the year due to sales in Russia. For the full year 2022, we now expect local currency sales growth to be in the range of 9% to 10%. We expect full year adjusted EPS to be in the range of $38.85 to $39.05, which is a growth rate of 14% to 15% and a growth rate of approximately 19%, excluding currency. For the third quarter, based on market conditions today, we expect local currency sales growth of approximately 8% and expect adjusted EPS to be in a range of $9.75 to $9.85, a growth rate of 12% to 13% and a growth of 18% to 19%, excluding currency. With respect to the impact of currency on sales growth, we expect currency to decrease sales growth by approximately 4.5% for the full year and decreased sales about 6% in Q3. Sales in Europe increased 4% in the quarter, about as we had expected and against the 23% growth in the prior year. So as we kind of think about the second half of the year, right now, we're thinking about price realization in the 5% range or so, which would kind of put us at about 4.5% on a full year basis, which is a little bit higher than our guidance. And as a reminder, we grew 35% in the second quarter of last year, so really exceptionally strong growth. We saw the growth across our Lab business in China with almost 20% sales growth, which is remarkable also given about 40% sales growth we delivered in the second quarter of last year."
}