{
    "symbol": "MTD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 12:29:07",
    "content": " Specifically, we expect currency to be a headwind to adjusted EPS growth in the fourth quarter of approximately 10% and 6% for the full year. At the time of our last earnings call, we had expected earnings -- we had expected currency to be a headwind to fourth quarter adjusted EPS growth of approximately 6% and 4.5% for the full year. With respect to the fourth quarter, we would expect local currency sales growth to be approximately 7% and adjusted EPS to be in the range of $11.55 to $11.65. For the full year 2023, based on our assessment of market conditions today, we would expect local currency sales growth to be approximately 5% and adjusted EPS to be in a range of $42 to $42.40, which represents a growth rate of 8% to 9%. For 2023, we expect free cash flow in the range of $900 million, which represents a growth rate of 19% on a per share basis and a conversion rate of 97% on -- of net income. At todayâ\u0080\u0099s foreign exchange rates, currency would reduce our sales growth by an additional 4% for the full year 2023. As you think about our longer term -- as you think about the longer term years, we very strongly believe that favorable market dynamics, our growth initiatives and our improved business mix is supportive of our long-term growth algorithm of 6% plus local currency sales growth and mid-teens earnings growth. For our Core Industrial business, we estimate mid single-digit growth for Q4, which would be approximately 10% growth for the full year and low-to-mid single-digit growth for 2023. And for Food Retailing, we estimate approximately 10% growth in Q4, which would be about low single-digit growth for the full year and mid single-digit growth for 2023. For Europe, we are estimating low-to-mid single-digit growth in Q4, which would be mid single-digit growth for the full year and low single-digit growth for 2023 and then for China we are estimating approximately 10% growth in Q4, which would translate to double-digit growth for the full year and we estimate high single-digit growth in 2023. We see our sales team, as we said in the remarks, also really fully leveraging the Spinnaker tools to really reach out to customers and capture the fast growing segments in China, as well as a lot of momentum behind for some electrical vehicles, battery segment, the lithium-ion segment, but we are also seeing still very good growth in pharma and biopharma in China."
}