{
    "symbol": "FEIM",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-09 20:09:10",
    "content": " For the 6 months ended October 31, 2021, consolidated revenue was $26 million compared to $27 million for the same period of the prior fiscal year. Revenues from non-space US Government and DOD customers, which are recorded in both the FEI-New York and FEI-Zyfer segments, were $10.6 million compared to $10.9 million in the same period of the prior fiscal year and accounted for approximately 41% of consolidated revenue compared to 40% for the prior fiscal year. R&D expense for the 6 months ended October 31, 2021 and 2020 increased to $2.7 million from $2.2 million, an increase of $500,000 and were 11% and 8% of consolidated revenue. For the 6 months ended October 31, 2021, the company recorded an operating loss of $1.4 million compared to an operating loss of $120,000 in the prior year. It is important to mention that for the 3 months period ending October 31, 2021, the company reported an operating profit of $303,000, a significant improvement from the first quarter. Other income - I'm sorry, for the 6 months ended October 31, 2021, the company recorded an operating loss of $1.4 million compared to an operating loss of $120,000 in the prior year. For the 6 months ended October 31, 2021, investment income included $123,000 dividend from Morion compared to $105,000 dividend from Morion in the same period in fiscal '21. For the 6 months ending October 31, 2021, the company recorded a tax provision of $2,000 compared to $25,000 for the prior fiscal year. Consolidated net loss for the 6 months ending October 31, 2021, was $1.1 million or $0.12 per share compared to $67,000 of net income or $0.01 per share in the previous fiscal year. Our fully funded backlog at the end of October 21 was approximately $38 million, down approximately $2 million from the previous fiscal year ended April 30, 2021. The company's balance sheet continues to reflect the strong working capital position of approximately $40 million on October 31, 2021, and a current ratio of approximately 5 to 1. But over the past 3 or 4 or 5 years, we've talked about bids out there for $500 million, $600 million, $700 million worth of possible orders and we were hoping that maybe we'd get half of those."
}