{
    "symbol": "FEIM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-13 17:57:08",
    "content": " For the fiscal year ended April 30, 2022, consolidated revenue was $48.3 million compared to $54.3 million for the same period of the prior fiscal year. The components of revenue are as follows: revenue from commercial and U.S. government satellite programs was approximately $26.1 million or 54% compared to $27 million or 50% in the same period of the prior fiscal year. Revenues from non-space U.S. Government/DOD customers, which are recorded in both the FEI-New York and FEI-Zyfer segments, were $19.6 million compared to $24.8 million in the same period of the prior fiscal year and accounted for approximately 41% of consolidated revenue compared to 46% for the prior fiscal year. For the fiscal year ended April 30, '22, gross margin and gross margin rate decreased as compared to the same period in fiscal year '21. For the fiscal year ended April 30, '22 and '21, selling and administrative expenses were approximately 24% of consolidated revenue. R&D expense for the fiscal year ended April 30, '22 and '21 increased to $5 million from $4.7 million, an increase of $300,000 and were approximately 10% and 9% of consolidated revenue. For the fiscal year ended April 30, '22, the company recorded an operating loss of $8.1 million compared to an operating loss of $1 million in the prior year. Included in other income expense for the fiscal year ended April 30, '22 is a $795,000 impairment charge related to the company's investment in Morion. Included in other income expense for the fiscal year ended April 30, '21 was a collection of a $1 million note that was due relating to the company's sale of its Belgium subsidiary to a European entity in 2018. This yields a pretax loss of approximately $8.7 million compared to $500,000 pretax income for the prior fiscal year. For the fiscal year ending April 30, '22, the company recorded a tax provision of $1,000 compared to a tax benefit of $204,000 for the prior fiscal year. Consolidated net loss for the fiscal year ended April 30, '22 was $8.7 million or $0.93 per share compared to $680,000 of net income or $0.07 per share in the previous fiscal year. Our fully funded backlog at the end of April 30, '22 was approximately $40 million. The company's balance sheet continues to reflect the strong working capital position of approximately $34 million at April 30, '22 and a current ratio of approximately 2.5 to 1."
}