{
    "symbol": "DSGX",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-02 00:36:06",
    "content": " These forward-looking statements include statements related to our assessment of the current and future impact of the COVID-19 pandemic and Russia, Ukraine context on our business and financial condition; Descartes' operating performance, financial working conditions; Descartes margins and any growth in those gross margins; cash flow and use of cash, our application to commence a normal course issuer bid and potential purchases pursuant to such bid or business outlook; baseline revenues, baseline operating expenses and baseline calibration; anticipated and potential revenue losses and gains; anticipated recognition and expensing of specific revenues and expenses; potential acquisitions and acquisition strategy; cost reduction and integration initiatives and other matters that may constitute forward-looking statements. Consistent with past quarters, our revenue mix in the quarter continued to be very strong, with services revenue increasing 16% to $102.8 million or 88% of total revenue, compared to $88.3 million in the same quarter last year. License revenues came in at $2.3 million or 2% of revenue in the quarter, up from license revenues of $1.3 million in the first quarter last year, while professional services and other revenue came in at $11.3 million or 10% of revenue, up 23% from $9.2 million in the same period last year as a result of increased  service engagements. As a result, we continue to see strong adjusted EBITDA growth of 23% to a record of $51.2 million or 44.0% of revenue for the quarter, up from $41.5 million or 42.0% of revenue in the first quarter last year. With these strong operating results, cash flow generated from operations came in at $44.4 million or approximately 87% of adjusted EBITDA in the first quarter, up 9% from operating cash flow of $40.9 million in Q1 last year. Nothing that's happened in Q1 or that we're seeing right now has had us change our financial and investment plans for this fiscal year, but we're going to be cautious in executing on those plans while we continue to monitor and evaluate the impact on our business and our customers' businesses from the market items I identified earlier. If you take that note, if you consider the fact there's a currency headwind of just under $2 million, our organic growth, would -- I'd estimate it somewhere between 12% and 13% in Q1 over Q1 last year, so double-digit organic growth is what we're seeing. So I don't want that you're just going to bring, but I think we're pretty well-positioned if things do take a downturn and probably in a good position, given our cash and our ability to generate income going forward to take advantage of it if things do turn down, right, to pick up assets at lower prices than we've been asked to pay over the last 5 or 6 years, and we think a lot of these private companies are selling for more than their worth, and that's been frustrating to us. What I do see happening more and more, and I think it's probably going to happen with a lot more of the world's products is that they're going to be produced in different locations around the world and not because they're trying to get any closer to the customers, but because they are trying to find cheaper locations to manufacture and China is becoming more expensive right now."
}