{
    "symbol": "DSGX",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-07 19:31:06",
    "content": " We had record adjusted EBITDA of $54.5 million, up 13% from a year ago, driven by double-digit organic growth in our recurring revenue -- recurring services business. Our revenues would have been $5 million higher if we used last yearâ\u0080\u0099s FX rates, up 16% from the same quarter last year. Our adjusted EBITDA would have been approximately $1 million higher using last yearâ\u0080\u0099s FX rates, up 15% from the same quarter last year. We are pleased to report quarterly revenue of $121.5 million this quarter, an increase of 12% from revenue of $108.9 million in Q3 last year. As Ed mentioned earlier, excluding the impact of FX changes, our revenue would have been approximately $5 million higher, and our growth rate on an FX-neutral basis would have been closer to 16% over the same period last year. Sequentially, the impact was also quite large from FX with almost a $2 million negative impact from foreign exchange from the second quarter to the third quarter this year, which is the largest sequential impact that weâ\u0080\u0099ve seen in our business. Our revenue mix in the quarter continued to be very strong, with services revenue increasing 13% to $110.1 million compared to $97.2 million in the same quarter last year, increasing to 91% of total revenue in the quarter compared to 89% of revenue in Q3 last year. Again, looking at FX, on a constant currency basis, we would estimate that our growth in services revenue from new and existing customers would have been just over 11% this quarter when compared to the same quarter last year. License revenue came in at $1.1 million or less than 1% of revenue in the quarter, down from license revenues of $1.4 million in the third quarter last year and also down from license revenue of $3.3 million in Q2 as we had a couple of large -- unusually large license deals closed last quarter. Finally, professional service and other revenue came in at $10.3 million in both the third quarter this year as well as the third quarter last year as higher professional services revenue was offset by slightly lower hardware revenue this quarter. Operating expenses increased by approximately 12% in the third quarter over the same period last year, and this was primarily related to the impact of recent acquisitions but also from additional labor-related costs as we continue to invest in various areas of business. So, as a result of both revenue growth, strong cost control, offset partially by our planned investments in the sales and marketing areas of the business, we continue to see strong EBIT -- adjusted EBITDA growth of 13% to a record $54.5 million or 44.9% of revenue, up from $48.2 million or 44.3% of revenue in the third quarter last year. And while we continue to be fairly naturally hedged to foreign currencies, with a sharp decrease in both the British pound and the euro to the U.S. dollar in the third quarter, we did experience a negative impact on our adjusted EBITDA of approximately $1 million in the quarter compared to the same period last year. For the first three quarters of the year, adjusted EBITDA has increased by 18% to $160 million from $136 million in the same nine-month period last year. With these strong operating results and strong AR collections, cash flow generated from operations came in at $50.9 million or 93% of adjusted EBITDA in the third quarter, an increase of 18% compared to operating cash flow of $43.3 million in the third quarter last year. For the nine months year-to-date, operating cash flow has been $142 million or 89% of adjusted EBITDA, up from $131 million in the same nine-month period last year. We should also note that the income tax expense for the third quarter came in at $9.0 million or approximately 25% of pretax income, which is fairly close to our statutory or expected tax rate. But it is much higher than the tax expense of $2.1 million or only 8% of pretax income that we experienced in the first -- sorry, in the third quarter of last year when we benefited from the reversal of certain valuation allowances. With our higher operating profits offset by the higher income tax expense, from a GAAP earnings perspective, net income came in at $26.5 million or $0.31 per diluted common share in the third quarter compared to $25.5 million or $0.30 per diluted common share in the third quarter last year. Net income for the nine-month year-to-date period was $72.5 million or $0.84 per diluted common share compared to $67.1 million or $0.78 per diluted common share last year in the first nine months, again with higher operating profits being partially offset with higher income tax expense. As of November 1, 2022, using foreign exchange rates of $0.74 to the Canadian dollar, $0.99 to the euro and $1.15 to the pound, we estimate that our baseline revenues for the fourth quarter of 2023 are approximately $108 million, and our baseline operating expenses are approximately $67 million."
}