{
    "symbol": "DSGX",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-07 20:56:05",
    "content": " These forward-looking statements include statements related to our assessment of the current and future impact of geopolitical and economic uncertainty on our business and financial condition; Descartes' operating performance, financial results, and condition; Descartes gross margins and any growth on those gross margins; cash flow and use of cash; business outlook; baseline revenues; baseline operating expenses; and baseline calibration; anticipated and potential revenue losses and gains; anticipated recognition and expensing of specific revenues and expenses; potential acquisitions and acquisition strategy; cost reduction and integration initiatives; and other matters that may constitute forward-looking statements. We generated $46.4 million in cash from operations or 86% of our adjusted EBITDA and this number could have been higher, but was reduced since $5.3 million in earnout consideration from past acquisitions was classified as cash used in operations. We are pleased to report record quarterly revenue of $123.0 million this quarter, an increase of 18% from revenue of $104.6 million in Q2 last year. Excluding the impact of FX changes, our revenue would have been almost $4 million higher and our growth rate would have been closer to 21% over the same period last year. Looking at the numbers further, our revenue mix in the quarter continued to be very strong, with services revenue increasing 70% to $109.4 million compared to $93.5 million in the same quarter last year, and consistent at 89% of revenue in both periods. License revenue came in at $3.3 million or just under 3% of revenue in the quarter, up from license revenues of $1.2 million in the second quarter last year as we had a couple of larger license deals close during the quarter. Professional services and other revenue came in at $10.3 million or 8% of revenue in the second quarter and so for the first half of this year, revenue came in at $239.4 million, an increase of 18% from revenue of $203.4 million in the first six months of last year. Operating expenses increased by approximately 20% in the second quarter over the same period last year and this was primarily related to the impact of recent acquisitions, but also from additional labor related to costs as we continue to invest in the areas of our business as Ed described. In particular, sales and marketing expenses were higher by approximately $3 million, increasing from 11% of revenue in Q2 last year to 12% of revenue in the current quarter as a result of the additional headcount added in this area as previously planned. So, as a result of both revenue growth offset slightly by our planned investments in the business, we continue to see strong adjusted EBITDA growth of 18% to a record of $54.0 million, up from $45.9 million and consistent at 43.9% of revenue in both the second quarter of last year as well as the current quarter. For the six months year-to-date, adjusted EBITDA came in at $105.2 million, or 44% of revenue, up from just over 20% from $87.4 million or 43% of revenue last year. With these strong operating results and strong collection from customers, cash flow generated from operations came in at $46.4 million or 86% of adjusted EBITDA in the second quarter. For the six months year-to-date, operating cash flow has been $90.8 million or 86% of adjusted EBITDA, which again would have been closer to 91% of adjusted EBITDA without the impact of those additional earnouts that I just mentioned. We should also note that the income tax expense for the second quarter came in at $8.8 million or 28% of pre-tax income, which is close to our blended statutory tax rate. It is also much higher than the tax expense of $2.7 million, or only 10% of pre-tax income in the second quarter last year, when we benefited from the reversal of certain valuation allowances. With our higher operating profits offset by the higher income tax expense, from a GAAP earnings perspective, net income came in at $22.9 million or $0.27 per diluted common share in the second quarter consistent with net income of $23.2 million or $0.27 per diluted common share in the second quarter last year. Overall, we are once again very pleased with our operating results in the quarter and a strong organic growth and solid performance from our recent acquisitions resulted in 18% growth in both revenue and adjusted EBITDA for the quarter, while we continue to invest nicely in our business. While we generated $46 million in cash flow from operations, we also used approximately $61 million of our existing cash balances in the second quarter to complete the acquisition of XPS, while also using cash to pay out certain earn out payments related to past acquisitions. As of August 1st, 2022, using foreign exchange rates of $0.78 to the Canadian dollar, $1.02 to the euro, and $1.22 to the pound, we estimate that our baseline revenues for the third quarter of 2023 are approximately $107 million and our baseline operating expenses are approximately $66.5 million. We consider this to be our baseline calibration of approximately $40.5 million for the third quarter of 2023 or approximately 38% of our baseline revenues as at August 1st, 2022."
}