{
    "symbol": "TREE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 15:42:05",
    "content": " So first off, as I alluded to in my remarks, there's -- and we've talked about -- and a lot of shareholders, by the way, missed this, you're picking up on something that is refi received and the RPLs of refi, obviously, everything works on supply and demand. So, in a strange way, what's really happening is over the last couple of years, our network has gotten healthier, meaning, there's less inefficiency for our lender partners because they're getting what they want. So -- and we've talked in the past, in this quarter about home, for example, while our RPLs are doing well, the customer acquisition cost, while still very profitable, we're not seeing relief like we would normally see when rates go up, we're still seeing a number of other parties that are in those options, keeping pricing up higher in Google and others. And that's the point where we have better levers where we're making more monetization per consumer coming through our funnel, and that gives us more leverage to increase margins, which we're already working and feeling our margins are going to increase a few points in Q2. It's doing better than expected from an economic standpoint, from a customer satisfaction standpoint and the customer experience of being able to give you actually real bindable quotes from multiple carriers online with a person, who can also help you make that decision integrate it inside of -- my LendingTree, like that's the -- that's where we're pointing the direction of that ship and it's going really well. So the big thing in our strategy with -- My LendingTree is true adjacency of a reward for the consumer and sort of a members-only approach, which is it's not a paid product, but we're looking at it like from the mindset of what would the consumer pay for, let's deliver that and find a way to do it on a free basis. And the only other thing I'd add to that, and I thought that was a great answer is -- if you think about -- My LendingTree and as the upgrade from -- you came into the marketplace, you clicked on an ad, you filled out a form, you close or you didn't close, and then we're offering you the opportunity to say, \"Hey, you can set it and forget it, and we'll just alert you whenever we can save you money. So we've got -- that's why we want to have the insurance agency embedded in there, so you can get real offers, treaty, you get real offers for credit card and personal loans and not have a click out mortgage, we're working on some enhancements there. But second quarter, I would anticipate -- we've got another handful of credit card and personal loans, I'd say, five or six in the pipeline, whether they all get done in the second quarter or they bleed in to the third, that's kind of the time line that I would think about. So in personal loans, particularly in personal loans, it's -- you don't necessarily have budget allocations lenders want typically, if they're -- they still electronic that many times, they were able to run on cap. And so our focus in that business is obviously to get more efficient through TreeQual onboard more partners, but also to look for other marketing outlets, other sources of traffic, and that's where we're focused in the card business."
}