{
    "symbol": "TREE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 15:35:05",
    "content": " We're just a -- as we look at the back half of the year, and we think that's the right thing to do. But by the way, like it's -- I think you're seeing it now, and I think we've mostly seen it, and that's why I said, even in a recession, I'd be -- it wouldn't surprise me that things would come in more. But what we do like are seeing the signs when, for example, one of our major lenders recently cut-off all of the other -- all of our other competitive aggregator/marketplace sources except for LendingTree, which also -- which goes to show that if we can provide enough volume at the right price, and they can actually convert it and make money, they're going to -- as they shrink their marketing budgets just like in times we shrink hours, we love to be the place that they shrink to last. And -- but on the strategic reason, I've said in the previous call, you guys have probably heard me say 100 times in investor meetings that when we have a customer experience that we're proud of, and the economic support it that we're going to go tell the world about it. And we and -- nice thing is when you look at all the other fintechs doing TV advertising and losing money over it, we only do we're confident that it's actually going to hopefully fully pay back at least breakeven and help all of our other channels. So Jed, we're -- as Doug said, right, I mean, the number that's affecting Q3 is about $20 million, nearly half of which is really onetime in nature to produce the ads and some of the launch expenses and some of the ancillary media around the launch. And so they operate somewhat independently, but when you can advertise, you pick up both, but it really comes down to as RPL's climb, and that's why we're in our strategic initiatives, conversion rates go up and then we can advertise like that we can drive a lot more volume in ever it's profitable, we're going to do it. But basically, when we're thinking about our new experience and thinking about how we can integrate insurance, like wouldn't you just say to ask somebody going through the homeowners or auto flow, would you like a free insurance checkup by the LendingTree Insurance Agency. In 2016, there was specific catastrophic events around some major weather events that persisted 12 to 18 months that just -- they were able to work through those losses and it's a short -- pull back short term on marketing, and then it was right back to normality, where the inflation has just been a real shock to the industry, I would say. They're taking a really cautious approach and hoping that we're not -- don't have any major catastrophic events this summer, and then they would come back maybe even a little bit earlier, maybe even the fourth quarter, if major weather events didn't happen."
}