{
    "symbol": "TREE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 22:34:06",
    "content": " And so there's competitive pressure there, but it's not nearly as acute because we have a more - a better marketing mix in that business, but it's predominantly in credit card, where we're just not benefiting quite as much as a couple of our competitors there. On the monetization side, the click-out model is something that we want to improve over time on both - for credit card because it gives the consumer a better experience and there's a lot of leakage in approval rates that J.D. And while it has been bumpy throughout the year because we have a lot of third-party dependencies and as you would imagine given the shifting budgets of card issuers throughout the year with views on the economy, getting partners to spend money on an integration is challenging, we feel really good about the momentum with card issuers and that list is long. And we've been controlling and sub dealing some of the less high intent traffic, which allows us to monetize as much as possible in today's time, the current traffic, which I feel has put us in a good position to get - when those budgets start coming back to get a big piece of the buy as the highest-intent traffic is going to be the first thing that the carriers want. But I think it's because we've got a focused list of a few things that we think can move the needle and we're beavering on them this year and hope to probably still do some beavering next year, but that's really why it's really just staying focused. And then obviously, we've got about a $20 million annualized interest burden that we're mindful of, but certainly not problematic, but better where is going to - the model is one that still continues to generate pretty good cash flow quarter-to-quarter despite what we're dealing with on the macro level. Well, I would say, for starters, we've already started the margin profile adjustments, and we're very focused on the - we were, I think, as Doug or Andrew mentioned earlier in the call, we're up 4.5 points from Q2 to Q3, we're going to be up in Technical Issues two points from Q3 to Q4. And so as we said earlier, we still feel really good about that 15% to 20% - or $15 million to $20 million floor on a quarterly EBITDA basis going into next year. When you see that revenue deceleration, what you would typically see is our margins would expand a bit because we're not chasing every last bit of traffic because our partners only want the best traffic and so we've got to do that in the Home business."
}