{
    "symbol": "TREE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 13:13:05",
    "content": " Your line is now open. Please stand by for our next question. Your line is now open. When the entire industry starts getting more aggressive and I'm talking about from the carrier standpoint, when everyone's back in, and playing then you may start growing a little higher fruit on the tree where you're trying to get revenue at lower margins. Please stand by for our next question. Your line is now open. And right now, we're working, as I said earlier on improving conversion rates really across all of our products and all of our key initiatives, whether it be TreeQual, working on the post summit mortgage experience, the purchase initiative, the Win Card, those are all aimed at improving conversion rates, which improves customer satisfaction, and gives us more unit economics to market against. And in the Consumer Direct channel, which is the majority of our partners as opposed to retail, they tend to focus on refinance and the environment like where we're going -- what we went through in 2022 and we will continue to go through is really challenging in terms of getting the conversion rates that they need. So just thinking about consumer behavior, you're coming in looking to refinance your entire $400,000 house, you've got a mortgage rate from four years ago, that's where the consumer benefit doesn't make sense to refinance for your home value has gone up. Hey, within consumer I mean, if we back out personal loans, credit cards, and small business, I think that implied consumer other was up pretty sharp, I think 28% year-over-year, that's now about a fourth of the net. I mean, as Trent said financially it's not a needle mover, but what we're doing is looking at all of our businesses and saying, okay, what's the natural margin in this business, what's the opportunity in the business relative to the partner set. Please stand by for our next question. Your line is now open. You called out some competitive factors on the credit card side, obviously a lot going on in that space, whether it's TreeQual or competing products, different business models, and now you even have a competitor paying out consumers who don't get approved. Please stand by for our next question. Your line is now open. Your line is now open. And what you're seeing is the beginning of the work that's been going on for the last year, in terms of where we want to play on the MyLendingTree side, how we want to help consumers. Please stand by for our next question. Your line is now open."
}