{
    "symbol": "MSM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-20 12:47:03",
    "content": " Our e-commerce sales grew by 20% in our fiscal fourth quarter on an ADS basis and reached 63% of total company sales, up roughly 300 basis points compared to prior year. Our gross margin for the fiscal fourth quarter was 41.9%, down 100 basis points sequentially from our third quarter and down 10 basis points from last year's fiscal Q4. Adjusted for acquisition-related costs, adjusted operating expenses were also $290 million or 28.3% of net sales versus last year's adjusted operating expenses of $252 million or 30.3% of net sales. Adjusted for restructuring and acquisition-related costs as well as the current year gain on sale of property, adjusted operating margin was 13.6% as compared to adjusted operating margin of 11.7%, a nearly 200 basis point improvement year-over-year. For the full year fiscal 2022, we achieved a reported operating margin of 12.7% and on an adjusted basis, 12.9%, which was squarely in the top tier of our annual operating margin framework. Adjusted for restructuring and acquisition-related costs as well as the current year's gain on sale of property, adjusted earnings per share were $1.79 as compared to adjusted earnings per share of $1.26 in the prior year period, an increase of 42%. Also note that the recently completed acquisitions dilute operating margins by approximately 20 basis points in fiscal '23, their first full year with us. Lastly, on an operating margin -- on operating margin, and as I mentioned earlier, please keep in mind that the 53rd week added about 20 basis points to our full year fiscal 2022 operating margin. Holding fiscal 2023 debt constant with current levels, we would expect roughly $8 million to $10 million of interest expense per quarter and tax rates of slightly under 25%. Hi, good morning guys. First, we didn't break down the growth, and it does kind of vary whether you're at the low end of the framework or the high end, and that's because of the assumptions around price and what you get price carryover I think it's definitely fair to assume we'd be targeting that 400 basis points of share gain regardless of where IP falls. Hi, good morning guys."
}