{
    "symbol": "SUNL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 22:17:09",
    "content": " Iâ\u0080\u0099m pleased to report strong second quarter results, including record high results in a number of metrics and free cash flow generation of nearly $9 million. In the second quarter, Sunlight funded $716 million of solar and home improvement loans, a new quarterly record and $50 million higher than our funded loans in the second quarter of 2021. Home improvement volume was particularly strong with $112 million funded in the second quarter of 2022, more than double the second quarter of 2021 funded volume of $45 million. While our industry-leading credit quality and partnerships with depository institutions provides Sunlight strategic advantages and our direct channel margins are stable, current market conditions will negatively impact our indirect channel in the second half of this year. However, the delay and ultimate cancellation of that merger caused us to shift the sale of approximately $85 million of funded loans from the second quarter into the second half of the year, and weâ\u0080\u0099ll also increase our near-term reliance on the indirect channel. In addition, we expect the recent rise in interest rates and increased volatility in the capital markets to negatively impact indirect channel margins in the second half of the year, as Rodney will discuss in more detail. Although gross profit increased by $4 million relative to the second quarter of last year, revenues were impacted by the $85 million of unsold funded volume that shifted to the second half of this year, as Matt mentioned earlier. While the company continues to perform strong operationally and our direct channel margins are stable, the increased reliance on the indirect channel and the rapid change in market conditions will impact our indirect channel platform fees in the second half of 2022. As a result of market conditions, the sudden loss of a new capital provider and the lead time for implemented price changes to take hold, we are reducing guidance metrics for 2022 as follows: total funded loan volume of $2.8 billion to $3 billion; total revenue of $130 million to $140 million; and adjusted EBITDA of $35 million to $40 million."
}