{
    "symbol": "SUNL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 23:05:29",
    "content": "  Operator: Greetings, and welcome to the Sunlight Financial Third Quarter 2022 Earnings Call. Good afternoon, and welcome to Sunlight Financialâ\u0080\u0099s third quarter 2022 earnings call. After the close of the market today, we announced third quarter 2022 financial results and posted an earnings presentation to our Investor Relations website at ir.sunlightfinancial.com. Before we begin, Iâ\u0080\u0099d like to remind everyone that this webcast may contain certain statements that constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are subject to a variety of risks, uncertainties and other factors that could cause actual results to differ materially from those indicated or implied by such statements. Forward-looking statements include, but are not limited to, Sunlight Financialâ\u0080\u0099s expectations or predictions of financial and business performance and conditions and competitive and industry outlooks. Forward-looking statements speak as of the date they are made, are subject to risks, uncertainties and assumptions and are not guarantees of performance. Sunlight Financial is under no obligation and expressly disclaims any obligation to update, alter or otherwise revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. Additionally, during todayâ\u0080\u0099s call, we will discuss non-GAAP measures, which we believe can be useful in evaluating our performance. Joining me today are Matt Potere, Sunlight Financialâ\u0080\u0099s Chief Executive Officer; and Rodney Yoder, Sunlightâ\u0080\u0099s Chief Financial Officer. Matt will provide an operational update on the quarter, and then Rodney will share additional detail on our financial results. Thank you, Lucia, and thank you all for joining us as we discuss Sunlight Financialâ\u0080\u0099s third quarter 2022 operational and financial results. Despite a challenging macroeconomic environment, Sunlight achieved record volumes in the third quarter funding $835 million of solar and home improvement loans, up 31% year-over-year. Weâ\u0080\u0099re excited about the momentum weâ\u0080\u0099re seeing in this business, as we expand our presence in this $400 billion market. We remain a leading financing choice for contractors and homeowners, as our Orange platform provides a fast and frictionless process for financing solar installations and home improvement projects. We funded loans for over 22,000 borrowers in the third quarter thatâ\u0080\u0099s up 24% from the same period a year ago, and the new quarterly high for the company. We also continue to grow and strengthen our contractor relationships, adding 126 new active contractors to our platform in the third quarter, bringing our total installer relationships to 1,880. As disclosed in September, the largest installer in our Contractor Advance program became insolvent, leading us to take a significant impairment. As a result of these credit reviews, we have taken a number of actions to mitigate our risk within this program, including reducing advance limits, reducing the advance rate per job, increasing pricing for installers in this program, and eliminating advance eligibility for certain installers. As of quarter end, we had $64 million in advances outstanding with the largest advance outstanding at $10 million, and no other single installer greater than $7 million. As Rodney will discuss in more detail, the rapid rise in interest rates in our increased reliance on the indirect channel will have a significant negative impact on our near-term financial performance. To mitigate the impact going forward, weâ\u0080\u0099ve made substantial pricing changes. Weâ\u0080\u0099ve eliminated certain harder-to-finance products, and we are exploring a hedging program to protect us from interest rate volatility in the future. Despite higher interest rates impacting the cost of systems, homeowners buy solar to eliminate a portion of their utility bill. With average residential electricity prices up 25%, since 2018, and up over 14% in just the last 12 months, residential solar remains an attractive value proposition. Additionally, the passage of the Inflation Reduction Act, which increased the ITC from 26% to 30%, provides increased certainty for the industry over the next decade. On the consumer side, the solar asset class continues to perform well driven by a high quality borrower, who by definition, owns their home and is borrowing money for a financially responsible purpose. Sunlight loans, in particular, continue to outperform in terms of credit quality as our loss rates for our 2018, 2019 and 2020 vintages are substantially lower than peer averages for the same respective vintages. While industry leading credit quality has always been our focus is become even more valuable in the current economic environment as low loss rates improve capital providersâ\u0080\u0099 yields, increased demand for our assets and are an important lever to attract and maintain a strong network of capital providers. With that, Iâ\u0080\u0099d like to turn the call over to Rodney Yoder, Sunlightâ\u0080\u0099s CFO. Sunlight generated total revenue of $33 million in the third quarter of 2022, up 10% from the third quarter of 2021, primarily driven by an increase in platform fee margin. Our total platform fee this quarter was 5.1%, up 80 basis points from 5.3% in the same period last year. The direct solar platform fee percentage was even higher at 5.5%, up from 5.0% in the third quarter of 2021. Adjusted net income for the quarter was a loss of $26.3 million or a loss of $0.16 per fully diluted share, relative to $11.6 million in the third quarter of 2021. Adjusted EBITDA for the third quarter was a loss of $27 million, compared with $11.4 million in the third quarter of 2021. The first was a $37.2 million provision for losses expense primarily due to the contractor insolvency event Matt mentioned earlier, which also impacted our loan loss provision calculation. As a result of the installerâ\u0080\u0099s bankruptcy, we determined we were unable to collect on advances owed by that installer, and took a non-cash charge of $32.4 million to advances asset on the balance sheet and a related provision for losses expense on the income statement. This event also increased the average historical loss rate, driving incremental provision for losses expensed this quarter. The second impact is related to goodwill, we recorded on the balance sheet at the time of the business combination. Due to challenges in the macroeconomic environment, impacting the financial and market performance of the company and our peers, we believe that book value of goodwill exceeded its implied fair value. So we recorded a non-cash goodwill impairment charge of $384.4 million for the 3 months ended September 30, 2022. In addition, we also continue to see interest rate increases of unprecedented speed and magnitude, which have reduced our direct capital provider capacity and increased our reliance on the indirect channel thus far, and will affect our ability to profitably monetize indirect channel loans originated earlier this year. As Matt mentioned, though, we have been addressing these market conditions by making significant price increases over the past several months and removing low APR products. We expect these actions to increase future asset yields by over 300 basis points relative to earlier this year, delivering compelling risk adjusted returns for our capital providers and attractive margins for Sunlight. However, loans in the indirect channel will be sold at a loss in the near-term until the impact of these pricing increases take effect. In the third quarter of 2022, free cash flow was $8.2 million, and we ended the quarter with $70 million of unrestricted cash and cash equivalents, and only $21 million of short-term debt on the balance sheet. In May, we received Board approval for an 18-month $50 million share repurchase program. To date, we have purchased just over 3 million Class A shares for a total of $10.5 million, funded with excess cash on hand and operational cash flow. Due to interest rate volatility and the negative impacts to Sunlightâ\u0080\u0099s near-term financial performance, we have chosen to preserve liquidity by holding excess cash on the balance sheet, and have suspended share repurchases at this time. Despite a challenging macroeconomic environment, we continue to believe that Sunlight maintains an attractive position in a very compelling market, and the current share price does not reflect the intrinsic value of the company. As a number of parties have approached the company with a range of strategic alternatives, Sunlightâ\u0080\u0099s Board has commenced the process to explore, review, and evaluate potential alternatives that enable our business to continue to grow and maximize value for all stakeholders. Matt, Iâ\u0080\u0099d like to start with that last point that you just made that you guys have been fielding inbounds from interested parties. Maybe I have a third â\u0080\u0093 categorize is wrong as a regional bank, but maybe you can talk through, are they private equity companies. So, first, I think itâ\u0080\u0099s important to note that both Sunlightâ\u0080\u0099s board and the management team believe that the stock is undervalued, and it does not reflect the intrinsic value of the company. And to the extent these impact our debt covenants, weâ\u0080\u0099ll work with our bank partners with whom we have very strong relationships. And so, maybe letâ\u0080\u0099s talk about the frontend of the business, and you guys have talked about a lot of pricing actions. And so I wanted to understand, have you already gotten rid of the 0.99% and 1.99% loans? When you look at the cumulative effect of our pricing changes, we estimate that it is increasing the asset yield by about 3%, so a really substantial increase when you think about the combination of the interest rate and the and the dealer fee. And that 3% increase in yield, we think, position us very well to be able to ensure that our capital providers on a go-forward basis earn attractive risk adjusted returns and will be able to earn compelling margins as well. Now, that said, due to the strong credit quality, we do believe we have an advantage versus our other originators as capital providers do seek better credit quality. So, I guess, what Iâ\u0080\u0099ll say is, as you know, historically, weâ\u0080\u0099ve been more reliant on the direct channel. In the third quarter, we sold $42 million of loans and indirect channel, and we funded an additional $264 million. So weâ\u0080\u0099ve got about $3.5 million of unsold loans in the indirect channel, and we expect to sell those in the fourth quarter. And so, as we mentioned earlier, weâ\u0080\u0099ve taken actions to significantly increase pricing over the past several months to improve margins on loans going forward. That said, we have seen interest in the loans. And, we will â\u0080\u0093 it will be a challenge and we will take a loss in the fourth quarter. That said, again, weâ\u0080\u0099ve taken some pricing actions to deliver higher margins going forward. Historically, you were able to kind of think through the future years in a relatively constructive way. And, Phil, we recognize that thatâ\u0080\u0099s an important question for investors to have some insight into the business. If you look at the third quarter absent, what was a large impairment, we think the core business performed very well in the third quarter in line with their expectations. If you look at funded volumes, up significantly on sequential quarters and up significantly, year-over-year as well as really strong direct margins. And we pulled guidance, because of the volatility in interest rates. Just pulling up on previous questions, for Q4, should we not expect any direct contribution at all and 100% indirect kind of flip-flip versus what we saw in Q3. And actually, as I said that â\u0080\u0093 and then I have a follow-up on the indirect business. So, again, weâ\u0080\u0099re not providing guidance for the fourth quarter as discussed. And so, as we talked about earlier, weâ\u0080\u0099ve seen challenges given the rapid increases in interest rates, and that has caused some impact to our financials in Q4, but we wonâ\u0080\u0099t be providing any guidance there. Just on â\u0080\u0093 think of the platform fees in the indirect business, so as low as 3.3% in the last few quarters, any clarity on that? Yeah, Maheep, so itâ\u0080\u0099s â\u0080\u0093 we think about it, I think, thereâ\u0080\u0099s probably two parts to think about. One is the existing loans in the pipeline, which we call the bank book. As weâ\u0080\u0099ve highlighted, interest rates have moved rapidly, and we do expect to take a loss on those loans. That said, as we look about go-forward loans, as I mentioned earlier, weâ\u0080\u0099ve made significant pricing actions over the last several months, and we expect attractive margins on those loans going forward. And Rodney highlighted in his talking points earlier, weâ\u0080\u0099re also implementing a hedging program to help mitigate against interest rate volatility on a go-forward basis. So typically, it takes 3 to 4 months for a loan-to-fund. And so, we do think it will take â\u0080\u0093 and thereâ\u0080\u0099s a tail to that. And then, just stepping back on the macro level just given the Inflation Reduction Act and itâ\u0080\u0099s a higher tax credit added for leases. So, certainly interest rates are higher, and itâ\u0080\u0099s an inflationary environment. That said, the significant increases in utility rates make solar â\u0080\u0093 continue to make solar an attractive value proposition. I highlighted earlier year-over-year utility rates are up 14%, and we believe likely to continue to increase and perhaps even accelerate. Plus the investment tax credit, not only was it extended out a decade, which gives us some certainty and the market uncertainty. But it also increased from 26% to 30%, so it provides even better economics to homeowners who want to go solar. So when we look at market growth, and we look at the broader macro trends, we think solar is well positioned, and home improvement is a large market, and weâ\u0080\u0099re really just getting started there. And then just on the solar portion, leases get higher taxes, right, probably like 33% or even higher, with the tax redundant  which is not available for the loans. Yeah, so as we talk to homeowners, and we talk to solar salespeople, they consistently continue to tell us that they like the loan product over lease products, because of simplicity. Now, there are certainly cases where leases make more sense for an individual homeowner, but overwhelmingly, the market today is loans versus losses. And despite some of the points that you made, we do believe that loans will continue to play â\u0080\u0093 will continue to be the vast majority of the market going forward. So like we talked about earlier, the loans that we sell in the indirect channel in the fourth quarter will be sold at a loss. And while, again, it may have an impact on those covenants, to the extent that it does, weâ\u0080\u0099ll work with our bank partners with whom we have very strong relationships. But â\u0080\u0093 and then the pricing, I think, Phil had mentioned 4 or 5 price increases. Yeah, so â\u0080\u0093 itâ\u0080\u0099s a good question. So we started making pricing changes and then eliminating products late in the spring, weâ\u0080\u0099ve continued to make a â\u0080\u0093 take pricing actions up to and including into the fourth quarter to ensure that that loans are priced appropriately. So there clearly is some lag from when a pricing change goes into effect, when the customerâ\u0080\u0099s credit approved until the loan is funded, so there will be a tail there. And then, I wanted to better appreciate the customer service side of your business, a bit of an oddball question. But, I mean, you can go to the Better Business Bureau site, and thereâ\u0080\u0099s been litany of complaints have been against your corporation largely due to the Pink Energy bankruptcy. I just want to understand, are you staffed up to go after these people and how youâ\u0080\u0099re dealing with loans given in proper equipment that isnâ\u0080\u0099t working with now an insolvent company,  \n Yeah, itâ\u0080\u0099s a good question, and something that we take very seriously. Weâ\u0080\u0099ve staffed up a team internally to help assist those customers to get PTO, and to help support them if they may have questions regarding their systems. So definitely something that we take seriously, and weâ\u0080\u0099ve made good progress on helping a significant number of customers get PTO. And Iâ\u0080\u0099ve asked you this on prior calls, and youâ\u0080\u0099re a bit evasive on that â\u0080\u0093 on this topic as well. It has taken â\u0080\u0093 even now, it does still take longer due to supply chain and some labor shortages. So just to clarify, on the direct side of the business, we donâ\u0080\u0099t take market risk as our price with the capital provider is locked at the time of the credit approval. On the indirect channel, as weâ\u0080\u0099ve discussed in the past, we do have market risk from the time of approval until the loan is funded and ultimately sold. It takes some time to get those programs established with the banks, but we expect that to be in place for new loans in the fourth quarter. What I will say, just to reiterate is, as weâ\u0080\u0099ve seen the rapid rise in interest rates, weâ\u0080\u0099ve made multiple price changes, as Matt walked us through and thatâ\u0080\u0099s really increased the yield on the assets. As we think about risk adjusted returns for capital providers as well as our margins, we do contemplate any cost of hedging into this. And like I said, in the near term, given the sale of the indirect loans and a loss, if those covenants need to be addressed, weâ\u0080\u0099ll work with our bank partner through that. So, I think, Maheep was asking about, how there are a bunch of adders and thatâ\u0080\u0099s making lease more attractive, because the loan financing does not have the ability to access those adders, which can get up to a 70% ITC. On the other side, weâ\u0080\u0099ve been writing about how the originations for loans has been slowing down as well. And so long-term, Matt, I think you highlight that you have confidence in the business. But as we get into Q1 and Q2, there is, we believe a slowdown, because salespeople have to adjust to the shock of so many price increases in such a short period of time. As we think loan versus lease, one thing that I think has been true over the last few years is loans tend to be simpler for salespeople to explain to homeowners, and that simplicity helps drive more customers to choose a loan over a lease. They prefer â\u0080\u0093 itâ\u0080\u0099s going to be on their roof for 25 or 30 years, they prefer to have a loan and own that system versus lease. First, if you look at our overall funded loan volume in the third quarter, very strong loan volume up year-over-year and sequentially, and weâ\u0080\u0099ve seen good growth there. And weâ\u0080\u0099ve shared before, we donâ\u0080\u0099t think that that is the ultimate metric, but it does provide some indication of contractorsâ\u0080\u0099 eagerness and willingness to work with Sunlight and the value proposition that we offer. Now, Iâ\u0080\u0099d like to turn the call back to Matt Potere, for closing remarks. Well, thank you all for your questions and for your interest in Sunlight. We are excited to continue to execute on our growth plan, and we believe weâ\u0080\u0099re well positioned to generate long-term value for our stakeholders in this attractive market."
}