{
    "symbol": "SUNL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 23:43:26",
    "content": " In the first quarter, Sunlight funded $593 million of solar and home improvement loans, $8 million higher than the midpoint of our first quarter funded loan guidance of $580 million to $590 million and $12 million higher than our funded loans in the first quarter of 2021. Sunlight's battery attachment rate was 13% in the first quarter of this year, while this is lower than attachment rates we saw in 2021, driven by tighter battery supplies and our contractor mix, we believe that battery storage will continue to provide increasing benefits to homeowners over time. In the first quarter, we invested an additional $19 million in advances, and we'll continue to allocate capital to this program opportunistically to drive profitable volume. Sunlight generated total revenue of $30 million in the first quarter of 2022, up 11% from the first quarter of 2021, primarily driven by an increase in platform fee margin. As we've discussed, our industry-leading credit quality and capital provider demand for Sunlight loans led to increased margin in the second half of last year and into the first quarter of 2022. This decrease was driven by higher operational expenses, including approximately $4 million of public company expense that did not incur as a private company in the first quarter of '21 as well as $1.4 million of incremental SG&A and other costs to drive growth in the business. In the first quarter of 2022, free cash flow was $6.5 million, representing an 83% EBITDA to free cash flow conversion rate. Therefore, I'm pleased to affirm Sunlight's 2022 full year guidance ranges as follows; total funded loan volume up $2.9 billion to $3.1 billion, total revenue of $145 million to $155 million and adjusted EBITDA of $55 million to $60 million. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}