{
    "symbol": "CMCO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-25 13:22:03",
    "content": " On Slide 5, net sales in the fourth quarter were $253.4 million, up 36% from the prior year period and significantly ahead of the guidance we provided last quarter. As shown on Slide 7, RSG&A costs were well controlled coming in at $54.8 million in the quarter or 21.6% of sales. RSG&A costs were sequentially higher by 2.4%, which included $1.1 million of business realignment expense and a full quarter of Garvey RSG&A of $1.5 million, which was sequentially higher by $1 million. Compared with the prior year, RSG&A costs were higher by $8.1 million, this was largely due to additional costs from acquisitions of $7.7 million and business realignment costs of $1.1 million, partially offset by Dorner acquisition deal costs of $4 million incurred in the fourth quarter of fiscal year ’21. In addition to that, we've got backlog, record backlog of $309 million that -- to a large extent as priced at all pricing as -- as we choose, we’re not able to reprice the backlog, I mean we've taken purchase orders already for the business. And maybe to also add on to David's comments, in general, Matt, we've raised prices anywhere between 5% and 10%, probably on average towards the higher end of that range, different by region, and we're clearly or else remain steadfast and looking at our inflationary pressures and we'll look at other ways to realize our margins by additional price increases and/or surcharges. But as we execute on our backlog and look at this quarter, we're facing sequential FX headwinds of about $4 million and then, we're facing the impact of that implementation that we mentioned in Europe and so the combination of those elements and adjusted organically when you think about acquisition volume period over period and so forth. And so from a scale perspective, when we saw the benefit of scale this quarter on RSG&A costs, we're in $253 million or $1 billion kind of a run rate. And then, Jon, on the inflation question, so in the quarter, if you look at our sales bridge and our gross margin bridge, you can see that price was up 8.4, but price net of material costs was $3 million. It's a broad answer, but yeah, it's kind of what the activity we're seeing, we're seeing some activities phasing just as people are talking about a project that might be a $5 million project that delivers over six months, they might be saying, hey, look, I want to release the first 3 million of it and I wanted to run over nine months. So what we we're really talking about is freight costs sequentially went up, close to $3 million, which is well over, I would say 110 basis points of gross margin, and it was really across the board. I mean if you think about the split of business roughly 50-50 in that business projects versus short cycle, build to order type project activity, we probably have $20 million in any given quarter that is active relative to project related business and this business would have really -- would have approximated 15% to 20% of that amount, and this would have been a large project. I think we demonstrated last year an ability to flex in the experience of a lead to make moves through the pandemic, we went down to below 10% and as we were experiencing growth we ramp up to the mid ramped back up into the mid-teens with the addition of the $40 million of revenue."
}