{
    "symbol": "VALN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 13:25:03",
    "content": " I would now like to hand the conference over to your speaker today, Vice President of Global Investor Relations, Joshua Drumm. Hello and thank you for joining us to discuss Valneva's full-year 2022 consolidated financial results, which were published today and are available on our Web site. I'm joined by Valneva's CEO, Tomas Lingelbach; and CFO, Peter Buhler, who will provide a brief overview of our business and our financial results for the period, as well as updated financial guidance and a summary of anticipated upcoming milestones. Before we begin, I'd like to remind listeners that, during this presentation, we will be making forward-looking statements which are subject to certain risks and uncertainties that could cause actual results to differ materially from those expressed or implied by these forward-looking statements. You can find additional information about these risks and uncertainties in our periodic filings with the Securities and Exchange Commission and with the French Market Authority, which are also listed on our company Web site, www.valneva.com. Please note that today's presentation includes information provided as of today, March 23, 2023, and Valneva undertakes no obligation to revise or update forward-looking statements except as required by applicable securities laws. And with that, it is my pleasure to introduce Thomas to begin today's presentation. Well, 2022 was a year marked by our ability to adapt to a changing environment, and showed our resilience. On Lyme disease, we started the Phase 3 pivotal efficacy study, VALOR, together with Pfizer. On COVID-19, we were the first company to achieve a full marketing authorization by EMA. However, given the changing environment around COVID and the prospect of that vaccine, we decided to not further invest in development and stop manufacturing the COVID. We accelerated our preclinical activities with the aim to build a new exciting R&D pipeline, up and beyond Lyme and chikungunya. We have seen a significant rebound of the commercial business, and we clearly capitalized on the strong recovery in travel segment. We have reported strong full-year 2022 revenues and cash position with reviews about â\u0082¬360 million, and product sales year-on-year increase well above 80%. With that, let me go straight into our programs and into the business update, and I will start with chikungunya, page six of the presentation. Basically, the Phase 3 study met all primary endpoints in terms of sero-response rate, but also in terms of lot-to-lot consistency. We reported positive 12-month antibody persistence data and the long-term persistence trial that will measure the sero-response rate over time, targeting at least five years. The adolescents' trial is fully enrolled by now, and we expect first data mid 2023. And we expect to commence other regulatory processes in the second-half of this year, including EMA. In terms of target population and overall geographic reach, we have explained before that we see, of course, the non-endemic countries, and here primarily travelers, military, but also the possibility outbreak preparedness and stockpiling. And, of course, on the basis of that high sero-response rate, we see also a 100% seroconversion. We had, of course, as expected for a vaccine of that class, solicited systemic adverse events, but the majority of solicited adverse events were mild or moderate. It is again, following our pipeline differentiation around first-only or best-in-class, the only Lyme disease vaccine in advanced clinical development today. We initiated the Phase 3 study on the back of positive results for three Phase 2 studies, including a pediatric population. You know that as part of the ongoing Phase 3 study, there were GCP issues observed that led the study sponsor and our partner, Pfizer, to actually stop a significant part of the study subjects that were included in the study. Given the seasonality around Lyme development, we have currently a review of the trial design and the associated timeline ongoing. And this is, of course, a process that will still take a bit of time. I think by way of reminder with regards to the data that have always been extremely strong for Lyme, and of course also the GCP issues that we have been facing now as part of the Phase 3 conduct do not change the picture on the underlying science and value of this program. And we have seen as part of the booster studies, a very strong anamnestic response which is of utmost importance for a product that is expected to be boostered over time. When we look at our pipeline, you basically see that we are currently reviewing most of our or some of our preclinical and previous clinical candidates with regards to next clinical entry. However, we are currently evaluating a potential clinical re-entry at the end of this year or very, very early next year. Given that we could leverage one of our existing platforms, and given that WHO made a clear recommendation for Zika vaccines to be based on inactivated whole-virus technologies. hMPV, human metapneumovirus, is a program that we developed throughout the preclinical phase. It has reached the end of the preclinical phase, with the initial preclinical proof of concept being completed. But given that the market is shifting in the development arena towards combination vaccines, RSV hMPV, we've decided to evaluate a potential partnering before taking it potentially into a first trial in humans. Total revenue grew by 3.8%, which is fiscal year 2021 driven by a strong product sales growth. Total product sales reached â\u0082¬114.8 million, an increase of 82.3% versus prior year or 66.7% in constant currency. 2022 product sales include â\u0082¬29.6 million of VLA2001, our COVID-19 vaccine. Moving on to slide 14 looking at product sales details, IXIARO sales reached â\u0082¬41.3 million, a decrease of minus 8.4% versus prior year as a result of fewer shipments for U.S. military. DUKORAL sales reached â\u0082¬17.3 million compared to â\u0082¬2.4 million in 2022, an increase of more than 600% once again driven by the recovery of the travel market. Third part product sales increased by 72% to reach â\u0082¬26.5 million for the fiscal year 2022, this represents a record level of this product segment as Valneva managed to increase third party product sales consistently over the last two years. Finally, as already mentioned we shipped COVID-19 vaccine for an amount of â\u0082¬29.6 million to certain member states of the European Union as well as to the Kingdom of Bahrain. Looking at expenses, we observed a significant increase in cost of goods. Overall, an upside of â\u0082¬25 million resulted in '22 compared to total â\u0082¬37 million in 2021. In 2022, Valneva generated an operating loss of â\u0082¬113.4 million compared to â\u0082¬61.4 million in prior year and an adjusted EBITDA of negative â\u0082¬69.2 million versus minus â\u0082¬47.1 million in the prior year. Looking at our COVID business segments, we see total revenues of â\u0082¬309.6 million with a total cost of goods and services of â\u0082¬267.1 million. As already mentioned, the negative other revenues were driven by the revised line agreement. Cost of goods and services reached â\u0082¬57.3 million and sales of â\u0082¬9.2 million cost of technologies and services, â\u0082¬3.3 million for vaccine candidate and â\u0082¬41.8 million of commercialized product. Moving on to slide 17 and looking at our balance sheet, total assets decreased to â\u0082¬817 million at the end of 2021 to â\u0082¬621 million at December 31 2022. Next slide, Valneva equity was strengthened in 2022, through a global offering of â\u0082¬102 million at the end of the third quarter, as well as private investment in Valneva shares for a total value of â\u0082¬90 million. At the same time, total liabilities decreased by â\u0082¬245 million, in particular driven by a decrease of contract and refund liabilities driven by the revenue recognition of deferred revenues related to the COVID-19 agreements. While total borrowings, the increase to an increase due to an increase in Deerfield & OrbiMed loan, these liabilities decreased due to amortization and the foreign exchange impact. Provisions decreased due to lower cost of share-based compensation, driven by the decrease in Valneva share price. Now moving on to the financial outlook on slide 20, we expect product sales to reach â\u0082¬130 million to â\u0082¬150 million. Yes, so we see for the year 2023 quite significant number of catalysts and interesting news flow. Of course, then it's all about our launch here, so the potential BLA approval and the launch, and upon successful approval the PRV and the potential PRV sale that Peter mentioned earlier. And hence, you should expect additional ex-U.S. regulatory submissions in the second-half of this year. On Lyme, of course, we all understand that it is important that we get clarity on our Phase 3 clinical study plans. And, of course, as we are running the antibody persistence studies on an ongoing way, we will also expect additional antibody persistence results in the second-half of this year. Then on IXIARO and military, we expect a potential new DoD contract, still towards the later part of H1, the progression of the selected preclinical programs towards clinical entry, so we will take a clear decision which one, and by when. And as we reported earlier, we are reviewing and evaluating to potentially augmenting our clinical pipeline through a program acquisition or partnering in the R&D environment. When you look at our strategy and how we see the company evolving over time, we prepared slide 23. The additional potential growth drivers include the continued recovery of the travel market to pre-COVID levels, and beyond; new U.S. DoD contract for IXIARO; further expansion of our third-party distribution segment; and potential in-licensing or acquisition of additional clinical and/or commercial-stage products. With that, we conclude our presentation, and we hand back to the operator to take your questions. Please go ahead, your line is open. So, for the Phase 3 Lyme proposed protocol modifications that would allow Pfizer and Valneva to remain on track for a 2025 filing, I'm guessing you can't provide too much into exact interactions with FDA. You would certainly understand that, as you rightly pointed out, there is very little we can say at this point in time. It is very clear that, as we discussed previously, of course we did lose a significant number of people in the season 2023. And there are other, what I would call, more creative scenarios that may potentially allow still a filing, but those are in the make right now or in the discussions, and we can't comment on those. An excellent question, so, first of all, we are making progress in the ongoing review process. As far as the  (ph) is concerned, no decision has been taken yet as to whether a dedicated work pack for this program will be needed or not. And, of course, we do hope and do assume a positive vote as part of our launch plans for the United States. We will now take the next question. Please go ahead, your line is open. Under normal circumstances, if you did not have a seasonality to be considered, you lose, for whatever reason, people in your clinical study, and then you just continue recruiting, and the recruitment takes longer. Here, we have of course the situation where you need to recognize the seasonality because otherwise you don't get the necessary case count in a placebo-controlled  (ph) efficacy setting. Now, the discussion with FDA on primary endpoints, secondary endpoints, co-primary endpoints, parallel endpoints; these are discussions that I have been through in my more than 30 years of vaccine development many, many times, and this is certainly nothing unusual, and these are things that need to be based on different statistical modeling. And we are working with Bavarian Nordic under a commercial agreement where, in some of the markets where we have our own infrastructure, we sell Bavarian Nordic products. As we've said previously, of course this whole collaboration is going to be under review. So I would say, right now, so basically we have, as I mentioned earlier, we've reached the point of preclinical PoC completion. Therefore, we have said we've given it a slight pause and look whether it would not be more valuable to bring this asset, at this point already, into a partnership model with one of the RSV candidates, and therefore have a more efficient development route. Should this not be seen as a viable and value generating option, then we will certainly consider taking it into the clinic in order to increase the asset's value. Please go ahead, your line is open. As you know, Valneva's strategy is certainly based, and Valneva's R&D pipeline strategy is basically based on our clear idea to have assets where we can play a differentiating role; first-in-class, best-in-class, only-in-class. So, basically the approach we took and we communicated previously that we have 8 to 10 million inventory of COVID -- dose -- 8 to 10 million doses of COVID vaccines in our inventory. So, the approach we took at the end of 2022 is basically take a full write-down on semi-finished finished products but also on specific raw material related to the COVID vaccine. We, of course, continue our efforts try and sell these products in the market. With regard to your second question, refund liabilities, which is by and large Pfizer-related. There is a small historic remaining part that relates to an old used case, contract or refund liability which is related to the cost of that we did last year, but basically, the large majority of the refund liabilities is related to Pfizer. Inventory write-off, are you able to quantify it, because it's quite odd to not leasing, so I'm unclear about what the actual amount was. But, overall, you can assume a write off in the financial year 2022 of roughly â\u0082¬130 million. We will now take the next question. Your line is open. And so, I would say on Lyme -- so first, you used the term addition studies. And the second part is, of course, related then to what kind of -- do you keep a readout, and when do you do the readout. So, that's more from the clinical development point of view. On the cost side of things, we have not had any discussion yet about any potential incremental costs, and this is something that will be discussed as soon as we have an agreed development plan going forward. And then, with regards to your volume versus price question, so when we look at the IXIARO as you can see on the slide, at constant exchange rate, we look at a downside of about 18.6% versus prior year. We are looking here the upside rate to price of a plus 10%, so, the differences of course, then volume-driven. When we look at DUKORAL, we have volume upside versus the prior year of roughly 400% and then the distance to the total 600% of services per year would be price-related. And I think you had a second question, but if you could just repeat that one. And, as you can see, the gross margin improved significantly versus prior year. Your line is open. So, the first one just on the guidance, other income â\u0082¬90 million to â\u0082¬110 million, I just wanted to confirm that that's essentially non-cash revenue recognition. So, that's the first question. And then, in terms of the Pfizer Phase 3, I want you to -- I was wondering whether you have made a cash contribution to that in 2022 and if so, maybe you can just explain, I think he previously talked about that not going through the P&L, but if you could have maybe explained where that's coming out in the cash flow. And then, the final question is just on your distribution of marketing expenses, we saw a little bit of a bump in Q4, is Q4 a good run rate, quarterly run rate going into this year. So, other income as we surface is related to the PRV we expect to receive upon approval of our Chikungunya vaccine candidate, and as we expect to sell this PRV with you, it will be cash-related, because we will recognize that other income as we get to cash and just also to be very clear, we expect this to go not into other revenues with other income i.e. With regards to the Pfizer Phase 3, cash, I mean the way the agreement works is that we basically pay every quarter our share to the trial, and indeed to your point that does not go into the P&L but it would go on the against the balance sheet against the refund liability which is talked about previously in Max's question. Then distribution and marketing expense, so, what you see in Q4 is an increase in yield versus prior year's previous quarters which is primarily driven Of course as we get ready with our, we get prepared, we prepare for chikungunya I think candidate launch. Also of course, related to overall, commercial activities ramping up as the markets come back, and it's safe to assume that you could see further increases there as we get ready with our commercial infrastructure in our strengthening the commercial infrastructure in view of the new launch. We will now take the next question. Your line is open. I mean we will continue to have some R&D expense as we continue to finalize certain clinical trials that we have had started in the past, we will not initiate new clinical programs, of course, but we do need to ramp up the clinical trials at that cost is included in our R&D expense. Of course, we mentioned also the final shipments to Bahrain. So, that's basically what we expect for 2023 in terms of COVID hitting there. Our objective is to have a clinical entry by the end of this year, very, very early next year, but it's one programs or two programs. It's still something that we're going to decide out of our own pipeline, but we will definitely informed markets, which program is we are expecting to enter into clinics. So, this would certainly be a new for this year. And then, we have this ongoing point about reviewing potential additional external opportunities to inject in our clinical pipeline since we have clinically relevant capacity and capability. We will now take the next question. Your line is open. So, yes, we did increase pricing across the board for basically most -- IXIARO -- those are some of our third-party products. Also, just in terms of kind of external sources of -- \n Okay, the external influx in that, so basically I mean you know that Valneva is technology agnostic company, right. So, we are not a technology company we have, we go by indication, we go by indication where we are looking into indications where we can still play a pioneering role I mentioned earlier, first only bet. Of course, we will also be open to work on a specific indication on mRNA, but it's not our interest to acquire a technology company or a technology platform or going back or becoming all of a sudden a technology company. Please note, an archived version of today's webcast will be made available later today."
}