{
    "symbol": "WT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 14:24:05",
    "content": " A number of factors could cause actual results to differ materially from the results discussed in forward-looking statements, including, but not limited to, the risks set forth in this presentation and in the Risk Factors section of WisdomTree's annual report, on Form 10-K for the year ended December 31, 2021, as amended, and quarterly report on Form 10-Q for the quarter ended June 30, 2022. Notwithstanding the market declines, our revenues were essentially flat year-over-year as we generated over $12 billion of net flows, our strongest flowing year since 2015, representing annualized organic flow growth of 16%. Certainly, that floating rate treasury product we've talked about continues to remain attractive as they're essentially the highest yielding treasuries in the market because of the shape of the yield curve that looks to continue to be the case for some time, and we're going to continue to expand the scope of those discussions but we're broadening fixed income discussion to high-yield bonds, core bonds, our fixed income model portfolios and even digital funds of those models that are income based to capitalize on the yields we see at the short end of the curve. That was our original launch, but we think there's some really compelling opportunities in high dividend stocks globally and that strong performance from last year with dividend funds with 15-year track record, that should be a very useful catalyst going forward. As mentioned in our prepared remarks, we generated over $12 billion of flows this year, 16% annualized organic growth rate, best-in-class amongst our traditional asset manager peer group, and this is our strongest flowing year since 2015 and the momentum continued into 2023. And what's great about it for us is not only did it bring us revenue and great flows but it puts us right there for great conversations with our clients as the environment changes to possibly other fixed income products or as JR said earlier, there's income back not only in fixed income, but we've got our dividend paying funds with fantastic yields. So very curated, user-friendly investing experience covering all asset classes, whether that's U.S. equities, whether that's commodities like gold or whether that's crypto as well and certainly a strength in fixed income which gets into the second point of where we think we're really adding value, which, especially with rates are where they are today, cash management being something that people can really use this for and using this investments fund style of investing  Sorry for the background noise."
}