{
    "symbol": "EFSC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 16:08:06",
    "content": " As you heard from Jim, and as shown on slide 6, we posted solid loan growth of $122 million for the third quarter, resulting in a trailing 12-month growth rate of 8% net of PPP changes. Year-over-year deposit balances have risen $230 million or roughly 2%, primarily driven by an increase in new noninterest-bearing accounts from the specialty deposit lines and new commercial relationships. Turning to slide 15, net interest income for the quarter was $124 million, compared to $110 million in the second quarter, or a $14 million increase. With a composition of our balance sheet as of September 30, we expect the full impact of the existing interest rate increases will result in quarterly net interest income in the range of $130 million to $132 million. Moving on to slide 16, net interest margin on a tax equivalent basis was 4.10%, an increase of 55 basis points from the linked quarter, our balance sheet has been positioned to be asset sensitive and accordingly, it continues to benefit from an increase in interest rates. Our capital metrics are shown on slide 21, the new record earnings we generated in the third quarter of $50 million, offset the $45 million decline in accumulated other comprehensive income from the continued impact of rising interest rates on the market value of our available for sale investment portfolio. And moving forward, I think with what's happened so far, in the year, I think we're prepared for anywhere from call it a negative and of another couple million in the fourth quarter to potentially a zero or a positive as we move forward here, just rates have moved on the long end of the curve, I guess, more than we've thought and we probably should have given some sensitivity to you guys in advance of this. So based on the September balance sheet and rate I think we think net interest income is roughly just north of $130 million with net interest margin, right around 4.35% that includes the quarterly resets, we talked about predominantly on the SBA portfolio, and then call it another 10 to 15 basis point increase in deposit rates based on where we sit today, and what we've done with sheet rates and exception pricing. Yes, so another 100 basis points, which is, I think what it seems like it's lining up for in the fourth quarter, I mean, that's going to generate roughly $5 million of extra net interest income per quarter. And I think the coverage right now is like is 150 that obviously includes loan deterioration and substandard loans, which are still minimal, but so I think provisioning on new loans is call it right around that 110 to 125 basis points, depending on what category it's in, and then I think with the recovered, the coverage ratio, we have 150 and 170 sort of total and unguaranteed I think based on where we sit today, we feel like we're well positioned, if we see the horizon or the environment deteriorating further, and we get some of that data in the economic forecast that we can be further responsive to it, and deal with those provisions over the coming quarters fourth quarter, and then into '23. And with the way the balance sheet is positioned, I think we're in good shape to continue to maintain and grow net interest income and margin, and we'll probably give up just a little bit in terms of the deposit costs accelerating in these most recent quarters, but starting from north of a 4% net interest margin and growing."
}