{
    "symbol": "EFSC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 16:13:07",
    "content": " Focusing first on the loan book, which is referenced on Slide 5, we posted strong performance in core loans, net of PPP, growing by 298 million in the quarter or 13.4% annualized, and this compares with 176 million in the prior quarter. The Southwest region, which includes Arizona and Las Vegas, posted strong results again this quarter adding 43 million of growth in Q2, resulting in a 37% increase in the loan portfolio year-over-year. In Southern California for Q2, I'm pleased to report that our loan portfolio here grew by $29 million in the quarter and represents a third consecutive quarter of positive momentum in net loans resulting from both higher originations and lower payoffs, compared to the previous quarter. Turning to Slide 11, net interest income was $110 million, compared to $101 million in the first quarter and an increase of $9 million, which was favorably impacted by higher average loan and investment balances along with the benefit of rising interest rates driving net interest margin higher. With the current composition of our balance sheet as of June 30, another 75 basis point increase in interest rate will result in an additional $6 million to $7 million in quarterly net interest income. This is in addition to the full impact of the existing interest rate increases, which will also add another $3.5 million to $4 million to quarterly net interest income. We're okay with it where it is given cash balances and the strong earnings profile, but I think you're going to see us let it rebuild somewhat in the upcoming quarters and weeks and we may decide to be opportunistic if we continue to get an unfavorable tape, but I don't think the dollar amount of anything we would do there would be substantial because over the last year we did repurchase 2 million shares and we think we did so favorably and opportunistically, but most of the pieces of the capital stack are kind of right at the optimal targets right now."
}