{
    "symbol": "EFSC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 18:14:06",
    "content": " SBA finished strong, posting growth of $43 million in the quarter despite the continuing headwinds of higher short-term rates. Tax credit also executed well with $52 million of quarterly growth, pushing the total to $73 million or 15% for the year. Our Southwestern markets grew by $81 million for the quarter, resulting in solid year-over-year growth of 14.6%. In the Midwest, for example, a large portion of their $281 million decline for the quarter is attributable to a single upper middle market company that we had assisted with a Main Street loan. My comments begin on Slide 15, where we reported earnings per share of $1.58 in the fourth quarter on net income of $60 million. Net interest income for the quarter was $139 million compared to $124 million in the linked quarter, an increase of $15 million. With the current composition of our balance sheet as of December 31, we expect the full impact of the existing interest rate increases will result in a quarterly net interest income in the range of $143 million to $146 million. Earning asset yields improved 78 basis points which included 77 basis points of loan yield improvement, including a 6.64% origination rate on new loans and the investment yield improved 26 basis points as reinvestment rates continue to increase to a 5.2% fourth quarter tax equivalent rate. The allowance for credit losses declined $3.6 million in the quarter to $137 million, primarily due to net charge-offs and the overall improvement in asset quality. As you recall, this line item was negatively impacted in the third quarter by rising interest rates on tax credit projects carried at fair value while fourth quarter results did not see the same negative impact as rates were steady in the quarter and benefited from seasonally strong sales of tax credits. Fourth quarter non-interest expense was $77 million, an increase of $8 million compared to $69 million in the third quarter. Compensation and benefits increased $1.2 million from the linked quarter, principally from higher performance-based incentive and bonus accruals due to the company's strong financial results. Our capital metrics are shown on Slide 22 and the record earnings we generated in the fourth quarter of $60 million combined with an improvement in accumulated other comprehensive income, resulted in tangible book value per share of $28.67, an increase of 8% from the third quarter. I would say going forward, when you look at 4Q to 1Q sequentially, we're thinking that, that line item is up maybe $2 million to $3 million, just depending on what happens with balances and rates and sort of everything that we know at the end of the year. But I think with that $2 million to $3 million for the first quarter sequentially on that, tax credit line -- or sorry, the ECR line item, that should give you some good starting points for modeling the expenses for 1Q."
}