{
    "symbol": "WE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 11:53:11",
    "content": " Our All Access business continued its growth ending the quarter with 17,000 members a 56% increase year-over-year, and now a business started only two years ago that is generating $200 million of annual revenue. As a result of previously announced work floor reductions and other plan savings initiatives, we anticipate the SG&A this year to be about 10% lower than the previous run rate, so that would be approximately $650 million. First, total company revenue was $848 million in the fourth quarter, up 18% year-over-year, and up $31 million sequentially from the third quarter. As Sandeep mentioned, on a budget FX basis, fourth quarter revenue of $905 million was above the $870 million to $890 million guidance range we provided previously. Quarterly sales benefited from higher membership revenue, continued growth in All Access and improved pricing, and for the full year consolidated revenue of $3.25 billion was up 26% versus 2021, driven by a 12 point increase in physical occupancy and a nearly 80,000 increase in physical memberships. Building margin continued its positive trend in the fourth quarter, rising to $144 million, which was up $39 million sequentially and up $153 million year-over-year. And on the earnings line, we narrowed our adjusted EBITDA loss to $26 million loss in the fourth quarter, the smallest reported loss in our history, helped by the higher revenue, lower OpEx and continued reductions in our SG&A expenses. Our SG&A run rate ended the year at approximately $700 million, and as Sandeep just mentioned, we're expecting a further reduction of SG&A of approximately 10% this year. Our free cash flow continued to improve in the fourth quarter narrowing to negative $156 million, which was a $49 million sequential improvement from the third quarter, driven by the operating improvement we discussed previously, as well as lower CapEx. Regarding the first quarter, as Sandeep mentioned, we expect consolidated first quarter revenue to be in the range of $830 million to $855 million and adjusted EBITDA in the range of negative $25 million to breakeven. But more importantly, the upsides of the LC facility actually in the Junior LC facility is more advantageous to us as the LCs burned throughout this year approximately about $30 million a quarter, we can actually use that money into working capital versus in the Senior LC facility had it stayed at the level it had stayed and as the burn downs occur, that money is not available to be drawn for working capital. When we increased the $350 million to $470 million, even though that $120 million, $100 million of it was cash collaterized for Letter of Credits, and those Letter of Credits burn through the entire year at about $30 million a quarter, we can use that $100 million in working capital."
}