{
    "symbol": "HOFT",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-08 13:50:06",
    "content": " This morning, we reported consolidated net sales of $153 million, a decrease of $9.6 million or 5.9% compared to last yearâ\u0080\u0099s second quarter driven by lower sales in our Home Meridian segment and partially offset by sales increases in the Hooker Branded and Domestic Upholstery segment, the addition of Sunset West results and the recovery in the H Contract. For the fiscal 2023 first half, consolidated net sales were $300 million, down $25 million or 7.7% compared to last yearâ\u0080\u0099s first half, a period in which home furnishings and other industries benefited from a post-COVID demand surge. At midyear, momentum at Hooker Furnishings is positive, strong backlogs, full production capacity at our domestic factories and our Asian suppliers and optimum inventory levels position us to grow sales across all three segments during the second half compared to the second half of last year which was significantly disrupted when virtually all of our Asian capacity was shutdown due to the COVID-19 pandemic. Inventory receipts at our U.S. warehouses increased monthly during the quarter as our Asian suppliers resumed production and shipments after delays earlier this year resulting from COVID-related shutdowns last year, which allowed us to better fulfill orders and reduce backlogs during the quarter. At the end of the quarter, inventory levels increased by $33 million compared to the prior year end and by $15 million compared to the previous quarter and we have about $25 million in transit in the Hooker Branded segment. At Home Meridian, net sales decreased by $28 million or 32% compared to the prior year quarter due to lower sales at mass merchants and furniture chains from retailers who accelerated their orders in the prior year and are currently rationalizing their inventory levels. Turning to Domestic Upholstery, it achieved its sixth consecutive quarter of double-digit sales gains with organic growth driving a net revenue increase of about $8 million or 33% as compared to the prior year quarter before considering the addition of Sunset West results. On our balance sheet, cash and cash equivalents stood at $11.7 million at second quarter end down $57 million compared to the balance at the fiscal 2022 year end due primarily to a $56 million increase in inventory. At the end of the quarter, backlog was $201 million compared to â\u0080\u0093 last year, the backlog was even bigger, it was 3 plus but more normalized that 200 is still much higher than prior, letâ\u0080\u0099s say, at the end of â\u0080\u009819, it was â\u0080\u0093 at the end of fiscal â\u0080\u009819, it was $100 million. And also one other thing is weâ\u0080\u0099ve reduced â\u0080\u0093 weâ\u0080\u0099ve significantly reduced the overhead on that side of the company, which is going to allow us to do a lot â\u0080\u0093 make a lot more money and be a lot more profitable even if itâ\u0080\u0099s a $250 million, $260 million business. Orders for the second quarter, itâ\u0080\u0099s going to sound really bad, but they were $63 million versus $193 million last year."
}