{
    "symbol": "TALK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 14:50:24",
    "content": " In the fourth quarter of 2022, revenue for B2B which includes payer, the EAP and behavioral health and the direct-to-employer increased 52% over the same period fourth quarter for 2021 a year ago and 15% sequentially. From a profitability standpoint, you could see the tremendous work the team has achieved in reducing our adjusted EBITDA loss in the fourth quarter as compared to the same period a year ago on the back of our focus on reducing operating expenses that were not driving revenue growth or efficiencies in the business. Our fourth quarter gross margin was 53.5% and gross profit grew approximately 11% sequentially to $16.2 million, primarily due to the full quarter effect of Q3 price improvements in DTE and higher provider productivity from actions finalized in the network in the third quarter. Consumer revenue was $11 million, down 13% from the previous quarter, driven by a 14% reduction in active consumer members from the end of Q3 to the end of Q4. B2B and payer revenue was $10.7 million, up 13% compared to the third quarter as sessions completed by members covered through their EAP benefit or their insurance increased 15% to 128,000 sessions in the fourth quarter. Lastly, B2B drift-to-enterprise  revenue for the fourth quarter was $8.6 million, driven in large part by new accounts which totaled $226 million at year-end as well as the full quarter impact from Q3 account renewals on favorable terms. Excluding these charges, other favorable nonrecurring items and stock-based compensation, Q4 expenses were approximately $25 million compared to $30 million in the third quarter and demonstrating important progress that we have made not only in optimizing advertising spend but in driving efficiencies across our entire expense base. First, as demonstrated in our Q3 and Q4 results and further supported by our view that the mental health care market growth will be primarily driven by expansion of access and members leveraging health benefits, we believe B2B payer revenue growth will outpace other revenue categories. By driving growth across our B2B payer as well as the DTE categories, focusing on becoming the platform of choice for providers and striving to achieve operational excellence, we have put ourselves on a path that we believe will enable us to reach breakeven adjusted EBITDA by the end of the first half of 2024, while maintaining a strong cash balance that provides us with the operational flexibility to opportunistically capitalize on our other strategic initiatives. Maybe just a couple of points to add to what we already have which is I guess there's an element of -- first of all, just the growth in the B2B categories that we've already demonstrated, like we said, we see continued momentum there, even in the first quarter."
}