{
    "symbol": "VRTX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 21:10:25",
    "content": " As such, we are strategically investing and focusing on execution to drive forward the significant opportunity with a uniquely strong and durable CF franchise, a deep, broad and advancing R&D pipeline with multiple potentially near-term commercial opportunities, a strong balance sheet and a deeply talented and committed team, Vertex is well positioned to deliver for patients and shareholders for years to come. Our next in class vanzacaftor triple combination completed enrollment in its two Phase 3 clinical trials, SKYLINE 102 and SKYLINE 103 in patients ages 12 years and older in Q4 of 2022. We have high expectations given over five years of research that led to the discovery of VX-522 with the following properties, one, delivery of mRNA at high efficiency into HBE cells; two, expression of CFTR protein leading to high levels of chloride transport; and three, in both rodents and non-human primates expression of CFTR protein in the desired cells; and lastly, a preclinical safety profile that supported advancement into human clinical trials. One, patients in countries where we are early on the launch curve, and two, younger patients for whom we continue to pursue additional label and reimbursement extensions, such as the recent U.S. approval of ORKAMBI for ages one to two years and recent regulatory submissions for KALYDECO in children ages one to four months, and for TRIKAFTA in ages two to five years, which has received Priority Review and a PDUFA date of April 28 in the U.S. We are confident that we will reach the vast majority of these patients over time, which will continue to drive revenue growth in the near and long-term. In closing, we are excited about the opportunity to extend the benefits of our CF medicines to more patients around the globe and the near-term potential to commercialize transformative treatments for patients with sickle cell disease, beta thalassemia and acute pain. We are â\u0080\u0093 I donâ\u0080\u0099t see the musculoskeletal pain as a Vertex sales and marketing specialty opportunity, but weâ\u0080\u0099re absolutely going to serve all patients and we would partner that, but our focus is on the two Vertexian opportunities right in front of us, acute pain, very near term, and the neuropathic pain thatâ\u0080\u0099s already in Phase 2 and the predecessor molecule with successful there."
}