{
    "symbol": "ITGR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-18 23:45:24",
    "content": " And our first update on these customers during our third quarter 2020 earnings call, we project that we would generate about $40 million in sales in 2022 from the product introduction and launched customers. Last year, during our fourth quarter 2021 earnings call, we estimated that we would generate between $60 million and $80 million in 2024 sales from these emerging customers. This resulted in $372 million of fourth quarter sales, up $59 million or 19% over last year. Adjusted operating income was up 30% versus prior year to $57 million, and with adjusted net income at $37 million, we delivered $1.11 of adjusted diluted earnings per share of $0.12 or 12% from the fourth quarter of 2021. The Cardiac Rhythm Management & Neuromodulation's fourth quarter 2022 sales increased 14% over the fourth quarter of 2021, driven by sales growth in Oscor, our recent acquisition and improved supplier delivery performance versus prior quarter, particularly for the neuromodulation products. And finally, Electrochem, our non-medical segment, delivered fourth quarter 2022 sales increase of 41% versus fourth quarter 2021, driven by strong demand across all market segments and approximately $2 million of incremental sales recovery from the third quarter supplier delivery issues. To provide more color on the full-year 2022 adjusted net income performance, we decreased $6 million compared to 2021, primarily due to increasing interest rates and a slightly higher tax rate. Our adjusted effective tax rate was 16.1% for the full-year 2022 and while this remains a favorable rate, we saw a year-over-year headwind of approximately $2 million, due to the adjusted effective tax rate in 2021 being 15%. Net total debt decreased $18 million to $907 million for the fourth quarter, and our net total debt leverage at the end of the fourth quarter was 3.5x trailing fourth quarter adjusted EBITDA back within our strategic target range after stepping slightly above for the last two quarters following the Aran acquisition in April of 2022. With that, we are forecasting 2023 sales to be in the range of $1.470 billion to $1.500 billion, an increase of 7% to 9% versus last year, well above the underlying market growth rate of 4% to 6%. We expect 2023 adjusted EBITDA to be between $285 million to $296 million, which is 11% to 16% growth year-over-year. We expect 2023 adjusted operating income to be between $211 million to $222 million, reflecting a growth of 10% to 16%, which is 1.5x to 1.7x our expected sales growth. The challenging labor and supply chain environment, although improving, continues to have an impact on our sales, and we expect first quarter 2023 sales to be similar to the second half of the 2022 average quarterly sales of $358 million, with sequential growth throughout the remainder of 2023 as we continue to execute on our strategy. To close our financial discussion, I would like to pull together the impact of the several actions we are taking and summarize our cash flow generation and our net total debt projections for 2023, inclusive of reduced interest payments, operational growth and the factoring program, we expect to generate cash flow from operations between $180 million to $200 million."
}