{
    "symbol": "ITGR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-29 08:52:04",
    "content": " At $343 million, our third quarter sales grew 12% year-over-year, with currency being about 100 basis point drag, mostly driven by the euro. As a reminder, our third quarter sales would have been approximately $15 million higher if not for the deteriorating deliveries performance and missed commitments from primarily three suppliers. Our adjusted EBITDA in the quarter was $63 million, up $3 million compared to last year, which is an increase of 5%. The supplier delays reduced adjusted operating income by approximately $12 million, with $8 million of that driven by the lower sales volume and $4 million from higher manufacturing costs. Manufacturing costs are higher due to increased wages, freight and adding 5% more direct labor in the third quarter, in an effort to deliver the high end of sales guidance we had provided in July. The third quarter adjusted net income decreased $3 million compared to the third quarter of 2021, primarily driven by higher interest expenses partially offset by a $1 million benefit from the currency due to the stronger dollar. Our adjusted effective tax rate was 13.6% in the third quarter of 2022 compared to 13% in the third quarter of 2021, creating a year-over-year headwind of roughly $0.01 per share. In the third quarter of 2022, we generated $28 million in cash flow from operating activities, up 47% sequentially from the second quarter. Our $22 million of free cash flow, third quarter year-to-date reflects the impact of the $55 million of inventory increase and the $42 million of year-to-date CapEx spend as we continue organic investments in capabilities and capacity for growth. As previously shared, our updated adjusted EBITDA and adjusted operating income forecast was impacted by approximately $25 million with $17 million from lower sales volume due to the supplier delays and $8 million of higher manufacturing costs from increased wages, freight and additional direct labor. With these impacts, we expect 2022 adjusted EBITDA to be between $244 million and $260 million, which is flat to 7% year-over-year growth. We expect our 2022 adjusted operating income to be between $180 million and $196 million, reflecting a decline of 4% to a growth of 5%."
}