{
    "symbol": "ITGR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-31 10:15:02",
    "content": " At $350 million, our second quarter sales grew 12% year-over-year on a reported basis and 5% on a year-over-year organic basis, which excludes the impact from acquisitions and currency differences. Our adjusted EBITDA in the quarter was $66 million, up $12 million sequentially versus the first quarter of 2022 and up $2 million compared to last year or an increase of 3%. Adjusted operating income was $50 million, which sequentially grew $11 million versus the first quarter and is down slightly versus the second quarter 2021. In the second quarter of 2022, we generated $19 million in cash flow from operating activities and generated $7 million in free cash flow, inclusive of $12 million of capital expenditures in the quarter. You may recall during the first quarter earnings conference call, we highlighted that we grew inventory by $20 million in the first quarter versus the end of 2021 to support our double-digit sales growth in the second quarter. In the second quarter, we increased inventory another $20 million, so a total of $40 million in the first half of the year. Net total debt increased $127 million to $938 million, as we borrowed $129 million from our revolver in the 1st and 5th April of 2022 and to fund the acquisition of Aran, excluding the new borrowings, we reduced our net total debt by $2 million in the second quarter. Trailing fourth quarter reported sales grew 16% in the second quarter of 2022 with strong growth across our Cardio & Vascular, CRM & N and Electrochem product lines. Moving to the cardiac rhythm management and neuromodulation product line, sales grew 2% in the second quarter with sales growth from our Oscor acquisition offset by labor and supply chain constraints, primarily related to long lead time components. Though we see strength in our customer demand, our ability to fulfill was constrained by specific supplier shortages impacting approximately $3 million of sales in the second quarter. Starting with sales, we are increasing our outlook by $14 million and now expect sales to be in the range of $1,370 million to $1,395 million, an increase of 12% to 14% compared to 2021."
}