{
    "symbol": "VOXX",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-12 13:17:05",
    "content": " Through the first half of fiscal '23, sales were down at approximately 9%, gross margin declined by 180 basis points, expenses were up 3% and we posted an adjusted EBITDA loss of $3.4 million, compared to an adjusted EBITDA of $14.7 million in the first half of fiscal '22. Within premium audio, sales of premium home speakers and wireless speakers were down $24.5 million, but this was offset by an increase of $18.4 million in sales of Onkyo and Pioneer products, and a $3.7 million increase in sales from our PAC Australia subsidiary. Aftermarket sales declined by $7.4 million, and as Pat noted, this was mainly due to a lack of new vehicles at car dealers and lower purchases at retail due to the economy. Biometric segment sales were up approximately $80,000 due to a new customer account, and we're expecting more meaningful top-line increases in the second half of the fiscal year. For the fiscal 2023 second quarter, we reported total operating expenses of $39.2 million, down approximately $700,000 year-over-year. General and administrative expenses increased by $1.2 million, due primarily to an $800,000 increase in depreciation and amortization expenses, related primarily to the amortization of intangible assets of the new Onkyo subsidiary, and approximately $200,000 increase in restructuring costs related to the relocation of certain OEM production operations to Mexico. During the fiscal 2022 second quarter, we incurred acquisition costs of $2.3 million related to the Onkyo asset purchase agreement, and the joint venture created with Sharp to complete the transaction. Lower sales and gross margin, coupled with a modest increase in operating expenses resulted in an operating loss of $10 million, as compared to operating loss of $2.7 million in fiscal 2022 second quarter. Total other income expense was a net loss of $1.7 million in fiscal 2023 second quarter, as compared to total other income net of $1.8 million in the comparable fiscal 2022 period. The primary drivers of the $3.7 million year-over-year increase were: one, a $1.7 million net foreign currency loss primarily related to the decline of the Japanese yen; and two, at $1 million charge representing interest expense related to the interim arbitration award accrued during fiscal 2023, which was not present in comparable period prior year period. Total debt was $37.7 million, as compared to $13.2 million, with the increase primarily related to $27.4 million outstanding on our domestic credit facility, as we used our facility for working capital purchases to secure inventory moving into fiscal 2023 third quarter. The additional variances related to one, a $1.9 million reduction in our Euro ABL obligation for VOXX Germany, which was incurred in fiscal 2022 and nothing is currently outstanding; two, lower debt associated with a Florida mortgage and three, of decline in the shareholder loan payable to Sharp."
}