{
    "symbol": "PGTI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 13:41:03",
    "content": " Sales in our southeast region were impacted by both events, leading to sales of 243 million during the quarter, an increase of 5 million versus the prior year quarter. Adjusted selling, general and administrative expenses increased 60% in the fourth quarter, compared to the prior year, driven by SG&A from our recent acquisitions, the expansion of our new staff operations, increased labor and distribution costs and an increase in marketing investment. Adjusted EBITDA was 48.2 million flat with the prior year quarter resulting from increased sales offset by the inefficiencies experienced, resulting from the two aforementioned disruptive events. As we mentioned on our third quarter call, we had entered into a new five year 250 million revolving credit facility in October, which was used along with cash on hand to fund the Martin acquisition. Looking ahead to 2023, we would expect capital expenditures to be within 3% to 4% of sales, first quarter interest expense to be within 8 million to 9 million, depreciation and amortization to be around 15 million, and our tax rate to be 24% to 26%. We expect our revenue for the first quarter to be in the range of 370 million to 390 million, supporting these sales levels was a pickup in orders in November, December and January in the southeast region, which exceeded prior year levels. I think as the year progresses as we get into q2, as we move into April, May timeframe that may exist and at that time, we may be able to give you full year guidance or the remaining year guidance for that but what we would like to see is some stability in the markets and just not so much movement in an opinion by various prognosticators out there as far as what's happening with the economy, and then each of our end markets, the new construction market, R&R market, whatever it may be just some more stability in that that will give us more confidence as far as how to forecast the remainder of the year."
}