{
    "symbol": "OXBR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 19:33:02",
    "content": " With respect to net premiums earned for the year ended December 31, 2022, increase marginally to $995,000 from $965,000 due primarily to the acceleration of premium recognition on 2 of our reinsurance contracts, tougher limit losses due to the impact of Hurricane Ian during 2022 as well as higher rates on reinsurance contracts in 2022 when compared to the prior year. We experienced a small $35,000 unrealized loss in 2022 due to a fair value change in our equity investment in Oxbridge Acquisition Corp when compared to the prior year where we recognized a $9.2 million unrealized gain. Total expenses included in loss and loss adjustment expenses, policy acquisition costs and general and admin expenses for the year ended December 31, 2022, were $2.5 million, up from $1.6 million in 2021. Largely due to the loss and loss adjustment expenses in 2022 and a significant change in the unrealized valuation of SPAC in 2022, we experienced a net loss of $1.8 million or $0.31 per share in 2022 compared to net income of $8.6 million in fiscal 2021. The loss ratio increased to107.8% for the year ended December 31, 2022, compared to 16.4% in the prior year, again, due to the limit loss suffered on two reinsurance contracts, which was partially offset by a higher denominator in net premiums earned. Our expense ratio, which measures operating performance compared to policy acquisition costs and general and admin expenses with net premiums earned, the expense ratio increased 152.1% -- increased to 153.1% for the year ended December 31, 2022, from 146.2% in the prior year primarily due to the higher general and administrative expenses in 2022. Notably, in the balance sheet, our investment portfolio increased to $642,000 at December 31, 2022, from $577,000 in the prior year and due primarily to net purchases of equity securities during the year partially offset by unrealized losses we experienced due to the volatile capital markets. Other investments, which is the investment in SPAC increased marginally due to the positive change in the fair value of our investments in Oxbridge Acquisition Corp. Cash and cash equivalents and restricted cash and cash equivalents decreased to $3.9 million at December 31, 2022, compared with $5.4 million at December 31, 2021."
}