{
    "symbol": "LGMK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-28 18:42:05",
    "content": " And so adding those sort of features around machine learning and AI is one of the ways for us to actually fine-tune that fall detection to really be personalized to the individual, as well as giving us the capability to also take the aggregate data and be able to sort of learn more on how your sort of pattern of movement and so forth compared to those where we have similar age and perhaps the health background. Secondarily, you will see that all of our new products moving forward will include new sort of hardware features that make it much more modern in terms of sharing data for you to share data with us and for your caretakers to check and look to you and get the much more interactive experience and then we can add that to a better learning and understanding of who you are from a health communications perspective. But we -- our technology, so we are building our own technology, so that means that we are building our own AI algorithm, we are building our own user experience that is more conducive to end user, your elderly loved ones, so that user experience is much more positive towards somebody who is aging, as well as a user experience that is conducive to a multi-care taker environment, whether or not that be a family of three or four, whether or not itâ\u0080\u0099s a family of three or four in the next door neighbor and the professional care taker, right, because thereâ\u0080\u0099s a lot of coordination thatâ\u0080\u0099s involved. And so we are really focused on trying to bring a comprehensive technology suite to the market versus basically, hey, we are a monitor focused company and here is the independent product that we didnâ\u0080\u0099t build, that we are going to make offerings to you and we will connect our sort of call services to instead offering product that have the same user experience across the Board. So we donâ\u0080\u0099t have to relearn that, but also have a really wonderful sort of caretaker experience as well, because we know that at the end of this sort of product, itâ\u0080\u0099s not just about people who are wearing the devices, but itâ\u0080\u0099s also the people who care about them, the younger generation who also wanted to make sure that their family members are safe and now coordinating their care. Thereâ\u0080\u0099s thousands out there that we still need to talk to, as well as actually starting that initial foray into discussions on the B2B side with distributors and people who are operators of in-home networks for care, as well as retirement communities, because, again, some of our services that we are going to be rolling out really tied to these particular products and having the monitor services tied to those in-home care facilities and partners."
}