{
    "symbol": "DT",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-01 12:05:05",
    "content": " Excluding the impact of currency and perpetual license roll-off, the net new ARR added in the quarter was $81 million, roughly $20 million higher than the expectations we shared in our last call, driven by strong new logo additions. Moving on to the building blocks of ARR growth for the business, we added 250 new logos in the third quarter, up 4% year-over-year and exceeding our expectations. Moving on to revenue, total revenue for the third quarter was $297 million and subscription revenue for the third quarter was $279 million, both up 29% year-over-year and exceeding the high-end of our guidance by $11 million, of which FX was $4 million. On the go-to-market side, we invested $98 million in sales and marketing this quarter or 33% of revenue, down 200 basis points year-over-year and up 50 basis points sequentially as we ramp seasonal marketing program spend and continue to prioritize targeted investments in expanding our partner programs. Our operating income for the third quarter was $81 million, resulting in an operating margin of 27%, exceeding the top end of the guidance range by over 150 basis points driven primarily by revenue upside and disciplined spend management. And finally, we expect free cash flow to be between $315 million and $321 million, representing a free cash flow margin of 27.5% to 28% of revenue, down 25 basis points at the midpoint as we firmed up cash tax expectations, which are slightly higher than prior guidance. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. I mean I will just â\u0080\u0093 we obviously had a very strong Q3, effectively $20 million higher than our expectations that I think we had shared before that we thought net new ARR would be about $120 million in the back half, call it, split 50-50 between Q3 and Q4, came in at roughly 80%."
}