{
    "symbol": "DT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-03 09:51:11",
    "content": " With respect to margins, gross margin for the first quarter was 84%, down 1 point from Q1 of last year, primarily due to the investment in our customer success initiative, which led to a further strengthening of our impressive growth retention and net expansion rates. On the go-to-market side, we invested $94 million in sales and marketing this quarter, up 31% over last year and within our current target investment zone of 34% to 36% of revenue. Our non-GAAP operating income for the first quarter was $60 million, resulting in an operating margin of 23%, in line with our expectations given the planned targeted investments we previously communicated. Please proceed with your question. The new logging capabilities will be a contributor, primarily towards the end of Q3 going into Q4 but obviously, a much more meaningful contributor over the next two years, where we certainly think, within two years, that can be a $100 million piece of business for us. Please proceed with your question. Although, you're tempering some of your new business expectations based off the macros, has there been periods of time where, historically, customers that are perhaps running multiple observability or monitor entries, look at this as an opportunity to say, hey, like I'm running for, I don't need to -- I'm going to try to consolidate on maybe one or two. Please proceed with your question. Please proceed with your question. But I think when we think about the next couple of quarters, Q2, Q3, Q4, we just think there's going to be sort of this push of new logos throughout the course of the year just based on buying patterns and how we've seen new logos come, and those things are going to take a little bit longer. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}