{
    "symbol": "VNT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 10:58:28",
    "content": " We've also made progress on turning around the Teletrac Navman business, which is now returning to growth and expanding operating margins, and increase product vitality at Matco, which announced a new strategic supplier relationship with Milwaukee Tools in September that will contribute several points of growth next year. Our ANGI Energy business is a leading supplier of compressed natural gas dispensing technology with nearly $75 million in projected revenue this year, up about 40% from prior year levels and expected to remain a strong contributor in the next year. We're initiating Q4 guidance for adjusted EPS of $0.73 to $0.78, which assumes low single-digit core growth or mid-single digits excluding the impact of EMV. Given the changes we've discussed, we now anticipate EMV revenues to decline a little over $100 million year-over-year and materially an end to EMV upgrade activity. It is important to note that we are getting visibility into core U.S. fueling dispenser demand for 2023, which is reflective of the convenience store national accounts, new site builds, resulting from ongoing industry consolidation and the next wave of refresh and product upgrade activity, which will also drive growth in the years to follow. And when you think of Q4 guide, really the few impacts, the EMV, obviously, the $50 million pull-in that Mark mentioned, we also have FX impacting us guide to guide, which is $15 million for the second half from a revenue perspective, about $0.04 from an EPS perspective, interest up a little bit, and then just a little bit of other revenue, which impacts us a couple of cents from an EPS perspective. This $250 million number is sort of down from what it was prior to EMV already, it's sort of estimating it, and it will grow from that $250 million base because we believe that there will be continued regulatory cycles here that will continue to drive growth in that industry."
}