{
    "symbol": "VNT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 12:12:58",
    "content": " Robust demand, strong price and cost actions combined with continued progress on our profitable growth initiatives more than offset the unfavorable mix impact from a decline of nearly $60 million in EMV revenue. Given our strong performance in the quarter and our previously announced $250 million accelerated share repurchase program, we're raising our full year 2022 adjusted diluted net EPS guidance to $3.20 and to $3.30 per share. We're also initiating our second quarter adjusted diluted net EPS guidance of $0.68 to $0.72, which includes assumptions of flat core revenue and adjusted core operating margin, against a very challenging comparison in the prior year period, where we delivered 33% core revenue growth and 450 basis points of adjusted core operating margin. Core revenue growth was essentially flat, as continued supply chain challenges and component shortages constrained EMV sales by over $25 million in the quarter. The increase in operating profit and strong execution drove incremental margin of 30% and adjusted core operating margin expansion of 20 basis points, despite flat core growth, reflecting continued benefits from our profitable growth initiatives and early price actions. Our net leverage stands at 3.3 times adjusted EBITDA at the end of the first quarter, temporarily elevated due to the timing of large cash outflows related to our $250 million accelerated share repurchase program, as well as the acquisition of drives during the quarter. For full year 2022, we are maintaining our core revenue guide of low to mid-single-digit growth, despite our expectation that EMV will be closer to the high end of the range or a $50 million headwind and core operating margin expansion of 30 to 60 basis points. Our confidence in delivering these results reflects continued execution on our profitable growth initiatives and price cost management, partially offset by inflationary pressures, ongoing supply chain, and logistics constraints, and mix, driven by lower EMV and other regulatory driven sales. We are raising our adjusted earnings per share range to $3.20 to $3.30, reflecting our updated share count, continued execution, and growth in our core non-EMV business. Moving on to the second quarter of 2022, we expect core revenue growth will be flat as the strong demand environment is offset by lower conversion of high-margin sales resulting from ongoing supply chain constraints and component shortages. Most importantly, post this EMV period, we expect to have a re-baseline core revenue growth rate of mid-single-digit plus at accretive margin and continued strong cash flow which positions us well to deliver compounding earnings growth ahead of revenue growth. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}