{
    "symbol": "VNT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 11:48:03",
    "content": " Adjusted operating profit for the fourth quarter was $190 million, down slightly versus the prior year with a corresponding decline in operating profit margin impacted by anticipated product mix dynamics, continued growth investments and a full quarter of Invenco revenue. As expected the Teletrac Navman business posted its first quarter of core growth, up low single digits with strong momentum as we exited the year as ACV ended 2022 up low double digits. Fourth quarter adjusted free cash flow was $175 million, up 15% year-over-year with conversion of 137%. For the full year, adjusted free cash flow was $314 million, with adjusted free cash flow conversion of 63%. We repurchased approximately $40 million in shares in the fourth quarter, which brought us to just over $325 million for the full year or nearly 14 million shares. We are initiating a Q1 2023 guide of adjusted EPS of $0.57 to $0.62, which assumes a core revenue decline in the low to mid-single-digits and adjusted operating profit margins down in the range of 100 to 140 basis points. I want to point out that this guidance, as previously communicated assumes a $300 million revenue headwind from the year-over-year decline in EMV, which translates to about $150 million in operating profit pressure or around 250 basis points of margin. From a prior year perspective, our guide did include Invenco revenue of just over $20 million with no operating profit in the fourth quarter. So just on the EMV headwind, the $3 million obviously no change there but I think the math is $25 million to $50 million of year-over-year headwinds in the first quarter based on the guidance points. And I guess just my one follow-on there, and I know we've talked about this the EMV sunsetting quite a bit already today, and fully recognize that you're confident in the $250 million number. But if you take a look at the fourth quarter, there really was only a one point difference between your core growth and ex-EMV growth, which is like roughly $8 million."
}