{
    "symbol": "WGO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-19 15:15:03",
    "content": " Additionally, our team executed and managed the businesses through supply shortages and pricing actions to cover significant cost inflation through the year, delivering annual record net revenues of $5 billion, record annual RV market share of 12.7% and a record gross margin of 18.7%. Gross profit margin of 17.8% was 30 basis points lower than last year as a result of higher material and component costs, including higher logistics costs and lower volume in the Towables segment and associated deleverage, partially offset by pricing actions and the timing of those actions as compared to the realization of increases to our input costs. Capitalizing on strong consumer demand and the need to replenish dealer inventories, Winnebago Industries delivered record annual consolidated fiscal 2022 results, including record revenues of $5 billion, a record gross profit margin of 18.7% and record reported earnings per diluted share of $11.84 and adjusted earnings per diluted share of $13.81. For the full year, revenues for the Towables segment were $2.6 billion, up 29.2% over fiscal 2021, driven by strong consumer demand and pricing actions that were taken to offset higher material and component costs. The Motorhome segment continued to perform well with fourth quarter revenues of $555.8 million, up 23.8% from the prior year due to continued strong unit sales and pricing actions related to higher material and component costs. Adjusted EBITDA margin for the quarter was 13.9%, representing an increase of 270 basis points over the prior year due to pricing actions and production efficiencies, partially offset by higher material and component costs. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I think as I mentioned earlier in one of the earlier questions, we are seeing dealers be more aggressive in terms of pricing in the market, particularly on Towables, but even in some categories like Class B vans where there is -- there's significant consumer demand and dealers are fighting for share themselves as well. Your line is open. Your line is open. And I guess the reason I asked the question is I think there's some debate as to whether or not we're looking at sort of a one-year shakeout, right, which would be, I think, consistent with maybe what we've seen in the past 2018, 2019 time frame where it was sort of an industry rightsizing itself or versus 2024 is there sort of more declines to come, which would maybe be more consistent if, in fact, there are macro pressures mounting. Your line is open. Your line is open."
}