{
    "symbol": "WGO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-06-22 16:56:02",
    "content": " While we will absolutely demonstrate production discipline in our Towables RV businesses and look to match output with dealer turn targets and retail demand, both of our Motorized RV businesses and our two Marine businesses have further runway to carefully drive increased shipment revenue in the short-term. Recall also that we included multiple earn-out periods structured in such a manner that the multiple on this acquisition is further reduced as the earn-outs escalate, as such, recognizing an additional $11.8 million of contingent consideration fair value adjustment this quarter is a result of Barlettaâ\u0080\u0099s continued strong performance, a maximum of $50 million in earn-outs can be earned for performance achieved in calendar 2022 and 2023, and are tied to the business achieving certain gross profit objectives in each year and in the aggregate. Revenues for the Towable segment were $805.6 million for the third quarter, up 45% from the prior year, primarily driven by pricing increases across the segment in addition to solid unit growth related to producing and shipping units to fulfill a robust dealer order backlog. Your line is now open. And we really run the business on a day-to-day level with seven different business units at the company, and as I mentioned in my comments, five of those business units we believe still continue to have near-term growth potential in terms of both retail being decent especially on the Marine side currently, but also our ability to grow wholesale shipments probably even faster than the retail velocity on those businesses. Your line is now open. Your line is now open. And our business there, well, as I mentioned, we are keeping an eye on retail, Motorized retail had been running a little healthier than Towables retail for most of the front half of calendar 2022, that seems to be coming a little bit down as I said a few minutes ago, but we still believe that there is field inventory runway in several of the Motorized RV segments such to the degree that we will continue to sustain Motorized RV production at levels that you probably have seen here this fiscal year so long as we can get parts. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And I will suggest that the industry in 2022 has been more rational in macro with adjusting to now a more difficult retail environment then probably in some periods in the past, especially in the 2018, 2019 period and all signs of competitive production activity that we are seeing in the summer months on Towable RVs suggest to us that OEMs are adjusting their production schedules to try to prevent excessive inventory in the market as we head into the fall of 2022. Your line is now open. Your line is now open. On Towable RVs, our businesses will be running less weeks of production the remainder of calendar 2022, as retail obviously is lower than we had anticipated at the beginning of calendar 2022 and the dealer, again field inventory is in a healthy full state. Your line is now open."
}