{
    "symbol": "TITN",
    "quarter": 3,
    "year": 2023,
    "date": "2022-11-30 11:57:08",
    "content": " Due to the improved operating efficiency that we've been focused on driving over the last several years across our optimized footprint, we continue to realize a commensurate lift in our pre-tax margin as a result, which for third quarter reached 7%. It's great to see the continued pre-tax profit contribution from our International segment due to solid new and used equipment margins, and growth in the important parts and service product support business. Our equipment business increased 54.3% versus prior year, driven primarily by strong same-store sales in our Agriculture and Construction segments and further supported by contributions from our Jaycox, Mark's Machinery and Heartland acquisitions, which were not in the prior year's third quarter results. On Slide 9, our gross profit for the quarter increased 50.9% to $140 million and gross profit margin increased by 50 basis points, driven primarily by stronger equipment and parts margins. Operating expenses increased $21.9 million versus the prior year to $84.9 million for the third quarter of fiscal 2023, primarily due to the inclusion of Heartland operating expenses, starting in August 2022, as well as higher variable expenses on increased revenues and some remaining acquisition related costs associated with the Heartland transaction. In the third quarter of fiscal 2023, our adjusted net income nearly doubled to $41.5 million, which equated to adjusted earnings per diluted share for the quarter of $1.83 and compares to last year's $0.96 performance. Agriculture segments sales increased 75.2% to $493.3 million, which once again helped drive nice operating leverage and resulted in segment pre-tax income increasing 114.3% to $42 million, representing a pre-tax income margin of 8.5%. Pre-tax income grew 70.2% to $6.1 million versus the prior year period, representing a margin of 7% which was 250 basis points improvement versus the prior year quarter. Overall, our adjusted pre-tax income increased 88.7% to $112 million for the first nine months of fiscal 2023 representing a margin of 6.9%, which is 200 basis points higher than the prior year period and demonstrates improvements across all segments of our business. Our equipment inventory at the end of the third quarter was $474 million, an increase of $150 million from January 31, 2022, which was essentially driven entirely by an increase in new equipment inventories coming from both our supplier deliveries and current year acquisitions. The receipt of these orders generated the higher sales performance and are reflected in the $150 million increase in new equipment inventory, which includes a high percentage of presold units awaiting pre delivery setup from our service team, with deliveries to customers expected in the fourth quarter. And again, it's some of those typical fourth quarter, mostly mix items that that happened where we're expecting it to be down somewhat from what we've experienced, some of that mix would be less on the international side, less equipment revenues, and then just some of the bigger deals and higher price tag units going out more so in that fourth quarter that would bring it down."
}