{
    "symbol": "TITN",
    "quarter": 2,
    "year": 2023,
    "date": "2022-08-25 15:16:15",
    "content": " Revenue grew 32% to $496.5 million in fiscal second quarter, and we're pleased to deliver a second quarter earnings per share of $1.10, which marks the highest quarterly earnings performance in our 42-year history. Our equipment business increased 37.6% versus prior year, driven primarily by strong same-store sales in our agriculture segment and further supported by contribution from our Jaycox and Mark's Machinery acquisitions, which were not in the prior years second quarter results. On slide nine, our gross profit for the quarter increased 36.9% to $103 million and gross profit margin increased by 80 basis points driven by the expansion of equipment, parts and rental margins. In the second quarter of fiscal 2023, our adjusted net income nearly doubled to $25 million, which equated to adjusted earnings per diluted share for the quarter of $1.10 when compares to last year's $0.56 performance. Agriculture segments sales increased 59.1% to $349 million and helped drive nice operating leverage, resulting in segment adjusted pre-tax income increasing 106.3% to $24.9 million which represents a pre-tax income margin of 7.1%. Revenue decreased 13.5% to $70 million compared to the prior year period, due to the loss sales contributions from the company's recent divestitures in this segment. Pre-tax income grew 39.4% to $3.9 million versus the prior year period, representing a margin of 5.6%, which is a 210 basis point improvement versus the prior year quarter. The revenue of our international segment was essentially flat at $77.6 million versus the prior year, despite an 11% currency headwind on a weakening Euro, and the disruption within our Ukraine business due to the ongoing conflict in that market. The receipt of these orders generated the higher sales performance and are reflected in the $130 million increase in new equipment inventory, which includes a high percentage of pre-sold units awaiting pre-delivery setup from our service team with deliveries to customers expected in the back half of the year."
}