{
    "symbol": "MPAA",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-13 12:21:07",
    "content": " As someone mentioned, we achieved record net sales for the fiscal first quarter, reaching $164 million, an increase of $15 million or 10% from $149 million for the prior year. The total cash impact of these transitory costs, including freight and tariffs related to supply chain disruptions on gross profit, was $2.5 million compared with $4.8 million a year ago, as referenced in Exhibit 2 of this morning's earnings press release. The increase was primarily due to a noncash loss of $678,000 for the mark-to-market, foreign exchange impact of lease liabilities and forward contracts compared with a noncash gain of $2.5 million for the prior year first quarter. Additionally, results were impacted by items that totaled $6.9 million or $0.36 per share as follows: these include noncash items totaling $4.2 million or $0.22 per share, including core and finished premium amortization and revaluation of cores and customer shelves totaling $3.6 million, as previously explained. Interest expense was $6.9 million compared with $3.9 million for last year, primarily due to higher interest rates on the accounts receivable discount programs offered by our customers and higher borrowings to support higher sales. These include noncash items totaling $2 million or $0.10 per diluted share, including a noncash gain of $2.5 million or $0.13 per diluted share on a pre-tax basis for the foreign exchange impact of lease liabilities and forward contracts and cash items totaling $5.6 million or $0.29 per diluted share, primarily transitory costs related to supply chain disruptions. EBITDA was impacted by $5.5 million of noncash items as well as $3.7 million in cash items, primarily due to the transitory costs related to supply chain disruptions. EBITDA a year ago was impacted by $2.7 million of noncash items as well as $7.3 million of cash expenses, primarily transitory costs related to supply chain disruptions. Net cash used in operating activities during the fiscal first quarter was $982,000 versus $4.7 million cash used in operating activities in the prior year period. And as we ramp up through that, we expect, again, we mentioned that we think our brake product lines can reach $300 million and I think the speed depends on how fast we can ramp it and get changeovers done on customers' shelves. And then just lastly, you mentioned a goal of $300 million between sort of the new brake products that you've launched over the next three to five years. I mean, today, we include brake calipers in the brake-related products, so that mix is we're pushing close to $100 million in that business as we get through our commitments with all of our new customers."
}