{
    "symbol": "FREY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 15:56:02",
    "content": "  With me today on the call are Tom-Einar Jensen, our Chief Executive Officer; Jan Arve Haugan, our Chief Operating Officer; Oscar Brown, our Chief Financial Officer; and Jeremy Bezdek, Executive Vice President of Corporate Development and President of FREYR Battery U.S. During today's call, management may make forward-looking statements about our business. We have a number of ongoing RFQs and partnership discussions, also from the EV-focused OEMs, which should further capitalize larger scale projects with project level financing solutions and deeper strategic partnerships at double to triple digit gigawatt hours scale annually. It's a function of actually having a viable business case which as Jeremy alluded to, we are working on various different options from, let's call it, brownfield type options to more fast-tracking first couple of production lines from a larger greenfield development. And so, it's not overly defined yet, but it will be over the next four to six weeks as we narrow it on, quite frankly, bringing into production -- the start of production timeline from 2026, which we had talked about previously into 2025, the team is hard at work, and it's sort of -- this is a bit of we're announcing an acceleration approach and we'll be coming back with the actual plan here over the, like I said, in a very short period of time. So yes, so the project financing is a key piece for Giga Arctic that has conditions precedent in the term sheet that we're negotiating that relates to many things but primarily, or in part, the CQP production, so getting it ramped up, testable batteries as we've talked about, an acceptance by our primary customer, in this case, Nidec. We're also working actively with the relevant stakeholders in the 24M ecosystem to support the ramp-up from an experience of SemiSolid production point of view, but also from a high-speed coating based manufacturing process point of view as well as working with Nidec to provide scaling expertise as they are deep into sort of scaling energy intensive processes in their own field. And on the other hand, we see an opportunity to offer our experience in energy, energy intensive and process intensive industries and that combination is part of what is triggering a broad variety of stakeholders again multibillion dollar global companies to actually one thing to partner with FREYR not only from battery cell production point of view but also potentially upstream. You should expect us to communicate around additional customer traction, which could also branch into mainstream EV and you should expect us to sort of a course report on progress on the financing side ESS project finance and or additional industrial strategic or financial partners on project level or otherwise as we might see appropriate."
}