{
    "symbol": "FREY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 12:52:10",
    "content": " The Inflation Reduction Act would benefit FREYR and Giga America in a number of ways, including a $35 per kilowatt hour tax credit for cell manufacturer in the United States, a $10 tax credit on the manufacturer of module impact, and a 10% tax credit related to the production of anode and cathode materials in the U.S. As important, the simplified ability to transfer and monetize these tax credits, including a direct pay option is incredibly helpful to high growth companies like our own. These benefits should substantially improve the economics of U.S. Gigafactories, stimulate already strong demand for energy storage system products, and battery storage development projects in the U.S. by reducing cost and facilitating U.S. supply chains, thus also reducing the industry's carbon footprint. As shown on the financial update slide in the earnings deck, naturally cash was spent on corporate overhead, operating expenses, and capital expenditures, primarily supporting the customer qualification plant and Gig Arctic, as well as initial spending on our U.S. Gigafactory joint venture with Koch, our proposed project in Finland and other business development activities. So we think that we will implement eight production lines, so called generation three equipment in the U.S., if all of that is LFP and it's the generation three equivalent that we're having in Giga Arctic, you could expect the capacity of Giga America, a working title for our facility in the U.S. to be around 35 gigawatt hours. Again in a partnership based way, focusing again on the speed scale and sustainability mantra and renewable energy is going to be core for us when we locate ourselves in the U.S. and our site selection process that we are well advanced in, moving from more than 150 location across 25 states to now less than five and let's call it final contenders, all sort of show very promising features in terms of not only these more general incentives on a federal level, but also state by state very strong sort of packages to support and accelerate the development in the U.S. If you can comment like, talk about pricing here, I think some of your contracts, I donâ\u0080\u0099t know if you discussed some arrangements, even for the Giga Arctic for U.S. site, just this $30 per kilowatt hour subsidy or production incentive, does that change these discussions with your customers in terms of like, what that pricing could be for the deliveries or how do you think the $30 is going to impact pricing going forward for you at least for the U.S. market?"
}