{
    "symbol": "ACMR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 14:56:09",
    "content": " The range of the company's 2022 outlook reflects among other things, the impact from the new U.S. trade policy, supply chain constraint, various of spending scenario for the production ramping of key customer and timing of our acceptance of first tool on the evaluation field and assuming stability with respect to the COVID-19 pandemic in China. Your line is open. And then the second question is just, can you give us some sense of the split between what percent of revenue is affected from shipments to advanced facilities in China, the DRAM, the 128-layer NAND versus how much of your -- how much of the impact is due to parts that contain -- or sorry, tools that contain U.S. parts and/or the new tools that are affected by the ECCN classifications? So for our major revenue and we still can use in U.S. parts and also U.S. firstly involve to stay out of the parts with a mature nodes customer, right. Your line is open. So with this the preparation, I think we're well positioned to have a Korean to make a tool, of course, can sell back to China and will also prepare -- the tool made in Korea to the sell to the Taiwan and also sell to the, I call it, U.S., or European market, right. So at this moment, I think we have our two manufacturing vendor, one in China, one in Korea and also we have to more of a product more effort and to work with the Korean top player and their customer here and also to do the R&D research and advanced nodes, right. However, as time going on, we have a profit generating in China and we do can -- well, we can bring some dividend back to U.S. And last year, we didn't do anything, but we were still considering in this L1 (ph) option and put it in cash back to U.S. not necessarily we want to buyback share, really important when we're trying to enhance our R&D and also sales effort and to exploring further U.S. and European market. Your line is open. Actually, Charlie, I really couldn't say, rare near future, right, I wouldn't say next quarter to quite kind of retail, but I just recall the high level point of view, as I said, China is still consumption a lot of mature nodes and products, right. Your line is open. Your line is open."
}