{
    "symbol": "LYV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 21:05:13",
    "content": " Even as show count and attendance grew, fans demonstrated their willingness to pay more for the best seats with the average price of a ticket for our concerts this year up 10% globally relative to 2019, which remains less in the U.S. inflation level over the period. We are seeing the benefit of operating more venues as a number of fans who attended shows in our owned and operated venues during the quarter was up 13% to over 14 million fans, and we expect that figure to reach over 50 million fans for the full year. And fans are spending more on site with average per fan revenue up 20% at each of our amphitheaters, festivals, theaters and clubs relative to 2019, with the average per fan revenue at our amphitheaters this year at $38.50, up 30% relative to 2019. Our ticket business also demonstrated strong growth in the quarter, transacted fee-bearing ticket volume up 48% to 77 million tickets and transacted GTV up 76% to $7.3 billion, both relative to 2019. Along with the volume increase, transacted ticket prices globally was up approximately 15% for the first half of the year relative to 2019 as both concerts and sporting events saw similar low double-digit price increases during the period. As we further enabled more brands to connect with an increasing number of fans on a global basis, festival sponsorship has performed particularly well during the first half of the year, more than doubling from 2019, led by nine new festivals in our Mexico and Latin American businesses that accounted for roughly half this increase, along with broad growth in sponsorship levels across most of the North American festivals. In our reported AOI of $480 million for the quarter was $160 million better than 2019, up 50% and led by an improvement of over $100 million in ticketing and $80 million in sponsorship. Next, ticketing had another very successful quarter, delivering $231 million of AOI, making it the most profitable quarter ever for ticketing, beating the record set just last year in the fourth quarter and nearly doubling the Q2 2019 AOI results of $124 million. Transacted ticketing GTV, excluding refunds, was $7.3 billion, our highest quarter ever, besting our former record of $6.6 billion of Q4 of 2021 by 11% and $3.1 billion and 76% higher than Q2 of 2019. International markets are now largely back and contributing to this growth with transacted ticketing GTV up 67% relative to Q2 2019. Our concert ticket sales through the end of July are over 100 million tickets for events this year, up 38% and higher than our full year 2019 fan count. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}