{
    "symbol": "LYV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 23:23:03",
    "content": " As a result, we generated over $5 billion of revenue and $281 million AOI for the quarter, up 67% and 44% respectively relative to 2019 Q3. As we have grown attendance, we have also continued driving greater market pricing for our concerts and now expect to transfer over $550 million of additional payments to artists this year, continuing our effort to help artists get the full value from their shows. Beyond these specific leading indicators, going into 2023, we expect we will drive growth in our concert business by adding more venues to our portfolio, continued increase in ancillary per fan revenue and furthering our efforts to deliver market value for the shows to the artists. Looking a bit deeper at our fan metrics, stadium attendance more than tripled to 8.7 million fans in Q3 of this year and festival attendance was 6.5 million fans in the quarter, up nearly 40% from Q3 of 2019 with premier events, including Rock in Rio, Rock Werchter, Reading and Lollapalooza. For tickets sold to shows at our amphitheaters, arenas and stadiums globally this year, front-of-house pricing increased for each by double-digits relative to 2019, while starting prices for all shows in the U.S. rose just 6% and remain under $35 on average. Next, ticketing had another successful quarter, delivering $163 million in AOI, nearly 30% higher than Q3 of 2019. As a result, revenues are close to $1.6 billion for the first 9 months of the year, which is up almost $500 million or 45% compared to 2019. Finally, growth in our high-margin sponsorship business continued this quarter, with revenue up 59% relative to Q3 2019 and now up 64% year-to-date. As we look to the remainder of 2022, starting with our leading indicators through late October, all relative to 2019, concert ticket sales are over 115 million tickets for events this year, up 37% and 20% higher than our full year 2019 fan count. Second, Ticketing has sold over 200 million primary fee-bearing tickets for events this year, up 27% relative to 2019 at this point. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. We did over 8,000 club shows last year and 95% are going to make money and do well and the artists will deliver those 400 tickets or 1,100 tickets as they are building their business and their costs are associated with it. Please proceed with your question. Please proceed with your question."
}