{
    "symbol": "SWAG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 13:02:06",
    "content": " The company issued a press release today, August 15, 2022 containing its second quarter financial results which is also posted on the company's website. The company's management will now provide prepared remarks reviewing the financial and operational results for the three months ended June 30, 2022. Before we get started, we would like to remind everyone that during this conference call, we may make forward-looking statements regarding timing and financial impact of Stran's ability to implement its business plan, expected revenues and future success. These statements involve a number of risks and uncertainties and are based on assumptions involving judgments with respect to future economic, competitive and market conditions and future business decisions, all of which are difficult or impossible to predict accurately and many of which are beyond Stran's control. Importantly, our year-over-year organic revenue increased 49.4% reinforcing our traction in the market. And we continue to maintain a solid balance sheet with over $28 million of cash and cash equivalents as of June 30, 2022 and no long-term debt. We're proud to once again achieved record revenue numbers and believe this is a direct result of our business growth strategy through expansion of our geographic footprint, entering new verticals and opportunistic acquisitions that complement our existing platform. Given the high profile companies headquartered in this area, we believe expanding our presence within this key geography will provide significant opportunities to grow our operations and customer base. By executing on our M&A goals, we have increased our customer base, grown our capabilities within the beverage space and with Trend we look forward to expanding our geographic presence within the United States, especially within the Houston Texas area and southern United States. Given the fragmented nature of this industry, we believe that our strategy of acquiring undervalued and accretive businesses will remain a key aspect of our continued growth, bringing together innovation, relationships and top-tier talent. We continue to explore opportunities in the market that are in active acquisition discussions with companies we believe would add value to Stran, including expanding our geographic presence and enhancing our capabilities. Since our obsession -- since our inception, we have invested heavily in our infrastructure in order to provide comprehensive offering with unique value proposition which has resonated very well with customers and supported our revenue growth. Specifically or establishing a new dedicated lead generation team does for our sales force, which will be further enhanced through an integrated and aggressive digital marketing strategy. We believe this approach will create a steady and consistent pipeline of customer leads for our sales team, which could be a potential game changer for Stran. In fact, as a result of recently launched campaigns on Google Ads and LinkedIn, we're already averaging over 50 qualified leads per week and believe that more than 35% of these opportunities have the ability to close, while also having the potential becoming repeat and annuity type program customers. In addition to our sales and marketing efforts combined with acquisition opportunities, we're making progress on implementing Oracle's NetSuite as our new ERP, in order to gain operational efficiencies, provide greater financial analysis and prepare for additional scalability. Looking ahead, we are seeing very strong bookings heading into the second half of the year with over $30 million in orders secured year-to-date. Overall, we believe we have built a highly scalable business model and are witnessing continued revenue growth. As a result, we are well capitalized to internally fund and execute on both organic growth and acquisition strategies, ultimately establishing Stran as a preeminent force in the promotional products industry, and market value to over $23 billion. Since our last earnings call the senior management team has purchased approximately $75,000 worth of common stock personally and we plan to continue to taking advantage of opportunities in the market. I'm also pleased to report that under our share repurchase program, we have repurchased approximately 1 million of our common shares at an average price of $1.96 per share. In summary, we are very proud of the progress made to date and plan to continue to execute on our growth strategy by growing our customer base, entering into new customer verticals, expanding geographically, and identifying accretive acquisition targets. Revenues for the three months ended June 30, 2022 increased 72.5% to $14.8 million, compared to $8.6 million for the same period in 2021. Gross profit increased 75.3% to $3.8 million, or 25.4% of sales for the three months ended June 30, 2022 compared to $2.1 million or 25% of revenue for the same period last year. Importantly, we were able to increase gross margins despite our new health care client given the sheer size of the contract as well as the higher freight revenue, which comes with lower margins. Operating loss for the three months ended June 30, 2022 was $472,000 compared to the operating loss of $854,000 for the same period last year. We were able to decrease our operating losses despite higher general and administrative expenses, which was primarily due to additional expenses related to the acquisition of G.A.P. Promos assets, the implementation of the new ERP system on Oracle's NetSuite platform, ongoing public company expenses in the organic growth of our business. It's also important to note that our operating loss declined by over $350,000 compared to the first quarter of 2022. Net loss for the three months ended June 30, 2022, was approximately $447,000, compared to a net loss of approximately $169,000 for the same period last year. At June 30, 2022, the company had cash and cash equivalents of approximately $28.2 million and no long-term debt. Given the strength of our balance sheet as previously announced, we implemented a share repurchase program of up to $10 million. As of June 30 2022, we have repurchased 1 million of common shares at an average price of $1.96 for a total cost of approximately $2 million through the buyback program. To wrap up, we're experiencing strong organic revenue growth, we have a demonstrated track record of successful acquisitions, and we have a strong balance sheet to execute upon our business model. Sure, first, some of the capabilities that they have for the Creative team, the Creative design and merchandising team, we've really been able to take advantage of not only continue to offer those customers expanded services that we have, but also being to use some of those services and expertise for our own customers. In addition to that, it's just integrating some of the systems that we have in terms of from an accounting perspective and personnel is really sharing, job sharing and expanding our support network, whether it's accounting and marketing initiatives is really getting more from both of them. So we're actively talking to dozens, but we're being patient, we want to find the right companies that are the right fit that not just give us revenue, but give us revenue as well as profitability that that works with our business. So we are talking to dozens of but we're being very strategic about offering LOIs or really taking to the next level of companies that culturally fit with us, companies that make a difference, company that really check the boxes of what we're looking for. And as we've mentioned it's geographical additional capabilities, strong balance sheet and strong profitability. I mean, we're already at I think that's booked through the year. So we're most likely going to hoping to experience that as well from a billing perspective, but absolutely that $30 million will -- should 100% bill by the end of the year, but some of that already has been billed. We don't have a backlog estimate in terms of adding what we have for billed plus what we have out there that we're publishing, but it is strong, we are still seeing fairly strong bookings. Typically, we do see somewhat of a small downturn in the summer, we haven't experienced anything out of the norm this year, just because people are on vacation. It's only a handful of individuals that we've hired to execute on that, but they're very experienced and have a lot of knowledge in that space. So that's one thing that we're adding, it should not be a significant impact to the G&A. It will be an impact obviously, but we're looking to have revenue associated with that as well, as well as profit or as long as profit to go in there. As you know, some companies operating in the digital marketing space have reported weakness in spending by their customers. Again we have found that customers are somewhat replacing the digital, some of the digital spend that they've done with physical advertising like we do, because of the impact that it has, and the really the effectiveness of it. It's really to get people more interested in how we can help them use physical promotional merchandise to get in the hands of either prospects, employees, clients to build loyalty, is really to get that in their hands and to show them. So it's really to help Stran not necessarily digital revenue, it's more revenue geared towards more spend. We're expecting to do approximately $6 million as we had mentioned in revenue, it could increase from there. We're excited about the future for Stran, we're well positioned with a strong balance sheet, a very detailed plan of what we're planning on doing in the future and we're looking forward to continue to report our success well into the future."
}