{
    "symbol": "TUP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 11:50:04",
    "content": " Second quarter performance was also impacted by unfavorable foreign currency translation adjustments, which reduced sales approximately 400 basis points and adjusted earnings per share by approximately $0.06, compared to 2021. As a result of these changes, while sales were down 24% in the quarter, operating profit alone improved 200 basis points, and we further expect expansion in the second part of this year. While these changes had an emotional impact that caused our active sales force to declining 2%, compared to the first quarter, these changes had a desired effect as productivity improved 23% and resulted in better service levels towards the end of the quarter. Excluding China, our Asia Pacific business was down 8% with markets like Indonesia driving the decline, particularly in countries with low  (ph), the cumulative lack of in-person gathering has severely impacted the sales force engagement over the last two years. On the business expansion side, we are pleased to see that early success in Korea, which saw growth of 15% in the quarter by implementing our omnichannel strategy, including success in home shopping channels, and we expect other countries in Asia to follow this winning strategy. We also believe that not hosting in-person events for over two years in most developed markets has had a cumulative negative effect in our direct selling business, resulting in lower sales force engagement, low recruiting and unproductive sales. Net sales for the quarter were $340 million, representing a decrease of 14%, compared to last year, driven by weaknesses in Europe and lockdowns in China, partially offset by strength in South America. In South America, net sales increased by 12% in the second quarter, driven by strength in Argentina, which led to successful equipment campaign, social media efforts promoting the business opportunity, as well as price increases, which on average were 17% for the quarter."
}