{
    "symbol": "TUP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 12:05:31",
    "content": " After two-and-a-half years of no meeting, we returned to holding in-person sales events in many markets around the world in the third quarter for the first time since 2019. Net sales for the quarter were $303 million, representing a decrease of 20% compared to last year, driven by continued lockdowns in China along with microeconomic pressures in Europe, a slowing in North America, partially offset by ongoing strength in South America. Moving to the Americas; net sales in North America declined by 16% in the quarter driven primarily by lower sales force engagement and productivity, lower unit volumes due to price increases, and service delays in Mexico due to an upgrade in IT that moved the last two weeks of orders into Q4. In the U.S. and Canada, net sales declined by 15% driven by lower sales force engagement, partially offset by improving service levels, compensation plan changes earlier in the year along with a second time for some price increases in September adversely impacted sales force activity. Profitability suffered during the quarter despite the price increases due to higher promotional and discount items, higher B2b sales, and onetime cost associated with the closing of a third-party logistic provider. In South America, net sales increased by 7% in the third quarter driven by strength in Argentina which continues to leverage social media in its successful recruiting effort as well as price increases. Gross margin in the third quarter was 64.9%, approximately 90 basis points lower than last year much better than the gross margin degradation that we experienced earlier in the year as our price increases are beginning to have an impact. Turning now to cash flow, on a reported basis, year-to-date operating cash flow net of invested activities was an outflow of $88 million, compared to negative $7.4 million last year, driven by lower earnings together with an increase in working capital in preparation for our omni-channel expansion and excess inventories due to lower-than-expected sales volume."
}