{
    "symbol": "TUP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:14:03",
    "content": " Mexico was a bright spot in this quarter, up 7% year-over-year, driven by changes we made to improve and optimize our direct selling business and it is up 27% on a two-year stack. Before we begin our discussion of our financial results, a quick reminder, the main accounting change in the third quarter of last year to classify our sold and held-for-sale beauty and personal care businesses has discontinued operations, which is consistent with our strategy to focus on the performance of our core business and expansion efforts. For the first quarter, net sales were $348 million, representing a decrease of 14% compared to last year, driven by both internal and external factors as previously mentioned. From a top line perspective, our sales were primarily impacted by three main drivers: first, weakness in our European business caused by lower sales force activity and service issues, which were exasperated by regional disruption and lower consumer sentiment caused by the conflict of Ukraine. China which was down 24% in the quarter, was severely impacted late in the first quarter by strict lockdowns caused by the recent COVID outbreak in the country and China's zero COVID policy, acutely affecting the last three weeks of March, essentially shutting down all economic activity in many cities. The remainder of the Asia Pacific region, excluding China was down 8% in the quarter, driven by lower sales force recruitment and productivity due in part to COVID lockdowns, sales model changes, as well as underperforming via holiday promotions. Gross profit in the first quarter was $222 million or 63.8% of net sales, which represents a decrease of approximately 720 basis points compared to last year, primarily driven by inflationary pressures as well as an increase in obsolescence reserves. Adjusted EBITDA for the first quarter was $29 million or 8% of sales, which reflects the impact of lower sales, higher input costs, the latency of pricing action implementation and higher investment spend all previously mentioned. I should note that given the ongoing uncertainty in China and the conflict in Ukraine, uncertainty regarding the execution and timing of certain business expansion efforts in the second half of the year, the magnitude of the changes we're making in our core business, pricing actions largely hitting in the last half of the year, consumer spending trends given the current inflationary environment as well as reliance on our current cash flow strategies, we will continue to monitor liquidity and we'll address -- adjust our capital allocation framework as appropriate."
}