{
    "symbol": "ZUO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-05-25 21:04:04",
    "content": " GoPro, another one of our customers just announced on their latest earnings call earlier this month that their subscription and service revenues are up 73% year-over-year. These companies are turning to Zuora because our products consult, given the agility they need to adapt their services as markets change to manage the complete quote to cash and revenue recognition processes at scale, and to orchestrate the experiences their customers are having, which means new services. Subscription revenue ended at $78.5 million, growing 21% year-over-year and exceeding the high end of our guide. Professional services revenue was $14.7 million, a decline of 3% year-over-year. Total revenue also ended above the high end of our guide at $93.2 million, up 16% year-over-year. As we grow our partnerships with system integrators, our non-GAAP blended gross margin saw an improvement of 330 basis points year-over-year, ending the quarter at 67%. For Q2, we currently expect total revenue of $96.5 million to $98.5 million; subscription revenue of $82 million to $83 million; non-GAAP operating loss of $2 million to $1 million; non-GAAP net loss per share of $0.06 to $0.05 per share, assuming weighted shares outstanding of approximately $130.2 million. Your line is open. And what we saw then is what we are seeing now is that subscription business models are resilient that when you have a recurring revenue model, you're not chasing every single dollar of revenue every single quarter that you start practically at the finish line, and you've got a product and service that's indispensable that customers -- that creates a level of customer loyalty. Your line is open. Your line is open. Your line is open. And what we decided strategically to do is we’ve always had this target of 15% of our business should be system integration work or consulting professional services work, and we are going to accelerate on our goal to get to that point by really saying, look, it's going to be a lot easier to give this work to our partners and certify them and train them than necessarily to hire somebody in that group. Your line is open."
}