{
    "symbol": "DTE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 12:23:03",
    "content": "  Operator: Good morning, and welcome to DTE Energy's Q3 2022 Earnings Conference Call. I would now like to turn the call over to Barbara Tuckfield, Director of Investor Relations. Before we get started, I would like to remind you to read the safe harbor statement on Page 2 of the presentation, including the reference to forward-looking statements. Our presentation also includes references to operating earnings, which is a non-GAAP financial measure. With us this morning are Jerry Norcia, Chairman, President and CEO; and Dave Ruud, Senior Vice President and CFO. Thanks, Barb, and good morning, everyone, and thanks for joining us. Let me start by saying that three quarters of the way through 2022, we are on track for a very successful year, and we continue to be well positioned for the future. This morning, I will highlight some of the successes we have accomplished this year, and Dave will provide a financial update and wrap things up before we take your questions. As many of you know, we will be filing our Integrated Resource Plan or IRP next week. This filing will provide updates on our path for decarbonization and our commitment to continuing to provide clean, reliable and affordable energy to our customers. Our team has been working hard on this filing going through multiple scenarios and taken into account stakeholder feedback to develop a plan that works best for all of our customers, as well as incorporating the benefits of the Inflation Reduction Act or the IRA. Naturally, the IRP will impact our five-year capital plan, and we are excited to provide further details in a couple of weeks at EEI. Along with our capital plan update, we will provide an update on our long-term growth strategy at this conference. We will also provide updates on our voluntary renewables program, MIGreenPower, which continues to show substantial growth. Just this week, we subscribed a new 400-megawatt customer, increasing the program to 2,100 megawatts of subscription. As climate change remains our generation's defining public policy issue, DTE is committed to doing our part by continuing to invest for our customers and to ensure reliability. We are focusing on updating and improving our aging infrastructure for this additional demand while continuing to provide safe, reliable and affordable energy. We know that with our engaged and talented team, we will continue to deliver for our customers, communities and investors. Additionally, after our most recent engagement survey with Gallup, DTE ranks in the top 4% of companies worldwide in employee engagement, which continues to give me confidence that our team will deliver for our stakeholders. As I mentioned earlier, we will be filing our IRP next week. This will provide detail on our plans to generate safe, clean, reliable, affordable energy as we accelerate our decarbonization efforts. This ambitious program aims to build Detroit's tree canopy by planting tens of thousands of trees over the next five years, cooling urban areas while providing beauty and air quality improvements. The program will also hire and train workers to plant and maintain the trees in the city, bringing jobs to our community. Our Next Energy recently announced that they will be bringing 2,000 jobs to Michigan with a $1.6 billion investment in new battery operations. Given all of this positive momentum, we also feel great about our financial position as we head into the final months of 2022 and are on track to achieve our 2022 operating EPS guidance. With the opportunities we have in front of us, DTE is on track to make significant customer-focused capital investments across our businesses. We need to build the grid of the future to ensure we can continue to provide clean, safe, reliable and affordable energy. Additionally, at our gas utility, we continue our important main renewal work, which further reduces greenhouse gas emissions. Finally, at DTE Vantage, to continue to add new RNG projects and other energy solution projects for our customers, which enables growth with a focus on decarbonization. Our diverse energy mix helps reduce fuel costs as well, and it allows us to maintain flexibility to adapt to future technology advancements. Thanks, Jerry, and good morning, everyone. As Jerry mentioned, the IRA has a lot of positive elements for DTE that benefit both our utility and nonutility businesses. The ability to transfer tax credits will eliminate the need for tax equity partners, which allows us to retain an additional 40% of the investment for our projects. The IRA provides new investment tax credits for RNG, making some of the projects that we are working on at DDTET Vantage even more attractive and allowing potential RNG projects to be more economic for our utilities. The credits make more projects economically attractive, which enhances our business development opportunities and enables us to better help our industrial customers achieve their environmental goals. Lastly, we don't see a material income or cash impact from the corporate minimum tax given our current tax carryforward position and accelerated depreciation provision in the IRA. Overall, we view the IRA as beneficial for customers and supportive of the transition to cleaner energy while maintaining affordability. This was $21 million higher than the third quarter last year, driven by accelerated deferred tax amortization in 2022 that was implemented to delay our rate case filings and keep us out of rate cases over the last three years, along with lower O&M costs this year. Moving on to DTE Gas, operating earnings were $7 million higher than the third quarter last year. This is a $47 million decrease from the third quarter last year due to the sunset of the REF business at the end of 2021, partially offset by higher earnings from industrial energy services. On the next row, you can see Energy Trading earnings had a decrease of $33 million from the third quarter of 2021, mainly due to the performance of the power portfolio compared to last year. As I mentioned on the second quarter call, there is also reversal of the timing favorability in our physical gas portfolio as our strategic long positions used to support physical positions were transacted this quarter. Year-to-date, Energy Trading earnings are $32 million, and we are on track to achieve full year guidance of $20 million to $35 million. Finally, Corporate & Other was favorable $29 million quarter-over-quarter, which is primarily due to the timing of taxes and a onetime tax true-up in 2021 that we mentioned in the third quarter call last year. Regarding the balance sheet for Corporate & Other, we've already successfully remarketed the senior note associated with the equity converts this quarter and will pay down the $1.25 billion of parent debt coming due in November with the proceeds from the equity conversion. Our planning process contemplated inflationary pressures and rising interest rates, and we are confident that we will offset increased costs with no impact to our long-term growth. Overall, DTE earned $1.60 per share in the third quarter. Let me wrap up on Slide 9, and then we'll take your questions. In summary, through three quarters, we're having a strong operational and financial year, and we're on track to achieve our operating EPS guidance midpoint of $6 per share, which provides over 8% growth from our 2021 original guidance midpoint. As Jerry mentioned, we'll be filing our IRP in early November, which will lay out our plan to support cleaner energy and the modernization of our electric grid while focusing on affordability and reliability. With that, I thank you for joining us today, and we can open the line for questions. Your line is open. I know it's pending and coming soon, but you can potentially see a meaningful kind of CapEx opportunity out of this. We are - as you mentioned, Nick, we're going to give more guidance on our capital plans at EEI. But you're right, we have a good opportunity with the IRP and the IRA to invest some additional capital. We do have a strong balance sheet, and rating agencies are comfortable with where we're at in our position. But I think you're right, we do see some additional capital opportunity due to the IRP and what the IRA allowed us to do. And then I guess as it just relates to the electric rate order - or not order, but you got an ALJ rec. Yes, we feel comfortable with where we're headed in multi ALJ positions and staff positions. And certainly, there's a strong alignment to make the investments in the grid as well as clean generation. Your line is open. So Jerry, just starting off with the IRA and how that has impacted your thoughts, I guess, around the IRP, I mean, obviously, there's clearly customer benefits and lower cost. One, certainly lowered the cost of all of our investments in renewables as well as long-term, it improved the outlook for carbon capture and storage in our IRP so very positive benefit to affordability, which allowed us to accelerate our transition. And so, I think you'll see that when we roll that out next week so very positive impact from the IRA. And of course, you know what the tax credits are, $26 per megawatt hour on solar and wind and PTCs on nuclear. In terms of tax equity, with the IRA and the provisions in that IRA, making tax credits transferable, we no longer need tax equity structure, which significantly simplifies our plan, but also removes an investment partner. But simultaneously, there's obviously been some really high premiums paid for RNG assets. And conversely, since IRA potentially accelerates Vantage's growth, does it even make sense in terms of the business mix for DTE you guys target as we're thinking about regulated utility exposure? The way we're looking at Vantage right now, Shar, is that it will be - our nonutility business will be 10% of our portfolio. But the IRA, the investment tax credit for RNG of 30% just made the projects we were looking at even more economic, significantly lifted the IRRs of many of the projects that we are looking at. And then the cogen investment tax credit of 30%, that also helps projects that we've got in the pipeline become much more economic. The last one is carbon capture and storage, which we've started to explore and have some interesting small opportunities in that arena as well, which not only will be beneficial to Vantage, but it will also be beneficial to our electric utility as we think about carbon capture and storage as it relates to our generation assets. So overall, I would say the impact on Vantage from the IRA, again, was quite positive. And Jerry congrats, on a side comment, on the latest addition to your family, see you guys soon at EEI. Your line is open. Good morning, just wanted to start off on the RNG landscape, if I could, given the  sales here and what looks on the surface to be quite a robust valuation paid there. It's - as we said, we're always looking at our portfolio, considering options. We did see the Antero sale, and I think it really highlights the value that others see for RNG and really the growth potential for RNG. Right now, we're just really confident in our business development pipeline. So even with this level, I guess, of interest in the space and strong valuations, you still see new projects clearing your hurdle rate. Some of these are conversions and some - and with the IRA, some of them become even more attractive. Yes look at - our business development pipeline, as we look out a few years, is well stocked with high-return projects in the RNG space. And we've also got a few industrial projects, cogen projects that we're pursuing that will bring value - long-term value to the Vantage business unit. Got it, that's helpful. Your line is open. Good morning, thanks so much for taking my question. Sure, so as we look at the Commission order, our discussions with the Commission continue to be really collaborative. Ultimately, I think the result of this order is that it will create even stronger alignment as it relates to our investment agenda. Just to give you a feel for it, our system, on average, operates at about 99.9% availability. And there's a lot of value for our customers to go even from 99.9% to 99.97%, and we'll start to lay all that out, and it will be - I believe it will be a good process, and it will come to a good conclusion. Well, when I look at our circuitry, we've got systems that need to be replaced and modernized and automated. And as we rebuilt new circuits, and upgrade those circuits and modernize them, it's going to require a significant amount of capital investment. And as we look at our portfolio over the few years, we do try to balance what we can do in '22 and '23 across all our businesses. So we have been able to find some opportunity to help 2023 as we go through this year, too, because as you've seen, '22 has been a nice strong year for us. Your line is open. We view our ability to invest on behalf of our customers to really transform our generation fleet to a cleaner, more reliable fleet as a significant opportunity, and that will be the basis of our IRP. And also, the investment in the grid to drive increased resiliency and reliability of the grid will be a significant opportunity for us. So this is going to create a transformative opportunity in how we deliver power and produce power for our customers, but also create a very significant investment opportunity for our investors to invest against all of this. So for example, our generation transformation will be a net positive to our customers. Your line is open. You said if I heard right, you contemplated higher rates in the plan, so no impact on long-term growth. We have a tendency to plan conservatively, and we look at a lot of risk and opportunities in our plan, we look at that every week and look at the challenges. So we are confident that depending or irregardless of how rates move, regardless how rates move, we will be able to offset those with other things within our plan. Well, it's been an extraordinary year for our voluntary renewables program. Actually, as a matter of fact, this week, we executed - or in the process of executing an agreement for another 400 megawatts of sales long-term commitments. This takes us now to a total of 2,100 megawatts sold, which is well above our expectations at where we would be at this point in time. Well, we've got significant opportunities in front of us. The pipeline is strong, and we'll continue to grow that program. And then as we look at transformation of our generation fleet, that will also bring new opportunity to the renewables fleet. Your line is open. Yes, right now, we're looking at it as written. So we think that the way it's written, it does apply to things like storm repairs and doesn't get the favorable treatment under the AMT. Even with that, we don't see that this is going to have a big income or cash impact on our plan. And then just sticking with that, I think you mentioned some cushion versus credit metrics. But right now, we're around 16% FFO to debt. Your line is open. Well, we'll see the details as they get specified over the next year. But understanding what's going to happen in the - at the high level for our generation, it can all be incorporated in the IRP and then how the - how it goes into our plan, we can - we feel like we can model that. Well, certainly, we've worked well with various administrations over our history, Republican-dominated administrations, Democrat-dominated administrations. We'll see what happens in November, but it feels like the compact that exists today will likely remain intact in terms of the political structure. But whatever the results, we feel that we have productive relationships and that there's clear understanding by Republicans and Democrats what our investment agenda is and what the purpose of our agenda is and strong support for that. Your line is open. Jerry, Dave, good morning. I just have one quick one, and I appreciate if you want to hold an answer until you make the filing to the IRP. But just if I understand correctly, there's a lot of consensus building prior to the actual filing. Well, I would say, Anthony, we did an extensive amount of stakeholder engagement throughout this process, more than I believe we've ever done. And - but I would say, most revealing for us was when we tested our customer opinions across broad demographics what we saw was strong alignment with our IRP. And that will certainly be very evident when we file the IRP, engagement with other stakeholders, regulators and legislators, I would say, support. Of course, as we get into the details, we'll have to work out those details, and I'm sure that some stakeholders will have different opinions, but I'm pretty confident we're going to work through all of that and end up with a really strong IRP that supports a transformation - fundamental transformation of our generation fleet. Your line is open. But what I do see with high IRRs is greater contributions to sort of more efficient capital deployment, if you will, as we see higher IRRs, so very juicy projects. And we've got a combination of what I would call financial hedges against these sales as well as fixed long-term sales, price sales, price that are priced. That's helping to balance any sort of fluctuations that we may get, as well as we build contingency into that plan to accommodate any positions that might remain open. Well, look at, if we saw an opportunity to harvest and get more value than we see, we're always open to that. We've reinvented ourselves in this space, 3x and 4x since I've been at DTE. And at the time presents itself and the opportunity presents itself to harvest and create incremental value for our investors, we're up for that. Well, thank you, everyone, for joining us today. I'll close by saying that DTE has had a very successful third quarter, and we're feeling great about the remainder of the year, as well as our position for future years. Ladies and gentlemen, this concludes today's conference call."
}