{
    "symbol": "ALEX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 19:46:07",
    "content": " Turning to our land sales in the second quarter, we closed on the sale of approximately 18,900 acres of non-core land holdings comprised primarily of conservation in agricultural land on Kauaâ\u0080\u0098i, as well as 100% of the company's ownership interest in the 100% ownership interest in McBryde Resources Inc. the operator of hydroelectric power facilities on the island. Starting with our financial results, for the second quarter, we recorded net income of $4 million or $0.05 per diluted share. As a note, each of these metrics for 2022 benefited from reserved reversals of approximately $1.8 million or $0.02 per share in the second quarter of 2022 compared to $1.6 million, and also $0.02 per share in the second quarter of 2021. For the second quarter, CRE revenues increased by 5.8%, or $2.5 billion over the prior year quarter to $45.8 million. Our land Operations Business generated adjusted EBITDA of $52.8 million in the second quarter of 2022 associated with the sale of approximately 18,900 acres of non-core landholding on Kauaâ\u0080\u0098i including the company's 100% ownership interest in 100% ownership interest in McBryde Resources is a $54 million gain on disposal of assets in the period. With the sale of the noncore land holdings on Kauaâ\u0080\u0098i including our interest in McBride Resources, portion of those sale proceeds was used to pay down the remaining $50 million balance on our credit facility. In the second quarter, we incurred pretax settlement charges of $73.7 million, with an associated $18.3 million income tax benefit and funded $20 million in $29 million in cash, which was well below our expected range communicated on prior calls. Within the land operations segment during the second quarter, the net impact of the pension settlement charges and the gain on the non-core land holdings sale was a $1.4 million loss, essentially an offset of two meaningful steps toward our simplification. With respect to our dividend, our board recently declared a third quarter 2022 dividend of $0.22 per share, an increase of 10% or $0.02 per share payable on October 5, 2022 to shareholders of record as the close of business on September 19 2022."
}