{
    "symbol": "GPN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 12:12:05",
    "content": " For the fourth quarter, our Merchant business delivered 9% adjusted net revenue growth excluding dispositions and our Issuer segment achieved 5% adjusted net revenue growth, each on a foreign exchange neutral basis. Our Merchant business delivered 13% adjusted net revenue growth, excluding dispositions and our Issuer business generated 5% growth, each on a constant currency basis. For calendar 2022, we produced 10% total adjusted net revenue growth, again excluding dispositions, expanded margins by 200 basis points and generated 17% adjusted earnings per share growth on an FX-neutral basis, all right lined with our raised cycle guidance from 18 months ago despite all the incremental challenges of the macroeconomic environment. Starting with the results for the full year 2022, we delivered adjusted net revenue of $8.09 billion, an increase of 7% from the prior year on a constant currency basis. The net result was adjusted earnings per share of $9.32, an increase of 17% on a constant currency basis compared to the full year 2021, which includes the impact of the exit of our Russia business during the second quarter. Moving to the fourth quarter results, we delivered adjusted net revenue of $2.02 billion, an increase of 4.4% from the same period in the prior year on a constant currency basis. Taking a closer look at performance by segment, Merchant Solutions achieved adjusted net revenue of $1.41 billion for the fourth quarter, reflecting constant currency growth of 9% excluding dispositions. Our total Issuer business including B2B delivered $501 million in adjusted net revenue, also a 5% improvement on a constant currency basis for the same period in 2021. Finally, we delivered adjusted operating margins of 48.3%, an increase of 560 basis points from the prior year, fueled by our accelerated growth and focus on driving efficiencies in the business. We expect to deliver adjusted net revenue growth in the 5% range, including Netspendâ\u0080\u0099s B2B assets for the full year compared to 2022 as we benefit from our strongest conversion pipeline since the TSYS merger. Please proceed with your question. As we talked about this morning, our highlights for 2023 from a growth perspective start with Global Payments sort of core business at 9% to 10%, again, relatively consistent with the cycle guidance that we provided for that business reflecting a macro environment that we expect to be largely consistent with kind of what weâ\u0080\u0099ve seen exiting 2022. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Then lastly, I would say, we kind of alluded to this in the investor conference, the shifting business mix on the issuer business towards more B2B, I just mentioned a minute ago in response to Vasuâ\u0080\u0099s question, our 4.5% to 5.5% of 5% in the middle, I think itâ\u0080\u0099s right in line with what we said historically."
}