{
    "symbol": "LIVE",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-15 20:28:05",
    "content": " The revenue for the fourth quarter, or total revenue for the fourth quarter increased to $73.8 million, up 4.6% as compared to $70.5 million in the prior year period. Gross profit for the fourth quarter was $22.9 million, down from $25.6 million in the prior year period. For the 3 months ended September 30, 2022, net loss was $0.6 million as compared to net income of $7.1 million in the prior year period. Adjusted EBITDA for the fourth quarter was $7.2 million, a decrease of approximately $4.3 million as compared to the prior year period. Steel Manufacturing segment revenues increased by approximately $11.3 million or 23% as compared to the prior year due to increased sales pricing as well as the acquisition of Kinetic in June 2022. Gross profit for the full year 2022 was $97.8 million, down from $99.5 million in the prior year. Selling and marketing expenses increased approximately $1 million for the full year 2022 as compared to the prior year, primarily due to increased convention and tradeshow activity, which was largely cancelled in fiscal year 2021 due to COVID. Net income for fiscal year 2022 was $24.7 million, a decrease of $6.5 million or 20.7% as compared with the prior year. Fiscal year 2022 net income of $24.7 million includes an $11.4 million gain related to the ApplianceSmart bankruptcy settlement, partially offset by the $4.9 million impairment charge and one-time acquisition related charges of approximately $1.5 million. Fiscal year 2021 net income of $31.2 million includes $7.9 million and gains related to the extinguishment of PPP loans, and the settlement of certain ApplianceSmart liabilities in connection with the bankruptcy. Net cash provided by operations was approximately $14.6 million for the year ended September 30, 2022 as compared to net cash provided by operations of approximately $29.2 million for the year ended September 30, 2021. We had net working capital of approximately $78.4 million as of September 30, 2022, as compared to approximately $33.8 million as of September 30, 2021. Total assets increased $66.9 million or 31.6% to $278.6 million as compared to $211.7 million as of September 30, 2021. Cash flows provided by financing activities increased to approximately $25.4 million during the year ended September 30, 2022 primarily due to proceeds from borrowings under the revolver loans and issuance of notes payable, which is primarily associated with the acquisition of Kinetic."
}