{
    "symbol": "AZO",
    "quarter": 1,
    "year": 2022,
    "date": "2021-12-07 14:54:06",
    "content": " Our same store sales were up 13.6% versus last year's first quarter, our net income was $555 million, and our EPS was $25.69 a share increasing an impressive 38.1%. Starting with our commercial business for the first quarter, our domestic DIFM sales increased 29.4% to $900 million, and were up 41% on a two year stack basis. Our growth strategies continue to work as we continue to grow share, we are confident in our strategies and execution and believe we will continue gaining share, delivering quality parts particularly with our Duralast brand, improved assortments, competitive pricing and providing exceptional service has enabled us to drive double digit sales growth for the past six quarters. For the quarter, our gross margin was down 65 basis points driven primarily by the accelerated growth in our commercial business, where the shift in mix coupled with the investments in our initiatives drove margin pressure, but increased our gross profit dollars by 14.9%. Moving to net income and EPS, net income for the quarter was $555 million, up 25.5% versus last year's first quarter. Your line is live. And we've continued to grow since then, mean that to be up 40% on a two-year basis is really astounding, and to be up 29% in this quarter alone, I just couldn't be more pleased of what our team has done and we believe this is just the beginning. Your line is live. I think my expectation with the pandemic and the amount of sales that we saw, particularly in the retail business, from the depths of the stay at home orders and all those things was, we would see somewhat a reversion to the mean, and here we sit today, it's December, the last stimulus happened in March 15. Your line is live. So as we've gone through this, this period, and we see an opportunity to accelerate the growth in our commercial business, by creating a faster growing business overall, it's ultimately meaning that we're a more profitable company on a $1 basis, and that's going to lead to more cash. Your line is live. Your line is live. Your line is live."
}