{
    "symbol": "AZO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-19 13:31:05",
    "content": " Bill, over to you. For the fiscal year, our commercial sales were $4.2 billion versus $3.3 billion just a year ago, up over 26%. We also set a record average weekly sales per store for any quarter at $17,000 per store versus $14,400 last year. Domestic commercial sales represented 30% of our domestic auto parts sales, another record for us compared to just 26% in last year's quarter. While our two-year comp decelerated from Q3's, we believe the more relevant comp is the three-year and we are higher than last year's quarter at 24.5% versus 21.6%. While I said our same-store sales were up 6.2% versus last year's fourth quarter, our net income was $810 million and our EPS was $40.51 a share, increasing 13.4%. As Bill mentioned, we had a strong fourth quarter, stacked on top of a remarkable fourth quarter last year with 6.2% domestic comp growth, a 5.7% increase in EBIT and a 13.4% increase in EPS. For the year, our total sales were $16.3 billion, up 11.1% versus last fiscal year. For the fourth quarter, our domestic DIFM sales increased 22% to $1.4 billion and were up 43.2% on a two-year stack basis. For FY '22, our commercial sales were $4.2 billion, up 26.5% versus last year. For the quarter, our gross margin was down 73 basis points, driven primarily by the accelerated growth in our commercial business and a 28 basis points headwind stemming from a non-cash $15 million LIFO charge. EBIT for the quarter was $1.1 billion, up 5.7% versus the prior year's quarter driven by our strong sales growth. FY '22, EBIT was just under $3.3 billion, up 11.1% versus the prior year, also driven by strong top line growth. Interest expense for the quarter was $64 million, up 10.1% from Q4 a year ago as our debt outstanding at the end of the quarter was $6.1 billion versus $5.3 billion at Q4 end last year. Net income for the quarter was $810 million, up 3.1% versus last year's fourth quarter. The combination of higher net income and lower share count drove earnings per share for the quarter to $40.51, up 13.4% over the prior year's fourth quarter. Our inventory per store was up 18.4% versus Q4 last year and total inventory increased 21.5% over the same period last year, driven primarily by our growth initiatives and inflation. As a result, accounts payable as a percent of gross inventory finished the quarter at 129.5% versus last year's Q4 of 129.6%. Bill, over to you."
}