{
    "symbol": "NVEC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-04 20:19:12",
    "content": "  Operator: Good afternoon and welcome to our conference call for the quarter and fiscal year ended March 31, 2022. We issued our press release with Fourth Quarter and fiscal year results, and filed our annual report on Form 10-K in the past hour following the close of markets. On today's call, our President and CEO, Daniel Baker, and our CFO, Joe Schmitz. After Dan's opening comments, Joe will cover financial results for the quarter and fiscal year. Comments we may make that relate to future plans, events, financial results, or performance are forward-looking statements that are subject to certain risks and uncertainties, including among others, such factors as risks and uncertainties related to future sales and revenue, uncertainties related to future stock repurchases and dividend payments. our dependence on critical suppliers and packaging vendors, risks related to COVID-19 pandemic, and supply chain disruptions, as well as the risk factors listed from time-to-time in our filings with SEC, including our first file 10-K links to the documents we filed this afternoon are available to the SEC's website, our website, and our Twitter timeline. We're pleased to report a 22% increase in net income for the fourth quarter to $0.79 per diluted share, driven by a 15% revenue of increase. For the full fiscal year, net income increased 24% to $3 per share driven by 26% revenue increase. Total revenue for the most recent quarter increased 15% to $6.75 million, 0.8 in the prior before. But according to the April monthly market update by one of our distributors, the lead time for parts from one of our traditional semiconductor competitors is 52 to 90 weeks or above. Like most companies in the semiconductors industry, many of our costs increased significantly in the past year, including foundry wafers, chemicals, packaging costs, and labor. In response to increased costs, we just continued  discounting and increased prices in the past year. We believe the impact in the pandemic on our supply chain, however, was significantly more in the recent quarter end year than the prior period. Due to the 15% decrease in SG&A expenses, partially offset by a 4% increase in R&D expense. Interest income for the fourth quarter of fiscal '22 decreased 9% due to a decrease in our available for sale securities, and a decrease in the average interest rates on those securities. For the fiscal year, total revenue increased 26% to $27 million from $21.4 million in the prior year. Net income for the year increased 24% from the prior year period to $14.5 million or $3 per diluted share, an increase from $11.7 million or $2 per share for fiscal 2021. Gross margin was 77%, operating margin 61%, pre -tax margin was 55%, and net margin was 54%. Capital expenditures were $485 thousand in fiscal year, the most since fiscal 2018. Also, that was for the deployment of to test handlers to increase our production test capacity and alleviate potential bottlenecks. With $4.83 million dividend payment in the quarter, we returned a total of $5 million to shareholders. In addition to the past quarters is $1 per share dividend, today we announced that our board declared another quarterly dividend of $1 per share payable May 31 to shareholders of record as of May 16th. Now I'll turn the call back to Dan to cover the business, products, and marketing. Business conditions remain challenging according to the commerce department, the semiconductor supply chain is very fragile, which is certainly what we're seeing. Some semiconductor insiders have said global semiconductor shortages could last into 2024, disposes both medium-term opportunities and threats, as Joe said. I'd like to recognize our Ukrainian distributor  Micro Components, which is based in Kyiv and has represented us for more than 15 years. It's not significant business from a financial perspective, but it is inspirational. FedEx can't deliver to keep, but we're doing our best and doing all we can to get them parts. And they've helped inspire us to do our damn, just over overcome supply chain shortages. In-person trade shows and conferences are returning, last month one of our Japanese distributors, K.K.Rocky, exhibited at the embedded in Edge computing Expo in Tokyo, which is build as Japan's largest information technology trade show. PCIM is built as the world's leading exit exhibition and conference for power electronics, intelligent motion, renewable energy and energy management. Sensor plus tests, claims to be the world's leading form for sensor measurement and testing, technology. Capping off the tradeshow season will exhibit at sensors converge in San Jose next month, which showcases the latest sensing technologies. Demonstrating our sensors with musical instrument robots has been effective and attracting attention and demonstrating the precision, robustness, and simplicity of our sensors. We're proud to supply products to some of the world's most demanding customer, Customers including Abbott's Pacesetter subsidiary. In the past quarter, we executed an extension to our supplier partnering agreement with Abbott. One of our NASA contacts reminded us that NASA provided research grants to NVE, starting in 1990 to help us develop spintronic products and now they are being used for a NASA Level 1 mission. The mission will conduct reconnaissance of Jupiter's moon Europa, and investigate whether it could have conditions suitable for life. Turning to new products, we introduced two new products in the past quarter. A new current sensor, and a high sensitivity, Smart Magnetometer. Pete Eames, our Vice President of Advanced Technology discussed plans for these products on our January call. Current sensors can be used to operate electric motors more efficiently, and motors represent around 50% of worldwide electricity consumption. Smart senors, are a central element of our Internet of Things strategy because they have smart network interfaces that allow many sensors to be connected easily for advanced adaptive factories with ubiquitous sensors. Despite challenges posed by shortages and long lead times, fiscal 2022 was a productive year for product development. In addition to the to new sensors I just discussed, we introduced several other new products in the past year. Our most sensitive magnetic sensor forever, the world's first TMR Gear, two sensors with resolutions in the thousands of a degree for ultra precise motor control and robotics. In addition to new products, business highlights for the past year include; we made significant investments to increase capacity and diversify our supply chain. We resumed in-person trade shows, which we view as an investment to facilitates, future sales. Our employees have work through the personal challenges of the pandemic, industry shortages, and supply chain problems. Hey, Dan, it's Jeff Bernstein from Cowen. We've talked about isolators for hybrid high voltage and low-voltage systems, including EVs, but increasing applications with electrification of all kinds of things. So we are getting a lot of traction, particularly in our isolators -- our new isolators that convert power as well as transmit data. We've got some additional part types that we've introduced in the past year that I mentioned in the prepared remarks, and we've got some more that we're working on that we hope to introduce in the coming quarter in the year. So it's opening up a new market segments for us for power control, smart grids. And then we talked about in the quarter, the potential for replacing milli and micro ohm resistors in current sensing applications for very low voltage systems. Sub milliohm resistors for the general audience are used for current sensing and lower the resistance, the lower the losses. So the whole idea of current sensing is to make motors and the other current consuming devices more efficient and wasting the power to measure the current is, of course, counterproductive. We make non-contact current sensors which avoid the problems of temperature variation, self heating losses in noise that you have with those resistors sensing elements, they have no resistance, and they are much easier to use, and they are inherently isolated. And in fact, we demonstrated that on YouTube video with a tester that we got from a hardware store showing that we've got dangerous line voltage on the input of the sensors, but everything is perfectly safe in the output of the sensor, and you can't do that with sub milliohm resistors. If we have significant advantages, we see it as an excellent market opportunity. Current sensing is a very large market, this is a subset of that market. But we see current sensing as a very fast growing market as more and more energy mandates kick in, and more efficient appliances and motors are being mandated, and higher electrical efficiency standards are being implemented. So it's a market that's got a great deal of potential, and as you could tell from your research on some of the alternatives -- conventional alternatives such as sub-milliohm resistors, companies are seeing this opportunity. And we think with our technology, we have a unique benefit proposition that can't be matched with other technologies -- conventional technologies. And our isolators can drive those types of MOSFETs, either directly or with another driver, and do it faster and therefore more efficiently than conventional alternatives to drive the MOSFETs. They're also used for battery chargers, they're used for the systems, the onboard charging in electric vehicles. As we talked about on previous calls, we are on a platform called BeFAST in cooperation with one of our distributors that uses next-generation. MOSFET is also on that platform, and they use our isolators, our couplers -- data couplers to drive those MOSFETs faster than would otherwise be possible while continuing to provide electrical isolation, which is essential for that type of high voltage control. So we see that as another excellent market in the Internet of things -- the industrial Internet of things, to yield more efficiency and power conversion. As you point out, it's been difficult to predict when over-the-counter hearing aids will be will be formally approved, but it seems inevitable. And then we're also looking at the broader market in the year audio devices, so-called hearables. That's estimated to become a $93 billion market by 2026, growing very quickly. So the broader market of hearables, that's ongoing regardless of the FDA regulation of over-the-counter hearing aids. As you may recall, we've begun offerings sensors that are compatible with the rechargeable batteries that are often used in consumer wearables rather than disposable batteries, which are generally used in traditional hearing aids. So we have design wins in that space, that's for the consumer wearables that are in the ear. We're watching closely what the FDA will do, but we think that we're well-positioned for the broader market, whatever happens with the over-the-counter hearing aid market. I wanted to ask about the R&D, which looks like it's rebounded. This is Joe, and this quarter you saw ramp up of spending for chemicals and supplies related to current and future business. So I think why we're not setting a target at it, I think it's a reflection of the activity we have going on in our R&D team. I think that was probably the biggest driver, we had a little bit of a change in mixing some of our business a little bit more foreign income -- foreign source income than we've seen in prior quarters. We have been making some good headway, particularly in the automotive market, particularly in hybrid electric vehicles. So that system can be used onboard charging, meaning it's converting the electricity, if you plug in hybrid electric vehicle to a low outlet or charger, that voltage has to be converted from high-voltage to low-voltage and charge the battery. And so that gets into the MOSFETs drivers, the advanced GaN and silicon carbide MOSFETs drivers that we talked about. Finally, our data couplers are used to transmit information between modules in a car, and we have some activity in those areas. So the challenge, particularly in hybrid electric vehicles, is that the voltages can be several hundred volts. And of course you can't hook up that kind of voltage directly to controller, the data needs to be isolated. Our isolators allow the transmission of data without a direct electrical connection, which is important in high-voltage systems such as hybrid electric vehicles. So we see that as a, is not a real near-term market, but there are some promising activities going on there, and particularly with the rise of hybrid electric vehicles and autonomous vehicles, we see excellent opportunities there for sensors and couplers. Well, if not, I'll wrap up and we were pleased to report a 24% increase in earnings for the fiscal year driven by 26% increase in product sales."
}