{
    "symbol": "TRMB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 11:56:04",
    "content": " Chad, from a Trimble Construction One perspective, if you ask me -- if you're asking me what -- how much of the portfolio of, I'll say, both of the buildings as an infrastructure segment, I would see it applying to my goal is 100%, okay, maybe in reality, it's something a bit less than that. So when we talk about the increases in investments we're making into our digital transformation and that run rate has been -- is over, I'd say, over $20 million incremental a year, that is very much associated with driving Trimble Construction One and with our recurring revenue business across all of Trimble. We believe it's the most resilient of the revenue streams that we have, which is quite logical compared to, let's say, the hardware businesses, which, let's say, in normal times because right now, we do have a backlog in hardware and normal times look something more like a book and burn business. So you're right, Jerry, that yes, by the math, we would see -- expect to see a tick-up at the, let's say, in the fourth -- by the fourth quarter in the ARR growth -- in the growth, excuse me, of ARR. Okay, so as it relates to coming into 2023 and a view on ARR growth, I would be -- I'd hold off on, I'd say, commenting on a specificity for 2023 view on ARR growth, but what I can say is that we would expect to -- just to your point, Jerry, in terms of the visibility in the pipeline and the math is we see double-digit growth next year in that ARR. And that, I'd say, is kudos to our teams having gone through a lot of the transitions, most recently in the Tekla Structures business has been one of the ones that's done the conversion over the last 12 months, which is part of what's throttled some of the revenue, top line revenue this year, but also been part of the acceleration of the overall ARR from that team. So one of the things we've seen when we transition the model in our SketchUp product, and I'll say a shout-out to that team, they're in 11 quarters in a row of over 45% year-over-year ARR growth. So eyes are very much on that, both at the discrete product selling level, in this case, let's say, a telematics subscription, but also form of that Trimble Construction One for our transportation customers for them to be able to buy multiple solutions."
}