{
    "symbol": "WAL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-22 00:30:04",
    "content": " This quarter, the company continued its strong financial performance as our diversified national commercial bank again delivered record net interest income, PPNR and earnings, complemented by strong deposit and loan growth, supporting higher net interest margin with stable asset quality. Sound balance sheet expansion continued with quarterly loan growth of $3.6 billion or 7.5% quarter-over-quarter and deposits rose by $1.9 billion or 3.5% quarterly, mostly from noninterest-bearing DDA accounts. Noninterest expense increased 13.7% or $37 million, resulting in an efficiency ratio of 45.5%, primarily due to higher deposit costs related to earnings credit. As mentioned earlier, net interest income growth of $77 million or 15% linked quarter benefited from average interest-earning asset growth of $3.8 billion and NIM expansion of 24 basis points to 3.78%. Deposit costs increased $38 million from the prior quarter due to higher earnings credit rates on deposits of $15.9 billion, of which, $11.3 billion is in noninterest-bearing DDA. Total borrowings increased $1.1 billion over the prior quarter to $7.2 billion, primarily due to an increase in short-term borrowings to fund loan growth in excess of deposit expansion. In total, deposits grew $1.9 billion or 13.9% annualized in the third quarter with noninterest-bearing DDA up $1.2 billion, CDs $533 million, and savings and money market $176 million. Our diversified deposit franchise continues to provide ample opportunities to generate attractive funding to support loan growth with warehouse lending up $1.2 billion, regional banking divisions up $604 million and business escrow services up $424 million. Quarterly net recoveries were $1.9 million, 2 basis points of average loans, which brought us through a net recovery position on a year-to-date basis. Similar to a traditional sharp ratio for stock returns, our risk-adjusted net income growth has been excellent relative to other large peers, among the 33 domestic publicly held - publicly traded banks in the U.S. with assets between $25 billion and $150 billion, Wells has produced the highest risk adjusted average net income growth. Given the uncertain future economic and operating environment, we believe it's prudent to prioritize more measured but still double-digit loan growth, targeting up to $1.5 billion per quarter. Net interest margin is expected to continue to expand in Q4 at a similar pace to Q3, given the anticipated rising rate environment, we expect to continued - we expect continued quarterly expansion of NIM and growth in net interest income throughout 2023, even after the Fed pauses rate increases as fixed rate securities and loans reprice and balance sheet growth continues. Third item is $1.5 billion of loans repriced every quarter with about 50% rolling over at higher spreads, and our fixed rate securities and loans totaling $800 million also repriced quarterly, which we see - we think we can get some benefit from. Certainly, just repositioning our loan growth to up to $1.5 billion is going to help us probably grow net or 14 basis points per quarter. So we're going to pull back our resi loan growth, this quarter, it was $750 million. We think we can do that, and we think we could keep the loan growth to under $1.5 billion and that kind of connects back to the CET1 ratio on why we're trying to also move it up to 10%. So long as we - all we have to do is have our loan betas be no lower than our deposit betas, the loan book and with the securities book, which has demonstrated a variable rate as well, largely, we're going to be able to continue to have expansion of net interest margin and then couple that with a more modest expansion of the balance sheet."
}