{
    "symbol": "RELL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-06 18:43:10",
    "content": " Net sales for the second quarter of fiscal 2022 were $54 million, 27% higher than last year's second quarter. Strong revenues, combined with higher gross margin, produced second quarter operating income of $4.5 million, or 8.4% of revenue. Net sales for the second quarter of fiscal 2022 increased to $54.0 million, up 27.3% compared to net sales of $42.4 million in the prior-year second quarter due to higher net sales across all three business units. PMT sales increased by $8.8 million or 26.7% from last year's second quarter, driven by strong growth from our new power of microwave technology partners for various power and microwave applications, including power management and 5G infrastructure, as well as increasing shipments of the ULTRA3000. Richardson Healthcare sales increased $0.3 million or 10.9% year-over-year, primarily due to an increase in demand for ALTA750 tubes. In addition to higher revenues, total company backlog increased to $146.9 million in the second quarter of fiscal 2022 from a high of $126.5 million at the end of the first quarter of fiscal 2022 and $81.1 million at the end of the second quarter fiscal 2021. Health care gross margin was 24.5% in the second quarter of fiscal 2022, compared to 25.6% in the prior-year second quarter, primarily due to increased component scrap expense. The company reported operating income of $4.5 million or 8.4% of net sales for the second quarter of fiscal 2022, the highest level since the company sold its RFPD business in 2011. In addition, operating income expanded significantly from $0.9 million or 2% of net sales reported in the second quarter of last year. Other income for the second quarter fiscal 2022, including interest income and foreign exchange, was $0.2 million, compared to other expense of $0.1 million in the second quarter of fiscal 2021. Net sales for the first six months of fiscal year 2022 were $107.7 million, an increase of 32.6% from $81.2 million in the first six months of fiscal year 2021. Operating income for the first six months of fiscal year 2022 was $7.3 million, or 6.8% in net sales as compared to an operating income of $0.2 million, or 0.3% of net sales for the first six months of fiscal year 2021. The company reported net income of $6.8 million, or 6.3% of net sales for the first six months of fiscal year 2022 versus a net loss of $0.5 million for the first six months of fiscal year 2021. Finally, during the second quarter of fiscal 2022, we repatriated $0.3 million to the US, from Taiwan, bringing our total year-to-date repatriations to $1.0 million. Sales of the Power and Microwave Technologies Group, or PMT, in the second quarter of fiscal year 2022 grew 26.7% to $41.7 million versus $32.9 million in Q2 last year. Your line is open. We couldn't -- all the business together is probably $10 million, going up 30%, something like that. And that's - and that segment of the business is about $25 million of our business and it's up probably 15%, 20% this year and anticipated to continue like that. Your line is open. You're thinking $215 million, around $215 million in revenue this year, and that could potentially grow 20% next year. Your line is open. Your line is open. Your line is open. We've only invested about $1 million in that business and the first order was $10 million with 35% margin, and the served available market out there for these products is just unlimited. Your line is open."
}