{
    "symbol": "RELL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-21 15:30:21",
    "content": " Net sales for the fourth quarter of fiscal 2022 increased 22.1% to 61.6 million compared to net sales of 50.5 million in the prior yearâ\u0080\u0099s fourth quarter, due to higher net sales across all three business units. DMT sales increased by 10.4 million, or 26.8% from last yearâ\u0080\u0099s fourth quarter driven by strong growth from our new power and microwave technology partners for various applications, including power management, green energy solutions and 5G infrastructure. Sales for several Electron Tube product lines, as well as manufactured products for our semiconductor wafer fabrication equipment customers also increased from the fourth quarter of fiscal 2021. Healthcareâ\u0080\u0099s gross margin was 10.8% in the fourth quarter of fiscal 2022 compared to 29.4% in the prior yearâ\u0080\u0099s fourth quarter, due to a lower level of absorption and higher level of scrap expense. Without the 4.0 million tax valuation adjustment, net income for the fourth quarter of fiscal 2022 was 4.3 million or 6.9% of net sales. Earnings per common share on a diluted basis in the fourth quarter fiscal 2022 were $0.59, compared to $0.14 per comment share on a diluted basis in the prior yearâ\u0080\u0099s fourth quarter. Net sales for fiscal year 2022 were 224.6 million, an increase of 26.9% from 176.9 million in fiscal year 2021. Operating income for fiscal year 2022 was 16.0 million or 7.1% of net sales, as compared to an operating income of 2.9 million or 1.6% of net sales for fiscal year 2021. The company reported a net income of 17.9 million or 8.0% in that sales for fiscal year 2022, versus net income of 1.7 million or 0.9% in that sales for fiscal year 2021. Without the 4.0 million tax valuation adjustment, net income for fiscal 2022 was 13.9 million or 6.2% of net sales. Cash and investments at the end of the fourth quarter of fiscal 2022 were 40.5 million, compared to 39.1 million at the end of the third quarter of fiscal 2022 and 43.3 million at the end of the fourth quarter of fiscal 2021. Our gross margin also increased in the quarter to 34.4% versus 32% in the prior year, which was mainly due to continued success in our engineered solutions products for green energy applications and an extremely strong quarter for our semiconductor wafer fab equipment business. Gross margin as a percentage of net sales was 30.7% during the fourth quarter of fiscal 2022, down from 35.3% during the fourth quarter of fiscal 2021. However, our close relationship with customers and partners overseas enables us to procure long lead time components, which has helped us maintain our backlog at prior quarterâ\u0080\u0099s record level of 52.4 million Canvysâ\u0080\u0099 backlog increased by 52.3% on a year-over-year basis. Your line is now open. So yes, so we were disappointed obviously in the quarter with the margin and that as I mentioned in the presentation was associated with a supply issue where a key part of the tube that we use, there was a change in the process to lose both targets and five tubes and so the margin as a result of the fourth quarter was down around 10%, that was also impacted because we had to stop production. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}