{
    "symbol": "IONS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 15:39:13",
    "content": " We're also continuing to advance our ongoing CARDIO-TTRansform Phase III study, which we expect will enable us to move into this much larger market for patients with ATTR cardiomyopathy. We have now fully enrolled the BALANCE study of olezarsen in patients with familial cargomycrodemia syndrome, or FCS, making this study our next potential Phase III data readout planned for next year. With the potential to add two new medicines to our commercial portfolio next year, along with the steady cadence of Phase III data readouts in the near and midterm, we're looking forward to bringing numerous transformational medicines to the market. Coming up later this year, we plan to report new longer-term data from the Phase 2 open-label extension study in HAE patients treated for one year to demonstrate long-term durable efficacy. The filing includes new integrated data from the Phase 3 VALOR study and ongoing OLE study, which shows tofersen significantly slow decline across multiple measures of ALS disease progression and importantly, led to robust and sustained reductions in neurofilament, a marker for neuro generation. In addition to Eplontersen, our second half highlights include Phase IIb data from IONIS-AGT-LRx, our medicine for treatment-resistant hypertension, OLE data from donidalorsen intended to demonstrate long-term durability in HAE patients, and monotherapy data from Syndelirsen, our medicine to treat acromegaly. We continue to make excellent progress in advancing our other near-term opportunities, our olezarsen and donidalorsen and with multiple positive mid-stage data readouts, we're well-positioned to expand our Phase III pipeline to these eight medicines across 10 indications. Also, the fact that we have a global powerhouse in the cardiovascular space in AstraZeneca to maximize delivery of eplontersen for many patients as possible globally is another key advantage for â\u0080\u0093 for eplontersen in addition to the really exciting neuropathy data that we've generated in NEURO-TTRansform. Gena, as I'm sure you're aware, GSK presented some nice data at EASL on the 24-week end of treatment time point for Bepirovirsen and showed -- but I think it's really remarkable data in 28% and 29% of patients either non-therapy or oncotherapy nucleosides showing going below the limit of detection in the antigens. And really the keys for that will be, seeing if that's sustained in the continued B-Clear data and also in the B-Share study, which is an open-label extension with those patients. Functional cures with the durability that GSK plans to present second half -- additional data second half this year, is to really nail down whether or not we're achieving functional cures in these patients. And looking out there in the marketplace across a robust set of physicians the most important element that physicians are going to want and it depends on the type of patients that they're going to have in their office is that, what is the cardiovascular risk reduction on top of standard of care tafamidis and/or if I don't have a patient on tafamidis. And as far as read through SHTG Gary, we expect a very strong read-through our Phase 2 data was actually in milder patients, patients with milder triglyceride elevations, and we were so they're 60% or higher reductions in triglycerides, and that was at 50 milligrams per month."
}