{
    "symbol": "IONS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:50:25",
    "content": " The Phase III NEURO-TTRansform study of eplontersen in patients with TTR polyneuropathy remains on track for data midyear and working hand in hand with AstraZeneca, we're preparing to file for regulatory approval by the end of the year, assuming positive data. AstraZeneca presented positive Phase IIb data in ACC in April from the ITG study of ION449, our PCSK9 medicine in patients who are at high risk for cardiovascular disease with hypercholesterolemia. Additionally, we reached full enrollment in the Phase IIb study of IONIS-AGT-LRx in patients with treatment-resistant acretension with data expected in the second half of this year. Based on our current rate of enrollment, together with the updates to the study that I just outlined, we're projecting a modest shift on our time line with data read out moving from late 2024 to first half of 2025. We have 2 ongoing Phase III studies, the BALANCE FCS study, which is on track for data next year and the core SHTG study with data planned for 2024. Earlier this year, we reported additional data from the donidalorsen Phase II study demonstrating clinically meaningful and sustained improvements in quality of life in patients with HAE. We're pleased with the positive Phase IIb data on the adhesion study for ION449 or PCSK9 ligaments and patients for high risk of cardiovascular disease, the cholesterol. We're also advancing IONIS-AGT-LRx in a Phase II study in patients with chronic heart failure with reduced ejection fraction, which we expect to read out next year. In addition to the programs I already mentioned, we expect several more data readouts to here, including GSK, to report data from the Phase IIb study in our hepatitis B drug and Bayer to report data from our Phase IIb study of esomarsen or Factor XI LICA medicine in patients with end-stage renal. We've been saying midyear this year, we're expecting the top line data from the Enterphoneuropathy Phase III study. In addition to that readout for the Phase IIb study later this year in refractory hypertension, we have an ongoing study with that drug in patients with heart failure. And sometime next year, we plan to look at all the data, lead molecule, the follow-on molecule, heart failure, refractory hypertension, and we will make a decision on what's the best molecule and what's the next step for Phase III. And there's an ongoing study called Solana, that age is conducting to further confirm the Phase III dose, and that study is looking very good, and they're preparing for Phase III development. So as we've gone out in the marketplace and really tested out their target product profile, it is extremely important to generate data that's on top of tafamidis as well as naive because we're going to have in this very dynamic market a set of patients that are going to be either naive to therapy or a lot, particularly in the U.S. treated on tafamidis."
}