{
    "symbol": "AX",
    "quarter": 1,
    "year": 2022,
    "date": "2021-10-29 00:08:06",
    "content": " Axos reported first quarter net income of $60.2 million for the three months ended September 30, 2021, and earnings per diluted share of $0.99, representing year-over-year growth of 13.6% and 12.5% respectively. Net interest margin for the banking business was 4.48%, compared to 4.11% in the quarter ended June 30, 2021 and 3.91% for the quarter ended September 30, 2020, up 57 basis points over the prior years comparable quarter. Total loan originations for the first quarter ended September 30, 2021, were 2.3 billion, up 28% from 1.8 billion in the year ago period. The first quarter 2022 originations were as follows: $201 million of single family agency gain on sale production, $430 million of single family jumbo portfolio production, $107 million of multifamily production, $25 million of commercial real estate production, $132 million of auto and unsecured consumer loan production, and $1.3 billion of C&I and CRISIL  lending production, resulting in a net increase of $429 million of balances. Originations decreased by approximately 16.9% linked quarter to $201 million, while gain on sale margins increased slightly to 339 basis points from 323 basis points in the fourth quarter of 2021. Our single-family jumbo mortgage business had a next quarter, loan production was strong at $430 million or high prepayments resulted in a net $63 million decline in ending loan balances as of September 30, 2021. Average non-interest bearing demand deposits were $3.6 billion in the quarter ended September 30, 2021, up 46.8% from the prior quarter. Ending time deposits as of September 30, 2021 were down $132 million linked quarter and $532.8 million year-over-year, as we replaced higher costs non-core CDs with lower cost transactional deposits. Of this approximately $1.44 billion of certificates of deposits as of September 30, 2021 on the balance sheet, approximately $1 billion at a weighted average rate of 68 basis points will mature in the next 12 months, with a bulk of the runoff expected to occur in the next six months. The acquisition of the E*Trade Advisory Services RIA custody business, which closed on August 2, added approximately $1 billion to our September 30, 2021 ending deposit balances at Axos' bank. First, we significantly reduced our excess liquidity with average deposits and other financial institutions dropping by approximately $767 million from $1.9 billion in the fourth quarter of 2021 to $1.1 billion in the first quarter of 2022. Yields on loans originated in our single-family jumbo, multifamily and C&I lending groups were 4.26%, 4.39% and 4.2%, respectively in the first three months and at 9/30/2021, compared to 5.12% average loan yield in the first quarter that just ended last month. Our loan loss provision this quarter was $4 million, compared to $1.3 million in the June 30, 2021 quarter, and $11.8 million in the quarter ended September 30, 2020. Our total allowance for loan losses was $136.8 million at September 30, 2021, which represents approximately 1.14% of our total loans and leases, which is approximately 48 times our total annualized net charge offs in the three months ended September 30, 2021. Our loan pipeline remains solid with approximately $1.7 billion of consolidated loans in the pipeline as September 30, 2021, consisting of $180 million of single family agency gain on sale mortgages, $514 million of jumbo single-family mortgages, $235 million of multifamily and small balance commercial real estate loans, and 687 million of C&I and commercial specialty real estate loans, with 94 million of auto and consumer unsecured loans in the pipeline. Our efficiency ratio for the banking segment was three point 39.93% for the quarter ended September 30th, 2021, compared to 45.2% in the last quarter, and the short two months since we closed the E*Trade Advisory Services acquisition, we have already identified dozens of cost synergies by streamlining various processes and procedures. Excluding one-time merger related expenses Axos clearing generated 1.5 million pre-tax income, Axos clearing ended the first quarter of fiscal 2022 with approximately 40 billion of assets under custody or administration, including 25 billion of assets under custody and 15 billion of assets under administration in the clearing business. As Greg mentioned, our provision for credit losses was $4 million for this quarter ended September 30, 2021 up from 1.3 million for the linked quarter ended June 30, 2021 and down from the 11.8 million in the quarter ended September 30, 2020. For the quarter ended September 30, 2021 operating expense was $84.4 million up $2.6 million or 3.1% from the linked quarter ended June 30, 2021. Salaries and related costs increased by $3.5 million on a linked quarter basis, primarily due to the acquisition of 124 AAS employees and the addition of new employees to support growth in both our Banking and Securities, businesses. Occupancy costs decreased $1 million on a linked quarter basis, primarily due to a $0.9 million one-time charge that was incurred in the June 30, 2021 quarter associated with subleasing the New York City office space."
}