{
    "symbol": "AX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-27 20:30:23",
    "content": " 3:13 Axos reported second quarter net income of $60.8 million for the three months ended December 31, 2021, and earnings per diluted share of $1, representing year-over-year growth of 11% and 9.9% respectively. Net interest margin for the banking business was 4.3%, compared to 4.48% in the quarter ended September 30, 2021 and 4.11% in the quarter ended December 31, 2020. Total allowance for credit losses was $140.5 million at December 31, 2021, representing 121 times our annualized net charge-offs, and 1.1% of ending total loans. 6:50 Total loan originations for the second quarter ended December 31 2021, or $2.8 billion of 15.8% from the $2.4 billion in the year ago period. 7:43 Mortgage banking gain on sale income generated $4.6 million, compared to $5.3 million in the quarter ended December 31, 2021 and $10.6 million in the corresponding quarter last year. 12:29 Average non-interest bearing demand deposits was $3.7 billion in the quarter ended December 31, 2021, up from $3.5 billion in the quarter ended September 30, 2021. Yield on loans originated in our single family, jumbo, and multifamily and C&I loans were 3.94%, 4.26% and 4.55% respectively in the three months ended December 31 2021, compared to the 4.93% average loan yield in the second quarter, that just ended last month. Our loan loss provision this quarter was $4 million, which is the same as the loan loss provision of $4 million in the quarter ended September 30, 2021 and down from the last revision of $8 million in the quarter ended December 31, 2020. Our total allowance for loan losses was 140 point 5 million at December 31 2021, approximately 1.1% of our total loans and approximately 121 times our total annualized net charge-offs in the three months ended December 31, 2021. Our capital ratios remain strong, with Tier-1 leverage to adjusted assets of 9.42% of the holding company, and 10.13% at Axos bank, we have Axos to approximately $1.9 billion of Federal Home Loan Bank borrowing, $1.8 billion in excess of $158 million, we had outstanding at the end of the second quarter. 20:21 Axos clearing generated $1.8 million of pre-tax income for the quarter ended December 31, 2021. Our prepayment penalty fee income was $3.3 million for this quarter ended December 31 2021, up from $3 million for the linked quarter ended September 30, 2021. 27:02 Next, our broker dealer fee income increased $2.6 million to $14.4 million for the quarter ended December 31, 2021 Compared to $11.8 million in the linked quarter ended September 30, 2021. In banking and service fees, we had income of $8.5 million this quarter ended December 31, 2021, up from $6.7 million for the quarter ended – from the quarter ended September 30, 2021 and down from $10 million in last year's December quarter. If we look at this, the full quarter impact here on the securities business segment reporting in the 10-Q has about $16.5 million of non-interest income about $21.6 million of non-interest expense, I guess, as we think about those figures going forward is I guess, obviously, the revenue piece, you guys have been pretty clear, you expect to grow as you scale, but on the expense side is there, room for that, to move down or moderate just because of investments you guys are making they're making that elevated?"
}