{
    "symbol": "OKTA",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-02 22:22:06",
    "content": " Fifth Third Bank, a Fortune 500 company was a fantastic addition to Okta because it included both Okta Workforce and Auth0 as Fifth Third Bank continues on its digital transformation journey, implementing a cloud-first identity solution to support its workforce and its digital banking platforms is critical to their, Kyndryl, the world's largest IT infrastructure provider was a great customer win for both Okta Workforce and SIEM this quarter. We're even more excited about the future because starting just last month, the go-to-market organization has been unified under Susan St. One Team driven by the relentless pursuit of making our customers successful, selling both, Okta and Auth0, One Team providing customers with market leading solutions to meet their unique use cases. There is nothing else in the market today that even comes close to Okta's capabilities and the combination with Eugenio and the team and Auth0 is helping us realize our vision of identity as a primary cloud, deliver best-in-class experiences for our customers and win the SIEM market faster. And because identity is so prevalent in all these trends and to be successful to successfully get all this cloud technology to your employees to re-imagine your customer experience and do all securely, you have to have an identity system and that's what we're out there offering to customers of all sizes and all. Overall, when you look at where SIEM is and how far it's come 6% year-over-year growth about that, but I think we're just getting started in this big opportunity, and that's the final exciting part for us. So, areas where we're spending a adding quota-carrying AEs salespeople across the board, whether it be sales engineers or areas in pipeline generation, you can see it's clearly a huge opportunity in front of us, and that's what we're going to invest for. We're seeing really a natural -- it's a natural complement to our advanced life cycle management product with significant new value for customers and new things they can do to automate their business with its access request or access certifications, which is a very, very natural extension of our core product line. And the reason why is because as everyone knows, we're -- our product advanced server access is really, it's in the PAM market today. So you're going to see that, that's a little bit delayed, but still we're expecting to make a bunch of progress on that this year, and we'll be talking more about that as the year unfolds and then also leading up to Oktane in the fall. And then when you think about customer identity access management, I mean, that market has gone from zero when we went public five years ago to a $30 billion TAM today, where we are the clear leaders with the only cloud-native identity management platform, whether you're looking for a developer up or you're looking for tops down. So for us, the channel is really this whole world around us of -- the world is going to more independent, more neutrality, and there's a lot of people who have an aligned interest with us on making their customers successful by that. So yes, I mean, there's a lot of opportunity, it's early days, but we're very excited about how that might work and working with a lot of perspective customers successful. But as we build out on the workforce side, the entire suite, the PAM, IGA in broader workforce capabilities, access management and the other management, what we do the -- it's just going to become really overwhelming the value and it's going to lead to more, I think, big new lands as well. And maybe this is a good one for Fred to chime in too, just in terms of -- is it a broader RFP where there's kind of the network component, the identity component you're all come have they kind of made their choices and then they're bringing an Okta kind of after the fact to layer in that piece. There's another, I'd call them a more advanced set of customers that they know what they want for Zero Trust and they're coming to leaders like Okta, leaders like Zscaler, leaders like CrowdStrike. So it's really gone from a buzzword three years ago where people are like, yes, Zero Trust but I am not what to do about it to now we really have the architectural documents where you can present templates to customers and say, this is what organizations like yours in your industry or of your size and scope and scale are thinking about."
}