{
    "symbol": "OKTA",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-02 00:06:10",
    "content": " With our unmatched array of cloud-native identity solutions that solve a wide range of use cases, it's also clear that Okta is best positioned to capture and execute against the $80 billion total addressable market opportunity. Okta is very well positioned to build on its strong foundation and market leadership position, which gives us continued confidence in our long-term outlook of $4 billion in revenue in FY '26, growing at least 35% in each year through FY '26 and 20% free cash flow margin in FY '26. At the same time, you're seeing a lot of that great Auth0 cross-sell that's already happening just two quarters into the integration that we were really optimistic on, both Auth0 customers becoming new Okta workforce customers and the inverse where someone's been using Okta for a long time, now they're comfortable with Auth0 since they're part of a public company. I think it's very solid, 35%-plus growth each year through FY '26, getting us to $4 billion of revenue and 20% FCF margins. And as we get more and more into these large enterprises with growth rates of customer cohorts with $250,000 plus ACV, $500,000 plus ACV, $1 million plus ACV all growing 50% or higher, you're really starting to see that pipeline generated for next year as well. We're really excited about Workflows, and I think it's - we talked about a Showcase Workflows for any identity use case, which takes the Workflows platform service and breaks it apart from the package of advanced life cycle management so a customer can use it for any identity use case. It might have been something that really just early adopters of technology were thinking about some years ago, but it's the largest organizations in the world that are realizing the importance of identity because of these three big trends that we talk about. I think one thing people miss about IGA and PAM is that the markets today, I think, are 1/10 of the size they could be with a cloud-first product that's tightly integrated to an identity provider like Okta. And they're comfortable now coming to a place like Okta and figuring out, wow, I can really set up the next 3, 5 years of going back into that base at Boeing across 24 divisions or across these other organizations and saying, I know how to sell to all those because I know where all the technology is because I helped install it over the last 10 years.\" And as Freddy mentioned, as the - everyone realizes how important identity is in the overall technology strategy of their organization and they realize that it has to be independent and neutral and our products are so much better than they were a few years ago, it's - these mega deals are going to start coming more and more."
}