{
    "symbol": "APP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 23:21:07",
    "content": " We're continuing to expect $2 billion in software platform revenue in 2023, which will be a 10x increase from 2020 and a 65% increase over the midpoint of a revised software platform guidance in ‘22. And so as we think about how to increase our market over time, and create growth factors for many years to come, we really think about finding the consumers that we know how to serve as well with recommended offerings across other access points, and that’s what may be Connected-TV interesting for us, we're all being one of the leading software solutions to bring content online and Connected-TV for a lot of the brands that have content needed distributed through a channel, we advertise in that content will have immense reach, be very valuable under full train. So MoPub and MAX together is on top of 700 million daily active users around the world, and these consumers in large part on our platform, they're playing games, but I can assure you they don't just play games, the only thing they do in their life, so they're very good audience that level of scale to monetize on both games and non-games, we traditionally focus our solutions for the game developer and really built a lot of performance technology there, MoPub products access to the MoPub marketplace. And we can -- we know that number, because Twitter was still running that business for us in the quarter, subsequently valued integrated entirely in the MAX, MoPub as everyone knows, was completely shut down March 31 of this year, and so it's fully integrated in our numbers rolling forwards, we won't be able to parse it out, because all the data and the consumer customers are all integrated. Yes, sorry, this would require clarifications, on the revenue side that we take to our software business, specifically coming out of MoPub customers with the $40 million, the $210 million we are referring to is the fees that we paid to our vendors, or our publishers to move their inventory on the MAX , right. I mean, look, when we put out a guidance into next year, 10x of the software business from just four years ago, right for a business at this level of scale, reporting on net revenue, and we've now talked about 65% to 70% EBITDA margin out of this business, to be able to do that you got a lot of confidence in your business."
}