{
    "symbol": "BLTE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-04-03 20:39:04",
    "content": " At the same time, we are also halfway, we recruited 41 subjects out of the 90 subjects into our global Phase 3 Stargardt study and we are expected expecting interim readouts by mid-2024 next year. We're looking over about a similar -- same period of time roughly 4.5 years in each patient, which you can appreciate if you compare the baseline images to the last images at 55 or 57 months is that in both cases the auto fluorescent area you see around lesions, which are these bright areas of tissue you see in the surrounding, the lesion, they actually spawn the new dead retina. In the Phase 1b/2 study, we enrolled initially 11 Stargardt subjects and determined in those subjects in the one month Phase 1b that a 5 milligram dose was effective to drive the retinal vitamin protein level down to roughly more than 70% from baseline. We enrolled those subjects then into an open label two-year Phase 2, and we added two additional Stargardt subjects for a total of 13 subjects participating in the ongoing two-year study. This again will be a two-year study with a similar trial design that of Stargardt, in that the same endpoints are the same, same treatment duration and we will get interim analysis at one year, except this study will have 430 subjects randomized in the same manner as the Stargardt study with 2:1 favoring tinlarebant. And you can see looking forward around 2025 to 2026, that's when the earliest timing we would have for an NDA filing with our promising Phase 3 study in Stargardt. Another piece of confirmatory evidence is that if we just look at that QDAF lesion growth from the one year data below, you will see that the acuity of lesion in our subjects had a mean growth of 0.23, whereas the natural history predicts something closer to about 0.5. But in our Phase 3 pivotal study, they will be required to have that because this is the endpoint and we will need some measure of lesion size at baseline to compare subsequent lesion growth rate over the ensuing two years. Of course, it will be a global study double-blind in nature, Two-year randomization favoring tinlarebant as I mentioned, two-year duration with one year interim analysis, and we'll be looking at the same efficacy measures that I told you about, looking at the dead retinal growth, the DDAF lesion growth as the primary endpoint. However, considering the promising data that we have seen in the prior time Phase 2 study, our old Phase 2 study and market potential of GA, we do want to start a GA Phase 3 trial with the limited contractual liability in certain countries that we've already received broad interest from the PI and the size, such as in the U.S. and Australia. In Phase 3, these subjects will be required to have a measurable DDAF lesion of at least 0.05 millimeter square in order to enter the trial, again, because we have to have a baseline measure of atrophy as a sort of a reference point to measure subsequent lesion growth."
}