{
    "symbol": "BLTE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 02:35:55",
    "content": " Our goal is to deliver treatment for dry AMD and Stargardt disease, these which is leading cause of vision loss where AMD affects around about 200 million patients worldwide and as for Stargardtâ\u0080\u0099s disease being rare disease, it is the most common form of inherited retinal disease, which affects one in 10,000 children and adults. The data that Iâ\u0080\u0099m referring to comes from Phase 2 proof-of-concept study led by our CSO about 10 years ago in dry â\u0080\u0093 in advanced dry AMD patient thatâ\u0080\u0099s treated with retinoid, Fenretinide which is an anti-cancer drug with some are before antagonist activity. So from our â\u0080\u0093 both of our Phase 1 study in healthy adults and our ongoing Phase 2 study in adolescent Stargardt subjects, we have identified the optimal dose to be a low dose of five milligrams that could achieve RBP4 reduction of more than 70%. Weâ\u0080\u0099re also seeing very promising data from this Phase 2 study in adolescent Stargardt patients thatâ\u0080\u0099s treated with five milligrams of LBS-008, which Nathan will be presenting later on. So two-year study, weâ\u0080\u0099ll be looking again at safety intolerability, but more importantly, weâ\u0080\u0099ll be looking at efficacy this time, because weâ\u0080\u0099re already establishing safety intolerability in our ongoing Phase 2. So at one year, if weâ\u0080\u0099re seeing the same trends where weâ\u0080\u0099re seeing a reduction in the auto fluorescence, a reduction in number of patients converting to  atrophy and preservation or improvement vision, if we see that at one year, so we have two data points, six months in one year where weâ\u0080\u0099re seeing the positive trends. So, if we come out of the Phase 2, which is this open-label study with just stellar results, it wonâ\u0080\u0099t mean anything to the agency, but if we bring that data into the Phase 3, that is, we see the same thing, the same efficacy trends in Phase 3, and bring that to the agency, particularly if weâ\u0080\u0099re saving vision."
}