{
    "symbol": "CHNG",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-06 13:19:02",
    "content": " We were faced with difficult year-over-year comparables in the quarter, created by elevated COVID-related activities last year and customer attrition related to the extended UHG merger process. Despite these headwinds, we grew revenue in the quarter and positioned ourselves well to deliver on our 2% to 4% revenue growth expectations for the year. Solutions revenue, adjusted EBITDA and free cash flow were $831 million, $280 million and $4 million, respectively, in the first quarter. Our performance reflects continued new bookings momentum, existing customers expanding their business with Change Healthcare, new product introductions and new business initiatives, partially offset by lower revenue from COVID-related activities, customer attrition related to the extended UHG merger process and our continued investments to support business initiatives. As the combined year-over-year challenges from COVID-related volumes and the UHG merger-related attrition start to subside in the third quarter, we expect significantly stronger growth starting in the fourth quarter and throughout our next fiscal year, starting in April 2023, our fiscal year â\u0080\u009824. If the merger closes, we expect that Change Healthcare shareholders will receive $27.75 in cash, comprised of the $25.75 per share deal price along with a special cash dividend of $2 per share. In the event the merger is unable to be completed due to the courtâ\u0080\u0099s decision, UnitedHealth Group will pay a $650 million fee to Change Healthcare. We have now launched our patient engagement suite, combining Luma Healthâ\u0080\u0099s patient success platform solution with Change Healthcareâ\u0080\u0099s revenue cycle management solutions to give patients and providers a cohesive experience that spans the entire healthcare journey. Moving on to our Network segment, we have seen continued year-over-year growth in transaction volumes across our core networks, driven by new customers and expansions of our business with existing customers, offset by customer attrition and lower COVID-related claims volume. Q1 was a strong new bookings quarter, particularly in our pharmacy network business, where we signed several multimillion dollar deals, including a deal worth nearly $5 million annually with an innovative technology company focused on reducing wasteful pharmacy and patient spending. Our leadership in providing microservice-based and API-based solutions to the healthcare industry, along with our payments and data solutions businesses are fueling the continued growth of our Network segment beyond underlying transaction volume growth. And as in prior quarters, we remain focused on expanding the underlying margins in the Technology-Enabled Services businesses through automation and AI to increase our efficiency and drive stronger performance for our customers. Our first quarter growth demonstrates that despite headwinds from lower COVID-related volumes and customer attrition related to the extended UHG merger process, the underlying momentum of our core franchises remain strong. And with our sales pipeline and investments in innovation, we are well positioned to materially accelerate growth as we get to the fourth quarter and the 4 mentioned year-over-year challenges become less impactful. For the first quarter, solutions revenue was $831 million compared to $870 million in the same period of the prior fiscal year, which included a $4 million fair value adjustment associated with the McKesson exit. The quarter was positively impacted by volume growth and new sales, partially offset by the aforementioned UHG merger-related attrition and more normalized healthcare activity compared to last year. Net of the impact of the deferred revenue fair value adjustment in the prior period, solutions revenue increased 1.2% year-over-year. Net loss for the quarter was $23 million, resulting in net loss of $0.07 per diluted share compared to a net loss of $4 million or $0.01 per diluted share for the same period of the prior fiscal year. Adjusted EBITDA for the quarter was $280 million, a decrease of 0.9% over the same period of the prior fiscal year. Adjusted net income was $124 million, resulting in adjusted net income of $0.38 per diluted share compared with adjusted net income of $133 million or $0.41 per diluted share for the first fiscal quarter of the prior year. Starting with revenue, the Software and Analytics segment increased 2.1% year-over-year, driven by new customers, volume growth with existing customers and new product innovations partially offset by attrition related to the pending UHG transaction. Revenue in our new Enterprise Imaging segment increased 0.8% year-over-year, driven by new sales growth and partially offset by the timing of implementation revenue. In our Technology-Enabled Services segment, overall revenue decreased 1.7% year-over-year as a result of onetime projects during the prior year that did not recur during the current quarter and lower COVID revenue. Turning to adjusted EBITDA, Software and Analytics increased 5.8% year-over-year, driven by the aforementioned revenue growth. Network Solutions adjusted EBITDA decreased 1.9% year-over-year, driven primarily by continued investment to support a significant number of new product launches and market expansion initiatives that we have underway and negative mix as COVID-related activities in the network abated. Enterprise Imaging adjusted EBITDA decreased $1.3 million year-over-year, driven by hiring to support business growth and research and development expenses. In Technology-Enabled Services, adjusted EBITDA decreased $7 million year-over-year, driven by the same factors that impacted revenue as well as increased wage inflation and hiring challenges in a difficult labor market. Starting with the full year, our expectation of 2% to 4% solutions revenue growth is unchanged from what we outlined last quarter. Our full year free cash flow expectation of $450 million to $500 million remains the same, albeit most likely at the lower end of the range due to the higher litigation costs associated with the merger. As for the full year cadence, we began seeing a material impact from attrition related to the UHG merger in the fourth quarter of fiscal year â\u0080\u009822, which is why we anticipate more muted year-over-year growth through the first three quarters of the fiscal year. Specifically to the second fiscal quarter of FY â\u0080\u009823, we expect flat to low single-digit revenue growth in all four segments due to the aforementioned headwinds. For second quarter adjusted EBITDA, we expect year-over-year declines in all four segments due to the aforementioned revenue headwinds, along with other factors unique to each business unit. In Software and Analytics, we expect a high single-digit percent decline in adjusted EBITDA year-over-year due to negative mix shift for the quarter. After that, we expect double-digit percent EBITDA growth for that business unit for the remaining two quarters of the fiscal year as prior year bookings start to drive significant revenue growth. And in Technology-Enabled Services, we expect a low double-digit million dollar decline in adjusted EBITDA due primarily to increased contractor costs, wage inflation and lower COVID volume versus prior year."
}