{
    "symbol": "MAA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 16:03:05",
    "content": " The foundation for the projected 2023 performance is same-store revenue growth produced by historically higher rental pricing earn-in of about 5.5% combined with the more normalized blended rental pricing performance of 3% for the year, as well as a continued strong occupancy remaining between 95.6% and 96%for the year. I mean broadly, as Al mentioned, I mean, we do expect that the overall rent growth for the market next year will be something around 3%, which I think is going to be fueled by what we expect to be a continued relatively stable employment backdrop to what we're seeing today. And so, as we think about the outlook for '23, I mean, we're â\u0080\u0093 it's definitely moderated from what it was 2022, but we're not seeing any concerns at the moment that a severe contraction or any sort of a worse â\u0080\u0093 a materially worse decline in the employment markets were to occur now. If that does happen is, as I alluded to in my comments, we've been through recessions in the past, and we think that if we find ourselves in a more severe economic contraction, where broadly the employment markets start to really pull back, we think that that's where the sort of defensive characteristics that we've built into our strategy really start to pay a dividend for us and that's where our secondary markets come into play on lower price point of our product comes into play and the broad diversification to employment sectors that we have across the large number of markets that we're in, all provide some level of cushion, if you will, if we find ourselves in a more severe downturn. So, the 8% to 9% I talked about on renewals, I think that probably carries through the first quarter, call it, and then starts to moderate a little bit as you get into probably, June through the rest of the year, I would expect it to be a little more normal with sort of what you've typically seen from MAA, which is kind of in that 6% to 7% range and then on the new lease side, we're sitting slightly negative right now. Well, on the new lease rate side, I guess what specifically â\u0080\u0093 I mean it seems like that's fairly low relative to what you've achieved historically, pre-pandemic period and with 3% market rent growth, you would think that you kind of surpass that 3% into the peak leasing season before it moderates in the back half of the year. It is fairly consistent around that 3% for the year with obviously more -- a little higher in the second two quarters of the year, as Tim mentioned, as we get more traffic and renewals hold stronger and new lease pricing becomes most robust. But in terms of getting to low end, I think it's kind of back to Eric's comments on the economy, if we see a further deceleration in demand or see something a shock on the economic front that could drive pricing obviously lower and that's how you get towards the lower end of the guidance and then the opposite a little bit better economic backdrop would push pricing higher and get us more to the higher end of revenue guidance. And so we're â\u0080\u0093 given the supply that's coming into the market, given the difficult financing environment we find ourselves in, we think that, that area of opportunity is going to emerge over the course of this year, and that's what we've kind of dialed into our guidance for the year. Taxes, when you go into the year, notoriously, you don't have a lot, you're going off -- you have a good idea what you think valuations will be based on cap rate markets, but you're totally guessing on millage rates, and that has been very volatile in the last year-or-so as municipalities deal with their budget issues. So hitting on R&M, it's really driven by inflationary pressures, not so much we expect to get really any worse in 2023 that kind of carry over earn-in, if you will, on some of the inflationary increases that we saw in 2022,we've seen HVAC up 16%, plumbing up 18%, appliances up 17%. I think what you â\u0080\u0093 the cadence for expenses, you should see the most pressure in probably Q1 and that's because you've got a continuation of sort of the inflationary levels that we saw in third and fourth quarter carrying sequentially over and comparing to Q1 last year with a lot of inflationary pressure wasn't yet built in. Our â\u0080\u0093 we got a pretty â\u0080\u0093 we have a pretty good beat on what's revaluing this year, it's primarily Texas and part of Atlanta, parts of Georgia, there's primarily Atlanta, and so given what's revaluing and our expectations for millage rates, and we have a few of our cases from 2022 that we're litigating that are spilling over into 2023."
}