{
    "symbol": "NMRK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 15:52:06",
    "content": "  Operator: Greetings, and welcome to the Newmark Group Second Quarter 2022 Financial Results Call. I would now like to turn the conference over to your host, Jason McGruder, Head of Investor Relations for Newmark Group. The results provided on today's call compare only the second quarter of 2022 with the year earlier period, unless otherwise stated. Any figures with respect to cash flow from operations discussed on today's call refer to net cash provided by operating activities, excluding loan origination and sales, as well as the impact of the 2021 Equity Event. We will be referring to our results on this call only on a non-GAAP basis, unless otherwise stated. Please see the section of today's press release for the complete and/or updated definitions of any non-GAAP terms, reconciliation of these items to the corresponding GAAP results and how, when and why management uses them. Additional information with respect to our GAAP and non-GAAP results is available on our website in today's press release, the supplemental Excel tables and the quarterly results presentation. Any outlook discussed on today's call assumes no material acquisitions, share repurchases or meaningful changes in the company's stock price. These expectations are subject to change based on various macroeconomic, social, political and other factors, including the COVID-19 pandemic. While our 2025 financial and operational targets do assume acquisitions, they are also subject to change for these same reasons. Except as required by law, Newmark undertakes no obligation to update any forward-looking statements. For a complete discussion of additional risks and uncertainties which could cause actual results to differ from those contained in forward-looking statements, see Newmark's Securities and Exchange Commission filings, including, but not limited to, the risk factors set forth in the most recent 10-K, 10-Q or 8-K filings, which are incorporated by reference. I'm now happy to turn the call over to our host, Barry Gosin, Chief Executive Officer of Newmark Group, Inc.\n Good morning, everyone, and thank you for joining us. With me today are Newmark's Chief Financial Officer, Mike Rispoli; our Chief Revenue Officer, Lou Alvarado; and our Chief Strategy Officer, Jeff Day. In the second quarter, we achieved record revenues, up 20%; record adjusted EBITDA, up 32%; and record earnings per share, up 48%. Our average revenue per producer of $1.3 million and our average revenue per all employees of $538,000 have both increased by over 40% since 2019. That is the definition of organic growth and is the clearest indication of the quality of our business, caliber of our people and the strength of our platform. Our culture of collaboration and use of data and technology enhances our cross-selling of services, which in turn has led to superior client experience and increased productivity per employee. Since the onset of the global pandemic, Newmark has substantially increased its revenues and earnings while gaining market share. We believe that our clients appreciate the expertise of our professionals, especially in times of uncertainty, and we are well positioned for further market share gains. We are confident that we will reach our 2025 targets, which include generating $4.5 billion of total revenue and $900 million of adjusted EBITDA. Newmark has been the fastest-growing commercial real estate services company for the past decade, and we expect to continue to outperform the industry. Year-to-date, we are the #2 U.S. investment sales company compared to a decade ago when we were #25. 10 years ago, we announced that we were going to focus and grow our investment sales in that business, and our success speaks for itself. Using capital markets as the tip of our spear, we will continue to drive growth across agency leasing, servicing property management and valuation advisory. We are now focused on replicating our growth internationally and recently purchased BH2, a leading capital markets firm based in London. Like our U.S. strategy, we will leverage our capital markets business to drive growth across our platform globally. This dramatic growth was fueled by our proprietary technology, which has driven a 49% year-on-year increase in average revenue per appraiser. In addition to international growth, we expect to expand our portfolio and entity investment sales business, which represents approximately 30% of the overall market. We are expanding our multifamily business into workforce housing, single-family rental housing, and we expect our flexible workspace business hotel to grow its revenues by $200 million to $300 million over the next several years. Today, Newmark reported its best ever second quarter revenues and earnings. During the quarter, we repurchased 11.4 million shares at an average price of $12.75 per share. Expenses increased by $84.3 million, of which $61 million was variable compensation, primarily related to growth in commission-based revenues and $17.9 million was related to acquisitions. This reflected strong cash flow from operations, offset by $175.9 million for share repurchases, cash used for acquisitions of $64.2 million and normal first half uses of working capital. Our cash on hand, undrawn credit facility and seasonally strong cash generation in the second half of the year will provide us with well over $1 billion of available capital. Before I turn to outlook, I want to highlight our long-term track record of growth. Since 2011, we've had an industry-leading 29% annual growth rate and more than doubled our revenues and our adjusted EBITDA since our year-end 2017 IPO. We remain confident in our 2022 revenue and adjusted EBITDA outlook, which we initially published in February. We expect to grow total revenues between 3% and 7% compared with $2,906.4 million. There was a certain amount of people that were looking to get in front of any potential interest change, but it was consistent and that was a good quarter. I mean, we're in an environment where the Fed just raised interest rates 75 basis points 2x in a row. There's $400 billion of available capital and $250 billion in the United States, so there is certainly still a desire to acquire. So I think it will -- unlike in some markets where it could last 3, 4 quarters, I think this could be actually quicker and reset quicker. The first is, Barry, on the office REIT calls over the past -- this earnings season, they've all talked about slowdown in leasing, whether it was actual slowdown that they recorded in the quarter or their conversations with their tenants are clearly indicating a slowdown. On the capital market side, whether it's office, retail -- not retail, well, retail is slow, apartments, like all the sectors, levered buyers have pulled back. So transaction volumes that they're seeing are way down and the mortgage market has really come to an almost standstill, if you will, save for a few deals. I mean, we reiterated our guidance for the year. And as soon as that occurs, there will also -- they'll just be back to business and things will start trading again. Yes, I mean with respect to the leasing market, there has been some slowdown in the leasing market. Remember, occupancy is 45%, and we're up 15%. People who want to sublease space, people who want to renew their leases, I think some of what you've read in terms of the companies that have stopped their recent leases has been just the expansion, and that's a function of the market and where tech is right now. But if you look at the -- historically, at San Francisco and other markets, when the tech market goes down, they stop acquiring. There's lots of empty space, and it goes down quick and then it comes up just as quick. On your Knotel business, what is your -- maybe just an update on that what the occupancy is, how the trends have been as far as occupancy rates and growth of U.S. versus international. We think this is a market that's going to grow mid- to high-teens for the next several years, and we think we're going to meaningfully outgrow it. We have a great business in Europe, and we have a growing business in the U.S., and we just think it's a growing category. And we're in a -- as you know, a very low price point, and we think it's going to be a great outcome for Newmark and for our shareholders. And Mike, when you say the 90% occupied for Knotel, is that the same, whether it's Europe, international or U.S. or is there a bunch of new variations? Yes, it's the same. And I think as we head into next year, towards the end of this year, beginning of next year, we'll have more product in the U.S. And then we'll be able to compare occupancy rates, I think, U.S. versus Europe and the rest of the world. You guys mentioned getting into the portfolio advisory business, if I understood that correctly. It's yes, yes and yes. We were the #2 investment sales company in the U.S. That's the hard work, building -- going through 5 years of trench warfare to create the geographic distribution and the capability and expertise in the market for single assets and some smaller portfolios. So to access new sources of capital, more patient sources of capital, we've been -- we've demonstrated really good success over the last few years. And then on the leasing side, you mentioned some large leasing transactions potentially in 2022 still as well as next year. So Jade, I think you rightly point out that the second half of last year is a typical comp. The business -- our business was up 45% if you compare it to 2019, back half of last year to back half of 2019. Certainly, it's our view that the capital markets transaction activity will be down more than, say, leasing. We also have some great businesses, recurring businesses that will continue to grow. And I think you see, overall, the business is up 26% revenue in the first half and up 3% to 7% for the full year, but that's our thinking as we reaffirm the guidance. In terms of the market share gains that Newmark has been able to achieve, particularly in capital markets, I'm on a couple of the e-mail lists, and I see it every week, every day also. We still have white space and opportunities, yet we're not crowded. So we've got -- we are a perfect formula for really talented people to come join us to be part of the best, most creative, innovative capital markets business and the fastest growing globally. There's a lot of just value destruction that takes place, there's a lot of friction. And there's a point of no return or indifference makes it really, really hard to do. And we have been doing both -- lots of bolt-ons, acquiring teams, talent, and we think that's an incredibly efficient way to do it. It sounds like the CMBS market is really, really tough right now. Well, what we've guided -- this is Jeff, Patrick. The CMBS space is actually showing some signs of life, and we're seeing a little bit of recovery there. Last year was a year where we saw a lot of relatively high leverage floating rate financing on acquisitions, much of which was executed through CLOs. That business, as interest rates started rising and we had more volatility in the capital markets, started to fall off earlier this year and still really hasn't recovered. But there's actually a very good supply of capital, debt capital coming from life companies, banks, still from some debt funds. Well, there's still an enormous demand for multifamily in the U.S. for a host of reasons. Offices has been stressed because, in part, because of the conversation and the confusion about what occupancy is going to look like, what hybrid is going to look like. But the reality is that CEOs are committed to office and companies have to be in the office at some point, and there's less hoteling than you might think. And so it's just a matter -- but there has been some reset in pricing, and it depends on the product. And we're in the trading business, so we -- companies need advice. So there's always the need for space, and we're still committed to the office market. I'd like to thank everybody for joining us today, and I look forward to the next quarter."
}