{
    "symbol": "TAK",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-02 23:54:06",
    "content": " In Q3 year-to-date, core revenue was almost JPY3.1 trillion, with growth of 4.5% at a constant exchange rate. Our top line continued to be driven by great momentum from our growth and launch products, which now represents 39% of total revenue and grew at 20% year-to-date at a constant exchange rate. Core operating profit was JPY954.7 billion, enabling us to maintain a competitive core operating profit margin of 31.1% and core earnings per share was JPY456 with growth of 17.1% at a constant exchange rate. Despite the entry of VELCADE Generics in May 2022, we continue to deliver solid top line growth, up 4.5% versus prior year at constant exchange rate, driven by our Growth and Launch products. Reported revenue growth was 13.9%, with business momentum and foreign exchange upside more than offsetting the impact of a JPY133 billion gain from the sale of the Japan Diabetes business that was booked in Q1 of prior year. Core operating profit grew 9.7% at constant exchange rate to JPY954.7 billion, and our core operating profit margin was 31.1%, an increase of 1.5 percentage points on a year-over-year basis. Reported operating profit declined 13.1% year-to-date impacted by the sale of our diabetes portfolio last year, but this impact is diminishing as each quarter goes by, and we still expect to end the full year with growth. As highlighted in previous quarters, the sale of the Japan Diabetes portfolio in Q1 of last year is impacting our reported operating profit growth, but reported EPS is actually up 19.6%, benefiting from a favorable reported tax rate. Iâ\u0080\u0099m very pleased with the year-to-date growth we are delivering on a constant exchange rate basis with revenue up 4.5%, core operating profit up 9.7% and core EPS growth of 17.1%. On the left is a waterfall chart for reported revenue, which grew at 13.9% year-on-year with business momentum and FX favorability more than offsetting the impact of the JPY133 billion one-off we booked in Q1 of last year from the sale of the Japan Diabetes portfolio. You can see our business momentum was driving 4.5% growth at constant exchange rate, with the additional FX tailwind raising total core revenue growth to 19.8%. On Slide 18, you can see that the key driver of top line growth is our portfolio of Growth and Launch products, which generated approximately JPY1.2 trillion or 39% of total revenue quarter three year-to-date with 20% growth at constant exchange rates. With our five key business areas; GI, our largest area by revenue, grew at 11% year-to-date on a constant exchange rate basis. On the right side of the slide, you can see the core operating profit was JPY954.7 billion, with our business momentum driving 9.7% growth at constant exchange rate. Iâ\u0080\u0099m pleased to say that we are on track to meet our full year management guidance for growth at constant exchange rate, with core revenue growing at low single digit and core operating profit and core EPS growing high single digit. We continue to see strong momentum from our commercial portfolio, which enabled us to deliver 4.5% core revenue growth at constant exchange rate Q3 year-to-date. Our margins are strong at 31.1%, and we delivered year-to-date core operating profit growth of 9.7% at constant exchange rate, well on track towards full year guidance of high single-digit growth. Thank you very much. Thank you very much. So, if you look at year-to-date, the gross profit margin year-to-date â\u0080\u0093 Q3 year-to-date versus Q3 year-to-date â\u0080\u009821, in fact, our gross profit is improving on an actual basis by 0.5% and on a constant exchange basis, itâ\u0080\u0099s grown by 0.1%. At the same time, if you look at our core operating profit margin, itâ\u0080\u0099s improved year-to-date by 1.5% for both actual and constant exchange rate. Thank you very much. Thank you very much. Thank you very much."
}