{
    "symbol": "VIAV",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-11 19:35:54",
    "content": "  Fourth quarter revenue came in at $335.3 million, up 7.8% year-over-year, exceeding our guidance range of $315 million to $329 million. NSE quarterly revenue at $246.2 million, up 4.1% year-over-year was within our guided range of $240 million to $250 million, a new quarterly record in this business segment. Within NSE, NE increased 4.5% from a year ago to $222.2 million reflecting continued strong demand for our wireless and optical lab and production products. Despite the COVID-19 pandemic-related supply chain issues and inflationary pressures, Viavi was able to mitigate much of the impact, resulting in a strong finish to a record of $1.3 million, up 7.8% from fiscal 2021. NSE reached a record revenue of $949.1 million, up 13.3% year-over-year, well within the range of our long-term goal. At the end of fiscal Q4 2022, the ending balance of our total cash and short-term investments was $565 million, down $139 million compared to a year ago, mainly a result of refinancing 57% of our convertible debt with longer notes at a favorable rate. During 2022, we generated $178 million in operating cash flow and deployed $73 million or 5.6% of revenues towards capital expenditures, resulting into $106 million in free cash flow generation. In the fourth quarter, we completed transactions to extinguish an additional $22.4 million in principal value of convertible loans at a total reacquisition cost of $27.2 million, bringing the principal value of our combined convertible notes outstanding to $292 million at the end of fiscal 2022, or 43% of the original principal value. We expect NSE revenue to be approximately $236 million, plus or minus $5 million, with operating profit margin at 14.5% plus or minus 50 basis points. OSP revenue is expected to be approximately $88 million, plus or minus $2 million, with operating profit margin at 40%, plus or minus 100 basis points. So yes, I mean -- so I think on the NSE side, I donâ\u0080\u0099t think we have that much variability andâ\u0080¦\n So there's a little bit more project-related, Alex, on the NSE side, in our wireless and lab business, not so much an OSP issue and there was a little bit of FX translation that drove the year-over-year down, the number was about $5 million for the quarter, purely FX translation on a weaker euro or stronger U.S. dollar."
}