{
    "symbol": "PRM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 06:59:25",
    "content": " We now expect â\u0080\u009922 Specialty Products adjusted EBITDA to exceed $50 million, which is more than double the businessâ\u0080\u0099s adjusted EBITDA in each of the prior three years. In closing, and with the year largely behind us, I reiterate our prior view that had the â\u0080\u009922 fire season come in roughly on trend line, we had expected to deliver mid-teens or greater percent growth in 2022 consolidated adjusted EBITDA versus the approximately $141 million we reported in 2021. As illustrated on Slide 12, we expect 2022 Specialty Products adjusted EBITDA to exceed $50 million, more than double the businessâ\u0080\u0099s adjusted EBITDA in each of the three prior years. Turning to Slides 13 and, third quarter sales in our Fire Safety business were $122 million, down 29% versus the prior year and $207 million year-to-date, down 13% versus the prior year. Third quarter adjusted EBITDA in our Fire Safety business was $60.4 million, down 38% versus the prior year and $81.2 million year-to-date, down 30% versus the prior year. Switching to Specialty Products, third quarter sales in our Specialty Products business were $38.5 million, up 68% versus the prior year and $112.2 million year-to-date, up 42% versus the prior year. Third quarter adjusted EBITDA in our Specialty Products business was $15.3 million, up 512% versus the prior year and $42 million year-to-date, up 135% versus the prior year. Moving on to the Consolidated business, third quarter Consolidated sales were $160.5 million, down 18% versus the prior year and $319.2 million year-to-date, up 1% versus the prior year. Third quarter consolidated adjusted EBITDA was $75.6 million, down 25% versus the prior year and $123.3 million year-to-date, down 8% versus the prior year. Right, thanks very much. You just got to be careful on peak-ish or trough-ish years, which is what we know, is in the earnings call, if 2022 had been a roughly normalized fire season, we think roughly mid-teens growth off of the $141 million of adjusted EBITDA, we delivered last year would be reasonable. We think you can take 2021, which was $141 million spot for, had this year been normal or at least a normalized fire season, it will be roughly mid-teen, the EBITDA growth that'll get you to 141.4 times 1.15, right, to be very specific. Right, thanks very much."
}