{
    "symbol": "PRM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 21:02:02",
    "content": " Our consolidated adjusted EBITDA is up 39% year-to-date, with solid growth in both our Fire Safety and Specialty Products businesses. We've consistently stated that, assuming a roughly on-trend 2022 fire season and incorporating our best assumptions around all the other aspects of our business, we expect consolidated adjusted EBITDA growth consistent with, and perhaps above, our long-term framework of mid-teens growth. We've also consistently highlighted that within the highly predictable and dependable long-term growth we expect in our Fire Safety business, we also expect quarterly and annual variability tied primarily to the severity of the North America fire season. Despite this, Fire Safety had a solid first half with 11% year-to-date adjusted EBITDA growth, and we believe the business is well positioned assuming an on-trend line 2022 fire season. Second quarter sales in our Fire Safety business were $66.6 million, up 16% versus the prior year; and $85 million year-to-date, up 31% versus the prior year. Second quarter adjusted EBITDA in our Fire Safety business was $24.2 million, up 3% versus the prior year; and $20.9 million year-to-date, up 11% versus the prior year. Second quarter sales in our Specialty Products business were $34.4 million, up 15% versus the prior year; and $73.7 million year-to-date, up 31% versus the prior year. Second quarter adjusted EBITDA in our Specialty Products business was $11.5 million, up 50% versus the prior year; and $26.8 million year-to-date, up 74% versus the prior year. Second quarter consolidated sales were $101 million, up 16% versus the prior year; and $158.7 million year-to-date, up 31% versus the prior year. Second quarter consolidated adjusted EBITDA was $35.7 million, up 10% versus the prior year; and $47.7 million year-to-date, up 39% versus the prior year. And it's completely consistent with both our view of the long-term trends and our experience over the last few years where we see continued growth in acreage burned, continued growth in spending on fighting wildfires, continued growth in the resources, including air tankers that are used to fight fire, and we think that those trends are solid and will continue."
}