{
    "symbol": "WWD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-02 22:41:06",
    "content": " Net sales for the second quarter of fiscal 2022 were $587 million compared to $581 million, an increase of 1%. However, in the quarter and looking to the remainder of the fiscal year, we anticipate ongoing market volatility due to industry-wide COVID-19-related disruptions, including global supply chain challenges and labor shortages as well as the lockdowns in China and the war in Ukraine. Sales for the quarter were negatively impacted by approximately $100 million due to ongoing industry-wide COVID-19-related disruptions, including supply chain constraints and labor shortages. Aerospace segment sales for the second quarter of fiscal 2022 were $370 million, an increase of 2%. Segment sales were negatively impacted by approximately $60 million of industry-wide COVID-19-related disruptions, which resulted in shipment delays for some orders. However, timing can be delayed due to certain contractual arrangements. Industrial segment sales for the second quarter of fiscal 2022 were $214 million compared to $217 million, a decrease of 1%. Segment sales were negatively impacted by approximately $40 million of industry-wide COVID-19-related disruptions, weakness in China natural gas engines and an $8 million unfavorable foreign currency impact, all partially offset by increased marine sales as we continue to see higher utilization of the in-service fleet. Industrial segment earnings for the second quarter of 2022 were $17 million, or 8.1% of segment sales compared to $28 million or 12.9% of segment sales. However, timing can be delayed due to certain contractual arrangements. Please state your question. Tom, congratulations on your retirement. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Please state your question. Tom, congratulations on your retirement. The $30 million of supply chain, COVID logistics that you cited for the quarter that was $70 million last quarter, it sounds like that $30 million was sort of - was a surprise and comes out or I guess maybe that there was some assumption for that and the $30 million was larger than the assumption. Well, it's just kind of what I highlighted a little bit earlier, the $30 million was really primarily additional supply chain issues. I guess where I'm going with that, Tom, is if there was $30 million in a quarter and now there's - it sounds like you're thinking and others are thinking that supply chain issues that seem like they might resolve themselves sooner than later, are now looking like they're going to last through the end of the calendar year. And so if it's a $30 million a quarter run rate, maybe it's not $30 million because maybe it gets a little better in the back half and maybe you had some assumption in the old guidance. But if it was 30 times three quarters and then China shut down on you and then some of the deliveries are worse, and then there's FX, it just sounds like that adds up to more than $50 million to $100 million is where I'm going. Well, a little bit - I was just saying this a little bit earlier, if you look at the range we gave, we do and believe we will make progress on recovering some of that $100 million in the second half."
}