{
    "symbol": "WWD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-02 00:13:04",
    "content": " Segment earnings including as a percentage of segment net sales were negatively impacted by net inflationary impacts, including material and labor cost increases, as well as increases in manufacturing costs related to the supply chain disruptions and inefficiencies related to training new hires. However, timing can be delayed due to certain contractual arrangements. In addition, segment sales were negatively impacted by weakness in China natural gas engines, and global supply chain and labor disruptions delayed shipments of approximately $45 million. Industrial segment earnings decreased primarily as a result of net inflationary impacts including material and labor cost increases, as well as increases in manufacturing costs related to supply chain and labor disruptions, and inefficiencies related to training recent hires. However, timing can be delayed due to certain contractual arrangements. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. The third one, really on the Aerospace side of the business, Chip mentioned earlier, we are talking about the impact of the bill, all the way back to the kind of the China shut down is the kind of the root cause of that, that does have an impact on our production in our flow capability, and obviously, that volume output when it slows and itâ\u0080\u0099s not moving smoothly and efficiently that has an impact on overall earnings also. Your line is open. So, it wasnâ\u0080\u0099t China that was the OH business specifically, it was really the -- primarily the euro impact generally you remember our Lâ\u0080\u0099Orange business that we acquired in 2018, itâ\u0080\u0099s a euro denominated business, and unfortunately, the currency rate, the euro to dollar, that impact is offsetting all of the growth in all of the other markets and Industrial that we are seeing and thatâ\u0080\u0099s an essence why we are ending up flat for this year. Your line is open. Obviously, our 2022 revenue based on both the supply chain disruption impact and the currency impact kind of get you to a different basin in the first year, but itâ\u0080\u0099s definitely over the five years, and I mean, as Chip mentioned, we see strong demand across most of our markets and thatâ\u0080\u0099s whatâ\u0080\u0099s driving that CAGR."
}