{
    "symbol": "SDIG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-29 14:33:07",
    "content": " We are constantly looking at good prices and Bitcoin mining economics and choosing whether to self-power our Bitcoin money operations, sell power to the grid or import power from the grid to power miners when grid pricing is lower than our variable cost of power. During the fourth quarter, as Bitcoin prices continue to slump, we showcased the benefits of owning our own power plants and how our power market optionality provides us with strategic advantages over our peers. During the quarter, we experienced two extremes, record high PJM power prices in December and the record low Bitcoin hash price in November and we are able to flexibly shift between selling power to the grid and using our self-generated power to mine Bitcoin. During this period, we realized grid prices in excess of $1,000 per megawatt hour, more than 10x what we would have made if we converted that power into Bitcoin, because we were able to deliver power when other generators could not. More recently, we have experienced grid prices below $20 per megawatt hour and even negative at times in March and has lowered plant output to realize savings versus our available cost to generate power. Weâ\u0080\u0099re not going to give first quarter guidance today on the call, but weâ\u0080\u0099re glad that the business model has the flexibility to â\u0080\u0093 if it doesnâ\u0080\u0099t make sense to sell power to convert it to Bitcoin. And I think what you would expect is, hey, there are a number of Bitcoin mining operations that got halfway done, that maybe entered into or got close to entering into power purchase agreements even in our own neighborhood, which is probably where we want to stay, to expect us to have that 25 megawatts at a site that we donâ\u0080\u0099t own, where we buy power on maybe a subcontracted basis from either another miner or from a power producer."
}