{
    "symbol": "SDIG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 21:38:04",
    "content": " Given robust power markets, we are not in a rush to fill these slots and you can expect us to be patient and opportunistic when looking to add to our mining fleet over the coming quarters, as we expect to build to being a low-cost Bitcoin miner with scale. Revenue for the second quarter was $29.2 million, a 2% sequential increase despite the material decrease in Bitcoin pricing in the second quarter, with the increase being driven by our increased Bitcoin production and relative stability in our Power business. We strategically scheduled the outage during the second half of September, which should have lower power prices compared to peak summer or winter, which allows us to still import power to mine Bitcoin as long as Bitcoin margins remain higher than import costs. But when you're selling power at a Bitcoin equivalent price of $100,000 to $250,000 during peak days in the summertime you just -- you don't focus as much on this and you focus on margins. And so I think really it's a -- by our math, this is a value capture transaction in addition to a liquidity and optionality enhancing one regard -- \n And then I would focus you on 2024 when we go into April 2024 and the having in the Biglin markets, obviously, history would suggest that there's a positive Bitcoin price response to offset the step function lower and capital efficiency for miners. The opportunity cost is almost nothing because the power markets are so strong that, if we don't buy â\u0080\u0093 if you don't replace these 26,000 slots in the next six months, you're not going to see a big difference in revenue. We had fantastic Bitcoin mining margins, where we're making equivalents like $250 per megawatt, and power prices were in the high 20s, low 30s. I think that was like the best part in my view of the whole Stronghold story, because you've given what's going on in the world today, where you've got high natural gas prices, you're not really align directly on natural gas."
}