{
    "symbol": "SDIG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 21:44:21",
    "content": " While hosting is not our core focus, we strive to be opportunistic and creative and we think this deal is highly beneficial for Stronghold, in addition to a $60 per megawatt hosting fee, we will receive half of all the Bitcoin mining profit and still have the option to curtail the miners to sell power to the grid without penalty. Looking ahead into Q1 2023, we expect our net cost of power to be $45 to $50 per megawatt hour, which we anticipate will provide for healthy margins for both Bitcoin mining and grid power sales. Revenue for the third quarter was $24.7 million, a 311% increase compared to $6 million in the same year ago quarter, but down sequentially due to lower power generation from the planned downtime and a lower overall hash rate associated with the returning of a portion of our mining fleet. On the bitcoin mining side, we assume an average hash rate capacity of three exahash for 2023 and an average effective hash rate of 2.4 exahash, which reflects the fact that we expect to curtail miners at times of higher power prices to optimize our profitability and cash flow. So power -- sorry, mining economics are worse than that $50 per megawatt hour hosting fee, then the miners will be curtailed regardless of grid prices. One moment for our next question, please. I think we feel pretty strongly about the arrival for a quarterly average in 1Q 2023 of that, at least that kind of $46 to $52 a megawatt, we pretty extensively described the activities of the team, the teams at the plants and the management team over the last six weeks, we have spent a tremendous amount of time at the plants working on improved processes, purchasing efficiencies. Obviously, when you have two weeks in September where there are zero revenues, and we're importing power to run the data centers and you have $5 million or $6 million of costs that dollar per megawatt is infinite. I wanted to ask -- I don't want to nitpick, but is obviously a bad day, but your guidance has really some great detail on hash rate -- hash price and bitcoin price and slide eight, we're below $0.06 right now. One moment for our next question, please."
}