{
    "symbol": "OPRA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 10:38:12",
    "content": "  Operator: Welcome to the Opera Limited First Quarter, 2022, Earnings Call. I would now like to turn the call over to your speaker today, Matt Wolfson, Head of Investor Relations. Before I hand over the call to Song Lin, I would like to remind everyone that in the conference call today, the company will be making statements about its future results and expectations which constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act. Such statements are based on current expectations and how we perceive the current economic environment and are inherently subject to economic, competitive, and other uncertainties and contingencies beyond the control of management. With that, let me turn the conference call over to co-CEO Song Lin, who will cover our operational highlights and strategy and then Frode who will discuss our financials and expectations going forward. We're excited to report another strong quarter that come in above expectations both in terms of revenue and adjusted EBITDA with the momentum and scale we have achieved here in 2021, continuing to pay off. Our revenue has gross of 39% what supported by a 20% growth in such revenue largely these deal by strengths in Western markets, and the acceleration of advertising revenue rose to 64% year over year, now, representing 54% of total revenue. We continue our strategy, all focusing on users in high upper markets and those users which we believe are mostly engaged, providing us with ample monetization opportunities. As a result of the strategy, ARPU grow 54% year over year on an annualized basis, which greatly offset the  reduction in our overall user base, as we selectively run our marketing initiatives. Our user base in the U.S., the rest of the Americas, and in Europe continued the growth trajectory from 2021 while key products like GX and Opera News have been very successful. We are able to generate an immediate and meaningful incremental revenue on newer products, while benefiting from the underlying growth of online services in emerging markets. So in this context, I'm confident that Opera's core product offering will have increasing strategic value. While we can't see the future, one thing we are certain of is that our digital future will be defined by increasing user personalization. Whether that's in different communications, , gaming, news, or privacy and security, or perhaps a history of objective success in building the browser of choice for people who actively chose GX browsers. Not long ago, we launched our GX browser specifically designed for gamers. As of this call, we have over two million mobile and 14 million PC users. And beyond the GX browser, our game-maker studio now have over 500,000 developers and the GX games has over one million monthly active users. And well, Opera GX is more than three times the output for Opera as a whole, its revenue mix contains only a fraction of advertising relative to such when compared to our other browsers. Later this year, we will begin to introduce tailored advertising in GX as well as other economic models to install both game developers and game  While we are cautious on the near-term financial impact, we're extended to ramp over the course of the year. This is a common threat amongst all of our products, we identify a use case with clear value, we launch and scale it, and then we tap into those existing and new monetization structures. As we look ahead, there are clear applications for our modal also as it is relating to multiple aspects of Web 3.0 trends. In terms of vertical focus, the domains based on the same core technology for the board remains the most popular but over the past 12 months, we have also introduced other verticals such as cricket and basketball as well as generic news and sports sites. So in total, these services have more than 10 million users. We're  that same AI-driven news engine to begin aggregating news related to gaming or GX browser as well as our plans to introduce a section for relevant content in our Web 3.0 browser as the landscape show up for news, market data and trend analysis. These are examples of the constant improvements range to ensure that our users have the best disruptions in addition to enhanced social features, integrity at postnatal spray dolls. Non-native inventory, combined with increasing audiences way our building higher value markets. So all you all way in kind of length or cost on our core businesses, given the opportunities, we see ahead. Since the last talk, during our fourth quarter results, we have also sold our equity stakes in both Nanobank and . The decision to monetize those financial investments was a desire to remain laser-focused, our core business and the opportunity we are seeing in front of us. I will say though, through the well-detailed results that the resulting cash payments to Opera over the next two years will offer our us significant operational flexibility. Again, our products and initiatives continue to show great momentum, and we think that the browser has never been more relevant than it is today. And of course, it was particularly strong in light of the headwinds associated with the war in Ukraine and how that in turn affects regional monetization and has strengthened the U.S. dollar relative to other currencies in which we ultimately generate most of our revenue. Operational expenses came in largely according to expectations resulting in adjusted EBITDA of $7.3 million, also exceeding the top of our guidance range. Recently, you have seen us divest our former ownership stakes in both Nanobank and StarMaker, allowing us to realize about 70 million of value creation or over a 110 million in the aggregate when including our partial sale in  last year. A common question I received as what we intend to do with the cash ahead of collecting any proceeds from the sales of Nanobank in Star maker, our cash and marketable securities already stands at $182 million taking together with the $215 million we will collect them the sales. This adds up to nearly $400 million, which has indeed a significant amount relative to our current market cap. In addition, we still hold a fixed 0.44% ownership stake in hold pay and in line with our decision to focus our attention on our core business, these shares are also classified as held for sale. For now, we have a $50 million buyback program in place of which we've utilized $3 million by repurchasing 569,000 shares in Q1. The dominating value-creation potential of Opera is in our core business, and the opportunities we can see from our very strategic position. In terms of quarterly operating cash flow, we generated $13.5 million, which essentially represented our adjusted EBITDA combined with a slight reduction in our working capital. We are maintaining our full-year revenue guidance of $300 million to $310 million, a 22% increase at the midpoint. We continue to expect adjusted EBITDA to be between $50 million to $60 million, representing an 18% margin at the midpoints, and an increase of 90% compared to 2021. We expect the quarterly headwinds from Russia invasion of Ukraine to approximately double from the $2 million in the first quarter, and represents around $12 million in headwind for the remainder of the year, bringing the total impact to about $14 million or just below 5% of the midpoints of our guidance. However, the strong underlying performance in our core business is expected to offset those effects, and we consider this a very healthy indication also when looking beyond the current year. For the second quarter, we expect revenue of $71 million to $74 million, representing 21% year-over-year growth at the midpoints. Cash compensation is expected to increase about 15%, following team growth and salary adjustments. As a result, we expect $8 million to $12 million of adjusted EBITDA in Q2. There was a lot to cover today, but I hope you found this call to be useful in conjunction with our release, and we're now happy to move to questions. But on the one hand, I just want to try to understand how this is playing out on the one hand, we have presumably displaced Ukrainians on the other hand, we have Russian population that is presumably economically bankrupt due to global sanctions. In the first quarter, as I mentioned, that was essentially a foreign currency translation just from the strengthening of the U.S. dollar. And as best as we can estimate, looking at the remainder of the year, the FX impact and let's say the underlying business impact, it will be about the same size. So I mentioned about $12 million for the remainder of the year, about 1/2 and 1/2 FX versus business impact. We've spent a lot of time thinking about it, obviously, it's very close to our home in terms of being in the region Polish, Swedish, European footprint but -- so it became what's the right thing to do kind of position and limiting information both availability seems like the wrong step to take. So correct as you say, there was an opening expectation of representing around 10% of our revenue this year. Probably with a 25% to 30% margin on that, because we do, of course also invest in our user base across both European and Eastern European markets. So, there's costs associated with the 2 but as of now, we don't see the scenario going to zero unfold. The divestitures of Nanobank and StarMaker and the partial monetization of OPay, you've obviously gone a long way towards streamlining the business, streamlining the story and obviously you talked about how you're classifying the remaining OPay stake, it's held for sale. To begin with the latter, I think it's about $84, $85 million that we have on our books from OPay. In terms of timeline when we classify something as held for sale, the implicit expectation is within 12 months. I was actually going to be my question, but if I start with a $600 million market recap. If I even just if I use the PV of the steak right, as opposed to the sales rather that you saw. As far we're trading at like point 3, 4 point 3%, 4% revenue and we are like 1.5 times adjusted EBITDA of 2022, something like that, 1.6 or 1.7 maybe. I mean, at the rate you're going, your EBITDA margin is going to be higher than your revenue multiple. So you have the model, and then you have the core browser business, and then you'd leverage that in other technology areas. It could be investing  or maybe doing something more substantial and buying larger, more established businesses. I think the investments that we had that we  and Opera we have left, we are proud of them because like you mentioned, to a great deal, we were able to create that value for Opera by participating in these companies, co-founding, etc. Of course, we focus mostly on what we do internally with Opera News and our gaming initiatives but these were some specific opportunities we had in earlier years that have done well for us. I think when we look ahead, we are definitely more focused on what we can create internally and as part of Opera and I don't see the same situations of participating in the launch of separate companies. We've been locked, and I know it’s been a difficult environment for you guys, just given your exposure to  actually going forward. First of all, I think you mentioned about impact from Russia came in, also we reiterate the guidance and all that. But I'm just wondering, has there been any impact on other advertisers  especially the advertisers that are based in Europe soon, like the region. And then second question I also wanted to follow up on the use of the cash, with the incoming cash that you have received or will receive. So it's Song Lin and I'll also try to answer a bit, so I guess for your first question all advertiser sentiments, I guess is what we see is that -- I think in general we feel the advertisers in Europe are still quite strong. The only impact is more towards maybe the exchange rates that of course, with the Europe actually being a bit weaker compared with U.S.. And then if you mail that U.S. of course, that's more the impact which we are talking about. But yes, high level, we feel that do what we can see, it's still going strong and that's what indication of why we have keeps to go, the strong and exceeding guidance. All those that we have to keep a closer look to see how that changes and be saying, yeah, you're either reduce, so that will ever general high level over the Beijing. Way -- like other than that, I think it's fair to say, this will give us more flexibility to be able to invest into a more strategy stuff that the we are focusing on online game or gaming for instance. I understand, especially at this moment, you may not have -- identified a specific target, but I guess I'm just wondering maybe you can help us from a little bit what you're thinking about the strategy or what -- if you look at your business, after kind of, like, adjusting all these kind of -- the non-core and then focusing on the search and the advertising, as we look into the next few years, what are things that you feel your business needs to be further strengthened, right? So I'm quite certain that they will continue to deliver and expand on the gaming sector both in terms of growing, our continues to grow our GX user base, but also in growing our gaming platform. And also, I'll give you a  and if along the way we have to work with more gaming partners or getting company as those studios and provide better economies way will do it. So, I think we're actually quite proud and also confident that we're able to make a difference. That like yes, I think you will see probably more announcements product wise,  so they don't have this year. So, there's a huge potential than we will also invest our  vessels into it, in end of the day where our tech company, we have very good in tech, not really other. So, I think hopefully, we should be able to also create some of those similar, very attractive, customized products, which will be appealing to the end-users. And because to us it's -- yeah, it's very important we have to win by our technology, and as the rest, of course, if there's some good candidate. Like the case when we buy it -- when we bought -- when we have bought game maker engines, that of course, if there will be a company, you'd -- probably we should buy. We should do it, but that's not the focus, I guess. As always, I think we were able to demonstrate that our core browser is good business to get always all content and the gaming initiatives that integrates and ways -- even more numerous growths and  still to come. And now I think we were able to also demonstrate we have strong cash balance and also good visibility now about those cash payments from our divestitures, which will give us much more visibility about our access trends at a company."
}