{
    "symbol": "NVDA",
    "quarter": 2,
    "year": 2023,
    "date": "2022-08-24 21:22:07",
    "content": " At this time, I would like to welcome everyone to NVIDIAâ\u0080\u0099s Second Quarter Earnings Call. After the speakersâ\u0080\u0099 remarks, there will be question-and-answer session. With me today from NVIDIA are Jensen Huang, President and Chief Executive Officer; and Colette Kress, Executive Vice President and Chief Financial Officer. During this call, we may make forward-looking statements based on current expectations. These are subject to a number of significant risks and uncertainties, and our actual results may differ materially. For a discussion of factors that could affect our future financial results and business, please refer to the disclosure in todayâ\u0080\u0099s earnings release. All our statements are made as of today, August 24, 2022, based on information currently available to us. During this call, we will discuss non-GAAP financial measures. You can find a reconciliation of these non-GAAP financial measures to GAAP financial measures in our CFO commentary, which is posted on our website. With that, let me turn the call over to Colette. Total revenue of $6.7 billion was down 19% sequentially and up 3% year-on-year, below the $8.1 billion outlook we provided on our last earnings call. As we indicated in our pre-announcement press release on August 8, we experienced a shortfall to our expectations driven primarily by weaker Gaming revenue. Today, we will share with you more details on our Q2 results and Q3 outlook. Revenue of $2.04 billion was down 44% sequentially and down 33% year-on-year, reflecting challenging market conditions. As discussed in May, we expected a sequential decline in Gaming revenue due to softness in Europe related to the war in Ukraine and COVID lockdowns in China. The decline in Gaming GPU revenue was sharper than anticipated, driven by both lower units and lower ASPs. As noted last quarter, we had expected cryptocurrency mining to make a diminishing contribution to gaming demand. While Gaming navigates significant short-term macroeconomic challenges, we believe the long-term fundamentals in Gaming remain strong. NVIDIAâ\u0080\u0099s GeForce GPUs are the most coveted brand by gamers, representing 15 of the top 15 most popular GPUs on Steam. Estimated GeForce sell-through is up over 70% since before the pandemic, and peak concurrent users on Steam are also up more than 70% over the same time period. This quarter, we added 80 more titles, including the hugely popular Genshin Impact, bringing our total to over 1,350. A sequential increase in mobile revenue was more than offset by lower desktop revenue, particularly at the high end. As macroeconomic headwinds intensified, enterprise demand slowed and OEMs worked to reduce inventory. While ProViz is undergoing a near-term adjustment after doubling last year, we believe we have expanded the market opportunity over the last couple of years with AI and Omniverse workloads. We believe hybrid work is here to stay, and with it, the need for collaborative 3D design enabled by professional graphic workstations, both at home and in the office as well as in the cloud. In June, we announced a partnership with Siemens to enable the industrial levers and AI-powered digital twins, connecting Siemens Xcelerator platform to NVIDIA Omniverse. Earlier this month at SIGGRAPH, the premier computer graphics conference, we announced advancements to several foundational technologies of the metaverse, defined as the 3D version of the Internet. First, NVIDIA Omniverse Avatar Cloud Engine will enable businesses to create and deploy assistants and avatars, transforming interactions across a range of industries. We also unveiled 11 new Omniverse connectors, bringing the total number of connectors to the Omniverse USD ecosystem to 112. And finally, we released SDKs for the new field of neural graphics, which intertwine AI and graphics to help automate the creation of virtual world. Strong growth was driven by auto AI solutions, which include AI cockpit and self-driving revenue, with particular strength in self-driving as new energy vehicle design wins ramp into volume. During the quarter, we announced rollout plans of new vehicles from OEM partners, NIO, Li Auto, JIDU and Human Horizons as well as Pony.aiâ\u0080\u0099s line of self-driving trucks and robotaxis, all built on NVIDIA DRIVE. Looking forward, we expect our $11 billion automotive design win pipeline to translate to continued growth. Although a record, this was somewhat short of our expectations as we were impacted by supply chain disruptions. Sequentially, sales to North America hyperscale and cloud computing customers increased but were more than offset by lower sales to China hyperscale customers affected by domestic economic conditions. Vertical industries grew both, sequentially and year-on-year. Key workloads driving growth include natural language processing, recommender systems, autonomous vehicle fleet, data processing and training and cloud graphics. Its ability to deploy a higher-quality model at high throughput and low latency resulted in a 16% increase in engagement, a critical metric for the company, which has over 400 million users and 300 billion images. And Tesla recently upgraded its supercomputer to use over 7,000 A100 GPUs for autopilot training. From a product perspective, networking led growth this quarter with strong demand from our high-speed Ethernet adapters and design win momentum toward next-generation adopters, including the ConnectX-6 and ConnectX-7. Additionally, we are ramping into the upcoming launches of our next generation platforms. Top computer makers, including Dell, HPE, Inspur, Lenovo and Supermicro are adopting the new NVIDIA Grace CPU Superchip and Grace Hopper Superchip to build the next generation of supers. 72% of the systems on the latest top 500 list of the worldâ\u0080\u0099s fastest supercomputers are powered by NVIDIA, including 31 of 39 new systems. Moreover, 22 of the top 30 systems on the Green 500 list of the most energy-efficient supercomputers are powered by NVIDIA. In the past two years, our A100-based platform has delivered 6x more performance as measured by the MLPerf industry benchmark, largely through new software technologies and optimizations. Last month, we announced an update to the NeMo Megatron framework that can speed up the training of large language models by up to 30%, improving a multi-hundred million dollar AI infrastructure by 30% translates to significant value for customers. LLM are one of the most important neural networks today, ranging in size from tens of billions to over 1 trillion parameters. Learning from text, they can be used for real-time content generation, tech summarization, customer service chat box and question answering for conversational AI interfaces. Currently, these capabilities are available to early access customers to run on NVIDIA DGX SuperPOD and NVIDIA DGX Foundry as well as in Microsoft Azure cloud with other platforms available soon. We are working with the industry leaders in large language models, a very active and exciting space of AI. GAAP gross margin was 43.5%, and non-GAAP gross margin was 45.9%. These increases were driven primarily by employee growth costs, as well as increases in salaries to support our employees during this high inflationary environment, and engineering development of new products coming to market. We have slowed operating expense growth, balancing investments for long-term revenue growth while managing near-term profitability. During the first half of fiscal 2023, we returned $5.5 billion to shareholders in the form of share repurchases and cash dividends. GAAP and non-GAAP gross margins are expected to be 62.4% and 65%, respectively, plus or minus 50 basis points. GAAP and non-GAAP other income and expenses are expected to be an expense of approximately $10 million, excluding gains and losses on nonaffiliated investments. GAAP and non-GAAP tax rates are expected to be 9.5%, plus or minus 1%, excluding any discrete items. In closing, let me highlight upcoming events for the financial community. Our earnings call to discuss the results of our third quarter of fiscal 2023 is scheduled for Wednesday, November 16th. Obviously, this is a challenge to you as well. Well, let me start first there and see if I can assist in terms of how to think about after we get through our completion just now of Q2 and what we have provided here for guidance for Q3. Across those two quarters, the Q2 of â\u0080\u009823, the Q3 of â\u0080\u009823, we have likely undershipped gaming to our end demand significantly. Now, on top of this, keep in mind that we do have gaming growth drivers to consider for the future. Now, regarding any further types of write-downs on this perspective, we did a thorough assessment with this quarter, not only just looking at what we needed for this quarter, but what we need for the long term. Keep in mind, our inventory provisions and write-downs that we took into account had to reflect some of the purchasing that we did a supply back more than a year ago when we were still in extreme supply shortages in almost all of our products. And so, this was an opportunity for us to resize given the macroeconomic conditions, what we needed in terms of supply. So, our expectations were higher, and we took this opportunity to write them down to what our current expectations are. C.J., our sell-through is off the highs in the beginning of the year, but itâ\u0080\u0099s still very solid. In fact, sell-through is -- has increased 70% since pre-COVID, pre-pandemic. And so, itâ\u0080\u0099s very clear that gaming is -- the fundamentals of gaming are strong, and this medium is really doing well. Not to mention the gaming platforms are being used -- our gaming PCs are being used for influencers, people sharing content, creating content, V bloggers, VTuber, thereâ\u0080\u0099s all kinds of new ways of engaging and spending time with video games. Our strategy is to reduce the sell-in -- reduce the sell-in this quarter, next quarter to let channel inventory correct. Obviously, weâ\u0080\u0099re off the highs, and the macro condition turned sharply worse. And so, our first strategy is to reduce sell-in in the next couple of quarters to correct channel inventory. And it remains the best GPUs in the world, and it will be very successful for some time. However, we do have exciting new next-generation coming and itâ\u0080\u0099s going to be layered on top of that. And so, weâ\u0080\u0099ve taken -- weâ\u0080\u0099ve done two things. Actually, I just wanted to clarify, Jensen. And then, my question is actually similar on the data center. Sales are pretty strong right now, but there is a concern that data center CapEx could be the next shoe to drop in this rolling correction in semiconductors. The sell-through -- the sell-through, as I mentioned earlier, of GeForce is solid. Itâ\u0080\u0099s off the highs, which was really high recently in the beginning of the year. And so, we have -- and because we were building for such a vibrant market, we found ourselves with excess inventory. And so, our strategy is to sell well below -- sell in well below the current sell-through levels in the marketplace to give the channel an opportunity to correct. We believe that by the end of the year, weâ\u0080\u0099ll be in a good shape going into next year. And so, I hope that answers your question. But, the important thing is our sell-in rate is far below what is happening in the market for sell-throughs. The sell-through is solid, has increased 70% since pre-COVID. And so, the gaming market is really quite vibrant. On the second question, on data center end markets, we hear fairly broadly that GPU supply is in shortage in the cloud. And itâ\u0080\u0099s fairly sensible to us, partly because the number of use cases for GPUs in the cloud has grown quite a bit. If you look at one particular segment in just managing -- collecting data and managing the data of the AV fleet and using that data to train AI models, using that data to reconstruct HD maps, the usage of GPUs in the cloud for just that one application has grown a lot. And furthermore, thereâ\u0080\u0099s the deep learning-based recommender systems has demonstrated such significant effectiveness. And it helps internet service providers to enhance engagement, enhance click-through rate. And then, of course, over the last several years, a very important model has emerged called transformers. And itâ\u0080\u0099s been found that this transformer model, this large language -- this language model, which when scaled up in size, exhibits really spectacular and effective capabilities for -- to be used to learn skills with either few shots or almost no shot, meaning it could learn skills, it could perform skills that it has never learned because the knowledge was somehow encoded from the large amount of data that it had learned from. And so, this large language model area of innovation is used in, of course, conversational chat, Q&A summarization, text generation, image generation. But very importantly, itâ\u0080\u0099s being used in life sciences for understanding chemistry. Weâ\u0080\u0099ve done some very important work in this area ourselves called MegaMolBART, understanding proteins, understanding DNA to learn the language of these large -- very, very large, spatially as well as temporally or sequentially types of data. And so, the impact of this area is really quite worth staying close to. And so, weâ\u0080\u0099re seeing a great deal of demand for GPUs in the cloud. We were challenged this quarter with a fair amount of supply chain challenges because as you know, we donâ\u0080\u0099t just sell the GPU chip, but these systems are really complex with a large number of chips in the system components that we offer like HGX. And then furthermore, these data centers sit idle until the last piece comes together. And on top of that, weâ\u0080\u0099re ramping into Hopper, which is really a fantastic generation. I guess, Colette, the first angle being, in the release, you guys talked about pulling high $200 million of revenue into the July quarter from October, but also with supply chain challenges, maybe some deliveries that were meant for July got pushed back into October. And Jensen, the second part, the moving pieces, networking stronger in data center, U.S. hyperscale stronger, China hyperscale weaker. Thanks for the question. Our supply chain during the quarter really was quite difficult, was quite challenging to work through. Our platforms, including HDX, networking chips, cables, switches, were very important to the customers. So even though customers orders components themselves, theyâ\u0080\u0099re looking from us what we may refer to as kits, kits that go with those GPUs for them to stand up their data centers. Customers were impacted as well by availability of key third-party other components that we werenâ\u0080\u0099t offering, which were slowing down some of their deployments. So what we did in our Q2 orders that couldnâ\u0080\u0099t be delivered in Q3, given that some of these supply constraints existed, and we had Q3 demand where we did have supply in Q2. So we worked with customers to optimize that supply and demand, and thatâ\u0080\u0099s what weâ\u0080\u0099ve disclosed to you. The Chinese hyperscalers and the Chinese Internet companies really, really slowed down infrastructure investment this year, particularly starting in -- theyâ\u0080\u0099ve been rather slow in building out and really accelerate -- well really slowed down in Q2. And the number of new technologies in software, the number of people who are using clouds and the number of cloud services is continuing to grow. Theyâ\u0080\u0099re a very important market for us, a very large market for us. And the fact that North American hyperscalers doubled year-over-year our revenues at North American hyperscalers, and that was offset by declines in China said something about the slowdown in China. With respect to Hopper, weâ\u0080\u0099re in full production now. And weâ\u0080\u0099re racing to get Hopper 2, all of the CSPs are dying to get them. And it goes with our HGX, which is multiple Hoppers on a system tray, itâ\u0080\u0099s really a supercomputer in a motherboard, if you will. I had a question regarding the $1.22 billion inventory charge, maybe for Colette, on this one specifically. In the CFO commentary, I think you stated that the inventory charge is related to weaker demand in both data center and gaming. Thanks for the question. So our inventory charges, as we commented, weâ\u0080\u0099re taking a thorough look of not only this last quarter as well as the quarter that weâ\u0080\u0099re guiding, but looking over the long term of what we need for demand and then what we had in terms of supply. Remember, we had purchased this very early on in the year as we needed to, to drive the commitment of the supply that we already have. And so what is happening here for the data center, we had great, high expectations. We still have very strong, solid growth projection for data center as well. We have written down some silicon and chips as the macroeconomic conditions and you get ready for our future product launches take into account, but thereâ\u0080\u0099s also components, services and capacity in some of the other drivers that are incorporated in those write-downs. But I guess, next-generation GPUs, CPUs, Sapphire Rapids and Genoa after that as well as Graviton. And they intend to deploy NVIDIA accelerators, NVIDIA Hoppers across a large number of CPUs. However, Hopper goes into an environment with CSPs where they connect our PCI Express connectors to old generation, current generation CPUs as well. However, weâ\u0080\u0099re going to be able to go to market plentifying with Hopper supporting existing infrastructure. And a lot of itâ\u0080\u0099s kind of been talked a little bit about, but I just -- Colette, I want to think about the numbers a little bit more. I guess, based on the guidance commentary, where Iâ\u0080\u0099ve come up thinking about would be like a 30-plus percent sequential decline in gaming and Professional Visualization and maybe kind of low to mid-single-digit growth in Data Center and Auto. And with that and with Hopper coming down the pipeline, weâ\u0080\u0099re going to have a lot of questions around kind of the deceleration of year-over-year growth in Data Center, I believe. Thanks for the question. And we do expect, yes, gaming to decrease, not in the dollar amount that it decreased between Q1 and Q2. So that may be of our 2 areas of the decline, our gaming and ProViz, that may be about 3/4 of it associated with that gaming. Our Data Center yes, we do expect it to grow. And automotive, very similar to our thoughts at the very beginning of the quarter, we are expecting continued growth through each of the quarters of this fiscal year. Iâ\u0080\u0099ll turn it over to Jensen to see his thoughts in terms of Hopper, what Hopper brings to us in Q4 and expectations. The first thing Iâ\u0080\u0099d say, Aaron, is that we are selling in or weâ\u0080\u0099re selling far below the market demand, far -- excuse me, far below the market sell-through. And the reason for that is to allow the inventory the channel inventory, the OEM inventories to correct. And our next generation has Hopper for compute, but we also have the next generation for computer graphics that will be coming to market. It has an engine inside it called Transformer engine with numerical formats and pipelines that allows us to do a spectacular job on Transformer-type of models, which includes large language models, but it also includes computer vision models that are now able to be processed with this new type of AI model called Transformers. And -- and the importance of this new model, Transformer, canâ\u0080\u0099t possibly be understated and canâ\u0080\u0099t be overstated. This is the impact of this model across robotics, computer vision, languages, biology, chemistry, drug design is just really quite spectacular. And Iâ\u0080\u0099m sure that youâ\u0080\u0099ve been hearing about this new breakthrough in AI, and Hopper was designed for this. So within our Q2 results, we have been continuing to improve our supply for networking. We have a lot of important products that the CSP needs, many of our customersâ\u0080\u0099 needs, and we have been working to really improve that supply. And we were able to set very strong growth in terms of networking, both sequentially and year-over-year. And as we move into the next quarter, weâ\u0080\u0099re going to have to see which is going to be growth larger. But as weâ\u0080\u0099ve discussed, sometimes itâ\u0080\u0099s important that they have many of our other components that we provide in networking at the same time that we are providing the GPUs. So itâ\u0080\u0099s not always supply constrained, but there are certain parts of it that are. And it seems like now itâ\u0080\u0099s kind of hitting you fairly hard at a time when, in other cases, itâ\u0080\u0099s kind of easing. We were pleased in terms of reaching the leverage of networking that we did, but we did have some challenges this quarter. And then to follow up on that, it did sound like to me that it was mostly Ampere and not Hopper change in expectations. Regarding our inventory charges that we had, when you think about what we have in supply, whether it be chips, components, whether it be memory. Remember, a lot of these things can be used interchangeably across the 2. Additionally, the value of our inventory for data center is much different than the value of what we have for gaming from an overall cost perspective. So weâ\u0080\u0099re creating capacity opportunity, putting together all of those systems in terms of data center. Absolutely, this is not a question regarding anything of our future products coming to market. So we took this as looking at the macroeconomic conditions, as weâ\u0080\u0099ve discussed. Our expectations, our plans were higher. Theyâ\u0080\u0099re still quite solid that we see in demand both for gaming as well as solid for data center, and that will continue. Large language models, excitement, innovation, ideas, companies, start-ups, industries, all exceeding everyoneâ\u0080\u0099s expectations. Thereâ\u0080\u0099s a fair amount of literature now written about language models that were smallish in the old days, in the beginning several years ago, 3 years ago. And the ones that are in the hundreds of billions and moving towards probably several trillion parameters, the effectiveness of the AI is really quite spectacular. And to have AI that was never trained on a particular skill and yet within 1 shot or 1 shot of trying or even no shots, are able to perform that skill is beyond anybodyâ\u0080\u0099s expectations, I would think. If thatâ\u0080\u0099s an indicator, I think Hopper is going to be a spectacular success. I have a question on gross margins, Colette. And then just to expand on that, your mix is probably a tailwind to gross margins given that gaming is down significantly and data center is up a little bit. Thanks for the question. Auto is below our company average, and so that will tend to offset some of those upper bound things that we will see in terms of data center. From time to time, thereâ\u0080\u0099s always a small amount of scraps that we will have in our gross margin estimates. Colette, I had a clarification and then a question. No, there is nothing in our Q3 regarding those inventory provisions that we took in terms of earning that back, in terms of our Q3. They always tend to be about the same, 50% for one, 50% for the others. And so that did influence in terms of the hyperscales, but still we are approximately in that 50%, 50%. Granted, itâ\u0080\u0099s a somewhat narrow vertical market, but it does sort of play into the market concerns that consumer is weak now, enterprise is the next shoe to drop. So our Pro Visualization business, just in such a short time, they were in short supply and really trying to feed so much of the industryâ\u0080\u0099s desire to both refresh and attracted to the new RTX workstations that were there. Remember, all of last year, doubled the size of ProViz in 1 year. So right now, the OEMs are concentrating on their levels of inventory. But it -- keep in mind, very similar to our discussion on gaming, there is still solid demand. We just have to correct some of the inventory, but we still see both the opportunities that weâ\u0080\u0099ve created for the market for these to be long-standing. I would say, first of all, we donâ\u0080\u0099t know. Second of all, unlike like our Workstation business, our ProViz business, thereâ\u0080\u0099s no installed base. And so in the case of ProViz, the companies that are buying are ProViz, our ProViz systems likely already have systems that theyâ\u0080\u0099ve been using. And so if they were to tighten up ProViz for whatever reason, the people could continue to use what they have. In the case of our AI business, thereâ\u0080\u0099s no real installed base. But what Colette said earlier is about our ProViz businesses last quarter is absolutely true, which is OEMs realizing that the end market is slowing and taking the opportunity to correct their inventory. But generally, your mix was quite rich over the last year or 2. Is that $2.5 billion per quarter sell-through rate comes, is the ASP mix across your stack about the same? I would say that without crypto dynamic, the mix would go down. However, the overall trend long term, the ASP is drifting up. And the way to think about that is a game console, when -- my first game console was $99. Lately, game consoles are selling for about $599. You use your gaming console for your greatest form of entertainment, and you use it for a very, very long time. And because GeForce in the cloud is hosting many gamers simultaneously, it tends to want to be a much more powerful GeForce. And so -- and then, of course, thereâ\u0080\u0099s the design aspect of it. And they use their PC to create content, and much of that content goes into video games and/or theyâ\u0080\u0099re using video games to create their artistic content. And so there are several dynamics that are causing the ASP of GeForce to go up, and weâ\u0080\u0099ve been seeing this trend for several years now. In Gaming, our partners and ecosystem are responding to a sudden slowdown in consumer demand and correcting channel inventory. Still, the fundamentals of gaming are strong. In Data Center, AI where computers are helping us write software that was impossible before is driving a computing revolution and transforming every industry. NVIDIAâ\u0080\u0099s leadership in full stack data center scale, accelerated computing has made us the ideal partner for companies racing to leverage the power of AI. Even with the current macroeconomic headwinds, demand for our data center products have never been stronger. With AI and 3D graphics advances, developers will extend the Internet with virtual world overlays that connect to the physical world. The immediate applications for Omniverse span product design, manufacturing and operations. Our automotive revenue is inflecting, and we expect it to be our next $1 billion business. Autonomous driving is one of the biggest challenges AI can solve, and computing opportunity for us spans the data center to the car. Weâ\u0080\u0099re building NVIDIA AI and NVIDIA Omniverse to be the engines for the worldâ\u0080\u0099s enterprise to become software-defined, AI-powered technology companies. I look forward to next monthâ\u0080\u0099s GTC conference, where we will share new advances of RTX reinventing 3D graphics and gaming. AIâ\u0080\u0099s continuing breakthroughs and building the metaverse, the next evolution of the internet."
}