{
    "symbol": "INFA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-31 09:56:05",
    "content": " IDMC is delivering mission-critical solutions that serve an ever-increasing base of global customers and operates at a significant scale, processing 38.5 trillion cloud transactions per month as of June 2022, which is an increase of 77% year-over-year and approximately 20% sequentially. Informatica World featured marquee customer -- marquee speaker participation from all of our strategic ecosystem partners, including Thomas Kurian, CEO of Google Cloud; Scott Guthrie, EVP, Cloud + AI Group from Azure; Andy Mendelsohn, EVP at Oracle; Matt Garman, SVP, Sales and Marketing from AWS; Christian Kleinerman, SVP, Products at Snowflake; and Adam Conway, SVP, Products at Databricks. Additionally, customers spending more than $100,000 in subscription ARR increased 20% year-over-year to 1,791 customers. HDFC Bank, the largest private sector bank by assets and the world's 10th largest bank by market cap, chose Informatica's MDM Customer 360 and Data Quality to be deployed into HDFC's Azure cloud to create a trusted 360-degree view of their customers. Cloud ARR performance was once again strong, increasing 42% year-over-year to $373 million and exceeding the high end of guidance. This increased 31% year-over-year to $896 million, $11 million above the high end of guidance and driven by new subscription customer growth and improvements in our renewal rates, including cloud. We added $210 million in net new subscription ARR in the second quarter versus the prior year, an increase of 19% year-over-year. And our average subscription annual recurring revenue per customer in the second quarter grew to approximately $243,000, a 22% increase year-over-year on an active base of nearly 3,700 subscription customers. And lastly, maintenance ARR finished better than we expected and was only down 2% year-over-year at $541 million with strong renewal rates that were up one percentage point year-over-year. We delivered $372 million in total GAAP revenue, an increase of 9% year-over-year and $4 million above the high end of guidance due to upside from self-managed subscription revenue recognition, partially offset by foreign exchange. We remain confident in achieving approximately 40% cloud ARR growth for the full year as the mix shift from self-managed to the cloud continues, and our renewal rates are improving. We expect total ARR in the range of $1.52 billion to $1.55 billion, representing approximately 13% year-over-year growth at the midpoint of the range. We expect subscription ARR in the range of $990 million to $1.01 billion, representing approximately 25% year-over-year growth at the midpoint of the range. We expect cloud ARR in the range of $438 million to $448 million, representing approximately 40% year-over-year growth at the midpoint of the range. We expect subscription ARR in the range of $920 million to $930 million, representing approximately 26% year-over-year growth at the midpoint of the range. We expect cloud ARR in the range of $399 million to $405 million, representing approximately 40% year-over-year growth at the midpoint of the range. We expect GAAP total revenues in the range of $385 million to $395 million, representing approximately 8% year-over-year growth at the midpoint of the range. In closing, we began this year with an objective to grow cloud ARR by approximately 40% year-over-year to $442 million, achieve $1 billion in subscription ARR and $335 million of non-GAAP operating income at the midpoint of the range. So first of all, we opened 2022 with full year guidance for 40% cloud ARR growth, $1 billion in subs ARR by the end of the year, non-GAAP operating income of $335 million at the midpoint."
}