{
    "symbol": "INFA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 21:00:05",
    "content": " We started fiscal 2022 strong with both subscription annual recurring revenue and cloud annual recurring revenue exceeding the high end of the guidance with growth at 32% and 43% year-over-year, respectively. At the end of first quarter, we now have 164 customers that spend more than $1 million in subscription ARR, an increase of 50% year-over-year and 1,732 customers that spend more than $100,000 in subscription ARR, an increase of 22% year-over-year. We achieved strong financial results in Q1, exceeding the high end of guidance for subscription and cloud ARR and delivering a 19% beat on non-GAAP operating income guidance as well as upside and unlevered free cash flow. We delivered revenue as expected at the midpoint of guidance, notwithstanding the mix shift from self-managed to cloud , and our teams remain focused on executing key strategic priorities to capitalize on cloud and strategic partnership opportunities through the balance of the year. Cloud ARR performance was stronger than expected, increasing 43% year-over-year to over $343 million and exceeding the high end of guidance. Sequentially, we added $26 million in net new cloud ARR in the first quarter of 2022 versus the fourth quarter of 2021. This increased 32% year-over-year to over $849 million, above the high end of guidance and driven by new subscription customer growth and cross-sell from existing customers. We added $206 million in net new subscription ARR in the first quarter versus the prior year, and we remain on track to deliver $1 billion in subscription ARR for the full year. 55% of subscription customers are net new and our average subscription annual recurring revenue per customer in the first quarter grew to approximately $231,000, a 19% increase year-over-year on an active base of more than 3,600 subscription customers. We expected cloud growth to outpace self-managed in second half of the year but we are now seeing this dynamic play out faster in the first half of the year, and that is a good positive surprise to us because it's all added towards cloud faster than what we thought. As the mix shift from self-managed to cloud ARR continues, we remain confident in achieving approximately 40% cloud ARR growth for the full year, which corresponds to approximately $125 million of net new cloud ARR. We expect subscription ARR range of $990 million to $1.10 billion, representing approximately 25% year-over-year growth at the midpoint of the range. We expect cloud ARR in the range of $438 million to $448 million, representing approximately 40% year-over-year growth at the midpoint of the range. For Q2, we estimate the more rapid mix shift from self-managed to cloud has an impact of approximately $15 million to $20 million on Q2 GAAP revenue and non-GAAP operating income. We expect GAAP total revenues in the range of $358 million to $368 million, representing approximately 6% year-over-year growth at the midpoint of the range. We expect subscription ARR in the range of $875 million to $885 million, representing approximately 28% year-over-year growth at the midpoint of the range. We expect cloud ARR in the range of $365 million to $371 million, representing approximately 40% year-over-year growth at the midpoint of the range. First, we expect the second half of the year's GAAP revenue, non-GAAP operating income to be higher than the first half of the year as higher cloud and maintenance ARR builds revenue over the balance of the year. Second, notwithstanding the Q2 outlook for revenue and non-GAAP operating income, which reflects a higher cloud mix, our Q2 estimate for unlevered free cash flow implies the first half of the year's cash flow is about $20 million higher. And so if there's anything that we're mindful of in regards to the overall guidance, and we just want to explain a little more detail here is that and the impact that has very near term, from our perspective, it's nonrecurring because we had assumed in our internal plan that in the back half of the year, a much higher mix of new business coming from cloud versus self-managed."
}