{
    "symbol": "MS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-14 13:50:05",
    "content": " So, if we have any logistical gaps for a second or two please understand, but I think we will be just fine. Our businesses proved resilient, reflecting an important aspect of our strategy, and that is to, as we have said many times, deliver stable performance in a difficult environment while remaining well capitalized. The integrations of E*TRADE and Eaton Vance continued to expand our opportunities to reach new clients, grow assets and support the firmâ\u0080\u0099s overall stability. Net new assets in Wealth Management of over $50 billion, despite the volatility and clients tax-related withdrawals in the quarter, underscored the scale of our business and its power to attract assets. And in the face of a sharp decline of equity markets, Wealth Management delivered a strong PBT and improved margin supported by the benefits of rising rates. Investment Management benefited from its diversification and we saw continued momentum in private alternatives, parametric customized portfolios and the countercyclicality of our money market business. Finally, in Institutional Securities, our strong franchise in equity and fixed income helps materially counter what everybody knows to be limited activity across Investment Banking. First, we saw a significant movement in the investments related to deferred cash based compensation plans. While the marks on these investments are substantially offsetting compensation expense, they created significant drag on top line revenues in the quarter across the firm, particularly in Wealth Management, where the impact of revenues exceeded $500 million. Secondly, the quarter results also included the legal costs of $200 million that reflects the likely resolution of regulatory investigations by the SEC and the CFTC regarding employeesâ\u0080\u0099 use of unapproved personal devices and the firmâ\u0080\u0099s recordkeeping requirements. Our ROTCE, excluding integration expenses for the deals that we have done, was 14.3%, down 20% in Q1 and from last year. As I said at the outset, our objective to demonstrate resilience and balance in a more difficult economic cycle was achieved this quarter, helped in part by the acquisition of E*TRADE and Eaton Vance in what was otherwise a challenging environment. Finally, the Fed stress test further affirmed our differentiated business model. Our diversified business mix, as well as our strong capital position, provides us the flexibility to invest for future growth and support our robust capital return program. As such, we increased our quarterly dividend by 11% and announced a $20 billion multiyear buyback program. And by the way, todayâ\u0080\u0099s stock price, the current dividend has a yield of approximately 4%. With the buyback, we wanted more flexibility than an annual fixed commitment allows. Given the nature of our business model, itâ\u0080\u0099s especially appealing to have this additional flexibility to deploy capital at what we believe to be attractive valuations. And as always, at the end, we will take your questions. Excluding integration-related expenses, our EPS was $1.44 and our ROTCE was 14.3%. Despite the decline in global asset prices, our expanded product set in Investment Management proved supportive to that business. The firmâ\u0080\u0099s year-to-date efficiency ratio, excluding integration-related expenses, was 70%. Given the broader market uncertainty and inflationary environment, we are focused on discretionary spend while balancing continued investment initiatives and ensuring the right controls are in place to support future growth. As a management team, our priority is to diligently address what we can control given the market realities. Now to the businesses, institutional revenue of over $6 billion demonstrates the power of our balanced franchise against the difficult market backdrop. Revenues declined from the exceptionally strong prior year, while the backdrop was challenging for Investment Banking, particularly underwriting, fixed income and equities led the strength of the quarter as clients navigated volatile markets. Investment Banking revenues were $1.1 billion, down significantly from the prior year. Advisory revenues were $598 million, reflecting lower completed M&A volumes. Results were in line with global equity volumes, which fell meaningfully versus the prior year. Fixed income underwriting revenues were $326 million, also down compared to the prior year as bond issuance was muted across both investment grade and non-investment-grade companies. Equity revenues were $3 billion, reflecting the strength of our business against a volatile backdrop. Turning to ISG lending, as a reminder, over 90% of our ISG loans and commitments are either investment grade or secured. Our funded ratio on corporate loans stands at approximately 11%, in line with pre-pandemic levels and well below the first quarter 2020 peak of approximately 25%. Turning to Wealth Management, by several measures, performance was strong despite the volatile backdrop. Results were meaningfully impacted by movements in DCP, which reduced revenues by $515 million in the quarter. Excluding the impact of DCP, revenues increased 6% from the prior year to $6.3 billion, a new record. Excluding integration-related expenses, PBT was robust at $1.6 billion and the margin increased to 28.2%. The margin resilience in a turbulent market environment serves as evidence of the strength of the franchise and the benefits of our business mix, including the growth of our banking offerings. Excluding the impact of DCP, transactional revenues declined 17%. Total net new assets were $53 billion in the quarter bringing year-to-date NNA to $195 billion, representing a 6% annualized growth rate. NNA was driven by existing and new clients in the adviser-led channel, stock plan vesting events, positive net recruiting and self-directed channel inflows. Net interest income was $1.7 billion, up notably from the prior year, driven by higher rates and continued strong bank lending growth. Looking ahead to the second quarter, NII is now a more reasonable exit rate going forward. While the magnitude of rate hikes is not certain, if the forward curve is realized and our model assumptions materialize, we estimate $500 million of incremental NII to be spread over the upcoming two quarters weighted towards the fourth quarter. Turning to Investment Management, revenues were $1.4 billion. Against the challenging public market environment, our results demonstrate the benefits of our diversified product mix, particularly with strength in our portfolio solutions led by Parametric customization and private alternative funds as well as our liquidity offering. Long-term net outflows of $3.5 billion primarily reflect recurring headwinds in equity strategies that were partially offset by strong demand in alternatives and solutions, particularly in Parametric customized portfolios. We have invested in our liquidity business in the past decade, which has positioned our franchise well to benefit from the current rising rate environment. Overall, our integration with Eaton Vance continues to progress well. Turning to the balance sheet, total spot assets declined 4% from the prior quarter to $1.2 trillion. Our standardized CET1 ratio was 15.2%, up 70 basis points versus the prior quarter. While this should be earned back over time, it reduced our CET1 ratio by approximately 20 basis points in the quarter. During the second quarter, we completed our $12 billion buyback plan that we announced last year. Looking ahead, while the second half of the year remains difficult to predict, we are focused on our underlying business drivers. However, in Wealth Management, rising rates are already driving NII higher, supporting performance and net new assets remain healthy in Investment Management. However, our competitive positions remains strong and we remain close to our clients while they assess current valuations and the overall environment. Maybe start on the macro, James, itâ\u0080\u0099s a very confusing time on the macro front and there are some positives but a ton of headwinds. I think you hit on the head, the environment â\u0080\u0093 if I had to use one word to describe it, it would be complicated. They had a leadership change a few days ago, supply chain issues, China-U.S. relations, etcetera, so yes, very complicated. I think itâ\u0080\u0099s important to say though, it is not 2008 complicated. And frankly, the banking sector is much stronger than it was going into the last time we went through a major reset in â\u0080\u009807/08. Morgan Stanley is in particular, I wonâ\u0080\u0099t speak for others, but we are in specifically much better shape. We are long in the U.S. in our businesses, largely because Wealth Management is almost entirely U.S. and the U.S. is yet again sort of a great region to be in, in the world. And yes, while we might head into some form of recession â\u0080\u0093 and I, like many of others, have tried to handicap it, but we are frankly guessing at this stage, but I think itâ\u0080\u0099s unlikely to be a deep and dramatic recession at least in the U.S. It depends how COVID rolls out, and itâ\u0080\u0099s sort of reemerging a little bit in some countries. And then Europe is obviously â\u0080\u0093 is fighting the hardest right now because of the war in the Ukraine, because of the pressure on gas and gas prices and so on. So when I look at Morgan Stanley, sort of added all together, we did exactly what we wanted to do this quarter. Yes, itâ\u0080\u0099s the lowest ROE for a couple of years after, I think, 3 consecutive record years, but hey, this is the most difficult environment weâ\u0080\u0099ve been in decades. If you look at the Wealth Management margins, we did a 27% margin, including integration this quarter, 28% without it. So you add it all together, the environment, very complicated, lots of uncertainty. But frankly, for our business model, I think we fare relatively well. And evidence of that is our confidence in the future, and Iâ\u0080\u0099m sure we will talk about that in terms of capital and so on. Maybe, Sharon, some more specifics around the buyback, just thinking about how youâ\u0080\u0099re thinking about buybacks in the second half of the year. I mean your CET1 did grow quarter-over-quarter, but I think a little of that was RWA declining. So I donâ\u0080\u0099t know, can you maintain the sort of $2.7 billionish buyback per quarter going forward or anymore specifics around how long it will take to exhaust that $20 billion in buybacks you announced? Well, multiyear obviously means more than 1 year. So sort of just to put that in perspective, but I think that the most important thing about the buyback and also the capital more broadly is weâ\u0080\u0099ve been very prudent and efficient around our capital usage. When we think specifically about the buyback and the concept of a multiyear repurchase plan, right, two points: one, we did complete our old authorization. And in addition to that, the point is we provide ourselves with tremendous flexibility in an environment such as this one where there are, as James said, multiple macroeconomic factors but also a commitment to continue to return capital to those shareholders, be that both in the evidenced by the increase in the dividend. Obviously, weâ\u0080\u0099re not going to do that in 1 year, but we have enormous flexibility quarter-to-quarter now, and thatâ\u0080\u0099s really important. And with 200 basis points of capital access, we can use some of that flexibility. Listen, the stock trade â\u0080\u0093 I donâ\u0080\u0099t know what it is this morning, $72 or something, it was $109 a couple of months ago. And by the way, every time you buy a share at $72, your retiring dividend worth $3.10. So there is a sort of virtuous circle, if we bought back â\u0080\u0093 weâ\u0080\u0099re averaging about 6% of shares outstanding net, weâ\u0080\u0099re buying back plus a 4% dividend, shareholders getting great return without getting out of bed. So this is a statement of confidence of, a, our capital position; and, b, the resilience of our business model. When you look across all the big GSIBs, lots of higher â\u0080\u0093 Iâ\u0080\u0099m sorry, lots of the GSIBs, lots have higher GSIB buffers coming capital deficiency to their targets and donâ\u0080\u0099t have the access that you have. Well, itâ\u0080\u0099s â\u0080\u0093 Glenn, this is sort of the ultimate question. Weâ\u0080\u0099ve built through a decade of, frankly, hard work and discipline a great excess capital position. So weâ\u0080\u0099re using it on deals and two small ones, Solium and Mesa West, you recall, the majors, of course, E*TRADE and Eaton Vance. Last year, we doubled the dividend. And this year, we took it up another 11%. It wasnâ\u0080\u0099t so long ago, our dividend was $0.05 a quarter. Weâ\u0080\u0099re investing in the business everywhere, particularly around the workplace retirement space. Weâ\u0080\u0099ve invested in asset management and our capability, and weâ\u0080\u0099re going to be doing more of that, taking the Eaton Vance Funds internationally, expanding the Parametric program. I mean, obviously, the banking calendar has been terrible the last few months, but thatâ\u0080\u0099s not â\u0080\u0093 weâ\u0080\u0099re interested in the next 10 years, not the last few months. I just donâ\u0080\u0099t â\u0080\u0093 I think itâ\u0080\u0099s like giving shareholders a problem and saying, we donâ\u0080\u0099t know what to do with their money. So what we like to do with our money: investing in the business, check; give you a smart dividend with a 4% yield, check; and do buybacks and have flexibility around it when the stock is trading. At the beginning of the year for every x dollars we spent, weâ\u0080\u0099ve got 4 shares retired. A follow-up on Wealth Management, Sharon, thank you, you gave color on new money coming into which types of accounts and new clients. I think we continue to actually work very closely with different alternative managers as we go forward and think about â\u0080\u0093 educate FAs, educate FAs, educate their clients and use that relationship to continue to create the right products for our clients, all based on education through both channels. I think itâ\u0080\u0099s worth noting and just repeating that those fee-based assets are now 50% of our adviser-led channel and those assets, which is a big move from those somewhat 40s, low 40s that we had seen in previous years. In terms of very specifically what weâ\u0080\u0099ve seen over the course of the first half of this year in terms of different types of products, we were sitting at the end of the fourth quarter with cash levels at around 17% to 18% around the self-directed and the advice-based channel. Of course, that could be reflective of some of the equity asset values and the other asset values coming down to increase. But there is somewhat of â\u0080\u0093 there is a pause, I think, people are waiting and observing in certain end markets to deploy that cash. And I think that, thatâ\u0080\u0099s just â\u0080\u0093 you can see that in the transactional coming down a bit and/or itâ\u0080\u0099s coming down a bit, but I donâ\u0080\u0099t want to suggest that the engagement isnâ\u0080\u0099t there, because we still are at levels where our engagement as thought about by the most DART metrics and just what weâ\u0080\u0099ve seen in transactional, itâ\u0080\u0099s still higher than levels where we were from a pre pandemic basis. Deposit beta is just one piece of that conversation, the behavior and then also how we continue to build in an aggregate, be it new assets through NNA and also various types of, as you call it, cash sorting, but the movements of cash between products and that behavior of deposits. Specific to your question around the beta, as weâ\u0080\u0099ve said, we are informed by the last rate hike cycle, and it does have to do with the weighted beta at 50, which I had noted last quarter, and we will just reiterate again this quarter. And that helps to explain the deposit beta, which we see now based again, as I said, on that deposit composition mix. It will not just be, though, of course, around deposit beta. A lot that is embedded into the forecast, as I said, has to do with how we see those deposit behavior moving over time. And again, a lot of that is informed by what we saw in the last rate hike cycle. And maybe just a follow-up on the earlier discussion on organic growth, I mean the 4% number, which, considering the more pronounced tax seasonality, elevated market volatility, was certainly an impressive result. Well, the cadence is obviously â\u0080\u0093 youâ\u0080\u0099re not going to â\u0080\u0093 youâ\u0080\u0099ve seen more in the second quarter â\u0080\u0093 I mean youâ\u0080\u0099ve seen a different mix, right, in the second 2 months than the first month because you had a tax outflow season. I think what we have seen is a continue â\u0080\u0093 you have a lot that comes in from a flow-based basis is just â\u0080\u0093 if you think about workplace, youâ\u0080\u0099re going to see that development and continue. As people have exercised their options, they continue to move forward. I think whatâ\u0080\u0099s important as we look forward, in terms of where is the floor, look, we have said historically, we donâ\u0080\u0099t expect to be in that very low single-digit range, which we were before the acquisition of E*TRADE. Exactly how it will pan out, what I can say to you is that it does look â\u0080\u0093 itâ\u0080\u0099s still healthy, and weâ\u0080\u0099re still â\u0080\u0093 we still feel well positioned. As it relates specifically to other indicators that you might think about â\u0080\u0093 for example, recruiting. Because they are seeking to be with their FA through that advice-led channel more immediately, so as you called it, there are cross currents. Wanted to follow-up on Investment Management and the fee outlook, you have, obviously, beta working against you in some of your higher fee products, but you have fee waivers coming off on the money market side. But just to give you a sense, the fee rates themselves havenâ\u0080\u0099t changed. So weâ\u0080\u0099ve seen a decrease over the course of the last two quarters in some of those equity accounts, for example, which, as is disclosed, could be higher â\u0080\u0093 can have higher fees. In things like liquidity, weâ\u0080\u0099re now not seeing the fee waivers since weâ\u0080\u0099ve moved off that zero-bound floor. We stand behind that guidance, and youâ\u0080\u0099ve continued to see that flow into the numbers. I think, though, what is important is, obviously, where could you see things change, is the liquidity balances, right. Itâ\u0080\u0099s a rate time balance question, as I said before. And the balance is in this case, I think, is a testament to the amount of time and the investment weâ\u0080\u0099ve put into this business to find relationships also across the integrated investment bank where weâ\u0080\u0099ve worked with partners in Institutional Securities, for example, to help forge relationships that will help bring in some of those deposits into those money market products. And then just as a follow-up, given the backdrop weâ\u0080\u0099re in where revenues are a bit more challenged or uncertain. So the first point that I would highlight to you is that ex integration, our efficiency ratio is at 7%, and that includes the legal charge that James mentioned this quarter. So I think we have shown and continues to demonstrate discipline around our expense base, very similar to the way we think about capital. Resources, we think about it very holistically and part of our strategic decision-making process. As we walked into the second quarter, we were aware that the environment was changing, and we all had been seeing the same events that â\u0080\u0093 weâ\u0080\u0099ve all witnessed together as it relates to the geopolitical front and the macro side. And we came in and we took a look â\u0080\u0093 a hard look and we continue to do so, individual product by product, investment by investment, project by project to understand where are the potential growth in expenses coming from, how are we thinking about balancing, as James said, that near-term investment, making sure that we need to get on certain things. Itâ\u0080\u0099s not new information, and itâ\u0080\u0099s certainly something that we are keeping our eyes on. So you talked about market share opportunities, which you clearly have. We saw a bunch of headlines around hung deals, et cetera, during the quarter. The â\u0080\u0093 from â\u0080\u0093 basically, in terms of the capital market functioning, as James said, this is not â\u0080\u0093 weâ\u0080\u0099re not in a position of the same kind of stress weâ\u0080\u0099ve seen in other necessary cycles. You can see that in just some of the funded balance points that I made across the ISG portfolio in terms of funded balances being at 11% versus even the pandemic, we have seen those balances up to 25%. I also think from a corporate perspective, it is worth noting that many came into this from an environmental perspective in a much better position than they have before because they did issue and weâ\u0080\u0099re in a good spot from a balance sheet perspective in the period of low rates that you saw over the course of last year. Of course, there are days where itâ\u0080\u0099s more difficult to come to market. So just to provide that balance, of course, itâ\u0080\u0099s not the same thing as having a green screen every single day. But I think that you are seeing both institutions and corporations, etcetera, taking advantage of days where the market is open, and they are able to do that, and from that perspective, the market is functioning. As it relates to Prime Brokerage, we have been very balanced in that business. And so from that perspective, we have been very focused on the equities business more holistically for over a decade now. So, appreciate that you all right-sized the business a few years ago. Listen, there is always opportunities to an environment where you can try and pick up share. So, listen, if the option is to trigger another 50 basis points on the SCB or generate another, I donâ\u0080\u0099t know, $100 million, $200 million in revenue. There is a â\u0080\u0093 the fixed income business has gone from doing, I donâ\u0080\u0099t know what they were doing, $500 million, $600 million a quarter in the back half of 2015. And we are consistently somewhere between $1.75 billion and $3 billion, thatâ\u0080\u0099s â\u0080\u0093 they have done a phenomenal job. I think we are around 10% share up from 6% or lower in those days, stable business, great leadership. I wanted to follow-up on Steveâ\u0080\u0099s questions on deposit beta, but rather talk about the balance side of things. So, the brokerage sweep deposits declined by about $30 billion this quarter. Sharon, I think you referenced that it â\u0080\u0093 that was driven by both tax payments, but also some yield seeking. I think the way I would think about it, Brennan, is a little bit differently, which is some of the questions I know we have received are, well, why didnâ\u0080\u0099t your beta come down because you had E*TRADE. So, I think the best way to kind of answer your question a little bit more head on in terms of where the underlying crux is, is we have seen balances also increase in the higher account level. And we have said, as I said directly in my remarks, we also saw the deposit behavior very much in line with what we expected. But why is the beta then higher, some of that beta just has to do with â\u0080\u0093 you have some higher balances. Why, because you accumulated them likely at periods of time where yields were lower, and there was excess cash that was sitting in position. So, I think that can help give you a little bit of construct in terms of whatâ\u0080\u0099s going on from the balance perspective to more directly, I think answer the question rather than just look at one quarterâ\u0080\u0099s behavior. And then when we think about the SBL book, you flagged the $22 billion of continued loan growth. So, it seems like you are expecting loan growth in the back half to be about half of what you saw in the first half a little more than that, but not by much. So â\u0080\u0093 and it makes sense, it would slow. So, from the LTV perspective, as you would expect, we are very much actually in line with where we have been from historical years. And why any uptick at all, as you would expect, obviously, the value of the underlying has gone down. But from a historical basis, we have always been within that â\u0080\u0093 sort of given a 40% range or low-40% range, we are in that range, and we are very much, like I said in line over the last couple of years. Now as it relates directly to what we are looking forward and seeing, I think whatâ\u0080\u0099s important here is that from a mortgage perspective, you might see some slowing just obviously given where rates are. Now, why would the SBLs come down, you just might not have as much interest or engagement in the product with lower asset values. So, I donâ\u0080\u0099t look at it in terms of, oh, there is a management issue, rather that is a very well-managed portfolio where we havenâ\u0080\u0099t seen issues in a lot of different market environment with the calls from an operational perspective more broadly, etcetera, but rather just the engagement from that relationship side, is this the right product to be using now. We will take our next question from Mike Mayo with Wells Fargo Securities. Just a follow-up on the loan growth, the $20 billion loan growth target from the start of the year, it looks like you are still looking at that. I think that the loan growth target is, I mean just in terms of â\u0080\u0093 itâ\u0080\u0099s more of an expectation to help people understand what the NII projection is. To the point that was brought by Brennan, obviously, the expectations on a quarter-over-quarter basis has come down. So, we did see some pull forward, and thatâ\u0080\u0099s all we are reflecting in that. As you look at the provisions themselves, they still vary on a relative basis to other provisions across various â\u0080\u0093 both institutions, and even our Institutional Securities franchise is quite low. In terms of what drives that, as you know, itâ\u0080\u0099s all â\u0080\u0093 it is based on the CECL concept, in the life of loan concept. And as you also know, it is a complicated idea between both qualitative and a quantitative scenario. For us, as we disclosed in our Q, the factors that we look at that are most important is really around GDP. We did see a degradation in the GDP expectations, very consistent with whatâ\u0080\u0099s going on in the macroeconomic outlook. Sharon, in the workplace channel, you guys had some good growth in the number of participants on a year-over-year basis, it was up 17%. No, those are just the value â\u0080\u0093 itâ\u0080\u0099s just the value of the assets themselves have gone down that those holders have. Now the increase in participants has a lot to do with the fact that we just continue â\u0080\u0093 as we continue to â\u0080\u0093 we mandate, we have seen that increase the number of participants. What I would say in terms of just an opportunity in terms of engaging with those clients is, obviously, it is a difficult time in environment for some of those individuals. And we do â\u0080\u0093 we continue to educate and use financial wellness as a tool, especially in these environments, to explain the advice-driven model and provide us with an opportunity actually in this kind of environment to discuss what financial advice and what financial wellness is, specifically as people see different declines in their potential portfolio. Skew, there are â\u0080\u0093 there is a good portion, I would say of technology companies that would be in that sector that you can see as you see those asset values declined, but there is a balance on the other side of different types of companies. And as we win mandates, itâ\u0080\u0099s not just on the tech side. We are winning mandates across different institutions, especially as people better understand that financial wellness offering. If you had to kind of guesstimate in a moderate recession that $1.2 billion of total ACL, where does that go? I think that what you can look at and think about it is, obviously, the economic scenario makes sense. The GDP makes sense, the size of the â\u0080\u0093 where the growth actually comes from and goes, and then there is some extension of duration that you can see dependent on the rate rise expectation. Yes, I wouldâ\u0080¦\n I mean you know what I would do â\u0080\u0093 I would say is why donâ\u0080\u0099t you think about it as it relates to COVID, right. I would just point out that the Wealth Management piece, ACL percentage is 0.1. So, you are just not going to see at least for that part of a major, major move. For the others, I think itâ\u0080\u0099s just â\u0080\u0093 you canâ\u0080\u0099t project. I mean who knows what kind of recession â\u0080\u0093 a recession might be, how long it might be and so on. But we manage this business conservatively and we donâ\u0080\u0099t have a big traditional middle market, small business loan book. Itâ\u0080\u0099s non-material per business line, which is why we donâ\u0080\u0099t call out the number. The reason we called it out in Wealth, just to be clear, was Wealth actually had a great quarter, revenue growth, new money growth, fee-based growth and margins year-over-year, the same at 27% in a very difficult environment. So, we thought it was kind of raining on the party a little bit that the DCP took $500 million off the top line number, even though it comes out of the comp expense number almost dollar-for-dollar, not quite. But we just thought given you would all be interested in how the retail investor was behaving right now and what was going on in that business and how panic they were, the short answer is not very, behaving well, business stable, saw growth. And where does it make sense from a business perspective given the uncertainty, and I think there is a very â\u0080\u0093 as I said, the same way when we think about the expenses, itâ\u0080\u0099s about being efficient and thoughtful and very prudent and flexible with all of that environment. So, itâ\u0080\u0099s both of those things that were taken into account when thinking about the RWA decline. We can buy back up to $20 billion and a bunch that we are going to be doing, hopefully, in the low-70s. So, making sure we give ourselves that flexibility, demonstrating discipline in a tough environment. And obviously, itâ\u0080\u0099s driven in part by volatility in the market, so things outside of their control. Maybe as a follow-up on that, James, I think you have talked about hoping the change in the mix of your business over time would push your DFAS losses and SCB down slightly. Look at the PPNR number, was materially up as stress losses were also up, not surprisingly. But notwithstanding that, we increased the dividend and we still came out at 13.3, I think versus 13.2. The change in business model, the growth in the asset management business, the growth in the workplace retirement business, all of these things, which frankly are very capital-friendly. Then we have an argument we have been â\u0080\u0093 an argument I wonâ\u0080\u0099t put it that way, but letâ\u0080\u0099s just say a different point of view with the Federal Reserve about how they treat financial adviser compensation during a time of stress. So, that expense comes down when revenues come down. The Fed has not yet seen it our way, but we are continuing to push that argument strongly. We will take our next question from Mike Mayo with Wells Fargo Securities. James, you have talked about variable expenses for variable revenues, and the revenues were down, and comp was down. But when it comes to resource allocation, headcount, more aggressive moves to prepare for a difficult environment, you said yourself that itâ\u0080\u0099s uncertain, itâ\u0080\u0099s not the time to take too much extra risk to push your market share. We are overwhelmingly in the U.S. We had 6% revenue growth in the Wealth Management business, produced ex integration 28% margins. And we are managing, I mean I guess itâ\u0080\u0099s quasi plan B., managing the RWAs as we just said in the balance sheet, reflecting a more stressed environment. We met as a Management Committee last September, I think and I spoke to the Management Committee about I felt there was much more downside risk to the market. The magnitude of it, I didnâ\u0080\u0099t have a strong feeling for, but I thought it was somewhere between significant and are really significant. I mean thatâ\u0080\u0099s what â\u0080\u0093 if we were, we wouldnâ\u0080\u0099t be buying back $20 billion increase in the dividend 11%. On the other hand, balance sheet growth will be very measured. I think we will pick up share by banks coming back to us, not necessarily us having to move forward. And as I think Sharon articulated very well, we are doing a pretty systematic review of the prioritization of all the projects going on around the firm and also in a big company like this with $60 billion of revenue, we have a lot of stuff going on, and we have choices as to when we do it. So, I would call it a sort of plan A minus, not a plan B, if you will, but thatâ\u0080\u0099s mindset we are in. However, if things get worse, and in my career, I have seen a lot of recessions, a lot of crises, a lot of damage done to the environment, if things really deteriorated, particularly in the U.S., then we take a much more aggressive position."
}