{
    "symbol": "BASE",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-07 23:20:10",
    "content": " Total annual recurring revenue, or ARR, was $163.7 million at the end of the fiscal year, representing 23% growth year-over-year or 24% growth year-over-year on a constant currency basis. We expect to recognize approximately 71% or $117.2 million of total RPO revenue over the fiscal year 2024, which represents 19% year-over-year growth. While the impact is not material to revenue in Q1 fiscal 2024, we do expect a negative impact to the full year revenue of approximately $2 million, representing an approximately 1% year-over-year impact to growth relative to our prior recognition method. With these factors in mind, for the first quarter of fiscal 2024, we expect total revenue in the range of $39.5 million to $40.1 million or a year-over-year growth of 14% at the midpoint. For the full year of fiscal 2024, we expect total revenue in the range of $171.7 million to $174.7 million or a year-over-year growth of 12% at the midpoint or 13% before the revenue recognition change. And we take great pride in the fact that as we shift over to the things that we can control, operational rigor, really understanding our sales cycle, showing up as true partners to our end customers, really articulating the value of Couchbase and consolidating multiple solutions into one, providing a solution with great total cost of ownership, particularly with Capella, executing on initiatives with our partnerships that have really opened up with our expanded go-to-market with the Capella offering, we feel great about our ability to overcome some of those intensified environments, and really deliver solid results across the business. But we are encouraging our go-to-market teams to think about partners in every one of their deals, and are very excited about some of the joint go-to-market activities that we have with the likes of AWS for converting large customers, moving workloads into Capella, getting at net new workloads in existing customers, and quite frankly, are really impressed with their desire to go after net new logos for the cloud providers and Couchbase."
}