{
    "symbol": "VRAR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-28 18:02:05",
    "content": " As it relates to revenue, we have revenue -- record revenue for fiscal year 2022 of approximately $7.3 million, representing a 2.1 times growth compared to the fiscal year 2021 revenues of approximately $3.4 million. On a full as if fiscal year basis with full year of S5D revenues would have been approximately $9.8 million, almost 3 times increase compared to fiscal year '21. We also continue to  (ph) record revenue on a quarterly basis with Q4 fiscal year 2022 revenue of $2.5 million, 2.5 times growth compared to approximately $1 million for the same quarter last year and sequentially breaking out a third quarter fiscal year 2022 record revenue of approximately $2 million. While I will focus my remarks on our fiscal year, I will mention that we achieved record quarterly revenue of approximately $2.5 million for Q4 fiscal year '22, a 149% increase compared to Q4 of fiscal year 2021 revenue of approximately $1 million and a 22% increase compared to our previous revenue record achieved in Q3 fiscal year '22. Total revenue for the year ended June 30, 2022 was approximately $7.27 million compared to approximately $3.42 million for the year ended June 30, 2021, an increase of approximately 113%. For the year ended June 30, 2022, core software and services revenue, which excludes project revenue was approximately $4.18 million compared to approximately $1.72 million for the year ended June 30, 2021, an increase of approximately 143%. For the year ended June 30, 2022, non-project revenue accounted for approximately 58% of total revenue compared to approximately 50% for the year ended June 30, 2021. For the year ended June 30, 2022, software license revenue was approximately $0.55 million compared to approximately $0.34 million for the year ended June 30, 2021, an increase of approximately 62%. Operating expenses for the year ended June 30, 2022 were approximately $12.37 million, compared to $7.91 million for the year ended June 30, 2021, an increase of approximately 56%. Net loss for the year ended June 30, 2022 was $5.96 million compared to a net loss of $6.09 million for the period -- for the prior 2021 period, an improvement of 2%, primarily driven by increases in revenue, gross profit and other income expense, outpacing growth in operating expenses. Adjusted EBITDA loss of $3.97 million for the year ended June 30, 2022 increased by $2.5 million as compared to $1.47 million loss -- EBITDA loss for the year ended June 30, 2021."
}