{
    "symbol": "VRAR",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-15 19:12:05",
    "content": " Total revenue for the three months ended September 30, 2021 was approximately $1.02 million compared to approximately $0.26 million for the three months ended September 30, 2020, an increase of approximately 292%. Software license revenue was approximately $0.22 million for the three months ended September 30, 2021 compared to approximately $0.07 million for the three months ended September 30, 2020 an increase of approximately 214%. For the three months ended September 30, 2021 VR/AR software and related services revenue not including VR/AR projects was approximately $0.8 million compared to $0.14 million for the prior a year, an increase of approximately 500%. For the three months ended September 30, 2021 non-project revenue accounted for approximately 84% of total revenues compared to 54% of revenues for the previous year in the same period. Gross profit increased to $0.87 million or 85% of revenue for the three months ended September 30, 2021 as compared to a gross profit of $0.12 million or 46% of revenue in the previous year for the same period. Operating expenses for the three months ended September 30, 2021were approximately $2.27 million compared to $1.36 million for the three months ended September 30, 2020, an increase of approximately 67%. For the three months ended September 30, 2021 net loss from operations was approximately $1.4 million compared to a net loss of approximately of $1.24 million for the three months ended September 30, 2020, an increase of approximately 13% period-to period. We sustained a net loss of $1.66 million for the three months ended September 30, 2020 as compared to a net loss of $1.28 million for the prior period, a loss increase of $0.38 million or 30%. Net cash used in operating activities was $1.05 million for the three months ended September 30, 2021 compared to $0.16 million during the prior period, an increase of approximately $0.89 million. For the three months ended September 30, 2021, our adjusted EBITDA loss, a non-GAAP measure improved by $0.08 million to negative $0.44 million or approximately 15% compared to negative $0.52 million for the three months ended September 30, 2020."
}