{
    "symbol": "TDY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 06:45:06",
    "content": " Non-GAAP earnings declined slightly but last year's non-GAAP margin and earnings resulted in part from a disproportionate amount of sales relative to costs near the end of the quarter at Teledyne FLIR, as well as lower share count, both due to the mid-quarter closing of the FLIR transaction in May 2021. Including increased foreign currency headwinds, which negatively impacted second quarter sales growth by over 1.7% or approximately $23 million, organic growth was 8.2% and accelerated from the first quarter of 2022. Finally, our US government sales including Teledyne FLIR increased from last year, despite lower defense department outlays in the second quarter of 2022. Nevertheless, we expect total company year-over-year reported organic sales growth of about 4% in each of the third and fourth quarters of 2022, compared with the prior outlook of roughly 5% to 6% resulting in a few - full year estimated sales of about $5.47 billion. Despite these headwinds, we continue to see full year organic sales growth which excludes FLIR of just over 6%, and full year sales from Teledyne FLIR slightly greater than the peak sales in 2020, which included over $125 million from cameras for elevated skin temperature testing. We also remain a bit cautious regarding cost impact of inflation, therefore, we're modestly revising our full year adjusted earnings outlook by $0.30 at the midpoint, or approximately 1.7% lower than in April. In digital imaging, second quarter sales increased 32.9%, largely due to FLIR acquisition, but organic growth in our combined commercial and government imaging businesses was also very strong at 10.3%. In our Instrumentation segment, overall second quarter sales increased 7.4% versus last year's. In the Aerospace and Defense Electronics segment, second quarter sales increased 10.8% driven by a 3.4% growth in defense, space and industrial sales combined  43.9% increase in sales of commercial aerospace products. Free cash flow, that is, cash from operating activities less capital expenditures was $176.1 million in the second quarter of 2022, compared with $190.5 million in 2021, which included $66.7 million of after-tax cash payments related to the FLIR transaction."
}