{
    "symbol": "TDY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 18:13:10",
    "content": " Moving to our Aerospace and Defense Electronic segment, first quarter sales increased 9.9% driven by modest growth in defense based on industrial sales combined with greater than 50% increase in sales of commercial aerospace products. Finally, in our Engineered System segment, first quarter revenue decreased 8.9% and operating profit and margin declined due to lower sales, but especially since we exited the higher margin cruise missile turbine engine business, following the first quarter of last year. Finally, regarding our global defense business, which represents approximately 25% of our total sales, over the last six months, defense sales including that of Teledyne FLIR, declined slightly year-over-year and backlog also increased. On the flip side, in our Engineered Systems segment, which has revenue of about $400 million, and it's primarily government businesses, we expect margins to end lower than what we expected in January and be at 10.4%. Now having said that, the longer term, we think our defense sales should decrease in the mid-single digits, which is if you take a negative 2.5% and go to, let's say, 5% or so, that 7.5% turnaround that would be though at the end of 2022 or likely 2022 and 2024. First, let me back up and say, the way we look at defense, which is now about with FLIR included, Teledyne FLIR, it's about 25% of our portfolio. So in total, I think we expect for the year, the revenue year-over-year to go up for the overall FLIR business, Teledyne FLIR, I should say, to about – from what was last year, $1.895 billion, if you rolled it all in historical as well as after the acquisition, to about 1.97% , which would be the highest over the last two years. Well, again, going with our team, I’m going to say net GAAP earnings, gap of growth, net growth for the year should be about 4.5%, 5%, even though we had such a good first quarter. Aerospace and defense electronics, as I mentioned, because of the commercial aerospace comeback, we have a 1.13 book to bill and an engineer systems where our revenue went done for the reasons I mentioned, partly because we are not going to – we got out of the turbine engine business after the first quarter of last year, plus we've been eating into our backlog."
}