{
    "symbol": "MG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 22:27:22",
    "content": " Reconciliation of these non-GAAP â\u0080\u0093 non-US GAAP financial measures to the most directly comparable US GAAP financial measures can be found in the tables contained in yesterday's press release, and in the company's related current report on Form 8-K. Our legacy operations continued to deliver improving performance, while the investments we are making in our strategic initiatives across renewable energy, data and new markets are beginning to contribute to our overall success as well. On the bottom line, both net income and earnings per share were up more than 28% from a year ago, whereas adjusted EBITDA for the third quarter was essentially unchanged as both gross margin and overhead are battling a rising cost environment. Repair and maintenance services revenue should be lucrative, along with higher margins and multiples for monitoring adding to our already $15 million plus per year business in renewable win. Gross profit for the quarter was approximately $54 million, up 3% from a year ago, with gross margin expanding 20 basis points to just over 30%. Selling general and administrative expenses in the third quarter were $41.6 million, up $2.4 million or 6% from a year ago, in part due to expenses related to our bank refinancing of about $700,000 and an additional $600,000 of incremental cost down actions, which were restored in the third quarter versus same period last year, for a total of $1.3 million or just over half of the overall increase. Keep in mind, that under our new credit facility maximum allowable total funded indebtedness to adjusted EBITDA is 4 times through the second quarter of 2023's measurement date, with a step down to 3.75 times for Q3 2023 measurement period and going forward for periods thereafter. Note that unfavorable foreign exchange, is expected to lower revenue and adjusted EBITDA after translation into US dollars by approximately $15 million and $2 million respectively on a full year basis for 2022 compared to our original outlook for the year. So on the revenue side Mitch so full year revenue impact of the FX is about USD 15 million was FX, $2 million on the EBITDA line were due to pure FX translation differentials for the full year 2022. So I mean -- so if I look to sort of midpoint -- if I look at the midpoint of the fourth quarter, it looks like it will be somewhere around $170 million for fourth quarter revenue, which is maybe flat maybe slightly down from a year ago."
}