{
    "symbol": "PK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 14:23:01",
    "content": " Importantly, we are seeing an inflexion for our urban markets as we have also witnessed a strong uptick in business transient and group demand across several of our core urban hotels, including San Francisco, New York, Boston, D.C., and Chicago by the middle of the quarter, more specifically, hotel occupancy, or our core urban hotels across these five markets increased by more than 2,700 basis points on the January lows to nearly 47% in March, and are on pace to be near 68% during the second quarter, based on our current forecast. Please proceed with your question. And if you recall, with -- obviously with a lot of Omicron-related cancellations in the group side, cancellation fees were -- certainly have been elevated if you're kind of tracking relative to prior   levels and trying to model that way, I'd say that's the biggest gap you're probably seeing at this point is I would say we're probably normalized around $2 million or so of cancellations any given quarter. Please proceed with your question. Please proceed with your question. Having said that, as we sort of look here at Q1, both costs and the reach were 46% to 50% over, and RevPAR certainly versus 2019, we're expecting we're probably going to be in that 40% to 50% range here, as we look out, there's a little bit of moderation, but they're still going to continue to be strong. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And again, just given the amount of capital that's out there and we're talking hundreds of billions of dollars, certainly looking for only so many resi deals, industrial deals and low cap rate deals to get done in three and four times, 3% and 4% versus where we think hotels are going to trade. Please proceed with your question. Please proceed with your question. I would say, group is still going to be somewhere in the neighborhood of call it kind of on pace with that with our guidance, because again, you've got some strong group here coming back, we're still obviously below normal levels, and then stay on business transient while it was still recovering, we're probably still pacing at close to 60%, 65% of '19 levels as we kind of entered the quarter. Please proceed with your question. Please proceed with your question."
}