{
    "symbol": "PK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 16:53:04",
    "content": " Lodging fundamentals continued their positive momentum into the third quarter supported by a strong labor market and healthy consumer and corporate balance sheets, which translated into steady growth in business transient demand and stronger than expected group demand in the quarter, especially post Labor Day as we witnessed some broad-based return to office trends and despite headline risk over increasing macro uncertainty, we currently do not see weakness in our business with continued improvements to group, business transient and international demand for the fourth quarter and beyond. And despite recent choppiness in the debt markets, interest in hotel real estate remains high, and we expect to execute on additional non-core asset sales, including potential deals in excess of $100 million, and these would bring our total net amount of closed and pending dispositions for the year to over $500 million well within our expanded target discussed last quarter. Our two Hawaii hotels, recorded an average RevPAR increase of 13% over the third quarter of 2019, with the Hilton Hawaiian Village reaching average occupancies in the mid-90s, in July and August and an all-time monthly high of $354 an ADR for July and on pace to achieve a near-record EBITDA. Looking beyond the third quarter the outlook for San Francisco continues to improve with fourth quarter occupancy forecasted to reach the upper-60s, while RevPAR GAAP 2019 is expected to narrow to 29% of our 2019 levels by December. Pro forma RevPAR for the third quarter was $171, 8.8% below 2019 levels, driven by widespread improvements in demand with pro forma occupancy improving sequentially by 80 basis points to 71.7% and pro forma rates continuing to improve to $239 for the quarter or 7% above the same period in 2019. Looking ahead to the fourth quarter, preliminary results in October look strong, with occupancy averaging approximately 74%, a nearly 200 basis point sequential improvement over September, while average daily rate during the month is projected to be approximately $243 or 4% above 2019. While we continue to witness improving trends across several key urban markets, especially New York, Boston and New Orleans, we expect San Francisco will negatively impact Q4 RevPAR performance relative to 2019 by approximately 850 basis points, partially driven by a tough comparison with the timing of the Dreamforce citywide being held in September of this year versus October of 2019, when over 100,000 attendees participated in the event. And if you think back to some of the markets obviously San Francisco, Florida across our portfolio New York, New Orleans, Chicago, Hawaii all continue to show really strong performance. So, I would say that as we look at the markets, whether it's bank, financing or call it CMBS, anything that's kind of in that, kind of high single-digit debt yields, you're probably looking at call it $350 million to $400 million over SOFR. And so, I think for the most part, we feel pretty good about where the markets are going but obviously, it's a tough comp given Q4, given the San Francisco drag as well as the BI that we saw for CreeBay, especially in Q4 2019 as you mentioned. If you think historically, it's been about $9 million $8 million to $10 million, let's use $9 million is kind of inbound into why about 60%, 62% coming from the US second largest market really coming out of Japan, kind of $1.5 million plus or minus. So, I think again coming from where it's been I think it's very encouraging and it's -- and I think what's also encouraging is what we saw the activity for -- in the month of September for booking for 2023 for San Francisco, which really represented about 14% of the total rooms added that month and ultimately 20% of the revenue."
}