{
    "symbol": "PK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 16:53:07",
    "content": " Looking closer at our quarterly results, second quarter pro forma RevPAR recovered to 90% of 2019 levels and pro forma hotel adjusted EBITDA came in roughly $30 million ahead of our internal expectations set forth at the beginning of the quarter, highlighting the strong recovery in demand, following the COVID-related slowdown at the start of the year. On the cost savings side, our operational modifications helped to drive pro forma hotel adjusted EBITDA margins of nearly 31% during the second quarter were just 30 basis points below 2019 levels, despite portfolio RevPAR being down 10%. Please proceed with your question. Please proceed with your question. We'll continue to work hard as we've demonstrated, but we are laser-focused on selling another $300 million to $400 million in assets again, using those proceeds to pay down debt, reinvest back into the portfolio, continuing to build liquidity and make sure the balance sheet is in strong shape, so that we have the optionality to pivot between defense and offense, as we said in our prepared remarks. It's certainly going to -- I think certainly be a big plus for us on the rate side as it continues to improve its rate, relative to 2019, growing to kind of high single digits to low double-digits through the course of the next several months. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Given what you said about crude mix being lower in Q3, it feels like with the strength in resort and leisure rates wouldn't that actually allow Q3 to show better recovery relative to 2019, because it's more of a leisure transient quarter than a group quarter so that the outperforming segment right now would -- I guess I'm just trying to understand why you're calling for the quarter to not be as strong as what you've seen in June and July. Please proceed with your question. Please proceed with your question."
}