{
    "symbol": "BEAT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 07:25:30",
    "content": " As we look forward, FDA clearance for HeartBeam AIMI, we are also making significant progress with our core product, the AIMIGo 3D VECG collection device as we prepare for FDA submission in late Q4 of this year. HeartBeam AIMI is software as a medical device solution for use in acute care settings with market clearance via the 510(k) regulatory pathway and our first target will be emergency departments, where this will be a software licensing business model on a subscription basis of an average cost of $100,000 per year per emergency department. Turning to our AIMIGo product, we expanded our product portfolio pipeline to serve the growing cardiac device wearable technology market by bringing clinically relevant diagnostic information to patients and clinicians with smart watch connectivity enablement supporting a daily multi-hour heart monitoring solution. In September, we were granted a patent that provides additional intellectual property protection for our AIMIGo Technology offering, 12-lead ECG capability in the form of a credit card size device with the same footprint as the single lead products currently in the market today. By engaging experience development partners like Triple Ring HeartBeam management is confident, weâ\u0080\u0099ll meet our project timelines for late Q4 2022 FDA submission and are in active discussions with Triple Ringâ\u0080\u0099s manufacturing partner to support a limited market release of the AIMIGo product in Q2 of 2023. While each product offers some of the capabilities of the HeartBeam telehealth product, the 12-lead ECG capability, integration of patient history and symptoms, and the presentation of comparative ECGs, providing a baseline and symptomatic ECG to the physician, differentiate the AIMIGo device significantly from other products in the market. With AIMIGo, weâ\u0080\u0099ve already got a lot of interest from some of those same centers, because weâ\u0080\u0099re finding in fact, I know one of my staff just had a discussion today with a major academic center in the Seattle region, where weâ\u0080\u0099re bringing cardiology and emergency medicine together, because we think long-term thereâ\u0080\u0099s a possibility that AIMIGo will get prescribed not just by cardiologists who follow these high risk patients, but also out of emergency departments by physicians that are often discharging up to 80% of patients that present with chest pain. Jon, please go ahead. Jon, please go ahead."
}