{
    "symbol": "BEAT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-17 01:06:05",
    "content": " Perhaps, most importantly, for this initial phase of our technology development, HeartBeam AIMIGo technology, will bring the power of standard of care 12-Lead ECG to physicians from in front of their patients and remotely that are anywhere at any time. While each product offers some of the capabilities of the HeartBeam telehealth product, the heart attack detection, 12-Lead ECG capability, integration of patient's history and symptoms, and representational baseline and symptomatic ECG to the physician, the HeartBeam AIMIGo device is significantly different and it is offering in a very underserved market. We believe HeartBeam AIMI and HeartBeam AIMIGo, by leveraging our patented 3D vector ECG technologies, offers substantial capabilities beyond existing offerings, and we continue to engage with potential customers and partners in anticipation of the FDA clearance and commercial launch for our products. As we look forward to FDA clearance for HeartBeam AIMI, we're also making significant progress with our core product, the HeartBeam AIMIGo 3D VECG collection device as we prepare for FDA submission in the coming weeks. Our newly acquired, state-of-the-art, FDA cleared, watch-based arrythmia detection tool, once integrated with HeartBeam AIMIGo telehealth platform, presents a unique opportunity to extend our product capabilities well beyond what is currently available for cardiac patients outside of a medical setting. During the quarter, we partnered with Evolved Manufacturing Technologies, a contract medical device manufacturing company, to build the credit card sized HeartBeam AIMIGo 3D VECG recording device. In September, we were granted a patent that provides additional intellectual property protection for our HeartBeam AIMIGo technology, offering 12-Lead ECG capability in the form of a credit card sized device with the same footprint as the single lead products currently in the market today. We also partnered with Evolve Manufacturing Technologies, a contract medical device manufacturing company, to build the credit card sized HeartBeam AIMIGo 3D VECG recording device that enables a 12-Lead ECG readout for remote heart attack detection. Other products in the pipeline include a 12-Lead ECG extended wear monitor or patch, as well as a system that fully integrates HeartBeam AIMIGo in the heart monitoring smartwatch technology we acquired from LIVMOR. And as noted in the IPO registration statement, we plan to finance ourselves to the next inflection point in 2024 FDA clearance of our HeartBeam AIMIGo product with a personalized 12-Lead simulation display that a physician is used to seeing with a standard 12-Lead ECG today by using our patented VECG technology. Our next milestones on the commercialization path include FDA submission for the initial HeartBeam AIMIGo 3D vector ECG product and FDA clearance for HeartBeam AIMI, both expected in the near future. And I joined because I believe in the company and I believe in the technology and think this could be absolutely a chance to bring a game changing technology to market, being able to get a 12-Lead EKG into patients hands and with the VECG technology potentially being able to go beyond that, and the data aspects that Branislav mentioned. And so, we believe that getting the AIMIGo to the FDA cleared state will enable us to consider offering an integrated product, where you have a watch that's working with AIMIGo for a full-blown ability to detect a variety of conditions through our 12-Lead ECG. Secondly, as far as patch is concerned, as I alluded to, we are very seriously considering the opportunities that it presents, well established markets, changing form factors, but technology wise, there is very little change that would be required between going from a credit card sized AIMIGo, HeartBeam AIMIGo device to a patch."
}