{
    "symbol": "LGIH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 16:01:06",
    "content": " During the quarter, we closed 1,547 homes, a decline of 38.1% primarily related to lower community count and absorptions compared to last yearâ\u0080\u0099s record comp. As Eric noted, 443 of our closings were sold through our wholesale business, representing 28.6% of our total closings compared to 433 homes or 17.3% of our total closings in the same quarter last year. Revenue in the third quarter was $547 million, a decline of 27.2% from last year, primarily driven by fewer home closings and partially offset by a 17.6% increase in our average selling prices to $353,635. Gross margin this quarter was 28.5%, a 160 basis point improvement over the same period last year and a new third quarter record. Adjusted gross margin this quarter was 29.5%, a 130 basis point improvement over the same period last year and also a new third quarter record. Combined, selling, general and administrative expenses for the third quarter were 11.2% of revenue compared to 8.6% during the same period last year. EBITDA for the quarter was $113.7 million or 20.8% of revenue, representing a 270 basis point improvement over the same period last year and a new third quarter record. Pre-tax net income was $108.7 million or 19.9% of revenue, a 300 basis point improvement over the same period last year and a new third quarter record. We are really â\u0080\u0093 margins is a byproduct of pricing and really looking at pricing on a community by community level and we are lowering prices, last quarterâ\u0080\u0099s highest gross margin history in Q2, solid gross margins in Q3 and then we are adjusting to current market. It depends on what the backlog is, how many houses are left in that community, what the gross margins are at to start off and then new communities are in our 25% to 28% adjusted gross margin rolling out business as usual. Just wanted to get a little clarity, I believe that the midpoint of your fourth quarter gross margin guide implies â\u0080\u0093 your reported gross margin guide implies like a 22.5% level, but itâ\u0080\u0099s pretty wide anywhere from 20% to 25%."
}