{
    "symbol": "LGIH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 17:34:11",
    "content": " Despite fewer closings compared to last year, our commitment to our systems, combined with continued pricing power allowed us to deliver our most profitable second quarter ever and we set new company records in every profitability metric we track including gross margins, EBITDA, pretax income and net income. Revenue in the second quarter was $723.1 million, a decline of only 8.6% from last year, as the decrease in home closings was offset by 28.7% increase in average selling prices to a record $356,719. Adjusted gross margin this quarter was also a new company record at 33.1%, a 460-basis-point improvement over the same period last year and a 280-basis-point improvement over our prior record. EBITDA for the quarter was $169.1 million or a record setting 23.4% of revenue, a 320-basis-point improvement over the same period last year, which was also our previous record. Adjusted EBITDA was $167.1 million or 23.1% of revenue, a 310-basis-point increase from the same period last year and also a new record. Pretax net income was $163 million, a record setting 22.5% of revenue and a 370-basis-point improvement over the same period last year, which was also our previous record. Charles can weigh in, but I personally think gross margins in the third quarter, probably, higher than the fourth quarter, because our backlog percentage gross margin is still really strong and we think thatâ\u0080\u0099s going to gradually go back to normalization and then we factor that in when we provide at the year-end range that we did. But we have also closed a lot of those homes over the last couple quarters and first part of the year, which has been very, very good for us as a company and they are -- we just think we are going back to a normalized market where our customers are predominantly going to be customers that are currently paying rent. To get that one 1.2 you would be more like 1.5% range in the back half and that would be up nicely year-over-year on a 40 bps, 50 bps and up a few -- several million year-over-year on $1 basis."
}