{
    "symbol": "ENR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-09 15:05:02",
    "content": " At this time, I would like to welcome everyone to Energizer’s Second Quarter Fiscal Year 2022 Conference Call. These statements are based on management’s current expectations and are subject to risks and uncertainties, including those resulting from the ongoing conflict between Russia and Ukraine, as well as the COVID 19 pandemic, which may cause actual results to differ materially from these statements. Information concerning our categories and estimated market share discussed on this call relates to categories where we compete and is based on Energizer’s internal data, data from industry analysis and estimates we believe to be reasonable. Unless otherwise noted, all comments regarding the quarter and year pertain to Energizer’s fiscal year and all comparisons to prior year related to the same period in fiscal 2021. As you saw in our release posted earlier today, we delivered a strong second quarter, which is a testament to our team’s dedication and resilience. First, we successfully executed pricing actions and growth plans, which generated healthy organic topline growth. As a result of our performance in the first half of the year and the benefits of pricing, we are increasing our top line guidance to low single-digit growth for the full year. Second, while we remain focused on preserving gross profit dollars, the combination of our pricing efforts and internal cost savings initiatives should begin to drive gross margin expansion in the back half of the year. From a category standpoint, we operate in categories that are meaningfully larger than pre-pandemic levels with both volume and value of considerably on a two-year stack. These improvements are designed to drive efficiencies to reduce working capital, allowing us to return to normalized free cash flow generation in the back half of the year. First, we delivered organic growth of 1.3%, driven by a combination of global price increases and strong growth in auto care. In the Battery segment we experienced normalization in net sales, as volumes declined as compared to the elevated prior-year period. This volume decline was partially offset by pricing, as well as distribution growth in key markets. Our Auto Care business delivered organic sales growth of nearly 20% in the quarter, with double-digit growth across both North America and International, more than offsetting the organic decline in battery. This growth was driven by a combination of pricing, timing of refrigerant shipments and expanded distribution, particularly internationally, as we continue to execute our international growth plans behind Armor All and our portfolio of iconic Auto Care brands. Those insights are also highlighting areas where we can be even more efficient, which will drive margin expansion over the balance of the year. In general, these pricing actions have lagged the impact of the cost increases we have seen and as they take full effect, we anticipate meaningful margin improvement in the second half of the fiscal year. While we saw declines in the latest three month data, we expect price increases executed across the category will drive an increase in value over the balance of the year. Our iconic brands outpaced the category resulting in a 2.8 share point gain versus last year, with growth across each region in total batteries. In particular, we experienced growth in the U.S. driven by expanded distribution, as well as strong performance internationally, including share gains in 17 of our top 20 markets. The growth will come from a robust innovation pipeline, which is full of products containing new exciting technology designed to deliver the performance, value and convenience expected by our consumers. We have the right combination of product innovation, marketing efforts and operational excellence to continue to grow this business in the years ahead. We also expect these investments to enable us to maintain acceptable fill rates, while prudently reducing our inventory levels as we continue to see stability in the global supply chain. While our heightened inventory levels remain important to serving our customers and consumers, we believe this combination of a stabilizing global supply chain and better data and analytics will enable us to decrease inventory towards the end of the fiscal year unlocking free cash flow to continue to invest in our business and reduce debt. I am incredibly proud of our colleagues around the world and the results we delivered this quarter, which are a testament to our team’s commitment to success. I will start this morning with some highlights on progress we are making in a few focus areas, followed by an overview of our financial performance this quarter and our outlook for the remainder of the year. We have historically employed dedicated teams focused on pricing and revenue management, as well as ongoing efforts to optimize costs in our supply chain, given the fast-paced environment which been operating, we consolidated those efforts to prioritize the preservation and expansion of gross margin. By bringing those teams together at the beginning of the year, we were able to execute incremental pricing and focused cost savings projects that we expect to help deliver the outlook we initially provided in November, despite continued inflationary pressures. We have already identified a substantial pipeline that we can undertake over the balance of this fiscal year and future years to enhance our portfolios, improved pricing and reduce costs. This program is designed to ensure we maintain the healthy growth in both Batteries and Auto Care, while accelerating margin improvement. Based on the work we have done to-date, we already expect incremental gross margin improvement in the back half of the year and remain on track to deliver the full year gross margin rate as guided in our first quarter earnings. However, improved visibility from our digital investments as well as improved stability in the global supply chain should allow us to reduce the heightened levels of inventory and lower our working capital needs. As a result, we expect to return to more normalized free cash flow generation in the second half of the year and we will prioritize debt reduction is our cash flows recover. Finally, over the last two years, we have made significant strides in our digital transformation which has elevated the quality of our data, the visibility we have over multiple aspects of our business and our analytic capabilities. For instance, we have been able to greatly improve the quality of the analytics on our ocean freight spend and have identified areas to reduce transportation costs and optimize container utilization, which can lead to cost reductions, as well as more efficient inventory management. And by continuing to develop our digital capabilities, we are confident that we will continue to generate improvement in our results in the quarters and years to come. Now turning to our financial results, reported sales of $685.4 million were essentially flat, while organic revenues were up 1.3%. While volumes were better than expected during the quarter, they declined roughly 4.5%, as we lapped elevated COVID related demand in the prior year. Looking at our two segments Battery and Lights organic revenue was down 3.5%, primarily due to elevated comps with the prior year quarter as last year grew roughly 15%, driven by that elevated COVID related demand. As a reminder, our first round of pricing went into effect in the December quarter and we have executed additional pricing that went into effect mid March. Auto Care continued its strong performance with organic sales up 19.4%, primarily due to pricing actions, a shift in timing of A/C PRO shipments from the third quarter to second quarter and distribution gains in both the U.S. and international markets. As expected, adjusted gross margin decreased 560 basis points to 34.9% as increased input cost including material transportation and labor were partially offset by the impact of our pricing actions. While the second quarter is typically our lowest quarter for A&P spend, due to the seasonality of both of our businesses. As a result, we anticipate A&P spending for the full year to trend more towards our historical norm as we continue to prioritize investment in our brands. Similar to the first quarter, segment profit for both Battery and Lights and Auto Care benefited from continued strong demand, pricing actions and distribution gains. However, inflationary input cost pressures more than offset the stronger than expected topline performance resulting in segment profit declines of $30.1 million for Battery and $4.6 million in Auto Care. Interest expense declined roughly $800,000, as the benefit of our refinancing over the last year, more than offset an increase in debt, which was used to finance investments in incremental inventory. Our debt capital structure is now 86% fixed at a blended average interest rate of 4.2% with minimal maturities prior to 2027, which positions us well in the current rising interest rate environment. Based on our outperformance on the topline in the first half of the year in the success of our pricing actions across the globe, we are increasing our outlook for net sales to low-single digits. While the operating environment remains volatile, the pricing actions we have taken along with cost management efforts are expected to offset inflationary pressures. Through the first half of the year, our team’s execution has been exceptional, our categories continue to perform well globally and our pricing initiatives have delivered, as expected. Good morning Wendy, I will start and then I will turn it over to John maybe talk about the growth expectations we have in the back half. On your first question as it relates to trade down, we really haven’t seen it yet. That’s obviously something we are not going to take for granted, we are going to watch it carefully to the extent it happens any trade down were to happen we have value brands in our portfolio and can leverage those as we move forward. On Auto Care, the underlying fundamentals of the category are really healthy, number of miles driven exceeds pre-pandemic levels for size of the car park also is going up, as well as the age of the fleet now exceeds 12 years old. All of those factors are healthy drivers for category growth and as a result, we are -- we expect great things for this business over the balance of the fiscal year and John you want to talk about sort of growth in Q3, Q4. I think we called up organic growth for the rest of the year, Wendy, and that is driven in large part by what Mark had talked about. On the Auto Care, certainly good start, can you maybe just quantify the pull-forward, maybe I missed that and also has there been any negative impact from just weather we have seen from the garden companies and some of the pet companies. Well, I think, maybe let’s break down, so the growth on that 20%. It’s about a little more than half was pricing, a little bit less than half was that pull-forward of the A/C PRO and that’s a shift from the prior year where I think we were having trouble getting our hands on some of that. Q3 -- Q2, Q3 Bill always tends to be a bit of an inflection point in terms of shipments for us and they tend to shift back and forth year-to-year. It has been a little bit from a weather standpoint a later start to the season, but it’s really starting to pick up. And as long as, if you recall a couple of years ago we had an unusually long and cold spring and as a result sales suffered. Distribution gains of Batteries fairly broad-based you are seeing and just in every International trade group, you are seeing share gains across both modern, developing and distributor markets. We are also seeing share gains in the U.S. Our distribution gains in the U.S. should start to cycle off late Q3, and as a result we should plateau, we wouldn’t expect it to go down and will be in line with the category. I was just trying to break down the pricing that obviously you gave us a good bridge for the pricing of the quarter, but hoping to get a little bit of color into the second half. It doesn’t look like you are sounding that Auto Care will continue, but you have tough comp, so I was just trying to be, it’s a second type question on the Auto Care and going back to Bill’s question and you mentioned that A/C PRO shipments from last year. And in terms of auto care we are, as you mentioned, we do have tough, tough comps, in large part because the pricing actions we have taken on Batteries and Auto Care, we do expect organic growth for both of those businesses going forward. So last quarter we had kind of called full year 2022, almost $250 million of inflationary cost pressures. So, all in, I think, we have plateaued a bit over the last quarter from an inflationary standpoint and as -- so I think we feel like we are pretty decent place there. As you think about operating levels as we go forward, there will be some I think actions that will take to work down inventory and we have taken that into account as we look at 2022, not going to give 2023 guidance, but we are mindful of the impacts of slowing things down in order to get through that. But on the third round of pricing that we mentioned, it’s a targeted price increase in a subset of our categories and we will continue to monitor those. But I would say on -- in terms of all of our price increases, the original expectation as we go into, it is because our gross margin dollars and then over time we will be able to work on gross margin rate going forward. Javier, so we had growth about 920 basis points of cost increases, that was really transportation of about 470, raw materials of 340 and labor of 110. I think what we are, expecting, if you look at our first half gross margin rate. So we have seen some plateauing in some opportunities on ocean freight, and I think, we mentioned in the prepared remarks, there is a lot of work we are doing on ocean freight and other areas where we have seen dramatic increases over the last year to try to drive those down as much as we can. Javier, I think on the ocean freight rates, for instance, as well as the in North America freight rates, you are starting to see premiums come down, you are starting to see a reduction in the asset royalties that you will incur as a result of that. Well, I would say, that’s an ongoing effort of our commercial teams across the world. You are going to start to see some of that expanded distribution start to plateau in Q3 and towards the end of Q3 and as a result we would expect our share gains to level off, but we wouldn’t necessarily expect them to decline either because we continue to have healthy distribution and we will continue to fight for more. So as we break it down a fair amount of the increase this year is cost, a lot of those cost increases came through in the fall into the next turn of inventory obviously went up. So the other part would be more days driven and that’s elongation of the supply chain, that’s safety stock that we have built. I think what we are expecting is to return to free cash flow generation in the back half and we are going to prioritize debt pay down, is that starts to happen. Zinc is one of those commodities that it’s been pretty volatile, it is gone up a lot over the last year, continue to go up throughout the quarter."
}