{
    "symbol": "ADN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 13:33:03",
    "content": " At this time, I would like to welcome everyone to the Advent Technologies Second Quarter Earnings Conference Call. Before we begin the prepared remarks, we would like to remind you that Advent issued a press release announcing a second quarter 2022 financial results, shortly before market opened today. I'd also like to remind everyone that during the course of this conference call, Advent's management will discuss forecasts, targets and other forward-looking statements regarding the company's future. While these statements represents managementâ\u0080\u0099s current expectations and projections about future results and performance as of today, Adventâ\u0080\u0099s actual results are subject to many risk and certainties that could cause actual results to differ materially from those expectations. In addition to any risk highlighted during this quarter, important factors that may affect Adventâ\u0080\u0099s future results are described in its most recent SEC reports filed with the Securities and Exchange Commission including today's earnings press release. Management estimates are derived from publicly available information released by independent industry analysis and other third party resources as well as data from a company's internal research and are based on assumptions made upon reviewing such data and with knowledge of such Industry and Market, which it believes to be reasonable. On today's call, I will provide comments regarding our second quarter results, followed by an update on the business. Subsequent to my last date on May 12, Advent presented its inaugural Investor Day on July 7, which provided a comprehensive review of our technology and commercial progress. Advent had a very exciting second quarter, capital identification from the Greek state for funding of EUR 782.1 under IPCEI Hydrogen technology for Adventâ\u0080\u0099s Green HiPo project. That certification has approved up to EUR 5.4 billion support by 15 member states in the hydrogen technology value chain, is also expected that this funding will unlock additional EUR 8.8 billion in private investments. This value chain has four key areas consisting of hydrogen generation, fuel-cell technology, storage, transportation and distribution and end user technology. Adventâ\u0080\u0099s Green HiPo encapsulate the idea of hydrogen generation fuel-cell technology and examples of other companies in these areas includes, , the joint venture between , MarkFeet,  Arkema, Boss and Dailmer Truck. Overall, our performance this quarter leaves us confident about the long-term growth and Adventâ\u0080\u0099s potential for commerce. In April, Advent announced the signing of a technology assessment, sales, and development agreement with Hyundai, a leading multinational automotive manufacturer offering a range of world-class vehicles and mobility services in over 200 countries. Advent and Hyundai aim to deliver green energy solutions to current high carbon applications, using fuel cell technology. Under this agreement, Hyundai will provide catalysts to Advent for evaluation with Adventâ\u0080\u0099s proprietary MEA. Advent intends to support Hyundai in fulfilling its fuel cell project needs, through developing inks and structures using Hyundai catalysts, following which they will determine whether their own catalysts, or external standard catalysts, will be used for this project. In addition, Advent will support Hyundai by supplying Advent MEAs throughout the development and commercialization cycle for testing, evaluation, and optimization under conditions set by Hyundai and by assisting Hyundai with the use and specifications of MEAs as well as their implementation into Hyundaiâ\u0080\u0099s designs. Following the completion of the first phase of the project, Hyundai and Advent will collaborate closely to set out specific product requirements, collaborative product goals and milestones for achieving define targets and plans for the second phase, which shall also include Adventâ\u0080\u0099s stack cooling technology. The Advent MEAs to be tested by Hyundai are currently being developed within the framework of Lâ\u0080\u0099Innovator, Adventâ\u0080\u0099s joint development program with the U.S. Department of Energyâ\u0080\u0099s Los Alamos National Laboratory, Brookhaven National Laboratory, and National Renewable Energy Laboratory. Advent MEAs operate at a high temperature between 80 degree Celsius to 240 degree Celsius compared to the incumbent low temperature PEM technology, which is restricted to an operating temperature of below 100 degree Celsius. The ability to operate at over 100 degree Celsius confers significant advantages such as the efficient heat removal in heavy-duty mobility applications, making Adventâ\u0080\u0099s high temperature PEM an ideal technology for trucks, aviation and marine applications. Adventâ\u0080\u0099s MEAs can operate effectively with fuels such as low Advent fuel such as low grade hydrogen which can be reformed on-board from methanol, natural gas, and other renewable fuels. As a further milestones to our mobility focus, In May, Advent announced the signing of a second technology assessment agreement with another large global automotive manufacturer. With a common goal of sustainability and the faster decarbonization of the U.S. automotive industry, Advent is supporting efforts to advance innovative fuel cell technology as a sustainable and efficient option for achieving carbon neutrality. Providing support on MEA operational parameters and sharing technical know-how for fuel cell stacks, proprietary HT-PEM technology, and leveraging HT-PEM for advanced cooling systems. The new Advent MEAs to be tested as part of this project, are currently being developed within the framework of Lâ\u0080\u0099Innovator. In April, Advent announced that it received new orders for its proprietary MEAs from Safran Power Units, a leader in auxiliary power systems and turbojet engines. The supply of Advent MEAs started in the first quarter of 2022, and deliveries continued through the second quarter. Safran Power Units constantly innovates and develops new power unit solutions, featuring higher performances with lower environmental footprint and operating costs, relying on its expertise in hybridization and fuel cells. Safran Power Units has been a long-term customer of Advent, having tested and deployed Adventâ\u0080\u0099s state-of-the-art MEAs in a variety of applications in the past. Commissioner for the Internal Market, Thierry Breton, CEO of Hydrogen Europe, Jorgo Chatzimarkakis, and 20 other CEOs and executives from the Electrolyzer Community met and signed a Joint Declaration, establishing a clear goal of paving the way towards achieving the objectives of the REPowerEUâ\u0080\u0099s proposed Hydrogen Accelerator, which sets out a strategy to double the previous EU renewable hydrogen target to 10 million tons of annual domestic production and an additional 10 million tons of annual hydrogen imports. Under the Joint Declaration, Europeâ\u0080\u0099s leading electrolyzer manufacturers agreed to increase their manufacturing capacity in an effort to have, by 2025, a combined annual electrolyzer manufacturing capacity of 17.5GW, as well as to further increase that capacity by 2030 in line with projected demand for renewable and low-carbon hydrogen. Advent fuel cells are a reliable source of on-demand power generation across various applications and industries, including shipping, power generation, and heavy-duty mobility. The fuel cells can deliver direct power without power loss from additional converters, offering a sustainable and highly efficient solution. Also in June, Advent announced the signing of a MoU with Laskaridis Shipping, a renowned ship management company based in Athens. Under the terms of the MoU, Laskaridis Shipping and Advent have agreed to jointly conduct a pilot program, under which Advent will supply Laskaridis Shipping with its SereneU methanol-powered fuel cells. Following the successful completion of the pilot program, Laskaridis Shipping and Advent will collaborate on manufacturing and testing the next generation of Adventâ\u0080\u0099s fuel cells. Advent has made very good progress over the last quarter, as well as having a strong pipeline of opportunities. Turning to our financials, we delivered revenue at $2.2 million in the second quarter, compared to $1 million in the prior year quarter. Gross profit decreased $0.4 million year-over-year in the second quarter, due to the mix of products and customers included in revenue, a higher fixed cost space resulting from the acquired businesses and supply chain cost pressure in the second quarter of 2022. R&D expenses were $2.6 million in the second quarter, primarily related to internal R&D costs incurred in each of our businesses, as well as our cooperative research and development agreement with the Department of Energy. Administrative and selling expenses were $8 million in the second quarter, a year-over-year increase of $1.4 million, primarily due to increased staffing and costs resulting from the acquisitions and from stock-based compensation expenses. This is a decrease of $12.8 million from March 31st of 2020, driven by the increased level of R&D and administrative and selling expenses, as well as $2.8 million of spending during the second quarter for the build out of our Hood Park R&D and manufacturing facility. Also in mid-June, the company announced the successful notification from the Greek state for funding of EUR 782.1 million for Advents Green HiPo which was subsequently ratified by the EU. As we all know not every opportunity in the pipeline will transpire due to factors that may be beyond Adventâ\u0080\u0099s control, opportunities may not materialize or could be delayed. During and beyond the initial six year development and production timeframe, we're aiming for significant revenue growth through Green HiPo will cement our foothold in the global electrolyzer market and fuel cell market."
}