{
    "symbol": "ADN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 14:49:05",
    "content": " At this time, I would like to welcome everyone to Advent Technologies First Quarter Earnings Conference Call. On the call today, we are joined by Dr. Vasilis Gregoriou, Advent's Chairman and CEO; and Kevin Brackman, Advent's CFO. Before we begin the prepared remarks, we would like to remind you that Advent issued a press release announcing its first quarter 2022 financial results shortly before market open today. You may access the materials on the Investor Relations section of the company's website, www.advent.energy. I would also like to remind everyone that during the course of this conference call, Advent's management will discuss forecasts targets and other forward-looking statements regarding the company's future, customer orders and the company's business outlook that are intended to be covered by the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 for forward-looking statements. While these statements represent management's current expectations and projections about future results and performance as of today, Advent's actual results are subject to many risks and uncertainties that could cause actual results to differ materially from those expectations. In addition to any risks highlighted during this call, important factors that may affect Advent's future results are described in its most recent SEC reports filed with the Securities and Exchange Commission, including today's earnings press release. Lastly, information discussed on this call concerning the company's industry competitive position in the market in which it operates, is based on information from independent industry and research organizations, other third-party sources and management estimates. Management estimates are derived from publicly available information released by independent industry analysis and other third-party resources as well as data from the company's internal research and are based on assumptions made upon reviewing such data in this experience and in knowledge of such industries and markets, which is pleased to be reasonable. Good morning to everyone listening in, and thank you for joining us on Advent's First Quarter 2022 Earnings Call. I'm joined today by Advent's CFO, Kevin Bracken. On today's call, I will provide comments regarding our first quarter results, followed by an update on the business. During my last update on March 28, I concluded by remarking that 2021 was a very significant and progressive year for Advent and that we have built the foundation for growth. In Denmark and Germany, the share development and assembly responsibilities for Advent's 5 kilowatts to 15 kilowatts sarin new systems. And in Greece, we have expanded our MEA production and polymer synthesis capacity including polymer for the next-generation Advent MEA. Our business focus is on the production of advanced fuel cell materials leading to direct sales and the development of advanced fuel cell systems in collaboration with OEMs, which will enable us to enter into long-term licensing arrangements. Advent is now in various discussions for joint development agreements in the genset, heavy-duty automotive, marine and aviation markets. Advent also intends that its own products such Serene, Honeybadger and M0 as well as third-party products will be able to use the new Advent MEA in mass production as soon as 2024. Due to the high temperature operation, Advent MEAs can work within pure hydrogen that can be reformed on board on methanol. Advent MEAs can work with impure hydrogen that can be reformed on board from methanol, natural gas and other renewable fuels. In February, we announced new contracts with manufacturers of clean power generation and energy storage solutions for the delivery of advanced electrochemistry components. Advent began delivering electrochemistry components in the fourth quarter of 2021, and deliveries are expected to continue to September 2022. Advent electrochemistry components business includes electrodes, membranes and MEAs. Advanced electrochemistry materials R&D team is primarily based in Boston Mass with since the assess and manufacturing capabilities in Europe -- in Jan. And this time, I don't think we'll drop off because we changed the line completely. The agreement allows Calscan to market, resell, install and service the Advent M-Zero, the SereneU fuel cell products to meet the demand for electric systems in the oil and gas sector. Other diverse family of products, including the M-Zero and SereneU fuel cell products aimed to significantly reduce wellhead methane emissions where they replace methane polluting pneumatic injection technology, increased well productivity and safety and decreased maintenance cost in well sites based in North America. Also in January, we announced that Advent will be upgrading virus sites of Globe Telecom in the Philippines with 10 kilowatts at NAU fuel cell systems, enabling Globe to reach its ambitious targets for reducing CO2 emissions. By deploying Advent SereneU fuel cells, Globe aims to reduce carbon emissions across its network, consume cleaner fuel in smaller quantities, achieved lower emissions and maintain energy-efficiency removal. Advent SereneU fuel cells produce pure emission that traditional generator sets and also generate less noise, thereby providing a system with a low footprint to surrounding areas and communities. Advent SereneU systems also have higher temperature and environmental conditions tolerance ensuring an interactive backpack power and strong resilience against extreme environment, such as typhoons, monsoon rain and even long dry seasons. By using fuel cells for its green transition, Globe complies not only with regulation and its own business for best environmental practices but also secures several competitive advantages. All of Globe's initiatives in the green transition reflect its commitment to the UN sustainable development goals and also to decouple economic growth for environmental degradation, increased resource efficiency and promoting sustainable lifestyles by changing the way people produce and consume good resources. In February, Advent announced the signing of an MOU with Electric Ship Facilities, or ESF, a that based business with over 15 years of experience in electric and hybrid profession systems and energy system. And the agreement, ESF commits to become a future distributor of Advent SereneU fuel cell products, further strengthening its portfolio of innovative CO2 reducing technologies. This new collaboration will enable Advent to facilitate dry processes and fuel cell configurations for both land-based and marine time applications with the initial geographic focus being Benelux, Germany, Switzerland and Austria. In March, Advent announced that it entered into preliminary strategic agreement with Daiden, a leading power generation industrial equipment provided in Malaysia. Once these tests are complete, Daiden will determine the best strategic approach for the introduction of Advent's methanol-based fuel cell to the Malaysian market. In parallel, Advent started to put in place an operational structure that will deliver on these very significant projects with Advent being ideal voice to commence immediately upon final certification. We have a product portfolio that's focused to enable green economy, one that will abate the resilience on fossil fuels and will disenfranchise the entire supply market, therefore, providing energy security to communities and economies. However, there was a significant increase in income from grants of $0.5 million compared to the prior year quarter. Gross profit decreased $1.4 million year-over-year in the first quarter due to the mix of products and customers included in revenue, a higher fixed cost base resulting from the acquired businesses and supply chain cost pressure in the first quarter of 2022. R&D expenses were $2.1 million in the first quarter, primarily related to our cooperative research and development agreement with the Department of Energy as well as the R&D costs at Sur Energy and Fisher EcoSolutions. Administrative and selling expenses were $10.5 million in the first quarter, a year-over-year increase of $2.6 million primarily due to increased staffing and costs resulting from the acquisitions of Serene Energy and Fisher Eco Solutions and operating as a public company and from stock-based compensation expenses. Advent remains well capitalized with $59.3 million in cash reserves on the balance sheet at March 31, which provides us with the flexibility to be agile in executing on our strategic and operational priorities. This is a decrease of $20.5 million from December 31, 2021, driven by the increased level of R&D and administrative and selling expenses as well as annual insurance renewals and incentive compensation payouts during the quarter. Advent developed significantly during 2021, and we entered 2022 with a more advanced product range, a dedicated technical sales team focused on key sectors and geographies. Advent will use its expertise and resources to bring opportunities to fruition, which will translate into revenue. Having said that, we anticipate revenue and income from grants for 2022 to be approximately $23 million, which will be heavily weighted towards the second half of the year. In closing, we believe that Advent is well positioned to be the provider of clean energy solutions across a variety of end markets. Advent has significant opportunities for its technology, advanced materials and fuel cell system products. During the first quarter of 2022, we've seen a material increase in the number and frequency of queries for our technology and products. Advent in a clean area technology company, development technology and products for key sectors that require clean energy. Yes, I would say I would not say it was the majority of that the electrochemistry contracts I would not say that, that was the majority of our revenue in Q1, I would say it was spread across all of our products and businesses."
}