{
    "symbol": "ADN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 13:26:13",
    "content": " In July, Advent hosted 2022 Investor Day, where Advent's executives and senior leadership discuss the company's most recent advancements for its fuel cell products and systems, housing development projects and business activities in markets across the U.S., Europe. And there's the key areas that were addressed where the company is Green HiPo project, with planned funding of â\u0082¬782.1 million euros over six years from the Greek state aimed at producing high numbers of PEM fuel sales, and electrolyzers to decarbonize global power production via hydrogen. The  preliminary agreed to collaborate on the production of environmentally friendly hydrogen as a fuel with the participation of other major industrial partners for developing proprietary highly differentiated CHP system ready for mass production with efficiency approaching 90% and with multi-fuel operating capabilities such as hydrogen, natural gas, any fuels that can address the key current and future on grid and off grid operation modes and business cases and create an innovation hub for the grid hydrogen fuel cell industry and develop synergies for promoting hydrogen and related technologies. Advent's fuel cell technology powers, a highly sophisticated incredibly portable battery charger, designed to meet the rank of grid power needs in performance demand in settings, such as those regularly faced by the Hellenic Army's Special Operations Unit, and other military divisions. The portable fuel cell been previously deployed successfully within the framework of PARMANION National Large Scale Joint Exercise In August, Advent announced that it just co-signed a MoU with the New York State Energy Research and Development Authority and more than 60 clean hydrogen ecosystem partners. Under the MoU Hydrogen Systems aimed to utilize a vast number of existing relationships in the telecom and hydrogen energy marketplace in the Kingdom of Saudi Arabia and elsewhere throughout the Mideast to market, sell, distribute, install and service Advent's full line of high temperature PEM fuel cells and hydrogen production products. Simultaneously, Advent and Hydrogen Systems intend to collaborate and explore potential large scale development opportunities for hydrogen fuel cell power applications across the region. Others methanol powered fuel cell system will be used as a backup power source for Brandenburg's BOS digital radio network, replacing the diesel driven emergency power systems at several sites over the next three years. Prior to Advent election, the performance of the company's methanol power fuel cells was tested at the site of the BOS digital radio network, providing further proof of concept for the use of high numbers of PEM fuel cells as an efficient backup power source for critical infrastructure application."
}