{
    "symbol": "THRN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-15 08:24:04",
    "content": " With respect to Q1 net sales, our 33% D2C growth for the quarter was largely due to continued traction we gained raising brand awareness in the second half of 2021 after ramping up our marketing spend and from incremental subscription growth. During the quarter, we continued to see top line growth as net sales grew 22.9% to $54.7 million, up $10.2 million from the same period last year. Our non-subscription DTC sales also continued to grow during the quarter, increasing $3.5 million or 25.4% year-over-year to $17.5 million. In terms of our B2B business, sales during the first quarter were $28.9 million, an increase of 15.1% or $3.8 million over the same period last year. SG&A expenses during the first quarter of 2022 grew $6.4 million or 57% to $17.6 million, representing 32.3% of net sales. As a result of the continued growth in our DTC business, we incurred higher sales and fulfillment costs of approximately $2.1 million due to increased transactions and shipment volume from higher sales activity through our marketplace on thorn.com. We also incurred nearly $1.4 million of incremental costs during the first quarter of 2022 which we consider public company in nature, including higher insurance premiums related to D&O coverage, professional and legal fees, board costs and audit-related costs. During the first quarter, we continued to invest in promoting the Thorne brand which drove marketing expense higher by $1.5 million or 35.2% to $5.7 million. Research and development expenses were $2 million during the first quarter, up from $900,000 during the prior year as we continue to invest in the development of a pipeline of strategic initiatives and new products, such as our new Greens  product, Collagen line, SynaQuell and our printed supplement beverage platform. Adjusted EBITDA for the first quarter of 2022, excluding special items, was $8.7 million or 15.8% of net sales, an increase of $400,000 compared to $8.3 million during the prior year, representing 18.8% of net sales. Operationally, during the first quarter of 2022, we used $4.5 million of cash in our operating activities, primarily driven by $5.7 million of marketing and advertising spend and growing our inventory, including raw materials by $7.1 million to support our continued growth and protect our supply chain. Our largest increases are actually not fortunately, in raw materials which are the biggest dollar items but in other component items that particularly are affected by petroleum and petroleum processing and that really includes our bottles and scoops and seals and elsewise which have increased about 24% year-over-year and 5% from the last quarter."
}