{
    "symbol": "THRN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 19:38:02",
    "content": " Starting with the top line, I'm pleased with our record net sales of $58.4 million, representing growth of more than 21% for the quarter. Based on our year-to-date performance through October and aforementioned topics, we now expect our full-year guidance to be net sales of between $232 million and $235 million, representing growth of 25% to 27% over 2021. In addition, our guidance for adjusted EBITDA and adjusted EPS includes the following assumptions: marketing costs of between 14% and 15% of net sales, depreciation of approximately 2.7% of net sales, an estimate full-year adjusted tax rate of 10% and diluted weighted average shares outstanding of 53 million as of December 31, 2022. I am happy to report another quarter of strong financial performance, as net sales grew by 21.7% or $10.4 million to $58.4 million during the third quarter of 2022. In terms of our professional and B2B business, sales during the third quarter were $31.4 million, an increase of 5.9%. Gross margins during Q3 were 48.2% of net sales, declining 500 basis points from last year and was impacted by short-term increases in specific raw material costs and a marginal decline in ASP, driven by the continued growth in our professional/B2B channel, driving an unfavorable shift in sales mix during the quarter. General and administrative costs, which include our corporate cost and general overhead were $10.5 million or 18% of sales during the third quarter compared to $7.1 million or 14.7% of sales last year. Adjusted to exclude the impact of depreciation and equity compensation costs, general and administrative costs during the third quarter of 2022 were $7.9 million or 13.5% of sales compared to $6.4 million or 13.3% of sales last year. During the third quarter, marketing expenses were $4.5 million or $6.3 million lower than the same period last year as we reduced and deferred marketing spend and prioritized delivery on our full-year profit goals for 2022. Looking at year-to-date results for the first nine months of 2022, net sales were $169.2 million, an increase of $33.8 million or 24.9% over the prior year. Growth in sales, were led by a $26.9 million or 49.1% increase in our DTC sales, of which $10.7 million was attributable to the continued growth in DTC subscription sales. B2B professional sales during the first nine months of 2022 were $87.5 million, an increase of $6.9 million or 8.5% over the prior year period. During the first nine months of 2022, SG&A expenses grew $17.5 million or 47.2% to $54.5 million or 32.2% of net sales. Drilling down into the three primary operating functions of our SG&A costs, during the first nine months of 2022, selling costs were $11.8 million or 7% of sales compared to $7.8 million or 5.7% of sales during the first nine months of 2021. Adjusting to exclude the impact of depreciation and equity compensation costs, general and administrative expenses during the first nine months of 2022 were $22.9 million or 13.5% of net sales. Comparatively G&A, excluding depreciation and equity compensation costs for the nine months of 2021 was $18.8 million or 13.9% of net sales. Marketing expense during the first nine months of 2022 was $27.5 million, an increase of $7.4 million or 37% over 2021, driven primarily by the $10.2 million investment into our 12-week Healthy Aging campaign aimed at increasing brand awareness and driving new customer acquisition, which ran the majority of the second quarter of 2022. Operationally during the first nine months of 2022, we used $8.8 million of cash in our operating activities, driven by marketing and advertising spend and growing our inventory including raw materials which increased by $13.4 million to support our continued growth, new product launches and to protect our supply chain."
}