{
    "symbol": "MDVL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 20:51:07",
    "content": " All forward-looking statements, including, without limitation, those relating to our operating trends and future financial performance, the impact of COVID-19, the ongoing military action launched by Russian forces in Ukraine or the impacts of other global economic conditions, including any economic effects stemming from adverse geopolitical events and economic downturn and inflation or interest rates on our business and prospects for recovery, expense management, expectations for hiring, growth in our organization and reimbursement, market opportunity and expansion and guidance for revenue, gross margin and operating expenses in 2022 are based upon our current estimates and various assumptions. Retail Pharmacy Services generated $10.6 million in revenue for the second quarter of 2022, representing 137% growth over the same period in 2021, while Pharmacy Technology revenues were essentially flat at approximately $500,000 year-over-year. As a result of our progress, year-to-date and visibility into the second half of the year, we are introducing net revenue guidance of at least $42 million for the full year 2022. We ended the second quarter with 91 dispensing units, representing a 3% increase from 88 as of March 31, 2022 and a year-to-date increase of 34%. Net revenue for the three months ended June 30, 2022 was $11.2 million, a 122% increase from $5 million in the same period of the prior year. Total operating expenses for the second quarter of 2022 were $12.3 million, a 16% increase from $10.6 million in the second quarter of 2021. Adjusted EBITDA, which we calculate by adding back interest expense, depreciation and amortization, stock-based compensation and exclude non-recurring expenses and other income to net loss is a loss of $10.3 million in the second quarter of 2022 compared to a loss of $9.7 million in the second quarter of 2021 reflecting growth in new deployments."
}