{
    "symbol": "IDA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 08:01:35",
    "content": " IDACORP's second quarter 2022 earnings per diluted share were $1.27, a decrease of $0.11 per share from last year's second quarter, primarily reflecting the impact of weather and partially offset by the accounting impacts related to a regulatory order. Year-to-date earnings per diluted share were $2.18, a decrease of $0.09 per share from the first half of last year's weather-assisted record results. Today, we also raised the bottom end of our previously issued full-year 2022 IDACORP earnings guidance estimate by $0.10 to the range of $4.95 to $5.05 per diluted share, which would result in the 15th consecutive year of growth in earnings per share. While we haven't felt the pressures on O&M that are pervasive in the macro economy, we remain committed to our efforts to control expenses like we've always done and we are confident in our team's ability to remain focused on controlling costs throughout the second half of the year. As I mentioned last quarter, we're also planning to bring two large battery storage projects totaling 120 megawatts online next year to meet our capacity needs, pending approval by the Idaho Public Utilities Commission, because batteries will be the first of their kind in Idaho. In the table of quarter-over-quarter changes, you'll see that customer growth added $2.7 million to operating income and as Lisa noted, we expect this growth to continue as people and businesses relocate to our service area and as existing businesses expand their operations and footprint. Effectively, we're comparing to Q2 last year that was 25% drier and 109% hotter than normal, and these weather conditions all combined to cost much of the $25.9 million net usage per customer decrease in operating income. Another piece relates to the decrease in usage per customer that I just described for irrigation customers, that results from monthly fixed charges being spread over your megawatt hours, causing an increase in retail revenues per megawatt hour during the second quarter of this year compared with the same period last year. The higher other O&M expenses shown next on the table, led to a $12 million decrease in operating income this quarter compared with last year's Q2. The $8.8 million decrease in depreciation expense that's further down the table on Slide 6, is where the bulk of the effect of the Jim Bridger order increased operating income for the second quarter. We've also updated our full-year O&M expectations by $10 million, now fall in the range of $365 million to $375 million, keeping up with the level of customer and load growth we've experienced in our service area and continued elevated prices that had an impact on that range."
}