{
    "symbol": "IDA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 20:21:05",
    "content": "  This morning, we issued and posted to IDACORP's website our fourth quarter and year-end 2022 earnings release and the associated Form 10-K. As noted on Slide 2, our discussion today includes forward-looking statements, including earnings guidance, spending forecasts and regulatory plans, which reflect our current views on what the future holds, but are subject to several risks and uncertainties, including uncertainties surrounding the impacts of future economic conditions. IDACORP's 2022 earnings per diluted share were $5.11, an increase of more than 5% or $0.26 per share from last year, reflecting the impacts of customer growth, weather and a mid-year regulatory order, partially offset by higher operating costs. Today, we also initiated our full year 2023 IDACORP earnings guidance estimate in the range of $4.95 to $5.15 per diluted share, which includes our current expectation that Idaho Power will utilize approximately $15 million of additional tax credits that are available to support earnings at a 9.4% return on equity level in the Idaho jurisdiction under its Idaho regulatory settlement stipulation. And with the new meta data center coming to Idaho and Micron's major expansion of its Boise headquarters, including new microchip fabrication facilities, Idaho Power expects retail sales growth of 5.5% over the next five years. Our efforts to expand and improve Idaho Power's energy grid requires significant investment, and we currently anticipate growth and reliability-focused projects will drive more than $3 billion of capital expenditures over the next 5 years, and Brian will discuss more about that in a moment. We've invested over $1 billion in infrastructure for the communities and businesses we serve since Idaho Power's last general rate case over a decade ago, and we have considerable infrastructure investment ongoing during this year that we plan to include in the case. We have worked hard to keep our O&M low for the past decade, with an average annual rate -- growth rate through 2022 of only 1% since 2012 or an increase of just over $50 million to serve those nearly 120,000 new customers. The $12.7 million cumulative decrease in Idaho Power's fixed cost adjustment mechanism revenues, that you see next on the table, partially offset the increases in residential and small commercial customer usage. Also, wheeling customers paid 4% more for transmission wheeling for much of the year, with Idaho Power's transmission tariff rate increasing in October 21, and again in October 2022, reflecting higher transmission costs. The portion of higher net power supply expenses that were not deferred for future recovery and rates through power cost adjustment mechanisms in both Idaho and Oregon contributed to the sizable $14.8 million increase and other changes in operating revenues and expenses, which are next on the table. You'll see that it reflects an additional 15% increase over last year's already sizable forecast, with more than $3 billion of expected capital projects through the end of 2027. With the assumption that Idaho Power will need to utilize approximately $15 million, as Justin mentioned, of additional investment tax credit amortization to realize the 9.4% return on year-end equity in Idaho. So we're not saying that it's 5.5% every year, that is over that 5-year period of time, with potentially higher growth over the later years in that 5-year period as customers ramp up."
}