{
    "symbol": "ABUS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 14:05:04",
    "content": " I would now like to hand the conference over to your first speaker today, Lisa Caperelli, Vice President of Investor Relations. Good morning, everyone, and thank you for joining Arbutus' first quarter 2022 Financial Results and Corporate Update Call. Joining me today from the Arbutus executive team are Bill Collier, President and Chief Executive Officer; David Hastings, Chief Financial Officer; Dr. Gaston Picchio, Chief Development Officer; and Dr. Mike Sofia, Chief Scientific Officer. Bill will begin with a corporate update, followed by Dr. Sofia, who will provide an update on our preclinical programs. Before we begin, we'd like to remind you that some of the statements made during the call today are forward-looking statements, which are subject to a number of risks and uncertainties that may cause our actual results to differ materially, including those described in our most recent annual report on 10-K, quarterly report on Form 10-Q to be filed later today and from time to time in other documents filed with the SEC. As you saw in this morning's press release with our first quarter 2022 financial and corporate update, we are on track to deliver on multiple key milestones across our chronic hepatitis B and coronavirus programs. In fact, we anticipate reporting data from 4 clinical trials that are evaluating either 729 or 836 during this year. And importantly, as Dave will discuss later in this call, we are well positioned financially with a projected cash runway into the second quarter of 2024. Now before I turn the call over to Mike Sofia to run through the progress the team has made in advancing our proprietary early research compounds, I'd like to highlight some of the progress we've achieved towards our 3-pronged HBV strategy to provide a functional cure for chronic HBV infection. As you know, that 3-pronged approach consists of suppressing S-antigen, reducing HBV DNA and boosting the immune system. Starting with our lead HBV compound 729, our proprietary RNAi therapeutic. In clinical trials to date, 729 has shown a sustained reduction in S-antigen and in some patients, an increased HBV-specific immune response. To further assess this activity, 729, together with standard of care, nucleoside analog is currently being evaluated in combination with other approved or investigational compounds in 2 Phase IIa clinical trials with a third trial expected to begin enrollment shortly. The first trial, AB-729-201 is assessing the safety and tolerability of 729 plus interferon in patients with NUC-suppressed chronic HBV. The second trial is being conducted by Assembly Bio and is evaluating 729 with Assembly's core inhibitor, vebicorvir. Late in the first quarter, Assembly reported that this trial was fully enrolled with data expected in the second half of 2022. The third trial, AB-729-202 will evaluate the safety, antiviral activity and immunogenicity of Vaccitech's therapeutic vaccine or placebo after administration of 729, again in NUC-suppressed chronic HBV patients. As we explore 729 in these Phase IIa clinical trials, the goal is to utilize these learnings to identify the best combination of compounds that we can then explore in Phase IIb as we focus on developing a functional cure for HBV. We anticipate reporting additional key data from the Phase Ia/Ib clinical trial, AB-729-001 at a medical conference this year. That data will include new on-treatment data for patients enrolled in cohort K, which are HBV DNA negative and e-antigen positive patients that received 90 milligrams of 729 every 8 weeks. It will also include additional data for patients in cohorts E, F, G, I, and J. These cohorts assessed 60 milligram or 90 milligram every 4, 8 or 12 weeks as well as long-term follow-up data for patients who completed treatment and have discontinued 729 and discontinued new therapy. We're looking forward to seeing the treatment discontinuation data as this will be our first glimpse into potential functional cure data, albeit with a small subset of patients. Now in addition, our next-generation oral capsid inhibitor, AB-836, in combination with NUC therapy is designed to eliminate viral replication and reduce HBV DNA. In the HCV space, we have 2 important preclinical assets, AB-161 and AB-101, both of which are currently undergoing IND-enabling studies with the goal of completing those studies in the second half of this year. Starting with our oral RNA destabilizer, AB-161, I'd like to walk you through our RNA destabilizer history and how we selected AB-161 as our next-generation compound. So in our quest to develop acute functional cure for chronic hepatitis B, we always believe that a small molecule RNA destabilizer could provide a key piece necessary for providing a proprietary oral treatment regimen. Mechanistically, RNA destabilizers target the host proteins, PAPD5 and 7, which are involved in regulating the stability of HBV RNA transcripts. In doing so, RNA destabilizers lead to the degradation of HBV RNAs and, thus, reduce S-antigen levels and inhibit viral replication. Our first-generation RNA destabilizer, AB-452, inhibited  production in vitro and in vivo using an AAV-HBV mouse model. Despite this setback, we still believe that the HBV RNA destabilizer mechanism of action is compelling and has the potential to lead to an all oral therapy for patients with hepatitis B. This was important that this new compound had differentiated chemistry compared to not only AB-452, but also any competitor RNA destabilizer. In addition, we wanted to maintain the robust antiviral potency seen with the first-generation destabilizers. Specifically, AB-161 showed potent antiviral activity in multiple HBV cell models. It was active across all HBV genotypes, maintain activity against NUC-resistant variants. It was selective against HBV versus many other viruses that inhibit the production of multiple viral protein products and more specifically, reduced serum S-antigen in AAV-HBV mouse models. To examine whether this liver-centric approach could avoid the peripheral neuropathy issues observed in our earlier compound AB-452, multiple ADME, toxicology and PK studies were conducted. In in vivo non-GLP safety studies, we undertook an extensive assessment of several development compounds with particular focus on agents that demonstrated the cleanest profile as it related to the proper neuropathy concerns. To that end, we believe that AB-161 meets the high bar we set and showed an improved safety profile compared to AB-452. We are continuing to conduct IND-enabling studies with AB-161, including 90-day GLP studies in 2 species to further confirm our belief in our strategy to address the safety issues seen with AB-452. Now moving on to AB-101, our PD-L1 oral small molecule inhibitor. To achieve a functional cure and long-term HBV viral control, we believe that highly functional HBV-specific T cells are required. However, HPV-specific T cells become functionally defective and greatly reduced in number during chronic HBV infection. Immune checkpoints such as PD-1, PD-L1, play an important role in the induction and maintenance of immune tolerance and in T cell activation. Therefore, we hypothesize that one approach to reawaken HBV-specific T cells is to block the PD-1, PD-L1 protein interaction and hopefully break HBV-specific immune tolerance. Through our research efforts and preclinical work, we selected AB-101 as a lead candidate based on in vitro potency, immune restoration, in vivo efficacy, selectivity and safety. As I've mentioned in the past, our key financial metric is cash and financial runway. Our cash, cash equivalents and investments was approximately $221.8 million as of March 31, 2022, as compared to approximately $191 million as of December 31, 2021. Now during the 3 months ended March 31, 2022, we received a $40 million upfront payment from Qilu Pharmaceutical for the exclusive commercialization license agreement for AB-729 in Greater China, $15 million of gross proceeds from Qilu's equity investment and approximately $300,000 of proceeds from our ATM. We expect a net cash burn between $90 million to $95 million in 2022, not including the $55 million of proceeds received from Qilu and believe our cash runway will be sufficient to fund operations into the second quarter of 2024. Now in terms of our Qilu transaction, we are accounting for the upfront and premium on the equity investment as deferred license revenue that will be recognized over time, currently estimated at 2 years, based on labor hours expended by our employees to perform our manufacturing obligations under the technology transfer and license agreement, including tech transfer assistance and clinical drug supply. So based on hours incurred, we recorded $9.6 million of revenue in the first quarter of 2022. In closing, we are well positioned financially to advance our mission to develop a functional cure for HBV and a treatment for COVID-19 and potential future coronavirus outbreaks. Operator, I think we can now open up the lines for a question-and-answer session. I guess, I'm going to start on the coronavirus program. You guys are targeting a pan-coronavirus approach for both the protease and polymerase, I believe. So yes, when we chose these 2 targets, we chose them because both are highly conserved across all known coronaviruses. So yes, we are looking at a general pan-coronavirus strategy. And the approach would be to look at treatment first, but it wouldn't be impossible to think about prophylaxis prevention strategies of coronavirus as well. I mean if you look at Paxlovid, certainly, the Pfizer compound did reduce hospitalizations, but has now been shown not to have any effect on pre-exposure prophylaxis, which is an area that we would like to enter into. I'm assuming you're not going to need ritonavir and maybe you'll have better lung accessibility, et cetera. The question on 161, I guess it sounds like -- I'm not sure if you guys have discussed this previously, but it sounds like the conclusion is that the neuropathy is an on-target effect. But certainly, the data that we have accumulated today seems to point to that. If we can get a liver-centric agent that minimizes peripheral exposure, we believe we can overcome the peripheral neuropathy concerns. Two questions for me, one on hep B. Gaston, do you want to take the first, and then we'll have Mike Sofia follow up on the protease. So in terms of the 2 Phase IIa studies, one the triple ones, one is in collaboration with Assembly. And by the end of the year, we presumably will have on treatment data. That's going to take a bit longer, but we will have -- but we believe it's meaningful data on treatment. In terms of what we expect, I mean, it's a little bit premature to say, but we obviously hope that the addition of the -- or the combination of the 3 directs will result in deeper and hopefully, on treatment loss of S-antigen. In terms of the triple with interferon, that's a relatively smaller study. That study is enrolling, and we hope to have some preliminary on-treatment data as well by the end of the year. And I think in response to your question about, I mean, when we will stop patients, both studies call for stopping patients, but more importantly, our Phase Ia/Ib study, it's already stopping patients based on the criteria that we defined. As I mentioned before, the criteria is multifactorial, but one of the important elements is the threshold of S-antigen, and we're using less than 100 to decide the patient is ready to stop NUC therapy. And obviously, we're following those patients after NUC therapy -- after stopping NUC therapy and trying to assess functional cure. And obviously, not everyone is opting to stop NUC therapy, although they may meet the criteria. So to answer your question about the protease, so we have a whole battery of studies that we do. So we do biochemical intrinsic activity studies against SARS-CoV-2, but also protein Mpro, but also the Mpros from the other or, let's say, a representative set of other coronaviruses that we do. Again, it's not only SARS-CoV-2, but against other coronaviruses. We do a lot of, let's say, biophysical studies to ensure that we understand how these molecules are binding. And as far as other coronaviruses are concerned, were our targets, so certainly, our main target is SARS-CoV-2 with the pan-coronavirus, but obviously, looking into the future, how one could potentially apply these agents to other coronavirus infections that are not SARS-CoV-2 sort of certainly a possibility, but we're focused on SARS-CoV-2 at this current time. But unfortunately, one of the countries that we selected to start the study was the Ukraine. And as everyone knows, obviously, given the war, we will not be able to initiate screening and randomization in that country. But given the loss and the uncertainty with Ukraine, we are also trying to identify other countries where we can move in as fast as possible. So once the data comes through, we'll be in a much better position to decide the go-forward combo. Yes, I think it's a little bit of a challenging question. It depends on the data, really. I mean the data -- the interim data, for example, would be spectacular, then one could eventually make a decision at risk. If one the size of the data is not clear cut, then you have to wait longer to decide whether it's worth pursuing one path or the other. And it's -- I mean, the only thing I can say is going to be data driven. So Gaston for the first one, then Mike. I mean it's very interesting the question because I think if you look at the recent final guidance on HBV drug development issued by the FDA on April 6, S-antigen continues to be the main endpoint. Having said that, as everyone knows, everyone is interested in other markers. And we are running those markers such as, but not limited to, HBV RNA and core-related antigen. There are a little bit of a mixed bag regarding the value that these markers on treatment may provide in terms of predicting durable S-antigen loss response or functional cure, if you wish. But certainly, we're including things, biomarkers beyond S-antigen. Yes, it is possible that we would present at a scientific meeting in the not-too-distant future, some of the preclinical data on 161 to demonstrate superiority to 452. I just wonder if you could give us any color on the potential -- on the presentation at EASL, I think you said 7 abstracts quite a bit. But I think Gaston, you can get some additional color based on what EASL have produced. So Roy, I mean, if you go to -- obviously, we need to be very careful about we don't reach the embargo on disclosing what is it that we're going to be presenting, et cetera, et cetera. So -- but if you or anyone goes to the EASL website today, you can see that there is an orange link and it will list all of the abstracts that were approved in the first round of acceptances that EASL did back in December. And there are some -- there's one on AB-836, our capsid inhibitor. And then there's 3 on aspects of 729, immunology of 729 and cytokines, et cetera. I cannot really say what we're going to be disclosing or including in the recently accepted 2 other presentations, which actually deal with 729. But I mean, as you will see, we are looking forward to presenting 836 data and as we indicated, including at least 3 cohorts. I mean -- sorry, Part 3, it will include everything because we made a disclosure back in December on Parts 1 and 2, but everything will be included. Yes, this is what was included in the -- basically, this is what was included in the design that we presented back in December. So Part 1, Part 2 and Part 3 will be included in the presentation. I'm now turning the call back to Bill Collier, CEO of Arbutus. We obviously appreciate your continued interest, and we especially look forward to providing further updates as we advance our clinical and preclinical programs and report additional data from our 729 and 836 clinical trials at upcoming medical conferences."
}