{
    "symbol": "PUK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 12:35:04",
    "content": " I'd like to hand over to you now to Anil, our new Chief Executive Officer, who's got some opening remarks. And then we'll go to questions from the floor, from the phones and then from the webcast. Thank you, Patrick, and good evening to everyone in the room and good morning, good evening for folks who are joining us remotely. I'm Anil Wadhwani, Chief Executive Officer of Prudential plc. And I've known Prudential as a competitor and I've always admired Prudential, because I have competed with them in every single market that Prudential operates in. Clearly, Prudential has a lot of strengths: the brand, the rich history of 175 years, great distribution, diversification, the trust and confidence of 18 million customers. Clearly, a lot of strengths, and as I said, in every single market they were a formidable competitor. What I get to the table is 32 years of experience in financial services, last five have been in Asia, leading a competitor both on the asset management as well on the insurance side. So I have operating experience in many of the markets that Prudential operates in and have a fair amount of knowledge in terms of both the opportunities and the challenges in the markets of Asia, in specific. This evening, this morning I have the pleasure of introducing my management team. So on my right James Turner, our CFO; next to him is Dennis Tan who runs the Singapore Vietnam and Thailand; Avnish Kalra next to Dennis, our Chief Risk Officer -- Chief Risk and Compliance Officer. Lilian Ng runs Greater China; Solmaz Altin runs Malaysia, Indonesia, Philippines, obviously manages our joint venture partnership in India, Africa and also is responsible for digital and technology. And together, we will be responding to your questions and I really look forward to the interactions this morning this evening. At this juncture, I also wanted to extend my sincere gratitude to Mark who is in the room with us. Mark has been absolutely superb in terms of his contribution over the last six years, but more specifically in the last 12 months. And his leadership has been instrumental in putting Prudential in a position of strength as we look to addressing the growth opportunities, specifically in the high-growth high potential markets of Asia and Africa. So on that note, I'm going to turn it back to Patrick and we can get rolling with the question and answers. In the absence of that specific instruction, I think its #1 if you are on the phones, to make yourself known on the phones to log your question. And if you want to put your hand up, and just identify yourself and your organization. Michael, was early Thomas was next â\u0080\u0093 Thomas goes first. A couple of questions, I think mainly on the Hong Kong business. And then maybe a question follow-up for James is the margin, when we look at the margin obviously first half second half last year there's quite a large difference. Thanks for your questions, Thomas. Let me tee it up with the MCV and the Hong Kong business question, and I'll pass it on to James for his comments on NBP margin. But before I answer the MCV question, specifically I just want to kind of step back and provide a bit of context in terms of how did we â\u0080\u0093 how did we create the momentum getting into 2023. And we saw traction on account of that in the second half of the year, as compared to the first half. That also led to a high level of agent activation, and it put us in a good position as the borders opened up. And once the borders open up, we have kind of seen the Mainland Chinese visitor traffic coming in. It's clearly not at the peak levels that we were accustomed to in 2018, 2019. Our estimate is it's about in the range of about 40% to 45% right now, but it's starting to have a positive impact on the volumes. Now unsurprisingly, the first set of customers coming in, based on at least what we are witnessing, is more towards â\u0080\u0093 skewed towards the affluent segment, and as a consequence of that the demand that we are seeing is coming through more towards the savings products. Having said that, I clearly understand that our emphasis is going to be on providing a diverse set of products, to address the diverse set of needs, including those of mainland Chinese customers and the momentum is going to complement some of the good work that Lilian and team did in the last year on the domestic market. So I'm going to stop there, I'm going to turn it to James to address the new business margin question, and then I'll probably also ask Lilian, if she has any further comments on the Mainland Chinese visitor customer. Thank you, Anil, and thank you for the question. So in terms of the Hong Kong margin, the thing to remember is that we're applying an EV methodology, and we're marking to market. So it's not â\u0080\u0093 at the half year, we mark-to-market at the half year. But when we â\u0080\u0093 under our methodology, we mechanically revalue the whole year at that year-end rate. Lily, do you want to add anything on, Mainland Chineseâ\u0080¦\n Yes. I think two points I just want to add, Thomas you mentioned about the domestic segment. I think what I said, in 2022 we've been able to actually grow our market share from half one to half two by doubling. In terms of the MCV segment, the early signs we are seeing. As Anil was mentioning, it's more on the affluent segment. Oh, go in the first. I'm going to stop there, and I'm going to turn it to Solmaz to provide some further insights. Thank you, Anil and thank you for the question. The next, I was going to allow someone else, but you did get your hand up first. Multiple questions in that, and I'm going to ask Lilian to provide you greater detail. But let me start by saying that, you're absolutely right. So, that was pretty strong given the environment that we were operating. You're right in saying that as the COVID measures get relaxed, you are going to see greater emphasis on agency and agency activation. I do want to kind of, before passing to Lilian, emphasize the fact that the structural demand drivers on Mainland are very much intact. So, it's really positioned well for medium to long-term growth. And again given our capabilities on the ground, we feel very optimistic in terms of addressing those customer needs. In China, I mean like in most of all our business, we have a diverse multi-distribution platform. So, on the bancassurance front, actually we work with 59 banks across 6,687 branches. So, we are actually blessed. We have a diverse portfolio of working across the national banks, the commercial banks, as well as the foreign banks. But having said that we also have -- are also building the quality agency force within China as well as in CITIC Prudential Life and we've been able to grow our MDRTs to 1,000 and agency productivity has grown 9%. So, taking that forward into 2023, we continue to actually ensure we have the relevant customer proposition to serve two areas, mainly protection as well as savings, in particular retirement planning. Lilian you may want to address the CMB question, I think Michael asked specifically. So, in China, bancassurance is an open architecture. So, we've been able to actually engage with in particular the Shenzhen branch of CMB and that's where we have been seeing a lot of growth in that area in particular in the GBA area. And second thing I think investors these days, they pay a lot of attention to the asset side. So, for our disclosure out of our $11.5 billion corporate debt in the shareholder-backed debt, I noticed there is -- 34% belongs to the financial sector. Thanks for the question. But in terms of priorities, clearly three of them. Obviously, there are going to be many, and I obviously will have to kind of get to that in due course of time. But if I have to simply pick three, its people and culture, our customers and our operating performance. And what I can tell is just based on my initial interactions with talent, they are highly committed, highly focused, highly energized to be able to write the next chapter of growth for Prudential. Michelle, thank you for the question. And that 34% of our shareholder assets, the way that it's split about -- that equates to $3.9 billion. 97.5% of those are investment grade, 95% are systemically important bank, so the big JPMorgan, Citi, yourselves et cetera. In terms of the banks that are in the spotlight so SVB and Signature, our exposure to SVB I think was around $1 million. Just one more thing to add that as you would expect from a company of our size scale and history, we have a very well-developed credit risk framework which relies on concentration risk, single-party limits et cetera to kind of cover the exposures that we see on a day-to-day basis. Just to clarify, I think it was 34% not of our group net assets just of those investment credit, investment credits, not the group, yeah. And also, I saw on the presentation slide, you have a slide showing the visitor numbers compared to 2018. Thanks for the question. Obviously, we have about 19,000 agents in our total force. Actually, 80% of them actually join us before the pandemic. So what I'm trying to say is during the pandemic, we have been able to continue to motivate and activate these agents. Now of that 19,000, around 10,000 are actually MCV-focused agents. I think, I'll turn it to James but I just want to say that IFRS 17 is an accounting change. It fundamentally does not change our business model, our strategy, our valuation, our operating free surplus generation. And it also â\u0080\u0093 on to that long list of things, it doesn't change, also it also doesn't change our dividend paying capacity, and our dividend policy. So for example, with profits things like that our terminal bonuses under IFRS 4, we'd have recognized them when they are paid. Now, they're accelerating and brought forward and added to our shareholders' equity. So from a timing difference perspective, there is both one-off impact. So when we sell new business rather than being able to recognize the profits under IFRS four immediately, we have to spread those over the lifetime of the policy. Let's open up the questions on the phones, please. Over to you, operator to let the first question through please. You touched on the Hong Kong agency, and how much damage might have been done through the pandemic. I seem to remember you're having about 24,000 agents in Hong Kong. So it looks to me, like you're trying to replenish from the lost agents in the pandemic. And I just wonder, if we could expand that discussion across the other main territories albeit briefly, I recognize, there's a lot of territories. And I'd imagine, there's a fair amount of competitive behavior amongst agency as well in terms of your competitors looking to pick up your agents. James, I'm assuming that, the quid pro quo of a lower IFRS 17 starting point from an earnings perspective is that we might expect faster growth in profits in future than we might have seen under IFRS 4. Thank you for your question. She did mention that we have 19,000 agents, but I think she can provide you a little bit of context in terms of where we are coming from, where are we and what's our plan to grow our agency force, specifically, in Hong Kong and then more broadly across the region. I think, what we see in terms of the attrition of the agents in Hong Kong is mainly outside of the industry. Obviously, during the pandemic, it's very challenging to actually acquire customers. As a result, they actually leave the industry. Now, obviously, we will continue -- as I mentioned 83% of them, we will recruit from -- of the 19,000 we have is actually still with us from 2019. So we're now, obviously, driving a recruitment to replenish. In 2018, 2019 on average, actually we recruit about 6,000 agents per annum. Now, for the overall agency in Asia and Africa, we actually see in 2022, actually recruitment is up by 9%. So the whole -- with the economic activity coming back up, other than Hong Kong, I think a lot of the markets actually opened earlier. We are seeing that recruitment drive and the productivity growth has been increased by 6%, so a lot of good momentum in terms of our overall agency in Asia. James, if I may pass it on to you for the IFRS. Blair, thank you for the question. So, look, in terms of the quid pro quo, really, the key point to recognize is the CSM, that's store of value. And you can see from the information in the deck that, that's going to be about circa $25 billion. So the profits are recognized over the service that is provided to the customer, which is typically the policy term. Let's keep going on the phone for the next question please, moderator. Thank you, very much. So the first question, I guess, is for Anil. I think, James mentioned in his slides, agency transformation in Indonesia. And then just one last one, if I may. In the CFO appendix slides, the reason I'm asking, this is there's a lot of noise in the market about the investment mix. So I just wanted to pick up on the slide, where it shows the corporate bond by rating profile. So, if I were to just step back, and just look at the diversification mix around geographies that we have 42% of our new business profits are contributed by Greater China; 53% is contributed by ASEAN and we have leading market positions in many of the ASEAN markets; and then we have India and Africa. Now there is growth opportunity in every single market and that was one of the reason, why we pivoted solely on the high-growth high potential markets of Asia and Africa. But if I were to simply pick up two China, obviously is exciting just kind of given the sheer size of China and the share size of the opportunity that we have there. India, again similar population as compared to Mainland, but a much younger population to that. And again, in both these markets, there is significant under penetration as we know, whether it comes to health wealth protection, savings, or investment needs. And we believe that, given our joint venture partnership across these two markets, we are very well positioned to be able to address those opportunities. On Pulse, and I will kind of steer it back to Solmaz. But I do want to preface it by saying, Pulse is part of our digital strategy. And the way, we think about our digital strategy is to solve for the pain points of the customers. And the moment, you do that the moment you create greater ease, greater convenience, for our customers and for our distributor partners, you end up winning market share in my experience. I'm going to turn it to Solmaz, and then we'll come back to your Indonesia and the investment mix question. Thank you very much, Anil, and thanks for the question on Pulse. So, our focus clearly is to create a better customer experience, every step we go and then increase operational effectiveness and efficiency going forward. Solmaz, you may want to answer the Indonesia question on agency transformation as well. Now important to note is that, we have regained the market-leading position in Indonesia this year in 2022. Now, in order to consolidate that position, we embarked on a transformation program, which we call Transformation for Accelerated Growth. And here we are addressing agency activation, our agency sales management, how we activate our agents and recruitment of agents of course. We're also looking into operations and claims, especially focusing again on customer value and shortening the time where customers have to wait for getting their claims paid and things like that, as well as expenses. So, it's a comprehensive transformation program in order to consolidate our market-leading position in Indonesia. So, Kailesh, it's James. Listen, thank you for the question. As I said earlier, I think that our balance sheet and our shareholder debt position is incredibly conservatively positioned. So first you asked about, what was our total defaults. In terms of the split, I think what I need to flag and you can -- as you say you referenced the elements in the CFO appendices is that of the total shareholder debt of $23 billion, $0.89 of that is investment grade, 55% of it is A minus and above. Of the amount that is below investment grade, that is largely made up of three buckets. As you know, the Vietnamese business has a -- sorry, the Vietnamese sovereign debt has a -- is not investment grade. And therefore, all of the corporate debt by definition is below investment grade. And we have some high yield in the US, but it's relatively minor in the scale of the $23 billion of total exposure. And as I said in response to one of the earlier questions, our losses have been really small. I think on the  to investment grade and not investment grade, we use independent rating stepping in terms. Back to the moderator, just to remind people how to log their questions please. Thank you, very much. But as I said, I am in week three and I will be getting to many things. And in the August time frame, we'll be more than happy to come back to you and share with you a much more granular strategic road map. But as I said, the short answer would be quality and quantity and not one at the cost of the other. Firstly, I just want to swing back to MCV. You mentioned your headcount, agency headcount movements. Well, interestingly we've seen that actually Anil's old shop is -- actually has a more aggressive plan than Prudential, especially given they have a much smaller presence than us. Thank you for your question. And on Hong Kong MCV, I'm going to ask Lilian to provide you greater color. But let me start by saying that coming in, I'm already looking at MCV very closely as you can imagine and seeing whether we have an opportunity to refresh our plans. We have 10,000 MCVs focused agents as Lilian mentioned. So, obviously, recruitment is part of what an agency force does. Of the 19,000 agents, we probably got about 8,000. So when -- what trigger an agents joining a company is the infrastructure, the platform, the products, the operations and we believe we have a very robust platform to allow our agents who are onboarded to actually deliver for the customers. And we would like to keep it that way, because it gives us ample flexibility in terms of addressing the different opportunities. Thanks Anil, and thank you for the question. And really, we're really crystal clear in three priorities. The first priority always is organic growth and funding that organic growth, because we see these amazing opportunities across the region, we've talked about some of them already today and ensuring that we can absolutely maximize that. The second is really in terms of strengthening our capabilities whether it is in customers, whether it's people, distribution, and really adding to our capabilities so we can accelerate that growth. And then third is just in terms of if there are strategic opportunities in line with our strategic intent, then clearly we've considered those as well. But the primary focus, stress is really on funding that organic growth and those organic opportunities. So, we would like to deploy capital where we have experience and there is potential to grow further. So, I couldn't agree more with James in terms of the way he's articulated it. So, I think look we have entered this new phase. Now, we've completed all of the transformations with an incredibly strong balance sheet that is focused really on taking advantage of the opportunities we have in front of us. Obviously, you need to try and forecast where interest rates are going, especially this year is going to be very, very challenging. Obviously, we've seen how rates have been rising over the last year or so. And especially after the events over the last few days, I think that next week's meeting will be pivotal in terms of deciding the cost of things from -- for the rest of the year. So, I would just say that I think we've just got to watch that space very carefully. I'd say -- the only thing I would add is that look we have a really diversified portfolio of products with health and protection, IOP, savings. The other thing is that if you look at our source of earnings, a significant proportion is from health and protection and that's not really impacted by interest rates. So, Wai-Kwong is right, I wouldn't like to try to guess the -- where interest rates are going to move even in the next week, let alone the next year. In Hong Kong to become an agent, they have to go for quite a rigorous examinations. And secondly, we also actually put through each of our new agent, or when they are candidates go through like, what we call, profiling to ensure that these are the right people in terms of wanting to do financial advice as a career. Now with that in place, actually the attrition rate is actually reduced to about 20% to 30%. But for those that hasn't gone through the profiling, obviously, that -- it's not -- the suitability test will help to get there. As I mentioned, during the COVID, the attrition rate is mainly due to they couldn't get enough business to sustain their income. And that's why we remain optimistic, because the COVID relaxation is going to result into agency activation, which is going to result into income for the agents, which in many ways is going to be the tool for us to drive better retention. And, Anil, if you bear with me, I've got to read out some questions on the web. So the first one was, the US banking exposure, I think, and so, what we said is that, there's a total in the shareholder debt portfolio of $1.1 billion, 97.5% of that is investment grade, 95% is in systemically important banks. So, in terms of 150%, that's the risk appetite. It's a dynamic risk appetite, where what you're seeing is that, we have 302% capital ratio and that's the associated capital ratio regarding that risk appetite. And on the third question, we won't get into market-specific dynamics in terms of growth. Suffice to say, as I said, the greater relaxation on account of the COVID measures abating will result into agency activity, not only in Hong Kong and Mainland, but more broadly across the Asian markets. And we've already signaled to you, in terms of the positive impact that we are seeing on account of the MCV or the -- at least, the initial flow of the MCV customers coming into Hong Kong. We are on a consolidated level, still number one in absolute premium when you combine the convention and the Takaful footprint. We have seen strong banker growth in Malaysia over the last year and the numbers when you look at it after the medical repricing one-off effect in 2022, we have dropped in APE by about minus 2%. The market overall dropped by 6% and in conventional by minus 9%, so comparing that, we did actually quite well in Malaysia. And the first two months, looking at the overall guidance of 15%, we will see some momentum in Banca continuing an agency as well. I think obviously in our business, we ensure we have a comprehensive customer proposition across from savings protection, as well as retirement planning. So, what we are seeing is actually there is still a demand for health and protection. I think subsequent to the change of regulation in critical illness in 2021, we continue to refine our product, our critical illness in 2022. And we have seen as a result in actually our GPA area in Guangdong alone, about 27% of our APEs coming from this critical illness product. The other exciting piece that we are looking at is actually driving our retirement planning proposition, which is at the back of the Pillar three pension, which is to help people to actually save for retirement. In CITIC Prudential, we have around 22 products that actually address retirement planning. And the second one on margins is specifically to the MCV market, whether or not, what's the margin outlook for this business and the momentum for this business. So, let's start with lapses. I mean, what you've seen in this business now for a number of years is incredibly resilient persistency. It stayed around 89%, 90% and that hasn't changed. So we're not seeing any -- all the way through COVID, all the way through all of the disruption, we haven't seen any disruption to our persistency levels. In terms of sensitivities, you've seen those in the deck. They are clearly from an MVP perspective, we are -- we do have economic sensitivity for the reasons that I mentioned before. And before I ask Lilian to comment on MCV margin, historically as we know the margin on MCV has been higher. I did mention in my earlier comments that the initial set of demand that we are receiving across the border is coming in the savings product, which tends to be lower margin as compared to health and protection. And if you think about health and protection, those typically take a longer duration in terms of the sales cycle as compared to the savings product. But as I said, the focus for us and for Lilian's team is to ensure that we have the entire range of products addressing the diverse needs of customers across savings health, wealth and protection. So, obviously, the margin is driven by a combination of sales and the product. So -- and also what we are seeing in the early stage of MCV, we see the case size has actually doubled pre -- before the COVID. But having said that, in terms of the number of policies, actually 50% of those MCV customers continue to take up in health and protection product as well. Conscious of time, we've got seven minutes, six questions on the phone. On the phones, let's go to the next caller on the phone please moderator. Your line is now open. Very nice to know that you're here, Anil. There have been some regulatory changes impacting the tax benefit of products, but also allowing licensure to sell more products. And then lastly, a quick one. Sorry, I didn't get the second part of the question. Large population, very similar to China Mainland, significant underpenetration. I did mention that, I will be reviewing our strategy and our operational capabilities between now and over the next six months. And we will come back to you with a strategic road map in terms of how do we want to kind of grow our business forward both across Asia, as well as Africa. If that was a question, I'm happy to explain that first. Now in the bill, it's currently only a bill, and the final implication will be only crystallized once the act is passed. Our understanding is that, the policies sold until the 31st of March will be outside of the scope and the only policy sold from April 1, 2023 will be covered. And if the total annual premium paid for not unit-linked policies exceeds INR 500,000 then the difference between the total benefits received and premium paid would be subject to tax as other income is. And also, understanding is that the debt benefit would not be considered in this computation. So in this context, as it's closed in our results the APE product mix for the nine months financial year 2023 were well diversified with 41% unit-linked about 20% protection and 6.3% annuities. We wish to bring to your attention though that the share of business of non-unit-linked proceeds with annual premium of above INR 500,000 is just approximately 6% of the total APE. So, on a practical level this business is not expected to go away completely. Hence, the net impact on the business is expected to be trivial. And going to the Macau question, I think before, I ask Lilian to provide the update on that one, we're firstly delighted to have the Macau license. And we believe as the regulation evolves GBA, clearly is, an opportunity that we would be keen to address. So as I said, we are looking forward to the launch of our business in Macau in quarter two. Absolutely, I think we're now just doing the company registry opening bank accounts, it will launch in quarter two. One thing, I want to highlight obviously Macau we are there to the 680,000 people of Macau. And also remember, the MCV traffic is about $1 million a month. I'm conscious that, we're more than out of time, but we still have some on the phone. Your line is now open. So, we don't give a breakdown by margin -- by geography. So, that will give you a flavor where we're adding the most value. So, we've got very robust levels of liquidity. Clearly, we don't need anymore. Your line is now open, please go ahead. So, Jackson we've already -- we made a commitment to reduce our exposure to below 10%, which you know we did. Inorganic we will always look at opportunities that match our IRRs, but we've been very focused that our capital allocation is primarily focused on organic growth and then filling in capabilities. It's a good regime this one, right. Your line is now open, please go ahead. So, IFRS accounting change obviously coming through. So, 70% is from banca 43% margin. So, I think the first question was the -- and I thought I'd escaped an EV/TV question, but EV/TV -- the headline is I hear you, our focus has been on IFRS 17 and making sure that we get IFRS 17 over the line. And clearly as interest rates increase, the differences between EV and TV actually reduce. So, that's a very specific question. Second two, -- the next two on capital. And then just finally on capital, your capital ratio is in the 300% on the GWS basis. James, why don't you answer the capital question and then we can go to the bancassurance question to Lilian. And you asked about the discounting, sorry, you asked about interest rates. So look, however, you -- wherever you start, we've got a really strong balance sheet that 302. We've had significant increases in interest rate, huge reductions in equity, volatility, credit spreads increasing. On the value that bancassurance bring, I think obviously bancassurance was actually -- given the COVID restriction was our bigger channel in 2022. But having said that, we also bring in a 15% growth in NBP in terms of value. What's good to know is our two large regional bank partnership bringing for -- SCB bringing about 30% of our bancassurance value and UOB actually bringing 15%, 16% of our value into bancassurance. And just to add to Lilian's point, if I look at the penetration rates of insurance into the customer base of our bank partners there is still a lot of runway. Andrew, your line is open. Firstly, you talked about changing product mix in Hong Kong being having a disruptive effect in 2023. Thanks for those questions, Andrew. So, let me get to the CITIC JV. As I mentioned, China Mainland is obviously a big focus area for us. On the change in product mix, as I said, the initial flow that we are getting from the MCV customers coming into Hong Kong is in the savings category. However, Lilian did emphasize the fact that 50% of the policies are savings and 50% of the policies are H&P and typically the H&P sales cycle is much longer than the savings product. It's also the kind of profile of customers Andrew that, we are getting across the border initially. And as I said, it's still early days, and some of this is likely to evolve as we move forward. But our emphasis is to provide diversified product suite, to address the diversified nature, or the diversified needs I should say of our customer base in Hong Kong and elsewhere. Obviously, there's a scope for follow-up questions on Monday face-to-face with Andrew, if we've rushed and misheard anything. Thank you, Patrick, and thank you everyone. And as I said hopefully, I've been able to convey that excitement. In terms of both the growth opportunity, but how Prudential is positioned to be able to address these opportunities across the Asian and the African markets. My focus right of the back would be people and culture, our customers and are operating with them. I'm sure, we've been able to kind of answer most of your questions, but if you would like more texture and more color, we would love to engage with you further after this call. This is great, because this is the first time in the last three years that we've done a face-to-face meeting."
}