{
    "symbol": "CSL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 22:02:07",
    "content": " At this time, I would like to welcome everyone to the Carlisle Companies Second Quarter 2022 Earnings Conference Call. I would like to turn the call over to Mr. Jim Giannakouros, Carlisle's Vice President of Investor Relations. Good afternoon, everyone, and welcome to Carlisle's second quarter 2022 earnings conference call. We released our second quarter financial results after the market closed today, and you can find both our press release and earnings call slide presentation in the Investor Relations section of our website, carlisle.com. Today's call will begin with Chris giving an update on our progress and achieving our strategic plan, Vision 2025, highlights of our record second quarter and a discussion of current trends. But before we begin, please refer to Slide 2 of our presentation, where we note that comments today will include forward-looking statements based on current expectations. As Carlisle provides non-GAAP financial information weâ\u0080\u0099ve provided reconciliations between GAAP and non-GAAP measures in our press release, and in the appendix of our presentation materials, which again are available on our website. Good afternoon, everyone and thank you for joining us on our second quarter 2022 earnings call. As we enter the third quarter, we continue to operate in a highly uncertain environment, which has been the case each of these past three years. In addition to an ongoing global pandemic, tight labor markets and supply chain constraints, we are now seeing the global impact of the ongoing war in Ukraine, rising interest rates from a Federal Reserve concern with record inflation, and the uncertain outlook for the American consumer. Despite this challenging environment, I am very pleased with the outstanding performance out teams delivered in the second quarter. As a result, in the second quarter, we delivered another record performance including revenues, EBITDA and diluted EPS which moves us closer to delivering Vision 2025 including achieving $15 of earnings per share three years ahead of plan. In addition to our world-class team and proven business model, weâ\u0080\u0099ve relied on a strong balance sheet and excellent cash flow generation to provide both financial and strategic flexibility to execute our Vision 2025 roadmap. In the second quarter, we delivered 42% organic revenue growth and adjusted EBITDA growth of 146%. Utilize the Carlisle operating system, we use the Carlisle operating system to consistently drive efficiencies and enhance operating leverage by targeting cost savings of 1% to 2% of sales annually. With almost one year since our Henry purchase, the team continues to execute extremely well on delivering a smooth and efficient integration and is on pace to exceed our initial synergy targets of $30 million. We remain excited about acquisition prospects within the building envelope and we are working an active pipeline of opportunities to augment our newest segment, CWT in a variety of construction products related verticals. In the second quarter, we held our week long Annual Leadership Summit with the current and future leaders of Carlisle with the aim of developing the next generation of leadership, while reinforcing the high standards expected of Carlisle leadership, we also discussed and developed ways to honestly assess our business performance and debated changes to facilitate continuous improvement in the organization and to enhance Carlisleâ\u0080\u0099s future performance. Turning to our 2022 year-to-date actions, weâ\u0080\u0099ve made capital investments of over $80 million into our businesses, made share repurchases totaling $175 million and paid approximately $57 million in dividends in 2022. Re-roofing demand continues to be a reliable, significant and sustainable driver for growth at CCM as we continue to seek more efficient of energy as a nation, increased amounts of insulation have been added to the re-roofing system which expands our served market and increases the value of the roof to building owners. In fact, over the past decade the ratio of insulation to single-ply roofing membrane board feet increased an estimated 40%, clearly demonstrating the annual increase in insulation consumption. This rising demand, coupled with our position as a key provider of energy-efficient solutions for buildings sets up CCM very well for additional growth. Adding to these positive trends, we also expect continued high levels of backlog for the near future, much of this due to COVID-19 issues in 2020 and exacerbated by supply chain disruptions and labor shortages in 2021 and 2022. Second, under the guide of Vision 2025, we continue to earn premium pricing in the marketplace by providing significant value to our customers through what we call the Carlisle Experience. Our continued and growing investment in new product innovation, the energy-efficiency benefits of our building envelope systems, our world-class manufacturing and distribution facilities and best-in-class customer service encompass the value proposition that our contractors have come to rely on from Carlisle. Contractors in the other one they order from us, theyâ\u0080\u0099ll get energy-efficient building solutions of the best quality in the right amount at the right place and at the right time. The solutions within CWT now include Henry, Carlisle Polyurethane Systems and Carlisleâ\u0080\u0099s legacy Diversified Products. Given the success of Henry and the establishment of this new segment, we are actively seeking similar, but larger tuck-in opportunities to enhance CWTâ\u0080\u0099s already significant capabilities. Four, since launching Vision 2025, weâ\u0080\u0099ve remained focused on being a disciplined and superior capital allocator. This approach includes investing in organic growth, returning capital to shareholders in the form of dividends and share repurchases and as I just mentioned, continuing to seek accretive acquisitions that enhance Carlisleâ\u0080\u0099s ability to create value for all our stakeholders. Notably, we anticipate this August will mark Carlisleâ\u0080\u0099s 46th consecutive year of annual dividend increases. With our pivot to building products, and the accelerating demand for energy-efficient products in the broader market, Carlisle is enabling a more sustainable planet. Carlisle will help deliver a net zero future by supplying innovative energy-efficient products and solutions, while reducing greenhouse gas emissions and the amount of construction materials and landfills. One recent project to support this net zero mission includes the purchase of $1.6 million worth of equipment to recycle production scrap at our Dixon, California EPS plant. And more broadly, Carlisle is targeting the incorporation of more than 1 million tons of recycled materials and production scrap into our production stream by 2030 diverting their material from landfills. Additionally, we continue to make significant strides towards aligning our GHT reduction strategy with the Science Based Targets Initiative or SBTI. Adjusted diluted EPS increased 185% year-over-year to $6.15 driven by higher volumes, price, Henryâ\u0080\u0099s contribution and lean sigma initiatives, which more than offset inflation and operational disruptions. CCM delivered an outstanding quarter weathering challenges across its supply chain, pervasive inflationary pressures and labor constraints. CCM drove solid top-line growth due to continued strong demand, favorable product mix, new product sales and captured price earned by delivering on the Carlisle Experience. Moving to Slide 9, sales accelerated in the second quarter at our newly created segment Carlisle Weatherproofing Technologies where revenue increased over 23% year-over-year on a pro-forma basis. Growth continued across all product lines despite supply constraints, which began to ease in the second quarter versus earlier this year. As I mentioned earlier, the CWT team is executing well on a multi-faceted integration plan and is leveraging volume growth on plan. We are encouraged by the TSA checkpoint numbers that show domestic air travel is nearing 2019 levels, driving increased demand for narrow body aircraft and eventually wide bodied aircraft as international travel returns to pre-COVID levels. We do expect many of these influences to begin to abate in the second half of 2022, setting the stage for higher profitability. We remain confident that commercial and operational improvements, combined with growing backlog will deliver strong revenue growth and incremental margins in the mid-40% range this year and as we continue to make progress towards our goal of 50% plus incremental margins in the coming years. And with that, Iâ\u0080\u0099ll turn it over to Kevin to discuss some additional financial details and our updated outlook for the remainder of 2022. EPS growth in the quarter was driven primarily by price, volume and mix more than offsetting the negative impact of materials and labor inflation. Carlisle ended the second quarter of 2022 with $353 million of cash on hand, with cash generated from continuing operations, totaling $181 million. Capital expenditures of $52 million, share repurchases of $50 million and dividends paid of $28 million during the quarter. Our net debt to EBITDA ratio is 2x, down from 3x at the end of 20201, which as a result of the Henry acquisition was elevated compared to our target net debt to EBITDA range of 1x to 2x. However, for the right acquisition, we will take on additional debt and through earnings growth and debt reduction, drive our net debt to EBITDA ratio back to our target range within one to two years. Given our anticipated repayment of $350 million senior notes in the second half of 2022, and expected EBITDA growth for the balance of this year, we expect to reduce our net debt to EBITDA ratio to approximately 1.5x by the end of this year. At CCM, as Chris mentioned, we are seeing strong re-roofing and new construction demand, as well as increasing interest in our energy-efficient solutions. We now expect total revenue growth at CCM to be approximately 40% in 2022, up from our previous estimate of approximately 30%. At CWT, we now expect revenue to grow approximately 60% year-over-year including 20% organically. With integration efforts tracking above our deal model, we reiterate our accretion target of $1.50 for 2022. At CIT, we are encouraged by growing backlogs in both our aerospace and medical businesses, and thus increasing our revenue guidance to approximately 20% in 2022, up from our previous estimate of low double-digit growth. At CFT, with orders coming in as expected, and with positive pricing and new product sales ramping up, we continue to expect approximately 10% revenue growth in 2022. Finally, on a consolidated basis for Carlisle, we now expect to deliver revenue growth of approximately 40% in 2022. Given the strong fundamentals across our businesses, staying ahead of inflation with proactive pricing actions and driving strong leverage through COS, we expect total Carlisle adjusted EBITDA margins to expand approximately 650 basis points in full year 2022, up from our previous estimate of approximately 500 basis points. I want to express again how pleased I am with the outstanding performance delivered by the entire Carlisle team this quarter and thank them once again for their perseverance, especially as we operate in this challenging and uncertain environment. Despite these challenges, the Carlisle continues to deliver our culture of continuous improvement, focused on delivering results in an environment of mutual respect and trust. As a result of solid fundamentals across all of our businesses, our outlook remains optimistic for the rest of 2022. If you looked at total Carlisle, weâ\u0080\u0099ll say a third of the increase is related to over a third year-over-year growth is price and â\u0080\u0093 or volume, sorry about that, a third is volume, two-thirds is price. And for CCM and CWT, it would be great to hear how orders trended through Q2 and into July and whether price inflation general macro concerns, any other factors have started to impact the strength of runrate demand. You can see more changes, I think the 75 basis point increase today was received well, but obviously thatâ\u0080\u0099s going to have some impact and I know there is concerns in the market as to whether the 75 basis point increase will tap down demand but not do anything because things like supply chain issues for the rest of the year. So, look when we look at what our world looks like on a very North American kind of sector basis and construction with CWT and CCM as you said in our core non-resi business, look, you are right, we â\u0080\u0093 under our and what we were running an MSP program which is basically an allocation program this year tap all contractors that get some product we are out till the end of the year. So, we see those the current demand is continuing into Q3 and into Q4 obviously, we always are a little bit conscious of the fact that Q3 has burned us before weather with something like a hurricane, I think in 2018 that might have affected like in 2017. And then we have weather affecting obviously as we get close to the winter and we like a warmer fall, so that we keep more days on the roof. Obviously, we are lapping price increases that occurred last year. When we look at CWT and the new Weather Proofing Technologies group, really good trends there that I think even if we look at something like the home center market. I mean, Iâ\u0080\u0099ll just go back to, I am familiar with to say 2014 and theyâ\u0080\u0099ve continued to do things like increase the content of their products on the shelves and â\u0080\u0093 but able to pass on pricing. But the big things for us going forward remain on the supply chain side, can we get enough product to continue to maximize our capacity and address the demand thatâ\u0080\u0099s out there and then obviously labor constraints remain. I think they are going to be there for a while and with the supply constraints and with the labor constraints, it just sets up that this backlog probably doesnâ\u0080\u0099t get resolved right away and continues on into 2023. So, I think overall for us, pretty positive outlook for the remainder of the year and then hopefully continues into 2023. And in terms of Henry, you mentioned supply constraints, is that what has led to â\u0080\u0093 what I am assuming is a bit of conservatism and not taking up the accretion guide. You are pacing ahead, I realize there is more seasonal variability going into the fourth quarter, but with the synergy plan ahead run rate growth being very solid. And I think some of that conservatism is well founded in the fact that we donâ\u0080\u0099t know them as well as we know our core businesses and while the team is doing a great job and providing great information and insight and just doing a heck of a job on the integration, I think, that sets right. But yeah, overall, as I think I pointed out on the volume being one-third and price being two-thirds, you should be able to do the math off that piece of it to get to the 650 basis points. Saree, as we look out, I think there are two vectors here on insulation are for one is just a simple one we highlighted and I think if you think about just what we talked about that the board feet of insulation to membrane up 40% over the last ten years, that gives you an idea of what that trajectory looks like. There is not a lot of places that are just not doing it, but as we begin to get people more educated, and they see the benefits of this, I think that rate will continue. And I think the other thing is we have to look at new technology, polyiso and EPS have been around for a while, and our teams are working on, every day the next-gen or generation of both membranes and insulation. And we think there are some interesting concepts out there that could increase our value, reduce time of installation, which is a big deal, obviously out there for contractors and so, improve the efficiency of our entire system. So, I like that run rate right now that without any new technology that we've shown over the past ten years, I think that continues. And then, as we add new technology, that could really accelerate things from a dollar perspective and from a volume perspective. I just mentioned it with Saree there, a great question she had on what the future of insulation is and I think that's one of the areas that we are going to look at is how can we get better insulation, more efficient insulation to increase our value, decrease labor content per square foot installed. We're really looking to help the contractor get the job done more efficiently, more effectively so they could take on more work and also use their labor more effectively. If you look at a couple of products that we've introduced in the last couple of years that I think are just outstanding products and are quite innovative, one is our APEEL product, where we are - got a piece of TPO membrane installed. In the past, without that, with all the workers that are on the roof and people installing things, you'd get a lot of dirt and they'd have to haul up pressure washers and things like that to clean it off and it just meant more labor, more time on the roof, more expense for the contractor. So, that's another one where we were able to complete a job in a difficult situation, please the end-user and make it easier on the contractor to get the job done, get off the roof and move on. So those are a couple of examples I could keep going on, but that's probably enough for you to get an idea of the type of new products we're putting out there. But again, it really centers on improving the quality of the system, increasing the energy efficiency of the system and getting the contractor off the roof as quickly as possible allowing them to move on and make more money. But what I will say is obviously, inflation on the supply chain side as much as we thought it would abate by this time, we are still seeing inflation in raw materials in the second quarter. People are looking for more wages to offset the increases in healthcare costs or gasoline and community to work or things like that, rents and things like that. So those four buckets, when you look at those and the impact they have on our customers and on our factories, those are the ones we focus in and they really haven't changed. There is still â\u0080\u0093 well, as you can see by what the Fed has done, they are still pretty high. So availability got a little bit better in some areas and I think that â\u0080\u0093 you see that manifested itself in a little bit higher sales because obviously, if â\u0080\u0093 with the orders we had in the backlog, if we can get the raw materials, we can produce more product and get it out the door. In terms of raw material pricing, again, we've said this now for a while, but I'll just reiterate it is we are really â\u0080\u0093 you can see this with these new products, and you can see it with our philosophy in the Carlisle Experience, we are really pricing to the value of the products in the market. So, if we see a reduction in pricing in the â\u0080\u0093 I don't see it happening this year, but if it happen next year, I think we are going back to that's a separate function on raw materials than it is. They provide a lot of value, and it's really our job to take that value and explain it to our end-users or contractors, architects or distributors, get them to understand that, that's a price you want to pay for that product because of the value it's returning. We're launching the 16-foot wide TPO membrane into the market here and when you think about what it's going to do for the contractor in terms of labor saving and efficiency, my guess is that people will be willing to pay a premium for that product and not be as connected to raw materials on that, again because we'll be able to show the value and demonstrate it to the buyer. So right now, with the raw material supply, obviously, in the tight labor markets, when we look at CWT as a whole, the order backlog remains strong at the consolidated level. I think it's durable and I think that we will see some â\u0080\u0093 obviously, some issues there with resi construction as interest rates rise. I think that might help the raw materials catch-up, get a little relief there and then 2023 still looks pretty positive for us. Demand has been pretty good right across the board, everything from architectural metals, to insulation, to commercial roofing. If you look at the different membranes, EPDM, PVC, TPO, I think those are all doing â\u0080\u0093 they are doing a great job there. I think right across the board, it's still good across everything. And the reason I think that is, is because obviously, we've got this pent-up demand that came with COVID. But I don't really think there is anything in the foreseeable future, like I said in the beginning that we see back half of 2022, strong. Again, there are issues out there on inflation, that's keeping pressure on supply, supply chain might be a little bit better, but probably not completely resolved and we still see demand being strong. And then on the CWT side, I think you guys mentioned the acquisition pipeline a few times in the prepared remarks. Yeah, well, without going into anything too confidential, we don't want to tip anybody else off of our competitors. We look at increased products that could help us in the professional market where we are seeing the Henry team begin to integrate with the CCM team and spend more time at architects and we've got some great products on the Henry side, like the Blueskin, wraps and things like that. It's a small business there in California, but adds some unique value to us and some unique products, and we think that team is doing well. So, I'd say there's plenty of places for us in the Building Envelope to leverage the Carlisle Experience, to leverage our presence in the architectural community, to find brands that can help us penetrate different channels and really just be a more comprehensive solutions provider to the contractor, to the building owner, and to the architect. But you're bringing on, I think, some TPO capacity next quarter and you've got some polyiso come on next year and probably a bunch of other things that I don't have in front of me. We still have some capacity out there that we can utilize when we get raw materials and as you saw in the second quarter, we were able to do that and continue to increase volumes. Then Carlisle PA and obviously, that's going to add some capacity in the industry or to the industry and to us. And then Sikeston, obviously, we've got a new factory going on there and we have the possibility of putting two lines in there. And so, without being too â\u0080\u0093 exposing too much of our strategy on capacity, that one or two lines can change the total amount of capacity that we put into the market. But the other thing I would tell you is, even though we won't have time for a technology discussion today, your comment on solar - we've already embedded solar into roofs. We actually had an organization within Carlisle that did that, and it worked pretty well until the tax environment went away and it became unprofitable for people that were installing those roofs. Yeah, and as far as the capacity to kind of help you, David, it's our sixth â\u0080\u0093 itâ\u0080\u0099s the TPO manufacturing line number 6 that's getting fired up this year. And then second question, just maybe somebody should ask about CIT, I guess, you mentioned, Chris, in your prepared remarks that you expect margin headwinds to abate in the second half. So, I just wanted to see if you could elaborate a little further on that. We've done a lot of restructuring over the last couple of years in that business and as the airline travel is coming back, we are seeing the production of planes coming back, and that's going to be a positive to us. We just â\u0080\u0093 we got a big investment we've made in Tijuana, that's a beautiful facility down there. So as that eventually ramps up, that's going to be a big positive for us. David, we used to talk about prior to COVID and then also prior to our switch to EBITDA, we used to be aspirational to 20-plus percent OI. Just wondering on the CCM side, with the â\u0080\u0093 what you've had in terms of the growth north of 50% for the first half of the year and the talk of 40% through the full year that sort of implies significant slowing to about 25% in the second half. That piece as well as â\u0080\u0093 so pricing, we had more pricing in the second half of last year than we did the first half of 2021. So, as you look at comps, we are not going to have as much year-over-year improvement. And we also have volume, as well, Dan, when you think about 4Q was a record 4Q 2021. Volumes really ripped and that's where the acceleration really started coming into 2022 and so, it's both comps on both price and volume that is reflected in the updated guidance. Well, this concludes our second quarter 2020 earnings call."
}