{
    "symbol": "CSL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 21:48:02",
    "content": " The third quarter of 2022 was another superb quarter for Carlisle, as our teams across the globe continued to deliver on the Carlisle experience, utilized our continuous improvement culture to improve our processes and leveraged our position as a preferred supplier of solutions to our customers, from order entry to deliveries, to writing specifications, to the ongoing performance of our products in the Building Envelope. Turning to our 2022 year-to-date actions, we've made capital investments of over $130 million into our businesses to drive innovation and the Carlisle Experience is exemplified by the third quarter launch of our first industry-leading 16-foot TPO line in Carlisle PA and we remain on track to deploy $175 million in capital expenditures this year. This performance was driven by continued strong demand in US commercial roofing capturing price earned by delivering on the Carlisle Experience and new product sales, partially offset by what we consider near-term softness in our Architectural Metals business, potentially more persistent challenges in our European business due to the effects of a recession and ongoing energy crisis and unfavorable impact from changes in foreign exchange rates. Our outstanding third quarter demonstrates Carlisle's progress towards achieving our goals as laid out in Vision 2025, including delivering $15 of GAAP earnings per share three years earlier than originally contemplated. And I think it's just a great example Bryan, I'm glad you asked it, of one of these ways that we're going to seek to maintain that Carlisle Experience and obviously the margins that come with it where we're pricing to value because that 16-foot line is taking labor off the roof. But I think the real power for us comes in connecting with the contractor, understanding the voice of that customer, and for products just getting the job done with better quality, faster so they can go on, be assured of a high-quality warranty roof that they could pass on to the building owner, and it's going to last have confidence in that and then get on to other jobs and get them done faster. And then you didn't mention this, but the Carlisle Experience and the customer experience, we're excited to have a more direct connection with the contractor through some technologies we have that hopefully will bring out in the next year or so that will help them do a better job of tracking shipments, will help them do a better job of understanding what they have ordering doing things like that creating those materials so that they can again work more efficiently and use their labor more effectively. Hey, good afternoon everyone. Hey, good afternoon everyone."
}