{
    "symbol": "WFRD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 11:33:04",
    "content": " Revenue grew year-over-year by 19%, the highest growth rate in over 10 years and perhaps most notably, we generated positive net income of $26 million, another first in over 10 years. Full year 2022 revenue of $4.33 billion grew 19% as all segments experienced growth with adjusted EBITDA of $817 million or 18.9%, adjusted EBITDA margin, a 320 basis point improvement. Adjusted EBITDA of $266 million in the fourth quarter increased 24% sequentially and 73% year-over-year with adjusted EBITDA margin of 22%, a sequential improvement of 290 basis points. Drilling and Evaluation or DRE revenues of $371 million increased by $23 million or 7% sequentially, mainly driven by higher volumes and price increases for drilling services and higher wireline and managed pressure drilling activity in Latin America and Middle East, North Africa, Asia regions. Segment adjusted EBITDA of $111 million increased by $26 million or 31% sequentially, leading all segments with Q4 adjusted EBITDA of nearly 30%, 550 basis points higher than Q3. Well construction and completion or WCC revenues of $403 million increased by $12 million or 3% sequentially, primarily driven by higher cementation and liner hanger products in the Middle East, North Africa, Asia and Latin America regions. Segment adjusted EBITDA of $87 million increased by $9 million or 12% sequentially, largely due to higher fall-through and execution efficiencies for cementation and liner hanger products in the Middle East, North Africa, Asia and Latin America regions. Production and Intervention or PRI revenues of $407 million increased by $50 million or 14% sequentially, primarily driven by higher international pressure pumping activity along with higher artificial lift activity in North America. Segment adjusted EBITDA of $88 million increased by $22 million or 33% sequentially, mainly due to higher margin fall-through for pressure pumping overall. Adjusted EBITDA margins for the first quarter of 2023 are expected to decline by 150 to 200 basis points, compared to the record fourth quarter we experienced in 2022, which was augmented by catch-up pricing adjustments."
}