{
    "symbol": "SXC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 16:35:23",
    "content": " During the second quarter, we also announced the signing of a nonbinding letter of intent with U.S. Steel that sets out the principal terms and conditions upon which SunCoke will acquire U.S. Steel's Granite City blast furnaces and build a 2 million-ton per year granulated pig iron facility with a 10-year initial term. Recognizing both record first half performance and softening in export coke market conditions for the second half of the year, we are increasing our full year adjusted EBITDA guidance to $270 million to $285 million from our original guidance of $240 million to $255 million. The second quarter net income attributable to SunCoke was $0.21 per share, up $0.32 versus the prior year period, primarily driven by the absence of a $0.27 per share impact of debt extinguishment-related charges in connection with the refinancing in the second quarter of 2021. Second quarter adjusted EBITDA was $64.3 million, and we sold just over 1 million tons of coke. The $2.9 million increase in adjusted EBITDA as compared to same prior year period was mainly driven by higher margin on export coke sales, partially offset by lower coke sales and production volume. Given our record first half performance but also recognizing the softening export coke market conditions, we are increasing the Domestic Coke adjusted EBITDA guidance to $247 million to $255 million from original guidance of $229 million to $235 million. Given our strong first half 2022 results and an optimistic outlook for the balance of the year, we are increasing our Logistics full year adjusted EBITDA guidance range to $48 million to $52 million. Finally, based on the reliability and performance of our operating segments, while factoring in export market conditions in the second half, we look to achieve our revised adjusted EBITDA guidance of $270 million to $285 million for 2022. If I'm looking at the Domestic Coke business, your adjusted EBITDA per ton was $79 in the first quarter, $64 in the second quarter."
}