{
    "symbol": "SXC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 13:23:05",
    "content": " Additionally, we returned almost $24 million to our shareholders, having increased our quarterly dividend from $0.06 per share to $0.08 per share during 2022, which we anticipate will continue in 2023. Our full year 2022 net income attributable to SunCoke was $1.19 per share, up $0.67 versus the full year 2021, driven by our strong operating results, the absence of debt refinancing related expenses and lower interest expense. The Domestic Coke segment delivered full year adjusted EBITDA of $263.4 million, well above our full year revised Domestic Coke guidance range. With the backdrop of a strong commodity market, the Logistics segment delivered full year adjusted EBITDA of $49.7 million. Finally, our Corporate and Other expenses were higher by $1.2 million year-over-year, mainly due to higher employee related expenses, partially offset by lower non-cash legacy liability expenses. In total, we ended 2022 with a cash balance of approximately $90 million and strong liquidity of approximately $405 million, setting the stage for continued progress against our capital allocation priorities in 2023. Domestic Coke adjusted EBITDA is expected to be lower by $22 million to $30 million, driven primarily by our expectation of lower price realization on export sales due to market conditions. In 2023, we estimate our Domestic Coke adjusted EBITDA to be between $234 million and $242 million, with sales of approximately 4 million tons of contract, foundry and export coke. While we expect to continue running at full capacity, the lower year-over-year adjusted EBITDA is primarily due to lower price realizations on export coke sales based on current and future expected market conditions. We anticipate our CapEx requirements in 2023 to be approximately $95 million, which includes the foundry coke expansion project. I think you have described this a little bit in your prepared remarks, but the Brazil Coke segment again kind of down $5 million to $6 million on the EBITDA side, the expiration of those technology fees."
}