{
    "symbol": "IRS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-10 16:47:03",
    "content": " Regarding the real -- the sales of our tenants, we can see an evolution increase that is 322% above last year, but last year was really very affected by the pandemic. So if we compare with the 2020 -- the fiscal year 2020 pre-pandemic levels that level -- that number is 10.7%, below in real terms. And if we see the trend when we compare the fourth quarter against the first quarter of this fiscal year, we saw last year or the last quarter at levels -- the evolution was levels of 55% below. And if we see the financial results of this quarter, we see -- we finished the first Q with a loss of ARS1 billion attributable to our controlling interest ARS600 million compared with last year with a gain of ARS12.7 billion. So if we compare -- or if we analyze the main effects on this quarter, we can see first of all line four, the change in the fair value that we posted a loss of ARS6.5 billion compared with a important gain during the last year of ARS36.7 billion or during fiscal year 2020 of ARS18.8 billion. The other important effect is in line nine that we will -- I will comment later, the net financial results that we see again against a loss last year. The income tax we see for the first time during the last years, the current tax that is related to our subsidiary IRSA Commercial Properties that if we approve the merge, this will disappear, because IRCP will use tax grades of IRSA, so we won't have to pay taxes. But if we compare with the previous year, adjusted by inflation we are 35% below in this quarter -- of the first quarter of fiscal year 2022, we still have some concessions to our tenants because of the pandemic. So when we enter -- when we analyze the evolution of our NAV, we can see here that net asset value at the book level so how we are recognizing in our books is still -- or is almost $1.2 billion, compared with our debt that give us an LTV of 21.9%."
}