{
    "symbol": "IRS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-14 15:07:19",
    "content": " In Page 8, we can see the disposals that we did during November and December; we sold 4 floors of the 200 Della Paolera building at very good prices received for $1.2 million, an average of $8,600 per square meter of the official exchange rate. The agreement that will reach with the city was that IRSA will donate around two-thirds of the land to the city for public uses basically parks and some other plot of lands to the city, and in exchange of that the city approved construction capacity of almost 900,000 square meters that we will do different uses homes, offices, shops, services, education, entertainment, so this will be a new neighborhood in the city. If we move to Page 15, we can see the different effects of adjusted EBITDA by segment, shopping malls in the 6 months we see a big recovery 227% reaching ARS 4.3 billion of adjusted EBITDA that if we compare with pre-pandemic levels is still below. In the offices, the results are lower than the previous year in pesos terms since we have revenues are tied to dollars at the official exchange rate and the official exchange rate the devaluation was lower than the inflation when we show the last year numbers adjusted by inflation are generating these big impact in pesos term, in dollar term, this is different than I will show in the next slide. In Page 16, we see the numbers in dollar terms and here is different, the comparison we see in shopping malls, big recovery in dollar terms at $25.1 million in the last quarter. But here compared with the previous quarters, the main effect or the main impact was the approval of Costa Urbana that generated $150 million more in valuation that at the official exchange rate that is like $300 million. And then, we need to develop part of the infrastructure and part of the parks that $40 million that we committed to the city or the official exchange rate is something that probably could take place in the next I don’t know 2 to 5 years. So we hope to see better occupancy going forward, prices of premium buildings remain okay at levels of $25 to $30 per square meter."
}