{
    "symbol": "ESEA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 21:13:03",
    "content": " For the fourth quarter of 2022, we reported total net revenues of $42.9 million and net income attributable to common shareholders of $20.3 million or $2.86 per diluted share. For the full year of 2022, our net revenues were $183.3 million, and net income attributable to common shareholders was $106.2 million or $14.78 per share diluted. It is reasonably clear that the one-year time charter rates have continued to slide gradually as the rates have come down from an average of about $19,900 per day in the fourth quarter of 2022 to around $17,000 per day as of the end of last week. Having taken the full advantage of the rise of charter rates over 2021 and the first half of 2022, we have secured a revenue stream of $450 million, which is sufficient to allow us to evolve shareholders by paying a steady 10% dividend quarter-after-quarter, repurchase shares to our share buyback program, fund our eco newbuilding program and still have sufficient liquidity to pursue other attractive opportunities that will arise in the upcoming 18 months. The Company reported a net income, net income attributable to common shareholders for the fourth quarter of 2022 of $20.3 million as compared to a net income, net income attributable to common shareholders of $22.8 million during the fourth quarter of 2021. Basic earnings per share attributable to common shareholders for the fourth quarter of 2022 were $2.87 calculated on 7.08 million weighted average number of shares outstanding, while diluted earnings per share were $2.86 calculated on 7.1 million weighted average number of shares outstanding compared to basic diluted earnings per share of $3.16 and $3.14, respectively, for the fourth quarter of 2021. The adjusted earnings per share attributable to common shareholders for the quarter ended December 31, 2022, would have been $2.50 per share basically diluted, compared to adjusted earnings per share of $3.19 basic and $3.18 diluted for the quarter ended December 31, 2021, after making similar adjustments for the year -- for the period. The Company for the full year reported total net revenues of $182.7 million, representing a 94.6% increase over total net revenues of $93.9 million during 2021, again, as a result of both increased number of vessels owned and operated and also average charters that our vessels earned during last year compared to 2021. The Company reported a net income and net income attributable to common shareholders for the year of $106.2 million, as compared to a net income of $43 million, net income attributable to common shareholders of $42.4 million for the 12 months of 2021.Interest and other financing costs for 2022 amounted to $5.1 million compared to $2.8 million for 2021. Basic earnings per share attributable to common shareholders for 2022 was $14.79, while diluted earnings per share were $14.78, calculated an approximately 7.2 million weighted average number of shares outstanding compared to basic earnings per share of $6.07 and diluted of $6.06 for 2021, calculated on average of about 7 million weighted number of shares outstanding. The adjusted earnings attributable to common shareholders for the year 2022 would have been $13.23 and $13.22 basic and diluted, respectively, compared to adjusted earnings of $6.03 and $6.02 per share basic and diluted for 2021 with the same adjustments made, as I mentioned above. On average, 18 vessels were owned and operated during the fourth quarter of 2022, and another time charter equivalent rate of $29,400 per day compared to about 15 vessels in the same period, the fourth quarter of 2021 and an average $30,068 per day. Our total daily operating expenses, including management fees and general and administrative expenses, average $7,937 per vessel per day during the fourth quarter of 2022 compared to $7,708 per vessel per day for the fourth quarter of 2021. On average, in 2022, we owned and operated 17.12 vessels, earning an average time charter equivalent rate of $31,964 per day compared to 14.25 vessels during 2021, earning on average $19,327 per day."
}