{
    "symbol": "AYTU",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-14 18:58:05",
    "content": " As outlined in today's press release the record quarterly net revenues of $27.7 million, which was an increase of 26% compared to the year ago quarter was driven by strong performances in both our Rx and Consumer Health segments. On the Consumer Health side, we posted strong 12% revenue growth compared to last year's first quarter and reduced our adjusted EBITDA loss in the segment to just 493,000. All told adjusted EBITDA for the company was positive $1.4 million during the first quarter compared to a negative $4.2 million in last year's first quarter, a dramatic improvement to be sure. Mark will hit more on the numbers but across the Board we are seeing strong growth in the ADHD products which contributed to $11.6 million in 2023 first quarter revenues, an increase of 24% compared to a year ago. As mentioned, we experienced 34% revenue growth in the first quarter and generated a positive $2.7 million in adjusted EBITDA. During the first quarter of 2023 net sales were $9 million for Consumer Health segment, an increase of 12% over Q1 a year ago. During the quarter, we posted a Consumer Health segment adjusted EBITDA of negative $493,000 compared to negative $934,000 a year ago, marking a seeing a significant improvement in this segment that is now getting very close to generating cash. Net revenue for fiscal 2023 first quarter was $27.7 million compared to $21.9 million for the first -- for the fiscal 2022 first quarter, a 26% increase. Breaking down the quarter, net revenue from Rx product sales in the 2023 first quarter was $18.7 million compared to $13.9 million in the same quarter a year last year, an increase of 34%. As Josh noted, ADHD experienced 24% growth in net revenue to $11.6 million in the 2023 first quarter compared to $9.3 million during the 2022 first quarter. For the first quarter of 2023, net revenue from the Consumer Health franchise was $9 million compared to $8 million in the same quarter last year, an increase of 12%. On the OpEx side for the first quarter of 2023, excluding impairment expense and amortization of intangible assets, operating expenses were $18.5 million compared to $19.2 million, the same period a year ago, a decrease of about $700,000. Net loss for the first quarter of fiscal 2023 was $2.9 million or $0.06 per share, compared to $27.9 million, or $1.09 per share for the same quarter last year. When you look at the breakdown by segment, adjusted EBITDA though our Rx segment during the first quarter of fiscal 2023 was a positive $2.7 million compared to a negative $2.2 million a year ago. In the Consumer Health segment, quarterly adjusted EBITDA was a negative $493,000 compared to a negative $934,000 in the year ago period, a 47% improvement year-over-year. Finally, adjusted EBITDA tied to our now suspended R&D pipeline was a negative 866,000 during the first quarter of fiscal 2023 compared to negative $1.1 million in the first quarter of fiscal 2022."
}