{
    "symbol": "AGL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 00:05:17",
    "content": " From a margin perspective, our MA medical margin increased by 49% to $82 million or $103 per member per month in the second quarter up from $95 per member per month a year ago. In our 10 partner markets that have been live more than a year, medical margin per member per month on a year-to-date basis increased by 26% from $108 to $136. As I noted earlier, direct contracting performance was positive during the quarter and included strong gains in margins and 63% year-over-year membership growth. In terms of profitability to agilon, our strong performance in Medicare Advantage and direct contracting, combined with platform support cost leverage translated to adjusted EBITDA of $7 million during the quarter and $20 million year-to-date, which is nearly a tenfold increase from $2 million last year. Starting with our membership growth for the second quarter, total members live on the agilon platform, including both Medicare Advantage and direct contracting, increased to 352,000 with Medicare Advantage membership coming in above our previous guidance for the quarter. On a year-to-date basis, medical margin PMPM and our 10 partner markets that have been live more than one year, increased 26% from $108 to $136. For the third quarter, we expect medical margin in a range of $65 million to $70 million, representing 55% growth and adjusted EBITDA of negative $2 million to negative $5 million compared to negative $14 million in the prior year. For the full year 2022, we have raised our membership from revenue outlook to reflect greater pull-through of commercial agents and year one market membership while largely maintaining medical margin and adjusted EBITDA as these members generally start with lower than average margins. We now expect total membership on the agilon platform will grow over 49% year-over-year to 345,000 to 355,000 with revenue growth of 43% at the midpoint to a range of $2.615 billion to $2.635 billion. But I guess what Iâ\u0080\u0099m really proud of is, we talked about the key metric being our year two plus markets and their performance, and that step-up year-over-year from $108 PMPM to $136 that really allows us to grow year one markets even more to absorb it in the quarter and really drive strong performance. As well as this is the first quarter that weâ\u0080\u0099ve had a year-over-year comparison and direct contracting, and that strong performance jumping from $71 PMPM a year ago, up to $79 growing 63%, as Tim talked about. But that incremental revenue really does flow through to very little medical margin initially because of the reasons Steve talked about a lot of those members are either agents, which come in at a very low medical margin or weâ\u0080\u0099re actually growth from our newest markets, our year one market, which are also starting at a lower medical margin. But again, almost all of that could be driven by the incremental membership growth that weâ\u0080\u0099ve now guided to which will flow through to a pretty low medical margin number and be relatively dilutive, but still allow us to deliver that 190 or so basis points increase in MLR in the second half. Thank you for your question. And even with that increase, as Steve spoke about, weâ\u0080\u0099re seeing a pretty nice pickup in medical market either on a PMPM basis, I think $79 this Q2 over $71 in the first quarter, second quarter of last year, which was the first quarter we had it. And just as a point of comparison, I mean, weâ\u0080\u0099ve generated over $500 million of revenue in direct contracting through the first two quarters of this year. Thank you for your question. But I think as we talked about earlier on the call, we wouldnâ\u0080\u0099t expect that to flow through too much incremental medical margin because itâ\u0080\u0099s primarily being driven by incremental agents or more members in our year one geography markets. So when we talked about investing $80 million back into these communities year-to-date, thatâ\u0080\u0099s really a reflection of the surplus thatâ\u0080\u0099s generated by being able to manage costs and take out waste and then that less local expenses, that 50% going to those partners. Thank you for your question. So thatâ\u0080\u0099s kind of what caused the dilution and itâ\u0080\u0099s one of the reasons why in the second quarter, we can raise our revenue by about $27 million, but donâ\u0080\u0099t anticipate that thereâ\u0080\u0099ll be a huge incremental medical margin driven by those members. Thank you for your question. So those are kind of the two components of those, which is one of the reasons why the over â\u0080\u0093 the partner sharing part itself is not 50% of medical margin because itâ\u0080\u0099s â\u0080\u0093 what weâ\u0080\u0099re sharing is actually the market level profitability, not the market level medical margin. Thank you for your question. You did $7.5 million, but you absorbed $8 million of negative development in the quarter would imply current year results, like well ahead of guidance unless youâ\u0080\u0099re anticipating there would still be development based on 1Q trends, but is there any new ones with that. Gary, when I just step back and look at this combined business that weâ\u0080\u0099re running across Medicare Advantage and direct contracting, year-over-year membership is up 50%. Thank you for your question."
}