{
    "symbol": "AGL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 19:19:06",
    "content": " Our powerful same-store performance measured in this meaningful improvement to medical margin unit economics while generating same market growth of 14%, has been driven by: one, the local scale we leverage to improve care delivery; two, the ability to leverage common data and learnings on our purpose-built platform; and three, the embedded membership growth that comes from working through existing physician capacity in our partners' practices. But one is, I think, we believe direct contracting is extremely strategic for our partners and for us in that there's a single experience for their primary care physicians, and there's one care model that gets applied across the entire senior population, which reduces variability and allows for much better care and less sort of variation. And by the way, while we're switching to the next question, I'd just throw in, it's really important that we are able to do that in that half of our business -- being more than half of our business being in PPO membership is a big deal because that means we can essentially go into a market and bring -- and see if you can comment on this better than me, bring full risk to a market regardless of whether it's heavy PPO or HMO, unlike other markets that may be very heavy HMO that are very easy to get that attribution. But I think in general, we figure like -- we feel like we're seeing an acceleration sooner for our year-1 markets in terms of the benefits of the high-touch model, and it's coming through in terms of better satisfaction, better health outcomes and ultimately lower costs and better margins overall. And one thing, Steve, maybe I would add, as we said for the last couple of years that we think the best time to look at that, although we can give you an indication, obviously, that as Steve did and I did in our comment that our year-1 markets are actually performing better than we thought they would this year, certainly at the high end of our expectation. Probably the biggest not the biggest, but the first thing is the retro membership that we're showing up that 1,000 members, but over the first full 3 quarters of the year, plus I think we beat the high end of the guidance by not quite 1,000 other members within the quarter. I mean within the quarter itself, the medical margin be flowing through the network contribution was obviously positive, and we ended up kind of in the low end, but within our guidance range, rather than at the top end of the range or above the range because of the, as you said, $5 million or so difference in our expectation on direct contracting and adjusted EBITDA."
}