{
    "symbol": "AGL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 22:45:21",
    "content": " Performance across Medicare Advantage and direct contracting was in line or better across all key metrics, enabling a full year adjusted EBITDA of $4.3 million, even as we made substantial platform investments in technology and infrastructure to scale our organization for the future. On one of the most important metrics in our fast-growing subscription business, our 10 year 2 plus partners improve their medical margin by 33% from $93 to $124, which accounted for 90-plus percent of the full year $43 million improvement in adjusted EBITDA. When I look more immediately at the levers in our business, by getting members on the platform earlier, delivering a more effective implementation period with improved starting points for new partners and accelerating quality and medical cost performance in our more mature markets, I am less feeling extremely bullish on 2023, 2024 and beyond. As Steve mentioned, in our 10 year 2-plus partner markets medical margin PMPM increased by 33% to $124 in 2022, up from $93 in 2021. The $43 million year-over-year gain in adjusted EBITDA for the full year was primarily driven by higher medical margins in our year 2 plus partner markets, which generate significant operating leverage against market and enterprise G&A. For the full year 2023, we expect ending membership live on the agilon platform will grow to a range of 485,000 to 500,000 members including 50% growth in MA membership to approximately 405,000 and steady ACO reach membership at approximately 88,000 at the midpoints. They're 100% fee for service, and we want to move them to value I think we found that there are markets out there with higher health care spend and therefore, higher starting points on rates as part of our mix that are really attractive for us, and we've been able to demonstrate success within them. We've got both the combination of the step down and the global -- or the step-up, I guess, in the global discount and just trying to be a little bit prudent we're saying that we would expect it ACO reach in 2023 will probably contribute a little bit less than that in the $5 million to $10 million range. The class of new partners, new markets is that's coming on the composite when you think about what we're doing and same geography could get you to that $130 million, but it could be larger than that. I mean I think we talked about, again, platform support costs as a percentage of revenue overall for 2022 was down by more than another 100 basis points, and we continue to see -- expect to see that improvement year-over-year as we move forward. And then the year-over-year maturation that's driven by earlier rollout of clinical programs, better quality, the diabetes research that I cited at the beginning where we're 20% better than Medicare Advantage on a national basis in terms of total cost of care, go down the list of sort of complex patients, and we're getting much better on that. And so I think -- and then the starting point that we talked about, if you think about the year 1 markets being dilutive potentially at that adjusted EBITDA level, each incremental dollar we're able to drive there by having a better implementation period really helps a lot."
}