{
    "symbol": "HOFV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-28 12:07:09",
    "content": " And it's not a popularity contest when you're considering the future of a company, the team, its shareholders and frankly the community and all of our fans and guests, we have to make sound long-term business decisions that set our company up for success over and over again. And while many companies have taken, I would consider to be more severe steps to ensure short term successes, I personally and our company leadership team cannot think that way about a company that is literally building from the ground up in every way, a company that is driving growth through synergy, which is what our strategy was all about, from business unit to business unit, a company that's leadership and board continues to invest in without fail or confidence in our plan. And we're that way because I do believe that there is this narrative, there is the misguided assumptions being made about the action we've taken to support our growth and false assertions of doing things to intentionally devalue the company and hurt the shareholders, of which we're 35%. And so it's another example of how management looks at managing decisions, leading the company in a strategic way that sets up for mid and long-term success versus just focusing on short-term execution to be able to sit here on these calls and say look at what we did this quarter. So I think all of that and remember, I'll just go back and say and then I'll pause for a moment the synergy that can be driven out of this USFL hosting two teams permanently in our stadium this year for the season, playoffs and then championship again drives room nights, food revenue, meeting revenue facility revenue, tenant revenue, the opportunity for national television and media drives partnerships and sponsorship growth. We're focused on cost efficiency, we're focused on investing dollars, we're going to get the highest returns, and we're focused on creating a critical mass where people say, wow, this is an unbelievable amount of opportunity for us to engage with our products where they're telling stories, where they're creating gaming environments, where they're creating physical assets. And on the other side, you're going to start to see a company that has a $40 million, $50 million market cap with $50 million in cash and $450 million of assets, and another $170 million of physical assets being built in the next two years and a media pipeline and a gaming universe that's very unique and different, leveraging IP that no one else has access to in many instances grow exponentially."
}