{
    "symbol": "HOFV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 14:19:06",
    "content": " So, very proud of the team at the DoubleTree The Village itself, the Center for Performance, in Q1, we announced that we were going to be partnering with a local sports dome that has hosted many, many sporting events over the previous years, they're going to be closing and we're going to be transitioning a lot of that business into our new facility here on campus. While we're still in the early stages, I think you probably have seen we have really started to build key partnerships and branded content and media for us, I think will be a significant addition in terms of our destined fan experience, but also synergy with onsite activity and with our gaming division. And lastly, in gaming, we spent a lot of Q1 talking with different esports tournament hosts and we think we're going to position ourselves quite nicely with the Center for Performance and some of the other assets that we're going to be opening to host multiple esports tournaments here this year and in the coming years, bringing a different type of crowd to campus, allowing us to again to reenergize in peak and non-peak periods. And we are continuing to strategically maximize the sponsorship or partnership dollars in each category, which means we're not really inclined to engage on everything until we have the critical mass in terms of assets, media content, gaming content, and events that will allow us to maximize the revenue achieved in the partnership category. As Ben said, I'll just I'll just say this, again, the amount of construction financing that we have now executed and will continue to close over the next I'll call it month and a half, two months really does give us the ability as we've talked about to create all of the assets, build the media content and create the gaming environments that we have promised to our shareholders. We came into 2022 with several key objectives, construction financing, obviously one construction schedule two, building our media pipeline, building and developing our gaming vertical, adding more sponsors and partners, creating an even bigger event pipeline, which I think we're showing we're doing with both sport and non-sport events. And we've seen that every time we're hosting events on our campus, the revenue that's being generated to the surrounding area hotels, and the food and beverage locations, goes off the charts. In addition to adding a new attraction inside the stadium, the skills test challenge that will run on a daily basis allowing fans to immerse themselves in like an NFL Combine environment, we feel like between those types of things, the rents that we'll see from tenants, both for the Center for Excellence and fan engagement zone, the commissions that we'll receive from some of our partners doing business on property, sponsorships, all of that will continue to grow exponentially over the course of this year with asset growth, event growth."
}