{
    "symbol": "CMRX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 10:36:06",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to the Chimerix Fourth Quarter and Year-End 2022 Earnings Conference Call. I would now like to introduce your host for today's call Michelle LaSpaluto, Vice President of Strategic Planning and Investor Relations at Chimerix. Good morning, everyone and welcome to the Chimerix fourth quarter and year-end 2022 financial and operating results conference call. With me on today's call are President and Chief Executive Officer, Mike Sherman; Chief Medical Officer, Allen Melemed; Chief Financial and Business Officer, Mike Andriole; and Chief Technology Officer, Josh Allen. Before we begin, I would like to remind you that the statements made on today's call include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, and are subject to risks and uncertainties and other factors. At this time, I would like to turn the call over to our President and Chief Executive Officer, Mike Sherman. We completed an important transition for the company in 2022, monetizing TEMBEXA and fully capitalizing the company without shareholder dilution, establishing runway into 2027 in the process. As a bit of an aside, it was nice to hear from one of our leaders at our CRO partner PPD in a meeting yesterday recognized the particularly strong collaboration they have with our team distinguishing it from other trials they're working on. That speaks both to the quality of a team in both organizations and the uniqueness of this trial, particularly the pull we get from patients and investigators. It's worth noting that our endpoint strategy is designed to optimize the speed to data, as well as provide multiple opportunities for success. If results are consistent with the independent analysis previously reported at the recent SNO Conference, this is what we would expect to happen. That's particularly true with the inclusion of the higher dosing arm, which is independently powered. Trail design also provides another opportunity for success with the incorporation of the PFS analysis at 286 events, which is expected to occur just after the first interim overall survival analysis. With a successful PFS analysis, we plan to speak to the FDA about seeking an accelerated approval and then would incorporate the overall survival analysis as a post marketing requirement. The independent data announced in December supporting an ONC201 survival benefit in the H3 K27M-mutant population more than doubling median survival compared with those not treated with ONC201 26 months, compared to 12 months in the frontline setting. The flexibility afforded by our trial design on top of the durable response data we previously disclosed from Phase 2, we remain confident that probability of success for the ACTION trials at least is higher than other Phase 3 trials. We also continue to generate data that enhances the scientific understanding of our pipeline, adding to our confidence and the ability of and imipridoneâ\u0080\u0099s broadly to uniquely address high unmet needs in oncology. As it relates to our earlier stage pipeline, including ONC206, we have new reason to anticipate additional catalyst on the horizon for that program, while we're executing the ACTION trial. We wouldn't ordinarily highlight a single case of tumor response, but because this happens so early in the escalation and in a patient with non-H3 K27M glioblastoma. So, with respect to the preclinical data released at SNO, alongside the launch of the ACTION trial, presentations there shed further light into how ONC201 and ONC206 can be unique detrimental effects to advanced CNS tumors. Our own studies presented at that conference demonstrated the role of ClpP in response to these compounds, highlighting that this target can impart a strong therapeutic response as shown in CRISPR and acquired resistant studies, and that these compounds are the first therapeutics to tap that target. In addition, a team of researchers affiliated with PNOC unveiled a new dimension of ONC201 activity into Diffuse Midline Gliomas, abbreviated as DMGs. Next, let me follow-up on Mike's comment related to a recent clinical findings with ONC206. So, ONC206 is a small molecule that emerged from a medicinal chemistry campaign, leveraging the unique core chemical structure and first-to-class mechanism of action of ONC201. ONC206 emerged from these efforts as an ideal second generation compound exhibiting minimal or potency in vitro against a variety of advanced cancers, as well as its direct dual target DRD2 and ClpP. The spectrum of anti-tumor activity of this compound has been verified as the monotherapy in vitro and in vivo in specific advanced forms at CNS tumors, neuroendocrine tumors, and gynecological malignancies that are distinct from the lead indication of ONC201, and each represent urgent unmet medical needs. All of this is accomplished by ONC206, while maintaining brain penetration, as well as a wide therapeutic window in oral administration that we expect will translate to patient convenience, compliance, and quality of life in the clinic. And it's not just us that sounds as compelling, it's also our team of collaborating experts in Europe and the U.S. who have validated much of the efficacy I just mentioned in their  . Chief among them was the Neuro-Oncology Community, which was eager to pull this treatment forward to their patients with advanced CNS tumors. To that end, the NIH, as well as PNOC worked closely with us and secured external funding to introduce this molecule into the clinic to begin dose escalation directly in adult and pediatric brain tumor patients respectively. Their work suggests that the efficacy of ONC206 could extend beyond the H3 K27M-mutant glioma population being addressed by ONC201, including indications such as glioblastoma and medulloblastoma. However, key information will also be gained on pharmacokinetics, as well as pilot efficacy in certain cohorts that would select for patients with recurrent disease. While these studies are still early and we anticipate much more dose escalation and intensification still lies ahead, we are encouraged by what we have heard from investigators so far. The pharmacokinetics suggest that we are only scratching the surface of what ONC206 may be able to achieve in terms of therapeutic exposure, and it's likely we have more room to intensify beyond the initial weekly schedules. Finally, as Mike mentioned, an investigator has recently notified us of a response in a patient with recurrent glioblastoma. This patient initiated monotherapy ONC206 in April of last year at only the second dose level in the study and has achieved a radiographic response per the investigator, as well as a decrease in metabolic activity in their tumor as seen on PET imaging. Importantly, this patient's glioblastoma did not harbor the H3 K27M-mutation. Overall, this suggests that the broader activity profile observed with ONC206 in preclinical models may translate to the clinic to address these sizable unmet needs outside of the indication where we are currently developing ONC201. Furthermore, the early clinical activity of ONC206 has the potential to address a much larger patient population with an equally acute unmet need, and provide additional catalyst. Both programs have the potential for substantial value creation to patients and shareholders, which I'll take a moment to recap. In the case of Dordaviprone or ONC201, in H3 K27M-mutant glioma, recall there are no approved agents targeting this mutation and this is the lead program clinically by a wide margin. We have previously guided to a commercial opportunity of 750 million in revenue annually, with about 5,000 newly diagnosed glioma patients harboring this mutation in the Top 7 markets, the potential approval in this population would be a stepwise change in the standard of care for these patients and would be accompanied by ultra-orphan drug pricing. This means pricing anchors of comparative therapies that treat U.S. populations of 2,000 patients or less and were full approvals predicated on an overall survival benefit. With these anchors in mind, and based on ongoing commercial planning work we've performed, we believe a $750 million revenue forecast is likely the lower bound of what we might expect subject to final survival data from the action study. In the case of ONC201, this is a second generation imipridone designed to expand benefit to other tumors from what Dordaviprone is expected to address. While the program is early, we are nevertheless encouraged by the confirmed response in a patient with recurrent glioblastoma without the H3 K27M-mutation early in dose escalation, a first for this platform. Glioblastoma is comprised of roughly 30,000 newly diagnosed patients in the Top 7 markets annually, so about 6x the size of the market for Dordaviproneâ\u0080\u0099s lead indication. With orphan-drug pricing and the scale of the unmet need in glioblastoma, we believe the global market opportunity for ONC206 comfortably exceeds $1 billion annually as we consider development in this indication. Lastly, earlier today, we issued a press release containing our financial results for the fourth quarter and full-year 2022. Starting with our balance sheet, at the end of 2022, we had approximately $266 million in capital, which could fund operations into 2027, a period that could potentially include the U.S. launch of Dordaviprone. As a reminder, under the TEMBEXA agreement, we received an additional $31 million for each of the remaining four BARDA procurement options totaling up to 124 million in milestone payments. In addition, we'll earn TEMBEXA royalties equal to 15% of international gross profit and royalties equal to 20% of U.S. gross profit should U.S. demand for TEMBEXA exceed 1.7 million treatment courses during the exclusivity period. Turning to our statement of operations, the company reported a net loss of $21 million or $0.24 per basic and diluted share for the fourth quarter of 2022, compared with a net loss of 39.5 million or $0.45 per basic and diluted share in the fourth quarter of 2021. R&D expenses decreased to 19.3 million for the fourth quarter of 2022, compared with 34.3 million for the same period in 2021 in which we paid a one-time $20 million success payment for ONC201. Subject to changes in pipeline investments that may occur during the year, the current plan is for our 2023 end of year cash balance to exceed $200 million. With that overview, I'll turn the call back to Mike for closing remarks. We're particularly excited to see such an early signal from the ONC206 program, and the fact that that occurred in a non-H3 K27M-mutants   glioblastoma. So, certainly encouraged by the potential for additional catalyst that program can provide on top of the ACTION study execution. Your line is open. Just first question on 206, I believe the response was in a patient that received 100 milligrams once per week and then you said that was in the second dose level. Yes, maybe I'll take a high level cut at that and Josh you can add to it. So, of course, we expect the dose itself to escalate and we've got plans in place to accelerate that as you mentioned, the intensity and more frequent dosing, we also believe based on PK modeling we've done can provide some benefits. And as you rightly point out, this response was in a patient second dose cohort following a   that escalated up at their enrollment to 100 milligram. So, you got that right and then in terms of the future of the trial as you alluded to and Mike points to as well, our preclinical data both safety and efficacy, as well as the available clinical pharmacokinetics suggest that driving towards an increased dose schedule may be beneficial and feasible. So, to that end, we expect the studies to intensify towards a 3-days in a row per week dose schedule, perhaps with twice per day dosing as the future of these studies. And like I mentioned in my comments, the primary goal of these studies is really aimed at establishing monotherapy safety, but of course, we expect to pick up additional information on pharmacokinetics, as well as how these patients do. And so, to see a response in a new patient population with our internal program, it certainly raises the bar for anything that we might be looking at externally. The enthusiasm at both of those institutions and across those collaborations have increased with, kind of the data as they've seen it, most of the qualitative data that they observe in treating patients where sometimes you don't have a patient where you can even assess the tumor response, but particularly in this patient where tumor â\u0080\u0093 the tumor is accessible for response. That having been said, there is a point at which we'll be evaluating in the coming weeks and months, plans to, again, driven by data, potentially accelerate that, but certainly plans for the next phase of trials that would expedite a regulatory approval process. Certainly, that response has us engaged significantly on the program, and we're looking carefully at other measures of activity. But clearly, this response, particularly in a patient without the H3 K27M-mutation is â\u0080\u0093 raises the bar for that. As Mike said, we continue to leverage external capital for the ongoing Phase I work and we'll carefully evaluate the dose escalation and intensification during this year. Your line is open. Maybe the first one on ONC201, just to kind of get a good handle on the expectations for the cadence of how we're going to see some of these readouts. First of all, you're right about our expected time lines for the PFS would likely occur between the first OS and the second OS interim. So, I think if it's a positive outcome, we would plan on submitting it. And of course, they would, I imagine, take an early look at the overall survival status and at least look for supportive trends in that and then be part of their decision-making process. So, it's our plan that we would move ahead with that submission based on the data we would see if it's positive. You're correct on the timing, which is around 2025, obviously, depending on enrollment rates and event rate. I think the last thing I'll mention is the ability to submit on PFS is very much aligned with Project Front Runner, which is a project that FDA has, which is looking at sponsors submitting based on an interim Phase III trial with the ability to convert to full approval based on the final results of the study. Of course, we need to see when we have the data at the time if we're able to move forward. I know it's monotherapy, and they weren't on any, sort of corticosteroids, which is great. With respect to treatment course, Joe, we know that this patient had following surgical resection and diagnosis of disease, went through the typical chemo radiation course in the fall of 2021, experienced disease progression following that standard  , early  year-end 2022 in initiated monotherapy ONC206 in April of last year. So, pretty typical treatment course following frontline therapy, and again, had a progressive disease prior to coming on study for this particular cohort. I think like Mike alluded to earlier on the call, we've had a couple of cohorts within that study where patients can initiate therapy on one of the cohorts following radiation, but prior to  . That's been useful for generating safety and PK information, but with respect to interpreting efficacy, we've really kept our eye on that dedicated cohort of recurrent disease like this patient fit to where response is more  . Your line is open. Like Mike alluded to, we'll keep our eye on the data sort of as it unfolds, but we thought it was important to report on this observation, particularly given that the patient lack the H3 K27M-mutation. But with respect to this one observation, we did see the tumor, at least based on the investigator report, steadily, sort of trickled down. Whether or not those response kinetics will be more rapid with ONC206 than we saw with ONC201, that's just something we're going to have to keep our eye on as the data unfolds. And I would not expect, given the submission time lines, that this would be an ASCO presentation. I think this would be an observation, the details on this patient, including potentially into images and so on would be something presented later and probably more likely at a neuro-oncology-focused conference. So, we won't give enrollment numbers other than to say, you know we've got a plan to enroll, which would lead to the timelines we have for data in 2025. The site activation, I think they're actually only a few sites that show up on clintrials.gov as of today. And so, we would expect to have this week, essentially five active sites, but then, in the coming weeks, you're essentially activating that number of sites per week for a while, and then it accelerates from there. So, you typically â\u0080\u0093 this is what you typically see with a few early sites â\u0080\u0093 like a few sites can manage their internal review and IRB review process very quickly. And then a bolus of sites that really come on between March, April, and May, such that we'll have most of our sites. We'll have over 100 sites participating in this trial globally, and we'll have most of those sites active by mid-year. So, we can get them early when they're diagnosed and then follow them during the radiation they will give them some time period afterwards when they can actually get to an open site. Your line is open. I think our strategy from the beginning was to differentiate ONC206 into new populations that was supported by the preclinical data, as well as, obviously, it's a logical from a pipeline progression standpoint. So, the ability to tap outside of H3 K27M, it essentially opens up, sort of, I think, six-fold the patient population that we get with that agent with ONC201, which in and of itself is still a very interesting and attractive market, but we'll develop it outside of that as ONC201 would address H3 K27M. There are other potential opportunities for ONC201, smaller, I think, niche opportunities around that. So, to the extent that we see ONC206 have this broader activity, it would become the workhorse agent where we would defer to that in expanding new indications or potentially even beyond CNS tumors. So, the activity profile of ONC206 we found to be much, much broader than ONC201. We have preclinical data, both in vitro and in vivo in a series of indications, namely several high gliomas that don't include the H3 K27M-mutation in-line with that response that we highlighted here today. But in addition, in other forms of neuroendocrine tumors, like cholangiocarcinoma, and then  including ovarian and endometrial cancer. So, it's really the observations in the lab suggesting that this drug could address several forms of advanced cancers outside of H3 K27M glioma that led to us making the clinical program more broad than CNS tumors for that first half. And then the only other point I would add on 201 in terms of indications beyond that, as Mike mentioned a few niche opportunities. We can see that while we're totally focused on delivering on the Phase III study for this high unmet need, we have seen evidence where the drug may be able to scale in some other niche opportunities, including  experience where we've seen a 50% monotherapy response rate that we published out previously. I was about ready to make that comment to the previous question, but we've essentially eliminated the overlap between the two so that if there's a patient eligible for the ACTION study, the ACTION study is how they can access ONC201. So, essentially differentiates those two, so they're not competing and not otherwise slowing down our enrollment for the ACTION study. Well, thanks, everyone, for your time this morning and look forward to providing updates in the coming months."
}