{
    "symbol": "K",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 15:21:06",
    "content": " We're pleased to be able to report another good quarter, delivering solid results even ahead of plan by sustaining growth momentum across our international businesses and our North America snacks brands realizing price and productivity amidst decades, high inflation and executing with agility. We had restored top line growth in 2019, experienced the pandemic-related acceleration in 2020, and yet sustained the strong growth in 2021 despite what we were lapping and in quarter one of this year, even with difficult comparisons, we continue to exceed our long-term target of 1% to 3% net sales growth with organic growth of more than 4%. So even in a quarter when one of our businesses North America cereal was notably soft, declining 10% year-on-year because of a lack of inventory, this was more than offset by momentum in the rest of our portfolio. The result was organic basis net sales growth of over 4% year on year, another strong quarterly performance that continues to exceed our long-term target. Despite transitory supply disruptions, our operating profit remains on an upward trajectory owing primarily to higher net sales with our supply constraint in many of our businesses, most notably in North America, cereal our advertising and promotion investment was much lower than usual in quarter one. We also continue to forecast currency neutral adjusted basis growth of 1% to 2% in earnings per share with a further reduction in other income, partially offset by the fully year flow through of quarter one, discrete tax benefits. And in North America, where last year's fire and strike left us with low cereal inventory and therefore lost sales, our reported and organic net sales were still only down, less than 1%. You'll see that cereal and frozen foods, the category groups that are the most at home in nature have therefore seen the most deceleration as consumer mobility has increased, but outside of North America with its supply disruption from the fire and strike, we do continue to grow in cereal internationally, but you'll also see that in all four regions, our biggest category group snacks, continue to grow strongly, even against tough two year comparisons. On Slide Number 29, you can see that we experienced organic net sales growth in both snacks and cereal in the first quarter, despite what were very tough comparisons on a two-year basis. In snacks, the growth is underpinned by fantastic momentum in consumption for Pringles which gains share in markets like Germany, Italy and Spain and lagged the category's double-digit growth in the UK only because of tougher comparisons. In portable wholesome snacks our consumption has rebounded faster than the category in our principle markets of Mexico and Puerto Rico and cereal category consumption growth remains robust across the region and we outpace the category in key markets, However, tough comparisons and regulatory hurdles in Mexico negatively impacted our cereal net sales in the quarter. Our strong snacks growth was led by Pringles, which sustained goods consumption growth, even as it entered the quarter with low inventories coming out of last year's COVID related production restrictions. I would expect gross margins to continue to decline in the coming quarters before bouncing back in quarter 4 when we lapped last year's fire and strike, but definitely an improving trend because the impact of the fire and strike is now behind us."
}