{
    "symbol": "SBNY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-17 13:44:09",
    "content": " Total deposits decreased $14.2 billion or 14% to $89 billion this quarter, while average deposits decreased 4 billion  Now let's discuss the obit  in the room. During the quarter, noninterest-bearing deposits decreased $6 billion to $31.5 billion, which continues to represent a solid 36% of total deposits. It is encouraging to see inflows in traditional deposits of $2.5 billion thus far this year through January 13, as only after only 9 business days. During the fourth quarter, growth continued to come from nearly all of our lending businesses with the exception of capital costs, which were down $2.1 billion as we left passive participation run off as they came up for renewal. The $49.4 million or 26.8% increase was principally due to the addition of new private client banking teams, national business practices and operational personnel as well as client-related expenses that are activity driven and has increased with the growth in our businesses. Beyond that, is the message that you don't see any other higher cost deposits in any meaningful size left and net-net, you believe you can offset the $5 billion. And if we're planning on reducing deposits in the digital space, $3 billion to $5 billion, we certainly will then need to borrow in the short term, which then should lead to NIM and NII compression given the higher cost deposits as we saw towards the end of the fourth quarter. So margin in the first quarter, we do expect to be down about 10 basis points, and that's a function of what I mentioned earlier in that - in the short term, we do expect to borrow early in the year to replace the digital outflow that we're planning to manage down. And if I could ask one final one, just following up on the inflows of traditional deposits you saw, what you're calling out in the release, the $2.5 billion. Is there - there likely will be pressure in the first half given borrowings as far as pretty certain on where we're going to be at for the first quarter, but then depending upon where deposit flows come, where borrowings come, that really makes it challenging just going more beyond one quarter at this point, but would see stabilization to NIM expansion in the second half with borrowings rolling down."
}