{
    "symbol": "SBNY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-18 13:03:05",
    "content": " Pretax pre provision earnings for the 2022 third quarter were a record $492 million, an increase of $161 million or 49% compared with the $331 million for 2021 third quarter, but that's a good quarter. Net income for the 2022 third quarter increased $117 million or 48% -- $358 million or $5.57diluted per share compared with $241 million or $3.88 diluted earnings per share, and that's a very good quarter, 49% and 48%. All of these factors combined, as well as our steadfast execution across all of our businesses led to a record return on common equity of 18.4% and a strong return on average assets of 1.24% and that's a good quarter. The commercial real estate team led the way with growth of $2.1 billion, Signature Financial increased $406 million, our new healthcare banking and finance team grew by $274 million, the mortgage warehouse lending team increased by $236 million. Net interest income for the third quarter reached $674 million, an increase of $25 million or 4% from the 2022 second quarter and an increase of $193 million or 40% from the 2021 third quarter. Yields on the securities portfolio increased 18 basis points linked quarter to 2.08%, given higher replacement rates and slower CPR speeds on our mortgage-backed securities portfolio. The $44 million or 24% increase was principally due to the addition of new private client banking teams, national banking practices and operational personnel, as well as client related expenses that are activity driven and have increased with the growth of our businesses. Despite the significant hiring, the launch of that healthcare banking and finance team and considerable operational investments, the Bank's efficiency ratio improved to 31.4% for the 2022 third quarter versus 35.4% for the comparable period last year. Signature Bank's strong performance as reflected by our return on common equity of 18.4% is a result of one of our main objectives, bring on talented banking teams and businesses and support them to our service oriented platform. I think it's going to stay in the mid-20s for the next several quarters and then we'll start to moderate in the back half of next year, probably coming down gradually into the low 20s and then into -- if you look out into 2024, I think we'll get back into the teams then. I mean, Dave, it's really tough to say from a timing standpoint, just given how unpredictable the Fed has been, how unpredictable the quantitative tightening has been to impact us that some of the alternatives that Eric spoke about earlier with treasuries against deposits are just -- we run so many different scenarios that it's tough to specifically guide here, but we do expect to be up just at a slower level than we were or a lower level than we were this past quarter. I'm curious, given the comment for NIM expectations and expansion going forward , the most difficult job we're having now is figure out how where noninterest-bearing deposits are going right, pre-QE  billion, you're 37% now, but you're making some assumption for those, Eric, to say your NIM's going to expand, what are you assuming at least."
}