{
    "symbol": "MBI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 09:26:03",
    "content": " The company reported a consolidated GAAP net loss of $52 million or negative $1.05 per share for the fourth quarter of 2022, compared to a consolidated GAAP net loss of $155 million or negative $3.12 per share for the fourth quarter ended December 31, 2021. Lower loss in LAE at MBIA Corp, as Corp stated a loss in LAE benefit in the fourth quarter of 2022, primarily due to higher risk-free rates on its insured RMBS exposure versus an expense in Q4 2021, due to lower projected Zohar recoveries. These favorable variances were somewhat offset by losses from discontinued operations related to an impairment on Zohar-related collateral at MBIA Corp. As of December 31, National sold all of the Puerto Rico GO bonds that had received as part of the GO debt restructuring implemented in March of 2022 and approximately 58% of its Puerto Rico GO-related contingent value instruments or CVIs. The company's adjusted net income, a non-GAAP measure, was $15 million or $0.30 per diluted share for the fourth quarter of 2022, compared with an adjusted net loss of $106 million or a negative $2.13 per diluted share for the fourth quarter of 2021. The company reported a consolidated GAAP net loss of $195 million or a negative $3.92 per share for the fiscal year 2022, compared to a consolidated GAAP net loss of $445 million or a negative $8.99 per share for the year ended December 31, 2021. The company's adjusted net loss was $145 million or a negative $2.90 per diluted share for the year ended December 31, 2022, compared with an adjusted net loss of $161 million or negative $5.27 per diluted share for the fiscal year 2021. MBIA Incâ\u0080\u0099s Book value per share decreased to a negative $16.07 per share as of December 31, 2022 versus a negative $5.73 per share as of December 31, 2021, primarily due to unrealized losses on investments recorded to other comprehensive income driven by higher interest rates and wider credit spreads, as well as the $195 million fiscal year 2002 net loss. National reported statutory net income of $40 million for the quarter ended December 31, 2022 versus statutory net income of $5.5 million for the quarter ended December 31, 2021. For the 12 months ended 12/31/2022, National reported statutory net income of $75 million versus statutory net income of $55 million for 12 months ended 12/31/2021. Turning to MBIA Insurance Corp itâ\u0080\u0099s statutory net income was $16 million for the fourth quarter of 2022, compared to a statutory net loss of $40 million for the fourth quarter of 2021. The favorable comparison was primarily due to loss in LAE benefit in Q4 2022, driven by higher statutory discount rates benefiting RMBS and CDO exposure versus loss in LAE expense driven by lower Zohar recoveries in Q4 2021, as well as higher net investment income. For the year ended 12/31/2022, MBIA Insurance Corpâ\u0080\u0099s statutory net income was $46 million, compared to a statutory net loss of $129 million for the year ended 12/31/2021. The favorable comparison was primarily due to a loss in LAE benefit in 2022, driven by higher expected Zohar recoveries versus loss in LAE expense in the prior year, due to lower expected Zohar recoveries, the higher statutory discount rate benefiting mostly RMBS exposure and higher net investment income, partially offset by a decline in net premiums earned."
}