{
    "symbol": "INFY",
    "quarter": 1,
    "year": 2023,
    "date": "2022-07-25 11:44:09",
    "content": "  Operator: Ladies and gentlemen, good day, and welcome to Infosys Limited Earnings Conference Call. Thank you, and over to you, sir. Hello, everyone, and welcome to Infosys earnings call to discuss Q1 '23 financial results, with Sandeep and the IR team in Bangalore. Joining us today on this call is CEO, Mr. Salil Parekh; CFO Mr. Nilanjan Roy; and other members of the senior management team. Please note that anything which we say, except as to our outlook for the future, is a forward-looking statement that must be read in conjunction with the risks that the company faces. We've had an excellent start to the financial year with 5.5% sequential growth and 24.1% -- sorry, 21.4% year-on-year growth in constant currency terms. We continued to gain market share with our Cobalt cloud capabilities and our differentiated digital value proposition, driving a significant pipeline of opportunities for us. For example, a premier online retailer in the U.S. leveraged Infosys Cobalt to embark on a cloud-driven transformation journey to enhance the customer experience and improve the security posture. Clients continue to place an immense amount of trust and confidence in Infosys to help accelerate their digital transformation agenda, both on efficiency and the growth dimension of their business. Growth continues to remain broad based across the segments, service lines and geographies. Each of our business segments grew in double digits, with several of them growing at 25% or higher. In terms of geography, the U.S. geography grew at 18.4%, and Europe grew at 33.2%. Within digital, our cloud work continues to grow faster with our Cobalt cloud capability seeing significant traction with our clients. We do see pockets of weakness, for example, in the area of mortgages in financial services. Within our pipeline, we also have focus in addition to the growth areas of cloud to the cost areas through automation and AI. As we build capacity for the future, our utilization was at healthy levels of 84.7%. And historically, Q1 attrition increases 3 to 4 points sequentially on a quarterly annualized basis. However, our attrition declined by 1 point on a sequential basis, reflecting the impact of various initiatives we have put in place. We are a net headcount increase of over 21,000 employees, attracting leading talent from the market. This is a reflection of our enhanced recruitment capabilities, solid brand and deeper penetration into various talent markets. We have 150 industry-focused solutions, 20 Infosys living labs, 50 experimentation playgrounds and 60,000 knowledge assets. Earlier this month, we announced the acquisition of BASE Life Sciences, a Denmark-based technology and consulting firm in the life science industry. BASE brings to Infosys remain expertise in medical, digital marketing, clinical and regulatory areas. With a strong growth in Q1 and our current outlook on demand opportunity and pipeline, we increased our revenue growth guidance, which was at 13% to 15%, now to 14% to 16% for the full year. With the increased cost environment, we will be at the lower end of this margin guidance. And with that, let me hand it over to Nilanjan for his update. Good morning, everyone, and thank you for joining this call on an early Monday morning. All our business segments and major geos recorded double-digit growth, with manufacturing, communication and shore, along with Europe region recording 25%-plus growth. Sequentially, revenue growth was 5.5%, which was led by a healthy volume growth and some RPP benefits. The number of $50 million clients increased by 10 to 69, creating the next potential . The number of $100 million clients increased by 4 to 38, and the number of $200 million clients has grown by 6 in the last 1 year. We had another quarter of strong employee addition of over 21,000 to cater to the growth opportunities ahead. The fresher addition was particularly strong, which resulted in drop in utilization to 84.7%. As announced earlier, we have given competitive salary increases for majority of employees on April. Given the supply tightness and high prevailing inflation, salary increases across all geos this year are higher than historical levels. Q1 margin stood at 20%, a drop of 150 basis points versus previous quarter. These were offset by tailwinds of 0.5% due to increase in RTP from higher working days, a reversal of our client contractual provision in our FS segment, partially offset by discounts; 0.3% benefit from rupee depreciation benefits, partially offset by cross currency headwinds. Consolidated cash and investments were $4.4 billion at the end of the quarter after returning more than $850 million to the shareholders through dividends, which has led to an increase in ROE to 31%. Free cash flow for the quarter was $656 million, which is a conversion of 95% of net profit. DSO declined by 4 days sequentially to 63 DSO, including net unbilled was 82 days of increase of 1 day versus Q4. We had 5 large deals in retail and CPG, 4 in Hi-Tech, 3 each in financial services and energy utility resources and services, and 2 each in manufacturing and communications verticals. Region-wise, 15 were in Americas and 2 each in Europe and ROW. In financial services, clients have continued to focus on building customer experience, contact center transformation and virtual branches aimed at improving customer engagement. While the order pipeline remains strong across regions, we are seeing some slowness in mortgage industry and lending business due to increased interest rates. In the retail segment, the pace of digital transformation, large-scale cost takeouts and improving business resilience continues to be on the rise across various subsegments. In Communications segments, clients are focused on rapid digitization and protecting their assets from cyber threats. We see enormous potential to partner with them, both on the business transformation agenda as well as in the cost takeout trend. These pipelines in energy, utilities, resources and services segment comprise of opportunities around cost takeout, vendor consolidation, digital transformation, cloud-led transformation and asset monetization across industry sub-verticals. The sector is seeing traction across energy, IoT, supply chain, cloud ERP and accelerated cloud adoption. In quarter 1, we have been ranked as leader in 9 ratings in the areas of Oracle Cloud, SAP HANA, public cloud, Industry 4.0, employee experience and automation services. In this supply-constrained environment, we continue to invest in our growth momentum, which requires us to hire premium skill talent while simultaneously investing in existing employees with competitive compensation increases across geos. Additionally, we expect normalization of costs like travel and other overheads. We will continue to focus on various cost-optimization measures, including rationalization of subcons, flattening of the pyramid, increasing automation, reducing on-site mix and increasing pricing. Whilst we retain our operating margin guidance of 21% to 23%, we expect to be at the bottom end of the range. With that, we can open the call for questions. Salil, I believe you said that the contractual provision was largely offset by discounts. Curious, because on one hand, we are talking of a strong demand environment and potential price hikes and at the same time, we are also talking of discounts. Surendra, the comment was that it's not 0.5% increase in RPP. It's a combination of 3 to 4 elements: the higher working days, the client contractual provision reversal benefit, partially offset by discount. It's not for the same clients, but this is generic discount. And these automatically keep on coming, but we are -- like I said, we come down less as we've started negotiating with our clients in terms of pricing. And just another question on margins, down 360 bps year-over-year. We were really -- 88%, which we've never operated before, the benefits of travel, et cetera. But as we see the demand volume ahead, I think we are very clear that in terms of our ability to support this demand, we certainly have to hire. And now this year, we've already rolled out in March, yes. So within 1.5 years, we've done 3 substantial CRs. And actually, September last year also we did a skill base. And we know that to capture this demand, we have to pay for premium skills. In some cases, subcons for us from an industry, I think leading 6.5 position. But again, these are some things we know over a period of time. And these, we can optimize over this year and over the future as well. So in that sense, we are quite confident, and that's why we have talked about -- we will be in the 21% to 23%, at the bottom end of the range. And of course, if we have 20% today, we will see that improvement as the year progresses. Spectacular numbers, especially on the revenue side of the business. So what the cost has been the utilization and, in fact, higher 21,000 net adds during the quarter, which is well above our volumes. As the hiring has brought up automatically, you see the stabilization of subcon costs, right. As a percentage of revenue, we are seeing this increase every quarter. And over the future, as we got our recruitment track together and being able to hire fresher, we should see benefits coming out of that. Whilst we have seen some adverse impact of the on-site movement, this is largely as travel overseas has picked up, but we think this is more of an aberration in terms of uptick because the inherent story of -- we're taking costs out and having a more offshore mix in the entire cost optimization. That should come into benefits, especially in this environment, where cost takeout is becoming a big theme across that line. We have seen less impact of pricing in terms of discounts, et cetera. We are going back to clients in terms of COLA, in terms of when our renewals happen. Now again, these are much more longer-term impact decision. But I think at least the conversations have started in right earnest across all the segments, and you can hear a similar commentary across. So I think these are the areas we continue to focus on, and that's something we've done over the years. And just as a follow-up, just remind us what's the sensitivity for margins versus utilization rates, i.e. You have a different utilization in on-site, different in offshore and then the impact of pressures in the pyramid in that utilization. We lost in this quarter, I think, 40 basis points become of utilization and margin. So at the end of the fourth quarter, and not just Infosys but across the industry, what the management commentary had indicated compared to that, the margin performance appears to be a sharper decline. Anything, whatever you could give us color on. I think we don't -- yes, so we don't operate in a vacuum and the industry doesn't operate in a vacuum. But the good news, like we said, is that attrition is coming down. And as Salil said, we're already 1% down. On a sequential basis, we were 5% down in the previous quarter, and we were flat. So I think this is more -- the reported LTM, of course, is more of a catch-up effect. And in that sense, you will see start stabilization. Because at the end of the day, if it's putting pressure, you have less attrition. In fact that, that impact should come down. So these are the things which will play, I know, in our favor. And like I said, you've seen these numbers of declines pretty much across industries. But we have, I think, a very, very sharp cost optimization program in a way which will go and offset these headwinds. I think there's no question about that in terms of -- if you see our attrition and our net adds, the gross hiring has been very high, of course, and that tells in terms of fast action and all we have to offer. On BASE, there are multiple things. When we launched our strategy a few weeks ago, just at the start of the quarter, we had shared also a new focus -- or expanded focus on Europe. And then that leads to large technology transformation, digital transformation. My first question is I wanted to get your views on how you think wage inflation will impact the balance of the year, and what are the tensions on that to your margin model. So you mentioned that attrition has, in fact, moved lower. So I think like we started last year, we were very clear that we have to be competitive in the market. And in a way, we have not waited 1 year. There's a little carry-on effect in terms of the more -- we see the higher middle to senior first, which will happen in July, but not in the same margin impact of quarter 1, which was very broad-based. But other than that, I think we think these are quite competitive. And of course, if you see in the mix, we also get a lot of laterals and there's a hidden cost of hiring laterals because they come at sector. So in a way, compensation overall -- weighted average compensation, in any case, is going up across. But I think overall -- I think this is a very competitive hike in terms of -- in India, it's more like high single digits. And in overseas geos, also because of high wage inflation across, we have given very competitive hikes, something which we've not done in this kind of wage environment, inflation environment before. And like I said, we've seen like sort of 3 quarters of the efficient benefits over a period of time going in. It doesn't sound like -- I know you made one very specific industry comment, but it doesn't sound like you're seeing the same any kind of iteration on the demand side, particularly on the negative side. I think what we see on the demand, the pipeline that we have today for our large deals is larger than what we had 3 or 6 months ago. Having said that, we, of course, recognize what is going on in the global environment. He also mentioned our share within financial services, mortgages. On the overall deal discussions, we see a little bit where it's slowing in the decision making. However, the pipeline remains strong for us today. One is deals which are on digital transformation or cloud, which are growth orientated for clients, driving to what they want to do with their customers. Or in their supply chain, how they want to make an impact there. We have a very strong play on cost and efficiency through our automation work, through our artificial intelligence work, where we can really impact the cost base in the tech landscape of our clients. And given our positioning, we feel good that those will start to come into play as and when the environment changes. But today, this is how we are seeing the demand situation. Of course, we are seeing attrition starting to come off a little bit, and that will clearly have a positive impact for us with respect to compensation. Whatever we saw as one-offs in the previous quarter, which included Visa and these contract provisions, both of them have been sort of offset in this quarter. And if so, then the question is that we have 145,000 associates general team below and some 130,000 people in the mid-level. And general understanding is mid-level, obviously, the -- as a percentage of the employee comp cost, it should be higher. If you could just help with that thought process, that will be very helpful. As I said in the margin walk, we had a benefit of 50 bps from -- in RPP, which is a combination of work with clients' contracts and provision reversals, partially offset by discounts. There's no, in a way, what you said that has been eroded. And that impact will be far less than 1.6%, which we've done, which is a much more broad-based across. That's...\n No, no, no. Associate and mid-level, correct. You mentioned, I guess, the subcomponent of retail. We don't quantify typically what part of our financial services, mortgages or the other areas which are impacted. And the way I would sort of look at it is, with all of that, given our pipeline, we've increased our revenue guidance. So largely, we know it was the comps-related hike I said earlier, about 350 basis points. And this was offset by some rupee benefits, which was also a benefit, but there was cost currency as well, which offset probably half of that. So these are the broad things, but the biggest one was comp, which was about 370 bps. Ideally, the strong growth at the headline level should have translated into some operating leverage, but that doesn't seem to be happening. And Nilanjan, we seem to be of the view we'll chase growth for now and focus on margin optimization at a later date. Because this growth margin paradox seemed to be a mere reflection of what is happening in U.S. and U.K. now, a very tight job market, very high nominal growth, but very little benefit trickling down to the bottom line level. So sooner or later, this nominal growth rates may cool off and on-site job markets and some supply costs may or auto recalibrate. But back in India, job market may not be as much of a free market as it is in U.K. and U.S. When we are doing new deals, automatically, we will build it and the industry, in a way, will build it into their wage profile. But in terms of subcon, right, we've operated at 6%, 6.5% of subcon. Today, we're sitting at, what, 11.1%, right? There's no reason for us to be at these levels because we know what wage market, the overall demand environment, our recruiting picks up. We can replace these account with our own headcount, put more pressure into projects. Just one more question, if I may. Sudheer, this is Salil. The pipeline, what we are seeing is there is appetite and we go by different industries for digital transformation programs for large cloud programs, for programs, which start to relate to cost and efficiency. It's not a function of the time line, which the delay that you referenced, which is causing an increase. Now we will see how that evolves, but that's the outlook we have today. Part of that is on the revenue guide, given the potential macro headwinds ahead of us and the ask rate from the second half of this year. And similarly, on margins, we still have another round of wage hikes, which could impact margins by maybe as much as 100 basis points, if I look at the wage hike impact so far and a similar ratio between the first and the second rounds in the previous years and also keeping up travel and facility costs. On the guidance for growth, as we've shared in the past, the approach we take is we see how things are as we look at the financial year today. What we saw is in Q1, we had extremely strong revenue growth, 5.5%. We also had underlying volume growth that Nilanjan referenced, which was very strong. Based on that, we felt comfortable to increase the revenue growth guidance. Whether it's conservative or realistic, that is the approach we take to make sure that we then share what we think the revenue is going to look like for the year. On the margin, I'll start off and then Nilanjan will talk a little bit about the wage component and what we've done. Overall, on the margin, we've made sure that we work to get all of the levers in place. Several levers that Nilanjan mentioned, one of the bigger ones we've got the bulk, the vast majority of our compensation increase already done in Q1. So yes, there's a small component, but it's not really a huge component that will come up. There are areas where we can focus on how the subcontracting works, there are areas where we can focus on discussions with clients, the wage increases and COLA. There are areas where we're doing work, which is driving significant impact from clients. Given where we are, given the inflation around the world, we saw it was clear to make sure that we communicated that in the way we see the market. No, no, that's good. Just a quick follow-up, if I may, on margins. So we had 20 and we are riding at the bottom end of '21, so mathematically it says that this improves going forward, so absolutely. In '23, we will see the improvement quarter-on-quarter. Just wanted your thoughts on how broad based in North America, you not seeing, I think, such progress sustained for a long time. And though you call out some headwinds in BFSI, even that still added quite a bit of revenue. And secondly, the pyramid, we've obviously seen a large impact of freshers last year. But it looks like, given the current utilization as well, it doesn't look like much of that has happened. Ravi, this is Salil. I think it was about demand, but maybe you can just say the first part. So the softness, we are -- as we referenced, we -- in see some pockets of softness within our overall business. So we want to be very clear that, that is something that is visible. A couple of examples you shared, financial services and retail, but there are areas where we see that weakness. However, once we say that, we also have a view and we see it in our pipeline. And I think the second one was about the pyramid, I think. We've hired a lot of freshers last year, and many of them also have gone into training pipeline because, as we had the previous year, there was something really in the pipeline in terms of hiring. So in fact, if you see our utilization, there's a 2% gap between the excluding trainees and including trainee numbers on a year-on-year basis as well. And like I said, you can't overnight. In all projects, put freshers in, and that's why it's important to build the pipeline in advance, make them go through the trainings or enter them into production bench and then move them into projects as well. So that benefit will come in, and we are seeing that slowly coming in. If you just have just in time, it'd be probably sub-optimizing in terms of how fast you can deploy. So that's why we have made these investments because we know it will take time for these freshers to go in, but it's important to make that investment ahead. Yes, it was all recognized this quarter. Salil, can you give some color on the overall order book since the reported TCV, what we gave. Thanks for the question, Pankaj. As you know, we share the large deals win number. Having said that, the main sort of context I would put is the increase in the growth guidance that we provided. That factors in, in that sense, all of the inputs that you may be looking for, which then comes from essentially a very strong Q1 execution, the 5.5%, 21% growth. And then a view that we have on what we see in the coming quarters and then an overall view of how we look at H1, H2 in our mix within the company. On the large deals, we shared this in the past. Typically, this is a number which is a little bit more volatile because we only report deals which are larger than $50 million in our large deals. My second question is on the profitability in the manufacturing vertical, where the margins have been coming down. And in fact, the last 3 quarters, probably they have halved despite a very strong revenue growth. I understand this could be because of a very large deal, which is still ramping up there. So I think without specifically commenting, I think on any particular deal. I think, firstly, there is -- we've seen the revenue growth, which has been quite spectacular in this segment. And as we talked about a large deal approach from day 1, a lot of clients would like to see savings, but we are very clear that over a period of time, that we have a lot of cost optimization because on day 1 you can start -- not on the cost structure, right, whereas clients pay half of the savings. And if I go back to the last 3 years, 4 years, in fact, when the large deal sort of strategy started, we've actually seen an increase in margins over that. We can inject that through all our services, which we are providing. So these are things which we know over the lifetime of these large deals, and that's something we can deploy. So that's something, without getting into specifically manufacturing, what we do well. So firstly, is there any difference in the client decision-making behavior in U.S. versus European signs. But when we look at Europe, there is a weakness, specifically in retail and communication vertical, whereas the other 2 verticals energy side, Hi-Tech has grown very, very well. So just trying to understand, are there any client-specific pockets, especially in Europe, where you kind of see decision-making behavior has changed compared to the U.S. market? Today, we are not seeing that, which is more geography based, as you are describing. And our client base, as you know well, is mainly U.S., Europe and Australia. So not so much color, which is more geography related. Your margin outlook at the lower end, you explained very well the supply side and cost-related factors, which has led to this. So I think, when we do our sort of margin forecast, there's a combination of factors we look at. And that equation keeps on changing, and it's so dynamic, what happened in the previous quarter, what do we see as outlook, what's happened on subcon, wage inflation. Sometimes, we have to push harder on some pages in terms of accelerating some programs, but -- and going back to the whole -- today at '20 and we are saying when we at the bottom end of '21, I think that should give you a good sense of the margin trajectory for the rest of the year. Just on this margin, within a quarter, you have to lower your guidance on the margin side. So this is despite rupee depreciation benefit, despite attrition coming down in the last 2 quarters. So I think like I just mentioned, this is a very dynamic and moving, I could be the forecast completely what is the impact of attrition, how much wage hike will come in for new hires. So in that sense, this is a very fluid situation, but the '21 to '23, we said we are within that but of course, at the bottom end of it. And we remain committed from where we are today at '20 to do all our various cost optimization, factoring the cost impacts of what we see. In terms of wage inflation, there could be potential benefits of the rupee, et cetera. I think like I said, it's a fluid situation and we can remain agile, that's more important rather than anything else. So there, within the areas of the pockets that we described, where we see a slowing. For example, if you look at the mortgage situation, the volume there in the market, meaning the client volume at the macro level, has gone down in the Europe and U.S. market. But the overall point, which I shared earlier, we see some slowing in decision-making, but nonetheless, the pipeline remains today in a good position, and that allows us to increase the guidance. On LTM basis, your deal wins are down sharply, if you see large trailing 4 quarters versus. And even if I adjust the base because of the high value deals which you won in a couple of quarters, 4 quarters back, you're still down minimum by 15%. There, on the large deals, we typically -- we always shared, we've seen some volatility because these are deals which are larger -- the ones we share in this number, which are larger than $50 million in value. And what we referenced in some areas a slowing of it, but we don't see any change in the other parameters on the pipeline. And like -- without going into any specifics, we have seen that growth coming out of large deals in manufacturing. And like I said, as we look at the tenure of these large deals, in some cases, they start off with lower than portfolio margins because clients may ask for savings upfront, but we have a very -- started plan in terms of quarter-on-quarter, what do we need to do to bring back profitability. Salil, this is on mega deals. While the industry frequency tends to be low, and it's been a while for Infosys, it'd be good to know your comments on mega deals from a pipeline perspective. On the mega deals, I think -- again, we don't share anything specific in terms of what we publish. The color from our side is, we have mega deals in our pipeline, if that gives you a context. On the pricing, we've seen pricing currently holding in our deal values for this -- for Q1. My sense is we have seen examples that Nilanjan was sharing earlier where we are working -- we have worked with clients to demonstrate to them the impact of compensation increases, and that has translated to COLA price benefits. Typically, the salary increase happens at a periodic time. And these things where we've not seen a high inflation environment like this for over 40 years in the Western markets, that takes longer time. And that's what, as Nilanjan said, is part of what we've put in place to support our margin as we go ahead there. Ladies and gentlemen, that was the last question. So thank you, everyone. First, we've had industry-leading growth in Q1, 5.5% quarterly, 21% year-on-year. We highlighted there are pockets of weakness, and we are aware of the environment around us. We see in our pipeline, both growth opportunities in digital cloud and cost opportunities in automation. With all of that, we increased the growth guidance for the full year. We have levers for the margin, several that Nilanjan shared. Large programs will transition to a steady state, COLA, because of increases in compensation costs to pricing, pyramid adjustments as we have college hires driving the production environment, subcontractor usage and then several others on the cost side. Given all of that, we feel we are really well positioned to work with clients on their growth and cost opportunities, and have a margin profile that is something that sustains the high-margin approach of the company. And once again, thank you all for joining us and catch up in the next quarter. Thank you, members of the management. Ladies and gentlemen, on behalf of Infosys, that concludes this conference call. Thank you for joining us, and you may now disconnect your lines."
}