{
    "symbol": "ESRT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 17:11:10",
    "content": " In our Manhattan office portfolio, we achieved positive mark-to-market lease spreads in each of the last four quarters, experienced steady net effective rent growth throughout the year, and signed major new and expansion leases with quality tenants, including iCapital, Signature Bank, Progyny, Crown Castle, and others, and leased to just shy of 300,000 square feet of pre-built during the year nearly matching our total volume of pre-built leased in 2019. We've done the hard work, invested in our assets over many years, and are exceptionally well-positioned to lease space and achieve positive absorption again in 2023 We signed office and retail leases of 144,000 square feet in the fourth quarter and over 1.1 million square feet during the full year. 2022 core FFO exceeded our most recent guidance range of $0.83 to $0.85, largely driven by stronger performance at the observatory towards year-end and lower than expected year-over-year decline in full-year same-store NOI of 4.1%, driven by modest same-store revenue growth offset by an approximate 9% higher property expenses as expected. This represents ESRT's third multi-family acquisition as we continue to strengthen our position as a New York City focused company with a strong balance sheet and portfolio with multiple sources of upside that include fully modernized office buildings that benefit from tenants in search of quality and a strong value proposition, everyday retail in high foot traffic locations near mass transit, the Empire State Building Observatory, a high margin business, which continues to experience a strong recovery with even stronger brand recognition compared to pre-COVID and our multi-family portfolio of well amenitized well located assets. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. To conclude 2022 marked a year of notable progress towards ESRT's top four priorities: lease space with 1.1 million square feet leased in 2022 and meaningful occupancy and lease percentage good progress; sell tickets to our completely re-imagined observatory, the only authentic brand amongst observatories one can visit; enhanced shareholder value through our capital recycling out of suburban assets and into multi-family, which is now the fourth leg of ESRT's well diversified cash flow stream, coupled with repurchases of our shares and continued leadership in ESG initiatives."
}