{
    "symbol": "CIVB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 20:54:10",
    "content": " During the first quarter of 2022, our net loans, exclusive of PPP, grew by $48 million or at an annualized growth rate of 10%. Excluding the impact of PPP loans, our loan portfolio grew by an annualized rate of 10%, this despite having $42.5 million in loan payoffs during the quarter. Despite solid loan growth, our net interest income declined $391,000 or 1.7% from the linked quarter, primarily due to the increased interest expense related to our subordinated debt issuance in November and declined $896,000 or 3.8% year-over-year for the same reason. During the quarter, non-interest income increased $832,000 or 12.2% in comparison to the fourth quarter of 2021 and declined $1.5 million or 16.8% year-over-year. Service charge revenue declined by $234,000 or 12.9% compared to our linked quarter and showed an increase of $323,000 or 25.7% over our first quarter of last year. First quarter gains on the sale of mortgage loans were $936,000, a decline of 36.2% from our linked quarter, which was $1.5 million and a 66% decline from the prior year, which was $2.7 million. Wealth management revenue of $1.3 million was consistent with that of the linked quarter and an increase of $131,000 or 11.4% over the prior year as gains in new accounts were offset by declines in the overall market. Additionally, non-interest expense increased $3.1 million or 18% compared to the linked quarter as a result of increases in compensation expense, data processing, marketing and professional fees related to our Comunibanc transaction. Health insurance and incentive expense also increased over the linked quarter by $604,000 and $647,000, respectively, as we trued up accruals at year end and then resumed our normal accrual levels in the first quarter of this year. In addition to acquisition-related professional fees, $91,000 of the linked quarter increase in professional fees was the result of reversing accruals at the end of the prior year to bring them in line with our actual expense. Backing out $27.7 million of PPP loans forgiven during the first quarter, our loan portfolio grew organically by $48 million or at an annualized rate of 10%. Along with strong first quarter loan production, our undrawn construction lines ended the quarter at $120.2 million, giving us confidence that we will grow our own portfolio at a mid single digit rate for 2022. The anticipation of a higher interest rate environment and the pressure it has had on the bond market resulted in a $29.5 million decline from December 31, 2021 to the end of the quarter in other comprehensive income related to our investment portfolio. I appreciate it, guys. I appreciate it, guys."
}