{
    "symbol": "CIVB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 16:24:10",
    "content": " This morning, we reported earnings for the fourth quarter 2022 of $12.1 million or $0.77 per diluted share, which represents a 5% increase over the prior year's fourth quarter. If we adjust for the $2.9 million in nonrecurring expenses associated with the acquisition of Comunibanc Corp, which closed on July 1 and the $814,000 in nonrecurring expenses associated with the acquisition of Vision Financial Group Inc., which closed on October 1, our earnings per share would have been $0.88 for the fourth quarter and $2.80 for the year. During the quarter, loans and leases grew by $218.3 million or an annualized growth rate of 37.5%. Excluding loans and leases from our BFG acquisition, which occurred during the quarter, net loans grew by $150.9 million or an annualized rate of 25.7%. Excluding the addition of loans and leases that came to us through Comunibanc and Vision Financial and adding back the repayment of $46 million in PPP loans, we experienced $356.8 million in organic loan growth for the year, which is an annual growth rate of 18.3%. While the quarter included $3.9 million in revenue from our leasing company, we also experienced increases in virtually every noninterest income category over our linked quarter as we continue to focus on diversifying and strengthening our noninterest income stream. If we back out the impact of the $1.8 million gain on the sale of our visa B stock that occurred in the second quarter of 2021, our noninterest income for the year of $29.1 million was comparable to that of the previous year, as the increases in service charges and leasing revenue offset declines in our gain on sale of mortgage loans. The increase was primarily the result of $637,000 in nonrecurring expenses associated with the acquisition of Vision Financial Group and $1.5 million in nonrecurring expenses associated with the conversion of Comunibanc systems and severance payments to former Comunibanc employees during the quarter. Noninterest expense increased $12.8 million or 16.5% year-over-year as the $3.7 million prior year balance sheet restructuring costs were replaced by increases in compensation expense, occupancy expense, software maintenance expense, professional fees and other nonrecurring expenses related to our Comunibanc and Vision Financial Group transactions. Year-to-date, our total loans increased by $548.8 million, which includes the addition of $167.5 million of loans from Comunibanc, $67.5 million in loans and leases from Vision Financial Group and a $42.6 million repayment in PPP loans. Excluding the Comunibanc, Vision Financial Group and PPP loans, our loan portfolio grew by $356.8 million or on an annualized basis of 18.3%. On the funding side, we reported $203.3 million increase in total deposits from year-end 2021 to 2022 with increases in every deposit category, except interest-bearing demand accounts as customers migrated into higher-yielding deposit accounts. I would note that if we include the credit mark of $5.4 million associated with Comunibanc loans and Vision Financial Group leases, our ratio of allowance for loan losses to loans would have been 1.33% at the end of the year. Although unrealized losses in our securities portfolio begin to moderate in the fourth quarter, we did experience a $67.4 million decline in other comprehensive income from December 31, 2021 to December 31, 2022, related to unrealized losses in our investment portfolio. Vision originated $40.6 million in leases and loans during the fourth quarter at a weighted average yield of 9.2%, and we have budgeted them to originate $164.5 million in leases and loans during 2023. Well, I mean, I guess you never know, but over the last 2 or 3 years, I would tell you that our average deposits from the tax program in the first quarter have been right around and  $240 million, $250 million, and that's been pretty steady each in the last 2 or 3 years. Do you guys are kind of looking at the core run rate here, and you should be getting some more community bank cost saves, like as we're exiting 2023, is like $24 million, $24.5 million of quarterly run rate, is that kind of like a reasonable expectation, I guess, the cost saves offset by some inflationary expenses and investment. Second quarter next year, we'll have our merit increases, and we're looking at probably a $27.1 million second quarter noninterest expense."
}