{
    "symbol": "CIVB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 09:51:37",
    "content": " Even after adjusting for the loans that came to us via Comunibanc, loans grew organically by $93 million or 18% on an annualized basis during the quarter. As I stated, we are extremely pleased with our loan growth for the quarter, excluding PPP fees or PPP loans and the loans acquired via our Comunibanc transaction, we were able to grow loans organically by $93 million or 4.5% for the quarter, which is 18% on an annualized basis. Third quarter gains on the sale of mortgage loans were $637,000, an increase of 11.2% from our linked quarter as we returned to our more typical mortgage banking activity of financing new home purchases. Non-interest expense increased $2.5 million or 4.1% year-over-year as the prior year balance sheet restructuring costs were replaced by increases in compensation expense, professional fees, software maintenance expense and non-recurring expenses related to our Comunibanc transaction. Compensation expense increased $2.1 million or 6% over the prior year, primarily due to annual salary increases, which go into effect each year in April and the addition of approximately 44 former Comunibanc employees on July 1. Excluding the Comunibanc and PPP loans, our loan portfolio would have grown by $198.8 million or at an annualized basis of 13.6%. Making the adjustment for Comunibanc and PPP, our third quarter growth was $93 million or 18% on an annualized basis. On the funding side, we experienced growth in every category except interest-bearing demand with total deposits increasing $291.6 million or 12.1% since the beginning of the year. I would note that if we include the credit mark of $2.8 million associated with the Comunibanc's loans, our ratio of allowance for loan losses to loans would have been 1.31% at the end of the quarter. What I would say is, if you said their average customer was a 3-rated customer in the past, it gives them a little bit of opportunity to bid on some higher quality credit leases, which, let's say a 2 rate credit, which will give them the opportunity to maybe come off that 8% number."
}