{
    "symbol": "CIVB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-31 06:39:14",
    "content": " This morning, we reported net income of $7.7 million or $0.53 per diluted share for the second quarter of 2022, which includes approximately $0.02 per share of expense related to our Comunibanc transaction and net income of $16.2 million or $1.10 per diluted share for the 6 months ended June 30, 2022, which includes approximately $0.04 per share of expense related to our Comunibanc transaction. Net loans, exclusive of PPP, grew by $57.9 million during the second quarter, or at an annualized growth rate of 11.6%. Our net interest income increased $1.3 million or 5.8% from the linked quarter, fueled by low growth and rising interest rates. During the quarter, non-interest income declined $2 million or 26.3% in comparison to the linked quarter, and declined $4.9 million year-over-year. Consistent with prior years, income from our tax program during the first quarter was $1.9 million compared to $475,000 in the second quarter. A $1.8 million gain we recognized on the sale of our Visa B shares as part of our balance sheet restructuring in the second quarter of 2021, contributed to the year-to-date decline, but the primary driver was a $3.5 million decline in gains on the sale of mortgage loans. Second quarter gains on the sale of mortgage loans were $573,000, a decline of 38.8% from our linked quarter, and a 74.2% decline from the prior year gain, which was $2.2 million. Wealth management revenues were consistent comparing our second quarter to the linked quarter, and wealth management revenue year-to-date 2022 increased to $2.5 million from $2.3 million in the prior year, as gains in new accounts and additions to existing accounts kept pace with declines in the overall market. Non-interest expense declined $814,000 or 2% year-over-year, as the prior year balance sheet restructuring costs were somewhat offset by increases in compensation expense, software maintenance expense and nonrecurring expenses related to our Comunibanc transaction. Turning to the balance sheet, year-to-date, our total loans have grown by $66.3 million, backing out the $39.5 million of PPP loans forgiven during the first 6 months of 2022. Along with our strong year-to-date loan production, our undrawn construction lines were at an all-time high of $164.5 million at June 30, giving us confidence that even in the face of anticipated headwinds, we will grow our loan portfolio at a mid-single-digit rate for 2022."
}