{
    "symbol": "COST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-03 21:51:09",
    "content": " Comparable sales in the second quarter for fiscal '22, on a reported basis, U.S. sales increase during the 12-week period was 15.8% and, gas inflation, 11.3%; Canada, 16% reported, 12.4% ex gas inflation and FX; other International, 6.2%; and plus 9% ex gas inflation and FX for the total company reported number of 14.4% on a same-store comparable basis and up 11.1%, excluding gas inflation effects. First line item, merchandise core merchandise on a reported basis was down 75% -- 75 basis points year-over-year and ex gas inflation, down 43. Recall last year in Q2 that the core reported was plus 71 basis points in ex gas plus 63, so still improved to where we were 2 years ago, prepandemic and ex gas. Our 2% reward was higher on a reported basis by 3% and minus 1, excluding gas inflation, a reflection of increased penetration of the 2% reward executive members and other was plus 14 basis points year-over-year. Our reported SG&A in the second quarter was lower or better year-over-year by 94 basis points, and better by 63 basis points, excluding gas inflation, Again, jotting down 2 columns of numbers reported and the second one, ex gas inflation. All told, reported operating income in Q2 increased 35% on a reported basis, coming in at $1,812 million this year compared to $1,340 million a year ago in the second quarter. Partly is our expectations of what we can do in the U.S. and Canada has increased, not just in the last 5 years, but in general, over many years; and it's taken a little longer the time lines internationally, although we've got more feet on the ground and more stuff looking. So if you ask me today, I look 5 years from now, we'll go from 65-35 or whatever excess today, probably down to 50-50 I think the good news with that answer from that perspective is, is that we feel we still have plenty of opportunities in the U.S. and Canada, and we've ramped up our activities to do more in these other countries where we've also been quite successful. The -- if you said -- asked over the next 10 years, we're opening, I think, this year, 16 of our 28 are in the U.S. Our view is there's no reason to think for the next 10 years, we can't open 15-or-so a year in the U.S. Now mind you, 1 or 2 of those are growing to 2 or 3 will be the business centers. We're always -- we've also asked the question, at some point, right now at 72% or 73% of our sales over the executive member, what happens when it gets to 85 or 90, do you eliminate the lower membership. Well, I think a couple of things we've got, not in a big way, but a couple of things we've done is there's probably a little bit more diversification of suppliers, particularly on huge $300 million to $1 billion SKUs."
}