{
    "symbol": "COST",
    "quarter": 1,
    "year": 2022,
    "date": "2021-12-09 23:46:09",
    "content": " Last year include a tax benefits of $145 million, or $0.33 per diluted share, $0.16 of which was due to the deductibility of the $10 per share special cash dividend received by the company's 401(k) plan participants and $0.17 related to stock-based compensation as well an incremental expenses for COVID-19 premium wages of $212 million pre-tax, which was a hit last year in the quarter of $0.35 per share. Membership fee income reported in the quarter of $946 million, up $85 million or 9.9% from last year's $861 million figure. In terms of renewal rates, our U.S and Canada rate came in at 91.6%, up three tenths of a percent from the 12 week earlier figure at Q4 end as well the worldwide rate came in at 89.0%, also up three tenths of a percent from 12 weeks ago at Q4 quarter end -- Q4 end. That portion of the COVID related wages that go into the cost of sales like many of our manufacturing businesses and our bakery departments, given the inflationary pressures and our ongoing efforts to mitigate price increases to our members in the face of inflation as best we can, our Q1 gross margins results on all I think we're pretty good. Well, I think as it relates to a passing on, we've always said we want to be the last to raise the price in the -- first to lower the price, recognizing there's a limit to what you can do based on these cost increases. The biggest thing that impacts margins many often is not only on the buying power side, and arguably, I can't think of any company that has the buying power per item that we do, because we do roughly $200 billion in sales with 4,000 ish items versus anybody else that's doing it with hundreds of thousands of items, or 50,000 items. And so, I guess as you think about last year, and the stimulus I mean, do you think that -- I mean actually I think the consumer, as you get closer to Christmas and New Year's, probably comes back if people are entertaining more, like you said in the baking side. But I feel -- we feel pretty good around here, that one of the things that we've shown over the years that both in good and bad times, we tend to do well, and good times, because people want to spend more and even in less good times people want to save more. In fact, last year's 3.6 included a $340 million or $345 million asset purchase that I mentioned earlier in the Southwest, in Southern California, which is basically a 1.5 million plus square foot facility with lots of acreage to help with our fulfillment as well as our import stuff. And so I think there's, if you said what are the big things take you from the low threes to the low fours over a few years a period, it's more international expansions, which tends to be a little more expensive for location, more expansion, we -- in fiscal '20, we were down to 13 net new units because some delays with COVID."
}