{
    "symbol": "COST",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-22 20:05:26",
    "content": " For the quarter, gross margin on a reported basis came in at 10.18% compared -- down 74 basis points from last yearâ\u0080\u0099s reported gross margin of 10.92%. Ancillary and other businesses, the second line item, plus 20 and plus 34; our 2% reward, 0 and minus 5; LIFO, minus 27 and minus 28; and all told, total minus 74 reported, as I mentioned, and minus 22 on -- excluding gas inflation basis. Our 2% reward, as I mentioned, on an ex gas inflation basis was higher or down 5 -- lower or down 5 basis points, implying higher sales penetration coming from our executive members. And if -- like consumer electronics, if itâ\u0080\u0099s up a little versus up a lot the last two years, incrementally, we know in each of those cases, our numbers relative to industries comparisons are still -- weâ\u0080\u0099re still beating the rest of the industry in terms of sales growth. But net-net, I think that while the 26% number was relatively same at year-over-year Q3 end -- Q3 year-over-year and at Q4 end, again, in talking with Ron and Claudine and the merchants, and again, seeing what weâ\u0080\u0099ve seen just in the last 2 or 3 weeks, itâ\u0080\u0099s going in the right direction, and nobody likes it. I think part of that story has been thrown away because it seems that not only us, but the supermarket retailers and other discount retailers that operate large numbers of gas stations, theyâ\u0080\u0099ve been able to use it to -- as prices went up or went -- even went down a little bit, they didnâ\u0080\u0099t go down as fast as perhaps they could have been, which gives us, in our view, an ability to make a little more and still be the most competitive, in fact, in our view, gotten a little wider. I think, the thing I mentioned earlier about there are some businesses that are doing well with margin like gas business on a smaller way -- in the travel business, those things help us be more aggressive in other areas, or as you mentioned, hold the price on the hot dog and the soda a little longer, forever."
}