{
    "symbol": "COST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-26 18:29:05",
    "content": " Last year's third quarter net income was $1.22 billion, $2.75 per diluted share, which included $57 million pre-tax or $0.09 per diluted share for costs incurred primarily from COVID-19 premium wages. In terms of this year's $77 million pre-tax charge, this was in conjunction with our new employee agreement, again, effective this past March 14th and was primarily to adjust our benefit accrual to account for one additional day of vacation, which is awarded to each employee immediately. As always, starting with sales, net sales for the third quarter increased 16.3% to $51.61 billion and that compares to $44.38 billion reported last year in Q3. For the 12 weeks, excluding the benefit of gas inflation and the headwinds of FX the US came in at up 10.7%, Canada better by 12.8%, other international up $9.1 million, and on a total company basis, ex gas inflation and FX headwinds better by 10.8%, and e-commerce just below 8% at 7.9% for the quarter. Moving down the income statement to membership fee income reported in Q3, $984 million or 1.91 as a percentage of sales, compared to last year's $901 million or 2.03 as a percentage of sales. So in terms of our core merchandise margins on a reported basis, they were down 87 basis points versus last year, down 46 basis points ex-gas, ancillary and other plus six reported and plus 18 ex-gas, 2% rewards plus eight and plus three; LIFO, minus 25 basis points on a reported basis and minus 27% ex gas inflation; and finally, other minus one with and without gas. Our reported SG&A in the third quarter was lower or better year-over-year by 84 basis points, coming in at 8.62% and that compares to last year's reported 9.46% SG&A figure. Who's going to whisper the answers, if you're the one doing all of the... Can you tell on the core on core margin ex gas, it looks like underlying run rate got a little worse, which I don't think is a big surprise given what we're hearing out there. So we've gradually seen over the last two years since the pandemic started about a 10% bump in our first year renewal -- our first year members, if you will, which we view as very favorable because we obviously signed up a lot of new members that hadn't tried us."
}