{
    "symbol": "TWLO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 20:16:10",
    "content": " And so as we have both U.S. customers as well as customers that reside internationally, that continue to send messages internationally, you're going to have a slightly lower gross margin just as a result of the fact that international messaging margins are structurally lower, and that's kind of what's been the drag on our business. What I would say is that, in general, while that has kind of a margin rate effect, we do feel good about the growth in overall messaging, and it's still a major entry point for us with customers and it opens a lot of opportunities related to what Elena talked about a moment ago. And when you kind of think about like how many solutions are out there that can really, really help power these new and emerging and novel customer engagement like full life cycle solutions, there really aren't that many out there. That said, we also know that with these solutions, there are -- there's pipelines being built and deals going down in the market every day, and we want to make sure that we're meeting customers where their sales cycle is taking them and with what their process looks like. So I'd say, just to start off with, as we mentioned, that so far, at least, like we're not really seeing any material impacts in our business relative to kind of the macro picture. I mean I think for us, like our focus is still very much on making sure that we are harnessing the demand that's out there and just making sure we're introducing the best of everything we have to operate into the market. And so even if budgets get, for a short period of time, scrutinized or held as people are sort of holding their breath waiting for additional economic data, we also feel really comfortable that when the exhale happens, we're there waiting and that we present a really phenomenal opportunity particularly in our solutions that allow people to know, engage, sell to, sell through their own customer base that we stand to benefit from that in the end. So we think it's a very, very natural progression that where we started with a fantastic business in communications, that we then help customers make sure that those communications are the right communications, at the right time, through the right channels, to the right individuals to make the whole flywheel turn better and faster. I appreciate you haven't really seen any sort of kind of macro headwinds to the business, but we are absolutely seeing churn pop-up in other customers, particularly customers, vendors that have exposure to kind of that SMB smaller customer cohort. But it still is a great environment for the CDP given that customers actually do have a lot more time to actually make these thoughtful changes, and we are already seeing some fantastic stories from the customer base emerge that really is giving our customers confidence that this first-party data approach is not just going to be tenable, like it's a big change for folks."
}