{
    "symbol": "TWLO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 21:59:03",
    "content": " And we're not -- it's not like we don't see the macro environment, whether it's economic or geopolitical, but we just think this business is extremely well positioned to capitalize on ongoing company's digital transformation efforts. Other ones like retail, clienteling -- and we've got a lot of customers that we've planned to over the history of using us for that, whether it's companies like Nike who use Flex to allow their salespeople, they call math leads in the stores. And that's why we're investing in the product road map that we are because we are hearing from companies that, yes, like engaging you're not 2-way conversation is really the future of how they're going to build a real relationship with their customers. And look, I think Engage is filling a hole in the market with a platform that is built to help B2C companies, in particular, first of all, really understand their customers in terms of data and then execute on that understanding by personalizing every part of the journey and like empowering the employees with these Engage apps we're building. So not only is Twilio obviously doing that for our own customers and our own employees and everything like -- the things that every company is doing to comply with privacy, but we're also building products that are helping our customers through this like Segment. I mean we're seeing customers take Flex on like for the first time like Compass was the one we talked about in the prepared remarks today, but we also see companies expanding their use cases like a Global 2000 financial services company, a Global 2000 automaker, I mean, these are companies we've referenced on prior earnings calls. I think what I would go back to is that what we're finding both based in our conversations on the ground with customers, what we're seeing in our revenue line, what we're seeing in some of the research that we've done and what others have done is that digital transformation continues to remain a top boardroom priority. And so we've just gotten started with those verticals, and I think there's a lot more that now Elena and her team are going to be able to do in helping customers solve their different problems in those areas, and we stand ready to do that with them."
}