{
    "symbol": "TWST",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-04 14:45:05",
    "content": " We continued our momentum through the first quarter of fiscal 2022, reporting a record revenue of $42 million and almost $50 million in order, setting the stage for robust growth in 2022. For NGS, revenues and orders for the quarter were $19.2 million and $21.8 million, respectively. We reported biopharma revenue of $4.8 million for the quarter and $5.6 million in orders, which includes one month of Abveris. Revenue for quarter one was $42 million, which is a sequential growth of 11% and year-over-year growth of 49%. Gross margin for the first quarter was 35.6%, and we shipped to approximately 1,800 customers for the quarter, and that’s up from 1,500 in the first quarter of fiscal 2021, and we ended the quarter with cash and investments of approximately $409 million. NGS orders for the first quarter were $21.8 million, which is an increase of 28% year-over-year. And during the quarter, we received orders from approximately 700 NGS customers, and the top 10 accounts placed orders of approximately $7 million as compared to approximately $10 million for the top 10 in the previous quarter, confirming we’re seeing continued diversification of our customer footprint. Orders rose to $22.2 million in the first quarter, up from $20.1 million in the fourth quarter of fiscal 2021. This sequential growth of 10%, and up approximately 40% from $15.9 million in the first quarter of fiscal 2021. We continue to scale our biopharma business, including Abveris as orders rose to $5.6 million for the first quarter, and that’s up from $3.4 million in quarter four compared to $1 million in the first quarter of fiscal 2021. Revenue for the first quarter was $42 million, representing approximately 49% growth from $28.2 million in the first quarter of fiscal 2021. NGS product revenue was $19.2 million, in the first quarter of 2022, and that’s 23% growth year-over-year. Our SynBio product revenue for the quarter was approximately $18 million, up from $13.9 million in the same quarter of fiscal 2021. Genes revenue was $13.5 million, up from $8.9 million in the first quarter of fiscal 2021. Biopharma our revenue for the quarter was approximately $4.8 million, which includes one month of Abveris. Health care revenue in quarter one was $21 million, up from $16 million in the first quarter of fiscal 2021. Even though we’re operating in a pandemic where many academic labs were impacted globally, our academic revenue was $7.9 million versus $4.9 million in Q1 2021, reflecting our continued focus on growing the long tail, and agricultural revenue was $0.6 million versus $0.2 million in the first quarter of fiscal 2021. APAC had a terrific quarter one, with a revenue of $4 million, up from $1.8 million from the first quarter of fiscal 2021. U.S., which includes Americas, revenue was $22.6 million in the first quarter of fiscal 2022 versus $17.3 million for the same period of fiscal 2021. Our quarter one operating expense, which includes R&D, SG&A and change in fair value of acquisitions was approximately $71 million. R&D for the quarter was $22.6 million, an increase from $19.4 million in quarter four, primarily due to increased biopharma spend associated with Revelar and the Abveris acquisition. Our SG&A costs in quarter one was $51.1 million as compared to $38.2 million in quarter four due to an increase in stock-based comp of approximately $9 million, change in fair value of contingent considerations and indemnity holdbacks for the quarter resulted in a gain of $2.8 million. Our net loss before tax was approximately $56 million as compared to $40.9 million for quarter four, primarily due to the aforementioned increases in operating expenses primarily stock-based compensation and costs associated with Revelar. In quarter one, we recorded a tax gain of $10 million associated with the Abveris transaction, which brings our loss after tax to approximately $46 million. NGS revenue is estimated to be in the range of $94 million to $96 million as we’re projecting strong second half, based on our increased pipeline production scaling. Biopharma revenue, including the Abveris acquisition, is estimated to be in the range of approximately $25 million to $30 million as compared to previous guidance of $22 million to $27 million. Your line is open. Your line is open. So, if you just step back and look at the numbers, we billed about $19 million in the first quarter, and we're seeing significant step-up from that as we progress through quarter three and quarter four. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}