{
    "symbol": "TWST",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-18 10:18:04",
    "content": " This morning, we reported record revenue of $203.6 million for fiscal 2022 and $57.3 million for the fourth quarter. This workflow speed and efficiency continues to provide the foundation for our revenue growth, specifically for Synbio, we reported revenue of -- million for 2022, an increase of more than 50% year-over-year and $21.6 million for the fourth quarter. We continued our strong back half of the year with $29.2 million in revenue for the quarter, bringing our NGS revenue for fiscal 2022 to just shy of $100 million, coming in -- above our guidance. Orders coming at $28.2 million for the quarter, and we expect fiscal 2023 to again be back half loaded, similar to 2022. In biopharma, we reported $24.2 million in revenue for the fiscal year, tremendous growth over fiscal 2021 and yet still just short of our guidance. Importantly, orders for the fourth quarter remained strong at $9.4 million, and we fully expect strengthened biopharma return in fiscal '23, given that in the conversations we are having, our positioning as the high-quality local feeder with a net partner now more than ever. Revenue for quarter four was $57.3 million, which brings our revenue for fiscal 2022 to $203.6 million with year-over-year growth of 54%. Orders were $62.1 million for the quarter, which brings orders for the fiscal year to approximately $226 million and that's an increase from $160 million last fiscal year and 42% growth year-over-year. We shipped to approximately 3,300 customers, and that's another record for Twist, and we closed the year with cash and investments of approximately $505 million. Our NGS business has another strong year and revenue was $99.3 million, which is 37% growth year-over-year. Our fourth quarter revenue was $29.2 million, and that's an increase of 36% year-over-year. The Synbio revenue for the year rose to $80 million compared to $52.7 million in fiscal 2021, and that's an increase of 52%. Genes revenue increased to $61.5 million, and that's up from $39 million, and we shipped approximately 558,000 genes in fiscal 2022 and a significant increase from $372,000 in the previous fiscal year. Oligo Pools had a strong year with revenue of $12.4 million, up from $8 million in fiscal 2021 with increased demand primarily from the Healthcare segment. We continue to scale our antibody discovery business and revenue for fiscal 2022 was $24.2 million, up from $7 million in fiscal 2021. APAC continues to deliver robust growth for revenue increasing to $19 million in fiscal 2022 from $10.3 million in fiscal 2021, and the US revenue was $122.5 million in fiscal 2022 versus $77.9 million in fiscal 2021. Our operating expenses for the fiscal year, including R&D and SG&A change in fair value and mark-to-market adjustments of acquisitions was approximately $319 million as compared to $204.4 million in fiscal 2021. To break it down, R&D for the fiscal year was $120 million, an increase from $69 million in fiscal 2021. Antibody R&D was $25 million in fiscal 2022, up from $15 million, reflecting our continued investment in our antibody discovery business. SG&A for the fiscal year was $212.9 million, an increase of $135.9 million in fiscal 2021, and this includes compensation costs of $136 million, which includes stock-based comp of $65 million. Start-up costs in SG&A for Portland were $16 million in fiscal 2022, including approximately $6 million in compensation costs. Our net loss before taxes was $234.8 million for fiscal 2022, as compared to $152.7 million for fiscal 2021, primarily due to higher OpEx costs we highlighted earlier. Portland CapEx for fiscal 2021 and fiscal 2022, accumulative is a total in average of $87 million, which includes $46 million for improvements, $34 million for lab equipment and $7 million for capitalized software. We exited the fiscal year with $59 million in inventory and cash and investments of approximately $505 million as of September 30, 2022. We enjoyed strong bookings in quarter four, another record year of growth, however, due to the macroeconomic environment and as more SARS-CoV-2 variants continue to manage along with seasonal vacations this quarter, we're projecting our Q1 revenue to be approximately $54 million. Our fiscal 2023 gross margin is projected to be 39% to 40%, and our operating expense projected to be approximately $365 million for the year, which includes $138 million in R&D and $227 million in SG&A. Our net loss guidance before taxes for the year is expected to be approximately $260 million, which includes stock-based comp of approximately $83 million, depreciation and amortization of approximately $26 million and data storage expense of approximately $46 million. CapEx for fiscal 2023 is projected to be approximately $50 million, with another $20 million expected to be deployed in Wilsonville, and cash balance projected at year-end of fiscal 2023 is expected to be $300 million. For fiscal 2024, we're projecting revenue to be approximately $350 million, and that includes $50 million for antibody discovery. Gross margin of approximately 49%, OpEx to be approximately $386 million and operating loss to be approximately $215 million which includes stock-based comp of approximately $90 million, depreciation and amortization of approximately $35 million and data storage OpEx of approximately $57 million, CapEx were anticipating to be $40 million, and the year-end cash balance in 2024 is related to be $170 million. One moment for our next question. One moment for our next question. Just looking at the fiscal 2024 guidance on the OpEx is $386 million, I know that there's $57 million of that is DNA storage. One moment for our next question. I think in terms of overall, in terms of factory of the future, we've made, what, about $87 million investment, we got another $20 million to go, and that's consistent with the previous guidance we've given. One moment for our next question. The leasing expenses related to the Factory of the Future is part of startup and that prior to factory qualification that is sitting in SG&A, and that was $16 million for this year, and we call that out every quarter. In terms of investments in terms of R&D, if you look at our R&D, that was another point made in the short report that our R&D increased from $70 million to $120 million, where we increased the investment in Synbio NGS from $37 million to $56 million slide in this just to give transparency. One moment for our next question."
}