{
    "symbol": "TWST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-05 20:52:08",
    "content": " During the second quarter, we continue to serve a growing list of customers, delivering record revenue of $48.1 million and $55 million in orders. Of note, our revenue for the first half of fiscal 2022 is equal to our revenue in all of fiscal 2020 at $90.1 million, illustrating our rapid growth and continued commitment to executing quarter-over-quarter. To review the second quarter, for synbio, we reported revenue of $18.4 million with strong order of $23.6 million indicating continued growth ahead. Revenue was $48.1 million, sequential growth of 15% and year-over-year growth of 54%. We shipped to approximately 2,000 customers for the quarter, growing from approximately 1,800 in the first quarter of fiscal '22, and we ended the quarter with cash and investments of approximately $604 million. NGS orders for the second quarter were $23.6 million, which is an increase of 27% year-over-year and up sequentially from $21.8 million. And the top 10 accounts placed orders of approximately $8 million, confirming that we're seeing continued diversification of our customer footprint. We saw robust growth in our Synbio orders, which includes genes, DNA preps, IgG, libraries and oligo pools, which rose to $23.6 million in the second quarter. We continue to scale our biopharma business as orders rose to $7.8 million for the second quarter, and that includes Twist Boston, and up from $5.6 million in quarter 1 and $2.6 million in the second quarter of last year. NGS product revenue was $23.1 million in the second quarter, a 36% growth year-over-year and sequential growth of 20%. With the continued growth in our pipeline and bookings, we believe we're well positioned to achieve our NGS revenue guidance of $94 million to $96 million for fiscal '22. Genes revenue was $14.2 million, up from $13.5 million in the first quarter and $9 million in the second quarter of fiscal '21. Now to biopharma, our revenue for the quarter was approximately $6.6 million as compared to $1.3 million in the second quarter of fiscal '21, and we serve 79 customers, including 55 through Twist Boston. Our academic revenue was $9.5 million versus $5.6 million in the second quarter of fiscal '21, reflecting our continued focus on growing the long tail of the market. APAC continues to deliver strong growth, with revenue increasing to $4.5 million, up from $2.7 million in the second quarter of fiscal '21. In the U.S., including Americas, revenue was $28.5 million for the second quarter versus $18.6 million for the same period of fiscal '21. Our Q2 operating expense, which includes R&D, SG&A and change in fair value and mark-to-market adjustments of acquisitions, was approximately $79.2 million as compared to $70.9 million in the first fiscal quarter of '22. To break it down further, R&D for the quarter was $31.2 million, an increase from $22.6 million in quarter 1, primarily due to increased spend associated with biopharma, including Ambers and Revolo, IgG and data storage. Our net loss before tax was approximately $60.8 million as compared to $56 million for quarter 1, primarily due to increased investment in R&D and higher stock-based compensation, offset by higher gross margin. For the year, we're increasing our revenue guidance, which is now expected to be in the range of $191 million to $199 million, up from the previous guidance range of $189 million to $198 million. Mile revenue is estimated to be approximately 71% to 73%, and that's up from previous guidance of $70 million to $72 million. Biopharma revenue, including Twist Boston, is estimated to be in the range of approximately $26 million to $30 million. Operating expenses, which includes R&D, SG&A and mark-to-market adjustments are expected to be approximately $335 million for the year, including $130 million in R&D expenses, as we previously guided, including approximately $40 million of D&A data storage spend. And as we continue to execute, we believe we have the cash runway to achieve adjusted EBITDA breakeven for the core business at $300 million revenue per year. That's a great question. I mean overall, we're targeting for a factory future $300 million revenue, about 50%, 52% gross margin, adjusted EBITDA breakeven. That's a great question. That's a great question. And in terms of guidance for this year, we've always said the second half is a bit stronger, and we feel good about we're positioned for the $94 million to $96 million for -- and you saw our bookings increase sequentially this last quarter. That's a great question. That's a great question."
}