{
    "symbol": "AMD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 21:40:27",
    "content": " Fourth quarter revenue increased 16% year-over-year to $5.6 billion, driven by significant growth in our Embedded and Data Center segments which accounted for more than 50% of overall revenue in the quarter. In our Embedded and Data Center segments, we believe we are well positioned to grow revenue and gain share in 2023 based on the strength of our competitive positioning and leadership high-performance and adaptive product portfolio. Fourth quarter 2022 revenue for $5.6 billion was up 16% from a year ago, driven by higher revenue in the Embedded and Data Center segment, partially offset by lower Client and the Gaming segment revenue. Gross margin was 51%, up 70 basis points from a year ago, primarily driven by richer product mix with higher revenue in Embedded and Data Center segment, partially offset by lower Client segment revenue. Revenue was $1.7 billion, up 42% year-over-year, primarily driven by strong growth in third-generation EPYC server processor revenue and the early ramp of fourth-generation EPYC processors. Client segment revenue was $903 million, down 51% year-over-year due to reduced processor shipments resulting from a weak PC market and significant inventory correction across the PC supply chain. Gaming segment revenue was $1.6 billion, down 7% year-over-year due to lower gaming graphics revenue, partially offset by higher semi-customer product sales. 2022 revenue was $23.6 billion, up 44% year-over-year, driven by increased Embedded, Data Center and the Gaming segment revenue, partially offset by lower Client segment revenue. Gross margin was 52%, up 370 basis points from the prior year, primarily driven by richer product mix with higher revenue from Embedded and Data Center segment, partially offset by lower Client segment revenue. 2022 operating income was $6.3 billion, up $2.3 billion, an increase of 56% from a year ago resulting in operating margin of 27% compared to 25% in 2021, primarily driven by higher revenue and gross margin expansion. For the first quarter of 2023, we expect revenue to be approximately $5.3 billion, plus or minus $300 million, a decrease of approximately 10% year-over-year and 5% sequentially. Your line is now live. And so as Jean said in the prepared remarks, we would expect margin expansion as we go into the second half with the growth in Data Center, Embedded and some normalization of the client business as well. Your line is now live. Your line is now live. The major headwind we are facing is really Client side, which if you think about the gross margin in the first half of 2022 versus the first half of 2023, the major impact is from the client revenue, inventory correction, which impact the gross margin in the Client segment. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}