{
    "symbol": "AMD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 21:23:06",
    "content": " Before we begin, I would like to note, Dr. Lisa Su will attend the Goldman Sachs Communacopia and Technology Conference on Thursday, September 15; Victor Peng, President of our Adaptive and Embedded Computing Group will attend the Rosenblatt Second Annual Technology Summit, The Age of AI Scaling on Tuesday, August 23; Ruth Cotter, Senior Vice President of Marketing, Human Resources and Investor Relations, will attend the Jefferies Semiconductor IT Hardware and Communications Infrastructure Summit on Tuesday, August 30; and AMDâ\u0080\u0099s third quarter 2022 quiet time is expected to begin at the close of business on Friday, September 16. Looking at our broader data center opportunities, we saw strong growth year-over-year for our industry leading FPGA and networking products with cloud and financial customers. We are on track to launch and ramp production of Genoa as the industryâ\u0080\u0099s highest performance general-purpose server CPU later this year, positioning our data center business for continued growth and share gains. Looking at our Embedded segment, revenue grew significantly year-over-year to $1.3 billion, led by robust demand across all markets and nodes for our FPGA and Adaptive Computing products. Second quarter revenue was $6.6 million, up 70% from a year ago, driven by higher revenue across all segments and the inclusion of Xilinx revenue. For the third quarter of 2022, we expect revenue to be approximately $6.7 billion, plus or minus $200 million, an increase of approximately 55% year-over-year, primarily led by growth in the Data Center and Embedded segments. For the full year, we continue to expect revenue of approximately $26.3 billion, plus or minus $300 million, an increase of approximately 60% at the midpoint led by growth in Data Center and Embedded segments. Your line is now live. So in terms of the Q3 and the Q4 guidance, so if we would start first with Q3, I think the Q3 guidance implies that, first of all, the revenue growth is led by the Data Center, as well as some increase in our semi-custom or Game Console business, which historically peaks in the third quarter. Your line is now live. In the current guidance for the full year and the second half, what weâ\u0080\u0099re saying is that we continue to see strong demand in the Data Center, in our Embedded business, as well as in the Console business. Your line is now live. As it relates to the consumer graphics, I would say that as we entered this year, we were coming off of a very strong 2021 for consumer graphics where gaming demand was very high, we have seen a slowdown here in the second quarter, and we expect that is somewhat due to sort of demand now â\u0080\u0093 sort of the supply now and more supply versus demand, as well as some of the macro issues as it relates to consumer spending. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}