{
    "symbol": "CNK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 14:48:02",
    "content": " Following numerous examples of strong individual film performance in the first quarter that delivered results in line or better than pre-pandemic expectations, the second quarter marked another significant step forward in the resurgence of the theatrical exhibition industry's recovery from COVID-19. As a result of our sustained investments over the years, the operating enhancements we've made throughout the pandemic and the further advancements we are achieving through our strategic initiatives, we believe Cinemark remains exceptionally well positioned to navigate our industry's ongoing recovery and fully capitalize on a continued resurgence in moviegoing. International delivered its highest post-pandemic results in the second quarter with total revenue of $143.3 million, adjusted EBITDA of $27.2 million and a 19% adjusted EBITDA margin, underscoring our international segment's ongoing recovery. Please proceed with your question. Please proceed with your question. Please proceed with your question. And we're also optimistic that, the traditional streaming players as they're looking for new sources of revenue, and they're looking to compete in an environment now that has got significantly growing competition, that we think, there's a lot of mutual benefit in partnering together more extensively on larger theatrical releases with that content, which also is another source of product to fill any type of gap in volume. Please proceed with your question. Please proceed with your question. As those factors continue to improve as more volume gets released and we distance ourselves from the pandemic, we think that, that attendance is going to continue to recover and rebound and that's certainly our focus is that's our number one focus is how do you build audiences with a wider range of content, with more sophisticated marketing tactics and make sure that when you've got them, you're just giving them an absolutely fantastic experience that keeps the one come back. Please proceed with your question. Please proceed with your question."
}