{
    "symbol": "CNK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 12:19:03",
    "content": " The combined impact of our investments and advancements in technology, premium amenities, food and beverage, marketing and loyalty programs, and guest service, along with solid operational planning and execution, drove our box office outperformance in the first quarter as well as our positive adjusted EBITDA results. Our average ticket price was broadly in line with the prior quarter and remained elevated relative to the equivalent pre-pandemic period due to three key factors: first, a favorable ticket type mix driven by the strong performance of alternative content in the quarter, which tends to have a higher average ticket price as well as fewer matinee and weekday show times and a lower mix of child tickets; second, strategic pricing actions; and third, a higher mix of premium large format box office. Your line is open. Thanks for the question, Mike. Your line is open. And when we look at the actual gains that were made in box office both at the end of the year and first and fourth quarter as well as during the first quarter, we saw gains that were similar to the U.S. And as you've seen from our results, our second quarter, we delivered our second straight quarter of positive EBITDA in our Latin American business in the first quarter of 2022. Your line is open. Your line is open. Your line is open. Your line is open. The first one, Sean, on Latin America, just curious when you think through your time and capital spend in that region if you feel like the sort of historic strategic rationale for operating there still holds in the sort of new normal environment that we're entering here and if you sort of thought through strategic alternatives or reducing your footprint from that region, sort of reallocating your time and capital to U.S. network, your balance sheet and capital return to shareholders, is the first question? Thanks for the question, Mike. Your line is open. As you think about kind of the go forward, I think one thing to keep in mind is there's a lot of puts and takes right now across the business globally, box office and attendance certainly the biggest drivers, but also you've seen big outperformance from us from a market share perspective as well as elevated ATPs and per caps. Your line is open."
}