{
    "symbol": "ALGM",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-31 12:27:06",
    "content": " Our growth continues to be driven by ongoing momentum in our e-mobility and industrial markets with sales in these strategic focus areas, increasing 11% sequentially and 56% year-over-year. Coming off the strong quarter, along with the fourth quarter guidance, we're increasing full year sales growth expectations to 26% over fiscal 2022. In fact, e-Mobility applications expanded to a record 43% of Allegro's third quarter automotive sales, reflecting the combined contribution from our sensing and power products. According to recent third-party reports and adjusted to align to our fiscal year, global auto production is projected to be 83 million units, an increase of 8% compared to fiscal 2022 and is projected to increase by another 4% in fiscal 2024. Now turning to Q3 results, sales were $249 million; gross margins were 58%; operating income was 30.3%; and adjusted EBITDA was 35.4%. Record sales, combined with strong gross margin performance, contributed to EPS of $0.35 per share, an 84% increase year-over-year. Sales to our automotive customers were $170 million or 68% of Q3 sales, an increase of 8% sequentially and 30% year-over-year. Within automotive, e-Mobility sales increased 15% sequentially and 54% year-over-year. Industrial sales were $51 million, an increase of 6% sequentially and 60% year-over-year. And other sales were $28 million, a decrease of 14% sequentially, but an increase of 15% year-over-year. From a product line perspective, magnetic sensor sales were $154 million, an increase of 10% sequentially and 25% year-over-year. Sales of power products were $95 million, a decline of 3% sequentially and an increase of 50% year-over-year. And net income was $68.8 million or $0.35 per diluted share, an increase of 13% sequentially in 84% year-over-year. Finally, turning to our Q4 outlook, we expect sales in the fourth quarter to be in the range of $260 million to $270 million, and at the midpoint of this range, we are projecting a full year sales increase of 26%. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}