{
    "symbol": "CFMS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 15:04:03",
    "content": "  Operator: Good morning, and welcome to the First Quarter 2022 Earnings Conference Call for Conformis. I would like to remind you that this call will include forward-looking statements within the meaning of the federal securities law, which are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These statements involve material risks and uncertainties that could cause actual results or events to materially differ from those anticipated or implied by these forward-looking statements, including those discussed in the Risk Factors section of Conformis' public filings with the U.S. Securities and Exchange Commission. Conformis disclaims any obligation, except as required by law, to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. This conference call will include time-sensitive information and is accurate only as of the live broadcast today, May 4, 2022. I will now turn the call over to Mark Augusti, President and Chief Executive Officer of Conformis. Thank you, and welcome, everyone, to our first quarter earnings call. We had a quarter of steady progress with our Identity Imprint Knee System, our new Platinum Services program and the products in our development pipeline. The clinical feedback remains compelling, and we continue to see a positive response from the ASC market, which is the primary target for this product. Importantly, Imprint is already on contract at nearly 70% of our existing accounts, an average price that is roughly the same as our total Identity. We remain on pace to transition to the full market release in June, at which time we anticipate that we will have Imprint in contract with well over 90% of our customers. To support the full launch, we have a series of training and medical education events planned to drive further awareness and expand surgeon access. The market has reacted very favorably to this new Imprint knee offering, and we expect this to continue as we target the ASC setting. Since its launch on January 6, interest has been strong from ASCs and hospitals. To date, we've enrolled 18 health care facilities in the Platinum Services program, and the pipeline remains robust, including many competitive accounts. That being said, our team is energized with the new business opportunities that Platinum Services is creating with current and competitive accounts. Another favorable achievements to report in the past quarter is the way we are extending our brand presence through a strategic partnership with Synchrony Financial, a leading consumer finance company. Synchrony has added our Platinum Services program to their successful CareCredit offering, which is accepted at more than 250,000 providers in health care-focused retail location and has more than 11 million cardholder accounts. And now with CareCredit, we're making sure patients have increased access and choice in their health care journey. As we look to the future, we do not expect an immediate snapback in procedure levels, but we also do not anticipate any further major COVID-related shutdowns. COVID-related issues, combined with our business model transition, has put our product gross margins under pressure over the past few quarters with a  impact in Q1. Recently, we've made strides at improving staffing level, and I'm pleased to report that we're currently at about 90% of our target levels. It's important for me to point out that we believe these challenges peaked in Q1, and our gross margin will show sequential improvement throughout the year. I'm confident in our ability to do this, especially given that this is a significant area of focus for the newest member of our executive team, Mike Fillion, who started with us on April 1 as our COO. This is a new position for us, but one we planned to add for a while. The uncemented option will be first available with our Imprint Knee System, and then we evaluate expanding the technology to our fully personalized platform. Product revenue is our most important financial metric, and we had a nice start to the year. We generated $14.9 million of product revenue, which is 8.6% growth over our first quarter last year. This was better than our expectations, primarily due to fewer Q1 scheduled surgeries pushing out to future quarters. Within product revenue, sales of our Conformis Hip System were approximately $800,000, up 18% compared to last year's first quarter. As good as we felt about our product revenue results, we had a similar level of disappointment in our product gross margin for the first quarter, which was 34.1%. Although we indicated on our last call that this metric would be under pressure and should be in the high 30s during the quarter, our plant continued to operate inefficiently. We experienced higher manufacturing scrap, and we continue to face macro headwinds, including inflationary pressure, higher input costs, supply chain constraints and labor shortages. Additionally, our cancel case inventory expense was higher than forecasted as this remained elevated during the quarter. Unscheduled surgeries can still occur, and we continue to work with health care facilities to establish procedural dates for these cases. We are focused on improving these issues impacting our product gross margin, although we expect the macro headwinds will remain an overhang. As Mark mentioned, we are now running about 90% of capacity from a workforce perspective, so we have bridged the gap on personnel. By doing so, we will improve labor efficiencies, lower scrap, improve delivery performance and accelerate our inventory builds to support our Imprint full commercial launch. I'm excited Mike Fillion has joined the Conformis team, and I'm looking forward to working with him to get these metrics back in line over the next few quarters. For now, our forecast show product gross margin sequentially improving in Q2 to the mid- to upper 30s and low 40s in the second half of the year. Longer term, we believe that as we ramp Imprint and the Platinum Services program, we have a meaningful opportunity to further expand our gross margins. We had $1.6 million of higher costs in sales and marketing, which was partly due to the timing of the AAOS trade show, which occurred in the third quarter last year. Additionally, we had higher commission and employee-related expenses as we continue to invest in our commercial team to support our growth strategy. R&D expense increased by $900,000, primarily related to employee and project-related costs required to support our product pipeline. And lastly, we had $2.7 million of higher G&A expenses driven by professional fees related to IP litigation and higher delivery expense as we again relied heavily on expedited shipping methods because of our manufacturing capacity challenges. Accordingly, we continue to expect operating expenses to be between $75 million and $81 million for the year. As highlighted last quarter, we are building our inventory balance on Imprint knees. We expect this build to continue, and we also add the initial inventory production for the Cordera hip over the coming quarters to support our product launch cadence. Net cash flow in the first quarter was $17.8 million use, which was higher than in recent quarters. The increase was driven by lower margins, higher operating expenses, timing of onetime annual payments and changes in working capital. First, sequentially from Q1 2022, it is important to keep in mind that in 5 of the past 6 years, our second quarter product revenue has been lower than the first quarter due to general seasonality trends. Second, I want to remind you that last year's second quarter had significant rescheduled activity from Q1 delayed surgeries during a period of heightened procedure recovery. While our entire business was impacted by this in Q2 last year, our hip business had an even more pronounced level of rescheduled case activity that resulted in a relatively high Q2, making for a difficult comp from a year-over-year perspective. So taking all of this into consideration, like we did last quarter, we've taken a conservative approach to our outlook. We saw less impact among facilities and our health care customer, facility customers. April sort of, as I think I pointed out in my comments, Q2 is always going to be down. But for us, we saw a slight improvement as far as in the market, but we're still in that transition phase. In terms of Imprint, it sounds like feedback continues to be good. It's really all operationally getting ready, but there's a couple of components to that. As you mentioned, inventory is the biggest one, and that has been a challenge for us given what we dealt with heading to year-end last year and then, obviously, as we just noted, in Q1. We're making the right strides, but we're not quite ready. And when we say ready, part of our commitment is we want to be able to deliver Imprint in a 3- to 4-week time frame, significantly faster than the 6-week time frame that we do with our custom 5, 6 weeks with custom, depending on the product. It also requires having our enterprise management system, our software, all the commercial interactions really, really robust and sorted out. So there are some things we've had to do through warehouse software management systems and stuff like that, that we haven't had to deal with, frankly, in the past when we were build to order. So those are just some processes that we're making sure are robust and reproducible so that we can, as I said, flow orders through and deliver reliably in a 3- to 4-week time frame on Imprint. And as we sit today, we still feel comfortable that we'll be able to do that. And then lastly for me, Bob, in terms of the gross margin, you were -- you laid out the specifics on '22, which was really helpful. And that, in combination with those 2 items, Platinum Services and Imprint, will be probably the biggest driver. So clearly, we're ramping now, but certainly in '23 I would expect to see even more significant improvements as that becomes a bigger . It seems like the transition is going very smoothly, but just wanted to check in on that element of the Imprint launch. It's a great question, and it's an important consideration anytime you do a change to your business model. It can be upsetting to customers, and it's a challenge to change our culture around from that standpoint. Having said that, there's probably a few, less than 10% that they want -- they just voice that they're going to miss being able to give a true fully custom implant at no charge, right, to their patients. And now they'll have to move to our new model, which is you can get Imprint, which is sort of like, call it, 75% of what we have with Identity. And if they want to go the rest of the way, then it's a patient-pay upcharge or a cash . I'd say, frankly, some of them -- we haven't turned them on because we're in limited release. And so they're jumping up a bit to get it, so to speak, and want to get it. And what we found is when they start using it, they're actually really happy. They're actually really happy because our modeling suggests that, frankly, only 25% of the patients should even really see the sizing and the shape difference because of the way we've designed Imprint. And they're really, really onboard with us because they're looking for something to have a change in this industry to end -- to race to the bottom. They want to have an outlet where they can give their Medicare patients choice, they can give their commercial patients choice. This is really to your question about our own customers, right, because it's a change for them. But remember, we're only a couple of points of market share. And for them, it's all upside. We're seeing a really good uptake, the ASC and limited market release. So I'll take that positive story any day and the ability to have new discussions, which was always the point we talked about, Josh. And just on pricing strategy for Imprint, I mean our understanding is that to be relative parity to other off-the-shelf implants from competitors. So frankly, we just couldn't meet, Josh, with our fully custom Imprint. Because the simple fact is, when you make a standard implant that's \"off the shelf\" and has only a standard number of sizes, you have lower cost of goods because everything is standard and it's all inventory. So that gives us good pricing flexibility, and that's what's going to get us both these products, whether the customer buys an Imprint from us, it's going to be margin accretive. Or if we end up doing the Platinum Services, then due to that scenario the way the funds flow, that's margin accretive, too. But it's also a smart play for the market and our ability to address the market because now we're offering something that has value to, as I said, to these customers that are high-value customers or who can never play that want, lower price and now they want to get into the ASC. And then number two, now the opportunity to actually have a revenue-generating opportunity, which never existed before, in getting into a deluxe service business is a great discussion that we're having with people. We expect that number to grow, and we'll talk more about that over the coming quarters. As we said, we can't really comment on where it's at. I think it's still not, as far as I understand, fully -- completely lost or maybe that's a misnomer, maybe it's \"fully available\", but I still think they still have a lot of training to do, still uptake. It's just like anything else, trying to get incremental dollars in this inflationary environment and trying to deal with the cost pressures that hospitals have. But look, it's all good. We're delivering and they're able to order, and we feel good about the partnership. Well, once again, everybody, thanks for joining us here this morning. We’ll evaluate if we want to continue with that going forward, if we’ll move back to the afternoon. But if you actually take the time to look around, it’s been done in a lot of other subspecialties."
}