{
    "symbol": "BCOV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 21:58:08",
    "content": " During today's presentation, we will make statements related to our business that may be considered forward-looking and are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including statements concerning our financial guidance for the third fiscal quarter of 2022 and the full year 2022, expected profitability and positive free cash flow, our position to execute on our go-to-market and growth strategy, our ability to expand our leadership position, our ability to maintain and upsell existing customers as well as our ability to acquire new customers. Let me start by sharing our 4 clear goals: one, return to growth in revenue and EBITDA; two, gain more scale in revenue and operations; three, continue to diversify our revenue in terms of business lines, geography, industries and business models; and four, excellence for our customers and employees, something we will strive for and deliver. We have 5 core tenets to our strategy: delivering more end-to-end solutions and services; accelerating and incubating new and existing customers; super serving our largest and most strategic customers; partnering to efficiently reach the broader market; and finally, allowing ourselves to pursue supplemental business models that provide revenue opportunities in addition to our core SaaS revenue model. We are in the process now of scoping and defining numerous specific initiatives to support and deliver on this strategy to develop deeper and better, more comprehensive solutions for more customers, customers whose businesses we will help accelerate and/or incubate on our platform, pursuing larger deals with direct sales and a broader customer profile delivered through partnerships, all supported by a freedom in our business approach to pursue things like revenue sharing or other models, while keeping SaaS as our large overwhelming majority and growing core. So I see the opportunity as us being able to go into many of the biggest companies in the world and be able to talk to them about being world-class like we are and deliver the things that they need, but also do it on a less expensive basis, more cost-effective basis than what they're doing today and allow them to redeploy the resources, the limited resources they have to other areas of their business that are more strategically differentiated, whether it's the content or other parts of their technology stack."
}