{
    "symbol": "REYN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 11:11:02",
    "content": " For our agenda this morning, Lance will focus his remarks on market performance and the Reynolds cooking and baking recovery plans, as well as discussion of our performance drivers, while Michael will review our fourth quarter and full-year financials, as well as our 2023 outlook. However, as you can see from our fourth quarter results, the Reynolds' Cooking & Baking business segment performance fell short of our expectations. On our earnings call in November, we reported that the Reynolds Cooking & Baking business segment entered the fourth quarter having experienced periods of unplanned equipment downtime, resulting in additional manufacturing costs, and impacting our ability to adequately supply customers. And as I do so, I want you to know that we enter 2023 with a thorough understanding of what has been impeding Reynolds Cooking & Baking's margin recovery, as well as the team and resources in place working to correct the issues impacting that business segment. In Reynolds Cooking & Baking, we plan to increase distribution of Reynolds Wrap Pitmaster foil and Reynolds Kitchen's Air Fryer liners among others, while also introducing Reynolds Kitchen stay flat parchment, and other products designed to meet the increase in Cooking & Baking among young adults and other major segments of the population. Adjusted EBITDA was $546 million, down 9% from $601 million in the prior year, due to lower volume and higher advertising costs, partially offset by the timing of pricing actions to recover increased material, manufacturing, and logistics costs. We delivered a record net revenue of $1.1 billion during the fourth quarter, up 7% from the prior year's Q4 of $1 billion, and in terms of profitability, each of Hefty Waste & Storage, Hefty Tableware, and Presto segments, fully recovered to pre-pandemic profitability, while also reporting record earnings. For the first quarter, we expect net revenues to be flat plus or minus 1% with pricing up mid-single-digit on net revenues of $845 million in the prior year period. In terms of segment performance, we expect 2023 results to be driven by continued solid performance for Hefty Waste & Storage, Hefty Tableware and Presto, and improving performance for Reynolds Cooking & Baking as we move through the year. Focusing on the first quarter, while volume comparisons are more challenging in the quarter and expect it to be a drag on year-on-year EBITDA growth, the major driver of the expected decline in year-on-year adjusted EBITDA is Reynolds Cooking & Baking performance. It's lower for Reynolds Cooking & Baking and higher for the other business segments, but net down Reynolds for we've reviewed operational efficiencies and the purchases of supplemental milled aluminum at a premium. We've recovered pre-pandemic profitability in three of our four business segments, and we enter 2023 with a strong team and a robust plan for recovering Reynolds Cooking & Baking profitability."
}