{
    "symbol": "REYN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 10:01:03",
    "content": " Net revenues in the third quarter were $967 million, an increase of 7% over third quarter net revenues of $905 million in 2021, driven by price increases, partially offset by a decline in volume. Adjusted EBITDA for the quarter was $116 million, down 12% versus last year's third quarter of $132 million, driven by lower-volume and higher SG&A as price increases fully offset increases in material, manufacturing and logistics costs. This increase was partially offset by a 7% decline in volume, reflecting a 7% increase in Hefty Tableware volume more than offset by a 14% volume decline in Reynolds Cooking and Baking at high single digit decline for each of Hefty waste and storage and Presto. Reynolds Cooking and Baking volume decline of 14% was primarily driven by lower non-retail sale, which included , related-party sale and last year's one-time sale of excess raw-material. Hefty Tableware performance was strong with volume up 7% in the quarter, driven by continued growth within the club channel and share gains for Hefty disposable plates and private label plastic party cups across channels. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. So Reynolds Wrap is responding better than the category as a result in EQ, as I mentioned, across all of our categories, we're evaluating EQ performance versus dollar performance and Reynolds Wrap EQ was up 4.5% versus the same period of 2019, so that's the last 12 weeks ended October 30t. We see the use of disposable tableware has been steady this year across the category and heading into the holiday season this may continue to be a key theme of driving consumer behavior, desire for convenience as well as keeping tourists to a minimum, as well as holiday gatherings is factored into our forecast for the quarter, but we are seeing elasticity pick-up as we took a significant price increase in October in the tableware business, and we'll be watching that closely. Please proceed with your question. Please proceed with your question."
}