{
    "symbol": "REYN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 11:47:04",
    "content": " Net revenues in second quarter were $917 million, an increase of 5% over second quarter net revenues of $873 million in 2021, primarily driven by price increases and partially offset by a decline in volume. Adjusted EBITDA for the second quarter was $118 million, down 20% versus last year's second quarter of $148 million, driven by lower volume, primarily due to declines in foil consumption as well as higher materials, manufacturing, logistics and advertising costs. The 5% increase in net revenues was driven by low to mid-teen increases in pricing in each of our business segments, which was partially offset by a 9% volume decline driven by Reynolds Cooking & Baking and to a lesser extent declines in two other segments. Turning to our outlook for the third quarter of fiscal 2022, we expect net revenues to grow 8% to 12% or $905 million in prior year, driven by price increases and a low to mid single-digit volume decline. For the fourth quarter of fiscal 2022, we expect net revenues to grow 9% to 17% or $1,021 million in the prior year, driven by price increases and flat to slightly down volume. For the fiscal year 2022, we now expect net revenues to be up 8% to 11% on $3,556 million in 2021, driven by price increases and a mid single-digit volume decline, including the impact from timing of retailer inventory replenishment, primarily in the first quarter of this year. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. I mean, Lance, you mentioned kind of the flexibility, the pricing actions you will provide looking out to 2023, you mentioned promotion decrease ad spend, but I guess, how do you really think about the preference from here, because it seems like you're -- if you just assume $400 million in SG&A, you're flowing through a lot of upside to earnings growth of -- if you're taking the $950 million of gross profit or so, is that the right way to think about it, that you're kind of really expecting potentially north of 20% EPS growth looking at the next year?"
}