{
    "symbol": "NG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-06 16:02:07",
    "content": " On today's call, we have Dr. Thomas Kaplan, NOVAGOLD's Chairman; Greg Lang, NOVAGOLD's President and CEO; and David Ottewell, NOVAGOLD's Vice President and CFO. I would like to remind our webcast and call participants that, as stated on Slide 3, any statements made today may contain forward-looking information such as projections and goals, which are likely to involve risks detailed in our various EDGAR and SEDAR filings and forward-looking disclaimers that are included in this presentation. At the end of the first quarter, we reported the final assay results in a joint release with Donlin and Barrick. As shown on Slide 5, both Barrick and NOVAGOLD agreed that the 2021 drill campaign finished strongly with high-grade intercepts and some of the best drill results for an open pit project industry-wide. Primary objective of the 2021 drill program was achieved by validating recent geologic modeling concepts, to support future feasibility work, data collection for geotechnical and geometallurgical purposes, testing for extensions of high-grade zones, and to identify 2022 drill targets. Once the 2021 drill data has been incorporated into an updated resource model, the owners will determine updated mining schedules and life of mine business plans prior to shifting to an updated feasibility study, which is, of course, subject to formal approval by the Donlin Gold LLC Board. On Slide 6, we have included a quote from Barrick's recently published 2021 annual report on Donlin Gold. As a 50-50 joint venture ship, we have great alignment on our efforts to advance the Donlin Gold project. In 2022, we will undertake approximately 34,000 meters of technical and exploration drilling, both in pit and at depth as shown in the areas circled on the slide. While we are focused on the drill program, permitting and modeling work, we have not lost sight of one of the project's most important attributes, that is the exploration potential. As shown on Slide 8, the existing deposit is not only open laterally as well as in depth, but its mineral resources are contained with only three kilometers of an 8-kilometer mineralized belt, which is located on less than 5% of Donlin Gold's total land package as highlighted in yellow in the lower diagram. In 2022, the proposed overall budget for Donlin Gold, which is equally shared with Barrick, is $60 million. Donlin Gold has focused efforts on supporting local communities by funding and participating in health and safety initiatives, environmental management, training and education and cultural activities in the Y-K region. In collaboration with local stakeholders, Donlin Gold has worked with six school districts in the region as part of the National Dictionary project to provide a personal IUPUC dictionary to all third graders, supplying nearly 5,000 dictionaries over the last decade. Calista and Donlin Gold, in close coordination with NOVAGOLD and Barrick, co-lead our government relations efforts, an important part of advancing the Donlin Gold project through permitting and beyond, as shown on Slide 12. During the first quarter, Calista and Donlin Gold continued their bipartisan outreach in Alaska and Washington, D.C. to highlight the thoroughness of the project's environmental review and permitting processes, including the importance of responsible and much-needed economic development in the Y-K region and throughout Alaska. In terms of scale, quality, exploration potential and jurisdictional stability, Donlin Gold's attributes far exceed any other gold development project globally. When combined with our long-standing native corporation partnerships, the exponential leverage to rising growth and experienced management team and Board, long-term supportive shareholders and with key federal and state permits in hand, NOVAGOLD is unparalleled. When compared to the next 14 largest gold development projects in the Americas as shown on Slide 14, Donlin Gold is 5x better than the average. Currently envisioned, the Donlin Gold project will averaged over 1 million ounces a year for the life of the mine, as shown on Slide 15. While global gold production continuing to decrease for most of the top 20 producers, it is clear the industry needs projects with scale grade and longevity to sustain and outperform through multiple gold cycles. The scale of Donlin Gold, combined with its grade at 2.25 grams as shown on Slide 16, is twice the industry average grade for an open-pit project. Looking at jurisdiction on global scale, we can see that the mineral potential category only three mining operations produced more than 1 million ounces in 2020, as shown on Slide 17. For political and social stability, we can see that based on the Fraser Institute rankings, Alaska is in the low-risk category in gold. Comparing mines in production or those in development, Donlin Gold ranks among the top assets globally. We are most fortunate to have as partners the Alaska native land owners, Calista and TKC, who are committed as we are to develop a mining operation consistent with the elders' vision of responsible development that creates jobs and economic benefits all the while safeguarding the environment and culture as per the supportive comments on Slide 18. The Donlin Gold project is on privately land, specifically selected for its mineral development potential under the 1971 Alaska Native Claims Settlement Act. The Donlin Gold team, Calista and TKC as well as other key representatives of the communities work together to achieve these goals with the ultimate objective of ensuring sustainable and profitable project development. We believe NOVAGOLD's 50% ownership is this unique asset with the combination of scale, quality, longevity leverage to gold price, exploration potential and key partnerships clearly constitutes a special investment opportunity for our broad community of stakeholders and shareholders. We reported a net loss of $10 million in the quarter, a $2 million increase due to the earlier start to the Donlin Gold drilling program this year. Other income expense includes an increase in the fair value of marketable securities and favorable foreign exchange movements, partially offset by the lower accretion income due to the maturity of the $75 million nuance note in July last year. Cash and cash equivalents decreased by $14 million, primarily to fund our share of Donlin Gold and for corporate and administrative expenses. The increase in cash used during the first quarter of 2022 compared to 2021 was again due to that earlier start to this year's drilling program, the timing of corporate liability insurance payments and higher withholding tax on share-based compensation. For the full year, we continue to anticipate spending $46 million, including $30 million of Donlin, $13 million for corporate G&A and $3 million withholding taxes on share-based compensation and working capital. All roads lead to gold from a micro standpoint, the supply-demand equation as well as from a political and geostrategic standpoint as well. I think we are getting to the point where the performance of gold is going to elicit a great deal more interest in the metal, and it's getting a lot harder to find it on every level. But if people want me to spend more time on the gold commentary, by all means, let Melanie know, and I'm happy to oblige. On Slide 24, what you see is a compilation of a number of factors, which together render the Donlin asset to be unique. It is by any classification a Tier 1 asset, but it's also located in a Tier 1 jurisdiction. I've been harping on the story of jurisdictional risk for many years I think that I don't have to dwell too much on the global situation all across the world, not only in the developing world but also in the developed world itself, to suggest that the existential factor for, not just mining investment long term, but investments in general, is being in the right place. You've heard from Greg a very, very strong case being made for Donlin being the greatest development stage asset in the world today. I believe that when people do say, why do you wax a miracle about Donlin, I say because it has all of the attributes which in combination render it unique, besides 39 million ounces in the measured and indicated mineral resource category with clearly much more to go. We always say that it's only 5% explored, and that's the eight kilometers that we know about, of which the reserves only come from three kilometers. And the people should ask the question why that is, and it's very much a function, I believe, of the history of this asset, particularly the year before we came into the picture. I think that if Barrick had won the control over the entirety of the asset, it's probably fair to say that they would have had 10 drill rigs on this thing, maybe up to the present day. But more than that, I also believe, and this is a forward-looking statement, don't attach any more value to that other than the fact that I've sort of made my fortunes through the drill bit, I do believe that the next Donlin is at Donlin. And it's not an accident, that our friends at Barrick and their annual report noted that the results which we had on this latest drill program were some of the best results for an open pit property for any development stage gold asset in the world, in fact, any developed gold asset in the world. We are in the second largest gold-producing state of the safest jurisdiction in the world, a state that is welcome for mining and where we enjoy partnerships at the state level at the level of our native corporation partners, not to mention, of course, our industry partner, Barrick, and also from the U.S. federal government. So from an asset standpoint, you have everything that someone could look for if they want obtain in their portfolio from a development-stage asset. It's one thing to have a great asset, but you want to make sure that it's in a safe pair of hands, that the stewardship is what you're looking for. the track record of NOVAGOLD's management team, the one that took over a decade ago, has really been stellar. Should that happen, in that eventuality, potentially, we would get another $75 million if they make the construction decision, a good news for our shareholders. But meanwhile, those who have invested in trilogy or those who got it as a dividend, have seen that company develop real value in the marketplace, and has allowed us to be able to focus as a pure play on the Donlin asset. Between the combination of factors which make Donlin such a great asset and the jurisdictional stability, which is increasingly important on a daily basis in today's world. We think that being able to be a pure play on the new Nevada or the new Carlin, however you want to term it, makes it really one of the greatest ways to play gold in today's world. We're aligned with our strategy on taking Donlin up the value chain with our partner at Barrick, with whom NOVAGOLD has a 14-year history. which is taking place now, which, as Mark Bristow referenced in his own remarks on Donlin, are meant to be able to primarily test upside scenarios as well as giving us the finishing touches on the geotechnical aspects that go into the mine plan. The culture that we have in focusing not just on maximizing shareholder value is only part and parcel of a culture of respect, not just for our shareholders, but between NOVAGOLD, Donlin and our local stakeholders. The development of Donlin is going to be the cutting edge in terms of the employment, the scholarships, the workforce development and environmental programs in the region that we're already funding are going to only be accentuated by being able to bring the development to what is really one of the poorest parts of the United States. It's not a wonder that we have the support at the local level, at the state level and at the federal level, for this game-changing project. If you look on Slide 26, when you combine the quality of the asset jurisdictional safety, the management culture of respect for its shareholders as well as local and industrial partners. But what I would accentuate here is that it is our considered opinion that the history of this period when it's written in terms of those projects that will give the highest value to investors, is those which are in jurisdictions where the implied interest rate will be the lowest. It used to be before Newmont went Yanacocha and the goal to where the gold is mentality took hold in the gold space in the early 1990s that the lowest risk premium attached was to U.S. assets, which was then in turn arbitraged within the risky assets, Canada, Australia and South Africa. Obviously, the world changed and we've seen people go through all areas of Latin America, Africa, Asia, et cetera. I believe that for a whole host of reasons, what we're going to see is that we're going to go back to the future, which is to say that the highest rated assets will be those which are in safe places like Nevada, Australia and, of course, Alaska. So with that, going to Slide 27, I think it's not surprising that we have enjoyed such strong institutional shareholder and management support. They know that the NOVAGOLD asset, our 50% share of Donlin, has been a gift that keeps on giving as we've seen from every press release about the drill results and - or the progress with our partners at Barrick. Our shareholders know that if they want to speak to Greg or Melanie, they're there in a hard you don't have to make a long-term appointment. I love being able to talk about this asset because I know that when we look back upon this era, the Donlin asset will be seen as being the Holy Grail. And when we get into that era and what John Wilson refers to as gold fever, I think that it won't be a surprise that we will be one of the very best performing equities in the gold space. We've got that combination of scale, blue sky, mine life, grade, management, low-cost structure and jurisdictional safety that is going to make us the go-to stock in the gold development space. Yes, the drilling got started early in January, and it's been going great. We also have a second question comes from the line of Trevor Turnbull at Scotia Bank, who asked, I know this, Barrick recently reached an agreement with Pakistan for the potential development of the Reko Diq project. Well, let's set aside any view on jurisdictional risk. Yes, side-by-side comparisons are somewhat difficult because Reko Diq is primarily a copper deposit and Donlin is gold. But I think, more than anything else, it really demonstrates that the industry needs large-scale projects like Donlin or like Reko Diq to sustain themselves. And right now, we're focused on working with our partner to execute this year's field program, which I echo being exciting year for us, particularly, I look forward to what we learned by drilling at depth at Donlin. From the standpoint of the war in Ukraine, I think that it's very clear that jurisdictional risk has gone from being an incremental arithmetic equation to exponential. I think that any investor, not just in the mining space any longer, who does not try to factor in jurisdiction risk in their instruments has the potential to be annihilated in terms of that investment. It's no longer just something that people can turn a blind eye to because it's located in the Levant like Syria or in Afghanistan and Timbuktu, et cetera, et cetera. I look at the Western companies that have potentially had to abandon assets in Russia in order to be able to comply with the rules in their home countries or in most of the western world, if not most of the world in general. And the fact that the Russian saw, to their heart, that half of their reserves were effectively sanitized or desensitized in - with the stroke of a pen, is going to have a lot of people thinking about their assets. And as we know, gold purchases by the Russians were very, very intelligently made and Russians are now buying gold hand over fist in their citizenry, the Central Bank, one of the first actions that the Central Bank took after the sanctions were imposed was to go back into the gold market as a buyer. I think that it will not be lost on the Chinese that the value of gold is that much higher, being that they are so, so tied to the U.S. treasury market, just simply because of the volume of their holdings in non-renminbi assets. No doubt in my mind that the Chinese are, of course, the world's largest gold producer, are going to not only continue to buy all their local production, but will continue to be large buyers in the world as they try to convert dollar assets into gold. Russia, of course, is one of the largest producers, and I think it's very clear that they're not going to let gold leave the country unless monetizing it in order to stave off other economic issues. In which case, my guess is that there are a number of central banks, which would be more than willing to loan money to Russia collateralized in gold, if not by the gold out right, assuming that the Russians would be willing to do that. And that is an aspect of life which is only going to accelerate the momentum that gold has when it definitively goes through the 2000s area and people start to try to attach valuations to it with the same kind of we'll pick a number that they have with so many other assets, including crypto when gold fever hits, it's very likely to go into a whole new universe. I've always said that I thought that from a supply/demand standpoint, falling grade, et cetera, et cetera, the scarcity of resources, there aren't that many things out there like a Donlin, which can produce 1 million ounces not to mention, add millions of ounces of what is high grade for an open-pit gold. So when you look at that, I've always felt 3,000 to 5,000 for gold is a reasonable equilibrium level. When markets like this start to move, you can see that as being a 2- or 3-day trading range, and volatility, I think, is here to stay in pretty much everything. So for all of those reasons, I think we're going to see a lot more people gravitating towards wanting to have some gold in their portfolio at a time when they'll be competing with governments. If there time on gold, for you Dr. Kaplan, Mike would be interested to hear your thoughts on gold in the context of increased speculation about growing central bank reserves, new gold, commodity back standards for currency. And obviously, for years, I've said that I want to be able to have exposure to an asset that isn't someone else's liability. Now for some people, they look at crypto as being gold 2.0. The most important aspect is that the crypto narrative and the way in which central banks are now looking at digital coins, et cetera, is absolutely the victory of the gold narrative that gold bulls have been espousing, which is to say you want to be able to have access to a form of money that cannot be printed by Fiat. But one thing I know, there's only one gold. That's extremely important because when you say crypto, you can mean many, many things, and I don't know which ones will turn out to be winners or losers, not speculating. I do know that when someone says, well, I think I want to add some gold, there's only one kind of gold. And I do believe that when you or the brokers of any of the analysts who are on this call, are going out and talking to investors and they say, we've got a great gold story to look at investors going to say, Wow, that's perfect timing. That's a mining company, it's about a great asset and an excellent management team with a track record of keeping their promises, et cetera. I do believe that in the not-too-distant future, and it's probably already happening when you're starting to see the valuations being given to countries in safe places. I really do believe that one of the first questions that will be asked of the brokers is this, you say you have a great company with a great asset and a great management team, just one question before we continue. Because if it's in a place where I wouldn't be willing to visit and certainly not take my wife and kids, then it may not be for me. So I think that what you're going to see is a new form of discrimination whereby investors say, give me a great asset with great management located in safe place that if I want to go gambling in Vegas, I can go visit the property. If I want to go whale watching or salmon fishing in Alaska, I can go visit the property with a sense that at least is comfortable, at least I'm not going to run afoul of my investment committee when something untoward happens in those countries. If anything, ultimately, because there are so few vehicles that provide you with the kind of leverage to gold in jurisdictions that will allow you to keep the fruits of that leverage like the Donlin, or like the Nevada, for example. And I got mucky because at that time, people weren't looking at North American assets. But if you're looking at assets in the gold space, I think that your brokers are going to want to be able to say, oh, and by the way, it's in a safe space. I think that the Chinese will probably reveal themselves to be holders of much, much more in official reserves than Gold reserves for United States has, it becomes yet another part of the most potent aspect of American Power, which has only been reinforced in the last two months, which is the U.S. dollar being the world's reserve currency, far in this proportion to the representation that the dollar has as a trading tool."
}