{
    "symbol": "AWK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 11:17:02",
    "content": "  Operator: Good morning, and welcome to American Water's Second Quarter 2022 Earnings Conference Call. As a reminder, this call is being recorded and is also being webcast with an accompanying slide presentation through the company's Investor Relations website. I would now like to introduce your host for today's call, Aaron Musgrave, Vice President of Investor Relations. Good morning, everyone, and thank you for joining us for today's call. However, since these statements deal with future events, they are subject to numerous known and unknown risks, uncertainties and other factors that may cause actual results to be materially different from the results indicated or implied by such statements. Additional information regarding these risks, uncertainties and factors as well as a more detailed analysis of our financials and other important information is provided in the earnings release and in our June 30 Form 10-Q, each filed yesterday with the SEC. The reconciliation for the calculation of the O&M efficiency ratio, a non-GAAP financial measure can be found in our earnings release and in the appendix of the accompanying slide deck, which has been posted to the Investor Relations page on our website. Susan Hardwick, our President and CEO, will discuss second quarter and year-to-date highlights and our focus on managing costs in today's inflationary environment. John Griffith, our Executive Vice President and CFO, will cover our financial results in more detail, review our affirmed 2022 earnings guidance and long-term targets, and we'll close with an update on recent acquisition activity. Cheryl Norton, our Executive Vice President and COO, will then review the progress of our investments year-to-date in the Regulated Businesses. We'll share some key details and milestones for several of our active general rate cases, and we'll conclude with another of our ESG impact stories. With that, I'll turn the call over to American Water's President and CEO, Susan Hardwick. Let me also say how happy we are to have John Griffith with us as our CFO, and you'll hear more from John shortly. Let's turn to Slide 5, and I'll start by covering some highlights of the first half of the year. In the first six months of 2022, earnings were $2.07 per share compared to $1.87 per share in the same period of 2021. Results for the Regulated Business drove the majority of the growth, accounting for $0.16 of the $0.20 increase while MSG and other results were up $0.04 as compared to the same period in 2021. These higher revenues were partially offset by higher operating costs, which I'll talk more about shortly. Our Regulated Business invested over $800 million in capital projects and acquisitions for the quarter and $1.25 billion year-to-date, reflecting great work by our teams responsible for executing these investments. As you will recall, the total capital investment plan for 2022 included the $235 million acquisition of the City of York's wastewater system that we were excited to close in May. Coupled with our strong first quarter results, our capital investments are off to a good start for the year and on pace to meet our $2.5 billion goal for the year. Before I move on, let me comment again about how excited we are to welcome the customers and employees of York's wastewater system to the American Water family. As we've said, this is the largest acquisition in Pennsylvania American Water history, and it's a great example of how municipal acquisitions are executed. The importance of understanding the community's objectives can't be underestimated, and we jointly created an opportunity that benefits all stakeholders. And as we think about the competitive landscape for water and wastewater acquisitions, we continue to focus on growing in states where we can leverage our competitive advantage. As we've said many times before, we target acquisitions in the range of 5,000 to 50,000 customers, where we have constructive regulatory environments, an existing footprint and critical mass. So while we won't be awarded every opportunity we pursue, we know that there are plenty of communities in need, and we believe our 135-plus year history of delivering safe, clean, reliable and affordable water and wastewater services will enable us to continue to achieve a high success rate in our pursuits. And I'll let Cheryl give you the details, but the award of our first Navy contract at Mayport adds to the 17 other military installations that we're very proud to serve. In the chart at the bottom of Slide 6, you can see the result of our disciplined focus on managing costs as we grow the business. Now as we are in what may be an extended period of inflationary pressure, we continue to exercise our disciplined approach to cost management by leveraging our scale. And through midyear, while we are experiencing cost increases in certain supplies and energy, the impacts to date have been fairly modest. In terms of our most significant costs, labor is our biggest operating expense by far. While our supply chain strategies and purchasing power have helped mitigate chemical cost increases, especially as compared to our peers, we do expect higher O&M costs this year due to higher chemical prices. For many years now, the supply chain team has been successful in partnering with operations to secure reliable, cost-effective power and fleet fuel contracts across our footprint. And because of these efforts, we expect only modest power and fuel cost increases in 2022. Overall, we estimate an impact of about $0.06 to $0.08 per share of these types of cost increases year-to-date, which we've been able to generally offset through other results. But as I said, we are confident in our ability to hit our earnings expectations for the year. Though there has been much volatility in the equity markets through midyear, I'd remind you that the pension obligation remeasurement will be done at the end of 2022, and that will drive the determination of our 2023 expense. These methods were selected many years ago and have resulted in moderate variability in pension expense, both favorable and unfavorable over the years, which we've always managed as part of our overall cost management approach. This includes regulatory solutions such as the pension trackers we have in place in Missouri and California, and updates to pension expense in active general rate cases. As an example of how we are addressing these costs in current cases in the Illinois case currently on file, we requested and received approval last week to update the requested revenue requirement for increased costs including an estimated increase in pension costs. Thereâ\u0080\u0099s no doubt a challenging environment we all find ourselves in, but we remain confident in our ability to manage through it using our disciplined approach to cost management and our ability to execute effectively in the regulatory environment. And with that, let me turn it over to John to cover more detail on our operating results and financing plans. So before I get started with the results, let me just say that I am thrilled to take the baton from Susan as CFO at American Water and join this great team. So with that, turning to Slide 8, let me provide a few more details on second quarter results. We saw a $0.16 per share increase related to higher revenues from new rates, acquisitions and organic growth. As a reminder, prior year results reflect an estimated $0.03 per share of favourable weather in the second quarter. O&M expense increased by $0.06 per share, which reflects some of the effects of inflation on chemical, power and fuel costs. Results for the Other segment also include interest expense on long-term debt financing in both periods, which has increased year-over-year. Related to HOS, I also wanted to note that we recorded the final working capital true-up entries for HOS in the first half of the year amounting to $0.08 of earnings. As we previously disclosed, we recorded a $0.02 loss on the sale of New York American Water in the first quarter. As is often the case with an organization of our size, it is common to have in any given year a number of pluses and minuses that generally offset. Consolidated results increased $0.20 per share for the year-to-date period compared to the same period last year, driven by many of the same factors as in the second quarter. We saw a 34% -- $0.34 per share increase on higher revenues, somewhat offset by increases in O&M and other operating expenses of $0.08 per share and depreciation of $0.06 per share. The Market-Based Businesses and Other results increased $0.04 per share for the year-to-date period compared to the same period last year, with generally the same drivers as mentioned for the second quarter results. Overall, we're pleased with our financial performance over the first half of the year. Speaking of our 2022 plan, let's now turn to Slide 10. After a solid start to the year, as Susan mentioned, we are affirming our 2022 earnings guidance range of $4.39 per share to $4.49 per share. Second half results when compared to the prior year will be tempered by the sale of our New York American Water operations earlier this year, which historically had its biggest earnings contribution in the third quarter of each year. And as we mentioned, while we are working diligently to limit the impacts to the business of rising costs, we expect to see continued pressures in the second half of the year, primarily related to chemicals and interest expense. As we've mentioned previously, we will not see any material earnings in 2022 from the redeployment of sale proceeds for HOS in New York,; but the expected earnings from interest on the seller note and revenue from the utility revenue share agreements will nearly offset the loss of the prior annual earnings contribution from HOS. As our team has previously shared, we'll continue to ramp up our capital investments over the next few years as a part of the accelerated investment plan rolled out last November. Finally, I'll just reiterate that we are confident in the long-term financial targets we have in place, including 7% to 9% EPS growth and 8% to 9% rate base growth. We were pleased to announce in May our closing of the purchase of our -- of the purchase of the City of York's wastewater system for $235 million where we are now serving approximately 45,000 customer connections. This agreement was executed under Pennsylvania's fair market value legislation, which is a framework that exists now across 12 of the states in which we operate. Turning to a review of the nearly 30,000 customer connections under agreement as of June 30, Egg Harbor City is expected to close in the second half of 2022. Importantly, we believe other municipalities will benefit by this legislation in the future as it allows communities with significant operating challenges to avoid a public referendum and swiftly partner with a provider like us to address their issues. And just yesterday, West Virginia American Water announced a signed agreement with Jefferson Utilities to purchase the various water and wastewater system assets of Jefferson Utilities for $30 million. The combined systems serve almost 4,000 customer connections in West Virginia and we expect to close this transaction by the end of this year. The pipeline represents a multitude of potential acquisitions across many states in our footprint, including several additional opportunities that have emerged since our last call as well as the removal of two large deals, York now closed, and another opportunity in Pennsylvania. Importantly, these strong issuer ratings are also applied to our senior unsecured debt offerings enabling us to achieve strong financing outcomes like our recent debt offering in May, that's summarized in the appendix of today's slides. In a rising interest rate environment, it is important that the company has taken a laddered approach to long-term debt financings over the years in order to minimize interest rate risk. With that, I'll turn it over to Cheryl to cover our capital investments and Military Services Group results in more detail. While I usually start by reviewing the regulated segment's operating results, I want to start today on Slide 14 by covering the announcement coming from our Military Services Group just a few weeks ago. With the addition of the wastewater contract with Naval Station Mayport, we are currently serving 18 installations with between 30 and 50 years remaining on these contracts. As we turn to Slide 15, let's cover our regulatory activity in our states. In the appendix, we also share some details of changes in our infrastructure charges year-to-date. As you can see on the slide, our New Jersey case is the furthest along with constructive discussions happening over the last few months. We're really pleased to report that on July 25, the parties to the New Jersey base rate case filed a stipulation of settlement with the Office of Administrative Law resolving all pending issues in the proceeding. In Illinois, it's been about six years since our last general rate case, and progress has been steady since our February filing. Importantly, Illinois utilizes a forward test year for ratemaking purposes, which is helpful during this period of rising costs faced by the business. In Pennsylvania, we filed a general rate case in late April and are seeking recovery of over $1 billion of investments. The case is proceeding as planned, including evidentiary hearings that will occur in September and with an order in this case also expected early next year. And finally, as you know, we have another case active in Virginia from 2021 that we expect to bring to conclusion in 2023. The common thread in all these cases is the focus on recovery of extensive infrastructure investments totaling over $4 billion and in some cases, the roll-in of acquisitions. As we continue to ramp up capital investments over the next few years, it will take time to see recovery of these investments in rates. We expect to continue to file general rate cases every two to three years in our larger states with the ability to go in sooner if we see lingering inflationary impacts or excessive lag from investment, limiting our ability to earn our allowed return. On the legislative front, there were three additional pieces of legislation passed since our first quarter call, one in Illinois, one in Tennessee and one in Missouri. And lastly, the Missouri bill requires a utility to defer any difference in what was actually paid in state or local property taxes compared to what was used to set the revenue requirement. On Slide 16, we summarize rate filings completed so far in 2022 as well as total annualized revenue increases being requested in currently active cases. The total of $598 million in pending cases, which includes 3 infrastructure surcharge proceedings, reflects the requested amounts in the various cases. Generally speaking, we would expect the final revenue increase granted in each case to go into effect in 2023 or 2024 in the case of California. This result keeps us on pace to hit our goal of approximately $2 billion of regulated capital investment spending in 2022, the foundation of our earnings growth triangle. I want to just highlight that our continued execution on capital investments, both infrastructure projects and acquisitions are succeeding in growing our regulated rate base. This, of course, drives earnings growth while we remain focused on operating our systems safely and efficiently to the benefit of our customers. Like we have been doing the last several quarters, I'll close on Slide 19 with another story of ESG impact at American Water. Upon completion later this year, this 8.9 megawatt installation will provide 95% of the plant's annual power needs and will help reduce our annual greenhouse gas emissions. So with that, I'll turn it back over to our operator to begin Q&A and take any questions you may have. I think we made it hopefully pretty clear in our prepared remarks, first of all, that we affirmed guidance for the year. So as we think about expectations for 2022, we're quite confident in our ability to hit the targets we've established for '22. And as Cheryl pointed out, a number of our cases do have forward-looking test years. The other comment that we made, and you obviously rightly pointed out the HOS gain that was recorded, which again, those sorts of transactions are not terribly uncommon when you have a transaction of the size we had last year when we sold HOS, just final working capital true-ups. But I'd also say it's not uncommon for an organization of our size, as John remarked to have pluses and minuses throughout the course of the year. And our focus on cost management, our focus on how we operate, how we are focused on efficiency, we'll continue to have levers that we can pull to offset exposure that we may see in the second half of the year. And again, I'll just say it again, we affirmed our guidance for 2022, and we fully expect to hit those targets for the year. And Cheryl can weigh in here too from an operating standpoint, but we don't see any change at all in our plans in terms of the amount of work we're doing. But I would tell you, again, our supply chain folks have done a tremendous job, both managing the availability of supply and the cost increases we've experienced. Yes, I would just say that we've always got hundreds of projects pretty much ready to go that we know need to be done across our systems. But at this point, we've been able to manage through any supply chain delays and any cost increases and still get the work that's been prioritized done and continue to do that, we think, through the years coming. Obviously, as we said in our prepared remarks, we do need to get to the end of the year, we'll do the remeasurement there, and we'll see where we are. But again, our focus would be to use all of the tools at our disposal to manage those types of increases I mentioned in my remarks around regulatory approaches. My first question going back to, I guess, thinking about the '22 guidance a little bit, given the year-to-date results. I think on Slide 10, you said that second half of '22 EPS will be lower compared to 2H 2021. If I just -- if I take the last four quarters worth of EPS, it gets to kind of, I guess, the midpoint of where '22 guidance would be. We're pointing out that in the prior year, you would have had results from New York. What we've continued to say is we've affirmed our guidance for 2022, and we're very confident in our ability to hit that. And so obviously, it's something that we're very focused on, and I'm going to let Cheryl comment on how we see this latest news. Angie, I'll let Cheryl comment in a minute about what's specifically happening in New Jersey. We've got two areas in New Jersey where we've seen peak usage rise to the level that we feel it's important that we start to encourage or specifically ask our customers to conserve, to water only on alternating days, put steps like that in place so that we can kind of shave off those peaks and that we can serve our customers continuously without any kind of dips and pressure or anything like that. So we have seen usage spiking, and that's why you're seeing those conservation messages come through. And I know it's really new, but we see this proposed minimum effective tax rate, right, 15%, at least overnight, that it seems that it might pass. Ultimately, any impacts to effective tax rates gets worked through the customer bills. So I would say it's probably cash flow -- and I think -- well, again, just need to look at our analysis that we did at the time. I don't recall it being terribly material, but we'll just need to dust it off and see if there's anything there to report. But is there any more you can share about this one -- I wouldn't say an award because it's an exclusivity period took for negotiations, went to your competitor. We have low-income assistance programs all across our footprint, but we're also looking at how we can expand those or how we can make those more accessible to additional customers. So we're also working at the federal level, trying to get as much support for a federal assistance program, the program has been hugely popular and helpful for our customers across our footprint in the states where they've implemented that. Well, I think that's a difficult approach. I think the answer really to the question is you really just have to wait until we get to the end of the year, and we see really what the impact is going to be going forward. And to the extent we don't cover those costs timely enough in rate cases, we will continue to focus on ways to mitigate those impacts through other cost management efforts, other things. So I don't think you can really draw any broad conclusions based on what you've seen to date, either in terms of market performance or even in our own filings. I think you really just got to wait until we have more insight into expectations at the end of the year, and then we'll certainly tell you how we think about it. So as we think about this going forward, we're certainly confident in our ability to manage the cost, both from just a straight cost management standpoint and regulatory solutions."
}