{
    "symbol": "COCO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 13:17:18",
    "content": " In the last three years, we've grown our Vita Coco Coconut Water net sales 72% in total, notably much faster than our private label business, which grew 22%. Our Vita Coco Coconut Water now represents 74% of our net sales, and our private label business is now less than 25% of our net sales, a percentage that we expect to continue to decrease in future years as our branded business continues to outpace private label. Our flagship Vita Coco Coconut Water remains the major driver of consolidated net sales, producing 18% full-year growth against the prior year, while our private label consolidated net sales grew 7%. Our Vita Coco Coconut Water remains very healthy, with Vita Coco sales increasing 9% in the fourth quarter in retail tracked channels, and increasing 78% on a three-year stack basis over 2019. We believe our sales growth is coming from a nice combination of new households and increased purchasing, and we believe that we have plenty of room to grow our households further as total household penetration for the Coconut Water category is currently only 23% compared to penetration, for example, of cranberry juice at 52%, and over 75% for orange juice, according to Numerator. In 2022, approximately 30% of the Coconut Water volume in the category in retail tracked channels was canned Coconut Water, and we believe Vita Coco Coconut Juice represents a significant opportunity for us to serve new consumers, as it is our first broad-based offering with coconut pulp. For the full-year 2022, we achieved net sales growth of 13%, driven by strong Vita Coco Coconut Water growth of 18%. Our fourth quarter 2022 net sales were up 6%, with Vita Coco Coconut Water up 4%, and private label up 25%. In the Americas, our Vita Coco Coconut Water net sales grew 19% for the full year, including 17% volume growth, reflecting strong consumer demand and low single-digit contribution from price increases, offset slightly by some mix shift impacts to lower net revenue per case equivalent channels. Internationally, we are seeing similar strengths of Vita Coco Coconut Water, with 11% volume growth for the full-year, while net sales grew 11% as price increases were offset by foreign exchange impacts on our reported revenue. In the fourth quarter of 2022, our Vita Coco Coconut Water net sales grew 4% versus the very strong performance in the prior fourth quarter, and an impressive 115% growth compared to the fourth quarter of 2019. Private label net sales positively impacted fourth quarter growth, being up 25% on a consolidated basis, driven by 5% volume growth and a positive product mix shift from increased coconut oil orders. We believe our commercial plans for the year should produce net sales growth in 2023 between 9% and 11%, with the Vita Coco Coconut Water growth in the mid-teens, and our private label net sales expected to be soft in the first half, and finish approximately flat for the full-year. For the full-year 2022, net sales increased $48 million or 13% year-over-year to $428 million, driven by Vita Coco Coconut Water growth of 18% in net sales, and private label growth of 7%. Vita Coco Coconut Water benefited from 17% volume growth and 2% net price mix benefit, while private label declined 2% in volume, which was more than offset by price mix benefits driving full-year net sales growth of 9%. For the full-year, our international segment net sales were down 3%, with Vita Coco Coconut Water up 11%, offset by declines in private label and other. When comparing the lower fourth quarter margin of 24.4% versus our third quarter â\u0080\u009822 margin of 26.3%, this decrease was due to the unexpected domestic transportation costs related to our inventory bill that were incurred late in the year, estimated as approximately $2 million impact on the quarter, and slightly increased promotional pricing on branded programs in fourth quarter of 2022 that were new this year. Our initial guidance for net sales growth this 2023 of between 9% and 11%, does not assume any further Vita Coco Coconut Water price increases, as we currently believe the full-year impact of the price increases executed in 2022, are sufficient to deliver our target results, but we will be flexible in our approach to pricing as we see how the year unfolds."
}