{
    "symbol": "COCO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 12:18:06",
    "content": " Year-to-date, 2022 consolidated net sales are up 15% year-over-year to $336 million with our flagship Vita Coco Coconut Water brands remaining the main driver of growth, increasing an impressive 22% over the previous year-to-date period. Underlying demand for our flagship Vita Coco coconut water brand remained strong during the third quarter, with net revenue growing 14%, even against a very strong year-ago comparison, despite our third quarter consolidated sales being impacted by out-of-stock on certain branded coconut water SKUs. Furthermore, the U.S. retail coconut water category remains healthy, increasing at a 12% pace in IRI-measured channels for the last 52 weeks, primarily due to Vita Coco's growth of 21%, and we remain the undisputed category leader with approximately half of the value share. We achieved record net sales in the quarter, driven by strong Vita Coco brand growth against a particularly strong year-ago quarter when we grew 33%. To help minimize some of the noise in last year's sales on a two year basis, we grew our consolidated net revenue by an impressive 42%, which represents an acceleration over the first half of the year, driven by strong 58% two year growth for Vita coconut water, highlighting the continued strength of our brands. The growth versus last year was driven by 14% net sales growth for Vita Coco Coconut Water, partially offset by declines in private-label and our other product category due in part to the timing of orders and shipments. Particularly impressive was the health of our Vita Coco brand in the Americas, up 14% in shipments, even with limited inventory on Press one liter and Pine 500 ML and 1-liter products that resulted in slower scan trends and visible out-of-stocks at retail, which we believe resulted in $4 million of lost net sales in the quarter. Our pure coconut water SKUs grew 18% in IRI scan retail sales during the quarter, which breaks down to approximately 13% from volume and 4% from price on top of last year's strong 24% volume growth. Our adjustment down from full-year net sales outlook reflects these lost sales, a steady recovery on flavored branded SKU inventory over the fourth quarter, lower impact of price increases than planned for the fourth quarter, the private-label transition mentioned previously, and current brand and private-label trends against very strong performance last year. We believe our commercial plans for next year should produce solid net revenue growth in 2023 with Vita Coco Coconut Water growth in the mid-teens and with private-label returning to growth for the full year, all excluding any impact of foreign currency translation. The increase was driven by continued strong consumer demand for Vita Coco coconut water, with global net sales up 14% year-over-year. International segment net sales increased 4% to $15 million, primarily driven by higher case equivalent volume of 4% and pricing actions with FX headwinds in our European regions reducing revenue year-over-year by approximately $2 million for foreign currency translation in the quarter, primarily due to the strengthening U.S. dollar against the British pound whose FX rates have declined approximately 15% versus the third quarter in the prior year. Within the International segment, due to the large currency headwinds for the quarter, volume is a better indicator of continued growth, with Vita Coco coconut water driving the majority of the case equivalent volume growth of 5% year-over-year. Consolidated gross profit for the third quarter was $33 million, driven by case-equivalent volume growth, favorable net pricing, and positive mix shift to Vita Coco coconut water, which were more than offset by significantly higher transportation costs versus last year. As you can see in our earnings presentation, our total cost of goods per case equivalent for the third quarter 2022 increased 15% versus prior year period, mostly driven by an increase in our transportation cost from the significant transportation cost inflation versus 2021 levels, which were already elevated versus 2020 levels. For the nine months ended 2022, we are pleased with the 15% net sales growth year-over-year, the consecutive quarterly improvement in the gross margins in 2022, while maintaining similar SG&A leverage for the nine months ended year-to-date despite being in a period of inflationary transportation cost and foreign currency variability. As a result, we are revising our full year net sales outlook to reflect the lost sales due to out-of-stock, a steady recovery on flavor of brand SKU inventory over the quarter, lower impact of price increases for the fourth quarter than we had planned, the current trends on private-label and branded sales and the expected impacts of foreign currency on international revenue. We now expect full year fiscal year 2022 net sales to be between $422 million and $427 million, representing growth in the range of 11% to 12% versus 2021 as consumer demand for our products remains robust. No, I think that's the big thing is, yes, like we said, we grew 63% Vita Coco Coconut Water last fourth quarter over the prior year and really starting to now understand what the steady state looks like and what the brand growth looks like, which is the mid to high teens."
}