{
    "symbol": "COCO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 21:16:06",
    "content": " Net sales grew 28% year-over-year to $96 million in the quarter with our flagship Vita Coco coconut water brand as the main driver of growth, increasing 38% over the prior year period. Given the duration and magnitude of the cost pressures and based on our commercial performance, including strong brand trends and expected increased shelf presence, we now believe that we are well positioned to implement frontline price increases in the second quarter, with further increases planned before the end of the year. On a segment basis within the Americas, Vita Coco coconut water grew 40% to 69% million for the first quarter of 2022, as compared to the same period last year. International segment net sales grew 2% to 12 million in the first quarter of 2022, driven by higher case equivalent volume in Europe, partially offset by our China market, which was incited by return to lock down and lower purchase the commodity sales across other APAC markets. Consolidated gross profit for the first quarter was 19 million driven by strong case equivalent volume growth, favorable net pricing and positive mix from Vita Coco coconut water, which were more than offset by significantly higher transportation costs versus last year. While our coconut water supply chain continues to perform exceptionally well given all the market disruption, the cost to meet the demand primarily related to the transportation environment remained elevated well above what we expected as we head into the year. To put this into context, year-over-year, our total transportation cost mix as a percent of our total cost of goods went from 25% to 40%, which on a rate basis represent approximately a $15 million impact or gross profit for the quarter. And as it relates to sort of the last bit what's going to happen, Q3, Q4, I think we're not comfortable giving a number other than we think it’s prudent to plan for price increases that on a dollar basis would cover our cost of goods increase that we're currently experiencing."
}