{
    "symbol": "PD",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-02 21:55:20",
    "content": " With me on today’s call are Jennifer Tejada, PagerDuty’s Chairperson and Chief Executive Officer and Howard Wilson, our Chief Financial Officer. Before we begin, let me remind everyone that statements made on this call include forward-looking statements based on the environment as we currently see it, which involve known and unknown risks and uncertainties that may cause our actual results, performance or achievements to be materially different from those expressed or implied by the forward-looking statements. These forward-looking statements include our growth prospects and future revenue, among others and represent our management’s beliefs and assumptions only as of the date such statements are made and we undertake no obligation to update these. And during today’s call, we will discuss non-GAAP financial measures, which are in addition to and not a substitute for or superior to measures of financial performance prepared in accordance with GAAP. Revenue grew 34%, an acceleration from Q1 in FY ‘22 and our fourth consecutive quarter of growth over 30%. As always, I want to recognize our customers and partners. Customer expansion was also strong during the quarter, with dollar-based net retention increasing to 126%, above 120% for the sixth consecutive quarter. The mid-market and enterprise segments continue to drive growth, with customers spending more than $100,000 annually in ARR, up 43% year-over-year. These consistently strong results are driven by a robust demand environment, market leading multi-product platform innovation and in-period field execution from our go-to-market teams. In order to innovate to deliver superior customer experiences and optimize talent, they require a platform for action that orchestrates and automates their digital operations. Digital infrastructures are increasingly more complex and interdependent, driving demand for our platform throughout our customer base and across our target markets. Built on the foundation of our digital operations platform, PagerDuty’s Operations Cloud enables both orchestration and automation for all types of interrupt work by leveraging our proprietary data set and extending our integration ecosystem. It’s cloud-native, designed to simplify the complex, built for distributed organizations, easy to deploy and trusted by developers and technical leaders behind your favorite brands. As typical with our customers, they initially implemented PagerDuty for their site reliability engineering teams in 2014. Process Automation On-Prem 4.0 enhances security, stability and usability, while making it simple for our customers to handle incident response and service request use cases across geographically distributed infrastructure, including those who require zero trust communication. We also released PagerDuty Runbook Automation, a new cloud-native SaaS offering that provides customers with a fast start to process automation that is both highly secure and available without having to manage automation infrastructure. PagerDuty is the only cloud-native digital operations platform to combine automation across observability, engagement and action, with the ability to service diverse teams across the enterprise. Our Process Automation customers start by using PagerDuty to capture and automate common repetitive tasks and to diagnose and remediate recurring incidents, for example, automating diagnostics to fix an online shopping cart failure. Quantifiable cost savings and efficiency gains then spur expansion of PagerDuty beyond DevOps, IT and SRE teams to realize gains in other areas of the business, most commonly in security and customer service. This quarter, they deployed PagerDuty Event Intelligence in addition to expanded use of Incident Response for their customer support teams. Regardless of company size or existing commitments, our customers tend to repeatedly expand our relationship as they move up the digital operations maturity curve. Even our largest customers expand their investment in PagerDuty through new product adoption, user expansion and new use cases. Demonstrating this land-and-expand motion, a leading financial service institution launched PagerDuty in 2019 with an initial purchase for group delivering applications for high-value clients then expanded rapidly across other teams through several additional purchases to over $1 million in ARR. As it became evident that teams on PagerDuty resolving issues up to 75% faster, they made an additional 7-figure investment this quarter. They added thousands of new users, standardizing on PagerDuty for incident response, and deployed AIOps and automation across multiple teams. Relationships like this drive our high dollar-based net retention rates, a measure of our durable and growing relationships with our customers. PagerDuty’s Operations Cloud now offers four land products and multiple cross-sell and up-sell expansion opportunities, while delivering value for customers at all five stages of their digital maturity curve, be it manual, reactive, responsive, proactive and preventative. She owns extending our leadership by developing brand awareness, trust and demand for PagerDuty’s Operations Cloud in the C-suite and with developers across the world’s most innovative startups and largest industry leaders. She has deep leadership experience in legal and policy strategy across litigation, contracts, M&A and compliance, while being highly regarded for driving impactful business results with top customers and strategic partners. In April, PagerDuty released our second annual Impact Report, detailing the company’s ongoing commitment to philanthropy, our employee engagement and volunteerism and our ESG commitments. We also announced the launch of PagerDuty Impact Labs, a new program that provides funding, product credits, volunteer technical support to time-critical health partners with a specific focus on leveraging our product and technical expertise to ensure critical time-sensitive care to patients in need. We anticipate sustained demand for our products and services, as our customers seek to efficiently accelerate their digital businesses and more efficiently manage their operations in an evolving macroeconomic climate. Traveling to see our teams and customers has reinforced my confidence in our people, our customers and partners, and our multiple engines for growth. Our vision for an equitable world where we transform critical work, so all teams can delight their customers and build trust, is realized more each day. Thank you, Jen and good day to everyone joining us on this afternoon’s call. In an environment of scarce talent and rising costs, the expanding functionality of the PagerDuty Digital Operations Management Platform covering the full cycle of detection to auto-remediation is allowing customers to revolutionize their operations. Overall, the value proposition of our platform in Incident Response, AIOps, Customer Service Ops and Automation continues to resonate with customers who are intent on driving innovation, efficiency and productivity. Revenue was $85 million in the first quarter, up 34% year-over-year, an acceleration of more than 600 basis points over Q1 of the prior fiscal year. This marks the sixth consecutive quarter of DBNR above 120%, and we expect to continue to be at or above 120% throughout this fiscal year. Q1 ended with 655 customers with annual recurring revenue or ARR over $100,000, up 43% from a year ago. We ended Q1 with 15,040 paid customers, up 8% compared to a year ago, our second quarter of sequential increase. Free and paid companies on our platform grew to over 21,000, an increase of 26% year-over-year, with free continuing to provide a funnel for future paid growth. Our operating loss was $2 million or 3% of revenue, an improvement compared to a loss of $6 million or 9% of revenue in the same quarter last year. Compared to our first quarter guidance, operating margin was favorable due to improved sales and marketing efficiency and headcount growth shifting materially to the second quarter. The joint venture announced after the close of Q1 to establish PagerDuty Japan with our partner, Japan Cloud, is expected to reduce full fiscal year operating margin by approximately 100 basis points. First quarter cash from operations was negative $3 million, and free cash flow was negative $6 million. Total deferred revenue ended the quarter at $167 million, up 33% year-over-year. Quarterly calculated billings were $82 million, which was an increase of 38% year-over-year, exceeding the high end of the range we provided during last quarter’s call. On a trailing 12 months’ basis, billings were $344 million, an increase of 34% compared to a year ago and above the estimate previously provided. For the second quarter of fiscal 2023, we expect revenue in the range of $87 million to $89 million, representing a growth rate of 29% to 32%, net loss per share in the range of $0.09 to $0.08 with basic shares outstanding of approximately 88 million. For the full fiscal year 2023, we are increasing revenue guidance to $364 million to $369 million, representing a growth rate of 29% to 31%. I remain confident in our business and performance, given the current market demand, the acceleration of our product innovation, strong tailwinds and our consistent execution. I think that is driven by the long-term tailwinds that we’ve talked about before, digital acceleration, DevOps transformation and cloud adoption. These digital transformation projects are multiyear projects, and they’re going to continue. I’d also say that our customers are looking for solutions that help them automate, reduce their costs, their cash burn and improve their productivity. And frankly, I’d add that PagerDuty really has become a central infrastructure for most of our customers. So we see them continuing to invest and in fact, like I said, double down in areas like Event Intelligence, Customer Service Ops and Automation. I mean, obviously, we’re going to continue to monitor the macro environment very carefully. We’re spending a lot of time talking to customers, kind of understanding where they’re at. Those digital transformation efforts are still well and truly in train and in fact, in some cases, being accelerated, because they deliver long-term cost savings and productivity improvements. So we continue to see this, like I said, strong demand for applications and services that help you improve the productivity of your existing headcount, free them up to focus on important innovation work. They are, like I said, very committed to their digital transformation programs because they are business imperative, and we have become essential infrastructure. And you can see that in both the stickiness of our platform, gross retention above 95% for years, right, when I talk about essential infrastructure and likewise, strong attach. But to your point, we, like other companies, are going to be judicious about our expenses and our discretionary spend, really focused on having an agile cost base that we can grow from and remain very committed to both profitability in Q4 and for the full year FY ‘24, but also in continuing to improve our operating leverage as we demonstrate that we are a durable growth company. Would love to get maybe just more granular thoughts on how this expands, I guess effectively your TAM or your wallet share within the customer base as well as the stickiness of the platform. I mean first of all, one of the things that Catalytic does for us is it allows us to increase the flexibility in the workflows for our existing customers. And that’s super important, because the types of incidents that they are seeing, the capability and the skill sets of the types of people working on those incidents is sort of widely variable. So, we are not selling Catalytic today as a standalone product, but the intent, as we discussed when we did the acquisition, was really to put that technology into the platform and then to be able to drive the different use cases where our customers are already taking us to those different use cases, but this just makes it a whole lot easier. And one of the reasons that we have talked specifically about Salesforce, for instance, is because they have been a great partner as we have rolled out our Customer Service Operations offering. I think our customers have grown to really depend on us for highly reliable, scaled offerings that very quickly deliver return on investment. And we are going to continue to double down, and likewise, look for opportunities with other partners where it’s meaningful for us. But we – focus is really important to me right now, keeping our teams focused on the priorities that can deliver near and long-term return on investment, super important. It looks like I am glowing – I am glowing about your quarter, but I am not really glowing, so just…\n I really like your background, Chad. So, anyway, yes, I mean the – I mean very clean quarter, like a prior questioner said, and the secondary metrics look like very, very strong. I guess one of the secondary metrics that looked very strong was the customers over $100,000 in ACV, almost double year-over-year and uncharacteristically up from Q4 sequentially, up like 20% or 10%. Like what – I mean what kicked in this quarter in terms of that – for a Q1 to come out of the gate, I think that’s strong. Even our transactional business, Chad, like so many of our customers start small. And then over time, we see other teams like Customer Service Ops come into play as well. If you think about over the last, call it, 12 quarters, all of the innovation and investment that we have talked about, you are starting to see those investments really start to pay out. And I am just really proud of both our engineering teams and our go-to-market teams, because we pushed them really hard over the last couple of years. And it’s great to see the attach rate, more than 50% of our customers have more than two products. I would add in, as a product-led growth company, I think we are seeing the benefits of that showing up, too, because we have made it easier for customers to make smaller incremental purchases, right. And also we have improved our product – in-product discovery so that an existing customer, for example, can trial Event Intelligence and can see whether it makes sense for them. So, the sales team is really being set up well to be able to engage with the customer and something that the customer can already see the value of. And but we have – like Jennifer said, a ton of product innovation over the last 2-plus years. So, we are seeing an increasing number of customers using multiple products, and that ARR coming from multiproduct customers has continued to increase. As we said in the last call at the end of Q4, we had over 50% of our ARR that’s coming from customers with two or more products. But the other dimension not to lose sight of is things like Customer Service Ops, right, we have created like a new land with Customer Service Ops. Congrats on a great clean quarter, really great enterprise and middle market execution that you just elaborated on, Jen and Howard. On first look, the overall paying customer growth is really strong at 88% year-on-year relative to like typical seasonal trends as well. Just relative to the $100,000 customer expansions that you saw like really strong, just kind of was wondering, the enterprise and go-to-market execution super solid. But can you talk about the dynamic at play for like customers, a little down market, are less than $100,000. So, the top of the funnel is still very strong, growing 26%, as you said, Howard, sequentially going to $21,000. The fact that those very small customers can self-serve, try the product, start it free if that’s what they prefer, discover new capability. However, we do look very closely at our customers and whether the change in the – or the strengthening of the U.S. dollar is having a negative impact, like is it impacting on their ability to buy. Folks, it looks like that’s it for questions today. Well, I just wanted to first say how confident I am in our future and optimistic I am about our ability to continue to build a durable and over time a profitable growth company. With that, I just want to say thanks to our customers and our shareholders and wish you all a great day."
}