{
    "symbol": "SGFY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 06:12:04",
    "content": " Total revenue in the second quarter of $246 million, grew 16% on a year-over-year basis, including 18% growth from Home and Community Services, or HCS, as well as strong contributions from Caravan Health. We are confident that our HCS and Caravan businesses are well positioned for continued robust growth due to our leading capabilities, including hard-to-reach gaps in care, including engaging people in their homes, and connecting primary care providers with the actual insights required to be successful and value-based models. Going forward, Signify will have a financial profile that is a greater mix of revenue from businesses with strong visibility and growth, higher margins and improved free cash flows, which positions us to continue to expand and diversify our capabilities in order to help our clients be more successful in their value-based care contracts through improved outcomes for patients. We are also seeing momentum in extending our client relationships into additional books of business such as managed Medicaid and commercial plans as our clients recognize the value of IHE as an effective method for engaging members, identifying barriers to their health, addressing health disparities and connecting them to the right care. The event brought together more than 600 in-person attendees from health systems, physician practices and other healthcare providers to discuss the future of patient care, developments and health policy and the accountable care landscape over the last few years, and our vision for how the combined Signify and Caravan platform will help our clients succeed in total cost of care programs. Caravan contributed $16.6 million of revenue in the second quarter, which was ahead of our expectations due to evidence of a better-than-expected savings rate in our total cost of care programs, and an upward revision of our shared savings revenue estimate that provides the benefit of a true-up in the quarter of approximately $3 million, which is not expected to reoccur in Q3 or Q4."
}