{
    "symbol": "H",
    "quarter": 1,
    "year": 2021,
    "date": "2021-05-05 18:02:04",
    "content": "  Operator: Good day, and thank you for standing by, and welcome to the Hyatt First Quarter 2021 Earnings Conference Call. Good morning, everyone, and thank you for joining us for Hyatt’s first quarter 2021 earnings conference call. Joining me on today’s call are Mark Hoplamazian, Hyatt’s President and Chief Executive Officer; and Joan Bottarini, Hyatt’s Chief Financial Officer. Good morning, everyone, and thank you for joining us for our first quarter 2021 earnings call. Noah has been an essential partner in our Investor Relations effort, and now he’s formally at the head of that. We still see an elevated level of travel restrictions in various parts of the world as a result of new COVID-19 cases, which remain uncomfortably high, especially in areas such as India and South America. And with the number of fully vaccinated potential travelers growing by the millions each day, we feel we’re at the beginning of a growing level of demand for our hotels. Personally, I can’t express how refreshing it is to see people who are now able to safely visit a loved one or travel to a location they’ve been putting off for far too long or to see business travelers who can once again connect in person with colleagues and customers, or to hear from a growing course of larger groups who are ready to convene again in our hotels. Late yesterday, we reported a first quarter net loss attributable to Hyatt of $304 million and a diluted loss per share of $2.99. Adjusted EBITDA for the quarter was negative $20 million, with a reported system-wide RevPAR decline of approximately 49% in constant dollars compared to the first quarter of 2020 and a decline of approximately 65% compared to the first quarter of 2019 on a reported basis. In a moment, I will review the nature of the tax valuation allowance we recorded in the quarter, which significantly impacted our net loss. While hotel closures continue to weigh on our results, the impact is diminishing with a 160 basis-point negative impact on system-wide RevPAR as compared to 2019 reported results. The improved demand led to positive consolidated adjusted EBITDA in March as we increased fee revenue from our managed and franchised business, while narrowing losses from our owned and leased hotels. The United States, Greater China and the Middle East combined to generate approximately 80% of our base incentive and franchise fees for the quarter, with notable acceleration from leisure oriented destinations in the United States during the latter half of the quarter. As for hotel margins, approximately 60% of our global managed hotels achieved positive gross operating profit during the quarter, which is largely consistent with Q4 as more full-service hotels in the United States reached profitable levels, offset by fewer hotels in Greater China due to lockdowns in January and February. We’ve also experienced a pronounced need for incremental staffing coinciding with an inability to quickly fill those staffing needs, especially in markets where demand for room nights is high. When excluding the impact of closed hotels, owned and leased RevPAR decreased 70% compared to 2019, in reported dollars. As with the system-wide performance, owned and leased results strengthened considerably over the quarter with comparable RevPAR improving to $63 in March from $34 in January, driven by increased leisure transient demand. And as a result, we significantly narrowed the owned and leased segment adjusted EBITDA loss to $29 million in Q1 of 2021 as compared to a loss of $48 million in Q4 of 2020. In addition to improved efficiency, certain owned and leased hotels were not immediately able to fill open positions, as I touched upon earlier. Furthermore, as we look to future quarters, I would also note the impact of the remaining closed hotels. As of March 31st, there were 6 owned and leased hotels, representing 17% of our owned and leased room count that remain closed. Therefore, we can continue to expect improvement in our owned and leased segment adjusted EBITDA but the rate of flow through will be impacted as these hotels reopen and ramp up in the coming months. However, results are not expected to be at the 100% or greater flow through we experienced the last two quarters. During the first quarter, our average monthly cash utilization, excluding severance payments and other onetime costs, materially improved to $42 million per month versus an expectation of $55 million to $60 million per month, based on Q4 demand levels. Our average operating cash utilization, including interest costs, amounted to less than $30 million per month and represents a decrease of over 30% versus Q4. Our investing cash utilization, which fuels the growth of our brands and includes capital expenditures, remained flat versus fourth quarter spend and was lower than anticipated due to the timing of certain investments. We expect monthly investment spend to trend higher, consistent with our expected strong year of openings and increased deal activity. As of March 31st, our total liquidity, inclusive of cash, cash equivalents and short-term investments combined with borrowing capacity was approximately $3.1 billion, with the only near-term debt maturity being $250 million of senior notes due in the third quarter of 2021. In March, we also successfully amended our revolving credit facility to provide a waiver extension and additional flexibility, including a one-year extension option. Next, I’d like to provide a couple of important tax updates. First, we filed our 2020 U.S. tax refund claim this quarter, and we expect to receive a tax refund of approximately $250 million later this year in connection with 2020 net operating losses carried back to prior years. And second, and entirely unrelated, we recorded a $193 million noncash valuation allowance on deferred tax assets in the first quarter. This valuation allowance was based on an accounting assessment as required by U.S. GAAP, which places significant weight on our recent pretax book losses, resulting from the impact of COVID-19 on our business and does not factor in our outlook or forward-looking projections. Furthermore, the valuation allowance we recorded has no impact on cash flows and does not limit our ability to utilize current year losses and deferred tax assets on future tax filings. Finally, I’d like to just make a few additional comments regarding our 2021 outlook. We continue to expect adjusted SG&A to be approximately $240 million, excluding any bad debt expense. Additionally, we continue to expect capital expenditures to be approximately $110 million for 2021 and have updated our net rooms growth guidance to be greater than 5% for the year. Our management and franchise business continues to power us closer to adjusted EBITDA breakeven levels, while highly disciplined operational execution has fueled excellent owned and leased hotel flow through. And with that, I’ll turn it back to Polly for Q&A. I was hoping that perhaps you could frame the productivity impacts on owned and leased hotels, perhaps where demand might need to get back to recover to prior levels of EBITDA. Definitely exceptional owned and lease flow through over the past couple of quarters, led by some of the what I would call contingency measures that we put in place, but also actions that have long-lasting impacts into the future. So, we’ve gone through some of those, but efficiency measures that we’ve taken, enhanced digital capabilities, leaning into our F&B options that are the most profitable and importantly meeting customer needs at this time. Headwinds, you mentioned headwinds over the next several quarters, and as I mentioned in my prepared remarks, with respect to expectations for flow through. The labor situation, we expect will improve and we’ll get back to more sustainable productivity measures. So, those will be ramping up, and those will be some of the headwinds that we’ll experience. So, that’s helped us on current quarter and some of the headwinds that we’ll see into the future. But, we remain confident that we’ll achieve margin expansion as top line stabilizes over time. As to Miraval, the dynamics in Miraval were impacted last year by the conclusion of the renovation and construction of Miraval Berkshires, which opened in the second quarter of last year. It was overall, a challenging year last year for all of our hotels, including Miraval, primarily due to travel restrictions and also social distancing issues. In the first quarter, we likewise had a number of restrictions that were imposed by local law with respect to social distancing and travel restrictions as well out of certain feeder markets that did impact our overall results. So, the fact that that was the dimension of the business that was impacted, meant a significant impact in the first quarter. The bookings that we’re seeing into the summer are extremely strong, and we think that we will see significant pickup over the summer months into the fall. And assuming that we continue to go down the path of elevated levels of vaccination and easing of those other travel restrictions or capacity constraints, we expect to finish the year very strong. We’re well-positioned through the three resorts that we’ve got, one in Tucson, as you know, in Austin and in the Berkshires in Lenox, Massachusetts. The only other point that I would add with respect to first quarter dynamics is that, as you’ll remember, the state of Texas essentially shut down for some period of time because of their electrical grid going down. And that, of course, affected our resort in Austin, primarily because people literally could not get there over the roads that were blocked or too icy to drive on, and of course, the electricity needed to be restored. So, those are some factors that I would point to that maybe help to contextualize what happened last year into this year. That’s helpful, and perhaps an unrelated follow-up. So look, I think, if we go back to late 2018 when we bought Two Roads, by way of reminder, Hyatt without Two Roads was about two-thirds, one-third mix of business and leisure travel. If you look at the overall global number, it’s about -- was about 45% of our total revenue came from leisure transient travel in 2019 -- 2018 actually and 2019. So, as we look into potential opportunities that would be meaningful to us, we’re looking to ensure that we’ve got very compelling resort alternatives for our guests, not just because of the benefits within the World of Hyatt, but because it’s been shown, especially in the customer base that we serve, which is a relatively higher customer base that they are continuously demanding and looking to travel at an elevated rate. So, one of your peers suggested this morning that they saw a path to getting back to about 70% of 2019 RevPAR by year-end. I’d love to actually know where to get that crystal ball, because -- so if you find out, if you could let us know, that would be really great. What I can tell you is that we are seeing sequential improvement month-over-month-over-month, and it’s very pronounced in March and April, as we talked about. So, I guess, it’s theoretically possible, but I think it’s unlikely, primarily because the -- some of the international inbound travel that impacts gateway cities is still going to be with us. But, it’s going to be highly dependent on when those international travels reopen. And secondly, we’re starting to see, as you probably have read in the papers recently that some companies are actually moving towards requiring their employees to be back in the office by a certain date. That’s actually not so not so distant from now, pretty soon. I would say that just based on our current outlook, we will be significantly higher in terms of our expected RevPAR levels by the end of the year, assuming that we don’t have any significant case load issues that come to pass. I can’t tell you that it will be 70% or above, but it will be significantly higher than where we are today. Mark, I think, in the prepared remarks, you mentioned a little bit about, obviously, you’re looking on the acquisition trail, but you’re also mentioned sort of going back to the capital recycling plan a little bit. I mean, I guess, what I would say to you is that the two deals that -- the two hotels that we’re in the midst of evaluating disposition of that are advancing. So, we’re very encouraged by that. So, I think they are opportunities for us to realize proceeds from sale and also an opportunity for a new owner to deploy additional capital in those properties, which do include some developable land in both cases, to further expand those operations, by the way, which would enhance our fee base going forward as well. So, I’ve been encouraged though overall. As we’ve talked about a number of times, the financing market for construction is quite challenging. And so, it’s not too surprising that resorts would be at the front end. With respect to capital formation, it’s -- we’re at a point where we’re starting to see the very first signs of banks, mostly regional, not necessarily money center banks, starting to make proposals that are getting closer to a debt stack that could make sense for a developer. I don’t mean financial leverage, I mean, impact by maybe seeding an opportunity to put some capital together with some third parties to help provide some additional construction financing in the short-term because we have a significant number of deals that are either in LOI stage or signed that we don’t count in our pipeline by virtue of the fact that we don’t see the financing in place to actually start the construction. So, it’s something that we’re paying a lot of attention to. Mark, last quarter, you talked a lot about this hybrid meeting solution that you are coming up with, which I think could differentiate you guys from some of your competitors in urban markets. I’m thrilled to tell you that we’ve got two large meetings, on in June and one in July. So, in both cases, they range from sort of 800 to 1,000, depending on which one of these two that you’re looking at, participants. But the way that they’re comprised is they’re spread, in one case, across 10 of our hotels across the country and another, as many as 27 of our hotels will be involved across the country. And they are effectively doing a multi-local -- a linked multi-local hybrid event where you’ve got somewhere in the range of 30 people per hotel across that, say, 25 to 27 hotels, and you also have remote participants who are coming in digitally. And I personally believe that this is going to be an effective way to allow people to still have an in-person meeting for those who can attend, those who are prepared to attend, and get the benefit out of the interpersonal connections. And I think it can apply to one of those firms -- and that firm, in particular, is looking at a partner meeting of 1,500 people at the end of this -- in the fourth quarter of this year. But the -- I think, the point is that we’re opening up a very different type of thought process to enabling people to actually hold a portion of their meeting or have a significant portion of their attendees attend in person. A lot of companies, professional services firms have pushed those decisions, because they don’t provide -- they don’t want to impose further pressure, but they’re also desperate to get people together because they’re worried about maintaining culture and connectivity to the firm. Now, we’re literally at the very beginning of this. Obviously, there’s been some flexibility and so forth. David, I -- last year, we made a decision to continue to incur some costs that we chose not to, while we had the option to, we chose not to bill back to our owners, given all of the disruption that was ahead of them last year. This year, as we’re looking at recovery, our goal and intention was always to monitor the costs we incurred and make sure that we were doing that in a way that we could recover fully from our owners. But, all of the costs that we’re incurring right now, we have every intention to recover from our owners into the future. And roughly speaking, that structural shift reflected the economics that we actually experienced last year anyway because we -- Joan just mentioned, we volitionally undertook spending at a certain level for the benefit of our owners, and we did end up taking a charge in the fourth quarter of $45 million in relation to that. But, we see the opportunity to, first of all, fully recover going forward on a more tightly aligned basis that is alignment to our owner’s interest. But secondly, we’ve also identified a few areas, especially in the digital sphere, where we have created effectively a pay-for-performance structure. And I believe that that will, frankly, allow us to expand what we’re doing on the digital front through an incremental set of fees that we built into the new structure. So, that’s really what we’ve done and undertaken. So, maybe to begin with, I would say that group revenue in the first quarter -- realized group revenue that is, that we reported was almost 90% off of 2019 levels. Now, if you -- that’s for the Americas hotels that we manage. The reason is because -- and really, the -- almost the exclusive difference there is group business in China, which did take a hit because of the lockdown in China but has been pretty vibrant and robust because corporations have definitely taken to holding meetings. Now, let’s pay attention to how much of this translates into realized revenue. I mentioned during my prepared remarks that we hit this inflection point in April, where the gross bookings exceeded any cancellations or reductions in attendee expectations for the remainder of this year. That’s a big deal because, frankly, all pace numbers that might have been cited over the last 12 months are either irrelevant or misleading, because you can’t really track pace properly unless you know what’s falling out the bottom with respect to future cancellations or reductions in attendance. And so, we’re just now getting to a point where I think we’ll start to have more reliable pace estimates going forward. So, we don’t -- we’re not actually standing up an a la carte breakfast menu in a number of hotels. In favor of that, we’re actually making it more of a grab and go operation with a ability to finish cooking, a breakfast burrito or a muffin on site. So, that’s some of the savings that we talked about. But, I would say that the impact of being able to truly get back into serving large numbers of people on property is going to ramp between the end of this year into next year. So, we won’t really fully realize the F&B revenue opportunity until next year, primarily because we will have less on property attendees in some cases and also because they will remain, I believe, although we could get lucky and have all spacing requirements and concentration requirements, attendee requirements in indoor spaces be alleviated, but there may be some that persist through the end of the year. So, that’s how we think about it."
}