{
    "symbol": "H",
    "quarter": 3,
    "year": 2021,
    "date": "2021-11-04 17:34:04",
    "content": " In the span of just two quarters, our quarterly adjusted EBITDA has improved $130 million recovering to nearly 70% of 2019 levels in the third quarter. As discussed on our last earnings call, we experienced a wave of leisure demand during the summer with system-wide RevPAR eclipsing $100 in July, which was approximately 75% recovered as compared to 2019. In October, our leads for 2022 grew by 38% as compared to September, and we're now 10% ahead of 2019 levels for group business that is likely to book, while group pace for 2022 is approximately 80% recovered a bit weaker than what we reported last quarter, the strong current level of group bookings coupled with growing lead volume provides confidence that momentum will build as we head into 2022. Our based incentive and franchise fees totaled $96 million in third quarter, reaching 71% of 2019 levels with base and franchise fees more fully recovered than RevPAR as a result of our strong net rooms growth over the past two years. Turning to our segment results, our management and franchising business delivered a combined adjusted EBITDA of $85 million improving 33% from the second quarter. Owned and leased RevPAR was a $117 for the third quarter, improving 39% from the second quarter with notable improvement from group revenue, which jumped 87% sequentially and accounted for over 28% of the room night mix. But the other thing that we spend a lot of time learning about and really getting more excited about are the capabilities within ALG vacations, and Trisept Solutions, we see a lot of interesting platform opportunities, they have a very strong base of capabilities that are primarily in the packaging and very novel approaches to revenue management and working with third-party channels that we think we can actually apply to existing Hyatt Resorts and not to mention the destination management companies that they operate in different markets."
}