{
    "symbol": "TILE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 09:47:08",
    "content": " Adjusted SG&A expenses were 79.4 million or 23.7% of net sales in the fourth quarter of 2022, compared to 81.6 million or 24% of net sales in the fourth quarter of 2021. Adjusted SG&A expenses for 2022 were 317.6 million or 24.5% of net sales, compared to 316.1 million or 26.3% of net sales in 2021. Also in the fourth quarter, we recorded non-cash goodwill and intangible assets impairment charge of 36.2 million, primarily due to a decrease in the fair value versus carrying value as a result of the company's decreased market capitalization, comparable company market multiples, projected future cash flows, and an increase in the weighted average cost of capital due to rising interest rates and prevailing capital market conditions. As the company navigates through this uncertainty, it is anticipating for the first quarter of 2023, net sales of 290 million to 305 million, adjusted gross profit margin of approximately 34%, adjusted SG$A expenses of approximately 82 million, adjusted interest and other expenses of approximately 10 million, fully diluted weighted average share count of approximately 58.7 million share. And for the full-fiscal year of 2023, year-over-year net sales growth of 1% to 5%, adjusted gross profit margin of 35%, adjusted SG&A expenses that are 25% to 25.5% of net sales, adjusted interest and other expenses of approximately 36 million and adjusted effective tax rate for the full-year of approximately 28.5%. Yes, it's a great question. Yes, Keith, I'll just add to what Laurel mentioned. Yes, Keith, I'll just add to what Laurel mentioned. Yes, it's a great question. And that's where we're mostly focused, especially as we enter into 2023 followed closely behind to that is obviously investing in the business and one â\u0080\u0093 and that's â\u0080\u0093 and that's the 32-ish million that I just mentioned of CapEx and obviously, making sure that we fund initiatives that the business needs to be funded with in order to achieve its growth."
}