{
    "symbol": "OSIS",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-29 06:48:04",
    "content": " Second, we reported adjusted earnings per share of $0.87, down from $1.16 in Q1 of the prior year, as a result of the reduced revenues just noted, a less favorable mix of sales and additional interest expense under the credit facility, which was increased in December 2021 with the primary objective of retiring the convertible notes. I will now talk about each divisionâ\u0080\u0099s performance in the quarter, starting with the Security division where Q1 revenues were 3% lower year-over-year and bookings were approximately $204 million for a book-to-bill ratio of 1.4 for the quarter. Our cargo and vehicle inspection products are used extensively at borders to prevent contraband and illicit materials and drugs, such as phenethyl and methamphetamine, from crossing into the U.S. We continued to deliver of these inspection products to CBP in Q1 with a modest amount of revenue, significant revenues from this CBP program over the balance of this fiscal year and in fiscal 2024. Opto delivered strong results in the first fiscal quarter with $94 million in revenue, including intercompany revenue, which is an all-time quarterly record with strong growth in the divisionâ\u0080\u0099s operating profit. Net interest and other expense in Q1 of 2023 increased to $3.4 million from $2 million in the same prior year period, primarily due to rising interest rates and the maturity of our 1.25% convertible notes on September 1st, which were at a lower rate than our current borrowings. We were pleased with the increase in the adjusted operating margin in our Opto division, which expanded 12.7% in the first quarter of fiscal 2023 from 11.4% in the prior fiscal year first quarter due to a more favorable product mix and implementation of certain efficiency improvement initiatives. Moving to cash flow, cash flow provided by operations were $17 -- was $17 million in Q1 of fiscal 2023 compared to cash used in operations of $11 million in the same prior year quarter. Your line is now open. But we look at the second quarter, third quarter and fourth quarter will be stronger and there is lot more activity and one of the things is we are investing quite heavily in SafeNSound, our software platform, which has been very well received and can -- and basically makes us a little bit different than our competitors and we continue to look at that as a growth opportunity and it also has higher margin. Your line is now open. Larry, this is Alan. Larry, this is Alan. â\u0080¦ well with your customer and you have the ability to support it and you have the supply chain under control and facilities like we have and we have said that we have expanded them in Batam, Indonesia, Malaysia, India, that has played a big part of capturing more business from our regular customers who basically are more focused on seeing growth and working with a smaller bunch of vendors and we have -- we are well positioned in various places and have been a very, very good supplier to our customers. Your line is now open. Your line is now open. Your line is now open."
}