{
    "symbol": "OSIS",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-26 17:37:16",
    "content": " representing a year-over-year increase of 7%, driven by solid revenue growth in our Security and Opto divisions, which were in part offset by soft Healthcare division sales and an approximate $4 million unfavorable FX impact. The Security division delivered Q2 revenues of $167 million, about 15% higher than Q2 in the prior year. While Q2 year-over-year Security division revenues were up double digits and operating margin expanded, we believe the most notable item of the quarter was an exceptional bookings highlighted by a $200-plus million international order that we received in December and announced shortly afterward quarter end in January. The Security division's book-to-bill ratio was approximately 2.3%, positioning the division well for strong revenue growth in the second half of fiscal '23 and into fiscal '24. As Deepak mentioned, the Healthcare division, which is our smallest business unit, representing about 15% of our overall first half sales, reported a 17% reduction in year-over-year revenues in a more challenging marketplace and in part due to a tougher year-over-year comp given the prior year elevated demand during the COVID Omicron variant surge. Based upon our forecasted conversion of backlog to revenue and pipeline of opportunities, we anticipate a stronger gross margin in the second half of fiscal '23 compared to the first half of this year. Research and development expenses in Q2 of fiscal '23 were $14.5 million, consistent with that of the first quarter and just below the prior year amount of $15 million. Moving to interest and taxes; net interest and other expense in Q2 of fiscal '23 increased to $5.2 million from $2.2 million in the same prior year period, primarily due to rising interest rates and the maturity of our 1.25% convertible notes on September 1, which carried a lower rate than our current bank borrowings. Overall, our non-GAAP adjusted operating margin in Q2 of fiscal '23 decreased to 10.7% from 12.0% in the same prior year period. The adjusted operating margin in the Security division increased to 14.7% in Q2 from 14.2% in the prior year second fiscal quarter, driven by higher revenue and disciplined OpEx management. We were pleased with the adjusted operating margin in our Opto division of 13.1% in the second quarter of fiscal '23, representing our second best result historically for this division. Finally, turning to guidance; we are tightening our fiscal '23 revenues range guidance by $10 million at the top end, primarily attributable to the softness we saw in the Healthcare division this past quarter. Fair to assume that like the free cash flow cadence is going to be, let's call it, maybe comparable to last year, but next year likely to be in excess of the $100-or-so million you've kind of historically achieved as some of the revenue materializes."
}