{
    "symbol": "EXC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 14:31:02",
    "content": " We told you on Analyst Day, we expect to invest $29 million of capital to serve our customers in our communities over the next four years, which supports an annual growth rate of 8.1% that will drive the long-term earnings growth rate. As many of you know the path to achieving our annualized growth target is not linear, but 6% to 8% commitment through 2025 is our focus, largely because the cadence of rape cases, we have some years that maybe lower than that range and other years that will be above that range. As a reminder, the prior year third quarter reflects an $0.08 per share discontinued operations adjustments for certain corporate and overhead costs, previously allocated to generation that are required by accounting roles to be presented as part of Exelonâ\u0080\u0099s continuing operations. Delivering year-to-date earnings of $1.84 per share puts us slightly ahead at 82% of the midpoint of our revised guidance range, which considers the impact of higher treasury come on the distribution ROE, the absence of storms and our continued disciplined approach to cost management. The settlement was for a $13.4 million increase in distribution rates, which includes the transfer of $5.8 million of revenues from the distribution system improvement charge capital tracker into base distribution rates, reflecting an ROE of 9.6%. Notably, Delmarva Power reached a settlement on the majority of key elements for its first electric distribution multi-year plan with the Maryland Public Service Commission, including a cumulative revenue increase of $28.9 million beginning in 2023 through 2025, reflecting an ROE of 9.6%. As Chris described, we are confident that $29 billion of investments we are making on behalf of our customers will result in expected rate base growth of 8.1% and 16% annualized earnings growth from 2021 through 2025. Then with an expected rate case filing for PECO electric in 2025 and the rest of our utilities growing generally in line with the rate base investments, we expect to be above the upper end of the 6% to 8% range in 2025. Even if unmitigated, as Chris noted, we expect to observe the cash impact on our balance sheet with cushion above our downgrade thresholds and we expect to be in our targeted 13% to 40% average range over the planning horizon without a need for incremental equity beyond the previously announced $1 billion commitment from 2022 through 2025. We offer a very strong proposition â\u0080\u0093 we have offered very strong proposition and will continue for years to come with the balance sheet and matching dividend commitments, combining our 3.5% dividend yield with the 6% to 8% annual growth offers low risk to the 9.5% to 11.5% total return proposition. Your line is open. Your line is open. And I think the fundamental thing is itâ\u0080\u0099s consistent with what we said at Analyst Day and that weâ\u0080\u0099re investing $29 billion, which drives the rate fees growth of 8.1%, which drives the earnings growth. Your line is open. Your line is open. Your line is open."
}