{
    "symbol": "EXC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 13:57:07",
    "content": "  Operator: Hello, and welcome to Exelon's Second Quarter Earnings Call. It is now my pleasure to turn today's program over to Jeanne Jones, Senior Vice President of Corporate Finance. Good morning, everyone, and thank you for joining our second quarter 2022 earnings conference call. Leading the call today are Chris Crane, Exelon's President and Chief Executive Officer; and Joe Nigro, Exelon's Chief Financial Officer. We issued our earnings release this morning along with the presentation, all of which can be found in the Investor Relations section of Exelon's website. Please refer to today's 8-K and Exelon's other SEC filings for discussions of risk factors and other factors that may cause results to differ from management's projections, forecasts and expectations Todayâ\u0080\u0099s presentation also includes references to adjusted operating earnings and other non-GAAP measures. Before I get into the quarter, I want to spend a minute talking about the Inflation Reduction Act, a bill that's being considered in Congress. However, the bill also proposes a corporate minimum tax that could undermine the benefits of those incentives and slowly investment needed to make this transformation. The lower cost of clean energy technology and efficiency, their investments will be offset by higher taxes on companies making investments. With this language currently proposed, we and other utilities could face an increase in cash tax. While the bill has yet to pass in specifics could change as currently drafted, we could see an impact of incremental cash tax of approximately $300 million per year starting in 2023. The higher tax would ultimately limit our ability to invest in infrastructure needed to accommodate the clean energy our customers want in our jurisdictions of pursuing, but the situation remains very fluid. In the meantime, we're working to advocate for language that better aligns incentives to achieve what we all want a cleaner, resilient, reliable and affordable grid, bridge that we are not getting  Cleaner grid. We continue to execute on our plan, focusing on operational and financial excellence to serve our customers in our communities while supporting their environmental and social equity needs. We continue to expect our full range -- full year results in line with $2.18 to $2.32 range, we provide an on our Analyst Day. In May, Delmarva Power & Light Maryland filed his first multiyear plan covering investments from â\u0080\u009823 to â\u0080\u009825 period. We look forward to building on the successes of the multiyear plans we have in place and leverage lessons learned to deliver value for Delmarva Power, Maryland customers. In Illinois, ComEd continues to work on a new rate setting process, including proposed performance metrics. In addition, on July 1st, ComEd filed its first beneficial electrification plan with the Illinois Commerce Commission, as required by the CEGA, ComEd proposes spending approximately $300 million from â\u0080\u009923 to â\u0080\u009825. As a reminder, ComEdâ\u0080\u0099s first distribution rate case under the new rate case structure will be filed in early 2023 for rate effective in 2024. And of course we continue to support our communities and provide transparency to stakeholders on environmental, social and governance practices. We recently published our ninth Annual Corporate Sustainability report, our first as a TOD only utility. For instance, there's many programs going on, but for instance, it discusses our STEM activities, which in our 30 years this summer hosting approximately 180 young women in urban centers. And in May, the Exelon Foundation selected nine young women that have graduated from our STEM program academies to receive a scholarship for the college education totaling $1 million. It's quite impactful for those young women, and it was quite impactful to be able to speak to them directly and tell them what they have just achieved. The report also highlights $200 million climate change investment initiatives, a program that supports startups with potential to have wide scale impact on climate change risks. It's a 10 year program, these companiesâ\u0080\u0099 business models address climate related products and services like EV charging repaired, carbon accounting platforms and other focus areas. From a reliability perspective, we've seen improvement from the first quarter. ComEd delivered its best CAIDI performance on record despite severe storms in June, we met the restoration targets early restoring 80% of 125,000 impacted customers in less than a day. And ComEdâ\u0080\u0099s distribution automation investments avoided almost 70,000 additional customer interruptions. As always, safety remains our number one priority, BGE, ComEd and PECO continue to earn top quartile customer satisfaction performance through the second quarter. And lastly, we'll maintain -- we maintain the top decile performance in odor response across our three gas utilities. And this is very important for us to maintain confidence in the system, our gas distribution system that we can find, fix and repair anything that comes up so it's really good to see. Today, I will cover our second quarter results, our quarterly financial updates and highlight several ways in which our utilities and power and economic health and wellbeing the diverse communities in which we serve. As a reminder, the prior year second quarter reflects a $0.09 impact for discontinued operations adjustment for certain corporate overhead costs that were previously allocated to our generation segments that are required by accounting rules to be presented as part of Exelonâ\u0080\u0099s continuing operations. Excluding the $0.09 impact quarter-over-quarter of the discontinued operations accounting adjustment for service company allocations, Exelonâ\u0080\u0099s second quarter results were a $1.00 lower than the second quarter of 2021. We did benefit from higher distribution rates associated with completed rate cases, including higher Treasury rates impacting Commonwealth Edison's distribution returns. But this was offset by higher depreciation and amortization, bad debt, timing of other costs utilities, and the impact of rising rates on the debt at the holding company. As Chris mentioned, we continue to reaffirm our 2022 EPS guidance range of $2.18 to $2.32 per share. Our year-to-date operating earnings results of $1.08 per share, are exactly in line with the historical percentage of full year earnings, in which we outlined at Analyst Day. Growth for the balance of the year will occur primarily in Q4, as we continue to realize the benefits of higher distribution and transmission revenue, including the net impact of higher Treasury's on ComEd. It will also include the absence of unfavorable weather and storms from a previous year, and the timing of taxes and O&M spend that impacted us in the first two quarters of this year. Moving on to slide 7, looking at our utility returns on a consolidated basis, we expect to be in our consolidated 9% to 10% target by year end. As we discussed on our last call, the timing of equity infusion supporting capital investments across all utilities outpaced the higher earnings, driven primarily by distribution and transmission rates. We remain focused on delivering stronger returns at the utilities, which the semi investment we make on behalf of consumers. Turning to slide 8, it was another quiet quarter on the regulatory front, with one notable rate case development. Delmarva Power filed its first multiyear plan with the Maryland PSC, the third of its kind in the state proceeded only by its sister utilities of BGE and PEPCO. As we've noted before, the multiyear plans approach allows us to align with all stakeholders where the company is focusing its investments. Among the hundreds of projects, the plan specifically includes investments in the electric distribution system to continue to improve reliability and customer service, advanced technologies to modernize the distribution system and provide tools to assist customers in managing their usage. Delmarva, Delaware has a gas case with rates going into effect on August 14, subject to refund and an expected decision in the first quarter of â\u0080\u009823. Additionally, we expected decision on the PECO gas case in the fourth quarter this year, and our ComEdâ\u0080\u0099s final formula rate filings in December. Overall, we are pleased with the progress in advancing progressive regulatory designs that benefit our customers ease regulatory burden and improve visibility for our utilities. As a reminder, we expect nearly 100% of our rate base growth will be covered by alternative mechanisms by the end of our planning periods. And more details on the rate cases can be found on slide 18 to 21, in the appendix of our earnings presentation. On slide 9, I want to spend moment discussing the work that our utilities do to partner with local state and federal agencies, as well as community groups to ensure we are maximizing opportunities for our customers to benefit from the various build assistance programs available to them. With the challenges presented in the last couple years by the pandemic, and recent inflationary pressures on customers, there have been increases in the funding available to support our most vulnerable customers. For instance, the LIHEAP program it run since 2017 by $400 million to $3.8 billion in total. However, the percentage of households taking advantage of this assistance has remained flat nationwide, implying additional opportunity to support our customers that has gone untapped. Our utilities with their capabilities around billing and customer service, have stepped up to this challenge, looking for innovative ways to support the governmental agencies and ensure more eligible customers are taking advantage of the programs available. ComEd introduced the Community Energy Assistance Ambassador program, whereby it offered employment to over 100 local residents to serve as trusted partners to educate customers about financial assistance, as well as energy efficiency. With support from these ambassadors, ComEd was able to expand its reach into hard to engage communities, distribute more than 11,000 Energy Efficiency kits and connect customers to a record $146 million in financial assistance, representing a 95% increase in the number of grants customers received relative to 2020. Of the PHI utilities, ACE Delmarva and PEPCO also took advantage of local outreach strategies, leveraging a data driven approach to ensure they were targeting the highest opportunity areas. These efforts resulted in customers securing $125 million of energy bill assistance, an increase of 70% from 2012. I can say similar approaches were also employed at our PECO, BGE operating companies, and Exelon efforts across all utilities resulted in over $450 million of funding, making its way to more than 650,000 customers, which lowers arrearages and bus bills for all consumers. In fact, these efforts were recognized by EI who selected Exelon as an Edison Awards finalist in 2022, specifically for the innovative ways we helped our customers obtain this assistance. If I move on to slide 10, during the second quarter, we continue to invest capital for the benefit of our customers and are on track to meet our $6.9 million commitment in â\u0080\u009922. These investments will improve reliability, and resiliency, enhance service for our customers and personally prepare the grid for a clean energy future. Today, I would like to talk about the impressive effort led by BGE to replace a half century old underground underwater circuit nearing the end of its useful life in the heart of Baltimore Harbor. Rate reliability improvements stemming from the key crossings initiatives were made possible by the estimated 300 to 350 talented women and men who contributed to this project and all the constituents engaged in this -- 0:24:28.9 .each fader have BGE opted to replace the segment with overhead transmission lines, because the environmental impact was minimal, and it was cost effective and better supported the Port of Baltimore shipping operations, while having the greatest potential for local and domestic job creation. Lastly, I want to provide an update on our balance sheet, which we committed to keeping strong to support the investments made for the benefit of our customers and communities. As we announced in February of 2021, and reaffirmed as recently as last quarterâ\u0080\u0099s call, we plan to issue $1 billion of equity in the holding company by 2025 as part of a balanced funding strategy. Beyond our equities complaints, as we noted in the first quarter, we have completed our long-term debt financings at corporate for the year, there is no change to our expectation and our consolidated corporate metrics will average 13% to 14%. And with a number of financings completed this quarter at our utilities, we continue to benefit from robust demand for that debt backed by extremely strong credit ratings that are operating. As you've heard from Chris, we are monitoring the Inflation Reduction Act, and its potential impact on cash  and tax. And turning to slide 12, Iâ\u0080\u0099ll close by reiterating that Exelonâ\u0080\u0099s value propositions, its position in the sector, Exelon is a premier TOD only company in the nation consistent of delivery and reliability results. Our purpose of powering a clean, brighter future for our customers and communities is how important ESG principles are to our company. The net results in our operating, our opportunity to invest the $29 billion of capital over the next four years for our customers, with an annualized 6% to 8% operating earnings growth through 2025. Yes, I'll take the first half and let Joe take the second half. We have been working with our Head of Federal Regulatory Affairs, Melissa Levinson, who's in a room here. We have done significant amount of outreach, not only as a company, but as an industry to make sure that the message is heard that there is a technical fix that there's a potential or other methods. I think it remains very fluid, we know that senators are working to review the bill, and understand the impacts. And expectations are that they're going to try to vote on the bill, but the end things remain fluid. I think as we look at the bill, we continue to talk with the senators about potentially unintended consequences of how the tax might be applied, and its impact on our ability to continue the robust investments that we're making. The 15% passage as you mentioned, we wouldn't expect to update our financing plans by EI, our normal cadence is that we would do that on the Q4 call after the first of the year. And mark things to that point, whether it's treasuries, pension, et cetera, et cetera. Shahriar, as for your last question because of multiyear plans are just for tax changes, I think what we would say it's unclear at this point how these taxes will flow through to our customers, as this, obviously as Melissa and Chris just have talked about this situation is very fluid. As it's currently written, we've reached the threshold for the tax at the consolidated level. And then just lastly, Joe, a little bit of confusion, I guess, this morning around the language around the equity plans for â\u0080\u009822. Yes, I think there's a couple of answers to that, Shahriar. I think the first thing is if we were having this conversation, the first of the year, we might have even had a different view with that but thatâ\u0080\u0099s market conditions change, we have to change with it. So what we've tried to do is be transparent that we're putting a $1 billion ATM in place between now and â\u0080\u009825, which is what we told you the equity needs were, we're going to do $500 million of it this year. Yes, we, as I said this is obviously a very fluid situation and we're not ready to commit to either of those. What I can say, though is, on the Analyst Day, we committed to use 16% earnings CAGR through 2025. And then you mentioned the performance base rates, we've been watching in ComEd. But strategically tailwind, we are heading -- we're trying to head in that direction. So as you mentioned, we've been working with stakeholders and filed our performance based metrics outline and goal, which would add if ComEd is able, we were confident to sit back and afford reliable and electricity to the customers, as well as helped the state achieve its goals. And we also provided an alternative to the commission if they wanted to consider adding up to 40 basis points, but all based on ComEd rising to the standards that have been outlined in collaboration with the stakeholders. Yes, Joe, you want to --\n Yes, Steve, whatever it is, I don't think we're ready to get into that. We have to go through year end planning process and see what if, what portion of this we can offset with other actions that we can take across the enterprise. There's cost cutting, there's adjustment and project schedules, there's multiple ways to avoid any impact on our metrics. But we want to keep our capital spending plan where it's, our growth where it's at for reliability, and affordability, while we're maintaining a system that will take on the renewable. So there's a few balls in the air that we'll have to juggle, but we would rather have the fix to the bill. So we're not having to juggle this, but we'll see how we prevail as an industry as we go forward. So, as we previously disclosed, we executed some short-term debt, at the time of separation that we're now planning to use the equity to pay down and that's all part of the balanced funding strategies, to continue to support the balance sheet. We went through an evaluation of the type of equity issue and as I said earlier, itâ\u0080\u0099s still very fluid due to changing market conditions and we want to maintain as much flexibility as we can and that's why we're saying we're putting an ATM in place. And good morning, we talked about this, we're confident in that 16% growth rate that we've given you through 2025 as relates to earnings. We've said there is some variability between the years and this really driven by three factors, right. One is, ComEdâ\u0080\u0099s, the distribution return through 2023 is still tied to treasuries, which obviously, we don't control that mark-to-market exercise. And then lastly, we're transitioning to different ratemaking in Illinois, 2024 and beyond. And we've done that, and we're comfortable with ranges around that, and that 16% growth rate, but that drives some variability as well. And then any latest thoughts as to when you might be able to achieve something in the middle, like 9.5% ROE level as you look out in the forecast? Yes, I think the reason you see the lower ROEs early in the year, and you saw the same trend last year is, it's tied to the equity, we're infusing into utilities, we do, a majority share of our debt offerings early in the year across the enterprise. And as such, to keep those capital structures in line, we infuse the equity, which over the course of the year takes time for ROEs to catch up. So we're confident, we target 9% to 10%, for all of our utilities, we're confident at year end will be in that range, on average across the utilities. The key on this is the rate cases, as Joe said, and we've seen downward pressure in other jurisdictions on that 9.5% to 10%. Chris, if I can add, this is Calvin, David, I would also point out, Joe alluded to ComEd earnings being tied to the Treasury. But understand ComEd is also one of the lowest in earnings of any utility that impacts that 9% to 10%, average. So as ComEd begins to transition out of the formula rate, you will see that have a greater impact on the collective of utilities. And it's also important to note, when we talk about the multiyear plans, those three year plans that we've been put in place in Maryland, as well as in the District of Columbia. So when we talk about investments across the utilities, that transparency is giving stability to those ROEs and also the growth projection that Joe talks about that 6% to 8% a year. Joe, I just want to go back to the $300 million per year cash impact from the alternative minimum tax, just given that your cash effective tax rate is going up each year. So I'm looking at this slide, which shows 2022, this is slide 16, in the appendix, I believe, which shows the effective gas tax rate going from like less than a 0.5% to 4% in 2023. I think there's a lot of variables that go into that equation, or maybe we, given the size of our enterprise, and the number of operating companies we have, obviously, there's a lot of things that move around in a given year with taxes. I mean, we see that each and every year, and then quite frankly, each and every quarter. Chris alluded to here, there's still -- we still go to get to the goal line on this and see where it plays itself out. We're giving you an indicative view what we think that impact looks like over, our planning horizon that we've disclosed. At this time, I'd like to turn the call back over to Chris Crane, President and CEO for closing remarks."
}