{
    "symbol": "DG",
    "quarter": 1,
    "year": 2021,
    "date": "2021-05-27 14:40:06",
    "content": " At this time, I would like to welcome everyone to the Dollar General First Quarter 2021 Earnings Call. I now like to turn the conference over to Mr. Donny Lau, Vice President of Investor Relations & Corporate Strategy. Thank you, Donny, and welcome to everyone joining our call. And I want to thank our associates for their unwavering commitment to supporting our customers, communities and each other. As a testament to their efforts, our first quarter results exceeded our expectations, reflecting strong underlying performance across the business, which we believe was enhanced by the most recent round of government stimulus payments. The quarter was highlighted by net sales growth of 16% in our combined non-consumable categories, a 208 basis point increase in gross margin right and double-digit growth in diluted EPS. Despite what continues to be a challenging operating environment, we are increasing our sales and diluted EPS guidance for fiscal 2021, to reflect our strong first quarter performance. And good morning, everyone. Now that Todd has taken you through a few highlights of the quarter, let me take you through some of its important financial details. Unless we specifically note otherwise, all comparisons are year-over-year. As Todd already discussed sales, I will start with gross profit, which we believe was positively impacted in the quarter by a significant benefit to sales, particularly in our non-consumers categories from the most recent round of government stimulus payments. As Todd noted, this was an increase of 208 basis points and represents our eighth consecutive quarter of year-over-year gross margin rate expansion. This increase was primarily attributable to higher initial markups on inventory purchases, a reduction in markdowns as a percentage of sales, a greater proportion of sales coming from our non-consumers categories, and a reduction in shrink as a percentage of sales. These factors were partially offset by increased transportation costs, which were primarily driven by higher rates. SG&A as a percentage of sales was 22%, an increase of 152 basis points. The most significant of which were store occupancy costs, disaster expenses related to winter storm Uri, retail labor and depreciation amortization. Starting with our non-consumables initiative, or NCI. As a reminder, NCI consists of a new and expanded product offering in key non-consumable categories. And we remain on track to expand this offering to a total of more than 11,000 stores by year-end, including over 2100 stores and our light version, which incorporates a vast majority of the NCI assortment, but through a more streamlined approach. Notably, this performance is contributing to an incremental comp sales increase in non-consumable sales of 8% in our NCI stores. Given our strong performance to-date, coupled with the added flexibility of a more streamlined approach. Moving to our newest concept pOpshelf, which further builds on our success and learnings with NCI. pOpshelf aims to engage customers by offering a fun, affordable and differentiated treasure hunt experience, delivered through continually refreshed merchandise, a differentiated in-store experience and exceptional value with the vast majority of our items priced at $5 or less. During the quarter, we opened three new pOpshelf locations, bringing the total number of stores to eight. And while still early, we continue to be very pleased with the initial results, which have far exceeded our expectations for both sales and gross margin. In fact, year one annualized sales volumes for our first eight locations are trending between $1.7 million and $2 million per store, with an average gross margin rate of about 40% which we expect will climb as we continue to scale this exciting initiative. As a reminder, this compares to year one sales volumes of about $1.4 million for traditional Dollar General Store and a gross margin rate of about 32% for the overall chain in 2020. For 2021, we remain on track to have a total of up to 50 pOpshelf locations by year-end, as well as up to an additional 25 store within a store concepts, which incorporates a smaller footprint pOpshelf shop into one of our larger format Dollar General Market stores. Importantly, we currently estimate there are about 3000 pOpshelf store opportunities potentially available in the Continental United States. And when combined with pOpshelf compelling unit economics, we remain very excited about the significant and incremental growth opportunities we see available for this unique and differentiated concept. Turning now to DG Fresh, which is a strategic multi-phase shift to self-distribution of frozen and refrigerated products. In fact, DG Fresh continues to be the largest contributor to the gross margin benefit, we are realizing from higher initial markups on inventory purchases. And we were pleased with the success we are seeing on this front, driven by higher overall in-stock levels and the continued rollout of additional products, including both national and private brands. In total, at the end of Q1, we were delivering to more than 17,000 stores from 10 facilities. And now expect to complete our initial rollout across the chain by the end of Q2, which is ahead of our previous expectation of year-end as communicated on our Q4 call. Moving to our cooler expansion program, which continues to be our most impactful merchandising initiatives. During the quarter, we added nearly 18,000 cooler doors across our store base. And are on track to install approximately 65,000 cooler doors this year. Notably, the majority of these doors will be in high capacity coolers, creating additional opportunities to drive higher on-shelf availability. In addition to the gross margin benefits associated with NCI and DG Fresh, we continue to pursue other gross margin enhancing opportunities, including improvements in private brand sales, global sourcing, supply chain efficiencies, and shrink. Our proven high return, low-risk real estate model continues to be a core strength of our business. In the first quarter, we completed a total of 836 real estate projects, including 260 new stores, 543 remodels and 33 relocations. In addition, we now have produce in more than 1300 stores. For 2021, we remain on track to open 1050 new stores, remodel 1750 stores and relocate 100 stores, representing 2900 real estate projects in total. We also now plan to add produce in more than 1000 stores, which compares to our previous expectation of approximately 700 stores. As a reminder, we recently made key changes to our development strategy, including establishing two of our larger footprint format, which each comprise about 8500 square feet of selling space as our base prototypes for nearly all new stores going forward. These larger formats allow for expanded high capacity, cooler counts, and extended queue line and a broader product assortment, including NCI, a larger health and beauty section with about 30% more feet of selling space and produce in select stores. We're especially pleased with the sales productivity of these larger formats, as average sales per square foot are currently trending about 15% above an average traditional store which bodes well for the future as we look to grow these unit counts in the years ahead. In total, we expect more than 550 of our real estate projects this year will be in these formats. Next, our digital initiative, which is an important complement to our brick and mortar footprint, as we continue to deploy and leverage technology to further enhance convenience, and access for customers. One such example is contactless payment, which is now available in the vast majority of the chain, further extending our convenience proposition, particularly for those seeking a more contactless shopping experience. Overall, our strategy consists of building a digital ecosystem specifically tailored to provide our customers with an even more convenient, frictionless and personalized shopping experience. Going forward, our plans include providing more relevant, meaningful and personalized offerings, with the goal of driving even higher levels of digital engagement, and customer loyalty. Over the years, we have established a clear and defined process to control spending, which governs our disciplined approach to spending decisions. This zero-based budgeting approach internally branded as Save to Serve, keeps the customer at the center of all we do while reinforcing our cost control mindset. Our Fast Track initiative is a great example of this approach, where our goals include increasing labor productivity in our stores, enhancing customer convenience and further improving on-shelf availability. We continue to be pleased with the labor productivity improvements we are seeing as a result of our efforts around both rolltainer and case pack optimization, which have led to the more efficient stocking of our stores. The second component of Fast Track is self-checkout, which provides customers with another flexible and convenient checkout solution, while also driving greater efficiencies for our store associates. Self-checkout was available in more than 3400 stores at the end of Q1, which represents more than double the store count at the end of Q4. And we are pleased with our results, including customer adoption rates, as well as positive feedback both from customers and employees. And we are focused on introducing this offering into the vast majority of our stores by the end of 2022 as we look to further enhance our convenience proposition, while extending our position as an innovative leader in small box discount retail. Our underlying principles are to keep the business simple, but move quickly to capture growth opportunities while controlling expenses. Our fourth operating priority is investing in our diverse teams through development, empowerment and inclusion. As a growing retailer, we continue to create new jobs in the communities we serve. And for those associates already on our team, this growth is resulting in numerous opportunities for career advancement. In fact more than 12,000 of our current store managers are internal promotes, and we continue to pursue innovative opportunities to further develop our teams. Importantly, we believe these efforts continue to yield positive results across our organization. At the store level, we continue to be pleased with our robust internal promotion pipeline and store manager turnover which continues to trend below historic levels. Overall, we continue to make great progress against our operating priorities and strategic initiatives. In closing, I am proud of our team's performance. I want to offer my sincere thanks to each of our approximately 157,000 employees across the company for their hard work and dedication to fulfilling our mission of serving others. With that operator, we would now like to open the lines for questions. At this time, we'll be conducting a question-and-answer session. Please proceed with your question. Hey, good morning, everyone. It’s Todd, thanks for the question. Yeah, we're very happy with what we're seeing now a year out of the pandemic, or again, lapping the pandemic maybe the better term. When you when you look at it, what we've seen is those customers that we were able to bring in during the COVID crisis or the heat of it. As you may recall, we launched a very aggressive -- back in that August-September timeframe, an aggressive campaign to not only retain, but keep her engaged at Dollar General. But as we've indicated in the past, when we see that our core consumer has more money to spend, and stimulus has given her some of that tailwind, if you will. And, we're staying squarely focused on what we can control here. And the two-year stack, I think if the math right, if I heard the numbers, right. I think it's running now 14 in May, if that's right. Yeah, in terms of -- you're right, in terms of the stack in terms of the case. If you look at the cadence of the quarter, it picked up nicely with the onset of the stimulus, where we're very well positioned to get more than our fair share. That you did see sequentially on a two-year stack basis, it moderating somewhat, but remained very strong. And very strong across the board when you look at two year stacks, both on the non-consumables, as well as the consumables. But particularly when you look at the non-consumable, just a fantastic two-year stack, as we shared. And I think that really speaks to the strength of what we've done with the initiatives on both the consumer side of the business to provide that forward fill-in trip grocery shop, as well as on the non-consumable side to get a fair share of these folks coming in as we take share from specialty retailers. The laps get actually easier in the back half of the year, from a comp standpoint. Please proceed with your question. So Todd, maybe just take a step back. But I would tell you that, we're very happy with what we see on that customer acquisition side. Let me try to go to one part of your question that is financial crisis coming out of that compared to what we are seeing now, on the backside of COVID. So our core shopper continues to be, have a lot more money than she normally would. And she's spending a great deal of that with us, which is great to see. And I think the other side of the equation is that that trade-in shopper is financially doing pretty well, as the economy opens back up. As we can see, it's opening up in a very robust manner. And the great thing is she continues to come back to Dollar General, that higher income shopper and shop with us. And that's exactly what we saw in ’08, but in ‘08, she didn't have a lot of money. This time she is -- she does have money, but still continues to shop. So I think that just speaks to the relevancy that we've built in this box, since that ’08 crisis. So, we feel good about those trends and our core shopper trends. As it relates to market share, we're seeing gains across the board. Drug continues to be our number one donor share, grocery is donating as well. As I think consumers start to go back to some normal shopping patterns, as relates to food at home. And then, even in our own space, we're taking share, which is great to see. So, it's really across the board. This isn't, just because it COVID, this underlying business, as I've said before, is as strong as I've ever seen it. If we think about DG Fresh NCI, private label. But what inning would you characterize, overall, these initiatives as we think going forward,\n You heard Jeff's prepared remarks. So I would tell you, we're probably halfway through the game as we go through this year and then in the next, which feels really good. In our cooler initiative, and DG Fresh just in general, I would tell you that we're in the -- we're still in the fourth inning, maybe closer to the bottom of the fourth inning but still in the fourth inning. And the great thing is, is that we've got a lot of runway yet to go there. POpshelf, I mean, we're just coming up to bat. And we're very, very encouraged there. And I would tell you, as you know, Dollar General pretty well. As we start to see more evidence that this is a very good initiative, we can go very quickly. But I would tell you, we're in the infancy stages, very early innings on our initiatives there in and around digital. So a tremendous amount of opportunity, both top-line and bottom line because these initiatives are aimed at both. Please proceed with your question. But obviously, as we mentioned, the pretty strong two-year stack in the 14. And we saw continued strength in our non-consumables, but also the consumables when you look at a two-year stack. So just the bigger picture, when I look at your mix in discretionary, you're up almost 200 basis points. Well, 200 basis points since 2018, in terms of mix shift and discretionary. And I guess, when you look at your overall gross margins, it seems -- and you talked to the fact that there were a significant opportunity on the gross margin front. I mean, I realized ‘21 has some very tough comparison than 2022. Karen, I think as you look at the non-consumables business, obviously there are some tailwind that you got from -- during the pandemic and from the stimulus. And as you continue to see the share, we're taking how are outperforming others. Your lapping sales growth in the non-consumables category of 40.8% last year, that's a tough lap, puts pressure on that. But I would tell you, we feel great about the non-consumables business as we look forward. And as we continue to scale that, almost doubling that this year. Yeah, obviously, we're not giving ‘22 guidance just yet. As you look at the performance in gross margin, we've delivered eight consecutive quarters of gross margin growth of 208 basis points this quarter, lapping49 basis points this quarter last year. And when you look at the drivers of that, again, there were some tailwind from non-consumables from the stimulus. But when you look at the drivers, it's the strategic initiatives driving that. The top three, we've been talking about these top three for several quarters now is higher initial markups, that DG Fresh drive in that. And that is the gift that keeps on giving, as we scale that complete that across the chain and then drive efficiencies in that. The next two we talked about were lower markdowns, and the mixed benefit. Now, as you look at the near term, as I mentioned, we hit a very difficult lap around non-consumables with pressure that year-over-year mix. And then as others have talked about it, we do see pressures this year associated with transportation costs. But we do believe that's more of a near term pressure, not something structural that will last forever. And so as we push through those two pressure points, we feel good about what we've been doing in terms of driving gross margin, operating margin expansion. And our ability to keep doing so, not only with these strategic initiatives I mentioned. Not just shrink, but private brand penetration for in-sourcing penetration, supply chain efficiencies, we continue to drive to mitigate the pressures that others are seeing, and so it's not as impactful to us. But I can tell you, we feel like we're in a great pricing position right now and don't see the need to. So we feel good about our ability to drive it higher over time, both gross margin and operating margin overall. Please proceed with your question. This is Jeff, thanks for the question. Certainly on the product cost, the first part of that question. And, this is where the model of Dollar General really performs well, in the sense that our scale and our limited skew assortment allows us the opportunity to really find innovative ways to protect that underserved customer. And certainly, find ways that we can mitigate the cost pressures. But certainly, as many retailers have talked about, we have seen that. But again, real pleased with our pricing position. As you know, here at Dollar General price and value are so important to her. I mean, obviously, a lot of companies that talked about challenges. Ed, we have seen some pressure, as many retailers have said. But you know what, I'm so proud of what our team has done to respond. And certainly, in April we announced our national hiring event, with a goal to hire up to 20,000 additional employees. And that is, Dollar General is such an amazing place to start a career. And so again, we feel really good about the opportunity we can provide with over 12,000 store managers internally promoted. And certainly, as we have always talked here at Dollar General, we're surgical in the way that we respond to different challenges. So the comments you mentioned, we're not seeing it widespread their pockets. And still very pleased that our turnover rates that point to this opportunity here Dollar General to attract folks, provide a great growth opportunity. Please proceed with your question. Or how much is your expectation is some of that is due to consumers got $1,400 check at least. Yeah, we feel good about our consumable and non-consumable businesses, where they're at. And as I mentioned earlier, we continue to take share from all different classes of trade out there. And if I missed that question, or if you'd like to ask it again, I'm happy to answer it. Yeah, I would tell you, it's definitely not the ladder that we've seen. It's probably more, the little slowdown that we have seen there was one such robust last year, and even into the fourth quarter. I'm sure like yourself, a lot of people have wanted to get out and get out of the house. What we're already seeing, though in early Q2, is that some of that food at home is being -- it looks like it's pretty sticky. I can tell you that especially in those areas, like DG Fresh are perishable areas. We're seeing very, very nice sales, robust sales in there. And I would tell you, just like anything, when things last more than a quarter or two or half a year. And we're already seeing that, as I mentioned, start to materialize here in Q2. On the gross margin of 200 basis points, John, you did provide the order of magnitude. Yeah, Michael, as you look -- as you pointed out, those are in the order of importance and the number one called out. As you get to the next to the lower markdowns, certainly a big piece of that was the higher sell through on the non-consumable. But if you recall, we were calling out lower markdowns even before that as we got tighter and tighter around promotional activity. While I would say compared to last year is tough a little bit because last year, there was virtually no promotional activity. If you compare to 2019, it's down. And then on the mix benefit, again, certainly got some extra juice from the stimulus. But again, 12 consecutive quarters of non-consumable comp growth. And when we're virtually doubling that initiative and putting the best of the best across the chain, we think that continues to help us. And then again, I would like to think that the higher carry rates is more -- is not something structural, it's more of a supply and demand imbalance that should sort itself out later. One of the things I'll mention that is a wildcard that's not in our guidance, and that is what impact the Child Tax Credits slab. We've not assumed any more Child Tax Credits, just given the number of potential macro puts and takes including the Child Tax Credits. But as you look at the gross margin, I would tell you, a big chunk of this is structural as evidenced by the strong fundamentals driving it and the track record we've delivered. But as we mentioned, there's just some near term pressures over the next few quarters. So you're not seeing conventional grocery stores promote more, because their sales are undeclined as their consumers got even more. And I would tell you, John, hit it right on the head. And that is, we're seeing a little bit more promotional activity that we did last year. And so I would tell you that that tame promotional environment that we've been talking about even prior to the pandemic, and through the pandemic, still persist, we have not seen that whatsoever. Please proceed with your question. I think the way you think about traffic, we've been talking about this, there's been quite a bit of trip consolidation. Now what I would tell you, as we looked across recent periods, we've seen the traffic start to pick up. And so what we would expect, as the mobility picks up, the traffic will pick up the basket will come down somewhat. It's pretty impressive when you look at the two-year stacks, on the growing basket on top of basket growth last year. Again, as we provide positioned ourselves for that forward fill-in trip. It is on pOpshelf, you guys seen very strong results so far. Yeah, I would tell you that, we're very happy with what we're seeing. You don't normally see the amount of tread traction and sustained traction, that we are seeing and repeat customers that we're seeing. We're getting promoter scores in the upper-80% and 90% range, which is unheard of. And so that's what gives us great optimist, if you will -- optimistic that we will continue to be able to grow this piece, stay tuned. And as I mentioned earlier, because what we're seeing, not only on the sales line. And I would tell you, the upsides of that is great, very great, quite frankly. So we think that, between those two, and you know as well, we'll move fast in store openings, once we get another few weeks behind our belt here. Ladies and gentlemen, our final question this morning comes from line of Scott Mushkin with R5 Capital. Please proceed with your question \n Hey, guys, thanks for taking my questions. And seeing that pOpshelf is just an insane format, one of the best I've seen in about 20 years. But my actual question -- my actual question is on DGX, you guys didn't mention it. Maybe not as much sizzle as the pOpshelf, but seems like it almost could supplant the normal convenience stores about 10,000 7-Eleven. And certainly, as we talked before, during the pandemic, as you remember, DGX is situated to locate where you work and play. And certainly during the pandemic, we saw some pullback obviously, with so much remote work at home. We've talked earlier about how we're seeing the economy kind of open up, and folks get out more. And so you're right, we're very excited. You’ll recall last conference call, we talked about the opportunity for 1000 possible DGX locations across the country. And then you know as well, if we find a concept that can work even better and increase that over time, we'll certainly try to do that. But right now, the offering inside the DGX, we also have very high customer satisfaction scores like the pOpshelf brand as well. And we're also pleased that the opportunity, so stay tuned. So you got pOpshelf, where we've talked about incremental 3000 opportunities, DGX, an incremental 1000 opportunities. And then our traditional fleet where we believe there's 13,000 additional opportunities. So 17,000 opportunities in total, gives us great confidence that we can continue to grow this great brand across the country. On the pricing side, kind of taking that and turning it on its ear a little bit. I mean, if you look at what's going on in your business, you obviously talked about gross margin expansion possibilities, as well as labor efficiency possibilities and of course, the limited skews you guys offer. And, pricing is, is one of my pet projects here at Dollar General. I'm intimately involved in it, because it's so important to our consumer. We took 2020, and we quietly got in the best position we've ever been in. And to your point, we've made inroads, even against all classes of trade, including mass. Hey, we always reserve the right to continue to make sure our customer has the ability to shop what she needs. But right now, we feel good. And as Jeff indicated, even in this environment where we're seeing some price pressure from CPG, like other retailers are. Thank you, ladies and gentlemen, this concludes our question-and-answer session and does concludes our call today."
}