{
    "symbol": "DG",
    "quarter": 3,
    "year": 2021,
    "date": "2021-12-02 13:56:05",
    "content": " In addition, given the sustained performance of our pOpshelf concept, which continues to exceed our expectations, we plan to further accelerate the pace of new store openings as we move ahead, targeting a total of about 1,000 pOpshelf locations by fiscal year-end 2025. Net sales growth of approximately 1% to 1.5%; a same-store sales decline of approximately 3% to 2.5%, but which reflects growth of approximately 13% to 14% on a 2-year stack basis, and EPS in the range of $9.90 to $10.20, which reflects a compound annual growth rate in the range of 22% to 24%, or approximately 21% to 23% compared to 2019 adjusted EPS over a 2-year period. Overall, we now plan to expand this offering to a total of more than 11,500 stores by year-end, including over 2,000 stores in our light version, and we expect to complete the rollout of NCI across nearly the entire chain by year end 2022. pOpshelf aims to engage customers by offering a fun, affordable and differentiated treasure hunt experience, delivered through continually refreshed merchandise, a unique in-store experience and exceptional value with the vast majority of our items priced at $5 or less. For 2021, we remain on track to have a total of up to 50 pOpshelf locations by year-end, as well as up to an additional 25 store within a store concept which incorporates a smaller footprint pOpshelf shop into one of our larger format Dollar General Market stores. In fact, we anticipate year one annualized sales volumes for our current locations to be between $1.7 million and $2 million per store and expect the initial average gross margin rate for these stores to exceed 40%. Our 2022 real estate plans also include opening approximately 100 additional pOpshelf locations, bringing the total number of pOpshelf stores to about 150 by year-end, as well as up to an additional 25 store within the store concepts. Please proceed with your question. Please proceed with your question. Please proceed with your question. Yes, this is Todd. Please proceed with your question. Please proceed with your question. Yes, this is Todd. Please proceed with your question. Please proceed with your question. Yes, this is Todd. Please proceed with your question."
}