{
    "symbol": "PHR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-30 20:39:05",
    "content": " And I think in a period where we've done a lot of investment, I think there's higher client growth than we have seen in prior periods. So you could expect us as we have -- as the investments start to point in the direction of where we're -- what the market looks like, you could expect us to come back to market and articulate sort of that -- what we think the opportunity is and what our go-to-market will be in that. And I think as we articulated in the quarterly letter, we feel like we've achieved -- G&A is a good example of that, where we've achieved the level of staffing and systems and investment that we've made to support a company that reaches this $500 million run rate business. So from the perspective of more growth, I think it would be -- it's minimal from this perspective because much of the investment is there. I think there's also fluctuations sometimes in visit volumes that can impact that quarter-over-quarter as that business grows -- as you're aware, Visa and Mastercard have also announced the price increase. I don't -- I think what's important is not putting out press releases, it's doing good work for our clients, John. Right, you're not the only parent who are marketing, it drives us crazy but it's -- we've definitely increased our conversations about a lot of what we're doing with our clients on a lot of the social media outlets, which I personally am not really on. And then if you look at sort of the fiscal '25 guidance you've now provided, right, I mean we're looking at 27% to 29% revenue growth next year, but then you got to step up at least to the mid-30s in '24 and '25 to get to $500 million by the end of the year. And I don't think it's like -- I will say that it's not like offering until June or it's -- there's continuously rolling different types of things that they look at for different segments of the market, and they try to use as much as you can, data, to decide what's working in the not. So Ryan, I think one of the things that I -- and we have talked about this over the years, and I think what are the benefits that has sustained our growth for all these years is that our acknowledgment that it's not a one size fits all. And that's also why our -- we thought about it as we were writing our stakeholder letter, why was it important for us to disclose some of our retention metrics because we think it's important for all of our stakeholders to understand that the investments we're making are really for that long-term value and for our clients and their patients. Like that allows -- gives us and our clients much better visibility and understanding about what consumers are saying and why things -- what matters to them, why they matter, and that's been a really powerful tool in our arsenal to be able to demonstrate significant value to our clients."
}