{
    "symbol": "INN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 13:25:33",
    "content": " While leisure demand remained robust during the fourth quarter, as weekend ADR surpassed 2019 levels by 16%, week day RevPAR improved sequentially throughout the year and finished the fourth quarter at an 88% recapture to 2019 levels, with ADR surpassing the comparable period of 2019 midweek. Our asset revenue management teams continue to drive impressive operating results, as RevPAR index for our pro forma portfolio finished both the fourth quarter and full-year at 112%, primarily driven by strong occupancy premiums and further demonstrating our ability to capture market share, while maintaining pricing power throughout the portfolio. In 2022, the propertyâ\u0080\u0099s first full-year of operations on Fredericksburg generated RevPAR of approximately $440, hotel EBIT margin - EBITDA margins of more than 60%, and a net operating income yield of approximately 17% on our initial cost basis. The six hotels under contract for sale generated a combined RevPAR of $78 in 2022, a 30% discount to our overall portfolio, and EBITDA margins that were nearly 18 percentage points below our total portfolio. This compares favorably to our recent and pending dispositions, including the 2022 sale of the Hilton Garden in San Francisco, which collectively totaled nearly $155 million of gross proceeds equating to a 2022 net operating income yield of approximately 3% or sub 2% net of the estimated deferral of nearly $45 million of near-term capital expenditures. The fourth quarter was highlighted by October, a month which typically produces the portfolioâ\u0080\u0099s highest nominal RevPAR as our urban hotels generated $135 RevPAR representing a 5% premium to the pro forma portfolio, and a 93% recovery to 2019 levels. Nominal RevPAR for these hotels grew 20% in the fourth quarter in comparison to last year, driven by a $19 or 15% increase in average rate. This was driven by continued strength in our resort properties, which generated a fourth quarter RevPAR of $132 an increase of 11% compared to 2021 and 104% recapture rate to 2019. Additionally, the suburban portfolio experienced the largest year-over-year growth of any location type, as fourth quarter RevPAR increased 18% compared to 2021, driven by a 4% increase in occupancy and a 13% increase in average rate. As a result, fourth quarter gross operating profit margin and hotel EBITDA margin for the pro forma portfolio were 44% and 36% respectively, which were in-line with the prior quarter despite a decline in absolute RevPAR of approximately 4.2% from the third quarter, due to natural seasonality. Pro forma hotel EBITDA for the fourth quarter and full-year 2022 was $62.1 million and $243.9 million respectively, representing increases of 27% and 63% year-over-year. Fourth quarter and full-year adjusted EBITDA was $46.1 million and $180.8 million respectively, which reflects increases of 62% and 100% from 2021."
}