{
    "symbol": "CWBR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 11:15:02",
    "content": " At this time, I would like to welcome everyone to CohBar's Third Quarter 2022 Financial Results Conference Call. I would now like to turn the conference over to Jordyn Tarazi, Director of Investor Relations at CohBar. Thank you, operator, and thank you, everyone, for joining CohBar third quarter 2022 financial results conference call. Joining me on today's call is Dr. Joe Sarret, CohBar's Chief Executive Officer; Jeff Biunno, CohBar's Chief Financial Officer; and Dr. Ken Grindstaff, Senior Vice President of Research. Following our collective remarks, we will conclude with Q&A, at which time, Dr. Nick Vlahakis, CohBar's acting Chief Medical Officer, will also join us. Before we begin, I'd like to take a moment to remind listeners that except for statements of historical facts, the remarks on today's conference call may include forward-looking statements within the meaning of the securities laws. Forward-looking statements are based on current expectations, projections and interpretations that involve a number of risks and uncertainties that could cause actual results to differ materially from those anticipated by CohBar. These risks and uncertainties are described in our registration statements, reports and other filings with the Securities and Exchange Commission and applicable Canadian securities regulators, which are available on our website at cobar.com, sec.gov and sedar.com, as well as in the safe harbor statement included with today's press release. CohBar does not undertake any obligation to update publicly or revise any forward-looking statements or information, whether as a result of new information, future events or otherwise. Now I'd like to turn the call over to Joe Sarret, CohBar's Chief Executive Officer. On today's call, after my introductory remarks, Ken will comment on our ongoing preclinical activities for our CB5138-3 program, and Jeff will then review our Q3 financial performance. For example, a recent paper coauthored by Dr.  (ph), one of CohBar's Founders described a novel mitochondrial peptide  that may play a role in Alzheimer's disease. While research on this new peptide is still in the early stages, advances such as these contribute to the growing body of research that further supports our underlying hypothesis that the mitochondrial genome is a fruitful source for the development of impactful novel therapeutics. CohBar has generated promising data from multiple in vitro and preclinical animal models from several different monoclonal peptide families in diverse areas, including metabolism, fibrosis and inflammation. While we have faced many challenges across several areas of our business, I remain pleased with our team's performance and the progress made on our key priorities. This product candidate is being developed to treat idiopathic pulmonary fibrosis, or IPF, a devastating progressive lung condition that despite the availability of two FDA-approved therapies continues to have significant unmet need with substantial and unacceptably high morbidity and mortality. During the past quarter, we've been particularly focused on two key areas for this program, improving the CB5138-3 formulation and furthering our understanding of the peptides target engagement. This phenomenon is not infrequently seen in the early stages of development of peptide therapeutics, and the team has been working to mitigate this issue by improving the formulation. During our last quarterly update, we mentioned that we had identified several promising formulations based on in vitro data and plan to test those in vivo. While disappointing, as we have discussed previously, it was always expected that these reformulation activities would be an iterative process. And assuming that these formulations meet our in vivo performance targets, we remain on track to file our IND in the second half of 2023. And in terms of progress on the business front, on September 23, we completed a 1-for-30 reverse stock split and subsequently received confirmation from NASDAQ that CohBar has regained compliance with their $1 minimum bid price requirement. As Joe mentioned, this quarter we continued to make progress on our preclinical development for CB5138-3 focusing on formulation work and elucidating its molecular target. As we have previously discussed, our initial formulation work focused on enhancing our understanding of the key physical properties of the peptide. Based on in vitro analysis, we identified several interim formulations that support solubility of CB5138-3 have projected clinically relevant doses, provided favorable extended stability profiles and exhibited reduced aggregation compared to the formulation we used in our prior toxicology studies. As Joe mentioned, formulation development is an iterative process, often requiring multiple rounds of in vitro and in vivo work to identify compositions that are both compatible with the physical properties of the drug substance and the route of administration. To this end, we've recently completed the in vitro phase of new formulation work for CB5138-3. In an effort to identify direct target engagement, we're in the process of completing a broad cell surface receptor screen with CB5138-3 and expect to have preliminary data in the near future. Now, I'll turn the call over to Jeff to discuss our Q3 financial performance. We ended Q3 2022 with $18.3 million in cash and investments at a quarterly burn rate of approximately $1.9 million, and we have no debt. Research and development expenses were $1 million in Q3 2022 compared to $1.6 million in the prior year period, a decrease of approximately $600,000. General and administrative expenses were $1.4 million in Q3 2022, compared to $1.8 million in the prior year period, the decrease that was primarily due to lower stock-based compensation costs. For the quarter ended September 30, 2022, CohBar reported a net loss of $2.4 million or $0.82 per basic and diluted share on a post-split basis compared to a net loss for the quarter ended September 30, 2021, of $3.4 million or $1.61 per basic and diluted share on a post-split basis. Net loss included noncash expenses of approximately $400,000 for the quarter ended September 30, 2022, and approximately $700,000 for the quarter ended September 30, 2021. I'm pleased with the way our team has remained focused on continuing to advance our programs and our science, and we continue to believe in the power of the mitochondrial genome to deliver therapeutics to address underserved conditions that represent significant market opportunities, such as IPF and NASH. Throughout this year, we have made progress on advancing CB5138-3 towards IND filing as well as refining our clinical development program for this product candidate. At the same time, as Jeff highlighted, we continue to be prudent financially, closely monitoring our cash spend, while prioritizing activities that are expected to derisk key aspects of our IPF program, such as enhancing our understanding of target engagement and developing improved formulations to mitigate against injection site reactions and improve drug exposure. After many months of effort, we now expect data on both of those fronts in the near future and we look forward to updating you on the outcome of those studies in subsequent calls. Yes, it's difficult to say the exact timing of data because certain things are dependent upon our contract research partners. And so, whether that further required there would have an impact on the time lines really will depend on what does the data show and how close or far are we from where we feel like we need to be. And sort of what the data shows, what sort of lead us to the subsequent answer on next steps and possible impact on timing."
}