{
    "symbol": "CWBR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 21:20:18",
    "content": " At this time, I would like to welcome everyone to CohBar's First Quarter 2022 Financial Results Conference Call. And now I would like to turn the call over to Jeff Biunno, Chief Financial Officer at CohBar. Thank you, John, and thank you, everyone, for joining CohBar's First Quarter 2022 Financial Results Conference Call. Joining on today's call is Dr. Joe Sarret, CohBar's Chief Executive Officer; Dr. Nick Vlahakis, CohBar's Acting Chief Medical Officer; and Dr. Kent Grindstaff, Senior Vice President of Research. Before we begin, I'd like to take a moment to remind listeners that except for statements of historical fact, remarks on today's conference call may include forward-looking statements within the meaning of the securities laws. Forward-looking statements are based on current expectations, projections and interpretations that involve a number of risks and uncertainties that could cause actual results to differ materially from those anticipated by CohBar. These risks and uncertainties are described in our registration statements, reports and other filings with the Securities and Exchange Commission and applicable Canadian securities regulators, which are available on our website at cohbar.com, sec.gov and sedar.com, as well as in the safe harbor statement included with today's press release. CohBar does not undertake any obligation to update publicly or revise any forward-looking statements or information, whether as a result of new information, future events or otherwise. Now I'd like to turn the call over to Joe Sarret, CohBar's Chief Executive Officer. In the first quarter of 2022, we made steady progress that we believe positions CohBar for an exciting several years ahead. We aligned our pipeline strategy to prioritize the advancement of CB5138-3, our IPF program, towards the clinic. Notably, our IND-enabling studies for this program remain on track, and our reformulation efforts are well underway. We continue to explore potential partnerships for our CB4211 program, and we hired significant talent to our team, which we believe will enhance our ability to achieve long-term success. On today's call, after my introductory remarks, we will share commentary from Kent and Nick, the most recent addition to our leadership team, who bring unique perspectives and extensive expertise in their functional areas. Kent will provide an overview of our science and our Mito+ platform, and Nick will provide a recap of our IPF program. As we think about where we are headed, I would like to put the intriguing opportunity we have to mine the mitochondrial genome into perspective. While researchers have been looking at the nuclear genome as a source of novel therapeutics for quite some time, the mitochondria has been largely overlooked. But it turns out the function of mitochondria is much broader than that, and they play important roles in regulating a variety of different biological pathways as well as impacting a wide range of diseases. Second, I think there is an inherent assumption that the peptides encoded in the mitochondrial genome would be acting locally within the mitochondria, and some of them certainly do that. But it turns out that many of these peptides are secreted and circulate systemically, mediating important effects on organs and tissues quite distant from where they are produced. And so as these 2 insights about the breadth of the impact of mitochondria on the body and the fact that peptides encoded in the mitochondrial genome are acting systemically that really led to the formation of CohBar, and that's the rationale underpinning our approach to drug discovery using our Mito+ platform that Kent will talk about in a few minutes. Additionally, by targeting analogs or modifications of natural peptides, we expect to have fewer off-target effects, which may translate into better safety and tolerability profiles for our product candidates. And when you look at the individual compounds in our library, they are structurally quite distinct and operating through a variety of different mechanisms, which we believe de-risks our overall approach. Importantly, last year, we demonstrated clinical proof-of-principle for this mitochondrial biology from the first human study of a peptide derived from the mitochondrial genome. The positive top line data from our CB4211 program was an important validation, not just of that program, but of our overall platform and approach. The U.S. Patent and Trademark Office has informed us that tomorrow, it plans to issue the second U.S. patent for this program. At the same time, we have also progressed our international patent prosecution strategy with the issuance of a Japanese patent covering CB4211 and related compositions, as well as medicines comprised of CB4211 and related peptides for treating NASH. With that, it is my pleasure to now turn the call over to Kent Grindstaff, our Senior Vice President of Research, who will review our platform approach and progress. As Joe mentioned, we are uniquely positioned at CohBar to capitalize on a largely untapped area of scientific research. When we first tell the story of our science, there is sometimes a perception that we're targeting relatively rare mitochondrial dysfunction, which is not our area of focus. To date, there are over 40,000 publications on the role of mitochondria disease, of which nearly 400 cover mitochondrial-derived peptides, or MDPs, with known systemic effects, demonstrating the level of interest in this space and the potential for further discoveries. This peer-reviewed paper was published just last year and emphasizes the well-established cytoprotective anti-inflammatory and metabolic properties of these MDPs as well as the strong correlation between MDPs in a wide range of important biological processes such as atlassclerosis, hyperlipidemia, insulin resistance and aging, thus highlighting the potential value of MDPs is both novel biomarkers and therapeutic targets in disease development and progression. This paper provides a good example of how the evidence for the role of mitochondria in complex multifactor diseases continues to build, while simultaneously demonstrating that the area of mitochondrial-derived peptides and their systemic roles is still relatively untapped, emphasizing both the opportunity and the need for further investigation. At CohBar, we've developed a robust proprietary development engine called Mito+ that aligns with our strategy to pursue broad systemic conditions. So beyond IPF and fibrosis, we're continuing to interrogate the mitochondrial genome and our library of peptides to identify high-value expansion opportunities for the platform in therapeutic indications where mitochondria play significant roles in disease processes such as inflammation. Our screening processes are designed to detect peptides that interact with cell surface receptors and have activity in important systemic biological path ways, resulting in product candidates with the potential to impact multiple biological pathways that are driving complex multifactoral diseases. Our goal is to create first-in-class drugs that are truly disease-modifying, which is really exciting and why we look forward to working in a lab each day. As we've discussed previously, we believe the preclinical data demonstrating the antifibrotic effects of CB5138-3 in models of IPF is compelling. As a pulmonologist, I've taken care of many people with lung fibrosis, both in the clinic and intensive care unit and have witnessed up close the devastating reality of IPF, and the burden of disease that is carried by these patients and their families. As a result, I'm particularly excited about the potential of our CB5138-3 program to address the significant unmet need in this area. In our ongoing toxicology work, the systemic safety profile of CB5138-3 continues to look quite clear. As additional preclinical data becomes available for this program, it increases our understanding of the molecule and how we expect it to behave in humans, enabling us to make further refinements to our clinical development program. As I mentioned in our last call, we expect that our initial clinical study will be a Phase I single ascending dose and multiple ascending dose study in healthy volunteers performed at a Phase I clinical research unit. The clinical development path for development in IPF has been laid out, and refinements to the Phase II study design are ongoing. Kent and I are collaborating closely, and along with the rest of the CohBar team are working hard to further clarify the most relevant mechanism and IPF-specific biomarkers for use as exploratory endpoints in our initial IPF study. Our time lines for the program remain on track, and we continue to expect to file our IND in the second half of next year. Research and development expenses were $1.5 million in Q1 2022 compared to $2.7 million in the prior year period, a decrease of approximately $1.2 million. In terms of G&A, our general and administrative expenses were $1.7 million in Q1 2022 compared to $1.4 million in the prior year period, an increase that was primarily due to higher stock-based compensation costs and legal fees associated with our IPF portfolio. For the quarter ended March 31, 2022, CohBar recorded a net loss of $3.3 million or $0.04 per basic and diluted share compared to a net loss for the quarter ended March 31, 2021, of $4 million or $0.07 per basic and diluted share. Net loss included noncash expenses of approximately $500,000 for the quarter ended March 31, 2022, and $370,000 for the quarter ended March 31, 2021. As you may have seen, we issued a press release last week announcing that NASDAQ has granted us an extension until November 7 of this year to regain compliance with NASDAQ's $1 minimum bid requirement. I'd like to take a moment to highlight the fact that our Board has included a proposal to authorize a reverse stock split in this year's proxy statement, which is specifically designed to enable us to regain NASDAQ compliance. By continuing as a NASDAQ-listed company, we expect to have greater access to capital to further fund our pipeline, improve liquidity for our stockholders in a higher likelihood of attracting high-quality institutional investors and commercial partners. Before we take your questions, I'd like to provide a summary of our recent progress and review our upcoming time lines. During the first quarter of the year, we made steady progress across the key areas of our business, and the year ahead will be focused on execution. In parallel, we look forward to finalizing our formulation work as we move closer to clinical development in the second half of 2023. And as you heard from Kent today, we continue to mine our extensive library of peptides derived from the mitochondrial genome to identify those peptide families that show the most promise for further development. We are not focused on Mito opportunities in drug development, as we aim to create disease-modifying therapies that will make a real difference in tops. We believe CB4211 has that potential, and we are working to secure a partner to enable further clinical development of that program. We have a clear and focused strategy to develop therapies for difficult-to-treat multifactorial diseases like IPF, and we have the right team in place to advance our science and pipeline. I think as you've stated, Joe, for us and the peptides that we have, the plan is certainly for non-oral therapy. And certainly, from where we stand at this point in early development, sort of taking that approach is currently not something that we're looking at. But given the disease population, subcutaneous delivery certainly something that would be acceptable to the patient population and we think is actually a very effective way to deliver mitochondrial peptides. So as I mentioned in the remarks, this is the second U.S. patent that we had issued on this program. So just to remind everyone, the first patent was issued last fall. I think we spoke about this a little bit on the last call, but the process here in terms of the formulation work is an iterative one, meaning we do certain work in the lab, looking at different types of formulations. We do some in vitro tests to sort of see how well those new formulations look, and then we test them in vivo setting and depending on what the results of that are, that informs sort of the next cycle of work. I think the one thing I would add to that, Joe, is that being so early on in the formulation part of the development for 5138-3, I think the frequency of delivery, obviously, will become much more clear to us as we move forward, as we begin to understand the pharmacokinetics of the reformulated drug product and after we begin our initial human studies. So I think really, that's a bit of an open question. And so the majority -- overwhelming majority of our spend is really focused on the 5138-3, the IPF program. And having said that, we are putting some additional effort, particularly compared to what we've been doing in the more recent past, on some of the discovery work that Kent was discussing early on. But certainly, our focus for those efforts is really on identifying peptides with interesting activity and doing some additional characterization and early work in those efforts. So that's the range, and we'll hockey stick, and a lot of it's largely dependent on, again, timing and what we decide in the very fluid nature that we operate the business if we were to allocate more funds or less funds. Some of those IND costs obviously haven't been picked up since we're in the middle of them, but there still is some straggling cost that's associated with that. During this quarter and over the summer, we are planning to present at several investor and scientific conferences, and we look forward to keeping you updated on our progress as we move through the year."
}