{
    "symbol": "LZ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 21:52:10",
    "content": " These forward-looking statements can be identified by the use of words such as believe, expect, plan, anticipate, will, intend and similar expressions and are not and should not be relied upon as a guarantee of future performance or results. The forward-looking statements we make on this call are based on information available to us as of today’s date and we disclaim any obligation to update any forward-looking statements, except as required by law. It's been a quick turnaround since our last earnings call, so I'll keep my comments brief today. In the first quarter of 2022, we generated $154 million of revenue ahead of the top end of our guidance range and up 15% year-over-year, despite a challenging prior year comparison. Subscription growth continued to outperform in the period with revenues coming in at $84 million, up 29% year-over-year. As a reminder, there's a seasonal component to the recognition of our transaction revenue that weighs on margins in the first quarter of the year. Given the current state of affairs with geopolitical concerns, inflation and other macroeconomic factors causing significant uncertainty, it's important to consider the advantages our cost structure has in responding to external factors beyond our control. First, we've reduced margins in the near term to accelerate revenue growth over the long term. We are investing across all areas of the business, but most significantly within sales and marketing, which grew from 27% of revenue in 2019 to 45% of revenue in 2021. Excluding sales and marketing, we actually saw operating leverage over that two-year period with non-S&M expenses declining from 50% of revenue in 2019 to 47% in 2021. And despite the ramp in CAM spend, we continue to generate positive cash flow and have just under $250 million of cash and no debt on the balance sheet. We feel we are in a very strong financial position to weather a potential economic contraction, while still maintaining a healthy level of investment to drive durable long term top line growth. With taxes top of mind, it's not surprising customers were more open to the cross-sell. However, we were surprised to see a portion of these new customers had already completed their 2021 returns, and more instead looking for a tax planning and bookkeeping solution for the 2022 tax year. And since we're often the very first third-party entrepreneurs visit when starting their business, we have the unique opportunity to grow awareness and drive product adoption off cycle, a significant advantage to our competition, which primarily relies on new customer acquisition during peak tax season. To date, our efforts have focused on cross selling tax at the time of business formation. However, many of these new businesses are pre revenue and are therefore less likely to require tax filing services. Our focus now is providing these customers with the right service level at the right time in their journey, which is often months after they've formed. And finally, though it's a bit too early to interpret retention data, we continue to see that customers who engaged with our tax platform and experts are really happy with the service. In our Q4 earnings call in March, I introduced our plans to conduct a series of lineup tests within our core formation experience throughout 2022. We spent the better part of two years driving efficiencies in our fulfillment processes, improving our attorney platform and expanding our subscription ecosystem to make that this testing possible. Our thesis here is that by expanding our formations line of both up and down market, we widen the aperture of customer segments we serve, unlocking new opportunities to grow share and expand customer lifetime value. The initial test includes a mix of do-it-yourself and attorney assisted formation experiences, with prices ranging from free standalone LLC registration to $1,149 for customers seeking a high-touch experience with an attorney. At the high end, customers will have on demand access to our independent attorney network for the first three months post formation, as well as an attorney assisted trademark filing with an attorney staffed in our ABS law firm. Its one of a kind solution emulates the experience of working with a traditional law firm, but at a fraction of the price. We're carefully monitoring user behavior in combination with business metrics, such as conversion rates, AOV and subscription attach rates. Just a couple of weeks ago, you likely saw the announcement of a new multiyear partnership with Wix. Whether you start with LegalZoom and add a website or start by building website and then decide to formalize your business or protect your IP, we work side-by-side to provide an integrated experience. The relationship is also built on recurring revenue model, where both parties share and the economics through the life of the customer. And with each successive new sign partner, we expand our competitive advantage by forging new relationships that offer integrations with more business applications and exposure to more potential customers. We anticipate an initial launch of the integrated experience in the second half of this year, but do not expect material revenue from the partnership in 2022. It will take time to commercialize these partnerships to their full potential, but my conviction in the long term opportunity could not be stronger. In closing, I'm very encouraged by our results in the first quarter and the energy I've seen across our teams to start the year. Despite a dynamic and in some ways challenged economic backdrop, I remain optimistic about the future of small businesses, our industry and LegalZoom's position within it. Total GAAP revenue came in at $154 million, up 15% year-over-year and above the top end of our guidance range. We completed 129,000 business formations in Q1, down 2% compared to the same period last year in line with our expectation. As a reminder, we've made two small adjustments to our definition of a business formation. The first adjustment is the removal of non U.S. formations, all of which are attributable to our small presence in the UK. These transactions are most often completed by sole proprietors and are becoming a significant feeder into our portfolio of subscription services, particularly as we look to integrate LZ tax into the DBA flow. Excluding these small adjustments, we would have completed 119,000 business formations in the period also down 2% year-over-year. Transaction units were 267,000 units in the quarter, down 3% year-over-year. More importantly, AOV was up 8% year-over-year, driven by ongoing efficiencies in our order fulfillment processes and growth in our attorney led trademark solution, which carries a significantly higher AOV than the DIY solution. Subscription revenue continued to outperform expectations coming in at $84 million in the quarter, up 29% year-over-year, 55% of our Q1 revenue was subscription, up 600 basis points from the same period last year. We're very encouraged by the pace of this mix shift, which will drive a more predictable higher margin operating model. ARPU was $244 in the first quarter, up 8% year-over-year. We view this growth as durable and driven in large part by new higher ARPU services, like LZ tax and Earth Class Mail. We're confident, Q4 of last year was a trough in this part of the business due to the transition of the legacy relationship with misaligned strategic objectives. Gross margins came in at approximately 65% of revenue, down from 69% in Q1 of last year. We expect gross margin to normalize in the second quarter, it'd be roughly in line with Q2 of last year. Customer acquisition spend came in at $54 million in the period, flat to Q1 of last year. Within our non-CAM sales and marketing spend, we do expect a one time $5 million expense in the second quarter related to the rollout of new creative assets. Technology and development spend of $13 million and G&A spend of $15 million, were both up modestly on an absolute dollar basis from Q4, but remained roughly flat as a percentage of revenue. Adjusted EBITA was $1.3 million in the quarter, ahead of our breakeven guidance, and our base of deferred revenue increased by $17 million in the period, which follows typical seasonal patterns. In the first quarter, we began to execute on our $150 million share repurchase authorization. We repurchased a total of 79,000 shares of our common stock at an average per share price of $14 for a total repurchase amount of $1.1 million including commissions. As of March 31, 2022, we had cash and cash equivalents of $248 million and no debt outstanding. For the second quarter of 2022, we expect total revenue of $162 to $164 million, 8% year-over-year growth at the midpoint. Business formations peaked in Q2 of last year, so we are lapping the most challenging quarter per transaction growth. However, we do anticipate total revenue growth to reaccelerate in the back half of 2022. We expect adjusted EBITDA of $10 million to $12 million in the second quarter, or 7% of revenue at the midpoint. We remain optimistic about our ability to deliver strong financial results in 2022, particularly on the heels of a strong first quarter. Given the fluid economic environment and the number of variables outside of our direct control, we remain comfortable with our full year 2022 outlook provided in March. To summarize for the full year 2022, we are expecting revenue of $650 million to $660 million, or 14% growth at the midpoint. As Dan mentioned, our largely variable cost structure allows us to quickly flex our EBITDA margins up or down depending on the operating environment. And with that, let's open the call for questions. What you're seeing April, would be very helpful. I mean, it's worth going back and even just thinking about the journey here. And the main thrust of that was just knowing that it's a more complex transaction, some customers wouldn't be comfortable, not doing it on their own. We've also gone out and really started a law firm in Arizona, which is under an alternative business structure, which allows us to practice on one geography, so that we can start to understand the end-to-end experience of our customers working on our platform. And now, we're really just trying to expand that and think about how we can approach customers who have typically been afraid to do these types of transactions on their own. And that all the way into doing that for our formations, specifically, which is where the most -- the bulk of the volume is in our business. And so, we've introduced a lineup, we're only at this point in three small states, a part of the objective here is running water through the pipes and making sure that we're operationally very sound, and we're thinking about the experience and starting to tweak at a lower volume. The way we're measuring results, is we're looking at one year bookings, and trying to understand if that's a creative, and also the shift from lower transactional pricing, which is likely, because we're also introducing free along with more subscription bookings and understand the balance between the two as we start to offer a more comprehensive lineup to our customers. And then, as we see results we like, we'll continue to expand it through multiple states. And part of the thing that's happening in the background of all this is, we have a pretty significant investment in automating the fulfillment of orders. And actually, I've been pretty pleasantly surprised with the early testing, and operationally it was very sound, we're starting to get data in, and we'll probably be expanding it in the next quarter, given what we're seeing so far. I mean, we went into the year with a pretty clear understanding that we'd see the macro decline year-over-year. That was a little bit on the lower end of what we expected, but still within the range of what we've used to do our plan. We're also really consciously thinking about our marginal return in our CAM spend, and taking some of the insights that we've been getting from media mix modeling and shifting some of our spend around right now, so that we can go after better marginal return on the last dollar spent. But again, we just want to be somewhat cautious knowing that there's a lot going on in the broader economy. In terms of Dan's comments on the macro, I mean, that's really largely describes why we've sort of reiterated and maintained our guidance for the full year for both top and bottom line. Yes, I mean, I just, I mentioned, I mean, we were -- the macro is down 8%, we were down 2%, it's roughly 5% share gain, which I think isn't that far out of line. And in fact, you should see on a quarter-to-quarter basis, it's not going to be entirely linear. There are things that we are doing in terms of shifting our marketing spend, and part of this shift started at the end of the quarter, and is actually happening currently. And we're -- whenever you do this, a shift in media mix, oftentimes, there's different durations in payback of that media mix. And we're starting to dial down in some of the areas where you have a media payback, and what you're starting to see us as putting it into some different channels that have paybacks, that could be two, four, six weeks. The other thing I'd mentioned is, as we start to do more premium deployment, you probably will begin to see us look to accelerate share gain. If it's working, you will see us start to take more share, because we're going after the price sensitive customers. And again, we'll only do that if we feel like it's a net positive on a one year bookings basis. So, I think our focus and investment around building out that ecosystem further helps to sort of dislocate us from the macro. I mean, one of the things that is a reality of our business model is there's a coupling between the transactional growth and the subscription units. And so, when you think about the beginning of this year when we're lapping some of those comps from prior year, it certainly will impact some of the unit growth. What's also interesting too, as you think about this year, as you get to the back half of the year, there is a seasonal component to our business as well with LZ tax. And then, the thing that's a bit of an unknown or an opportunity to the good side though, is that we haven't really marketed LZ tax to the broader base. We now have virtual mail through Earth Class Mail acquisition, and we have the opportunity to market that as well, where it's not penetrated into the base. And then again, the piece on premium is really interesting, because with a free solution, we have the opportunity to after price sensitive customers. And just to remind everybody, those customers as they may form a business for free, it would probably be a paid solution as you talk about RA and Compliance. So there's a little bit of a reality in the front half of the year on transaction growth lapping, but we have a lot of levers that we're currently testing and looking to sort of offset that in the backup. And then just further on that, as you're alluding to Elizabeth in terms of you do have to look at subscription unit growth and ARPU growth in coordination, because we're more than willing to make a trade off, if the LTV is right for higher ARPU subscriptions. And as we mentioned on our prepared remarks, we expect durable ARPU gains kind of consistent with the year-over-year growth that we saw in Q1 moving forward in part driven by the focus on tax and the integration of ECM. The 8% ARPU growth year-over-year, is a reflection of that mix shift. To be honest, because we know how we want to approach a free solution for customers where it's really free filing with the state. The premium piece is a little bit different, and there's going to take some experimentation to get this right. One of the things that we had to leave last year was that customers wanted assistance, as they were forming their business right at the moment of formation, meaning like, I want to know what entity should be. And so, we've really structured this initially to be more comprehensive and having access on demand to an attorney for three months post formation. The other one then also adds a trademark, because we know that most of our customers that you buy trademark, do it within six months of forming their business. We started with price points that were premium price points, and we have a lot of flexibility to try and test and learn what the right price point is here as well. If you think about it today, we're not doing anything at the top of the funnel. So most of the people who come to LegalZoom are coming to for a DIY solution, you almost have to reframe that we have this hybrid assisted solution as well. And so, there's some work to do even at the top of the funnel that will start to do it at the later parts of this year. We went into the season by the way, not trying to optimize operationally, but really focus on the customer experience. So they weren't like segmented offerings, they weren't really well targeted. So the first off is that, our customers are very simple filers. And the reality is we ended up not seeing the peaks as high at the end of the tax season of the filing deadlines, and instead saw a lot of people doing extensions. We also saw our customers over waiting on advice, because they were so early on their journey as a business. We're paying for a comprehensive service, but really just wanted access to an accountant. And so it speaks a little bit to the opportunity that we have around how do we commercialize that product as well, so that there's sort of a low end product and then a very premium product. And then, I'd say, the last piece is, we learned a lot about how to operationalize this business. Like I said, we hired into the season, very specifically to make sure we left no customer is behind. And now we have a better sense of the actual filing curve, and how we're going to approach efficiently supporting those customers for next season. Great, thanks for taking my questions, guys, I wanted to just first hit on retention. I mean, we did see a weakness in the customers acquired during COVID. Some of those business were designed to be somewhat ephemeral, like in reaction to COVID. And we attribute that to a higher level of failure as well, that's already started to normalized. And the other thing I'd point out though, is that every other cohort, so as you get into the 25 and the 37 month and all the different age cohorts, we were seeing improvements in our attention. As it relates to recession, I wouldn't say that we're -- I don't know if anybody consider a completely recession proof business. But as we lived through the great recession, we did see that formation volume went down roughly 10%, during the great recession. As it relates to business failures, you should expect a little bit more from business failures. Typically, though, again, it's going to be the ones that have less of a track record. And then, wanted to hit on just how you're thinking about marketing and perhaps CAM spend, maybe this year and into to next. So you have a lot of new products that you're working on, whether it be the free filing product or the premium one and LZ tax, which hasn't been perhaps broadly marketed yet. And we do have a brand campaign that's I'd specially launching this weekend, where it's just a singular message around, we are the place to go to form your business. And then again, we have opportunities in the product, I'd say none of us are happy right now with how sophisticated we are in targeting, and really knowing our customer, and making sure that we're marketing to them the right solutions. If you came in to our platform, and you are pre-revenue, you really don't need a tax filing solution. Right now, we're marketing it and those customers, some of them would select it for the tax advice. When we -- you'll see us coming out of this season, have something very specific for customers who are not yet -- are pre revenue and looking for help, making tax strategies part of their formation process. And I think there's other things like that as well, where we really -- we know a lot about these customers and haven't been as sophisticated in targeting them as we should be. So, we're really excited about this one. I think this one's, it's definitely a win for LegalZoom. So 80% of the customers that form with us today, don't yet have a website, which is pretty incredible. And so what we're really trying to do here is build a extremely tight integration, that it's just not one of these kind of affiliate relationships. But this is one where there's a material profit investment on both ends, so that we can integrate their experience into the formation experience. So we also know that Wix acquires more customers than we do from a small business standpoint, and we also only have 10% share. I mean, they really think partner first, and they built a pretty compelling platform. We have lots of ideas of how we can integrate our products into their solution, not just on formations by the way, but these are customers who are very focused on identity as well. And so, things like IP and trademark, they're really interesting opportunities when you start thinking about their base. And this is the type of thing that we'll do in terms of the types of partnerships that we have going forward, just not in this in this fiscal year. First, you'll see it in customer growth. So, as we mentioned in our remarks, this was really in support of tax season. Just wondering, has there have been any historical evidence, particularly around business formation that shows a trend, particularly people have talked about potentially there being a early slow down in front of a recession, and then an early expansion business formations, as you come through a recession. I mean, when you look at census data, you do see there's a 10% reduction, and then a 5% reduction over the two years of the great recession, and then, an acceleration coming out. And then second on LZ tax, Wondering if we could provide a little bit more color as to the profile of customers you attracting, and you mentioned many of them had already done their taxes. So are they typically coming from a DIY type profile, or had they use like CPA or tax store. I think the -- on the April and May performance, we really don't like to get into the forward performance. The one thing I'll again, point you to is the census data, which did get printed for April, it showed a 13% decline in formations. On the LZ tax side, I'd say the profile of the customer is like I mentioned before, leaning much more towards micro businesses, side businesses, more personal filers in a way. In some cases, it means, they're actually current provider, is really a personal tax provider. So we have corporate customers as well, people are incorporating and you'll see 1120 filers. I think that's the big opportunity for us by the way, because if you look at how we commercialize the product this year, it was more based off behavior versus forms. And we know that forms are a really good way to segment customers, because it shows the complexity of their business. And so, that's a place where I know we'll do a lot more next year. As a follow up to one of the earlier questions around the partnerships, can you talk generally about how these will appear on the P&L, I mean, recognizing every one of these deals may be different, but presumably, there will be some sort of exchange in economics. So first, I'll go back to some of Dan's comments just mentioning strategically this fits into our sweet spot in terms of the relationship being bilateral and recurring revenue. And so, part of it will be -- will flow through our sort of core streams in terms of it'll be formations that are driven through the relationship with Wix. From an economic standpoint on the cost of acquisition, these partnerships are early and we're working with the partners in the case of like Wix, where it's bilateral, it's very clear. But the interesting part here, again, is that we actually feel like this just increases the overall size of the pie of people that we can access, because these are existing businesses that in the case of Wix, for instance, it spends a considerable amount of time in that application. I mean, that's where they run their business. And so you can almost think of this as not just an acquisition play, but also a brand player like really helping people understand what LegalZoom does. And same thing on their side that, the moment you're forming a business, we're introducing you to what we think is an amazing brand of Wix. And so, these are both pretty economical ways to approach acquisition of our customers."
}