{
    "symbol": "DTST",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 13:17:03",
    "content": " Important factors that could cause actual results to differ materially from the Company's expectations include, but are not limited to the Company's ability to leverage the scalability and performance of Flagship Solutions, the Company's ability to benefit from the IBM Cloud Migration underway, the Company's ability to position itself for future profitability, and the Company's ability to maintain its NASDAQ listing. These risks should not be construed as exhaustive and should be read together with other cautionary statements included in the Company's annual report on Form 10-K for the year ended December 31, 2022, and quarterly report on Form 10-Q and current reports on Form 8-K filed with the Securities and Exchange Commission. And while we are proud to report achieving a 60% increase in revenue to 23.9 million for 2022, we have also implemented meaningful business initiatives during the year that we believe will enable us to further accelerate growth and streamline the organization with the goal of long-term profitability. An example of how the strategy is working is our CloudFirst subsidiary, which we achieve profitability on a standalone basis with net income of $1.9 million and an EBITDA margin of 27% or $3 million with revenue of 11.5 million for 2022. Total revenue for the year ended December 31, 2022 increased by approximately 60% to $23.9 million compared to $14.9 million for 2021. So, I would say for the most part it's according to the size of the accounts, and all, but there is I believe a delay just based on the economy of people putting off that and very easily on equipment sales it can move from where you would think you're going to close it one month and it rolls over to the next quarter and then we get the sale. When you take a look at the first quarter of 2022, we have some, as I mentioned, Flagship has some very large accounts and so there's some software renewals that you see in there and that's why we get the lumpiness when it goes -- when we start looking at quarters. So when you take a look, I think our press release as well from last year, you'll see that there was a large equipment sale and there's also a large software renewal. We have $8 million to $10 million in assets deployed into six data centers, and we have more cash in the bank that -- and looking at everything that we do with limited competition in a huge marketplace, it's really very upsetting frankly to everybody that's internally, and I'm sure some of the investors as well."
}