{
    "symbol": "DTST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 16:20:06",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the Data Storage Corporation Third Quarter 2022 Conference Call. Good morning, everyone and welcome to Data Storage Corporation's 2022 third quarter ended September 30, 2022 business update conference call. The company issued a press release this morning containing third quarter 2022 financial results, which is also posted on the Company's website. If you have any questions after the call or would like any additional information about the Company, please contact Crescendo Communications at 212-671-1020. Before we begin, I'd like to remind listeners that this conference call contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 as amended that are intended to be covered by the Safe Harbor created thereby. Forward-looking statements are subject to risks and uncertainties that could cause actual results, performance or achievements to differ materially from any future results, performance or achievements expressed or implied by such forward-looking statements. Statements preceded by, followed by or that otherwise include the words believes, expects, anticipates, intends, projects, estimates, plans and similar expressions are future or conditional verbs such as will, should, would, may and could are generally forward-looking in nature and not historical facts, although not all forward-looking statements include the foregoing. Although the Company believes the expectations reflected in such forward-looking statements are reasonable, and can provide no assurance that such expectations will prove to have been correct. Important factors that could cause actual results to differ materially from the Company's expectations include, but are not limited to the Company's ability to leverage the scalability and performance of Flagship Solutions, the Company's ability to benefit from the IBM Cloud Migration underway, the Company's ability to position itself for future profitability, and the Company's ability to maintain its NASDAQ listing. These risks should not be construed as exhaustive and should be read together with other cautionary statements including the Company's quarterly report on Form 10-Q for the quarter ended September 30, 2022, and annual report on Form 10-K and current reports on Form 8-K filed with the Securities and Exchange Commission. Any forward-looking statements speak only as of the date on which it was initially made, except as required by law, the Company assumes no obligation to update or revise any forward-looking statements whether as a result of new information, future events, changed circumstances or otherwise. We continue to witness strong revenue growth evidenced by achieving revenue of $4.4 million for the third quarter ending September 30, 2022. Notably, our revenue for the nine months ending September 30, 2022, increased 80% over the same period last year, reaching $17.9 million. Our decades of experience, providing an array of multi cloud technology solutions, properly allocated investments, and highly skilled employees are the foundation to our success that has allowed us to firmly position ourselves as a leader within the industry. In fact, according to Fortune Business Insights, the cloud managed service industry in North America was $16.3 billion in 2019. And has been growing at a rate of 13.8% compounded annual growth rate, bringing the number to $24 billion by the end of 2022. Disaster recovery is projected to be at $3.6 billion in the U.S. by the end of 2022, which represents 35% of the overall 10.3 global marketplace based on Grand View Research Disaster Recovery Solutions Market Size report. Further, the steadily growing VoIP market is expected to reach 90 billion worldwide in 2022, with a compounded annual growth rate of 3.1% with 17 billion in the U.S. according to GlobeNewswire Market Analysis and Insights. Our goal is to aggressively penetrate these markets while executing on our strategy of securing high margin recurring, subscription based and managed service contracts. As we see more companies migrating their IBM Power infrastructure to the cloud, we believe this propel our solutions to the forefront of the industry, providing us the potential to capitalize on these growing multibillion dollar markets. Given the migration to the Cloud within the IBM market that I've been discussing over the past few conference calls, currently only 15% of the IBM Power service are utilizing the cloud today, despite over 1 million virtual IBM Power service globally. This is not an IBM reseller arrangement, we have the employees overseeing the services and operate our own equipment, cages and racks in the data centers. We compete with just four or five companies that have this expertise, helping companies looking to migrate to the cloud. I would also like to reiterate that the businesses that are increasingly under pressure to improve the effectiveness and efficiency of the information and storage systems, whereby accelerating the migration from self-managed technical equipment and solutions to fully managed multi cloud technologies to reduce cost and compete effectively. Additionally, in today's environment, capital preservation is an encouragement to move from a capital intensive on-premise technology to a pay as you grow CapEx to OpEx model. These trends create an opportunity for cloud technology service providers, and demand for fully managed cloud and cybersecurity services across major operating systems, an addressable market of approximately $48 billion in annual recurring revenue in the U.S. and Canada. Demonstrating our commitment to security, we achieved ISO certification for our CloudFirst in Nexus Division's. This third party certification validates our extensive internal protocols and security measures that ensure our customers data and information has been addressed, implemented, properly controlled in all areas of our organization. Importantly, we are undertaking activities that we anticipate will further improve our margins and profitability, as well as accelerate our growth. Additionally, we are establishing a new major accounts team that will be responsible for supporting our large enterprise level clients, as well as continuing satisfying ongoing equipment, software and IT requirements. We believe the changes stated will significantly improve our infrastructure solutions and recurring revenue to one time sales ratio, and as a result, will enhance gross profit and margins. At the same time, we plan on expanding our international programs and strengthen our established and successful U.S. sales and marketing programs. With over $11 million in cash in the bank, we are well funded, well positioned to execute on our growth strategy, improve our margins, increase profitability, all while maintaining leadership position in the industry. With that, I'd like to turn it over to Chris our CFO discuss our third quarter financials. Total revenue for the three months ended September 30, 2022 was $4.4 million, an increase of approximately 600,000 or 14% compared to $3.9 million for the three months ended September 30, 2021. This was offset by slight decrease in managed services for the three months ended September 30, 2022. Cost of sales for the three months ended September 30, 2022, was $2.6 million, an increase of approximately 250,000 or 11%, compared to $2.3 million for the three months ended September 30, 2021. Selling, general and administrative expenses for the three months ended September 30, 2022 were $2.1 million, an increase of approximately 200,000 or 11% as compared to $1.9 million for the three months ended September 30, 2021. Adjusted EBITDA for the quarter was $162,390 compared to adjusted EBITDA of $104,985 for the same period last year. Net loss attributable to common shareholders for the three months ended September 30, 2022 was $245,619 compared to net income of $135,630 for the same period in 2021. We ended the quarter with cash and cash equivalents of $11.3 million as of September 30, 2022 compared to $12.1 million at December 31, 2021. So this approximately $6 million or so and one type of one time charges that could be IT services, equipment and software, and approximately $14 million total contract value. And if you remember that previous calls, I revealed that we usually get a 36-month term contract, it can be sometimes 12 and as high as 60 months, but I would say on average 36 months. You know, that's how we'll come up with that $14 million in sales proposals. And then what ends up happening is they're not ready to do it yet, but a gathering budgetaries so actually in our sales force, we rated - from a quote to negotiation of an agreement to a win. So, overall the proposals outstanding today, $14 million in total subscription recurring. Got it, thank you. We're seeing larger deals come in actually, you know, it's, you'll see some deals that come in that might be 1,000. But we're seeing deals that could range from $12,000 to $18,000 in monthly recurring revenue that are being proposed. So yes that's looking, at this point, what we need to do is, is increase that by we're in the process of hiring salespeople, but just from the lead flow, it's pretty effective to be able to get leads and, and work those leads and convert into proposals and sales. So the actual numbers as relates to the economy, I think people are questioning whether they should refresh their equipment on premise, versus, go with a company like ourselves. So now, we're seeing I think, this uptick, and this lead flow coming on because they realized the cloud is secure, possibly where ISO and that is seeing that and feeling comfortable. And for - and everything that goes along with that, with the staff, watching that equipment and managing it and doing the backups versus coming to us where I believe we do a better job at disaster recovery than someone that's doing an on premise, unless you - talking about Citibank, Deutsche Bank and, and firms like that they do fantastic jobs. But for that mid-range customer, we do an unbelievable job for them for disaster recovery, cybersecurity, and they don't have to spend the money. Cable companies today, the only service they're eventually going to end up with is the internet. And with that internet, they're looking for increased revenue per customer for businesses like hospitals, financial firms, and all businesses they serve. So there is tremendous opportunity, I think, still to increase, and we're only touching on it. We're in the process of hiring some folks, the people that we are hiring though, and where we're getting most of our business today, other than the lead flow, is we work with managed service providers that have sold that equipment, and that they know us, the managed service provider is the trusted advisor for that client. And then with that when the client is ready to look at it, the MSPs are prepared folks that we call channel partners that have been trained by us have the marketing materials from us and with us. We do join calls with us, our sales engineering group and our sales teams. It's never enough we - but we are deploying that capital, the $11 million, we are deploying that so that we can increase our sales organization and also reach into Canada as well on that. We met with them, during an October fest, we were invited up, and they're having all of their folks trained on our services. So that'll increase our reach plus other plans we have in Canada, but we're not doing enough. And we have to get it to the point where it's not just the folks that sold the equipment, but companies like a cable company that has these customers, and they can go out and layer off services on to their internet. The margins were small leads would come in or do come in from IBM, HCL, Red Hat and organization like that. And these clients would get entertained that they bring in to those services, which are typically 20% to 35% margin on that. So we're working with Director of Marketing and moving that - some of those events more towards not introducing IBM's cloud, but now our cloud, our infrastructure, our disaster recovery. Also, Flagship has a data center in Miami Chuck Paolillo, our CTO along with, you know great staff at Flagship and also CloudFirst, we're going to be migrating that data center to one of the six Tier-3 data centers we have throughout the United States with a four in the United States. And we've also centralized operations between Flagship and between CloudFirst, and under Chuck Paolillo, the CTO. And with that, we believe that, let's not go add someone so fast to it, let's see what the talents are in the organization to be able to see who can cover that. Although, we need to add, if we're going to continue to grow, we need to operate as we call service delivery and infrastructure. But right now, the situation is you know, Flagship could be using some contractors. And looking at those numbers Chuck Paolillo, we'll see whether we should hire an employee that's more cost effective. So I would say on centralizing operations, Miami data center and moving these marketing events, to not say that we're selling IBM cloud, but selling our own cloud where we have millions of dollars invested in the six data centers. We're also introducing as well, continuing the marketing programs will continue for cybersecurity and other IT services. And that's something that we aren't just not doing any more, frankly. Hi, thank you, thank you for the questions today and appreciate your time on today's earnings call. I think there's - if we were to look at things on a per month basis, I believe we'll start seeing changes if it was December, but for the most part, I think that it will be the first you know, first, second and third quarter. Chuck Paolillo just took over, all the service delivery just you know, a month or so ago and working through that with the staff. When you're talking about sales funnel, sales organization, we're going to be adding to the organization that's an increased expense. But we want to ensure that we're not burning cash, we want to be able to grow from, you know, a profitable baseline on it. But in adding - individuals that are going to focus on expanding our channel partner program, that will get expensive for a little while. But what ends up happening is to these managed service providers that become channel partners, which today is a primary way that CloudFirst sells. So if their client is looking for cloud, where in their given those proposals, and on top of that we're handling the leads, in most cases directly, sometimes we pass them out to the channel partners. And when we say fall off, it just means they're just not ready at that point, we have - we'll consider a definition for a qualified prospect. And there's, all sorts of ratings within sales force that Hal Schwartz is the President of CloudFirst has put in place. It's at Nexus already, but its needs to now roll out to Flagship and Flagship folks are, you know, anxious to have that all combined as well. And as we start nailing this down a little bit more with sales force, and pulling that together, I think we may be able to do that. So sales force will grow, they'll be focused on managed service providers, channel partners are timeframe, basically, I would say two to three quarters to really see that that change. So I'm talking about improved in EBITDA margins is one thing, but I believe we'll start seeing this gross profit margin start to improve possibly in two quarters. Not that we've identified at this point, we have not identified any situations that would cost us cash today. Well, companies are recycling, they're on the, you know, three to five year recycle mode. So some of those very large accounts that we have, that are related to equipment sales, and software renewals, that continues with the existing accounts with the proposals that we have outstanding, hopefully, to close in this quarter. Because it takes several months to migrate someone's cloud infrastructure onto - our cloud infrastructure from on premise, disaster recovery is a lot faster. There's no race, that someone's going to say, I need to do this immediately, unless something went on, unusual in their environment. We hope to close out some equipment sales that folks may have budgets this quarter, to be able to do that. Got it, thank you. Maybe just last one on the cost side, I saw that your SG&A line was lower sequentially and sort of lower than a one over the last three quarters in the third quarter. Well, a lot has to do with commissions, the commission, when you when you start seeing that when you have more new sales come in, you'll see that or software renewals, you know, the account executives are paid commission when a software renews on that. And if you see equipment sales, you're going to see commissions being up. And that's because also the sales engineers, and the account executive or the channel partner has commissioned that relates to that. So if there's less potential sales that are tied to, an account executive, a sales engineer, it could vary with that, Matt. So commission, but as to the salaries I would say, we did have, I don't believe in the second quarter, we had any reductions there. I would say that that would be more in the third quarter that we had some reductions in headcount from some folks that are project management, things like that. I have to look at it a little closer to give you an exact answer, but typically, it relates to either some reductions we did in headcount or commissions, and commissions, it's more likely a larger part of that. We are focusing our efforts on high margin recurring subscription based cloud and managed service contracts, as we believe it's the future of our industry. Given our initiatives, our continued execution and knowledgeable team, we are well positioned to further penetrate this market."
}