{
    "symbol": "AZO",
    "quarter": 1,
    "year": 2023,
    "date": "2022-12-06 13:20:09",
    "content": " We set a first quarter commercial sales record and over $1 billion in sales, another impressive quarter as we generated $138 million more in sales than in Q1 last year. On a trailing four quarter basis, we delivered just under $4.4 billion in annual commercial sales, up an amazing $820 million over last year. For our second quarter of 2023, we expect our sales performance to be led by the continued strength in our commercial business, as we execute on our differentiating initiatives combined with the resilient DIY business. As Bill mentioned, from a sales perspective, we had a strong first quarter stacked on top of an exceptionally strong first quarter last year with 5.6% domestic comp growth. For the quarter, total sales were just under $4 billion, up 8.6%, reflecting continued strength in our industry and solid execution of our growth initiatives. For the first quarter, our domestic DIFM sales increased nearly 15% to $1 billion and were up 44.3% on a two-year stack basis. Delivering quality parts, particularly with our Duralast brand, improved assortments and local market availability, competitive pricing and providing exceptional service has enabled us to drive double-digit sales growth for the past nine quarters. Interest expense for the quarter was $57.7 million, up 33.4% from Q1 a year ago as our debt outstanding at the end of the quarter was $6.3 billion versus $5.3 billion at Q1 in last year, and our variable rates have increased significantly. Net income for the quarter was $539 million, down 2.9% versus last yearâ\u0080\u0099s first quarter. Our inventory per store was up 14.4% versus Q1 last year, and total inventory increased 17.6% over the same period last year, driven primarily by inflation, our growth initiatives and in-stock recoveries. I will start with 15% growth in our commercial business, we are all excited about that, especially coming off of the growth that weâ\u0080\u0099ve had in the last couple of years."
}