{
    "symbol": "ADMP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 21:28:03",
    "content": "  Operator: Good evening, and welcome to the Adamis Pharmaceuticals First Quarter 2022 Financial Results Conference Call. Good afternoon, everyone, and welcome to the Adamis Pharmaceuticals first quarter 2022 financial results and corporate update conference call. Joining me today is Adamis President and CEO, Dr. Dennis J. Carlo, Chief Medical Officer, Dr. Ron Moss, Chief Business Officer, David Marguglio, and Chief Financial Officer, David Benedicto. In today's call, we will make certain forward-looking statements regarding our business based on current expectations and current information. Additional information concerning factors that could affect our business and financial results is included in our most recent annual report on Form 10-K with the Securities and Exchange Commission, and in other subsequent filings that we make with the SEC. In a few minutes, David Marguglio will provide more information, but we are very pleased with the market reception of ZIMHI and the uptake in both the retail and non-retail sectors of the market. On March 21, 2022, Adamis announced a voluntary recall of certain losses from Jepi epinephrine injection, 0.15 milligrams, and 0.3 milligrams prefilled the single dose syringes. This afternoon we were pleased to file our Form 10-Q for the quarter ending March 31, 2022. That is due to our sale of assets relating to our compounding pharmacy business, formerly conducted by our US compounding subsidiary, and our decision to wind down that business and sell or dispose of the remaining related assets. Revenues for the quarter ending March 31, 2022 and 2021 were 1.2 million and 1.4 million respectively. Revenues for the quarter ended March 31, 2022 consisted mainly of 1.1 million of sales of ZIMHI to our commercial partner US WorldMeds in anticipation of the commercial launch of ZIMHI announced at the end of March. Revenues for the quarter ended March 31, 2021 consisted mainly of SYMJEPI injection sales. Due to SYMJEPI manufacturing code and the voluntary recall, no revenues relating to SYMJEPI were reported for the first quarter of 2022. Selling, general and administrative expenses for the quarter ending March 31, 2022, and 2021 were 3.4 million and 3.5 million respectively. The selling, general and administrative expenses in 2022 reflected the decrease in legal and compensation expenses, offset by an increase in accounting and finance related expenses. Research and development expenses were 4.2 million and 2.2 million for the first quarter of 2022 and 2021, respectively. Net loss from discontinued operations for the three months ended March 31, 2022 and 2021 was 165,000 and 1.5 million respectively. Cash and cash equivalents at March 31, 2022, totaled 17.8 million. This year, we expect to receive additional proceeds resulting from amounts payable to us pursuant to our sale of certain USC assets to  and from the disposition of the remaining USC assets, which includes the land, the building, and the machinery and equipment. Once again, please see our Form 10-Q for the quarter ended March 31, 2022 for additional details and disclosures. I will now turn it over to our Chief Medical Officer, Dr. Ron Moss for an update on product development. Our Phase 2, Phase 3 clinical trial to evaluate Tempol as a treatment for COVID-19 is continuing, our planned interim analysis is anticipated to occur in late May or early June as we're currently confirming the statistical programs and datasets. As the trials interim analysis, the DSMB carefully reviews this data and can stop or continue a trial and also make a recommendation to modify the trial or even request additional meetings of additional clarification is required. If the study continues, we don't anticipate releasing any data resulting from the interim analysis in order to maintain the blinding and integrity of the data as it is done and other clinical trials. The time to completion of the trial depends among other factors on both COVID infection rates, which are increasing enrollment in the DSMB's recommendations. Finally, we're looking at other potential clinical uses of Tempol, continue to seek government non-dilutive funding and have recently applied for government grants. As with any launch, there's a ton of work going on behind the scenes that precedes any significant uptick in sales and that includes establishing brand awareness, market access, contracting, et cetera. A few of those plans include the Veterans Administration, many of state medical or Medicaid plans, including several of the largest Blue Cross Blue Shield plans in Massachusetts, Michigan and Tennessee, Highmark Blue Shield plans in Delaware, Ohio, Pennsylvania, New York and West Virginia and all of  top commercial formularies. After loading the wholesaler distribution channel at the end of March, US WorldMeds began direct promotion to health care practitioners with a team of 20 plus regional account managers. Although we are still just weeks into this launch feedback from the commercial team has been quite favorable for the product, the size and intuitive nature of the device and the overall value proposition amongst stakeholders in both the retail and non-retail market sectors. So, in summary, although early we are very pleased with the activity to-date, and the trajectory for the product, both Adamis and US WorldMeds remain bullish on ZIMHI’s as long-term value in the market."
}