{
    "symbol": "OVV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 13:58:06",
    "content": " Our team delivered another quarter of strong operational results with outperformance from our new wells in our Montney, driving natural gas and NGL production to the high end of our guidance range, which in turn delivered total production levels also at the high end of our guidance range. We delivered strong financial results in the third quarter with net earnings of $1.19 billion, EBITDA of $958 million, free cash flow of $437 million and cash flow per share of $3.70 beating consensus estimates. But is there a case to be made that potentially next year, you could skew a little even more to the Montney given that it seems like there's significantly less inflation there, and you have really, really strong well performance or -- is there some kind of, say, natural governor on activity based on how much direct price exposure you want to echo. So it's really '22 is sort of the anomaly year where investment in the Montney was down because of the permitting delay, and this is kind of getting back on track in the play for us, because we definitely are going to pay attention to the broader gas macro at NYMEX since that's going to be where the bulk of our price exposure is going to be over 90%. And Brendan, I'm just wondering specifically, would you all consider -- obviously are doing a great job on the buybacks, but I'm just wondering would you even consider lean in harder into these in the coming quarters, especially if your free cash flow, I mean, we see it well, we're still 20%, one of the better out there. Really, if the macro stays where it's been recently, weâ\u0080\u0099ll see significant cash returns and debt reductions next year, which could be a point at which we contemplate going above the 50%. Sitting here today, the inflation pressures we've been saying feel like a 10% to 20% range year-over-year, and it's really kind of pointing more towards the high end of that range. I think you guys have said in the past that the Board typically targets a base dividend that represents about 10% of cash flow at mid-cycle pricing, which would probably put you somewhere in sort of the $300 million to $350 million range and well above sort of the current annualized number."
}