{
    "symbol": "OVV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 14:12:03",
    "content": " I think the $1 billion of cash return that we've outlined this year, as you look out into 2023, is said to be well in excess of $2 billion, as we look out into 2023 if prices hold. Neal, just before you go to your follow-up, the point I'd just add to Greg there is in addition to being well positioned with the equipment crews and materials we need for the year that that gives us the confidence, I just want to pick up another point Greg made in the prepared marks that on a percentage basis, we've got 60% of our turn-in lines coming in the second half of the year, which is really what's going to drive that higher production profile in the back half of the year. First on the sustaining capital, I think, really what we're seeing is of course, it's going to depend a little bit on the commodity price environment and the activity level that we're seeing in 2023 and beyond as to set that sustaining capital. I mean, if you look at the trajectory, overall, we're set to double that cash return from $25 million to $50 million, but really if you think about it in the first quarter, we returned $123 million, and that's going to kind of quadruple or quintuple as we look out into the fourth quarter. It looks to us that just given your debt maturity window and how you'll be able to drop to sub $3 billion in debt by the end of Q3 that you can easily continue to strengthen the balance sheet towards the $2 billion level by the end of next year at strip, if you wanted to, even while still returning in excess of $2.5 billion of cash as shareholders on our numbers. I mean, absolutely directionally you've got it nailed I think the way I characterized it was well over $2 billion of shareholder cash return next year on today's prices. We evaluate the deals through our mid-cycle lens and we're comfortable today with our over 10 years of premium inventory, but we like the ability to be just adding to that and extending that as we go just on progress there, we've added something like 140 net locations since we started towards the end of last year for very low amount of capital."
}