{
    "symbol": "OVV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 14:13:02",
    "content": " With more than 10 years of premium oil inventory and over 20 years of premium gas inventory across our portfolio, we expect to continue to deliver superior returns on both the capital we invest in the business and cash returns to our shareholders for many years to come. But we also see that that pathway is likely to be difficult, at least in the near to medium term, and so that kind of high demand with challenge connecting the resource to the market does make us more constructive for benchmark prices, both globally and for NYMEX and so you know thatâ\u0080\u0099s great news for us, because we think weâ\u0080\u0099ve got this incredible gas option in the portfolio today and clearly thatâ\u0080\u0099s something weâ\u0080\u0099re going to talk about more on the Montney webcast. You know with respect to your question on capital allocation, I think the way to think about it is weâ\u0080\u0099ve got great optionality there, and as we start to design the 2023 capital program, weâ\u0080\u0099ll be looking for how to maximize free cash flow and cash flow per share and returns, and so that is a lever that we can pull on. And so today the way we are hedging is, we're hedging to manage the risk of a very low period of commodity prices, and what we're doing is â\u0080\u0093 you know what drops out of that is we want to be able to protect the business against those low prices and still be free cash flow neutral or better after the base dividend, and so what youâ\u0080\u0099re seeing us do is hedge about 20% to 25% of production. But you know if you think about our business domestically in the U.S., we exited last year with about $5.3 billion in NOLâ\u0080\u0099s and so even at today's prices we think that cash tax rise and puts us kind of out into 2025, and I did give a little bit of that AMT color earlier, which could move that around by year. So if you think about the cash tax in the Canadian business, that's probably come forward as we could have minimal to $100 million next year in that business if prices stay really high. So if you think about kind of a cut off there, think about like $5 as your trigger point to where you might have some cash tax in the Canadian business next year, but it's really more in the order of magnitude of small hundreds of millions as opposed to cash taxable for the whole enterprise. The innovation innings game has been one we've talked with, in the market about for a number of years now and I think whatâ\u0080\u0099s always shown up is the right, the smart bet was always to bet on the innovation, and bet on further efficiency gains and we believe that deeply here and as Greg said, it's really kind of a cultural piece for us. So the second part your question is really around â\u0080\u0093 you know is the efficiency gain baked into that 10 to 20 and it is, that's why the range is so large sitting here today, because we are going to continue to learn through the back half of the year on how much of those pacesetters we can convert into repeatable averages, but we're also going to learn more about where the market sits on pricing."
}