{
    "symbol": "LSAK",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-12 10:55:04",
    "content": " And the Connect Group added $86 million to the group's revenue, while at the same time our existing merchant business grew revenues by 13%. So, segment adjusted merchant EBITDA for FY 2022   improved to an $11 million profit, which is underpinned by the growth in our existing merchant business and the contribution made by Connect. For Q4 2022, the pre-existing merchant business reported total revenue of 19.5 million growing 35% on a constant currency basis to ZAR304 million, compared to Q4 2021. Similarly, segment adjusted EBITDA for the merchant business was ZAR114 million with EBITDA from the pre-existing merchant business for Q4 increasing from ZAR4 million in Q4 2021 to ZAR24 million in Q4 2022; and Connect contributing ZAR90 million for the 2.5 months that Connect was consolidated into the group results for Q4. Merchant business revenue and segment adjusted EBITDA performance change was transformational, with inclusion of Connect Group results, we achieved a revenue of $105.7 million and a segment adjusted EBITDA profit of $7.4 million. Consumer business delivered a segment adjusted EBITDA loss of $1.4 million, as compared to the EBITDA loss of $6.9 million in the first quarter of 2021, mainly coming from a reduction and rightsizing of the consumer cost base. This was achieved mainly through the cost initiatives delivered in the consumer business, higher revenue in the pre-existing merchant business, and contribution from the consolidating the Connect Group in our fourth quarter. I mentioned earlier that the group delivered $6 million in segment adjusted EBITDA for the fourth quarter of FY 2022, and we believe that this is a reasonable indicator of the EBITDA run rate that should be achieved in the near term, excluding growth, but noting that the Connect Group was included for 2.5 months of Q4 FY 2022 and also noting that in Q4, we saw significant outperformance in our POS sales division."
}