{
    "symbol": "TRN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 10:19:07",
    "content": " In the Rail Products segment, quarterly revenue of $656 million was up sequentially and year-over-year due to higher deliveries and favorable pricing and product mix. On our third quarter call, we modified our operating cash flow target to a range of $1.2 billion to $1.4 billion to account for the sale of our highway business, higher working capital needs and geography of railcar sales. In the fourth quarter, our consolidated revenue of $591 million improved sequentially and year-over-year due to higher external railcar deliveries and improved pricing. Our adjusted EPS of $0.44 per share in the quarter, also a sequential and year-over-year improvement benefited from $236 million in lease portfolio sales driving a gain of $55 million. In 2022, approximately 36% of our manufactured railcars were delivered to our lease fleet to meet customer demand, which was a gross increase in the fleet of $929 million. In keeping with our goal of modest fleet growth and aided by a strong secondary market, we sold approximately $751 million of railcars out of our fleet, which allows us to optimize the composition of railcars in our fleet to serve customer demand and keep utilization high. Our three-year planned net fleet investment was $500 million to $600 million, which means we expect a net fleet investment of approximately $250 million to $350 million in 2023 to land in the forecasted range. While a smaller percentage of railcars we deliver will go into our lease fleet than last year on an absolute basis, we expect similar internal deliveries and expect higher eliminations on a dollar basis due to a higher volume of deliveries at higher prices. This year, more or fewer of our deliveries will go to the lease fleet this year, which will mean there's fewer, the investment in the fleet will be -- is in that $250 million to $350 million. So when you go back to our three-year Investor Day plan, we lowered that last quarter slightly, the cat, we're still in that range with the items that happened in the fourth quarter and where we're sitting today, we're maybe in the lower range -- lower part of that range, but our cash looks like it -- this platform can generate a significant amount of cash, and we expect that to continue in 2023. If you back out, your $900 million, I think you're looking at all the lease fleet investment and I'd just refer you to our adjusted cash flow in the disclosure where we kind of walked through the fleet investment is certainly -- the headline is a big number."
}