{
    "symbol": "TRN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 20:02:03",
    "content": " :\n 00:04 Good morning, everyone, and welcome to the Trinity Industries' First Quarter Results Conference Call. 00:35 Before we get started, let me remind you that today's conference call contains forward-looking statements as defined by the Private Securities Litigation Reform Act of 1995 and includes statements, estimates, expectations, intentions and predictions of future financial performance. Our prepared remarks will include comments from Jean Savage, Trinity's Chief Executive Officer and President; and Eric Marchetto, the company's Chief Financial Officer. 01:45 During the call today, we will reference slides highlighting key points of discussion as well as certain non-GAAP financial metrics. These slides can be found under the Events and Presentations portion of the website, along with the first quarter earnings conference call event link. 02:11 A replay of today's call will be available after 10:30 a.m. Eastern Time through midnight on May 4, 2022. Before we get started today, I want to point out that both our 2021 annual report and our interim CSR update report are available on our website. I'm especially proud that our CSR report provides a summary of our first formal materiality assessment, the results of which are driving our ESG strategy forward with a priority focus on employee health and safety, diversity, equity and inclusion, human rights, energy consumption and reduction of greenhouse gas emissions. As we have seen some of the pandemic concerns and restrictions easing, it was nice to be back in person and participate in industry events again in the first quarter. We continue to see strengthening market tailwinds, as we discussed on our last call. However, new headwinds appear to be developing, including persistent inflation, increasing interest rates and the ripple effects of the war in Ukraine. Particularly in the U.S., challenges persist in certain labor markets and supply chains as well. 04:00 While we will address some of the headwinds we saw in the first quarter, we continue to expect leasing margins to improve with rising rates and increased utilization of the fleet driven by strong railcar demand. Also, our rail manufacturing backlog is extremely strong, and we'll start delivering railcars in conversions that were sold in more favorable market conditions as the year progresses. Although we will continue to face challenges in the second quarter, our forward-looking metrics support our optimism about a strong second half of 2022, and we are maintaining our EPS guidance with that in mind. Through the first quarter, we saw continued improvement in demand, which is great, but the rail industry has had difficulty serving that demand. This disconnect is most evident in the fact that although year-to-date North American rail volumes are down year-over-year, the number of railcars and storage continues to decline. The downward trend in railcar storage is a function of more demand from shippers to move product, increased scrapping and slower train speeds. As I mentioned a moment ago, our TrinityRail fleet utilization improved in the quarter to 96.5% as we placed more railcars in service. To date, we have converted 1,095 railcars. Remember, these are railcars that would otherwise be underutilized or scrapped, but they're instead converted or upgraded to better meet changing market demand and drive higher returns on our invested capital. 06:59 Also, on lease fleet demand, our FLRD was 2.4% in the quarter, the third consecutive positive quarter, giving us momentum into the revenue tailwind for renewing railcar lease rates. In the quarter, our Rail Products Group received orders for 5,055 railcars, and delivered 2,470 railcars. And in the first quarter, we saw replacement demand for boxcars to serve predominantly the paper and food markets. Deliveries are still being impacted by supply chain disruptions, but we did see on-time deliveries improved steadily through the first quarter due to some easing and pandemic-related absenteeism, as well as better internal handling of our inventory and supply chain. Our GAAP EPS was $0.09, and includes another insurance gain from the Cartersville tornado that benefited the Rail Products segment. Excluding that gain, our adjusted EPS from continuing operations was $0.03. 09:06 Our cash flow from continuing operations was $29 million in the quarter, and free cash flow was $48 million, both impacted by working capital growth due to manufacturing volume increases, and ongoing supply chain inefficiencies. We believe our business is well prepared to handle these current headwinds of supply chain disruption, high input costs and freight surcharges, but we're not immune to their effects. In our leasing business, our revenues are up slightly quarter-over-quarter and have remained pretty flat over the last year as our utilization is improving, while the overall size of the lease fleet has decreased slightly. As a reminder, our average remaining lease term is about three years. So while renewals -- and renewal rates are positive, it takes time to see these flow through the results. Additionally, as we have stated before, the sustainable railcar conversion requires accelerated depreciation on donor railcars. However, we continue to believe this program is a worthwhile investment and future benefit as the railcars drive more profitability to the fleet. Quarterly revenue was down sequentially due to the timing of deliveries, but still reflects substantial growth and improving fundamentals year-over-year. Looking forward, our orders taken in the first quarter were strong, and reflected growth from both the revenue and our margin perspective. Operating margin in the segment was 0.2%, but includes a gain of $6.4 million from insurance proceeds from the Cartersville tornado. But as a point of reference, Rail Products margin would have been a negative 1.4% excluding this gain. As I mentioned on our call in February, in the first half of the year we are delivering railcars that were ordered at the bottom of the cycle, including some fixed price contracts, which have been negatively impacted by high steel and raw material prices. And when those orders start to deliver, we expect to see a meaningful step change in our margins in the segment. 12:49 In addition to the input cost inflation, margins in the segment were also impacted due to a higher level of production line changeovers. Additionally, our maintenance services business struggled in the quarter, largely due to very high absenteeism in January due to the Omicron wave leading to operating inefficiencies. As so many other companies have mentioned, Omicron was a meaningful disruption to our business in Q1, but quickly subsided. We are in year two of the three-year plan we laid out at the Investor Day in 2020, I think we are well positioned to reach the goals we presented to you then, including a mid-teen pretax ROE goal. First, in 2020, we introduced the future lease rate differential, or FLRD. This metric calculates the implied change in revenue for railcar leases expiring over the next four quarters, assuming they were renewed at the current transacted lease rate for each railcar type. 14:53 We have refined the way we aggregate the data to better correlate with actual revenues, and have adjusted the FLRD to account for this change in prior periods, as you will see on the trend line on slide four. 15:18 As we've previously announced, we priced a $245 million asset-backed securitization that is expected to close tomorrow. The debt is backed by a discrete pool of railcar assets, the TLC will continue to own and manage. This financing is critical to our ongoing balance sheet management as majority of the railcars that will serve as collateral for this debt will come from our warehouse facility, freeing up more availability. 15:49 At an interest rate of 4.55%, it is clear that we are in a different financing environment than last year. 16:12 Now please turn to slide eight with highlights from our financial statements, starting with the income statement. But adjusting for the Cartersville gain previously mentioned, our adjusted EPS was $0.03. We also benefited in the quarter from a gain of $11 million that came from portfolio -- railcar portfolio sales, and a gain of $7 million on the sale of a nonoperating property. Railcar portfolio sales are a normal part of our business, and you can expect to see them periodically. I also wanted to briefly talk about our results and discontinued operations, which you'll see in our 10-Q that we will file later today. In the quarter, we recorded additional legal and transaction costs incurred in the period related to the Highway Products business that we sold in the fourth quarter of 2021. Cash flow from continuing operations was $29 million, and free cash flow after investments and dividends was $48 million. As operating conditions normalize, we expect to see cash flow improve significantly. As a reminder, we are unable to buy back any additional shares until the accelerated share repurchase program is complete, which we expect by the third quarter. Our current share repurchase authorization has $73 million remaining, and expires at the end of the year. We remain diligent in optimizing our balance sheet, and have liquidity of $718 million as of March 31. As you can see from our reported results, we have benefited from lower interest expense resulting from our previous financings. Having fixed approximately 75% of our debt at rates that are attractive relative to the current market, we believe our debt profile and maturity schedule will help dampen the impact of the current rising rate environment. As Jean mentioned, our 2022 forecast is significantly weighted in the second half of the year. For the full year, we see industry railcar deliveries to be between 40,000 and 50,000 railcars. It's also worth noting, once again, these delivery numbers do not take railcar conversions into account. 19:47 Our long-term commitment to discipline investment in the fleet remains, and we are anticipating net fleet investment of $450 million to $550 million in the year, depending on the time of deliveries. Embedded in this number are secondary market purchases, which we are anticipating to be meaningful this year. As we think about our three-year fleet investment targets, we are balancing our fleet investment in a period of increased demand for new railcar leases with a very active secondary market. We expect manufacturing and general capital expenditures of $35 million to $45 million, which will be primarily related to investments in safety, efficiency and automation. 20:43 And finally, we expect adjusted earnings per diluted share from continuing operations of $0.85 to $1.05 for the full year, excluding any onetime items like the Cartersville gains this quarter. As we move into the second half of the year, we will see substantial growth in our business and we are confident that we have the initiatives in place to enable us to overcome the current headwinds in our business. 21:12 As Jean mentioned, our rate of new railcar production will increase significantly through the year based on the visibility from the orders we have booked in the last few months, and we expect that to be evident in higher revenues. We expect to exit the year with mid to high single-digit margins in Rail Products, hitting the goal we introduced at our Investor Day. Given higher demand, we were able to raise the rates on these older railcars that have a lower cost basis, and thus improve our return on equity. 22:07 In closing, Trinity has greater near-term visibility, and this allows us to have confidence in the company's ability to achieve our guidance for the year, as well as our long-term return goals. I mean, I know you have the three-year plan out there. But gosh, a lot of things have changed and some of them quite positive for your business, others may be more mix since November of 2020. We just -- as I mentioned, we just -- we're closing on another financing tomorrow when with access the ABS market. And clearly, interest rates are elevated from where they were over the last couple of years. But we have a very nice maturity profile, very little in the way of maturities in the next couple of years. And that's where you really notice the funding cost is on those investment decisions when you're acquiring railcars, whether you're acquiring them in the new assets or if you're acquiring railcars in the secondary market. And the result of higher interest rates is it's going to make investors hurdle rates higher, which should make lease rates higher. That's one of the factors that allow that to go higher once you have periods of balance, which we do have more -- the industry fleet is more in balance today. So it is a change -- but I think overall with the existing fleet, it is more of a benefit than a harm. You're going to reprice the fleet over -- if we have a three-year remaining lease term, which we do on average. So I mean it does get into timing, but overall, I think it's a benefit. And so, these are 30, 40 year assets, and part of leasing business is, you finance it and then you pay down the debt and you refinance it. And so, it just speaks to the cash flow generation of the lease fleet. And even in periods with higher interest rates, I would expect we'll still generate significant amounts of cash flow from it over time. I mean, certainly, steel prices and new asset costs have been dramatically more inflationary than I'm assuming you underwrote in that plan in November of 2020. I'm a little surprised the -- I think the annual guide for net lease fleet investment of what, $450 million, $500 million is roughly in line with what you had planned over three years in that period. 27:36 Another really insightful question, and you're right on all the fronts. But the one thing that has not changed is our capital allocation framework, and we've committed to -- we talked about modest lease fleet investment over that three-year period. And there's more demand for -- when we put out our Q today, there's more demand for railcars currently. That includes more demand for lease product as well, as our backlog for both has grown. 28:19 And so -- and when you look at that net fleet investment that you cited in the $450 million to $550 million, just keep in mind, that is a net number which includes both additions out of our manufacturing sites of new lease fleet additions. We're also seeing more demand for our rail lease products through sales, whether it's through our RIV platform or whether it's through the secondary market. And so, I think when you look at it over a single year, it can get a little lumpy. When you get to it over three years, nothing has changed in our framework and what we're going to do. That's a really long answer, but there's a lot of inputs and a lot of puts and takes. Please go ahead with your question. And so, the impact of inflation, the impacts of steel prices going back up after we sell them come down have really not changed that pattern yet. As we look at it, the car owners are making long-term decisions on what they're going to put into their fleet. And so, some of the short-term headwinds that we're seeing have not slowed anything down yet. 30:57 If you're talking about the second quarter, yes, I would say we're still happy with what we're seeing. 31:34 So when we're looking overall at what's going on, it's pretty well distributed. And then the end shippers come in, and we're seeing orders come in from all three of those areas. And remember, though, on this cycle, we're projecting 40,000 to 50,000 railcars minus sustainable conversions or without the sustainable conversion. So there's no big driver to do anything different than replace the fleets that have been scrapped over the last three years, and are continuing to get scrapped now. 32:40 So again, we think orders are going to be the 40,000 to 50,000, and we would expect to see similar deliveries to what you're seeing this year. And then just one last quick question for me, which I asked to one of your competitors three weeks ago. This cycle is driven by more than one or two railcars, which is typically the case. 33:37 Well, as you look at this year, we started at a lower run rate. So what we're ending this year, which helps you overall as far as efficiencies. So I would say there's potential upside for next year on those margins, but we still are taking orders for 2023. It's nice to already be getting orders this early in the year for next year, but we'll have to see where that lines up, and I would expect to see some possible improvement on that. Just had a question, first on your Rail Group margins. Clearly, you had some railcars that you were selling that you booked in the bottom of the cycle last year, which aided to the margin pressure. First, we have definitely been taking the orders in the environment we're in now, which is a tighter market. So we're seeing better pricing that we're getting there, better margins that would come along with that. The other thing I'll say is first quarter, there were some more supply chain issues, especially in some of the specialty items, hatches, valves, covers that we had to get that we've been working to abate by the second half of the year. That's really disruptful during a run if you have to pull cars out, so you can weigh on materials to come in. 36:39 So there's a combination of having better labor availability, having better supply chain and also having better dynamics around the orders that we're getting. For the -- in terms of orders, and I think you might have mentioned this on the -- in your prepared remarks, I apologize if I missed it. As we look at where orders were coming from right now, it's not in a single area. But if you look at the top areas of boxcars, definitely there's been a lot that has been scrapped over the last few years, they were getting older and there being replaced, grain cars remain strong and plastics would be some of the top three areas. And then I'll just squeeze in another quick one, please. For your new orders that, in my opinion, I think it looks pretty good compared to last year, particularly and especially in the average value that you guys reported. 38:16 It’s pretty broad based and across all the different areas that we are seeing those customers come in, which we mentioned  and in the discussion and the questions was the fact that it typically win railroads and third party lessor, and it’s moved into shippers also buying more cars. The shippers were seeing a lot more attrition, we got an eco-box or inflated boxcar that is taking new product design from us that’s getting to more momentum. It's just under $700 million of our backlog, which is up dramatically from the same time last year. And you'll see that all in the Q, which will get filed this afternoon. Please go ahead with your question. 40:31 So Ken, unfortunately, we're not giving quarterly guidance. And in my prepared remarks I talked about a step change in the margins for the second half of the year, and that's really as far as we'll go on that. 41:18 One thing I will tell you is, we've mentioned that in the first half of the year, we will be delivering the orders of the cars that were taken at the bottom of the market. Once you get to the orders that we're taking now, that we'll deliver in the second half of the year, I think you'll see, again, a marked or a step change in what those margins will be. For my follow-up, it seems like service levels from the Class I have obviously taken a hit amid the current supply chain environment. But overall, it's still replacement type demand that we're seeing. And remember that, as these shippers or car owners make their fleet plans, they're looking for the long term, not just for that short-term impact that you're seeing from the railroads, because they're still looking at either opening new plants, some of the replacement or growth opportunities they might see. 43:08 The biggest thing that we still see lingering on the supply chain is, at least in the US, labor shortages still are causing them to delay some of their shipments, not get them tools in the time different than we expect. We still think we'll see some of those impacts through the first half of the year, and expect to see that getting better in the second half. Please go ahead with your question. So when you look at our FLRD, it's 2.4% is what we're reporting for the first quarter. And as you look at a tightening market that we still see out there for railcars, railcars and storage going down, scrapping continues. Railroads being a little bit slower as far as our speed, all are contributing for that demand. As long as we continue to see that demand, I would expect to see I'll be able to adjust or increase that lease rate and keep up with some of the inflation that we are seeing. So first, our thoughts and prayers go out to the people in Ukraine with a war that they're going through. And I think overall, it's going to be minimum impact to the cars and the orders that we're seeing here in the US. We are seeing increased drilling activity that started really last year, and we're starting to see that fleet get tighter. Where we are seeing growth in the liquid side is more on the biofuels, and greater demand for biofuels, and that is helping the tank car fleet and getting that tighter. Going back to your Investor Day in 2020, you highlighted some new products with potential operating income impact of $150 million to $200 million. 47:20 Well, it was multiple years. Our new grain car covered hopper has gone extremely well, and that's a  (ph) many of the railroads have picked up on that car throughout North America and not just in the US, and has done well for us. Our boxcar work is also picking up, and that's insulated boxcars, refrigerated and some of the standards. And I think you'll see that escalate as the chip shortage is overcome, and you can get those automobiles out and running. We haven't really said how much of the dollar amount will be done for this year, but we are making progress. 48:50 And ladies and gentlemen, with that, we will be ending today's question-and-answer session. As we've shared with you today, we look around our business and see improving metrics and data that forecast higher returns and earnings later in the year. We look forward to seeing our hard work pay off, and reporting those positive results with you. 49:31 And ladies and gentlemen, with that we'll be concluding today's presentation."
}