{
    "symbol": "SIX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 12:14:13",
    "content": " Cash operating and SG&A expenses were $222 million versus $229 million in the prior year, representing a decrease of $7 million or 3%, driven primarily by reductions in full-time wages and benefits, seasonal labor, and advertising offset by significant inflationary pressures. Our first half cash operating expenses and SG&A decreased $18 million or 5% versus 2019, due to our leaner corporate overhead structure, less advertising, and our initial efforts to optimize full-time and seasonal labor based on lower attendance levels. So, our objective is to get a fraction of those 6 million to become seasons pass holder, hopefully given the experience they have, given what they need to be, at least to get them to come back a second time this year, if not the seasons pass get them to come back to our Oktoberfest, to our Fright Fest and holiday in the park. And then at this point to get all of these people back that you're talking about, do you think that these parks need more reinvestment in the form of CapEx and rides and attractions because I mean you talk about getting pricing closer to the other players, but I think many of us would argue that those players have historically invested more than you. Even though we have basically say that we have not invested in new ride, and it has not been our priority this year, we will introduce â\u0080\u0093 we will be introducing record breaking and  ride this year at Magic Mountain, Wonder Woman Flight of Courage, single rail coaster, the Park's 20th coaster  Texas, Dr. Diabolical's Cliff Hanger, the world's steepest dive coaster over Texas in Dallas, Aquaman, Power Wave, the first of its kind, water coaster in North America and our park's 15th coaster in that park. I think that's our focus, is focusing mothers, influencers, social media like TikTok, and targeting not only the people who use â\u0080\u0093 have used the park or coming, but people who are outside our database and try to get people to try to experience our park for the first time."
}