{
    "symbol": "SIX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 12:46:04",
    "content": " Third, after scaling back our marketing earlier in the year, we launched several successful media campaigns to support our fourth quarter events, focused heavily on digital and television. And finally, we continued to stay focused on cost controls and drove significant margin improvement compared to fourth quarter prior year and 2019. The success of our transformation depends on our people, and I'm so proud that our team has risen to the challenge. The path towards progress never follows a straight line, but our vision for delivering an exceptional guest experience and sustainable profit growth remains our focus. Now I'll turn it over to Gary, who will provide more details on our financial performance. Third, after scaling back our marketing earlier in the year, we launched several successful media campaigns to support our fourth quarter events, focused heavily on digital and television. And finally, we continued to stay focused on cost controls and drove significant margin improvement compared to fourth quarter prior year and 2019. The success of our transformation depends on our people, and I'm so proud that our team has risen to the challenge. The path towards progress never follows a straight line, but our vision for delivering an exceptional guest experience and sustainable profit growth remains our focus. Now I'll turn it over to Gary, who will provide more details on our financial performance. Finally, I want to briefly mention an exciting new initiative we've been working on over the past year, e-gaming. This has been a passion project of our Vice President of Design and Innovation for the past decade, and we are excited to finally give him the reigns to execute on his vision. I won't be divulging too many details today, but you should expect some exciting announcements in the days and weeks to come. Second, strategic priority is pricing and products. Historically, Six Flags pricing programs have been heavily focused on discounts. In 2022, we eliminated many of the historical discounts, including free and ultralow priced tickets, and we trialed several iteration of new pricing programs. Recently, we've taken our learnings and settled on an approach that balances attendance and revenue. We believe we have pricing power, but only if we deliver an exceptional guest experience. In addition, we have restructured and simplified our season pass program, reducing tips to three tiers with logical step ups between categories. We will offer limited promotions from time-to-time in order to drive unit sales, but we will no longer be a heavy discounter. We are developing an agile culture of autonomy, urgency, and excellence. Last year, we significantly streamlined our organization reducing layers of management and empowering people who are closest to our guests. To be clear, this is not just about cost scale. In fact, we expect to selectively add resources to our parks in area that affect the guest experience. Over the past year, we have appointed new heads of digital, marketing, water parks, finance and legal. We have also appointed many new park presidents, most of whom were internal promotions from within our organization. Our team is really starting to gel and from my experience, there is nothing that brings people together like delivering record results. We saw great success with our festivals and events in the fourth quarter, even though many were put together quickly and with limited budgets. In 2023, we plan to amplify our focus on festivals and events, starting with our first ever Spring Break at several of our parks this March and April, where traditional Spring Break gets a little bit spooky. Finally, I want to briefly mention an exciting new initiative we've been working on over the past year, e-gaming. This has been a passion project of our Vice President of Design and Innovation for the past decade, and we are excited to finally give him the reigns to execute on his vision. I won't be divulging too many details today, but you should expect some exciting announcements in the days and weeks to come. Second, strategic priority is pricing and products. Historically, Six Flags pricing programs have been heavily focused on discounts. In 2022, we eliminated many of the historical discounts, including free and ultralow priced tickets, and we trialed several iteration of new pricing programs. Recently, we've taken our learnings and settled on an approach that balances attendance and revenue. We believe we have pricing power, but only if we deliver an exceptional guest experience. In addition, we have restructured and simplified our season pass program, reducing tips to three tiers with logical step ups between categories. We will offer limited promotions from time-to-time in order to drive unit sales, but we will no longer be a heavy discounter. We are developing an agile culture of autonomy, urgency, and excellence. Last year, we significantly streamlined our organization reducing layers of management and empowering people who are closest to our guests. To be clear, this is not just about cost scale. In fact, we expect to selectively add resources to our parks in area that affect the guest experience. Over the past year, we have appointed new heads of digital, marketing, water parks, finance and legal. We have also appointed many new park presidents, most of whom were internal promotions from within our organization. Our team is really starting to gel and from my experience, there is nothing that brings people together like delivering record results. We saw great success with our festivals and events in the fourth quarter, even though many were put together quickly and with limited budgets. In 2023, we plan to amplify our focus on festivals and events, starting with our first ever Spring Break at several of our parks this March and April, where traditional Spring Break gets a little bit spooky."
}