{
    "symbol": "GH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 22:52:02",
    "content": " We ended the third quarter with record revenue of $117 million, up 24% over the prior year quarter. Moving on to slide four, clinical test volume reached over 32,400 tests, up 42% compared to the prior year quarter. This increase was driven by year-over-year growth in both clinical and biopharma sample volumes as well as by improved reimbursement for new products, specifically TissueNext, which received Medicare coverage in early 2022 and Reveal, which received Meditech coverage for colorectal cancer midyear and recently received a rate increase from approximately $3,600 to just over $4,900. Third quarter clinical test volume was 32,400, an increase of 42% from the same period of the prior year and an increase of approximately 3,100 from the previous quarter. Precision oncology revenue from biopharma tests in the third quarter, totaled $24.2 million, up 35% from $17.9 million for the prior year quarter. Development services and other revenue in the third quarter totaled $15.4 million, down 1% from the prior year quarter. As we have previously noted, while we continue to see strong demand for our development services, we still expect that our 2022 development services and other revenue will continue to be lower than prior year with several companion diagnostic projects we successfully completed 2021 and new projects will take time to ramp up. Operating expenses for the third quarter of 2022 were $221.5 million, an increase of 29% compared to the $171.3 million in the third quarter of 2021. Non-GAAP operating expenses for the third quarter of 2022 were $200.5 million, a 48% increase from $135.1 million in the prior year quarter. While below our previous expectations we were pleased with both the 42% year-over-year volume growth and the sequential volume growth, we saw in the third quarter of 2022, which we view as a strong leading indicator of the trajectory of our business. At the midpoint of the range, $445 million, our revised guidance assumes full year biopharma volume growth of approximately 40%, compared to 2021 and full year development services and other revenue of approximately $55 million. While the reduction in our revenue expectation for the year is disappointing to us, we believe our core business is the strong as ever, demonstrated by the approximately 40% year-over-year volume growth of both our clinical and biopharma businesses despite the challenging backdrop throughout the year. And as Helmy mentioned, we're feeling really strong but the fundamentals of the business as we sort of go out of the 2022 and we've got 40% year-over-year volume growth in both clinical and biopharma."
}