{
    "symbol": "BGFV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 18:24:06",
    "content": " Although our fourth quarter merchandise margins declined by 129 basis points compared to the record margins in the prior year, our 2022 fourth quarter merchandise margins increased by over 300 basis points versus the pre-pandemic fourth quarter of 2019. As Steve mentioned, although, merchandise inventories for the fourth quarter this year decreased versus the fourth quarter of fiscal 2021, when compared to the pre-pandemic 2019 fourth quarter, merchandise margins increased 308 basis points, reflecting the evolution of our pricing and promotional strategy. Overall, selling and administrative expense increased $1.4 million in the fiscal 2022 fourth quarter versus the prior year period, primarily reflecting continued upward pressure on labor costs and other broad-based inflationary impacts, partially offset by lower performance based incentive accruals. As a percent of net sales, SG&A expense was 32.5% in the fiscal 2022 fourth quarter versus 27.9% in the 2021 fourth quarter, reflecting the deleveraging effect of increased expense on a lower sales base. Net income for fiscal 2022 was $26.1 million or $1.18 per diluted share, including a previously reported charge in the second quarter of $0.03 per diluted share. Our merchandise inventory at the end of fiscal 2022 increased 9.6% year-over-year, primarily reflecting more normalized inventory levels following the significant sell-through and supply chain challenges in the prior year. Our merchandise inventory at the end of fiscal 2022 was down 5.1% compared with the fourth quarter of fiscal â\u0080\u009819, reflecting the evolution of our model that allows us to now operate with less inventory as Steve mentioned. The decrease in our operating cash flow for fiscal 2022 compared to the prior year, primarily reflected lower earnings and increased funding of merchandise inventory in efforts to replenish depleted inventory levels resulting from strong consumer demand and supply chain challenges in fiscal 2021."
}