{
    "symbol": "GLBE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 10:52:05",
    "content": " Moving forward to our earnings, we are extremely proud to report that the final quarter of 2022, the results of which we are reporting to you today, was our strongest quarter ever and a fantastic finish to the fiscal year, bringing in a record $839 million in GMV, up 66% year-on-year, and generating revenues of close to $140 million, up 69% year-on-year. This, coupled with our continued efforts to realize operational cost synergies with Flow and Borderfree, resulted in an adjusted EBITDA margin of 15.6% or $21.8 million in Q4, well over the top of the outlook range. Finally, adjusted EBITDA for the full year was $48.7 million compared to $32.4 million last year, significantly over the top range of our outlook, and representative of our ability to generate profitable growth with strong free cash flows. As Ofer will elaborate on in just a few minutes' time, our guidance for 2023 represents this continued strong growth momentum, with roughly 40% annual growth expected in both GMV and revenues, well above the growth rates of the e-commerce market itself. As Amir mentioned, our rapid growth in GMV continued in Q4 as we generated $839 million of GMV, an increase of 66% year-over-year. In Q4, non-GAAP gross profit was $57.8 million, up 77% year-over-year, representing a gross margin of 41.3% compared to 39.5% in the same period last year, driven by the higher share of service fee revenues and the continued efforts to leverage our scale to further improve our efficiencies. Sales and marketing expense, excluding Shopify-related amortization expenses, stock-based compensation and acquisition-related intangibles amortization was $8 million or 5.7% of revenue compared to $6.7 million or $8.1 of revenue in the same period last year. Cash generation has accelerated with operating cash flow in the quarter at $60.7 million compared to an operating cash flow of $24 million a year ago, driven mainly by adjusted EBITDA growth and working capital dynamics."
}