{
    "symbol": "CRMT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-24 14:02:20",
    "content": " Thank you for holding, and welcome to America’s Car-Mart Fourth Fiscal Quarter 2022 Conference Call. The dial-in number and access information are included in last night’s press release, which can be found on America's Car-Mart website at www.car-mart.com. As you all know, some of the management's comments today may include forward-looking statements, which inherently involve risk and uncertainties that could cause actual results to differ materially from management's present view. For more information regarding forward-looking information, please see part one of the company's annual report on Form 10-K for the fiscal year ended April 30, 2021, and its current quarterly reports furnished to or filed with the Securities Exchange Commission on Forms 8-K and 10-Q. We have a number of significant initiatives in process that are allowing and will allow us to continue to grow into the future, better utilizing data, continuing to centralize certain functions, and leveraging our scale as we move forward. We're now serving over 95,000 customers, soon to be over 100,000 and growing from there, as we discussed in our press release. Revenues over $1.2 billion, return on equity for the year was 21%, and averaged 18% for the previous five years. And return on assets was 9.5%, with a previous five-year average of 9.2%. And looking back, since we started our consistent share repurchase program at the end of fiscal 2010, we’ve bought back over 6.8 million shares for $286 million, resulting in a 42% reduction in our fully diluted share count. So, in effect, almost all of the $400 million in our total debt net of cash is the result of our share buybacks, demonstrating the cumulative power of our focus on operating cash flows in this capital-intensive business. The cash-on-cash returns of our business are attractive, even with the term at 43 months, which is substantially less than competition. Second, acquisitions of well-operated dealership groups, generate similar returns for our shareholders, and provide an exit strategy for an owner-operator and future growth opportunities for their associates. We've developed a successful acquisition process, which works for everyone, and we're eager to speak with owners who share our values and commitment to associate and customer success. Over the last five years, we've grown our book value per outstanding share at a compounded 19% per year. Last year's fourth quarter included a significant impact - positive impact from the largest stimulus payment, which was disbursed in March of 2021. For comparison to pre-pandemic, the fourth quarter of fiscal year 2019 was 30.3 units per dealership. For the current quarter, net charge-offs as a percentage of average finance receivables was 5.6% compared to 4.8% in the prior year fourth quarter. Again, the prior year fourth quarter included stimulus payments, which also positively impacted collections and net charge-offs in the prior year. Net charge-offs were 5.6% for the quarter ended 4/31/20, and 6.4% for the quarter ended 4/30/19 pre-pandemic. However, we also believe that our investments in our customer experience area, our expanded service contracts, and our focus of keeping customers on the road, will keep us closer to the lower end of those historical ranges. The average originating contract term for the quarter was 42.1 months compared to 37.1 for the prior year, and up from 40.4 months sequentially. We're now serving over 95,000 customers, an increase of more than 7,000, and over 2,000 total associates. As an integrated sales and finance company, we also monitor SG&A as a percentage of total revenues, less cost of sales and provision for credit losses, as a large part of our efforts are focused on keeping customers in the family, and lowering credit losses. This percentage was 53.5% for the year ended 4/30/22, compared to 57.3% at 4/30/20 pre-pandemic, excluding the impact of the allowance change. At quarter end, our total revolving debt was approximately $45 million, and we had $6.9 million in total cash and approximately $198 million in additional availability under our revolving credit facilities, which was based on our borrowing base of receivables and inventory. As we previously announced, we also completed our inaugural securitization just prior to quarter end, with an initial $400 million in aggregate principle of asset-backed notes. During fiscal 2022, we added $292 million in receivables, increased inventory by $33 million, repurchased $35 million of our common stock, and funded $21 million in capital expenditures. We will continue to focus on cash-on-cash returns, a conservative balance sheet, and investing for the future of a growing business. In summary, we are pleased, but not at all content with sales volume productivity, even in light of the headwinds around higher car prices and consumer sentiment. While we would prefer an environment with lower used car prices, we continue to believe that we will not see any drastic wholesale price reductions for our product over the short-term. However, as we have stated, lower used vehicle prices would actually be good for our business over the longer-term. We are structurally in a much better place today, and we'll be able to capture market share as credit above us tightens up and more consumers move down into our market. I would like to reiterate that my earlier comments regarding forward-looking statements apply both to the participants’ prepared remarks, and to anything that may come up during the Q&A. So, it sounds like you have really strong demand, but we're hearing different things in different slices of the used car market, and certainly in retail. And Jeff, you just kind of alluded to credit tightening and maybe pushing consumers down into your slice of the used car market. Yes, we are seeing good solid demand, especially with the higher credit type customer, but at the same time, we're seeing some challenges with volumes from an affordability standpoint. So, we do expect, as car prices level off, or maybe even come down just a little bit, that affordability may be less of a factor for us, allowing us to pick up even more volumes. But we are seeing good solid demand from good credit risk customers, and we expect that to continue and hopefully get some relief and have more room at those lower price points as we move forward. And then to follow up on that, I mean, if we look at your average selling price over the last two years, it's gone from around about $12,000. I mean, you're not expecting a big fade in the near-term, because that's a big step up. So, the 50% sales price increase is something that everybody's having to deal with, and we're certainly having to extend the term to keep those payments affordable, but payments have gone up. We're dealing with that as best we can, and we feel like we're in a better position than anyone to keep those customers on the road, keep those cars in good shape, serve our customer base at a high level. But as we've discussed, we expect returns to be at or above historical levels as we go forward with all the improvements we've made to the business. And then just lastly, there's inflation in costs, particularly around labor, which curious how you're dealing with that directly. And we - it's a continuous process for us to make sure that our wages and benefit packages are competitive in our markets, and we've made adjustments and we'll continue to make adjustments to stay competitive and retain our very best associates. Jeff mentioned several of our systems that we're implementing, again, just to better efficiently use our data, our associates to be more efficient. And for us, it's all about continuing to gain market share, serve more customers, sell more cars, and increase that productivity to offset the effective inflation. Jeff, you make the point that lower prices are actually good for your business in the longer term. It's an eight-year-old car, and the demand for that car, a mechanically sound car that's going to last beyond the contract terms, we don't see that value decreasing any time in the near to midterm. Again, we don't expect that to happen, but if it does, there might be a short-term negative, but the positives on the other side would be much more and greater than the negatives on the front end in terms of affordability, more consumers qualifying for a contract with us and overall serving more customers. Well, if you just go back and look at the range that end up with those averages, with the improvements we've made to the business, centralization efforts, we're just more better structurally than we've ever been on the support side. So, there's a lot of unknowns in terms of what normal credit losses are going to look like. I'm trying to gauge if that number stays flat, comes down, or it improves\n A big piece of that will depend on the market and the used car prices."
}