{
    "symbol": "CRMT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-17 16:18:05",
    "content": " Your line is open. Your line is open. But for right now, up to this point, it’s been pretty tough to find those lower price point cars that are mechanically sound and something that we would want to put our valuable – valued customers in. Your line is open. Your line is open. And so we’ve, over the last 1.5 years, 2 years, had a good focus, a big focus on keeping customers in the family for life and providing them with a car and terms that would be in line with a much better than what they are going to get down the Street. As far as percentages that apply to each of these buckets, don’t really have anything specific for you there, but we are still well below competition on our term lengths, and we think we have even a little more term to give for the right customers and the right cars as we go forward and can do quite well in those areas. I think that a way to answer that is, I don’t know what our business would look like today had we not decided that better cars for better customers with affordable payments that match up to the competition would be something that make sense for us short-term and long-term. I just – it’s the business – if you went back to 2013, ‘14 time frame and the competition was increasing and it wasn’t priced in necessarily, but the America’s Car-Mart of that day would have probably take a little bit more of a walk away from some of the business approach. Is your buyback – I mean, it’s weird because like you buy back – like you bought back more than $145 million, a little less, I think, at $125 million and even less at whatever this is going to end up being like $100 million or something. And so my nitpick on that would be like when the stock is at $180 million and like you are clearly over-earning in the short-term because of used car prices, I don’t know, maybe reorient how you think about the share buybacks. Your line is open."
}