{
    "symbol": "GMED",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 20:05:30",
    "content": " We achieved record sales, while maintaining industry leading profitability generating a record $2.06 in non-GAAP EPS and an adjusted EBITDA of 33% even as we continue to invest heavily in INR, trauma, competitive recruiting and absorb significant currency headwinds. Enabling technology sales were $30 million, up 20% on a constant currency basis versus prior year, driven by robotic and imaging system sales. Full-year 2022 revenue was $1.023 billion, growing 6.8% as reported and 8.2% on a constant currency basis with the same number of selling days in 2022 and 2021. U.S. revenue in the fourth quarter of 2022 was $233.2 million, growing 9.5% as reported compared to the prior year quarter, led by growth in U.S. spine, biologics and trauma. International revenue for the fourth quarter was $41.3 million, growing 11.4% as reported and 24.2% on a constant currency basis, driven by increased INR and implant sales. Research and development expenses in Q4 were $19.5 million or 7.1% of sales, compared to $51 million or 20.4% of sales in the prior year quarter. Our full-year 2022 research and development expenses were $73 million or 7.1% of sales, compared to $97.3 million or 10.2% of sales in the prior year. Adjusting for acquisitions made in both periods, R&D expenses in 2022 were $72.9 million or 7.1% of sales, compared to $63 million or 6.6% of sales in the prior year. SG&A expenses in the fourth quarter were $118.1 million or 43% of sales, compared to $106.6 million or 42.6% of sales in the prior year quarter. Full-year SG&A expenses were $432.1 million or 42.2% of sales, compared to $408.1 million or 42.6% of sales. On a normalized basis, non-GAAP EPS in the fourth quarter was $0.55, compared to $0.49 in the prior year quarter, growing 12.2%, driven primarily by sales volume growth, as mentioned earlier. Our full-year 2022 non-GAAP EPS is inclusive of $0.14 of non-operating items, which includes unfavorable currency impacts worth $0.11, a higher tax rate worth $0.10, partially offset by higher interest and other income worth $0.05 and a lower share count worth $0.02. We are projecting full year 2023 sales guidance of $1.1 billion, representing 7.5% growth versus 2022. We are guiding to a full-year fully diluted non-GAAP earnings per share of $2.30, representing 11.7% growth versus 2022. Hi, thanks for taking the question. Thanks for the question. Thanks for the question. Thanks for the question. Hi, thanks for taking the question. Thanks for the question."
}