{
    "symbol": "FAZE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 19:06:06",
    "content": " Additionally, before getting started, please be advised that due to a technical error, the company reposted its 2022 shareholder letter to the Investor Relations site at approximately 5 p.m. Eastern Time. I would now like to introduce your host for today's conference, Kyron Johnson, General Counsel. With me today are Lee Trink, Chief Executive Officer; and Christoph Pachler, Chief Financial Officer. Before we begin, I want to remind you that comments made by management during this call will include forward-looking statements within the meaning of federal securities laws. These include statements of FaZe Holdings financial outlook, the company's plans and timing for product development and sales, and any other statements besides the historical fact. For a discussion of risk factors and uncertainties that may affect our performance or cause actual results to differ materially from these statements, please review the most recent SEC filings which are available on our website at fazeclan.com. In addition, during this call, we may discuss certain non-GAAP financial measures. Additional information regarding these non-GAAP measures, including reconciliations of these measures to the most directly comparable GAAP measures is contained in our shareholder letter and also available on our website at fazeclan.com. The content of this conference call contains time sensitive information, accurate only as of the date of this broadcast. Except as required by law, FaZe Holdings undertakes no obligation to revise or otherwise update any statement to reflect events or circumstances after the date of this call. With that, I am pleased to turn over the call to our CEO, Lee Trink. I'd like to strongly encourage everyone to read the shareholder letter we posted on our Investor Relations website, which includes a full update on state of the business and the opportunities we see ahead of us. On the call today, I'd like to highlight our financial results, and discuss our strategic priorities for 2023 before turning the call over to our CFO, Christoph to review the financials in more detail. First, I am proud to announce that we achieved revenue of $70 million, hitting our target for the year. Despite a challenging market environment, particularly since our public listing in July, we've secured new brand partners, welcome new talent to our roster, and expanded our network to reach over half a billion people worldwide. Looking at our most recent partnerships with Porsche and Nike, you can see why we are confident about what we can achieve. With Nike, in particular, we've previously had other opportunities in the category, but we remain patient for the right deal. So we see great things ahead, but we also know we're operating in a difficult near-term environment. I am happy to report that we're making significant progress, and we continue to look for cost savings in the business. For the coming year, we are diligently focused on our core revenue drivers, sponsorships, talent, and esports. Speaking of esports, our Counter Strike Team just had an historic weekend, bringing home FaZe Clans 38th championship and becoming the first ever international roster to win the Intel Grand Slam. We're committed to FaZe's success and are implementing a strategy that we believe will boost growth this year, considerably reduce our losses, and put things in a stronger position to succeed as a business and as the economy improves. As demonstrated by our blue chip partners and exceptional talent, we believe the FaZe brand has tremendous value and potential. We are a unique brand that sits at the nexus of Gen Z, and the size of changes in the consumption of both content and products that this digitally native generation is driving. As Lee mentioned, we reported 2022 full year revenue of $70 million, which aligns with our plan for the year. Revenue was primarily driven by brand partnerships, which has been our key operational focus throughout the year. Our revenue portfolio from brand partnerships is diverse, has high margin, and includes such stellar household names as Porsche, McDonald's, XFINITY Comcast, DoorDash, Ghost Energy Drink, MoonPay and others, as well as a recently launched program with Nike. Our 2022 adjusted EBITDA loss of $33.6 million includes significant ongoing public company compliance expenses, and a higher headcount for the year. As we discussed during our previous earnings call, in late 2022, we also exited capital intensive initiatives in the content space that did not generate sufficient returns, which will further help reduce our cost basis going forward. We ended the year with $37.8 million in cash, confidently held in one of America's biggest banks. While we are not providing guidance for 2023 in light of the macro economic uncertainty, we are planning for revenue growth and a significant narrowing of our adjusted EBITDA loss following the cost reductions we have implemented. In closing, we believe we have done a lot of hard work over the past several months to position FaZe for success. There is much more to do, our management team and Board are committed to seeing this work through and to delivering results for ourselves and our shareholders. With that, we'd like to open the call for questions. To answer your second question, typically our sponsorship deals are a year or longer. Historically, we've kept them to that length, because the value increases kind of year-on-year. But in regard to 2023, we've demonstrated the ability to continue growing our partner list year-after-year. Over the years, we've moved from gaming endemic brands to iconic globally recognized brands like, as Christoph mentioned, McDonald's, Porsche and Nike. I'd note that in 2022, we had 15 significant brand partnerships, which is up from 12 significant partnerships the year before, and we've got a robust pipeline of both new deals and renewals. That being said, what I'll note about the two partnerships that you highlight is, while the revenue we put in our significant buckets, those two partnerships, in particular, have opened a lot of other doors and have enhanced the standing of FaZe's brand. And at this time, I'd like to turn things back to Lee Trink, for any closing remarks. Well, thank you, again, everyone, for participating and for your interest in FaZe."
}