{
    "symbol": "FAZE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 16:48:07",
    "content": " At this time, I would like to welcome everyone to the FaZe Holdings Inc. Third Quarter 2022 Earnings Conference Call. These include statements of FaZe Holdings' financial outlook, the company's plans and timing for product development and sales and any other statements other than statements of historical fact. For a discussion of risk factors and uncertainties that may affect our performance or cause actual results to differ materially from these statements, I encourage you to review our most recent SEC filings, which are available on our website at fazeclan.com. Additional information regarding these non-GAAP measures, including reconciliations of these measures to the most directly comparable GAAP measures, is contained in our third quarter earnings release, which is also available on our website at fazeclan.com. Except as required by law, FaZe Holdings undertakes no obligation to revise or otherwise update any statements to reflect events or circumstances after the date of this call. While we hosted a short call covering highlights of the second quarter just after our public listing, today's call is our first full quarter call as FaZe Holdings. I'm excited to introduce our new CFO, Christoph Pachler, to the FaZe team and to the call today. Our third quarter revenue totaled $14 million, up 12% year-over-year, driven by increased revenue from brand sponsorships, content and esports. Historically, FaZe's revenue trajectory builds heading into the fourth quarter, and our pace of business activity, particularly in the sponsorship category, indicates that, that will be the case again this year. While the timing of deal signings and revenue recognition can be lumpy in our business, our current expectations are that we'll achieve revenue for 2022, in line with projections provided in our go public filings. Since our last call in mid-August, we've announced several exciting partnerships, including a renewal with McDonald's, a new sponsorship deal with Comcast's Xfinity broadband service and our new metaverse partnership with The Sandbox, all of which will benefit future results. Christoph will have more in a moment, but the headline is we've already executed on more than $7 million in annualized savings that will benefit our results beginning in 2023. It's been an eventful first few months as a public company, more eventful than we imagined, for both FaZe and our industry overall. As the first public company focused on Gen Z and purpose-built for the creative economy, we have generated tremendous opportunities from both inside and outside our industry. Through our deep connection with Gen Z and our strong relationships and understanding with this new generation of talent, we are well positioned to capture more audience attention and revenue as the current trends continue to tilt in our direction. Our brand, our expansive reach and our expertise position us to be an incubator and an accelerator for talent, giving them the tools and resources to create and actualize their business goals. So effectively, we believe the best way to think about FaZe's future is that we've spent 12 years building a powerful brand, the singular position. As we disclosed today in an 8-K, these moves include our Chief Strategy Officer, Kai Henry, an important contributor over the past 2 years, will now be partnering with us from outside the organization on a number of key business initiatives. You'll be hearing more and seeing some key business developments in the coming weeks and months, including our early plans for bringing the gaming generation into Web3. As Lee noted, I've built and managed entertainment industry businesses for a number of years, and the opportunity to help build what could be one of the most innovative brands for the next generation is what convinced me to join FaZe. The $7 million in annualized savings already achieved is a combination of a targeted reorganization and the reduction in spending on original content, both in alignment with our talent-focused strategy. Quarterly revenue performance was led by brand sponsorships, content and esports. Our largest revenue category, brand sponsorships, grew 8% as our sales and talent teams brought in new and larger brand sponsorships. Content revenue increased 20%, though this benefited from a large sale of an exclusive license to certain historical content, offset in part by content revenue earned on YouTube as we pulled back on previously greenlit higher-cost content products in favor of lower-cost, smaller content releases, in line with our content strategy that centers around the next generation of digital creators. Esports revenue was up 177% year-over-year due to higher price winnings from strong team performances, increased league participation and . Adjusted EBITDA loss of $12 million was up significantly year-over-year, reflecting, in large part, higher general and administrative expenses. Higher G&A was primarily a function of increased headcount to support the go public transaction, nonrecurring professional service fees, including those associated with the SPAC merger and new public company and other overhead expenses. I would note that a little more than half of our year-to-date adjusted EBITDA loss of $22.4 million was incurred in the third quarter, reflecting the transaction and public company scale-up costs as just noted. Total reach, which represents the aggregate number of user accounts or fans that subscribe to or follow FaZe content across key social platforms totaled approximately 526 million at the end of Q3, up from approximately 358 million at the same date a year ago. Aggregate YouTube subscribers, which is the number of subscribers our talent network has on their FaZe-branded YouTube channels, our own YouTube channel and FaZe-affiliated channels, totaled approximately 137 million at the end of Q3, up from about 115 million at the same time a year ago, with the increase driven by our co-branded and affiliate channels. As we look ahead, we have a solid pipeline of potential new opportunities that could drive future revenue growth and cash flows, but I want to caution that the nature of our business can cause timing to be lumpy both in terms of when we announce deals and when they hit the P&L. We expect to begin sharing more on our financial and business outlook beginning with our year-end call, which will be in March of next year. Ladies and gentlemen, that will conclude today's FaZe Holdings Inc. Third Quarter 2022 Earnings Conference Call."
}