{
    "symbol": "CRI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-30 09:18:06",
    "content": " Our third quarter sales were over $800 million, our largest quarterly sales so far this year, but about 5% lower than we expected. eCommerce penetration in the third quarter was about 35% of our retail sales, a couple of points lower than last year. Our exclusive brands continue to be the strongest component of our Wholesale segment, with sales growth up 5% in the third quarter and up 10% year-to-date. For the year, we expect wholesale sales may be down about 7%, which reflects lower replenishment trends and the risk of shipping delays and order cancellations in the fourth quarter. Our U.S. and Canadian Retail businesses represented the majority of our sales decline versus last year, a result of lower consumer demand throughout the quarter. Inventories were about $20 million or 2% higher than we had forecasted, largely a result of lower wholesale sales in the quarter, and I'll speak more about inventory in a moment. Our inventory at the end of the third quarter was $899 million, up 24% versus this time last year and, as I said, slightly above where we had planned to be. Collectively, sales of our exclusive Carter's brands grew 5% in the third quarter and, as Mike said, were up 10% year-to-date through the third quarter. We now expect fourth quarter net sales in the range of $845 million to $885 million, which assumes U.S. Retail comps down in the range of 10% to 15% and lower U.S. Wholesale sales, reflecting the risk of lower demand and supply chain delays. If we're successful with our fourth quarter plan, full year 2022 net sales would be in the range of roughly $3.1 billion to $3.2 billion, adjusted operating income in the range of $355 million to $385 million and adjusted EPS in the range of $6.05 to $6.65. If you recall, last year, we moved about -- it was probably because of supply chain delays, about $70 million of wholesale demand moved from the third quarter into the fourth quarter last year. I think one of the things we're looking at is, I think as people are buying closer to need, we're hoping what's happening is maybe the holiday shopping period is becoming a little bit more like it was a few years ago versus last year."
}