{
    "symbol": "FTNT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 21:28:05",
    "content": " Revenue of $1.15 billion was another quarterly record for Fortinet, increasing 33% year-over-year and 12% sequentially; our highest third quarter sequential growth rate in eleven years. Perhaps for context, we should note at the midpoint, these full year billings and revenue growth rates are 3 points higher than the initial growth rates we provided in early February, despite the start of the war in Ukraine in late February, significant increases in interest rates and increasing uncertainty in the macro environment, and importantly, full year backlog is expected to be above the February estimate of $350 million. In terms of other unique things about product revenue in the quarter, I mean, I think that as the backlog comes into revenue as we go through the end of 2022 here and certainly into 2023 is tend to provide, again, a fairly significant tailwind to what the product revenue growth will be in 2023, assuming we get the drawn in backlog that we may see. So thatâ\u0080\u0099s where also â\u0080\u0093 when the growth slowed down and sometimes the service revenue has a higher margin, which can also help in the margin, but we do expect the growth will continue in the next few years with the three growth drivers I mentioned and plus additional service revenue to our big installation base, a lot of are not quite unable the security service revenue yet. And as we heard in the question earlier from one of the questions, at the beginning of year, what kind of a swag â\u0080\u0093 that kind of swag backlog growth of $350 million in the first quarter and then it came back and said, in the second quarter, maybe itâ\u0080\u0099s going to get closer to $500 million for the full year. And I think that one of the things that we did at the end of the prepared remarks was, we went back to the 2022 mid-term guidance numbers that we gave, I think, a $10 billion booking company in 2025 and $8 million in revenue and margins of 25% or more and basically reiterated that. Keith, I wanted to start to appreciate that you gave a little bit of color on 2023 on services growth acceleration, obviously, an exciting catalyst I think the flip side of that is weâ\u0080\u0099re just kind of really unsure how to think about puts and takes to the other line item on product revenue growth. So thatâ\u0080\u0099s where probably weâ\u0080\u0099re not kind of looking at refresh, replacing some of the old network security device, but itâ\u0080\u0099s more in the new area we see will be â\u0080\u0093 drive the growth for a very long time in the next 5 years to 10 years."
}