{
    "symbol": "USDP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 18:44:09",
    "content": " Beginning of the second quarter, we closed the acquisition of the Hardisty South Terminal from our sponsor, as well as simplify the partnership's financial structure by eliminating its IDRs. The partnership's combined Hardisty terminal now has a design takeaway capacity of 3.5 unit trains per day, or approximately 262,500 barrels per day is well positioned to benefit from the potential future growth associated with the first DRU program. As Dan mentioned, the acquisition of the Hardisty South Terminal, increases the size scale and growth capacity of the partnership's asset base, while optimizing operational and commercial synergies with the Hardisty terminal in order to capitalize on the growth benefits associated with our sponsor's DRU program. The partnership experienced lower operating costs during the second quarter of 2022, as compared to the second quarter of 2021, primarily attributable to a decrease in SG&A costs associated with the Hardisty South entities, as well as a decrease in the pipeline fee expenses. The second quarter 2021, SG&A cost includes services fee paid by Hardisty sale to our sponsor related to a services agreement that was in place prior to the partnership's acquisition of Hardisty South. Given current and expected market conditions, the partnership's estimates for future heavy crude oil production in Western Canada and the current availability of egress targets management believes that the partnership will have the opportunity to renew and extend or replace the agreements that recently expired, during the second half of this year or early in 2023. The partnership's Board determined to keep the distribution unchanged from the prior quarter, and to evaluate the distribution on a quarterly basis going forward and we'll take into consideration, updated commercial progress including the partnership's ability to renew, extend or replace existing customer agreements at the Hardisty and Stroud terminals as well as recent changes to the market."
}