{
    "symbol": "USDP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 19:31:04",
    "content": " We believe that the Western Canadian crude oil markets will be in what we call rail parity when incentives support the use of rail egress solutions at some point in the first half of 2023, which should benefit our existing DRUbit by rail network, which of course includes the partnerships Hardisty Terminals. As a brief reminder, because our acquisition of Hardisty South, which occurred in the second quarter of 2022, represented a business combination between entities under common control, the Partnership's financial statements had been retrospectively recast to include the pre-acquisition results of the Hardisty South Terminal. Partnership's board determined to keep the distribution unchanged from the prior quarter, and to evaluate the distribution on a quarterly basis going forward and will take into consideration updated commercial progress, including the Partnership's ability to renew, extend or replace its customer agreements at the Hardisty and Stroud terminals, current market condition and management's expectations regarding future performance. So as we've made no bones about it, our plan is to convert all of the -- all of our Hardisty assets to a DRUbit format and be able to bring all of that over long term, which obviously takes the underlying rail assets of the partnership and extends it at similar levels. And the $18 at -- $18 to $20 at Hardisty versus the 0 to 2 at the U.S. Gulf Coast indicates a difference somewhere between $15 and $18, which the marketplace is effectively saying through their actions that we think we're going to be a crude by rail parity starting in the second quarter of 2023. And so, as we discuss and negotiate with Dilbit customers, we're open and honest with them, look, you may not have Dilbit capacity remaining at either Hardisty or Stroud, as it relates to, because we're going to convert that into DRUbit and longer term and more sustainable and more profitable business for both the partnership and USCG and Gibson for that matter. But just as we've done historically, it's been a positive dollar base commercial agreement and term, obviously with the partnerships assets. Our customers have product that needs to move, growth initiatives from them, look at what's happening in Canada, today, we have the bigger ones getting bigger for the most part, consolidating, so every new barrel growth are going to take some synergistic benefits, obviously, of combining those activities, but they're doing that because they have a growth model and plan. It's with over 22 million barrels moved, you wouldn't have customers like we have, looking at that strategic alternative, to better control their growth, and where their production is going to head and why they're going to do it."
}