{
    "symbol": "HIPO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 23:21:04",
    "content": " Leading today's discussions will be Hippo's Chief Executive Officer and President, Rick McCathron and Chief Financial Officer, Stewart Ellis. Following management's prepared remarks, we will open up the call to questions. Before we begin, I'd like to remind you that our discussion will contain predictions, expectations, forward-looking statements, and other information about our business that are based on management's current expectations as of the date of this presentation. Forward-looking statements include, but are not limited to Hippo's expectations or predictions of financial and business performance and conditions in competitive and industry outlook. Forward-looking statements are subject to risks, uncertainties and other factors that could cause our actual results to differ materially from historical results and/or from our forecasts, including both set forth in Hippo's Form 8-K filed today. For more information, please refer to the risks uncertainties and other factors discussed in Hippo's SEC filings in particular in the sections entitled Risk Factors. Do not place undue reliance on forward-looking statements as Hippo is under no obligation and expressly disclaims any responsibility for updating, altering or otherwise revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. During this conference call, we will also refer to non-GAAP financial measures - such as total generated premium and adjusted EBITDA. Our GAAP results and description of our non-GAAP financial measures with a full reconciliation of - to GAAP can be found in the third quarter 2022 shareholder letter, which has been furnished to the SEC and available on our website. Despite this year's challenges from inflation, supply chain dislocation, and one of the worst hurricane losses in history. In Hippo, we strive to help our customers enjoy the homes through enhanced home protection and services. This quarter, I'm proud of Hippo's response to the tragedy of Hurricane Ian. Our customer base reached 332,000 by quarter's end. Our Hippo blended premium retention across both Hippo policies, and agency customers was 90% in the quarter, up from 89% in Q2. Despite some slowdowns in housing markets, we expect the attractiveness of our model for distribution partnerships will lead to new relationships and continued strong growth. We also increase the geographical diversification of our portfolio with growth in the states where we have entered over the past year, including New York, North Carolina and Massachusetts. We're having great success in attracting our target customers, a group we call generation better, which we estimate to account for a third of all U.S. homeowners. Through a, targeted marketing efforts in Q3, 2022, we estimate that over 75% of our new business was generation better customers. With this cohort, we expect higher consumer retention, better loss ratios, and an opportunity to cross-sell as we expand our offering of home care services. Excluding the impact of Hurricane Ian, our gross loss ratio in Q3 was 58%, and improvement of 70 percentage points from Q3 last year, despite challenging market conditions, where inflationary pressures have dampened results across the industry. I wanted to note that the net losses to Hippo at a consolidated level from this event were only $4.7 million and of that only 900,000 related to Hippo's homeowners programs. Second, our Hippo homeowners business in Florida is exclusively through our builders program, new home construction with the latest in design and technology and craftsmanship better able to withstand nature's fury. Hippo's third quarter adjusted EBITDA loss was $54.8 million, including $4.7 million of losses related to Hurricane Ian. When we reported our 2Q 2022 adjusted EBITDA loss of $55.8 million, we said, we expected Q3, 2022 to be our peak loss quarter. Because revenue growth and underlying gross loss ratio improvements are accelerating, and that the expense reduction actions we've taken are beginning to have their intended effect. Barring unusual whether we expect our Q4, 2022 adjusted EBITDA loss will be below $50 million with continued improvements thereafter. In the fourth quarter, we expect to launch our Book a Pro feature for Texas customers via our mobile app. We aim to aggressively scale these capabilities across more locations, services and providers as part of our goal of becoming our customers' go-to-destination for home care. We're very proud of what we have achieved this quarter, and of the business we're building. As Rick mentioned, our third quarter EBITDA loss was $54.8 million, which includes $4.7 million of losses and related expenses that are directly the result of Hurricane Ian. As we indicated at our Investor Day in September, we expect improving adjusted EBITDA results going forward, continuing in the fourth quarter and into 2023 with profitability achieved by late 2024. In the third quarter, we had robust growth across our segments and geographies, while also substantially improving our loss ratio. Our builder business is thriving, accounting for 26% of total Hippo and agency premiums in the quarter, and nearly half of our new business. The builder channel remains a highlight of our portfolio, generating agency fees and attractive loss ratios with new homes that are frequently constructed with home monitoring sensors and other safety equipment as standard options. As Rick mentioned, our customer base continues to grow, reaching 332,000 customers during the quarter. Demand for our products and services remain strong and customer retention has continued to improve with Hippo blended premium retention across both Hippo policies and agency customers coming in at 90% in the quarter, up from 89% in Q2. In our historically largest markets like Texas and California, we also saw growth, but with a careful eye towards geographic balance within those states. Spinnakerâ\u0080\u0099s fronting business represented $83 million of non-Hippo TGP in Q3, up from $49 million in the year ago quarter. All of these factors supported our revenue reaching $30.7 million in the quarter, which was up 44% from Q3 last year, and an acceleration of our growth relative to Q2. As Rick mentioned earlier, excluding the impact of Hurricane Ian our Q3 gross loss ratio would have been at best ever at 58%. Reserves developed favorably again in the quarter, benefitting the loss ratio by 18 percentage points, including eight percentage points from non-PCS events, and 10 percentage points from previous period PCS CAT events. At a consolidated level Ian was a $73.1 million gross and $4.7 million net loss event representing 52 percentage points of gross loss ratio, and 44 percentage points of net loss ratio. Importantly, though, of the gross losses, only $7 million or five percentage points of gross loss ratio related to the Hippo Homeowners program. The remaining $66 million of gross losses related to other programs supported by Spinnaker, of which $40 million relates to programs that we've previously placed into run-off back in the spring of this year. The net impact Ian from homes covered by Hippo policies was only $900,000 or nine percentage points of net loss ratio. Even with the full impact of Hurricane Ian at a consolidated level, we are comfortable maintaining our full year gross loss ratio guidance of 90% or less. General and administrative expenses were $19 million versus the prior year quarter's $13.4 million, with stock-based compensation expense representing $3.1 million of the increase year-over-year. Our unrestricted cash and investments as of September 30, 2022 were $677 million. At the end of the quarter, Spinnakerâ\u0080\u0099s policyholder surplus was $132 million. Net loss attributable to Hippo was $129.2 million or $5.66 per share, compared to a loss of $30.9 million or $2 per share in the prior year quarter. Most significantly, we wrote off a remaining goodwill asset of $53.5 million in the quarter and we had a one-time earning charge of $1.8 million related to our cost reduction actions. We expect our gross loss ratio will be below 90%, including the effect of Hurricane Ian. We expect our 2022 full year adjusted EBITDA loss to be between $197 million and $203 million, with further improvement in 2023, before turning positive at the end of 2024. Your line is now open. Just a question regarding Ian and two part question, basically as a young homeowner insurer - what do you - I mean, how do you think you've fared from a customer's point of view that's the first part. First of all, we were very proactive on identifying customers that were within path, having direct conversations with those customers prior to the hurricane happening and then an immediate follow-up of those customers to identify any prospective damage. The feedback that we've gotten, we shared a few testimonials and the material had been nothing but positive and I think our team stepped up to make sure that we fulfilled the promise that we would make when somebody took out a new business policy. The other aspect that I think is really important is I do think this demonstrates the discipline we have from an underwriting perspective on how we enter markets, and what product we offer. And I think when you look at all of the information coming out showing that the new construction, homeowners policies at current codes, more reinforced building really resulted in a positive and a positive way for us. So absent the favorable development, it would have been 70 percentage points or 70% loss ratio. I think the last quarter would also have included favorable development, we've had favorable development in each of the quarter's this year, if you adjust for the favorable development in prior quarters, I do think it is a meaningful improvement, especially year-over-year, it's a substantial improvement as each of our quarter's have been in 2021 versus 2021, excuse me. And if you look at our stock, in particular, over the past few quarters, it's trading below our cash balance. And so that was an indication that we should assess the goodwill and we looked at a number of factors, but that was a fairly important one and overall concluded that given that that the market value of the company is trading below our cash balance, it's hard to justify not taking some action to write it down. I think at the Investor Day, you had talked about the Book a Pro app, and at the time, you'd left it open the economics of it open a little bit. Yes, I think it's important. I think it's important to recognize sort of our philosophical thoughts, in Hippo related to a product market fit. We generally when we launch a program or we're contemplating launching a program, it's very important for us to optimize for the customer, what they deem important, do testing on what they feel that that would - what they would be willing to pay for any type of product. What we want to avoid when we launch something that is so new, like this feature that from our perspective doesn't really exist, the idea of what value we can bring to that customer. But that's something from our perspective that comes later, once we know exactly what the customer wants, that we're fulfilling those needs, and that we've met the promise of helping them protect the joy of homeownership. Yaron by the way, that's one of the reasons why on Investor Day, we did not put a meaningful number related to how we're going to monetize that over time. Your line is now open. I think if you look at traditionally, how insurance companies adjust for inflation, in building cost replacements coverage, a replacement, there's usually some arbitrary inflation guard. From the beginning of Hippo's of Hippo's offering, we re-underwrite every single policy at every single renewal. So if in fact, we see 20% inflation as an example, and the building, we were covering the home, we were covering coverage area was $400,000. So from our perspective, we believe that we get exposure increase and rate increase at the policy level at every single renewal, which dramatically reduces any uncertainty on what inflation trends are, if we've missed it, and we're a little bit high. We'll adjust that it next renewal, if we missed it, and we're a little bit low, we'll adjust that at next renewal at the policy level. Yes and Mike, this is Stewart, with respect to this reserve release, you know, we're constantly looking at the development curves for the claims that we've received, that we've paid, the IBNR associated with those. So it's not our intent to over reserve, but we have been getting better operationally, as we've matured as an organization. And in certain circumstances, some of the reserves from 2021, related to very large events that we've been able to look at the experience curve since then, and we believe that the reserves are not bringing us or the - release is not bringing us to a level of reserve, that is any different than what we've had at each of the past quarters in terms of adequacy for future development. I think, if you consider our early stage in that channel, the opportunities of new builds, even at a depressed level, we think we're just at the tip of the iceberg with the partners that we have in this particular space. So even if a given partner might be reducing the amount of housing starts that they have, we think that there's still massive upside in our funnel and conversations we're having to bring more partners in that area. And outside the builder channel, we're still seeing I think we're a small enough share in the market where, you know, general, mortgage rate increases and other things have not yet materialized, has meaningful impact as we think about growth. And keep in mind, our target customer, the generation better customers I was referring to, these are customers that we believe are looking for a partner to protect their home, and they haven't found it in the industry. And we are - finding those customers, they've identified us as that partner. These are people that switch at renewal, and we're seeing a significant number of our generation better customers as switchers, not just people that have newly moved into a house. Your line is now open. And I think everybody should be aware that the reinsurance market is hardening in a pretty significant way, both on a quota share perspective, and an XOL perspective. So I think what we're finding is, there's likely going to be a pretty significant shift industry-wide as it relates to demand and capacity within the reinsurance space. When we generally create our performance looking forward, such as the one that we that we displayed during our Investor Day, we take an approach that we think is a likely outcome, not an aggressive one. So from our perspective, I think we're well positioned given the improvement in loss ratio given the fact that we have multiyear capacity. And we do have segments of our business that are performing exceptionally well like the builders business, which is something that reinsurers are very interested in participating on. So I think it's still a little early to tell, given the hardening of the retro market as well. Yes, I think if you're talking about from us specifically, I think the answer is no, Ian was not a significant event on the Hippo program. If you're thinking industry wide, I actually think our performance in Ian in cap prone areas with new construction does motivate reinsurers to ask the question, where do we want to put our capacity and is that - does Hippo have a unique proposition. And I think you can see example after example, of neighborhoods that have a new construction that had very little damaged versus next door, the neighborhood that might be 10 or 15 or 20 years old, that had massive damage. So I think industry wide there may be a bit of a headwind there, but from us, I'm actually looking at it as a tailwind. Your line is now open. I think, I'll say a couple things about sales and marketing. If our customer wants to buy through an independent agent, or through, a partner of ours we'll sell through those channels. And if a customer's buying a brand new home, we make that very easy by embedding insurance in those transactions. And we didn't really want to sell aggressively into states where we hadn't yet gotten rate adequacy or, obviously not possible to sell until we're approved in new states. And so as we've gotten rate adequacy in more of our existing states and as we've been able to roll out new states where we feel like we are adequately priced, it gives us a broader geographic area to spend our marketing dollars. With the builder channel, obviously, that's a partner based channel, I don't think it directly impacts the decisions we would make in terms of how to spend either brand oriented dollars or user acquisition dollars in the direct channel. And so our omni-channel approach creates that discipline, if we believe any particular type of customer acquisition is outside our comfort zone or thresholds, we just discontinue that until it gets within our threshold where we are not in the business of buying business. We're in the business of acquiring business that we think has a very positive LTV, whether that's through a builder, whether that's through an agent, whether that's direct to consumer or through some other form of partnership. So I think as we as we roll out more broadly, in the builder universe, you'll see a rising percentage that are more on a leafy model, but at the moment, it's mostly just joint venture. Your line is now open. $600 million sorry, you've got $600 million in the bank, and you're talking about profitability at the end of two years. And, you know, it's like the guy jumping off the skyscraper, everything's good so far, you know, till he hits the ground. Please, just don't think that that $600 million cushion is gives you the right to have extra fat. I do think I'll reiterate something that that I said at Investor Day, because we fundamentally agree with you. And so one of the things that I said specifically on Investor Day is it is our intention to be good stewards of the capital to continue to grow the business to get cash flow positive, without the need to raise outside dollars barring any completely unforeseen circumstance."
}