{
    "symbol": "PFS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 19:28:06",
    "content": " Our commercial lending group continues to be very active and in the first quarter, we closed approximately $502 million of new loans, a 61% increase from the same quarter last year. Given the unfavorable conditions in the financial markets, Beacon Trust experienced a decline in the market value of assets under management, and as a result, the income decreased $376,000 or 4.8% for the quarter as compared to the trailing quarter. Income recognized from PPP loan forgiveness fell $700,000 versus the trailing quarter to $1.1 million, and remaining deferred PPP fees totaled $354,000 at March 31. Excluding the impact of PPP loans and purchase accounting adjustments, the core net interest margin increased 11 basis points in the trailing quarter to 2.95%. The pull-through adjusted loan pipeline at March 31 increased $134 million from the trailing quarter to $810 million, while the pipeline rate increased 55 basis points since last quarter to 4.15%. Excluding PPP loans, period-end commercial loan totals increased $165 million or an annualized 8.3% versus December 31. Net of runoff in the residential and consumer loan portfolios, total loans excluding PPP loans grew $147 million or an annualized 6.2% for the quarter. Non-interest income decreased $506,000 versus the trailing quarter as an increase in insurance agency income was more than offset by lower benefit claims on bank-owned life insurance, lower loan prepayment fees and other loan fees and lower wealth management fees as a result of a decrease in the market value of assets under management. I think in terms of an expense run rate for dollars, excluding the provisions on the off-balance sheet credit losses or credit exposures, I think we're probably in the $63 million to $64 million range for the next quarter. Hey, good morning, guys. Maybe, I'll give a long-winded answer here because I think that if you look at our growth this quarter on the commercial loan side of about $8.3 million annualized, when you factor about $100 million, roughly $98 million of loans that we plan to exit, which means these were things we wanted to happen, so we encourage these loans out of the bank. Hey, good morning, guys."
}