{
    "symbol": "PFS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 14:08:07",
    "content": " And in the second quarter, we closed approximately $821 million of new loans, a 103% increase from the same quarter last year. As Tony noted, our net income for the quarter was $39.2 million or $0.53 per diluted share, compared with $44 million or $0.58 per share for the trailing quarter, and $44.8 million or $0.58 per share for the second quarter of 2021. As floating and adjustable rate loans repriced favorably and new loan originations reflected higher market rates Income recognized from PPP loan forgiveness fell $900,000 versus the trailing quarter to $192,000 and remaining deferred PPP fees total $162,000 at June 30. Excluding the impact of PPP loans and purchase accounting adjustments, the core net interest margin increased to 22 basis points from the trailing quarter to 3.17%. The pull through adjusted loan pipeline at June 30 increased $15 million in the trailing quarter to $825 million, while the pipeline rate increased 84 basis points since last quarter to 4.99%. Quarter end and quarterly average total deposits however, were lower than the trailing quarter primarily due to a shift to $360 million of brokered deposits to lower costing FHLB advances. Noninterest income increased $784,000 versus the trailing quarter as increases in gains on loan sales, loan prepayment fees and benefit claims on bank owned Life Insurance were partially offset by lower insurance agency income and wealth management fees. Current quarter expenses included an increase in stock-based compensation cost of $1.2 million versus the trailing quarter, reflecting the impact of strong actual and projected results over the performance measurement periods on expense associated with the company's long-term incentive plan. I wanted to start I think I look back last quarter on the fee side, I think you guys had talked about the $20 million to $21 million run rate, been there for a few quarters in a row now. And I would say probably the area that I would if I had to look forward and say what might slow down is the construction space, obviously short term, prime rates moving that might affect the inflationary cost, all that stuff that might weigh in heavily on the construction side, which is an area that we probably saw our latest outstanding this particular quarter, but on the other sectors, I think they're just moving quite strong."
}