{
    "symbol": "AMKR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 23:21:04",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the Amkor Technology Second Quarter 2022 Earnings Conference Call. Good afternoon, everyone, and thank you for joining us for Amkor's second quarter 2022 earnings conference call. Revenue increased 14% year-on-year in the first half, and advanced packaging grew 18%, despite the COVID-19 lockdown in our Shanghai factory. While the industry is facing market economic headwinds and market forecasts have weakened at some areas, we continue to see robust demand for our services, notably for advanced packaging. Amkor strategic focus and leadership position in advanced packaging enable us to leverage the growth catalyst in 5G premium smartphones, automotive electronics, high performance computing, and IoT. In the first half of this year, our communication business grew 10% compared to the first half of last year. Although, overall forecast for smartphone units have weakened to a mid single digit year in year decline, 5G unit volume is expected to grow and reach an estimated 50% penetration this year, up from around 5% in 2021. And with our leading position in this market, we expect further growth through this transition to 5G. Although material constraints throughout the automotive supply chain persist, we observe improvement in lead times and anticipate the more balanced supply chain by the end of this year. Market forecast shows mid-teens CAGR over the next several years, driven by adoption of ADAS, electrification, infotainment, and telematics. These new and expanding features require the use of advanced packaging to obtain the required performance, quality and reliability needed in the automotive industry. As the leading automotive OSET with a global manufacturing footprint and advanced packaging solutions throughout the vehicle, we are well-positioned to profit from this market growth. In data centers, the introduction of AI is driving investments in high performance computing, utilizing advanced packaging technology. We see similar technology requirements in wire and wireless markets, notably in support of 5G infrastructure. Although, the PC market is softening, the trend to arm based PC architectures opens new business opportunities for Amkor. Besides the technology shift in the PC market, we observe a continued trend towards an outsource semiconductor supply chain, with the big data producing companies taking an active role in developing key semiconductors for hyperscale data centers. With our broad advanced packaging portfolio and established relationships with lead customers and foundries, we are well-positioned to capitalize on opportunities in these growing computing applications and we continue to invest in advanced technology and manufacturing scale for this market. Although, we expect that this emerging product category is more prone to quarterly variability due to supply constraints and varying product life cycles. With an advancing digital economy and increased proliferation of connected wearable devices, Amkor has the technology scale and expertise to support this trend. Our QualityFIRST program is widely deployed in the organization and close collaboration with our supply chain partners, further improved supply reliability. In the supply chain, we observe improvements in lead times of substrates, lead frames and components, and we expect a more balanced supply chain towards the end of the year. Our team was focused on supporting our people and keeping them safe, while closely cooperating with local government and customers to minimize the impact. Now, let me turn to our third quarter revenue outlook. Although market forecasts have weakened in some areas, we are expecting a strong third water with revenue of $1.93 billion at the midpoint of our guidance. We expect solid demand across all end markets, especially driven by new product ramps in support of 5G premium tier phone models and the continued strength in computing, automotive and consumer markets. First half revenue increased 14% versus first half 2021, a strong start to the year. All of our end markets are also showing robust first half growth, with most growing double-digits compared to the prior year. Our technology leadership position and focused execution drove first half revenue for advanced products up 18%, representing approximately 70% of our business. Regulatory approval to resume production was received later than expected, and therefore, the revenue impact for the second quarter was more than we estimated in May. In addition, upside demand, notably for advanced SiP, supporting the communications and consumer end markets, resulted in Q2 revenue within 1% of our midpoint. Gross margin for the second quarter was 16.6%, primarily due to under utilization of our Shanghai factory and related incremental costs. Operating expenses for the quarter were less than expected at $106 million, benefiting from lower labor costs, favorable foreign currency movements and timing of new product introductions. Net income for the quarter was $125 million, resulting in EPS of $0.51. We ended the quarter with $1.1 billion of cash and short-term investments, and total liquidity of $1.8 billion. Our total debt as of the end of the second quarter is $1.1 billion, and our debt to EBITDA ratio is 0.8 times. We see continued solid demand into the third quarter, specifically in the communications market due to the launch of premium tier smartphones. We are expecting Q3 revenue between $1.88 billion, and $1.98 billion. Gross margin is expected to be between 19% and 21%, demonstrating the leverage in the financial model and an ability to execute a quick return to strong profitability. Q3 net income is expected to be between $200 million and $250 million, resulting in EPS of $0.82 to $1.02. All year 2022 is tracking to be another record year, with double-digit growth expected for revenue, operating income, and EPS. We do not see a change in the secular trends and growth catalysts for advanced packaging, and we remain confident in our long-term outlook. Amkor holds a leading position in advanced packaging, and we expect that strategic focus to continue to drive long-term growth. Please state your question. Maybe the first question, just wanted task on the Shanghai operations, which resumed a bit later than expected. And then for the ships, do you expect, any -- all that to ship into third quarter where some could continue into fourth, discuss the timing how that impacted the flow revenue. When it comes to the recovery of that business, part of that will be recovered in the third quarter. We have long-term agreements in place, so we expect that the majority of that business will be recovered later in the year. So, yeah, so it sounds like it's mostly third, but could some of it could continue into fourth quarter. If I could ask on the -- you have the foundries and some of the backend companies are indicating some risk of a correction into fourth quarter, first half. It sounds like your markets are pretty robust, but are you anticipating or factoring in, or expecting some slowdown or do you see the strength continuing to your end and maybe initial view, if you think first quarter gets back to kind of the normal seasonal trend, just factoring some of the macro. With respect to this year, we expect strong second half of this year. As indicated, third quarter will be strong and also we expect a solid fourth quarter. Although, we also see still -- let's say a balanced, more balanced supply chain than the key growth drivers in the markets that we're supporting be it 5G, be it automotive, electronics, high performance computing, and IoT. There may be some corrections in some segments, but overall, I believe the foundation for the semiconductor industry and the growth drivers are still very strong, also going into next year. And for the, like, you've seen a strong mix toward advanced packaging and highlighted that as a driver. For our wirebond and lead frame business, we operate our factories at utilization, that will continue for the major part of the year, same thing as for our advanced packaging. On the wirebond business, we see strength certainly in the automotive wirebond part. Some pockets of inventory corrections specifically in Japan, but we expect that going into the fourth quarter and even further going into next year, we see strength in their business. These -- the segments that we are supporting for the wirebond and the lead frame business, it is not so easy for customers to switch. It looked like second quarter materials, like the variable material costs went up a few points as percent of sales. Was that mix impact more SiP, or there other factors, like higher material costs, higher substrate costs.? So, Randy, with respect to the material content increasing in the second quarter, really two factors with the Shanghai impact that factory tended to have a lower material content than our average. The increase is not related to specifically increasing material cost, as we are able to pass that through to our customers. Specifically in the high-end substrates materials -- that's a good point, Randy. In the ABF substrates, we see continued short just going into next year. That's mostly for the computing market, and some segments of the automotive market. Although, we see some improvements in the rest of the supply chain for the more lower end substrate, but ABS substrates will be short supply, although more capacity comes on online. Let me share -- open up the shared -- the answer here, and then maybe Megan can give a little bit more details on the share on the tax incentives. I mean, we see this as an important milestone of supporting the U.S. chain. We are working on scenarios with different partners and customers, direct customers in the supply chain to see what is the best way to support the local supply chain. So, Randy, it's just too early to tell what that tax incentive that's included, how that would impact Amkor specifically. Please state your question. I think our CapEx plan -- Tom, by the way, good afternoon -- is still targeted at 950 for the year. So, a large part of that capacity that was allocated to equipment expansion is already coming on board for the ramp in the third quarter and the fourth quarter. And I don't know the accounting details here, but Megan can probably add to that, probably in the second half of this year. And just as a reminder, Tom, Vietnam, won't actually -- I mean that won't start depreciating until we complete those activities, which we're expecting to begin high volume late in 2023. And just in general, is there a rule of thumb where dollar CapEx gives you a dollar per year revenue or $0.50 per year revenue? I think, it's tricky given the different dynamics specifically with material content changes to be able to have kind of a guideline for the capital spend. Fungibility for Amkor is very important, and we invested significantly over the last couple of years to assure that the capacity that we install is fungible. If we take test equipment, which is a large part of our investment, generally we buy industry standard platforms and they are fungible between business with customers. If we talk about flip chip, these are fungible and wafer level packaging is also fungible across markets. And then, moving over to the end markets, a lot of the companies out there are seeing some softness in consumer and mobility. I think on the mobility market, if you talk about the smartphone market, indeed, I think on a global volume basis, we expect, let's say, mixed single digit decline now. There is still strength in that market, specifically when we talk about the transition into 5G premium tier smartphones. So although the overall market is declining, we see the 5G unit volume increasing, because last year there was about 35% of the market was 5G. So, there's an increase in 5G and the premium tier market continues to stay strong on a global basis. So, with our position in that premium tier segment of the market, we see continued strength. I mean, we see driver for growth specifically this year, there's on the automotive, the car unit volume this year. And on top of that, we see the -- let's say the penetration of features like driver assistance features, like ADAS, telematics, digital displays, proliferating deeper into that market. So, we believe that on the EV side that our incremental growth drivers on top of the electrification of that I mentioned before that are across the board for the automotive market. Please state your question. Giel, I want to go back to your comment about automotive semiconductor content per car. You talked about 50% growth of content, I believe you said 2026 or 2027 from 2020. They basically said, in 2022, they are seeing automotive semiconductor TAM expanded 50%, but compared to 2019 level, but the auto production, as you also know that 2022 is not so different from 2019. We talk about average semiconductor content per car, goes from $500 in 2020 to $750 in 2025. We see some acceleration there, certainly in the European market where the -- let's say participation of EV in the overall automotive market is increasing. I think you appear in Taiwan, sort of commented, at least for the mainstream packaging side, pricing has been stable so far this year quarter-over-quarter, but obviously there's inflation and you got pass down some of the input cost. I mean, first of all, your comment on inflation, so far this year, we work closely with our customer base to include inflation in our prices. Secondly, with respect to the second half of the year, we don't see an increased pricing environment or a deteriorating pricing environment. Amkor delivered solid first half results, with overall revenue up 14% year-on-year and advanced packaging revenue up 18% year-on-year. We expect third quarter revenue of $1.93 billion, reflecting another quarter or strong year-on-year growth of around 15%. Demand for our technology and services remains robust, driven by our leadership position in advanced packaging supporting 5G, automotive, high performance computing and IoT. Although, we observe microeconomic headwinds and some weaker market forecast in some segments, we believe the long-term growth drivers for the semiconductor industry remain in place."
}