{
    "symbol": "WIT",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-13 15:48:05",
    "content": "  Operator: Ladies and gentlemen, good day and welcome to Wipro Limited Q2 FY ‘22 Earnings Conference Call. As a reminder, all participant lines will be in the listen-only mode and there will be an opportunity for you to ask questions after the presentation concludes. I now hand the conference over to Ms. Aparna Iyer, Vice President and Corporate Treasurer. We will begin the call with business highlights and overview by Thierry, our Chief Executive Officer and Managing Director; followed by a financial overview by our CFO, Jatin Dalal. Afterwards, the operator will open the bridge for Q&A with our management team. Before Thierry starts, let me draw your attention to the fact that during this call, we may make certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act 1995. These statements are based on management’s current expectations and are associated with uncertainties and risks, which may cause the actual results to differ materially from those expected. Over to you, Thierry. It’s really good to be able to speak to you again this quarter, especially as you join us today during the festive time. We’ll make sure not to keep you here for too long, okay. So our Chief Human Resource Officer, Saurabh Govil; Chief Financial Officer, Jatin Dalal; and our Chief Growth Officer, Stephanie Trautman. For me, personally, this is a special earnings call to be able to speak to you from Bangalore. This is my first official visit to the India offices, since I took charge in July last year. In the last three years - three days, I've met with our senior leaders and teams in India, it's absolutely been incredibly energizing. Of course, I've only just started to travel essential travel, of course. I was in the U.S. last week, meeting with our regional CEOs and GBL leaders, our Chief Growth Officer, and those are key leaders of our business. Each of them, I must say, has steered Wipro through a very difficult time during the pandemic. And I'd like to thank every one of our 220,000 colleagues across the world for their commitment, their trust, and their dedication to our customer success despite the challenges of the pandemic. In many parts of the world, we are starting to return to our offices in a staggered manner. For example, in India, our fully vaccinated senior colleagues can now come to office twice a week. In the second quarter, I'm happy to share with you that our new revenue run rate surpassed the 10 billion mark - the $10 billion mark. And even if we exclude our two recent acquisitions, that is Capco and Ampion, we grew over 4.6% in constant currency terms. It signals the underlying demand and the execution momentum we have generated, and majority of our growth was volume-led. We've experienced secular growth across all markets, all sectors and global business lines. Our recent acquisitions too, I must say, have performed ahead of expectations. In fact, our pipeline is among the highest in recent quarters. There are, in fact, many midsized deals and slightly smaller sized transformation deals in the market right now. And in terms of TCV, the order book is up 19% year-on-year. I'm pleased to share that in Q2, we have sustained Q1 operating margins, adjusted for the one-time gains we had in the last quarter. And frankly, we have maintained our operating margin despite absorbing the full impact of our recent acquisitions of Capco and Ampion and in spite of investing heavily in our business across sales capabilities and talents. An additional point to note here that we've also offered a salary increase covering 80% for our colleagues in September of 2021, marking a second salary hike in this calendar year. There is significant traction across all our markets, as I said, leading to broad-based growth. Americas and Europe, our top two markets grew at 15% and 29% year-on-year, respectively, even without the recent acquisitions. In Americas 1, we grew 20% year-on-year, with most of the sectors showing strong growth: Consumer, Tech, Communications, Health, all have grown at 5%-plus sequentially. In Americas 2, we grew 31% year-on-year, led by growth in our organic business as well as benefits from our acquisition of Capco. Our European business has delivered a year-on-year growth of 48% on the back of several large deals, and thanks to the boost of our acquisition, Capco. UK, Benelux, Germany led organic growth growing at 12%, 10% and 10%, respectively, in sequential terms. We are now seeing improved traction in Australia and New Zealand, in India, in Japan and the Southeast Asian markets. Middle East and Africa were weak in Q2, but we are encouraged by the pipeline that is shaping up. In the last 12 months we have added four new customers in the more than 100 million bracket and we have added five more customers in the more than 50 million bracket, this was really the start of a significant shift. When I meet our customers, they actually tell me the sea of change in how our teams approach their business and the value we bring to them. Customer satisfaction scores, as measured by an independent survey as also risen considerably. From a service offering standpoint, our IBS ideas global business line grew 11% sequentially, and 37% year-on-year. The cloud ecosystem, which is about 30% of our revenue, grew 27% plus in the first half. And for the first time ever, our cloud pipeline has crossed $8 billion. One, a global software products and cloud services company has awarded Wipro a multimillion dollar contract for product modernization, spanning AI, Cloud, and cognitive business products. Second, a multinational oil and gas company has selected Wipro to build a cloud native subsurface data platform, which enables consistent API standoff for connecting with cloud and software vendors, micro services and proprietary solutions. Working with Wipro FullStride Cloud Services, this solution significantly reduces sub surface data analytics timelines. With Capco, we continue to build good momentum on our joint go-to-market. We are also pleased to have completed the acquisition of Ampion, an Australian based provider of cybersecurity, DevOps, and quality engineering services. Apart from with a moving to a simpler and more customer centric operating model and an organizational restructuring, we have made substantial progress on leadership transformation. I have said that, in our previous interaction that talent will be a critical success factor. So we have worked on two key aspects of leadership overall, one, by building a contemporary and diverse in your leadership, including our client facing global account executives, and two, by moving the leadership closer to clients. Consequently, we have reconstructed our leadership with a good mix of internally promoted talent and lateral hires. Naturally we will continue to change and hold our momentum, but I'm happy with the pace and the quality of change we have achieved so far. We have doubled down our fresher intake with 8000 agents, 150 young colleagues joining us from campus in Q2. We will continue to aggressively build on this, and I'm happy to share that we are well positioned to add over 25,000 fresher’s in the next financial year. And finally, on to our outlook for the next quarter, we have guided for a revenue growth 2% to 4%, which will translate into a year-on-year growth of 27% to 30% in constant currency. To summarize, I would say that the demand environment continues to be strong. Together with the investments we've made in capabilities and talent over the last nine months, I'm confident we will be able to participate and win at a greater pace. On that note, let me hand over to Jatin for his comments on the financials. And good evening, good morning to all participants. As Thierry mentioned, for the first half our TCB win has been quite healthy at 18% and our ACE wins have been 29%. Our quarter two revenue growth was 8.1%, which as you know is significantly ahead of our guidance range of 5% to 7% and that reflected in constant currency 28.8% healthy year-on-year growth. Our operating margin for the quarter were 17.8% and it was a good sustenance considering the 1% that we received as benefit one time in quarter, one on sale of our Ensono business. The -- if you see our cash flow performance, operating cash flow was 81% of our net income. We had a good realization of 75.11 at the end of the quarter, and we had $3.3 billion of ForEx hedges. Ladies and gentlemen, we will now begin the question-and-answer session. Hi, congrats on the strong quarter, and thanks for taking my question. Diviya, I'll try to respond to the two points. The first one is a difficult one, obviously. And so the bottom line is that, yes, we are benefitting from a good market. We are seeing that the market continues to be good, and if not continue to get better. But we’re also seeing that we are having a better impact with our clients that we are having a better impact, and that we are actually performing better on the deals we are going after. And so I think at the end of the day, I cannot split scientifically, but there is no question that this performance is the result of the performance of Wipro in a good market. The strategy that we have laid out, Diviya, about 15 months ago now was one, a strategy of obsessive focus on growth. We have reinforced our internal processes, so that people can have more time for the market, spend more time with the clients. We have been very clear on the fact that, we wanted to focus on investments around our top accounts. So we've increased the size of our large account, those accounts have been a growth engine for us. We have been clear on the fact that we wanted to further invest and bet big on the power of developing partnership with technology companies like AWS, Microsoft, Google, or SAP, and this is what we’ve been - or ServiceNow. And finally, we have a strategy to go after a big deal as well. And that, with that in mind that we've organized our big deal team around our Chief Growth Officer, Stephanie. And so I would say that when you look at the way we have built, if I can say, if we - the way we have produced this growth, if fully aligned to the - it's the absolute result of the strategy we've been driving over the last 15 months. Ms. Nagarajan, do you have any further questions? You had earlier spoken about the Chief Growth Officer driving the large deal engine, and how it is nearly complete. Given that we've had a little bit of a slowdown in TCV in the last couple of quarters, I appreciate the ACV has gone up. For sure, we are happy with the performance in bookings. I mean, the quality of the deals we've closed this quarter with our clients - with our top clients, a good mix of large and midsized deals. So, it's not like you you're turning an opportunity into a mega deal in a few months’ time. What we've done is geared up the engine, the big deal team to start to produce more opportunities in our pipeline for the foreseeable future for the next quarters. I - from a large deal team perspective, in the first few months of building out that team, we've been focused on the current pipeline, so everyone on the team is actively involved in deals. We've seen some clients slow down a bit in their decision-making and others who have perhaps broken the opportunities into smaller opportunities, but we're still engaged. And then we've also pivoted towards more proactive origination of large opportunities, working closely with our existing client base and also our partners to create opportunities as well as respond to opportunities. And just to conclude, on your point, just facts. If you mentioned ACV and TCV, DVR. So, ACV has jumped 28% year-on-year in H1. So, from those two aspects, we are growing well as well. But if I have multiple follow ups, but in the interest of time, I will come back into the queue. Yes, hi answering my question. Thierry, I just wanted to focus a bit on the supply side of the equation. The demand environment definitely looks very, very favorable. And you guys have been doing ahead of your own expectation, but at some point of time, the high attrition and the high addition of pressures would have some drag on the incremental growth opportunities, which is there in the market. Mukul, I will start by answering the following. Now, I frankly don't believe that attrition will improve that can also reduce in the next quarters. I actually believe that given the environment we’ll continue to face the high level of attribution at least in the next two, three quarters. Because yes, we have obviously acted on it in many ways. But besides that, we've also ramped up our fresher’s strategy. And, going for a lot more, we’ve revised frankly, the level of ambition of our fresher’s intake. To that I'd like to ask you so how to maybe jumping and tell us also from fresher’s standpoint, not only in terms of numbers, but also in terms of strategy, what we've decided to do. So Mukul as you’ve called out, the demand environment is very strong and supply side we have to work on. So it's not only adding numbers or adding more people, it's also making sure that how do we make up -- upskill them and also retain them for a longer period of time. So for example, for fresher’s as we go on for the campuses this year, and we just concluded the national talent and test log for India, where we had more than 200,000 people applying for it. We are having a communication plan that I think is unique, where we not only share with them what happens as a compensation when they join, but also a plan for them in terms of carrier and compensation over the next five years. It's not only about adding numbers, it's very strategic thing through that we will be able to increase the retention of our freshers for a longer period of time. The historically the legacy portion has obviously been more profitable, although growth is not there. Although definitely we are getting a significant growth from those areas that you're referring to, it's true. Today we are significant part of our growth is coming from Cloud area, from data, from digital transformation, from engineering services from cybersecurity. And again, this is based on this revenue mix that we have, based our assumptions for the -- for the guidance for Q3. But Mukul just to add to what Thierry is saying, yes, these are hot skills today. Just to add, Mukul conceptually if the demand is high as Saurabh has mentioned, and there is constrained supply today, if more people get trained in that area, in fact, it will overall reduce the pressure on attrition in that area over a period of time though that specific individual may be more marketable in them with a new…\n Okay, fair enough. Again, thanks for taking my question. Hi, good evening, thanks for taking my question and congrats on a good quarter. On the first point, which is, you want to understand at which stage of transformation. I think we are, the best of the transformation is ahead of us. I mean, the potential of -- if you look at the cloud, so first of all, if you look at Cloud transformation, what I'm reading and is quite consistent here, we probably have touched, say, 20%, of the cloud transformation wave. And so the biggest part of it, and the largest part of it is ahead of us. If you're looking at security, no, there is no question that security will continue to represent budget increase for our clients in the next years. If you look at data, in data, the way we are leveraging data to drive insight for better decision making is immense potential -- present an immense potential for a lot of industries. And, again, the best is ahead of us. Finally, if you look at engineering services, and other areas where we are investing significantly and getting nice growth, we know that this is an area where, in many, and across many industries, companies will have to invest in their R&D, and we'll need support from companies like us to support and augment their R&D investments. And so across all these different areas, the bulk of the transformation is ahead of us. On the attrition, which is your second point, I actually don't believe that the worse of attrition is behind us. I think it will, as I said, it will continue to, to possibly increase in the next quarters before cooling down. Again, that's, that's at least our assumptions as of today. Thanks for taking my question. Thierry, couple from my side. So on the first point, I mean, I would answer a frank, yes. Yes, the demand is strong, and will remain strong. Our clients are placing investment in technology as you know, among their top priorities. To a point Apurva, where it's not anymore a topic for the CIO only, it's a topic for every CXO in an organization, right. The CMO, is investing more in technology, the head of supply chain is investing more in technology, the business expressed strong demand for technology. And obviously, all the different functions, HR, Finance, Operations, all are pushing for programs to be developed. Well, Apurva, I think there's opportunity today. In this current context, our clients, our clients feel the same. And so, I think it's a reality that more important for them today is the ability to continue to drive those programs without slowing down. Now, from a portfolio standpoint, I would say, I would still talk about the certain level of stability of the pricing. Ladies and gentlemen, in order to ensure that the management is able to address questions from all participants in this conference call, please limit your questions to one per participant. For any further questions, you may come back for follow up. And we have given ourselves a quarter to stabilize this organization model, it's actually been incredibly efficient rapidly. And frankly, I don't want to be overly optimistic, I mean, not positive about it, every new model requires a certain amount of progression, but frankly, very positively surprised by the level of maturity of the model after a few months. We have today a model that the organization and all our leaders consider is the model that is working and actually delivers the upside that we want that we were expecting in terms of simplicity in terms of, reducing the number of silos inside your organization, the ability to create a one Wipro mind set and getting actually freeing up time for our people to spend more time with customers. And the second  aspect is that if you look at that our top 200 leaders across the organization two years ago, we had only 1% of them were account executives, today 8% of them are account executive. One Thierry, you mentioned couple of quarters that one of the key jobs which you had to do was to build a pipeline, actually. Okay, so I think the first one on the on the on the pipeline. It's been a consistent progression, the trend has been positive. But more importantly, I would say two things. We have a pipeline now that is more aligned to our strategy in terms of priorities, in terms of focusing on offerings, where we want to invest, and also focused around our key accounts. So the first, the proportion of our pipeline coming from our top accounts, is a lot bigger than what it was several quarters ago. So from that standpoint, it's all positive. Finally, I would say in terms of deal conduction, I think we are also seeing a positive trend. We've improved the way we are quantifying our bills, we've improved the way we are mobilizing the one we broke organization to win deals. And -- the laser focus, in line with our strategy, around accounts and in specific offerings allowed us to invest into cap talent into top capabilities. There is there is tremendous, I would say, competition for great talent. We need to make sure that our supply curve is properly supporting our growth curve, and in fact, ahead of our growth curve. Having said that, we executed as you know, this quarter well. We were able to drive operational improvements in realization, utilization and offshoring. So I think it's going to be it's going to be a growth going forward, which will end how do we balance the effort that we put on our operating levers to be able to cover for the margin is that is going to be a balance that we will have to continue to fight on. But we have done well, which we are proud of in quarter two. But there are there are clear investment agenda on talent going forward, which we have to remain cognizant. But if I look at the first half PCB  and even if I assume close to 75%, being a new business, and as you move forward 10 years, then the actual new business as a percentage to the first half comes to around 5% as a whole. So, does that worry you in terms of the growth profile going forward, or do you believe for the industry as a whole the group profile is changing, where we have to look beyond the large deal signings, where larger deals are getting converted into smaller deals. And second question to Jatin, Jatin, this time I think EBITDA margin decline is close to 75 bips, right depreciation savings has been higher than 50 to 70 bips. So, what is causing this and whether depreciation will normalize in a going forward basis. On the first one, there is the strength of the performance is reflected in quarter two numbers. Of course, you can look at look at the likely performance in many ways and you have a point of view that we respect. And as you can see the first engine has really been very, very productive in last nine months and it continues to fire very well. But, we are very strong first engine which is firing. So overall, we are quite okay and well placed is the way we see Sandeep. We, as you know, we do have certain cycles of amortization related with the specific costs for which that particular item is getting amortized on. And as and when those cycles come to an end, in their natural course, the amortization ceases to come in the P&L. Your line is unmuted, please go into question. Thanks for taking my question. Thierry, I just had one question from my side. We know that the Indian companies have done really well in the U.K., Scandinavia, and even geographies. And when you're working remotely, whether you're working two miles away or you know 5000 miles away, doesn't change anything. And from standpoint, there's no doubt that you know a lot of in the companies across industries in the European market have learned and will be more comfortable leveraging global delivery models if you like. In Europe more than anywhere else, there are major cultural specificities that requires a deep understanding of the local markets. And I think the companies that are doing well are the ones who understand that and who are able to leverage at the same time, the power of global organizations and develop a stronger local connect. And that's the reason why we have, so significantly invested into local leadership in Europe, and this has been paying off pretty much immediately. Oh, my team would tell you that I'm, I always consider that we could have done even better. The consistency, the alignment to the plan, the execution, if you like, of the strategy, and the fact that you know, we are doing what we said we would do. Hi, thank you for the opportunity, in addition to the data application. Thierry, I want you to pick up on a couple of things. Number one thing is around the fact that while we have seen a significant shift in terms of offshore mix of revenues over the last several quarters, that has also played along with significant increase in utilization, which is which is contrary to what one has seen in the past for the industry. I mean, so I'll start with the point number two and I’ll come back to us to the first one after. The -- there's always a bit of seasonality in in our industry, for sure. And that's, that's why when we talk about sequential growth, we need to take into account seasonality. It remains that if we look at our growth, 2% to 4% growth in Q3 would actually represent 27% to 30% growth year-on-year, which is quite healthy. On your first point, which is trying to identify trends, or evolution of onshore and offshore mix, I would be a little cautious with drawing conclusions. I think the reality Manik is that, the mix is a factor of many things. Depending on the level of the cycle of where you stand in, in the transformation, you're going to need either more, local presence or more offshore presence. And so I think it's not necessarily a trend that is systematic, I think it's you can see an evolution depending on the mix of deals in a particular sector, in a particular geography. Typically, offshore utilization is lower than the utilization we have onshore. Even in a market of high demand, utilization tend to be higher, that's pretty mechanical. With the attrition going up here, that also impacts the attrition. Yes, no doubt, again, that, what we've learned over the last 15 months were through the pandemic is, will change the way the ways of working. And there's no doubt I would, I would leave you with two views. One is, we know that a significant portion of our employees will spend some days per week working from home, so therefore, remotely wherever they live. And it's absolutely the same  that applies for our clients, employees as well. In every of my interactions with clients, we are talking about it, and I think it's an evolution of the workforce to last. And the second thing again, is that, being more being exposed, and having developed the technology that support, remote working, in a secure way, opens new opportunities to clients to think about new operating model and new ways of working with companies like ours. So yes, for those two reasons, there's no doubt that operating model will continue to trend towards more flexibility between physical and virtual. Ladies and gentlemen, that was the last question. In case we couldn't take any of your questions, please feel free to reach out to the investor relations team. Wish you all a very happy, festive season ahead and have a nice day. Ladies and gentlemen on behalf of Wipro limited, that concludes this conference."
}