{
    "symbol": "EGRX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-13 10:45:06",
    "content": " In â\u0080\u009822, we also spent about $100 million combined in cash and Eagle shares to acquire Acacia Pharma and its two commercial acute care products for BARHEMSYS, BYFAVO and we still have net cash and receivables after all of this. I will point out that in the fourth quarter of â\u0080\u009822, we had just over $12 million of PEMFEXY net sales and exited the quarter with a 6% share of the U.S. market in community oncology. Although still a small base, the nearly $1.5 million in combined sales of BARHEMSYS and BYFAVO in the second-half of â\u0080\u009822 represents a doubling from Acacia's reported net sales of 722,000 for these two products in the second-half of â\u0080\u009821. In the fourth quarter of 2022, total revenue was $60.7 million, compared to $42.3 million in Q4 of 2021, primarily reflecting continued revenue from sales of vasopressin and PEMFEXY, which we launched in 2022, as well as the addition of BARHEMSYS and BYFAVO to our commercial portfolio. Net product sales during the fourth quarter of 2022 were $37.2 million, compared to $16.2 million in Q4 of 2021. Full-year 2022 net product sales were $214.5 million, compared to $65 million in â\u0080\u009821. For the full-year â\u0080\u009822, vasopressin net product sales were $63.2 million and PEMFEXY sales were $67.5 million. BELRAPZO net product sales were $11 million in the fourth quarter of â\u0080\u009822, compared to $5.5 million in Q4 of 2021. For the full-year, BELRAPZO net product sales totaled $33.7 million, compared to $23.7 million in 2021. Fourth quarter 2022 RYANODEX net product sales were $7.2 million, compared to $6.1 million in Q4 of 2021. Full-year of â\u0080\u009822 net product sales of RYANODEX totaled $30.2 million, compared to $25.3 million in 2021. Full-year 2022 R&D expenses were $34.1 million, compared to $51.3 million in 2021, primarily reflecting the non-recurrence of a $10 million upfront payment related to our license agreement with Combioxin for CAL02 and $5 million upfront payment related to our license agreement with AOP Orphan for landiolol, lower headcount also -- lower headcount costs of $1.3 million and lower spent on vasopressin of $7.6 million. Net income for the fourth quarter of 2022 was $8.2 million or $0.63 per basic and $0.62 per diluted share, compared to net loss of $6.2 million or $0.48 per basic and diluted share in the prior year quarter. For the full-year 2022, net income totaled $35.6 million or $2.76 per basic and $2.73 per diluted share, compared to a net loss of $8.6 million or $0.66 per basic and diluted share in 2021. Adjusted non-GAAP net income for the fourth quarter of 2022 was $14.4 million or $1.11 per basic and $1.10 per diluted share, compared to adjusted non-GAAP net income of $11 million or $0.85 per basic and $0.83 per diluted share in the prior year quarter. For the full-year 2022, adjusted non-GAAP net income totaled $101.8 million or $7.87 per basic and $7.79 per diluted share, compared to adjusted non-GAAP net income of $22.3 million or $1.71 per basic and $1.68 per diluted share in 2021."
}