{
    "symbol": "BAX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 11:06:10",
    "content": " With that, let me start our prepared remarks by reminding everyone that this presentation, including comments regarding our financial outlook for the third quarter and full-year 2022 and our 2022 to 2025 long range plans, the recent acquisition of Hillrom, new product development, the potential impact of proposed pricing actions, business development and regulatory matters contains forward-looking statements that involve risks and uncertainties, and of course, our actual results could differ materially from our current expectations. And good morning, everyone. And good morning, everyone. Second quarter 2022 global sales of $3.7 billion advanced 21% on a reported basis, 26% constant currency, and 3% operationally. Sales in our acute therapies business were $173 million, declining 4% on a constant currency basis, reflecting the difficult comparison to the prior-year period where we experienced elevated demand for CRRT, given the rising COVID cases. Biopharma solutions in the quarter were $163 million, declining 5% on a constant currency basis and reflecting an expected step down in sales of COVID vaccines compared to the same period last year. Adjusted SG&A of $839 million represented 22.4% as a percent of sales, an increase of 150 basis points versus prior year, driven by the addition of Hillrom, as well as higher freight expenses, partially offset by lower bonus accruals under our annual employee incentive compensation plans. Adjusted R&D spending in the quarter of $148 million represents 4% as a percent of sales, a decrease of 50 basis points versus prior year. Adjusted operating margin in the quarter was 16.2%, a decrease of 100 basis points versus the prior year, primarily driven by incremental freight expenses in the quarter, resulting from higher fuel prices and inflation, partly offset by actions we are taking to improve productivity and reduce spend. For the third quarter of 2022, we expect global sales growth of high teens on a reported basis, mid-20s on a constant currency basis and low-single digits operationally, and we expect adjusted earnings excluding special items of $0.79 to $0.83 per diluted share."
}