{
    "symbol": "PRPL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 23:29:06",
    "content": " Bennett will review the numbers in more detail in a moment but from a channel perspective, e-commerce revenue was nearly flat to the previous quarter on significantly lower ad spend which is encouraging and gives me confidence in the work we've done, both on our ad spend efficiency and our brand messaging. We anticipate Purple brand revenue coming in at the lower end of the revenue guidance we previously gave but with the modest contributions from Intellibed land us in the middle, therefore, we're reaffirming our previous full year revenue guidance of $570 million to $590 million. For the three months ended September 30, 2022, net revenue was $143.3 million, down 16.1% compared to the $170.8 million in the prior year period and down less than 1% compared with the second quarter. Gross profit dollars were $59.4 million during the third quarter of 2022 compared to $61.1 million during the same period last year, with gross margin at 41.5% versus 35.8% in the third quarter of 2021 and 33.9% in the second quarter of this year. The increase in gross margin from the prior year and from the second quarter of this year can be attributed primarily to the cost reduction initiatives implemented in 2022, partially offset compared to the prior year by an increased proportion of wholesale channel revenue which carries a lower average selling price than sales from our DTC channel. On an adjusted basis, net income in the third quarter of 2022 was $2.8 million or $0.03 per diluted share based on an adjusted weighted average diluted share count of $86.1 million compared to an adjusted net loss of $4.9 million or $0.07 per diluted share based on an adjusted weighted average diluted share count of 67.3 million in the prior year period. We now expect Purple brand net revenue to come in at the lower end of our previous revenue guidance of $570 million to $590 million which, along with the contribution from Intellibed should put us around the middle of the range for overall net revenue. With respect to adjusted EBITDA, based on the third quarterâ\u0080\u0099s outperformance and with one quarter left in the year, we are increasing and narrowing our full year range to $2 million to $7 million profit up from our prior range of a loss of $5 million to $15 million. The stores we've opened over the past two years are experiencing the same headwinds our wholesale -- as our wholesale business but with more control over the selling process, we're navigating through the current environment with a path to our targeted store economics of at least $2 million in annual sales per store."
}