{
    "symbol": "MEC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 16:11:05",
    "content": " Total sales volumes increased 13.3% on a year-over-year basis in the fourth quarter, driven by broad-based demand across most end markets, but partially offset by continued disruptions in our customer supply chains. For the fourth quarter, our adjusted EBITDA margin increased 240 basis points to 10.5% when compared to the year ago period, when excluding the impact of the planned production ramp at our Hazel Park facility. In 2023, capital expenditures are expected to be between $20 million to $25 million, representing a more than 50% decline from the full year 2022. As we look forward to 2024, we expect the facility will no longer be a drag on our margins and will exit the year with a run rate of a $100 million in annual revenues, half of which will come from new customers and the other half coming from new and existing programs with current customers. Interest expense was $1.2 million for the fourth quarter of 2022 as compared to $440,000 in the prior year period, primarily due to higher interest rates. Turning now to full year performance, total sales for the full year 2022 increased 18.6% on a year-over-year basis to $539.4 million driven by customer raw material price pass-throughs, volume increases, improved price capture and end market demand resulting from customer inventory replenishment. The 18.9% increase was driven by volume increases, commercial pricing increases and improved absorption of manufacturing overhead costs offset by Hazel Park transition and launch costs, continued customer supply chain issues and a $1.8 million decline to scrap income in the second half of the year. Adjusted EBITDA finished in line with our guidance for the year at $60.8 million after adding back the first half of repositioning impacts from our Hazel Park facility, our CEO transition costs and legal expenses related to our former fitness customer versus $46.2 million for 2021. As a result, we currently expect full year 2023 net sales of between $540 million and $580 million, adjusted EBITDA of between $62 million and $71 million and capital expenditures of between $20 million and $25 million. Because, the way I look at it, the revenues quarter-over-quarter were down $7.7 million, but the EBITDA was down $4.6 million and I know there's a lot of moving pieces in there, but what was kind of the delta again with the EBITDA, Q3 versus Q4, which maybe left the margin a little below where we were expecting? The other comment I would make, Larry when we think of the margin profile, when we get to the 2025 and we're at a $100 million run rate, our expectation would be that, that EBITDA margin would be in line with our expectation of the 15% or even hopefully even accretive from there."
}