{
    "symbol": "PLMR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 00:30:05",
    "content": " The quarter highlighted by 69% gross written premium growth, adjusted net income of $18.7 million and an adjusted ROE of 19.7%. Our first priority, generating strong premium growth is abundantly clear and our record gross written premium of $218.7 million in the quarter, which equates to 69% growth over the prior year. PESIC, our E&S business increased premiums 200% year-over-year with a total of $102.4 million. Pleased to note that weâ\u0080\u0099re trending well ahead of our previously announced plan to generate between $80 million to $100 million of managed premium, and we now believe that we can generate $130 million to $160 million of managed premiums this year, inclusive of the Texas homeowners business, which adds approximately $45 million of fee generating premium over the next 12 months. We are reiterating guidance for the full year 2022, where we expect to generate between $80 million and $85 million of adjusted net income, representing 54% year-over-year growth and an adjusted ROE of 19% at the midpoint of range. For the second quarter of 2022, our net income was $14.6 million or $0.57 per share compared to net income of $12.3 million or $0.47 per share for the same quarter of 2021. Gross written premiums for the second quarter were $218.7 million, an increase of 69.1% compared to the prior year second quarter. Fee written premiums for the second quarter were $122.6 million, representing an increase of 137.8% compared to the prior year second quarter. Net earned premiums for the second quarter were $80.3 million, an increase of 48% compared to the prior year second quarter. For the second quarter of 2022, net earned premiums as a percentage of gross earned premiums were 50.8% compared to 52.9% in the second quarter of 2021 and compared sequentially to 54.7% in the first quarter of 2022. Losses and loss adjustment expenses incurred for the second quarter were $14.4 million, made up of attritional losses of $13.9 million and unfavorable prior period catastrophe loss development of $548,000. The ratio of other underwriting expense, excluding adjustments to gross earned premiums for the second quarter of 2022 was 8.5%, an improvement compared to 11.1% in the second quarter of 2021 and compared to 9% in the first quarter of 2022. Net investment income for the second quarter was $3.1 million, an increase of 43.1% compared to the prior year second quarter. For the second quarter, we recognized losses on investments in the consolidated statement of income of $4.7 million compared to gains of $300,000 in the prior year second quarter. This range is equivalent to adjusted net income of $85 million to $90 million, excluding unrealized gains and losses for the year, representing 64% year-over-year growth at the midpoint of the range. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}