{
    "symbol": "DDD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 10:05:05",
    "content": " A key point regarding our ongoing investment initiatives is we're only pursuing R&D programs and new additions to our product portfolio that we believe offer attractive returns and are consistent with our company's mission to provide application-focused solutions to high-value, high-growth industrial, and health care markets. Moving now to quarterly revenue results, which, as noted previously, no longer reflect the impacts of 2021 divestitures on a consolidated basis, firmly for the fourth quarter of 2022, decreased by 12% to $132.7 million compared to the same period in the prior year. For our Industrial Solutions segment, full year 2022 revenue, excluding divestitures and the unfavorable impacts of FX, increased by 9.7% as compared to 2021, driven by continued strength in precision microcasting applications and demand for production machines in energy and commercial space applications. One point I'd like to remind everyone of as I did on our third quarter call, 3D Systems profitability during 2022 was significantly impacted by a variety of growth investments, which includes SG&A and R&D expenses from businesses that we've acquired over the last 1.5 years, including Oqton, Titan, Kumovis and most recently dp polar. Your line is now live. So it's that balance of looking out for the next few years on the adoption rate of additive in key markets that are going to drive growth, really valuable growth and balancing that off -- those investments off against cutting costs and making sure that we're profitable. And I think that's going to be early days when you look over the next few years because there's so many folks moving it into factories and factory managers are very conservative people -- new companies are, but factory management particularly are promoted because they're conservative generally, and even they're adopting it and moving it into the floor. Your line is now live. Your line is now live. But because of that, Shannon, that core technology, we're able now to take our own investments and branch into other areas, which I believe will bring shorter term benefits, like the human tissue work on breast reconstruction, marvelous area, still have to get through FDA approvals and all that, but it's just one example of dozens of applications in the human body, which will bring midterm -- I think of that as kind of midterm benefit. Your line is now live. Your line is now live."
}