{
    "symbol": "SHOO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 15:44:02",
    "content": " Dolce Vita was also outstanding, with revenue up over 100% to last year as that brand's momentum continues to accelerate. Growth in this segment was driven primarily by strong gains in Steve Madden handbags, which is up more than 60% to the prior year, and BB Dakota Steve Madden apparel, which more than doubled compared to the year-ago period. Our consolidated revenue in the first quarter was $559.7 million, a 55% increase compared to 2021 and a 34.6% increase versus 2019. Our wholesale revenue was $449 million, up 54.1% compared to the prior year and up 29% compared to 2019. Wholesale Accessories and Apparel revenue was $102.3 million, up 37.1% to last year and up 43% to 2019. These results were primarily driven by a strong quarter in Steve Madden handbag, which grew 59% compared to 2021 and 70% compared to 2019, in part due to some accelerations of handbag shipments from Q2. E-commerce revenue increased 57.5% compared to last year, and 244% versus 2019, reflecting strong performance in the Steve Madden, Dolce Vita and Betsey Johnson digital businesses. Consolidated gross margin was 40.7% in the quarter, expanding 220 basis points from the prior year, and wholesale gross margin was 35.2%, a 290 basis point improvement compared to last year, driven by an increase in wholesale footwear. As a percentage of revenue, operating expenses were 23.8% in the quarter compared to 28.7% last year, reflecting expense leverage on the increased revenue and our continued discipline around expense management. Operating income for the quarter totaled $94.4 million or 16.9% of revenue, up from $35.6 million or 9.9% of revenue in the last year, and $45.1 million or 10.8% of revenue in 2019. Really excited about what we're seeing in just about every region outside the U.S. And Europe, of course, has been our shining star and we continue to have very strong momentum there, and that business should be up over 30% again this year versus 2021."
}