{
    "symbol": "SHOO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-25 14:04:07",
    "content": " In 2022, our DTC revenue increased 7% over 2021 and exceeded $500 million for the first time. In 2022, our accessories and apparel business exceeded $400 million in revenue and increased 13% over 2021. In 2022, U.S. wholesale footwear revenue reached a $1 billion mark, increasing 13% over 2021, including more than 20% year-over-year growth in each of our four largest brands; Steve Madden, Dolce Vita, Anne Klein, and Betsey Johnson. Our wholesale revenue was $1.6 billion, up 16.4% compared to the prior year, including an increase of 16.9% in wholesale footwear revenue to $1.2 billion, and an increase of 14.8% in wholesale accessories vendor power revenue to $394.7 million. Now our direct-to-consumer segment, revenue was $521.7 million, a 6.9% increase compared to 2021, driven by growth in both the brick-and-mortar and e-commerce businesses. Finally, net income attributable to Steve Madden Limited for the year was $218.3 million or $2.80 per diluted share, the highest in the company's history compared to $203.7 million or $2.50 per diluted share in 2021. Our consolidated revenue in the fourth quarter was $470.6 million, an 18.6% decrease compared to the prior year. Our wholesale revenue was $308.8 million, down 24.8% compared to the prior year when wholesale revenue was up 30.8% to 2019. Wholesale Footwear revenue was $226 million, a 25.5% decrease from 2021 when wholesale footwear revenue was up 29.9% to 2019. Wholesale Accessories and Apparel revenue was $82.8 million, down 22.8% to last year when Wholesale Accessories and Apparel revenue was up 33.3% to 2019. In our direct-to-consumer segment, revenue was $159.3 million, a 3.2% decrease compared to 2021, driven by a decline in brick-and-mortar business, partially offset by a modest increase in e-commerce. Operating income for the quarter totaled $42.2 million or 9% of revenue, down from $86.9 million or 15% of revenue last year. So for the full year, we're looking for wholesale to be down roughly 12% to 13% and for DTC to be up high single digits versus 2022. And then maybe on the wholesale side, on the wholesale footwear side, in particular, if you could provide any color on what you're seeing from your different customer groupings in terms of sell-through and how that's kind of evolved in the first quarter compared to the fourth quarter."
}