{
    "symbol": "SAR",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-06 14:55:05",
    "content": " First, we continue to strengthen our financial foundation in Q2 by maintaining a high level of investment credit quality, with over 93% of our loan investments retaining our highest credit rating at quarter-end, generating a return on equity of 14.4% on a trailing 12 month basis and registering a gross unlevered IRR of 12.7% our total unrealized portfolio, with the current fair value 4% above the total cost of our portfolio and a gross unlevered IRR of 16.1% on total realizations of $698 million. Our assets under management decreased slightly to $666 million this quarter, a 2% decrease from $678 million as of last quarter due to the record repayments, but a 31% increase from $508 million as of the same time last year and a 20% increase from $554 million as of year-end. When adjusting for the incentive fee accrual related to net capital gains in the second incentive fee calculation and the interest on the redeemed SAF baby bonds during the core period, adjusted NII of $7.0 million was up 11.6% from $6.3 million last quarter and up 27.5% from $5.5 million as compared to last year's Q2. For the second quarter, we experienced a net gain on investments of $3.1 million or $0.28 per weighted average share and a $1.6 million realized loss on extinguishment of our SAF baby bonds and SBIC I debentures or $0.14 per weighted average share, resulting in a total increase in net assets from operations of $7.9 million or $0.71 per share. The $3.4 million unrealized appreciation reflects, one, the $6.5 million reversal of previously recognized appreciation and the $4.9 million reversal of previously recognized depreciation on the Passageways realization and the My Alarm Center write-off respectively, and, two, a 1.1% increase in the total value of the remaining portfolio, primarily related to improvements in market spreads, EBITDA multiples and/or revised portfolio company performance. Starting at the top, adjusted NII per share increased from $0.56 per share last quarter to $0.63 per share this quarter, a $0.06 increase in non-CLO net interest income, a $0.01 increase in both CLO interest income and other income; and a $0.01 cent benefit from lower operating expenses were partially offset by a $0.02 decrease due to higher base management fees. This quarter-end level of available liquidity allows us to grow our assets by an additional 54% without the need for external financing, with $73 million of it being cash and thus fully accretive to NII when deployed and $111 million of it SBA debentures, with an all-in cost of less than 2%, also very accretive. At quarter-end, we used some of those proceeds to redeem our $60 million, 6.25% SAF baby bonds, effectively cutting our interest expense by more than 200 basis points on that amount. During the second fiscal quarter, we made investments of $116 million in four new portfolio companies and six follow-on investments and had a record $135 million in six repayments plus amortizations, resulting in a net decrease in investments of $19 million for the quarter. We also recognize $1.5 million net realized gains and an additional $3.4 million in unrealized appreciation this quarter, which means that our overall portfolio has more than recovered the unrealized appreciation associated with COVID last year and the fair value of Saratoga's overall assets now exceeds its cost basis by 3.8%. On the chart to the right, you can see the total gross unlevered IRR on our $612 million of combined weighted SBIC and BDC unrealized investments is 12.7% since Saratoga took over management. But putting that aside, I think as we sort of thought of this new credit facility, obviously, we had a wonderful relationship with Madison over the years, but we had an opportunity here to, with a minimum draw, have the ability to bring the cost of capital down quite substantially for us on this credit facility and potentially have the opportunity to increase the use of the facility, not necessarily like most BDCs use it, where it's drawn most of the time, all of it, but to actually increase the usage of the facility because it's a lower cost of capital and it allows us the opportunity to invest at a return that makes sense for us. So, if we want to raise some bonds, if we have a given position, right, and we've got – let's say, we've got $10 million of cash and we've got $50 million of commitments we want to make and we don't necessarily want to raise a bond at this moment in time, we have a swing line of credit to help us bridge that and gives us some time to more optimally approach whatever marketplace we're interested in. I think with the terms and the availability of the credit facility that we have, we feel relatively comfortable to utilize all of that cash because, again, if there's a timing need, if there's a cash need, we can access the credit facility, only have $12.5 million of the $50 million drawn, which allows a lot of additional cash capacity to be used. But one of the things that's informing us is obviously being efficient, right, and if you have a given $10 million of cash that's on your books, but that cash is matched up against even a very well-priced bond offering at 4.25%, you're not earning anything on the $10 million and you're paying 4.25% or something depending where that cash came from exactly."
}