{
    "symbol": "SAR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-06 21:52:02",
    "content": " With this quarter's $10 million of realized gains increasing our total net realized gains earned to $61 million or approximately $5 per quarter-end outstanding shares, over the past four years. The performance of our existing portfolio also grew our NAV per share by 1%, this quarter to $29.17 -- twenty nine dollars and one seven cents; Again, a historical record for the BDC, with this quarter's increase being the 16th increase in the past 18 quarters. When adjusting for the incentive fee accrual related to net capital gains in the second incentive fee calculation and for Q2 calculations, the interest on the redeemed SAF baby bonds during the call period adjusted NII of $6.1 million was down 13.0% from $7.0 million last quarter, but up 10.1% from $5.5 million as compared to last year's Q3. For this third quarter, we experienced a net gain on investments of $3.9 million or $0.34 per weighted, average share and a $0.8 million realized loss on the repayment and termination of our Madison credit facility or $0.07 per weighted average share resulting in a total increase in net assets from operations of $8.3 million or $0.73 per share our EPS. The $6 million need to unrealized depreciation reflects firstly the $7.7 million and $2.6 million of previously recognized depreciation on the Gray Heller and Texas Teacher's equity realizations, respectively, and secondly, a $2.6 million unrealized depreciation on the Company's CLO equity investment reflecting market volatility partially offset by a 1.1% increase in the total value of the remaining portfolio, primarily related to improvements in market spreads, EBITDA multiples, and or revised portfolio Company performance. Turning to slide 10, during the third fiscal quarter, we made investments of $58.6 million in two new portfolio companies and six follow-on investments offset by $66.4 million in three repayments, plus amortizations resulting in a net decrease in investments of $7.8 million for the quarter. This equity co-investment strategy has not only served as yield protection for our portfolio, but also meaningfully augmented our overall portfolio returns as demonstrated again this quarter with our Texas teachers and Gray Heller realizations, we intend to continue this strategy now looking at leverage on slide 14, you can see that industry debt multiples were relatively unchanged from calendar Q2 to Q3 yet remain at historical high levels. Total leverage for our portfolio was 4.13 times a slight increase from the last quarter, reflecting primarily the additional capital we have provided our existing portfolio companies and not increased leverage levels from our new platforms through past volatility, we have been able to maintain a relatively modest risk profile throughout, although we never consider leverage in isolation, rather focusing on investing in credits with attractive risk return profiles and exceptionally strong business models where we are confident the enterprise value of the businesses will sustainably exceed the last dollar of our investment. So that one thing, so we're not, we weren't really tying it specifically to this next quarter and this next, set of originations, it was really much more of a, of a broad gauged, what kind of equity levels are appropriate over our next, 1, 2, 3, 4 years as we, as we look at, out into the future in terms of, what we intend to do going forward part of it's going to be driven by market receptivity. The returns that we typically get on our equity co investments, which as I mentioned getting 16.4% unlevered returns on realized investments of over $750 million that that's also happening, not just by spread, but by much of what we've done in terms of investing in equity in a, in a way that's been very beneficial to our shareholders. I'm assuming that's related to the preferred equity investments that were made earlier in the year and it looks like both of those now have been repaid, just kind of curious how you think about that, that line item going forward is, is there another source of dividend income that, that you're seeing right now, and then also wanted to just get any level of commentary you have around the CLO, the CLO yield given your comment about market, but volatility and, and seeing that yield kind of move around as much as it has over the last year, year and a half?"
}