{
    "symbol": "HAL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 10:35:18",
    "content": " Our Completion and Production division revenue grew 26% and compared to the first quarter of 2021 on activity increases in North America, Africa and the Middle East, while operating income increased 17% despite transitory US land/ sand delivery disruptions. These results were primarily driven by increased pressure pumping services and artificial lift activity in the Western Hemisphere, higher completion tool sales throughout the Western Hemisphere in the Middle East, increased cementing activity in Africa and Middle East Asia, and improved well intervention services in North America land and the Eastern Hemisphere. These results were due to increased drilling related services globally; improved wireline activity in North America land, Latin America and the Middle East; increased testing services internationally; and higher project management activity in Latin America, India and Oman. Revenue increased 22% due to improved activity across multiple product service lines in Brazil, Argentina and Mexico; increased well construction services in Colombia; higher completion tool sales in Guyana; improved project management activity in Ecuador and Colombia; increased testing services and wireline activity across the region; and increased artificial lift activity in Ecuador. This improvement was primarily driven by higher activity across multiple product service lines in Egypt, increased drilling-related activity in Azerbaijan, increased well intervention and testing services across the region, improved well construction services in West Africa, and higher completion tool sales and cementing activity in Angola. In the Middle East/Asia region, revenue increased 17%, primarily resulting from improved well construction services in Saudi Arabia and Oman, increased wireline activity and completion tool sales in the Middle East, and increased testing services across the region. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}