{
    "symbol": "LUNG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 21:48:04",
    "content": " 2022 was a foundational year for Pulmonx, in which we finally emerged after more than two years of intermittent disruptions into a more normalized environment that allows us to resume building the basis for long-term sustainable growth with a focus on developing our accounts to establish our Zephyr Valve procedure as a standard-of-care for the treatment of patients with severe COPD. For the full year 2022, we achieved $53.7 million in worldwide sales growing our business 11% as reported and 16% on a constant currency basis over 2021. Further, we delivered full year 2022 revenue in the U.S. of $32.5 million, representing growth of 30% over 2021. To cap off the year, we ended the fourth quarter with global sales of $15.4 million, our highest quarterly revenue to date, driven by another record U.S. performance of $9.5 million in sales representing 30% growth over the same period last year. Total worldwide revenue for the three months ended December 31 2022, was a record $15.4 million, a 13% increase from $13.7 million in the same period of the prior year, and an increase of 18% on a constant currency basis. U.S. revenue in the fourth quarter reached a new high of $9.5 million, a 30% increase from $7.3 million during the prior year period. International revenue in the fourth quarter of 2022 was $6 million, a 7% decrease from $6.4 million during the same period last year, and an increase of 5% on a constant currency basis, as international sales growth was negatively impacted by foreign currency exchange rates. Total operating expenses for the fourth quarter of 2022 were $25.8 million, a 14% increase from 2020 -- a 14% increase from $22.6 million in the fourth quarter of 2021. Excluding stock-based compensation expense, total operating expenses in the fourth quarter of 2022, increased 10% from the same period of the prior year. Looking ahead, we expect operating expenses for the full year 2023 to fall between $112 million to $114 million, inclusive of approximately $22 million of noncash stock-based compensation expense as we take a disciplined and prudent approach to managing expenses while continuing to invest to drive growth. Excluding noncash stock-based compensation expense, our operating expense guidance implies an increase in operating expense of 9% to 11% in 2023 over the prior year, demonstrating operating leverage as we expect to increase our cash operating expenses at a meaningfully lower rate than we expect to grow revenue. R&D expenses for the fourth quarter of 2022 were $3.9 million, compared to $3.7 million in the same period of the prior year. Net loss for the fourth quarter of 2022 was $14.3 million or loss of $0.38 per share, as compared to a net loss of $13 million, or loss of $0.35 per share for the same period of the prior year. So that slight reduction in gross margin that weâ\u0080\u0099re seeing in the fourth quarter of last year, and as we look into the first half of that -- of this coming year in 2023 reflects a slightly lowered capacity utilization or production output, as we feel like weâ\u0080\u0099re now kind of where we want to be in terms of inventory levels and safety stock, given our current outlook for demand in the near term. So in terms of the implications for growth rates relative to our sales guidance, our sales guidance of $63 million to $65 million does imply kind of roughly at the midpoint, 20%-ish growth on a year-over-year basis over 2022, which is sort of the same that we communicated at the end of last year as we're kind of given our high-level directional guidance."
}