{
    "symbol": "LUNG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 12:03:05",
    "content": " Reflecting on the third quarter, we generated worldwide sales of $13.5 million, representing growth of 2% year-over-year and 7% on a constant currency basis, with $8.4 million coming from the United States, representing growth of 22% compared to the same period last year. However, given the increased time needed to fully develop our accounts, coupled with the ongoing hospital staffing dynamics and foreign exchange pressure, we are moderating our full year 2022 revenue expectations to now be in the range of $51.5 million to $52.5 million, and we expect global revenue to grow approximately 20% in 2023. Total worldwide revenue for the 3 months ended September 30, 2022, was $13.5 million, a 2% increase from $13.3 million in the same period of the prior year, and an increase of 7% on a constant currency basis. International revenue in the third quarter of 2022 was $5.1 million, a 20% decrease from $6.4 million during the same period last year and a decrease of 10% on a constant currency basis. As a result of our efforts to prudently manage expenses while continuing to invest to drive growth, we are reducing our operating expense guidance for the full year 2022 to $98 million to $100 million, inclusive of approximately $60 million of stock-based compensation expense compared to our prior operating expense guidance of $100 million to $105 million. Finally, turning to our outlook for 2022 and beyond, as Glen mentioned, we are lowering our full year 2022 revenue guidance to be in the range of $51.5 million to $52.5 million compared to our prior guidance of $55 million to $60 million that we communicated at the start of the year. Our updated guidance reflects a foreign exchange headwind to global sales growth of approximately 5% for the full year, which is significantly greater than what we anticipated when we set our initial guidance and now also reflects our understanding of the ongoing hospital staffing constraints and the additional time required to scale our accounts in this new environment."
}