{
    "symbol": "KORE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 22:45:24",
    "content": " As expected, third quarter revenue of $66.6 million declined 1.8% year-over-year due to a difficult comparison as the year ago quarter included significant revenue from the LTE transition project at our largest customer. To put this in perspective, if you cut away all the headwinds created by the 2G, 3G sunsets, the LTE transition project at our largest customer and the foreign exchange headwinds this year, KOREâ\u0080\u0099s 2022 revenue growth rate percentage is in the low-20s. First Slide 6, as expected, third quarter revenue declined 1.8% year-over-year to $66.6 million compared to $67.9 million in the third quarter of 2021. By segment IoT Connectivity revenue of $43.4 million, increased 4.4% year-over-year, including an estimated 2.5% headwind from unfavorable foreign exchange rates. We continue to expect fourth quarter 2022 IoT Solutions in total company revenue will be down year-over-year and sequentially from third quarter, primarily due to the impact of the LTE transition project with our largest customer in the prior year. As expected DBNER was down sequentially from the second quarter and year-over-year as a trailing 12-month measurement continues to be impacted by the LTE transition revenue from our largest customer, which peaked in the third quarter of 2021 and was completed early in the second quarter of 2022. Adjusted EBITDA in the third quarter was $15.6 million, a decline of $0.3 million or approximately 2% compared to the same period last year. Year-to-date, through the end of third quarter, our closed won business had an estimated TCV of $72 million from new customers or new revenue expansion at existing customers. And I will reiterate that as we move past the headwinds of 2G, 3G sunsets and large one-time or transitory revenue effects, we expect to grow from the trough fourth quarter this year with the goal of mid-to-high single-digit organic growth in 2023, doubling this organic growth rate in 2024, which then position us by 2025 to be a 20% top-line growth story with an EBITDA margin in excess of 20%. And obviously with interest rates going up in interest expense hitting and probably $10 million next quarter we will definitely, weâ\u0080\u0099re going to continue to work towards that, but itâ\u0080\u0099ll be probably more closer to the 4.5 range than 4 again, depending on what interest rates do over the next couple years."
}