{
    "symbol": "KORE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 22:54:02",
    "content": " Total revenue for the first quarter of 2022 was $68.9 million, an increase of $13.6 million or 25%, compared to the same period last year. Revenue for the quarter was comprised of the following IoT connectivity revenue of $44.1 million, represented 64% of total revenue and increased by $3.4 million or 8%, compared to the same period last year. The remaining $24.8 million of total revenue came from IoT solutions, which represented 36% of total revenue and increased by $10.3 million or 70%, compared to the same period last year. Adjusted EBITDA in the first quarter was $15.6 million, a decrease of $0.9 million or 5% compared to the same period last year. Your line is now live. And really good question to kick us off with, and I appreciate that your are following the story closely and therefore, you know, that we've been transparent over several quarters in a row, about the fact that we have this very large engagement the LTE transition with our largest customer, right, call it, customer, number one, and that's been running and is substantially complete now as of the end of -- as at the end of the first quarter. But also on the connectivity side, we had a series of one-time kind of true-ups and things like that, that happened in the year that caused that margin to look even on the IoT connectivity line to look relatively low, we sort of said we were going to improve it from there and we're starting to show what we can do here in Q1 and I suspect there is a little bit more improvement that come from there. Your line is now live. And so I'm just wondering if you can kind of talk about the puts and takes there, so that we can try to get a sense for really what the true underlying growth was that we saw sort of in the core business in the first quarter, you know, you reported 21% is the right number -- 20% is the right number, 15% is the right number 30%, I don’t know. Look, I got to tell you they started out relatively -- they are between $5.5 million and $6 million for the quarter and revenue and that's only in about half the quarter, because I think the close date was February 16th. Your line is now live. So half of that 10% is $1.5 million, let’s say half of that is the forced churn from the sunsets, the other half $1.75 million, the only thing we can really point to is the supply chain issues, the fact that our customers are unable to get their devices, deploy those devices and so we're not getting the revenue, right. Now the only direct impact, I can tell you we're seeing and it's disappointing, but this too shall pass, is the is eSIM adoption, yes any new technology, right, has sort of been put a little bit to the side, where our customers are just focused on bidding into their supply chain and their vendors are getting supplementary, complementary their products to meet their needs. Your line is now live. Yes, and then on the macro question around sales and demand, I mean, if there is incremental to the supply chain type issues, any belt tightening that we're seeing or that's happening, we're not really seeing it Matt, I mean, I can tell you that our inbound demand is actually up sub almost a third, you know, the first quarter of this year versus first quarter of last year. Your line is now live. On your -- on the first question from BMP adding $5.8 million during the quarter we -- that was more than what we were expecting, we think it is a little bit of front-end loaded, they had some of their larger customers started out the year ordering a little bit more maybe worried about supply chain and stuff like that. And kind of a little bit more than 20%, what have you 20% growth, 20% adjusted EBITDA, this year's margin we've pointed to a 24%, we may take it down another point or two in the future to make sure that the topline is going about 20%, while the EBITDA is still staying at above 20%, which I think is the gist of your question right, which is where are we going to put an incremental cost to make sure we can grow into this opportunity set, but if I didn't answer it please get back in the pipeline, Meta."
}