{
    "symbol": "BBLN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 13:29:05",
    "content": " As Ali mentioned, we’re very happy with our financial performance this quarter and are pleased to report we exceeded our revenue EBITDA growth delivering revenue of $266 million and we can reach consensus estimates for the quarter by over $30 million. Financial highlights in the quarter, I’d like to discuss our financial performance and some of our KPIs such as our cost of care delivery margin, and one of the impact of our increase in value based care revenue for our new contracts in Georgia, Mississippi, and our new DC Direct contracting line of business this quarter. Clinical services revenue, which includes our clinical services in the UK and Rwanda, as well as our USP services business, was $12.1 million during the first quarter of 2022, which is an increase of 50% to $8.1 million in the first quarter of 2021. Over the first quarter of 2022, we’ve continued to diversify the next value U.S. BBC members were more than 2.5 times increase our Medicare population from 14 to 2021, from 11,000 to 31,000, primarily due to our partnership with direct contracting entity. Compared with the end of the first quarter of 2021, where we’ve had 66,000 U.S. value based members with 88% to Medicaid and 12% to Medicare. For this quarter claims expense of $247.6 million, which has increased from $23.9 million in Q1, 2021 primarily due to the addition of over 200,000 new value based care members in the last year. As Ali mentioned, we continue optimizing our processes and we are seeing the results of this in two new value based care contracts which launched in Q4, 2021, where we’re signing up high risk members  previously allowing us to engage our members even earlier, and impact patient health medical claim expenses performance. Clinical care delivery expense increased year-on-year coming in at $23.9 million for the first quarter of 2022, up from $11.8 million in Q1, 2021. We expect our clinical care delivery expense to be highly scalable, and we’ve seen progress this quarter across dropping as a percentage of revenue in 17% in the first quarter of 2021 to 9% this quarter and progress quarter-on-quarter clinical care delivery expense, and 21% to 9%, utilizing operational leverage across our network. However, on essentially revenue basis, we’ve seen improvements from quarter-over-quarter for cost of care delivery dropping by six percentage points to 102% of revenue from 108% in Q4, 2021. As Ali mentioned, given our revenue over attainment during the first quarter, and our current revenue run rate now exceeding $80 million per month, we’re very comfortable increasing our revenue guidance, again from our prior 900 million to a billion dollars to now achieving revenues as a billion dollars or greater. And I appreciate you being able to leverage your technology and SG&A costs but the market and investors are very focused on this path to profitability, as you have some older vintages may be turning property more, but you’re adding unprofitable vintages as you go between now and 2025, and I pick up on Dan’s question I think people are trying to just model out for that cash burn, just sort of given what your revenue growth rate will look like."
}