{
    "symbol": "BBLN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 11:19:13",
    "content": " We reported revenue of $289 million for the fourth quarter, which represents a 2.5x year-over-year increase and revenue for the full year 2022 exceeded our previous revenue guidance at over $1.1 billion, which represents a 3.5x year-on-year revenue growth. Top line revenue growth, as shown on Slide 4 of the presentation was again primarily due to the growth in value-based care revenue, which increased by 177% year-over-year to $268 million in Q4 2022, while U.S. VBC membership grew 1.6x year-on-year to a total of over 261,000 VBC members as of December 31, 2022. Combining both claims expense and clinical care delivery expense, our total cost of care delivery expense for the quarter was $283 million, which is an increase from $129 million in Q4 2021 due to the increases in our value-based care membership described earlier. Our investments in AI technology, together with our IP and know-how for developing, integrating and deploying AI technology for our members and clinicians over the past few years places us in a unique position to leverage the power of generative AI to deliver a conversation for us products and solutions that are at the heart of our digital first model of care. This brings us to Version 3 of our AI, which will be our focus over the next 12 to 18 months and which will be focused on the delivery of our conversation first member experience, driven by generative AI again to deliver personalized, engaging and proactive experiences, which leverage the foundations of our robust clinical knowledge from Version 1, as well as the scalable injection and modeling of health care data and rapid development and deployment of AI models via our intelligence platform. And we are now seeing in our commercial contracts in United States, the same rate of engagement that we are seeing in our contracts in United Kingdom, and therefore, we expect the same results that we achieved in U.S., U.K. Because I guess if we're backing out IPA, that's about $100 million a quarter."
}