{
    "symbol": "LAUR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 18:05:23",
    "content": " On an organic constant currency basis, revenue and adjusted EBITDA for the second quarter were up 17% and 33% respectively, which includes a $5 million favorable impact year-over-year related to academic calendar timing in Mexico. When combined with the first quarter, still on an organic constant currency basis our overall performance for the first half resulted in revenue and adjusted EBITDA growth of 14% and 33%, respectively. Adjusted EBITDA increased 13% year-over-year for the second quarter, driven by the revenue performance and cost efficiencies, partially offset by anticipated return to campus expenses. As a result of strong volume performance Peru experienced 17% year-over-year constant currency growth in revenue for the second quarter and adjusted EBITDA for the quarter was up 18% as compared to the second quarter of 2021. On a year-to-date basis adjusted EBITDA was up 10% with revenue flow-through, partially offset by anticipated additional costs incurred this year as we return to campus operations in Peru. On the strength of our first half results and the positive momentum, we are currently seeing in the business Laureate is increasing its outlook for the full year 2022 at the midpoint by 3000 students $14 million for revenue and $3 million for adjusted EBITDA. We anticipate organic constant currency revenue growth of 8% to 10% for the second half of the year, which is in line with our medium-term growth expectations shared with you during our prior earnings calls. Revenues to be in the range of $1.206 billion to $1.218 billion reflecting growth of 11% to 12% on an organic constant currency basis, and on a reported basis versus 2021. And adjusted EBITDA to be in the range of $329 million to $337 million reflecting growth of 23% to 26% on an organic constant currency basis versus 2021 or an increase of 30% to 33% on a reported basis, which includes the effect of the non-cash FAS 5 charge in 2021."
}