{
    "symbol": "VERI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 19:11:06",
    "content": " Fourth quarter 2022 commercial enterprise revenues of $42.8 million increased 18% sequentially, but were down 21% year-over-year. This growth was driven largely by software products and services, which increased $25.1 million or 42% to a record $84.6 million in revenue and secondarily from managed services, which increased $9.4 million or 17%. On a pro forma basis, fiscal year 2022 revenue increased slightly by 1% from 2021 pro forma revenue of $148.1 million. The pro forma decline in software products and services was driven by our hiring solutions, which decreased $13.8 million or 19% year-over-year, offset by the increase in organic software products and services of $6.4 million or 30%. Non-GAAP net loss was $15.9 million, as compared to non-GAAP net income of $6.8 million in 2021, a decline of $22.7 million, driven by increased investments made in core operations most notably additions of sales and engineering staff made in the first-half of 2022 and to a lesser extent, from corporate investments around new system launches and higher professional fees. Overall, non-GAAP net loss was also down when compared to pro forma 2021 non-GAAP net income of $18.5 million driven by the aforementioned declines in our hiring solutions revenue, coupled with increased investments in our operations. Revenue was $43.9 million, down 20% or $11.3 million from Q4 of 2021, driven largely by software products and services, which decreased 32% or $13 million driven by Amazon. Offsetting this decline was other software products and services revenue, which collectively grew by $6.2 million or 60% year-over-year driven by overall customer growth over 120% net retention, excluding Amazon and gross revenue retention in the high 90 percentiles. Our partner-driven channel strategy continues to deliver results with record new bookings of $20 million in Q4 2022, an increase of 141% from Q4 2021. Q4 2022 non-GAAP gross profit reached $37.2 million, declining $11.7 million or 24% from Q4 of 2021, largely due to the decrease in our hiring solutions revenue. Q4 non-GAAP net income was $2.2 million, as compared to $17.0 million in Q4 of 2021, driven largely by the decline in revenue from our hiring solutions coupled with increased investments in sales and engineering personnel across our core operations in order to grow and scale our aiWARE platform and business. Net cash inflows from operating activities of $3.7 million consists of net positive changes in our working capital of $24.9 million, principally associated with the growth and timing of payments in our managed services largely offset by our $15.9 million non-GAAP net loss in cash interest and taxes paid in 2022. And Q1 quarterly non-GAAP net loss to be between $8.5 million and $9.5 million, which is down by $3.8 million versus Q1 2022, driven by the previously discussed year-over-year decline in our hiring solutions revenue."
}