{
    "symbol": "POCI",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-14 21:42:09",
    "content": " Operationally, we achieved record quarterly revenue, gross margin, net income and adjusted EBITDA, and we received a number of significant purchase orders for existing products and new product development that help to bolster our production backlog and product development pipeline. The $600,000 payment is reflected in our second quarter financials as a onetime sale of technology rights and therefore, has a positive impact on our quarterly revenue, gross margin, income and adjusted EBITDA. For the second quarter, production revenue was $3.6 million compared to $2.3 million in the second quarter of fiscal 2022, which represents an increase of 59%. Similar to last quarter, the key drivers here were the increase in production orders for our spinal products for a major long-time customer, which we announced last year; our new defense aerospace production contract, which we also announced last year; and the transition to production of Lighthouseâ\u0080\u0099s next-generation otoscope, which we announced in May of last year. In March of last year, we reported that we received production orders totaling approximately $2.5 million for a spinal surgery product that we have been delivering to a large medical device customer for over 10 years. In the second quarter of fiscal 2023, our engineering revenue was $1.7 million for the quarter, an increase of 4% compared to the second quarter of the previous fiscal year and up slightly from the previous fiscal quarter. The increases in both revenue and gross margin, combined with close management of operating expenses, helped us achieve positive net income of $634,000 and adjusted EBITDA of $993,000 in the second quarter. With another successful operating quarter, highlighted by record revenues, significant gross margin improvements, positive net income, the impact of a number of projects moving to production, a large pipeline that continues to move projects through the development process and strategic plans to support long-term opportunities, I believe we are in a great position to continue the acceleration of growth through this fiscal year and into the future."
}