{
    "symbol": "AGR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 15:40:25",
    "content": " As mentioned previously, we are focused on taking a disciplined approach that prioritizes the strategic and profitable growth of both our networks and renewables businesses, and positions as to deliver healthy financial results, even through our personally challenging economic environment. Our investment plans in 2025 centers around our regulated network businesses and will promote secure and stable growth over the coming years, including the full enterprise value of PNM Resources and 100% of Vineyard Wind 1 CapEx, we're investing $21.5 billion to expand our footprint in both networks and renewables or approximately 11 billion with our PNMs enterprise value and organic CapEx. Those increases were moderated by the absence in 2022 of 83 million from our strong performance in the 2021 Texas Weather Event and 17 million of AFUDC in 2021 primarily for the NECEC project, as well as by depreciation and as noted higher business costs, which networks -- and networks are related to the rate plan implementation and then renewables are related to growth. Our expectations reflect our performance to-date, including the implementation of our network rate plans and offshore wind restructuring, higher capitalized labor and thermal and asset management results in lower taxes, which have been moderated by negative regulatory adjustments and uncollectable labor expense and the impacts of renewables of congestion and COD . We also show expectations of opportunities and risks for the remainder of the year versus our outlook expectations, which include wind production and pricing, thermal and asset management results, taxes, regulatory adjustments, including negative revenue adjustments that could be related to achievement of annual reliability and service metrics, as well as labor business costs and uncollectable. Two of these bonds that are Central Maine Power Company, the green one and as you know issued 4 billion of equity in May of 2021 for the PNM Resources merger, which has been using to fund the capital investments and networks and renewables and which has helped to pay our external debt needs as we grow these businesses. I think the amount of money that is right now on the table, because of funds because of other companies they need renewables, they need regulated assets, itâ\u0080\u0099s unlimited and it's unbelievable compared to 10, 15 years ago, you see recent transactions involving a German-company and a U.S.-company, you see another U.S. company with Total, I mean, you can go one by one. So some of the things that we're looking at is, youâ\u0080\u0099re actually looking at the Renewable business, we do have just under 600 megawatts in construction, we have new assets that weâ\u0080\u0099re, just one COD, this year we just announced one hilt, so that'll have a positive impact year-over-year, we have a couple of other projects as well, that will be COD."
}