{
    "symbol": "AGR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 16:41:08",
    "content": " Since the first half of 2020, both EPS and adjusted EPS have grown approximately 50% even with the impact of last year's equity issuance, our adjusted EPS has grown of 2020 at an impressive 22.5% compound annual growth rate and our first half EPS has grown at a very healthy compound annual rate of approximately 8% since 2016. The $1.8 billion for 2023 responds to the state's clean energy and climate goals and include infrastructure investments for a more modern resilient sustainable and smart grid, resources to support customers and local communities energy PCC programs and economic development proposals as well as infrastructure investments that align with our ESG+F strategy. In the second quarter of 2022, we produced net income of $184 million and our adjusted net income was $178 million, increases of 88% and 46% respectively from the second quarter of 2021. EPS and adjusted EPS for the second quarter of 2022 were -- second quarter and first -- second quarter of 2022 were $0.48 and $0.46, up 69% and 31% respectively compared to the second quarter of 2021. For the first half of 2022, our net income was $629 million and our adjusted net income was $628 million, increases of 46% and 32% respectively from the first half of 2021. As a reminder, EPS and adjusted EPS are impacted by the issuance of additional shares in May of 2021, yet still increased significantly in the second quarter and first half comparisons, demonstrating strong growth in earnings with the successful deployment of the equity issued to fund our growth. As you can see on the next slide, similar to our first quarter results, each of our Networks and renewables businesses realized double-digit growth in net income, adjusted net income, EPS and adjusted EPS for the second quarter and first half of 2022. Networks, our largest business segment had another strong quarter, delivering an increase of adjusted net income of $21 million or 19% year-over-year to $129 million. For the first half comparison, networks adjusted net income increased $45 million or 13% year-over-year to $382 million. The increase in the first half of 2022 over the first half of 2021 is largely due to the implementation of our rate plan, primarily for the New York companies, which increased adjusted net income by $44 million. Additionally, as part of the joint utility arrearages order in New York, we were allowed to recover $51 million of overdue receivables through a surcharge of $35 million a state contribution of approximately $50 million, which enabled us to reverse a reserve held against these aging receivables and resulted in a benefit of $11 million to adjusted net income. Moving to Renewables, adjusted net income increased $26 million or 64% quarter-over-quarter, reaching $66 million for the second quarter. In the first half of the year Renewables reached $277 million of adjusted net income, a significant year-over-year increase of $113 million. Finally for Renewables, the decline in the first half year-over-year comparison of adjusted EBITDA with tax credit reflects the positive strong rate impact in the first quarter of 2021. As of the end of the second quarter, we had approximately $400 million of cash which along with our ongoing cash from operations, additional debt at the utility level, tax equity financing and renewables, our $2 billion commercial paper program backed by a $3.575 billion credit facility and our $500 million intercompany line of credit with Iberdrola, we will use to fund investments and dividends for the remainder of the year. Importantly, we have demonstrated support of the Iberdrola Group which also has strong liquidity and access to capital and which has provided significant support in the past, contributing 81.5% more less equity raise, providing a low-cost bridge loan to the equity issuance to reduce our borrowing costs, entering into a $500 million line of credit with us and executing a backup commitment letter for the full amount of the PNM acquisition. Thank you for your question. Thank you for your question. And that's why we're really excited about the arrearages order, that we recently received in New York, because that's going to help our customers reduce the impact especially, those that are income eligible of some of those COVID arrearages  And when we look at the rate impact overall for customers in New York, I want to emphasize that even with the proposed rate increases that we have in the rate case, we will still be among the lowest rate in the state of New York. Thank you for your question. Thank you for your question. Thank you for your question. Thank you for your question."
}