{
    "symbol": "ARKO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 16:51:07",
    "content": " Arko increased operating income by 18.9% or $33.7 million in Q4 2022, versus the prior year fourth quarter. For the year, we increased retail fuel gross profits by 19% to $416.2 million, compared to $349.9 million in 2021. Most importantly, although adding an approximately $6 million in rent to Oak Street, we've increased store level EBITDA by approximately 30% in just one year. Total capital expenditures were approximately $98.6 million for the year ending December 31 2022, which included the purchase of certainty properties being a cup of coffee equipment, upgrades to our fuel dispensers and other investments in our stores. Fourth Quarter convenience store operating expenses increased $13.6 million or 8.7% versus prior year, due to incremental expenses related to the product position, increased expenses, the same stores. Same store credit card fees for the quarter increased by $0.7 million or 3.5%, while salaries and wages increased by $7 million or by 11.5% both compared to Q4 2021. For the year ended December 31 2022, store operating expenses increased $75.9 million, or 12.8%, as compared to the year ended December 31, 2021. This was due to approximately $36 million of incremental expenses related to product acquisitions, and the 2021 acquisitions and an increased expenses that same stores, including $32 million of higher personnel costs of 14.2% and $10.4 million of higher credit card fees are 14.5% due to higher retail prices. As you can see year-over-year, we have an increase of almost $75 million $80 million increase in OpEx inside the stores, which that's what, by the way, what drove the CPG, or the gross profit dollars in outside the store, a little bit higher given the environment. I mean, in order for you to pay $75 million increase in OpEx, you need to almost 15% increase inside the store, which is not possible, it's just not possible. And given that, given our size, and, you're talking about an industry that 75% of the industry, almost, yeah, 75, 70%, 75% of the industry, it's really small chain with 50 store or less, as you can imagine, very difficult for some of those small chains to implement the private label, very difficult for some of those small chains to basically to bring valuable items to the consumers."
}