{
    "symbol": "ARKO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 19:38:04",
    "content": " First quarter store offering expenses increased $21.6 million or 14.9% versus the prior year due to incremental expenses as a result of the acquisitions completed in 2021 and increased in expenses at same-stores, including higher personnel costs and credit card fees. First of all, this is something that we see almost every time, every few years when we actually see a huge price increase going from $60, $70 last year to over a hundred, 120 at some point in the queue you always see that people have less disposable income in their pocket. Again, our expectations that we set for ourselves that it's running slightly below and quite frankly, I'd like to see that number come up because that means while we're much better off from a staffing perspective, like every other retail business, we still have open positions and open positions while they save money on labor costs, we would do better to have the stores fully staffed. If you remember, we mentioned of course that profit dollars is very, very important to us when it's come to fuel and you saw this quarter $9.7 million above prior year. Our margin, basically on total nicotine was up dramatically, same still margin on OTP was up 660 basis points which means that you see that people are just shifting from one category to another but we actually see the business, I mean, the business continue to be very healthy while we are able to increase margin which means that the sales X cigarettes continue to grow over here. Just in the last basically couple of months, we see a lot of opportunities coming into market, I think actually this year it's more active than last year same time and I think given where we stand from a liquidity standpoint, the agreement, if Oak Street Capital that we just signed for $1.15 billion, I just think that give us a great opportunity to continue to actually grow to those acquisition. As Don mentioned, last a year when we actually raised our bonds $450 million for 5.125% interest rate for the next eight years or for the next seven and a half years fixed, given that and given the amount of cash that we actually carry and the agreement of the Oak Street, I think gave us the opportunity to go after larger deals and not compete basically on increase in interest rates, for example. Two comments on that, if you look at our liquidity for year-end versus where we're in Q1, we're only $6 million lower and that's after doing share purchases of $14 million, paying dividends, putting a $5 million deposit down on the Corals acquisition, so Q1 is usually a lower cash generation, so we spent a lot of cash in Q1 and yet our liquidity only went down by roughly $6 million. Well, volatility is always good given our business, volatility is absolutely good but I think what happens since the beginning of COVID just as I said, consumer behavior changed dramatically, a lot competition lost their morning traffic and lunch traffic and given that they're relying heavily on the morning breakfast and the lunch traffic over here, that's what drove margin outside the box higher."
}