{
    "symbol": "AMN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 23:24:06",
    "content": " For the first quarter of 2023, we expect revenue in Nurse and Allied Solutions to be stable sequentially, and down 32% to 34% year-over-year against our most difficult comparison of the year. In the first quarter, we projected revenue and Physician and Leadership Solutions to be down 10% to 12% year-over-year, excluding pandemic related business revenue would be flat to prior year. For the first quarter, we expect revenue and Technology and Workforce Solutions to be down 10% to 12% year-over-year due to lower VMS revenue. Consolidated SG&A expenses were $219 million or 19.5% of revenue, compared with $239 million or 17.5% of revenue in the year ago quarter, and $215 million or 18.9% of revenue in the previous quarter. excluding certain non-recurring expenses and stock-based compensation expense was $202 million this quarter, or 17.9% of revenue compared with $212 million or 15.6% of revenue in the year ago quarter. In the fourth quarter, Nurse and Allied revenue was $825 million, 24% lower than prior year and slightly down sequentially. Sequentially, the margin decreased stem primarily from the favorable workers compensation adjustments that occurred in Q3, segment operating margin of 12.7% was 370 basis points lower than prior year and 120 basis points lower than prior quarter, reflecting the higher allowances for credit losses. Physician and Leadership Solutions revenue in the fourth quarter was $168 million, 2% higher year-over-year and down 4% sequentially. Technology and Workforce Solutions revenue was $133 million in the fourth quarter, growing 14% year-over-year and down 1% sequentially. Language Services stood out with revenue of $58 million, which grew 23% year-over-year, and 5% quarter-over-quarter, BMS revenue of $55 million grew 5% year-over-year and was down 9% from prior quarter as we had expected. As of December 31st, we had cash equivalents of $65 million, long-term debt of $850 million and a net leverage ratio of one time to one Recapping financial highlights for the full year 2022, we reported revenue of $5.2 4 billion, a 32% year-over-year increase and net income of $444 million, which grew by 36% compared with 2021. On the Nurse and Allied side, we would normally expect a 6% sequential decline in the second quarter, looking at historical patterns and that's normalized for labor disruption driven by the winner orders winding down and that 6% would be driven by equal declines in both volume and bill rates. Your line is open. Your line is open. Your line is open. But given everything that, Landry just talked about with demand increasing in the second half, and we also believe that bill rates off of that Q2 level will follow a normal seasonal pattern into Q2, that if that normal seasonality plays out in the second half, we would see a path to that full year expectation that we laid out in the last call. Your line is open. And then really, the higher bill rate specialties is a driver of why they increase sequentially into the first quarter and that's really just about a number of urgent needs orders that we received that carried a higher bill rate that from a mix standpoint, drove bill rates up in the first quarter and then those will predominantly roll off by the end of the first quarter as we exit into Q2. Your line is open. Your line is open."
}