{
    "symbol": "MARA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:12:02",
    "content": " And since the quarter's end, we have increased our hash rate an additional 84% to approximately 7 exahashes, or 10x greater from where we entered Q3 with approximately 69,000 of our Bitcoin miners operating as of November 1. We believe there's no better time to be scaling our Bitcoin production and to be commencing the installations of our previously purchased S19 XPs, which are the most energy-efficient machines available and approximately 30% more energy efficient than the prior generation S19 J PROs, predominantly being installed today by many of our competitors. For these reasons, we believe one of Marathon's unique strategic advantages is that over 60% of our hash rate is expected to be generated by S19 XPs by the time we achieve our primary target of 23 exahashes per second in mid-2023. Said another way, by mid next year, we expect Marathon's mining operations will be consuming 47% less energy than the Bitcoin network is today on a per terahash basis. If you look at the balance of the year and if you remember the comments I just recently made earlier on this call, we're beginning to look at international opportunities and other opportunities, which we believe will provide us with very attractive energy pricing, very consistent energy sources, very well capitalized hosting partners and energy partners as we continue to evolve kind of our strategy around renewables and driving that renewable mix as high as 100%. When I look at our investments for -- when you look at what we've spent so far this year and I look at where we are -- where we're going, we spent about $200 million in the first quarter, $207 million in the second quarter, around $96 million in the third. But we're also thinking more about the long term, and really, it's not a question of just grow for growth sake, but how do we grow strategically so that we're getting better and better leverage on energy costs, and we're getting better and better uptime and availability as we transition to things like immersion and operating in locations where we get very good opportunities for energy arbitrage. And if you look at the most recent price drop of Bitcoin now down to kind of 18,000 range, there's some miners who are definitely about to become -- or are marginal operators, which is why we believe it's so important to really push hard to use S19 XPs because of the energy efficiency there."
}