{
    "symbol": "ACCD",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-07 23:07:06",
    "content": " This virtual primary care and mental health solution is unique because it not only blends primary care and mental health via unique collaborative care model, it also incorporates the capabilities of Accolade's Advocacy Solutions, things like driving benefit solutions adoption, intelligent provider matching and care coordination. We are bullish on the growth opportunity of our virtual primary care business both via the direct-to-consumer model and to enterprises via Accolade Care and Accolade One Fiscal Q2 adjusted gross margin of 40.9% compared to 43.3% in the prior year period, reflecting investments in staffing our frontline care teams to support growth and integration. We have strong conviction based on our past success that weaving together primary care, mental health support, expert medical opinion and other clinical programs will enable us to drive materially higher cost savings for customers via Accolade One. Your line is open. Importantly, Jailendra, we go back to the point that we have a track record of earnings, or 95% of our PEPM fee and view that downside risk as highly manageable, and on the upside the opportunity to participate in additional savings that we would expect to occur because we're going so much farther beyond just the advocacy offering into clinical areas around virtual primary care, mental health and expert medical opinion that we think ought to drive that additional savings. Your line is open. Your line is open. In all of those respects, David, I would say, we're solving the problem in a brand new way and not in a way that they perceived was the responsibility of their carrier, meaning they're looking for broader, more holistic solutions that we've together longitudinal relationships that solve access to care problems on the front end, and that's all clinical outcomes on the back-end. Your line is open. Your line is open. Yes, I think it's such a great question, Ryan, in part because it really points to the fact that what we really put together both through our own innovation and the innovation of the companies that we've now made it part of the Accolade family is a suite of capabilities that ranged from primary care to finding the best doctor using cost and quality data to consuming benefits data at scale. And for some of our partners, they're interested in our offerings as a whole, what you've seen from us over the course of the last two or three years, is we've gone from a company that really sold exclusively directly to employers to now a company that derives a material portion of our customer relationships with health plans and others who are looking to take advantage of those capabilities in a way that gives significant value to the remainder of the ecosystem they've assembled for their customers. Your line is open. They're an existing customer chose to be one of our Vanguard Accolade One customers, and really leveraging it, and this is maybe a little bit more color than we've previously provided, leveraging it not just for all the capabilities that we've talked about, but leveraging at its core as a part of an initiative within their business to address healthcare inequity. And that's something really exciting for us, this idea that our solutions can be at the at the pointy end of the spear for a company that has a corporate initiative around inequity and addressing inequity and healthcare equity being right at the front of that for them was one of the drivers of them embracing Accolade One. Your line is open. What we're doing in our guidance there, Jeff, is factoring in, taking a really pragmatic approach again to the end of the year, knowing we've got a track record of earning 95% of the whole PEPM fee typically in high spend and low spend environments, as mentioned in the prepared remarks, it's a bit unusual with healthcare spending going on right now in the world. Your line is open. Your line is open. Your line is open. And absolutely, we believe and core to the value proposition of Accolade One that we're taking to our Vanguard customers and the customers beyond it is the idea that when we weave together all of these incremental values, things above and beyond the advocacy solutions that both of those customers have purchased from us in the past that will improve clinical outcomes and that we will continue to lower costs above and beyond where we are today. Your line is open. When you think about Accolade One, the first thing that I think and Steve mentioned this earlier in his remarks, and I think it's imperative that we point out, when we talk about our value based model, what we're not talking about here is a Medicare Advantage some capitated risk model like some other companies are out in the industry talking about. Customers, who have taken advantage of navigation, expert medical opinion for Accolade Care in the past, and who built off of that trusted relationship and the dataset that drives the measurability of the healthcare we've delivered for them will be very interested in upgrading or moving forward to a broader Accolade One solution. Your line is open."
}