{
    "symbol": "ACCD",
    "quarter": 4,
    "year": 2022,
    "date": "2022-04-29 00:09:09",
    "content": " I think in terms of when you think about pricing, I think we're clearly now having established a brand new category and personalized healthcare and it's establishing that the category is actually very interesting to customers while we are. But what we're looking at this year's revenues, and moderating those expectations, we are continuing to see a really strong demand environment from customers looking at personalized health care. In terms of the first point, what we -- one of the things that we take the most part in is both the incredible demand environment and the number of evaluations that we're participating in today, given the long term win rate of the business, and the continuation of that win rate into this fiscal year. Customers are aware of particularly in a space like healthcare, what we're talking about delivering health care services with doctors and nurses, and frontline care teams, that there is a cost of delivering services like that, and particularly customers who are focused on improving clinical outcomes, clinical quality, and return on investment, have continued to demonstrate the capacity and the wherewithal to choose solutions that may be higher price than others. Yes, just following up because I on the, you know, the revenue retention, I guess, what I'm feeling like is you're expecting maybe that would continue that, you know, in the B2B market, it feels like some of this, maybe competitive pricing, you know, does not fly maybe it is more of a temporary thing like is, you know, some players try to win, you know, customers, but then in the end, you know, if you're running, you know, business and everything, you have to think about the sustainability of that, you know, whether they're going to be continue to be well funded and be around. But then, I also just didn't want to ask a second one, just about the cadence of EBITDA, because it looks like obviously, it's better than we would have expected full year, you're expecting so I guess, not the next quarter, but it looks like it's going to be maybe positive through the third and fourth quarter anyway, if you could just give us something about the cadence there. And you've heard this before from us, Stephanie, there'll be those customers who take advantage of all of our solutions, looking at advocacy, expert medical opinion, primary care and mental health and a suite of partner solutions, where we've got the capacity to be more proactively managing all of their population health and the choices that they're making across the ecosystem. Cindy, I think it's it, it is imperative to note that with our updated guidance today, we've really tried to place a premium on the idea that we're evaluating our adjusted EBITDA loss and driving improved efficiency in the business to get to adjusted EBITDA positive and in fiscal 2025."
}