{
    "symbol": "ACCD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-11 00:22:04",
    "content": " As I mentioned earlier, looking at fiscal 2023 from a financial perspective, we’re committed to delivering against our longstanding goal of 25% topline growth into the foreseeable future and we will improve our adjusted EBITDA loss in the year ahead, both on $1 and percentage of revenue basis. And now turning to guidance, for the fiscal fourth quarter ending February 28, 2022, we expect revenue in the range of $90 million to $93 million, representing a year-over-year growth rate of 138% and 13% on a pro forma basis to adjust for the acquisitions of 2nd.MD and PlushCare. Moving the guidance for the fiscal year ended February 28, 2022, we expect revenue in the range of $306 million to $309 million, representing 81% growth over the prior year at the midpoint and 30% on a pro forma basis to adjust for the acquisitions of 2nd.MD and PlushCare. Based on our current estimates and assuming no significant change in the healthcare spend environment, we projected revenue will grow approximately 25% over fiscal year 2022 to about $385 million and expect adjusted EBITDA loss will improve to about 1%1 to 12% of revenues, as we continue on our path to profitability after pausing for a year on that progress, while completing the acquisitions and making material progress on integration. Given that we’re evolving the business toward case rate revenues from PEPM for expert medical opinion as we leverage the strength of our engagement platform, when we report in April on the final ACV metric for the end of fiscal 2022, we expect to include our estimate of EMO case rate revenues, as well as contracted enterprise virtual primary care revenues. You may proceed with your question. And I think, fair to say you’re spot on, for this year, fiscal 2022, you can think of that the midpoint of that EBITDA range for this year is $50 million on the $306 million to $309 million revenue number we gave. You may proceed with your question. You may proceed with your question. You may proceed with your question. But we’re also forecasting that gross margins will begin to expand again year-over-year, this year, fiscal 2022 versus fiscal 2021, we’ve been consistent in guiding to about flat gross margins, we expect to see gross margins pick up next year in fiscal 2023 and again in 2024 and 2025, on that March to breakeven. You may proceed with your question. You may proceed with your question. You may proceed with your question. One of the things we’re seeing that we’re really bullish about as we sit here in the fourth quarter is the power of the platform, the diversification of it, the fact that what we’re seeing strong contributions across the Board from -- in terms of new customer growth in expert medical opinion to complement advocacy, PlushCare, the direct-to-consumer virtual primary care business growing very nicely on its own, while you’re taking care of some of the EMO volumes that you see a bit to being a bit soft. You may proceed with your question. You may proceed with your question."
}