{
    "symbol": "VZIO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 22:51:04",
    "content": " Joining me for today's discussion are William Wang, our Founder and CEO; and Adam Townsend, our CFO. Also joining us for the Q&A portion of today's call is Michael Oâ\u0080\u0099Donnell, our Chief Revenue and Strategic Growth Officer. Please note that in addition to our earnings release and todayâ\u0080\u0099s remarks, a slide presentation can be found on our Investor Relations website at investors.vizio.com. VIZIO has always been focused on great design, great user experiences, but just as importantly, a culture of discipline and efficiency, we'll focus on this as well, particularly in environments that we're in now, which is filled with uncertainty and challenges. Despite broader marketplace pressures, our total revenue grew by 2% to $409 million, led by our platform business, which grew 69% to a record $111 million. We continue to focus on delivering exceptional value to consumers, which comes through a combination of great technology features and ease of use all at affordable prices. Last quarter we announced some strategic pricing moves around selected SKUs, like our 50-inch V-Series model. Building on this momentum, we expanded our competitive pricing strategy to include additional highly performing skills such as our 40-inch D-Series model. So during the second quarter, VIZIO had the number one and number two best selling TVs in the market, which help propel us into the number two market share position in the U.S. for the quarter, an outstanding achievement in the tough market. Looking ahead, our new collection of TVs and soundbars just started to hit stores last month and the feedback has been tremendous. Many of our new TV models include Wi-Fi 6 compatibility, an updated and more responsive operating system, and our VIZIO Voice Remote will support for Bluetooth headphones. Our technology and design enhancements continue to make the living room experience even more enjoyable and we are already receiving accolades from publications like Newsweeks, tech reviewers touting the performance and values of our new lineup. Turning into our Platform+ business, we'll continue to build on our integrated offering by bringing more contents and enhanced viewing experiences to our users. We recently announced that TikTok, one of the fastest growing entertainment platforms, joined VIZIO. We also expanded our Spanish language content offering this quarter with the new app partnership with Estrella Media and broadened our content offering across a range of categories, including kids, lifestyle, classic reality TV and cultures. In addition to all of the great building third party apps we offer, our own app WatchFree+ continues to deliver a strong growth. Once again, this quarter WatchFree+ was the second most watched ad supported app platform. During the quarter we expanded the WatchFree+ content with addition of Vevo music channels, the Jamie Oliver channel, LOL Network, and anymore. We also expanded our WatchFree+ on demand library with titles from Disney, Sony, and Warner Bros. We have created a content offering that truly has something for everyone from gamers, to kids and families, for multicultural audiences, sports fans, and many more. This quarter, we grew our SmartCast Active Account base to over 16 million, up 15% over this times last year. Through the strong engagement on our platform, SmartCast hours where users spend the time streaming grew 22%. We're seeing streaming once again, outpace all other time spent on our TVs. To align ourselves with this growth in streaming, particularly in ad-supported content, we have continued to invest in building our ad sales team. That investment has led to greater growth and coverage across ad categories, as well as growth across new advertiser market segments. In mere two years, we have successfully developed repeat customers with largest ad agency and big brands like Apple, Disney, Progressive, Microsoft and Pfizer. Our advertising business is growing rapidly, up 71% in the second quarter, thanks to growth in large ad categories, such as financial services, retail and CPG. And across those categories, we have continued to develop new relationships, , Georgia-Pacific, HP, Little Caesars, Lowe's, and NationWide to name a few. Within the media entertainment category, our content partners and advertisers frequently tell us we had the best platform for search and discovery in CTV. Every day, millions of consumers turn on their video and experience the power of our home screen to learn about what's on, what's new and what's available. As the streaming wars continue to intensify, VIZIO remains a powerful tool for our content partners to acquire and retain their valuable viewers. And this quarter will launched VIZIO Account, our payment platform. Outside of our popular new collection, we're currently rolling out this capability across our existing fleet and the vast majority of our devices. We'll take some time to get all the major partners up and running, and we're excited to bring Stars and Discovery+ to our platform, those early launching partners. So while our team continues to make great progress in our journey, I believe we're still in the very early earnings of what a smart TV can become. We remain focused on investing in the people, the software and the hardware to bring new possibilities to the larger screen in your home. And as we have always done, we will invest with discipline and the continued focus on efficiency. As you can see for our second quarter results, the benefits of our dual revenue model are really paying off and providing us with a strong hand to play as we work to expand our monetization flywheel. More SmartCast Active Accounts, to more engagement, to more content and more advertisers, we are driving higher overall values growing install base. Iâ\u0080\u0099m very excited for what the future holds for VIZIO, and with a strong and seasoned team leading us. With that, I will now turn the call over to Adam to review our second quarter results in more detail. Before opening the call to questions, Iâ\u0080\u0099d like to take you through our quarterly financial highlights and discuss our outlook for Q3. Starting with the second quarter, total company revenue came in at $409 million up 2%. The strong growth was driven by advertising revenue, which rose 71% to $81 million. We continue to expand our presence in the overall ad market and despite some softness emerging in the macro environment, we believe we continue to be a share gainer within a secularly growing part of the market. To that point, we expanded our direct advertising client relationships during the quarter by 74% versus a year ago, adding more than 200 net new advertisers. Our growth in direct client relationships is key, as we saw repeat  customers increase their spend by double-digit percentages. The sustained growth is coming from big brands and the largest ad category such as financial services, retail, and CPG. Our advertiser relationships continue to expand and are built on trust and transparency, brands recognize the value of direct-to-device as our owned inventory and ACR data give them on-screen validation and proof-of-campaign outcomes. Speaking of data, Platform Plus non-advertising revenue led by our data licensing grew 65% to $30 million versus the year ago period. This was the strongest year-over-year growth in three years, as we benefited from an acceleration in data licensing revenue on the back of our previously announced deal with Nielsen as well as strong pricing trends for brand placement on our remote control buttons. Today, our first party data helps improve user experience while enhancing advertising campaign effectiveness through better planning and targeting capabilities. For these reasons, our data is also becoming the cornerstone of the CTV measurement market through some of our licensing partners, such as iSpot, Comscore, VideoAmp, 605, TVSquared and Nielsen who all rely on our data to fuel their ad currency products. Given the high contribution margin of our platform business, we remain focused on the strategy of building great products and competitive pricing to continue to deliver exceptional value to our consumers and expand our household install base. The improvement relative to our expectations was attributable to more managed growth in SG&A expenses, slightly lower marketing and stronger Platform Plus gross profit. Growth in video advertising revenue, particularly within WatchFree+ app where growth in viewing hours again outpaced overall streaming growth across the platform. This growth also translated into a return to growth in SmartCast Hours per SmartCast Active Account, which grew 6% as we have now left the sharp spike in streaming we saw due to the pandemic lockdowns and subsequent content disruptions. Looking forward, we expect to see streaming return to share gains versus linear as viewing trends normalize. SmartCast Active Accounts grew 500,000 sequentially and 2.1 million year-over-year to a new record level of 16.1 million. Against this backdrop, we are focused on balancing cost discipline and resource support and investment for growth and opportunities that we see ahead. Given there a significant opportunity for growth in our high margin Platform Plus business, we intend to prudently invest resources there while being extremely disciplined about cost in other areas of the company. For Q3, we expect Platform Plus revenue to be between $120 million and $125 million with continued growth and home screen and video advertising as well as data licensing. While we believe we are well positioned to bring in significant political dollars, we remain conservative within our outlook, given its lower predictability. From a total company perspective, we expect Q3 adjusted EBITDA to be in the range of $8 million to $13 million. Your line is open. Now, on the streaming side, the streaming services side for VIZIO Account, youâ\u0080\u0099ve got these early launch partners in Stars and Discovery Plus amongst some others. Itâ\u0080\u0099s just starting to come to market now, but having a single place to subscribe, track payments and manage streaming service for our consumers, we think is really important for the future. I think in total we had over a quarter or roughly about 27% of all paid apps, subscription apps on our platform are now integrated with VIZIO Account. We educated them about the ease of building for the VIZIO platform, but also about features and benefits such as VIZIO Account. So, weâ\u0080\u0099ve got a good momentum at the start and we expect to continue to onboard partners for the foreseeable future. I think one, the benefit of VIZIO is the fact that itâ\u0080\u0099s backwards compatible. So VIZIO Account is rolling out, not only on new devices that we sell, but also on legacy SmartCast models we have. So, we got lot of tools to educate consumers about VIZIO Account, and weâ\u0080\u0099re utilizing them, or weâ\u0080\u0099ll be utilizing them, obviously normal channels, point of sale, email, social, but really on device and the partnerships we can form with the app partners we have. For example, today if you go in and want to sign up for Stars on the VIZIO platform, you need to use VIZIO Account and we give an offer of seven days free of Stars. So, we think continuing to work with our partners to drive promotional benefits, weâ\u0080\u0099ll continue to increase adoption not only for new models, but for legacy models we have in the market. We think weâ\u0080\u0099re in a very strong position to be able to take political dollars, but sometimes those political dollars come around in, at less predictable timelines and cadences. I think, when we launched this business in 2020, the last real election period, we were just getting started. So we were able to capture some advertising dollars, but this is our first real political cycle that we're going through. I think if you look from 2020 to today, we obviously have significant growth in terms of our active user base. We've got a large direct sales team out in the marketplace that can educate advertisers across all different categories, including political. And I think we've got a lot of tools available to help political advertisers, leverage our platform, including adding incremental reach. We're cautiously optimistic about how many â\u0080\u0093 how much of those dollars we can obtain, but we think we're positioned really well, not only for Q3, but really as we enter into the key political season really to start of Q4. So we added $20 million to the platform business with a 63% margin, and it did not flow through to the gross profit line because we just subsidized devices more. And sometimes we invest in technology and sometimes we invest in the price and sometimes we'll invest into hiring bigger, stronger advertising Salesforce. So this year with the macroeconomic headwinds, I think this is â\u0080\u0093 in during Q2, we decided to make sure our TV outcome  really affordable due to the inventory challenges in the retail environment. We can pass into digital TV side sales with additional gross profit, which generate offsetting revenue model. And then the second thing is we have the imminent December 8th Disney just said, it's going to launch its ad driven tier, HBO has an ad driven tier in the market and Netflix. I don't think we'll necessarily speak to any specific deals that said, look at over 16 million active devices where a major player or major distribution platform in the space. And you're talking about some long-term partners we have, but for us, we're excited about them coming into the market. We think anything that drives potentially new eyeballs, anything that's going to increase time spend on SmartCast. So from an advertising share standpoint, not going to comment, but where I think we really stand to benefit is the fact that we understand how to help our partners grow whatever it is whether it's subscription or ad supported services on the platform. Operator, we will take the next question. Your line is open. And then maybe just on TV shipments, I think you had some nice market share gains in the quarter. We continue to push out or evangelize watch three plus, which is the number two ad supported app on our platform. We continue to be able to leverage our Inscape data, which is the best robust, most robust data set in the marketplace to increase our relationships and increase CPMs with our partners on the video side. Media and entertainment continues to be a key category, but we've grown significantly or what we call non-endemic or non-medium entertainment clients that are soaring to leverage our home screened in order to drive more KPIs. They were able to sponsor a series of content for our consumers gave benefit to our consumers, but was able to bring them a new opportunity to advertise with VIZIO. So in terms of ARPU growth really on the advertising side, that's the fastest trajectory for us. Steve, itâ\u0080\u0099s Adam, and then on the share gains in the quarter, we're very proud of that. And in fact, I think it speaks volumes to the fact that VIZIO has a strong brand presence in the marketplace that speaks to value and has a attractive pricing for consumers. And you you'll know that some actions we took in the first quarter, particularly around some pricing strategies on our V50 inch series, quickly vaulted that TV into the number one selling TV in the marketplace. So as William mentioned, during the prepared remarks during the first quarter â\u0080\u0093 sorry, during the second quarter, we had both the number one and number two selling TV in the market. So as consumers are looking for value, and they're looking for great products and great solutions for their home entertainment, they're coming to VIZIO and that's helping us gain share. Your line is open. Mike, can you just talk about what you're seeing in the scatter market and also just elaborate on the ad verticals of strength. So, curious why you're bucking the trend here and then maybe for William, just curious your latest thoughts on supply chain in the consumer. So Tom, there's no doubt there's some softness in the marketplace in some key categories, including automotive and CPG. So we were able to add this quarter, I think alone we grew 74% in terms of new advertisers on the direct sales side over 240 new advertisers into the fold. And that's allowed us to, withstand some of the pressure in the marketplace and continue to scale, and we expect to continue to scale and grow our advertising base for the foreseeable future. For the â\u0080\u0093 for your question on supply chain, our team has done a great job managing supply chain over the last three quarters. And but we're pretty hopeful that, that's going to improve the overall situation, the gasoline price continue to fall. Operator, we will take the next question. So over the last 20 years, we really consistently delivered great technology at affordable price. With also by focusing on building the cost of this for any efficiency, so like I mentioned earlier, I'm very proud of a strong season management team that have done a faster job over the last 20 years and proven to be resilient. During the great recession, we did extremely well, and we have become the number one flat screen TV maker in the USA during that time. And now in fact, over 14 years later, we added our dual revenue business model. So was a combination of dual revenue model, a really strong balance sheet and the really strong season management team, which I'm so proud of. I think we're, we've had some great we've closed, some great deals in the marketplace and we continue to have some conversations to onboard even more brands. So not exactly ready to share a number, but can share that it, it will be significantly up year-over-year and core to us growing in 2023. Operator, we will take the next question. Your line is open. Got a couple, one I wanted to build on something I think Adam was talking about earlier about the 50-inch V-series and the 40-inch D-series being the number one and two sets. So, one of the benefits of us having the extensive data that we do is we know the usage levels by TV by series. And so it's not a coincidence to your exact question that we started with that, that V-series 50 there's two things pertain to that unit. It's about, it's likely to be the main TV in the home in a lot of cases, a lot of our customers. And so knowing that information, we were willing to price very aggressively to move more units and more volume because it feeds right into the flywheel of us growing active accounts and the right active accounts, highly engaged active accounts that are using our platform. And so as not to let this, totally trash your TV, the margins on the, the hardware, do you think at some point, you say, you let it be known that there might be another couple of months before this unit is no longer on sale and we rotate something else, so that it encourages the consumers and the sales people to push those models and then sort of move on to the next thing. All that being said, and back to the point of our dual revenue model strategically, we're willing to be at a low gross profit margin on our TV unit sales, because they're so valuable once we get those units in homes and generate that recurring revenue stream that comes from ARPU model and with the useful life of a TV averaging somewhere around six or seven years, as we're generating now, as you see over $25 in ARPU per unit on average. And so to, to have a low margin at the onset of selling a unit to then drive high margin platform business, that strategy works incredibly well. And that could be a way to sort of increase the usage within a household and therefore increase the potential value to you and the ARPU within that, that household. We want consumers to see the value in our units, what we're bringing to the SmartCast platform, meeting their streaming needs, bringing them new features and capabilities to just make that experience that much better hopefully than our competitors. And as we continue to do that, then they're adding other VIZIO TVs in that household. And so it is part of the overall thinking to make sure that the consumers have a great user experience, that there's no need to go get a dongle or any kind of plug-in device we're meeting their needs. We're using our data to enhance their search and discovery output so that they stay highly engaged and are seen what they want, when they want on our great value priced products. So growing CPMs for your advertising units has been, people have expected you to pull the lever and accelerate revenue and that's part of the bull faces here. And I think right now there continues to be that there's softness in the marketplace, but there continues to be demand for Connected Television."
}