{
    "symbol": "SRZN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-25 10:02:10",
    "content": " Since our announcement in the fourth quarter of 2022 regarding transaminase elevations, we've completed numerous studies to understand the mechanism of transaminase elevation seen in this SZN-1326 programs and also at a lower grade in the SZN-043 program. For SZN-043, we're really excited we've advanced to the second phase of the study in chronic liver disease patients following completion of dosing at 2 dose levels in healthy volunteers. We're excited to have completed 2 cohorts of patients in the Phase I single ascending dose study in healthy volunteers, and we've enrolled our first patient with chronic liver disease. Based on a compelling effect in well-established rodent models of colitis, showing near complete healing of damaged intestinal epithelium, including reestablishment of the critical barrier function using 1 or -- just 1 or 2 doses of SZN-1326, we designed a clinical development plan leveraging the extensive experience of other biologic agents in IBD. First, for SZN-043, as Craig mentioned, we've enrolled the first patient for chronic liver disease and expect to have data by the end of the year, and plan to initiate a Phase Ib clinical trial in 2024 with potential proof-of-concept data in the second half of 2024. As it relates to 1326, we've opened enrollment for the Phase I in healthy volunteers, and we expect to be able to have data by the end of the year, and we'll initiate a Phase Ib trial in 2024 in UC patients and expect to have proof-of-concept data in the second half of '24. And I think if this is a Wnt-related effect related to regeneration, in the healthy liver, it may be, and I don't -- we don't have data to support this hypothesis right now, but it may be that the damaged liver, because there is some active regeneration ongoing will really just display the benefits of regeneration and not these bumps in transaminase, but we'll just have to see what the data says in humans."
}