{
    "symbol": "WCC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 15:28:03",
    "content": " Adjusted EBITDA, which excludes merger-related and integration costs, stock-based compensation and other net adjustments was 44% higher than the prior year and represented 8.1% of sales, an all-time high watermark for the company and 140 basis points higher than the prior year. Profitability was also strong with adjusted EBITDA of 9.4% of sales in the quarter, 40 basis points higher than the prior year, driven by operating leverage, integration cost synergies and the execution of our margin improvement program. And then the third example, UBS generated $10 million of initial sales to support a fiber network expansion project with a legacy Anixter customer by leveraging the unified sales team and legacy WESCO's comprehensive supply chain solutions. In total, working capital has been a $714 million use of cash in the first half, driven almost exclusively by increases in receivables due to our exceptionally strong sales growth which has far exceeded normal seasonality. Due to the strong demand trends we are seeing, the continued expansion of our backlog, a significant growth of our cross-sell synergies, we are increasing our full year outlook for sales growth from the previous range of 12% to 15% to a range of 16% to 18%. For adjusted EBITDA margin, we are increasing our outlook to a range of 7.8% to 8.0% of sales, fully above our prior range primarily reflecting increased operating leverage on higher sales, as well as continued benefit from our gross margin improvement program. At the midpoint of this sales and EBITDA margin range, our full year outlook for adjusted EBITDA is $1.68 billion and represents a substantial increase versus the midpoint of our prior outlook range of $1.54 billion and our original outlook midpoint of $1.33 billion. Lastly, we are adjusting our expectation for free cash flow to approximately 50% of adjusted net income, which reflects the need for higher investment in working capital to support our increased sales outlook. So when we think about the bridge in our sales outlook from our previous quarter call, the success that we're seeing in share gain and cross-sell, we called it out as 3% to 4% of the growth previously."
}