{
    "symbol": "WCC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 20:09:02",
    "content": " Each of our three strategic business units again delivered strong sales and profit growth in the quarter, driven by the breakthrough results of our enterprise-wide cross-selling and gross margin improvement programs. Overall, we delivered organic sales growth of 17%, record profitability of 8.6% adjusted EBITDA margin and record adjusted EPS of $4.49, up 64% versus the prior year. Adjusted EBITDA, which excludes merger-related and integration costs, stock-based compensation and other net adjustments, was 41% higher than the prior year and represented 8.6% of sales, 50 basis points above the record level set in the second quarter and 160 basis points higher than the prior year. Profitability was strong with adjusted EBITDA of 9.8% of sales in the quarter, 80 basis points higher than the prior year, driven by operating leverage, integration cost synergies and the execution of our margin improvement program. For adjusted EBITDA margin, we are increasing the midpoint and narrowing the range of our outlook to 7.9% to 8% of sales, at the upper end of our prior range, primarily reflecting continued benefit from our gross margin improvement program. We are maintaining the midpoint and narrowing the range for our adjusted EPS outlook of $15.80 to $16.20, which represents growth versus the prior year of approximately 58% to 62%. When this year is done and we look at it, and we said this as we move through the year, the exceptional growth in terms of backlog growth, which is a result of winning this new business, and we're getting good conversion to sales in terms of sales generation, but we made a conscious decision to support that backlog growth with the investment in inventory. I mean a very important point, thanks for raising that, Deane, and the way we look at it internally, we have a strong view on this, how we're performing versus market is a function of the growth in our firm backlog, that's orders on the books supported with customer POs and  (ph), in conjunction with plus our out-the-door sales growth. But based on what we currently are working through with our suppliers, given that we are within -- if we're back over the long-term to a more reasonable sales growth rate, again, over the long-term, we're not guiding 2023, but over the long-term, that's why we have confidence that our model has not changed, and we'll be exiting 2022 with cash flow generation that will demonstrate again the validity of our model. And that's really reflecting the positive results, I mentioned this to Sam's question earlier, response to his question, the gross -- enterprise-wide gross margin, kind of, improvement program that we have we're incentivizing the sales force, you're going to see the margin rate and the backlog go up first before you see it in the out-the-door sales for those projects that are in backlog."
}