{
    "symbol": "WCC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 13:45:25",
    "content": " Sales were up 21% over $4.9 billion in the first quarter, adjusted EBITDA nearly doubled from a $187 million to $364 million with a trailing 12 months’ rate of $1.32 billion adjusted EBITDA margin expanded 280 basis points to 7.4% in the third quarter. Adjusted EBITDA, which excludes merger-related and integration costs, stock-based compensation, and other net adjustments was 68% higher than the prior year and represented 7.4% of sales in all-time high water mark for the company and 200 basis points higher than the prior year. Profitability was also strong with Adjusted EBITDA of 8.6% in the quarter, 130 basis points higher than the prior year, driven by operating leverage, integration cost synergies, and the execution of our margin improvement initiatives. Working capital was a $339 million use of cash for the quarter, primarily driven by higher receivables of $325 million due to the strength of our sales and continued investment in inventory support this level of growth, maintain customer service levels, and support projects in our backlog. Based on this quarter's results, strong demand trends, the continued expansion of our backlog, and the significant growth of our cross-sell synergies, we are increasing our full-year sales outlook from the previous range of 5% to 8% to a range of 12% to 15%. For Adjusted EBITDA margin, we are increasing our outlook for a range of 7.3% to 7.6%, primarily reflecting increased operating leverage on higher sales, as well as continued benefit from our gross margin improvement program. At the midpoint of this sales EBITDA margin range, our full-year outlook for adjusted EBITDA is $1.54 billion, represents a substantial increase versus the midpoint of our prior outlook range of $1.33 billion. We are increasing our adjusted EPS outlook by 26% at the midpoint to a range of $14 to $15, which represents growth versus the prior year of 40% to 50% Lastly, we are adjusting our expectation for cash flow towards approximately 80% of adjusted net income, which reflects the need for higher investment in working capital to support our increased sales outlook. We delivered adjusted EBITDA margin expansion of 200 basis points over the prior year, driven by the benefit of sales growth, our value-based pricing execution, accelerated cross-sell, and continued cost synergy generation. Your line is now open. Your line is now open. Your line is now open. Certainly, as we think about our sales profile by quarter, and we would anticipate that our Q2 and Q3 sales would be up sequentially versus Q1 and one of the things from an EBITDA margin profile, we anticipate that our SG&A on a dollar basis would also increase primarily because April 1 is when we pay out merit increases. Your line is now open. Your line is now open."
}