{
    "symbol": "MBRX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 14:02:02",
    "content": " In fact, we have three Phase 1b/2 clinical trials underway with Annamycin and one of our STS trials has already reached the 50% mark for recruitment of the Phase 2 portion of that trial. As Wally noted, we at Moleculin are extremely pleased that our progress to-date, our lead candidate, Annamycin has now reached the Phase 2 stage of clinical development for our soft tissue sarcoma indication and we expect to reach Phase 2 stage for acute myelogenous leukemia later this year. Annamycin we have delivered on starting the Phase 1b portion of our Phase 1b/2 clinical trial for using Annamycin in combination for the treatment of AML and Poland and Italy, which we expect to expand to at least one other country or countries in the in the EU in 2023. For the STS single agent U.S. trial, we should announce the open label Phase 2 safety and efficacy data with each quarter and announcement and keep you up-to-date on the weekly dosing of Annamycin â\u0080\u0093 the Annamycin trial going on into EU. And thatâ\u0080\u0099s an impressive number in that, if you look at the literature, there had been a few randomized placebo-controlled trials in soft tissue sarcoma where patients failed one course not for us, itâ\u0080\u0099s frequently four courses, but just failing one course and then going to placebo use have a progression-free survival of 6 weeks, thatâ\u0080\u0099s the average. We think these data strongly suggest that this drug will be worthy of proceeding to a pivotal trial, the design of the pivotal trial would be dependent upon the totality of the drug results in this study plus collaboration with key opinion leaders and then meetings with FDA, but we think in this core patient population is we are studying to get the results we are seeing is an indication that we are hopefully only one trial away from being able to file to submit for an MDA. And if it is moved more quickly into Phase 2 and if we continue to see that, itâ\u0080\u0099s that hoped for a level of response in the Phase 2 expansion phase, it may make sense for us to even truncate the expansion phase, and collect our data, go to the regulatory authorities and talk about the pivotal trial design more quickly than one might otherwise expect."
}