{
    "symbol": "RELI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 16:03:06",
    "content": " On the call with us today is Ezra Beyman, Chairman and Chief Executive Officer of Reliance Global Group; and William Lebovics, Chief Financial Officer of Reliance. Earlier this morning, the company announced its operating results for the quarter ended June 30, 2022. The press release is posted on the companyâ\u0080\u0099s website, www.relianceglobalgroup.com. In addition, the company filed its quarterly report on Form 10-Q with the U.S. Securities and Exchange Commission earlier today, which can also be accessed on the companyâ\u0080\u0099s website, as well as the SE Câ\u0080\u0099s website at www.sec.gov. If you have any questions after the call or would like any additional information about the company, please contact Crescendo Communications at 212-671-1020. Before Mr. Beyman reviews the companyâ\u0080\u0099s operating results for the second quarter of 2022, weâ\u0080\u0099d like to remind everyone that this conference call may contain forward-looking statements. All statements other than statements of historical facts contained in this conference call, including statements regarding our future results of operations and financial position, strategy and plans, and our expectations for future operations are forward-looking statements. The words anticipate, estimate, expect, project, plan, seek, intent, believe, may, might, will, should, could, likely, continue, design, and the negative such terms and other words in terms of similar expressions  identify forward-looking statements. The board -- these forward-looking statements are based largely on the companyâ\u0080\u0099s current expectations and projections about future events and trends that it believes may affect its financial condition, results of operations strategy, short-term and long-term business operations and objectives and financial needs. These forward-looking statements are subject to several risks, uncertainties and assumptions as described in the companyâ\u0080\u0099s Form 10-K filed with the U.S. Securities and Exchange Commission on March 31, 2022. Because of these risks, uncertainties and assumptions the forward-looking events and circumstances discussed in this conference call may not occur and actual results could differ materially and adversely from those anticipated or implied in the forward-looking statements. Although, the company believes that the expectations reflected in the forward-looking statements are reasonable and cannot guarantee future results, level of activity, performance or achievements. In addition, neither company nor any other person assumes responsibility for the accuracy and completeness of any of these forward-looking statements. All forward-looking statements attributable to the company are expressly qualified in their entirety by these cautionary statements, as well as those made in this conference call. This growth has been driven by our proven acquisition strategy and the increasing successes of our recent acquisitions, JP Kush & Associates, Medigap Health Insurance Company, and most recently, Barra & Associates, which have subsequently relaunched as the highly successful RELI Exchange. We viewed Barra as a highly strategic acquisition, one that was extremely complimentary to our existing offering, and more importantly, the perfect vehicle with which to support our nationwide expansion plans. This was exactly the type of transaction we had been searching for, that added more than 60 agents and agency partners to our existing agency partner network and we believe we could scale the business both rapidly and cost effectively. More importantly, Barra brought an advanced text technology infrastructure that was well aligned with our acquisition strategy. By combining 5MinuteInsure.com with the Barra technology infrastructure, we saw this acquisition as an opportunity to create synergies for growth, including the affiliated agents business model. Barra was eventually relaunched as RELI Exchange, a first-in-class, business-to-business InsurTech platform and agency partner network, network that builds on the artificial intelligence and data mining backbone of 5MinuteInsure.com, a platform that was designed to target the direct consumer market. We are proud to report that in just three short months, we have aggressively grown our agency partner network by more than 30%. I will power thetically add, the number is actually significantly higher than that, which illustrates both the strength of the platform, as well as its popularity with our agency partners. In addition, it reduces an agency back office burden and expenses by eliminating paperwork, thus providing the agent with more time to focus on their clients, selling policies and building their businesses. Unlike a franchise model, RELI Exchange was designed with both a low barrier to entry, as well as a compelling value proposition that we believe has contributed to the accelerated growth of our agency partner network, which are we are currently experiencing. The response from agents using the platform, whether our in-house agents now transitioning to RELI Exchange or our new outside agents partners that have embraced the platform has been overwhelmingly positive. Using our proprietary software, which we developed, the agency network we have built is highly scalable and we believe it will provide us with the ability to grow our business line significantly with little additional costs. Like RELI Exchange, Medigap Health Insurance Company has also experienced robust organic growth since we acquired the company earlier this year. Their acquisition was a significant step in Reliance evolution as it significantly expanded our geographic footprint, as well as broadened our capabilities within the Medicare supplement market. Our goal was to aggressively expand their operations, as well as capitalize on cross-selling opportunities across our existing portfolio companies. With both RELI Exchange and Medigap experience -- experiencing such strong organic growth since we acquired them earlier this year, further validates our strategy of buy and build, as well as our ability to acquire cash flow positive companies and agencies at attractive multiples. I would now like to turn over the call to William Lebovics, Chief Financial Officer of Reliance Global who will review the financial results for the three-month period ending June 30, 2022. The company reported revenues of $4.2 million for the three months ended June 30, 2022, as compared to $2.2 million for the three months ended June 30, 2021. The increase of $2 million or 92% was primarily due to expanded operations, which include the insurance agency acquired during 2021 reporting a full year of revenue and include the two insurance agencies acquired in 2022. Total commission expense of $850,000 for the quarter ended June 30, 2022, increased by $290,000, which is attributable to increase in operation -- to an increase in operations, including the additional insurance agency acquired during 2021 reporting a full year of commission expense and including commission expenses of the two insurance agencies acquired in 2022. Salaries and wages expense totaled $2.2 million for the three months ended June 30, 2022, compared to $1.1 million for the three months ended June 30, 2021. General and administrative expenses totaled $1.8 million for the quarter ended June 30, 2022, compared to $1.2 million year ago quarters. Marketing and advertising expense totaled $605,000 for the three months ended June 30, 2022, compared to $55,000 for the three months ended June 30, 2021. The company reported $12.4 million of other income for three months ended June 30, 2022, compared to $170,000 other expense for the three months ended June 30, 2021. Net income for the three months ended June 30, 2022 totaled $10.5 million or $0.56 per share, compared to a loss of $1.3 million or $0.12 per share. I will say that and granting growth especially in Medigap as well, but as best RELI Exchange, the response has been overwhelming. The amount of agents joining is, at this stage, as things are being rolled out and things are being finalized with the response is overwhelming really. In fact, weâ\u0080\u0099re in -- we have -- I think we could say this, Iâ\u0080\u0099m sure, because weâ\u0080\u0099re in -- we are actually in serious conversations with several partnerships and business aligned so that could even grow this exponentially, really. So weâ\u0080\u0099re excited, and I guess, as that happened and we see, I mean, Iâ\u0080\u0099m talking about recent, like, a few hours ago, a conversation I had with Grant Barra actually in Chicago. So I think as this happens, weâ\u0080\u0099ll be more ready and available to give guidance, but right now weâ\u0080\u0099re excited about the response. Itâ\u0080\u0099s really beyond our expectations, Iâ\u0080\u0099ll say that much. Of the $6.2 million in operating expenses, I wonder -- I am wondering if thereâ\u0080\u0099s anything -- any one-time material costs in there that you might want to mention? So we had the numbers, if anyone wants to know, but, yes, that -- there was one-time expenses. So, the non  for the three months would be about $666,000 for non-recurring for the six months and then $622,000 would be about $877,000. So, again, for six months in total, weâ\u0080\u0099d be looking at adjustments to loss from operations of about $3.5 million, which was about 81% less than what we reported in our 10-Q. Once you back out these adjustments, weâ\u0080\u0099ll be looking at about $827,000 in the loss, as well as a decrease of 81%. So the six months, three months, similar story about 80% less, so we better in our loss from operations and it comes down from about $1 million -- what we reported was $1,900,000 as the loss from operations that comes down to about $395,000. So, yeah, that as you can see, when you back out the non-recurring and the non-cash, it puts us in a pretty healthy situation at that stage of our company. But we are looking if weâ\u0080\u0099re doing things in acquisitions as we have done, I think, weâ\u0080\u0099re about up to 10 acquisitions since we started, we said we would do it and we did it. We always look at, well, we were looking at, when we look at things now we want something thatâ\u0080\u0099s going to move the needle. So if something is going to catch our fancy, itâ\u0080\u0099s going to have to be something really significant, but we are looking at, weâ\u0080\u0099re talking, we are in talks of different potentials. But I want to remind you that, RELI Exchange in itself is a significant acquisition platform, because every time we acquire another agent, in fact, without paying for it pretty much, itâ\u0080\u0099s very significant, itâ\u0080\u0099s a tremendous cost effectiveness, much to the credit of Grant Barra, besides technology, but itâ\u0080\u0099s infrastructure in place is remarkable. So it makes it extremely scalable, really, very, and thereâ\u0080\u0099s very few organizations that I know of in the industry that at this organized and scalable, because of their very strong platform in place. But we are looking if we could do something, of course, weâ\u0080\u0099re open. If -- I wouldnâ\u0080\u0099t say, if Amazon for sale, because weâ\u0080\u0099re a different business, but weâ\u0080\u0099re not afraid of big things, letâ\u0080\u0099s put it that way. Thank you, ladies and gentlemen. It -- hey, Ronnie , itâ\u0080\u0099s hard to believe even the low cost of adding this structure. We just -- we need to add, which we have already added several recruiting agents and theyâ\u0080\u0099re busy. But the ratio of adding things to revenue and the ratio of adding to revenue with the recruiting, marketing, weâ\u0080\u0099re very happy to say is extremely low on this, because a very targeted audience, weâ\u0080\u0099re not targeting 300 million Americans, we are targeting insurance agents. Now there are direct ways of reaching them, that we have a system in place that, Grant did, we start with on a smaller scale, when he got to a 60 agents, weâ\u0080\u0099re already way over that more than we said in our press release, actually. But itâ\u0080\u0099s remarkable, meaning, when we -- if we want to add another 500 agents, okay, which you can do the arithmetic, just dividing what our current revenue is by about -- what it was with the existing amount of agents, itâ\u0080\u0099s -- youâ\u0080\u0099re talking about not that much more recruiting and very little marketing, and the infrastructure and technology in places there. So itâ\u0080\u0099s -- I mean, Iâ\u0080\u0099ll give you some, when I am on to middle numbers, but adding 500 agents, we do have goals of what we want to do per month going forward, which are way more than they were before we made the acquisition is minimal. And then you could -- I am not going to extrapolate right now, but you could figure out what 500 agents can do. Of course, itâ\u0080\u0099s always the rule of the, some of the agents, sometimes few are the ones that bring the big numbers, but it really pays for them to join us, because they can concentrate on selling, we do the back office, which is becoming more streamlined with more technology and with the infrastructure in place. We look to make this type of acquisition actually for a year and in advance we were looking for the existing platform that had agents in place with a platform to do this, because we felt it was a -- itâ\u0080\u0099s a space launch. Itâ\u0080\u0099s not just a -- we went from a bicycle to a rocket ship, because the interest is amazing, and of course, we were building behind the scenes are licensing for this 46 states plus Washington, D.C., all carriers weâ\u0080\u0099ve been accumulating. So all the bases and all the infrastructure and the weaponry, so to speak, is in place and now weâ\u0080\u0099re just going in and itâ\u0080\u0099s weâ\u0080\u0099re watching it and itâ\u0080\u0099s really. Iâ\u0080\u0099m almost ashamed to say Iâ\u0080\u0099m afraid I got too much competition, but I donâ\u0080\u0099t think they can do it, because thereâ\u0080\u0099s no one and I feel confident in saying this. Anyone in the world just listen to this call that we know long, there was no one absolutely out there in a franchise model or not franchise who have the combination of factors that we have in place. But I think 18 months is certainly realistically, at the rate weâ\u0080\u0099re going and at the infrastructure in place. But some of them are in the process of finishing the licensing and boarding, but weâ\u0080\u0099re above the 90% and weâ\u0080\u0099re above the 60% and weâ\u0080\u0099re shooting too much bigger numbers. So weâ\u0080\u0099re excited about the revenue growth we achieved during the second quarter, which we see as validation of our InsurTech platform. Thank you, ladies and gentlemen."
}