{
    "symbol": "GETY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 00:15:08",
    "content": " For the 2022 fiscal year, Getty Images exceeded $926 million in revenue, representing year-on-year growth of 0.8% and currency-neutral growth of 5.7%. For our customers on those annual subscription products, we retained revenue at 100.1% down from 104.5% in 2021, with 2021 benefiting from the year-on-year compare of a COVID impact in 2020. Total revenue in the fourth quarter was $231.5 million, down 3.2% on a reported basis year-on-year due in large part to 670 basis points of foreign currency headwinds. Excluding that FX impact, revenue increased 3.5% in the quarter, driven by a solid performance in our editorial business, growth across all of our major geographies and growth in our subscription business. For the full year 2022 annual subscription revenue rose to 49%, up from our 2021 finish of 45.6%;  games in our iStock and premium access subscriptions, this continued growth in our subscription business, further bolsters the durability of our financial model, with high revenue retention to driving growth in recurring revenue and better revenue predictability. Creative revenue was $145.1 million, down 6.8% and 0.4% on a currency-neutral basis, respectively. Editorial which benefited from a strong editorial calendar or what we refer to as an even year impact grew revenue to $82.2 million in Q4, up 3.1% year-on-year on a reported basis and up 10.3% on a currency neutral. Revenue grew across all major geographies on a currency neutral basis in Q4 with the year-on-year growth of 3.1% in the Americas, 2.9% in EMEA and 10.5% in APAC. Our total SG&A expense of $96.4 million was up $2.7 million this quarter, with our expense rate increasing to 41.7% of revenue from 39.2% last year. For the full year, SG&A increased by $9 million to 40.7% of revenues, up slightly from 40% last year, driven by incremental spend on our cloud IT and cloud-based costs which are primarily tied to growth, public company readiness expenses and marketing with some offsetting savings in occupancy and lower compensation expense. Adjusted EBITDA was $74.5 million for the quarter, down 9.1% or $7.4 million year-over-year. For 2022, adjusted EBITDA was $303.9 million or 32.8% of revenue, down 1.7% reported and up 4.8%, absent the impact of FX, highlighting the stability and health of our business. For the full year, CapEx was $59.3 million or 6.4% of revenue, up from $49.3 million or 5.4% of revenue in 2021. Adjusted EBITDA less CapEx was $61.2 million, down $8.1 million year-over-year, representing a decrease of 11.7% or 1.8% on a currency-neutral basis. For the full year, adjusted EBITDA less CapEx was $244.6 million, a decrease of 5.9% recorded and an increase of 0.9% currency neutral. We anticipate revenues of $936 million to $963 million, representing growth of 1% to 4% year-over-year and currency-neutral growth of 1.9% to 4.9%. We expect adjusted EBITDA of $305 million to $315 million, up 0.4% to 3.6% year-on-year and up 1.3% to 4.6% currency neutral. Included in our adjusted EBITDA expectation is a similar cadence for foreign currency, with an approximate $3 million adverse impact in fiscal 2023, including a headwind of about $5 million in the first half of the year, of which approximately $3.5 million as expected in the first quarter."
}