{
    "symbol": "SNCE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 14:30:05",
    "content": " We're particularly pleased with our revenue for the first quarter which reached $18.7 million, a 50% increase year-over-year despite having pulled $2.3 million out of the first quarter and into 2021, given our ability to overdeliver operationally, in addition to the impact of the two large COVID cancellations that we discussed in detail last quarter. By conservatively, shaving three months off the start-up process and another three to six months off the enrollment timelines on a Phase III trial, the Science 37 model can dramatically reduce cash burn for sponsors and also give them six to nine months of additional commercialization time for their drug, which represents for a product at peak revenue of $200 million, about $100 million to $150 million in additional revenue for the sponsor. Finally, in regard to positioning Science 37 for long-term profitability, we've been aggressively taking expenses out of the business, which will be reflected modestly in our first quarter results, and more significantly in our full year guidance as we strive to become EBITDA positive and cash flow neutral by the end of 2024 without the need to raise additional capital. This exceeds our preliminary expectations for the quarter, given the two large COVID cancellations we experienced in the quarter, and our ability to accelerate approximately $2.3 million of revenue into the fourth quarter of 2021 from the first quarter of 2022, both of which we shared during the fourth quarter earnings call. As David noted, we finished the quarter with our highest total pipeline in the company's history, and consistent with our remarks from the Q4 2021 earnings call, we continue to see a record number of larger $10 million plus opportunities in our pipeline, which reflects growing confidence in both, Science 37 and the decentralized clinical trial model. On our path to profitability, we were pleased to be able to reduce total non-GAAP operating costs as defined by revenue less adjusted EBITDA by more than $3 million sequentially in the first quarter from the fourth quarter of 2021."
}