{
    "symbol": "SNCE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 23:34:06",
    "content": " Second quarter, revenues remained strong at $19.3 million and cost containment enabled us to grow adjusted gross margins sequentially from 17% in the first quarter to more than 30% in the second quarter, while also reducing SG&A excluding stock-based compensation by almost 10%. While we are excited to see the rapid growth in our sales pipeline, we are also seeing longer sales cycles particularly on larger studies which is reflected in our net bookings of $25.4 million for the second quarter. Itâ\u0080\u0099s important to note that while our sales pipeline is growing in overall size and composition, with nearly 50% of that pipeline comprised of deals larger than $10 million, these larger opportunities take significantly longer to contract, which has negatively impacted short-term booking conversions. As you may recall, our 30.6% adjusted gross margin for the second quarter was up significantly compared to the 17.2% in the first quarter of this year, as two of our largest studies based on our old pricing model came to conclusion, and we were effectively able to absorb some of the excess capacity we have in the first quarter. Adjusted EBITDA, which we calculate by adding back depreciation, amortization, taxes, interest, transaction expenses, and stock-based compensation and adjusting for the impact of the change in fair value of the earn-out liability, with a loss of $16.5 million in the quarter, representing a 17% sequential improvement from the first quarter loss of $19.8 million. However, if you account for a couple of large receivables, totaling approximately $3.3 million from two customers who are not biotechs or small pharma, which were due the last week of June and came in, in the first week of July as well as a number of one-time items, including the payout of accrued vacation hours as we have switched to a flexible time-off policy, our normalized quarterly cash burn would have been approximately $24 million in the second quarter. As a result of the longer booking conversion timelines associated with the larger opportunities we are seeing in our pipeline, we are adjusting our full year 2022 projected revenues to be in the range of $76 million to $86 million, representing a 28% to 44% year-over-year growth. In summary, we remain optimistic about our continued growth trajectory, with a qualified sales pipeline at a record level and larger $10 million plus opportunities representing nearly half of that pipeline, which is up nearly 400% year-over-year."
}