{
    "symbol": "SNCE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 11:02:12",
    "content": " Fourth quarter adjusted EBITDA was also ahead of expectations and marked an improvement of more than 20% quarter-over-quarter from negative $14.6 million to negative $11.6 million, finishing the year at negative $62.5 million. As we look forward to 2023, given the previously reported industry challenges including longer decision making time, more cost consciousness and drug funding challenges, the 2022 booking shortfall, particularly in the third quarter, and project cancellations that we reported throughout the year, we are providing 2023 revenue guidance of $55 million to $60 million for the year. With cost containment efforts like these and the previously reported headcount reductions that we announced last quarter, we expect to achieve 2023 EBITDA of negative $48 million to negative $50 million, and we continue to progress toward our objective to reach EBITDA positive and cash flow neutral by the end of 2024 without having to raise additional capital. In the fourth quarter, we reported revenues of $15.9 million which represents a 22% decrease from the same period of the prior year; however, itâ\u0080\u0099s important to note that if you exclude COVID-related studies from both the fourth quarter of 2021 and 2022 periods, our underlying business continued to expand with fourth quarter revenue growth up 19% year-over-year. Selling, general and administrative expenses excluding $5.1 million of stock-based compensation was $15.5 million in the fourth quarter, a decrease of $3.7 million versus the third quarter of 2022 due to the restructuring program that we implemented as well as lower variable expenses. Adjusted EBITDA, which we calculate by adding back depreciation, amortization, taxes, interest, other income, stock-based compensation, and other non-cash charges, was a loss of $11.6 million in the quarter, representing a $3 million sequential improvement compared to the third quarter of 2022 and a $9.9 million improvement versus the fourth quarter of 2021. On a full year basis, our adjusted EBITDA was negative $62.5 million, which exceeded the 2022 adjusted EBITDA guidance we originally provided during the first quarter 2022 earnings call. In large part due to the $44 million non-cash impairment, U.S. GAAP net loss was $66.5 million versus a GAAP net loss of $65.1 million in the fourth quarter a year ago. The adjusted net loss for the fourth quarter was $16.9 million, which compared to an adjusted net loss of $23.4 million in the same period last year."
}