{
    "symbol": "C",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-14 16:34:07",
    "content": " In the quarter, total revenues increased 6% on a reported basis excluding divestiture-related impacts revenues were down 1% as growth in net interest income was more than offset by lower non-interest revenues. Non-interest revenues were down 12% on a reported basis and 28% excluding divestiture-related impacts, largely reflecting declines in Investment Banking, Markets and Investment Revenues in Wealth. In the third quarter, total net interest income increased by approximately $600 million on a sequential basis and approximately $1.9 billion on a year-over-year basis across the firm, driven by higher interest rates, management of deposit re-pricing and loan growth in PBWM. Through the first half of the year, based on the industry data that we see, we estimate that we gained over 60 basis points of share with large corporate clients and client wins are up approximately 20% across all segments, including wins with financial institutions, which are up almost 50%. In Securities Services, revenues grew 15%, as net interest income grew 73%, driven by higher interest rates across currencies, partly offset by a 6% decrease in non-interest revenue due to the impact of market valuations. Fixed Income Markets revenues were up 1% as strength in rates and FX was largely offset by continued headwinds in spread products and through the first half of the year, we gained approximately 40 basis points of share. Revenues were up 6% as net interest income grow was partially offset by a decline in non-interest revenue, driven by lower investment fee revenue in Wealth and higher partner payments in Retail Services. Client advisers were up 5% and we are seeing net new investment inflows and strong new client acquisitions across our Wealth business, with new clients in ultra-high net worth and wealth work of 7% and 27%, respectively, for the quarter. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}