{
    "symbol": "C",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-13 15:25:24",
    "content": " Excluding divestiture-related costs from both the fourth quarter of this year and last year, expenses increased by 5%, largely driven by investments in our transformation, business-led investments and higher volume-related expenses partially offset by productivity savings and the expense reduction from the exit. Cost of credit was approximately $1.8 billion, primarily driven by the continued normalization in card net credit losses, particularly in retail services and an ACL build of $645 million, largely related to growth in cards and some deterioration in macroeconomic assumptions. Treasury and Trade Solution revenues were up 32%, driven by continued benefit from rates as well as business actions such as managing deposit repricing, deepening with existing clients and winning new clients across all segments. In Security Services, revenues grew 15% as net interest income grew 59%, driven by higher interest rates across currency, partially offset by a 1% decrease in non-interest revenue due to the impact of market valuation. Revenues increased by 3% this quarter, with TTS up 36% on continued strength in NII; Security Services revenues up 22%; Markets revenue, up 18% on strength in fixed income, partially offset by a decline in equity; and Investment Banking revenues down 58%, which is in the range of the overall decline in industry volume. We continue to expect top line revenue growth, material expense reduction and capital levels largely consistent with our medium-term CET1 target range to contribute to the achievement of our 11% to 12% ROTCE target. Your line is now open. Your line is now open. Just keep in mind with that number that Iâ\u0080\u0099ve given on the page is both the growth that occurs in some of our important services businesses, and that really comes from both the annualization of rate increases that we saw in the back half of the year but also expected continue increases, particularly outside of the U.S. And given the makeup of our franchise, we will â\u0080\u0093 that will contribute to the NII growth. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}