{
    "symbol": "C",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-15 14:46:02",
    "content": " The market volatility that we saw in the first quarter continued into the second, driving corporate clients in particular to be more active in risk management, contributing to revenue growth of 25% in markets. As Jane mentioned earlier, in the second quarter, we reported net income of $4.5 billion and EPS of $2.19 with an RoTCE of 11.2% or $19.6 billion of revenues. Total expenses of $12.4 billion increased 8%, largely driven by transformation, business-led investments and volume-related expenses. At the end of the quarter, we had approximately $18.3 billion in total reserves with a reserve-to-funded loan ratio of 2.44% and are well capitalized with a CET1 ratio of 11.9%. In the second quarter, net interest income increased by approximately $1.1 billion on a sequential basis driven by higher rates, day count, growth in loans as well as the impact of the European dividend season on our Markets business. On a year-over-year basis, net interest income increased by approximately $1.5 billion driven by higher interest rates as well as volumes across businesses. Revenues increased by 20%, largely driven by TTS, Markets, Securities Services as well as a gain on loan hedges, partially offset by a decrease in Investment Banking revenues. In Treasury and Trade Solutions, revenues were up 33% driven by 42% growth in net interest income as well as 17% growth in NIR as we saw a strong growth with both mid and large corporate clients. Banking revenues, excluding gains and losses on loan hedges, were down 28% driven by Investment Banking as heightened geopolitical uncertainty and the overall macro backdrop impacted client activity, partially offset by higher revenue in corporate lending. So, despite payment rates remaining elevated, the investments we have been making have driven growth in interest-earning balances of 3% in Branded Cards and 2% in Retail Services, and we believe we will continue to grow these balances in the second half of the year. When you look in the strategic drivers we laid out at Investor Day this quarter, cross-border transaction value, up 17% year-over-year; clearing volume, up 2% in U.S. dollar; commercial comp spend, up 62% as that business recovered; average trade loan balances, up 14%; average deposit balances, up 2%."
}