{
    "symbol": "INBK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 19:10:05",
    "content": " We achieve this exceptional loan growth without sacrificing our proven commitment to credit quality, for the provision for loan losses in the fourth quarter was higher than in our prior quarters, the increase was due primarily to the strong loan growth as net charge offs remained low, or about 3 basis points of average loan balances, and only 1.1 million throughout all of 2022. With the increase in interest rates throughout the year, we have been able to increase rates on loans, as new portfolio origination yields increased 84 basis points during the fourth quarter as compared to the prior quarter. Throughout 2022, we increased rates on new loan originations, our fourth quarter funded portfolio origination yields were up 84 basis points from the third quarter and up 118 basis points year-over-year. CD balances were up over $100 million compared to the prior quarter due to new production in the consumer channel, while broker deposits increased $166 million as we access the wholesale market for longer duration funding to take advantage of the inverted yield curve and help to offset the impact of continued fed rate hikes on deposit costs. Net interest income for the quarter was $21.7 million and $23.1 million on a fully taxable equivalent basis, down 9.6% and 8.7% respectively from the third quarter. With loan interest income up in the range of 10% to 12% compared to the fourth quarter, and for the full year do increase 35% to 40%, compared to 2022. Assuming the fed continues to increase rates early in 2023, we expect the cost of deposit funding to increase 60 to 65 basis points in the first quarter with total interest expense up in the range of 25% to 30%. If the fed hits its terminal rate during 2023, we should see the dollar amount of interest expense stabilized in the fourth quarter, which would get us back to a higher fully tax equivalent net interest margin in the range of what we realized during the fourth quarter of 2022. The allowance for loan losses increased $1.9 million, or 6.3% to $31.7 million at quarter end, while the ratio of the allowance to total loans decreased 1 basis point to 0.91%. While total shareholder's equity increased in terms of dollar amount, our tangible common equity ratio declined to 7.94% as the combination of balance sheet growth and share repurchases, offset the effect of net income earned during the quarter, and the decrease in the accumulated other comprehensive loss. If deposit costs stabilize in the fourth quarter as the forward curve suggest, we would expect to see low double digit growth in net interest income during the back end of the year. For the full year, we are expecting operating earnings per share excluding the mortgage exit cost to be in the range of $2.55 to do $2.75 per share with the first quarter to be roughly in line with the average estimate and improving in the second and third quarters. The other issue that's going to make it a little stronger in the first quarter Brett is a lot of those loans that we added in the fourth quarter came on in the last two weeks, everybody was trying to get things done before year end. Iâ\u0080\u0099ll guide you back to about 12 to 13, the one reason why the tax rate was low in the fourth quarter is when we do taxes, I will tell you the calculation isnâ\u0080\u0099t necessarily done for a quarter at a time, what weâ\u0080\u0099re trying to do is forecast â\u0080\u0093 we use earning taxable income estimates for the year and I will tell you back earlier in the year in the first couple of quarters before the Fed started rapidly raising rates and weâ\u0080\u0099re having the subsequent impact on earnings in the back end of the year."
}