{
    "symbol": "INBK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 15:38:02",
    "content": " At the end of the third quarter, unfunded commitments in construction lending totaled $367 million, up over 74% compared to June 30, 2022, position as well to add variable rate assets in the fourth quarter and throughout 2023. As a result of acute deposit competition, our cost of interest bearing deposits increased 56 basis points from the second quarter to 1.41%, an increase in earning asset yields of 26 basis points, so itâ\u0080\u0099s a partial offset. Our third quarter funded loan origination yields were up 52 basis points from the second quarter and on a year-to-date basis are up 87 basis points higher than they were for the same period in 2021, setting the stage for higher average loan yields in future periods. In terms of how this pricing impacted results, actual price increases beyond expected deposit betas impacted the third quarterâ\u0080\u0099s deposit costs by 10 basis points and the fully taxable equivalent net interest margin by seven basis points. Turning to Slides 6 and 7, net interest income through the quarter was $24 million and $25.3 million on a fully taxable equivalent basis, both down around 6.5% from the second quarter. As David noted, we recorded a net interest margin of 2.40% in the third quarter, a decrease of 20 basis points from the second quarter, and fully taxable equivalent net interest margin was down 21 basis points to 2.53% for the quarter. As far as top-line interest income goes for the fourth quarter and into 2023, we continue to feel confident that the combination of new loan originations priced at higher levels, variable rate assets repricing higher and draws on the significantly increased construction commitments will drive strong growth in total interest income. Currently, we expect the yield on the loan portfolio to be up around 40 basis points to 45 basis points for the fourth quarter with loan interest income up in the range of 16% to 17% compared to the third quarter. Net charge-offs of $179,000 were recognized during the third quarter resulting in net charge-offs to average loans of two basis points, but the provision for loan losses in the third quarter was $892,000 compared to $1.2 million for the second quarter. I mean, it doesnâ\u0080\u0099t seem like it, it pays to grow the consumer books and fund it with higher cost money market deposits, I mean, you guys mentioned the buyback and it seems like thatâ\u0080\u0099s in play here, but just would love a comment and just overall maybe David, about how youâ\u0080\u0099re thinking about what the priority should be as you budget for next year, just given this quarter and maybe a little bit of a slower rollout here on the BaaS side, at least from a lower cost funding perspective. There are a couple opportunities out here that could really put significant money on board quickly, and one of the reasons that we didnâ\u0080\u0099t chase kind of the institutional CD game, one, itâ\u0080\u0099s a 130 basis points to 140 basis points higher than the consumer, but some of the money market opportunities that weâ\u0080\u0099ve opened up, we can step down pretty quickly and get out of that, if we do land one of the whales that can drop several hundred million in low cost deposits on this and theyâ\u0080\u0099re still out there."
}