{
    "symbol": "INBK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 17:49:08",
    "content": " We were especially thrilled that we were able to effectively offset the expected decline in net interest income from revenue on tax refund advance loans, which totaled $2.9 million in the first quarter. While the reported yield on average loans was down 21 basis points from the first quarter, if you exclude the effect of the revenue we received on tax refund advance loans, the yield on the loan portfolio increased 7 basis points to 4.29%, again reflecting the strong growth and higher pricing on new originations. As you can see on Slide 7, the 5 basis point improvement was driven by a 5 basis point contribution from securities and a 4 basis point contribution from cash, partially offset by modestly higher deposit costs and the impact of lower reported loan yields, which again included the effect of tax refund advance lending in the first quarter. David covered the activity and the outlook for our SBA line of business, so beyond that other income declined $300,000, due primarily to a decline in the value of fund investments carried at fair market value and consistent with other mortgage originators, we saw a decline in mortgage revenue due to a decrease in interest rate locks and sold loan volume driven by the higher rate environment and its impact on both the purchase and refinance markets. Hey, good afternoon guys. No, I think the way that we look at it is if you back out the tax revenue, the revenue from tax refund advance lending last quarter, which was about $2.9 million and you're familiar with that business, Mike, that's predominantly this quarter event. I mean to some extent it's a little bit like turning a battleship, because you got a $3 billion portfolio, but as older loans amortize and new productions coming on at higher rates, that kind of all-in portfolio yield call it core on excluding tax stuff there is call it 4.30%-ish. We could be -- Fed does 75 basis points in the next week, the short-term money costs could be 100, 125 basis points higher than five year money, so it's -- we're weighing all avenues, believe me, that Ken's team are watching rate curves and activity on almost minute by minute basis, but there is a lot of turbulence in the marketplace that could be beneficial, could be obviously detrimental at the same time. One thing we are -- I think would be a very interesting prospect for us is we're getting ready to launch a partnership with a commercial finance company that both on the lending and the deposit side and the deposit opportunities are really operating accounts for their client base and that's exciting, because that's small business checking that we're paying 40 basis points on. So I think with the -- our view right now is that we expect at least over the next several quarters here that betas should remain relatively well constrained and a point I know I talked about in my prepared comments, but I think it's important to hit home is that since the last rate tightening cycle where our money markets were almost exclusively consumer with the growth in our small business and the efforts that we've put in there, almost two-thirds of that money market base now is small business or commercial and it's predominantly small business. Hey, good afternoon guys."
}