{
    "symbol": "SGHT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 04:34:02",
    "content": " Surgical Glaucoma revenue grew 37% year-over-year and 7% sequentially to $17.1 million in the third quarter, and Dry Eye revenue grew 145% year-over-year and 21% sequentially. We achieved several milestones in the third quarter, including: one, the successful introduction of SION, our innovative bladeless goniotomy device; two, the complete enrollment of SAHARA, our transformative dry eye RCT for the TearCare system; and three, the publication of multiple peer-reviewed articles featuring compelling clinical data that demonstrates expansive market opportunities for both OMNI and TearCare. Our surgical commercial goals are: one, continue expanding the large and growing moderate to advanced disease combination cataract and standalone MIGS segment, based on OMNIâ\u0080\u0099s differentiated efficacy profile; two, drive adoption and utilization of SION among specific subsets of surgeons, who may prioritize faster or simpler procedures; and three, increase our total share of MIGS with OMNI and SION, while also growing the overall MIGS market. Our target customer for SION includes 3 types of combination cataract MIGS surgeons that are distinct from target OMNI customers: number one, high volume cataract surgeons only looking to perform the quickest MIGS procedures; number two, surgeons who are initially less experienced with MIGS, such as surgical fellows at academic institutions; and number three, surgeons looking for the most cost effective MIGS procedures and facilities that may emphasize procedural profitability. Our Surgical Glaucoma revenues for the third quarter were $17.1 million, up 37% from $12.4 million in the third quarter of 2021 and sequentially up to 7.4%, which represents a nearly 400 basis point improvement over our comparable sequential growth in the third quarter of 2021. The Dry Eye segment revenues for the third quarter were $1.6 million, up 145% from $0.7 million in the third quarter of 2021 and a sequential increase of 20.7% from the second quarter of 2022. Your line is open. So, all in all, when you combine patient education and identification initiatives, with surgeon training and patient counseling initiatives, and you coupled that with a growing library of really compelling standalone clinical data like the TREY data we just discussed, you end up with a really viable playbook that enables our eye care professionals to better treat more patients with OMNI, whether thatâ\u0080\u0099s at the time of cataract surgery or as a standalone procedure. Your line is open. Your line is open. Your line is open. Your line is open."
}