{
    "symbol": "SGHT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 18:24:09",
    "content": " Our first quarter 2022 revenue increased to $14.9 million, representing 72% growth compared to the prior year period and 1% sequential growth compared to the fourth quarter of 2021. A strong continued pace of new customer wins and extremely high customer retention resulted in surgical glaucoma revenue of $13.9 million, in line with the prior quarter's revenue and exceeding our internal expectations given Omicron, seasonality and competitive trial. As a point of comparison, our surgical glaucoma revenue sequentially declined 7% from the fourth quarter of 2020 to the first quarter of 2021, yet we still grew surgical glaucoma revenue 79% for the year. Our dry eye revenues for the first quarter were $1 million, up over 100% year-over-year, and 33% sequentially from the fourth quarter of 2021. Let's move on now to an update on our three primary strategic growth initiatives, which as a reminder are: number one, increasing adoption and utilization of OMNI and the established combination cataract MIGS segment; number two, pioneering the $5 billion U.S. market for stand-alone MIGS interventions; and number three, developing the market for reimbursed dry eye treatment procedures. In the fourth quarter of 2021, there were over 18,000 projected claims using both 66174 and 66984, which represented over 19% of projected claims using the 66984 cataract code and all MIGS procedures combined. The number of claims using the three other codes shrank 12% in 2021, while stand-alone canaloplasty claims grew 29%, more than doubling since the introduction of OMNI in 2018. Our total revenue for the three months ended March 31, 2022, was $14.9 million, a 72% increase from $8.6 million in the same period of 2021 and up 1% versus the fourth quarter of 2021, despite Q1 seasonality typically representing the lowest quarterly portion of our annual revenue. Our surgical glaucoma segment revenues for the fourth quarter were $13.9 million, up 70% from $8.1 million in the first quarter of 2021 and sequentially flat compared to the fourth quarter of 2021. In the first quarter of 2022, our base customer retention rate was 99.7%, exactly in line with what we've enjoyed since launch, and what has helped us to achieve tremendous growth throughout OMNI's ramp. Our dry eye segment revenues for the first quarter were $1 million, up 104% from $0.5 million in the first quarter of 2021, and a sequential increase of 33% from $0.8 million in the fourth quarter of 2021."
}