{
    "symbol": "RJF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-28 13:45:05",
    "content": " Despite revenue growth, pretax income declined 25% compared to a year ago quarter caused by the bank’s loan loss provision for credit losses in the current quarter, reflecting strong loan growth compared to the bank’s loan benefit for credit losses in comparative periods. Moving to slide 11, clients’ domestic cash sweet balances ended the quarter at a record $76.5 billion dollars, up $3 billion or 4% over the preceding quarter and representing 7% of domestic PCG client assets. The average yield on RJBDP balances with third party banks increased to 32 basis points in the quarter, and the spot rate is just over 50 basis points reflecting the march rate increase both the NIM and the average yield from third party banks are expected to increase further with additional rate increases as less than 25% of the firm’s interest earning assets have fixed rates. billion thus far in April, largely due to the quarterly fee billings and income tax payments using static balances and an instantaneous 100 basis point increase in short term interest rates, which includes the 25 basis point rate increase in March, we would expect incremental pretax income of nearly $600 million per year, with approximately 65% of that reflected as net interest income and 35% reflected as accountant service fees. You know, one thing I will say is that their loan growth, since we announced the transaction and their separate public company, so I also don’t want to get too much into their own results or what the upside is to higher rates going forward for their results until you know, after we close the transaction, but I think I can say that the loan growth since they, since we announced the transaction has been much stronger than we were projecting of course, we tried to use conservative projections but they’ve had really continued to have strong loan growth since announcing the transaction. I would say that the peak margin potential is going to be driven more by the increase in short term interest rates and the impact that has on our 75 plus billion dollars of client cash balances, then, you know, the any particular transaction that we’ve closed door that is pending. I guess we don’t have any sort of predetermined objectives in terms of where it goes, we think that there’s, we know that about 15 billion of those balances are 13 billion today, because they have declined by a couple billion so far in April due to FY Billings and tax payments, is sort of what we consider overflow balances that, would prefer FDIC insurance, when capacity recovers for that in with third party banks and or when Raymond James bank needs that capacity as well. But when we look back a couple years ago, your comp ratios 65 66%, when rates were more normalized, without making a call on capital markets and kind of considering a few of the small acquisitions you’ve done, I just want to think about maybe what structurally different today, a lot of conversation in the market around expense inflation and higher base salaries and base overall compensation."
}