{
    "symbol": "RJF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-28 15:08:11",
    "content": " I know with our recent acquisitions, the numbers are a little more complicated, but I am pleased with our results for the fiscal third quarter and the first nine months of the fiscal year, despite challenging market conditions we have continued to invest in our business, our people and technology to help drive growth across all of our businesses. And while the decrease in fee base assets from the equity market declines during the quarter will negatively impact asset management and related administrative fees in the fourth quarter we are well-positioned for increases in short term rates, given our attractive growth of earning assets, the majority which float with the short end of the curve. Year-over-year in sequential revenue growth reflects primarily the benefit of higher short term interest rates on both RJBDP fees from third party banks and net interest income, which more than offset the declines in total brokerage revenues and investment banking revenues resulting from the challenging market environment. The decline in net income available to common shareholders was primarily attributable to increased the business development expenses, and a higher bank loan provision for credit losses during the current quarter, which reflects the strong growth at Raymond James bank, a weaker macro economic outlook and the $26 million initial provision for the credit losses on loans acquired from Tristate capital bank, as Paul will discuss in more detail. Financial assets under management of $182 billion, which includes Chartwell Investment Partners, decreased 6% sequentially as a decline in equity markets more than offset net inflows and the acquired assets during the quarter. And highlighting our industry leading growth, we generate domestic PCG net new assets of nearly $98 billion over the four quarters ending June 30, 2022 representing 9.4% of domestic PCG assets at the beginning of the period. Additionally, Tristate capital bank bought over $11.8 billion of loans this quarter which represents a record for them as they have continued to generate very attractive loan growth across their portfolios. Moving on to segment results on slide six, the private client group generated record results with quarterly net revenues of $1.96 billion and pre-tax income of $251 million. The bank segment which now includes Raymond James Bank and Tristate Capital Bank generated quarterly net revenues of $276 million, which is a record result and pre-tax income of $74 million. As a result of the steep declines in the equity markets during the quarter, private client group assets and fee base accounts ended the fiscal third quarter down 11% compared to March 2022, creating a significant headwind for asset management revenues in the fiscal fourth quarter. Combined net interest income and RJBDP fees from third party banks was $370 million, up an astounding 102% over the prior yearâ\u0080\u0099s fiscal third quarter and 65% from the preceding quarter. As for the bank segments in them, we expected to average around 2.7% for the fiscal fourth quarter, which would reflect around two months of this weekâ\u0080\u0099s interest rate increase and a full quarter of Tristate capitalâ\u0080\u0099s contribution. The remaining portion of the bank loan provision during the quarter, around $30 million was primarily associated with an 8% sequential loan growth at Raymond James bank, and a weaker macro economic outlook. On slide 15, at the end of the quarter, total assets were at $86.1 billion an 18% sequential increase, reflecting the addition of Tristate capital, as well as solid growth of loans at Raymond James bank. In asset management segment, while financial assets under management are starting the fiscal fourth quarter lower due to equity markets, we are confident the strong growth of assets and fee based accounts in the private client group segment will drive long term growth of financial assets under management. Paul, the appreciate the sort of commentary around the growth of the business and the quarter being typically something of a high watermark, but can you maybe help us just sort of think about how that might trend on a run rate basis over the next couple quarters given obviously, sort of increased T&A and some of the other sort of normalization expense pressures that we're seeing, apologies if I missed it, but I think that'd be helpful. I mean, the $25 billion, that's what third party banks now and the $14 billion that's with client interest programs and that has declined somewhat since the beginning of July as I said in the comments, but those deposits over time can be a good portion of a very large portion of those deposits over time could be used to fund the balance sheet growth to the extent that we find good risk adjusted returns on the balance sheet and to the extent that we can grow loans to our private client, group clients, etc."
}