{
    "symbol": "RJF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-27 12:32:02",
    "content": " First quarter domestic PCG net new asset rose with even stronger generating nearly 14% annualized rate, the highest level we’ve experienced such starting to closely track this metric. Clients’ domestic cash sweep balances grew 10% sequentially to a record $73.5 billion, this Paul will detail later in the call, we should have significant upside to our pre-tax earnings in the raising interest rate environment. Given the timing of certain expenses, we think it is most appropriate to compare the year-over-year results were the segment’s revenues increased 25% and the pre-tax income increased 39% over the first fiscal quarter of 2021; truly fantastic growth. The Capital Markets segment generated record quarterly net revenues of $614 million and record pre-tax income of $201 million, representing an impressive 33% pre-tax margin to net revenues. I do want to touch on the 1% sequential decline of asset management fees in the asset management segment during the quarter primarily due to a larger portion of certain client fees allocated to the private client group segment starting at the beginning of the fiscal year, which effectively resulted in nearly $9 million of managed account fees that’s shifted from the asset management segment to the Private Client Group segment during the quarter. Using these static balances and instantaneous 100 basis point increase in short term interest rates, we would expect incremental pre-tax income of approximately $570 million per year with approximately 65% of that reflected as net interest income and 35% reflected as account and service fees. While our pre-tax margin targets in this near zero short term interest rate environment is around 16%, we generated a pre-tax margin of 20.1% in the fiscal first quarter or 20.3% on an adjusted basis boosted by record revenues particularly for investment banking still relatively subdued business development expenses and a loan loss release during the quarter. On slide 13, at the end of the quarter, total assets were approximately $68.5 billion and a 11% sequential increase, reflecting solid growth of loans at Raymond James Bank as well as a substantial increase in client cash balances that we’re accommodating on the balance sheet. I can’t promise we’ll be able to sustain the 11% net new asset growth we achieved over the last 12 months or the phenomenal 14% annualized net new assets we experienced in the fiscal first quarter, but given our strong retention and continued interest in all of our affiliation options, I’m optimistic we will continue delivering leading organic growth numbers. If I normalize for provisions and business development costs, maybe you get to 19% and then if capital markets revenues elevated, maybe that gets you down to 18% when those normalize, and your comments of 570 million if I’m doing the math right suggest there is 3 to 4 percentage points upside to the margin. And just it also appears a little bit light relative to the gains that we saw in the S&P of about 10% in the quarter, and I was hoping you could just speak to the stronger organic growth, why it’s not necessarily translating into a higher level of AUM growth granted one quarter does not a trend make."
}