{
    "symbol": "SMTC",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-01 23:38:02",
    "content": " In Q3 fiscal year '22, the company delivered a very strong financial performance that included achieving a number of new financial records, including net sales of $194.9 million, that increased 5% sequentially and 27% year-over-year and was above the midpoint of our guidance. The Q3 gross margin increased 110 basis points sequentially to 63.8%, which represented the upper end of our guidance range and the new quarterly record, led by a more favorable product mix. Going forward, we expect our gross margin to continue to benefit from the retail mix of sales from our key growth platforms that include LoRa-enabled, our 10G PON, our Tri-Edge PAM4 CDRs and our broad-based industrial protection products. In Q3, operating profit increased 14% sequentially or nearly 3x that of net sales and increased 51% on a year-over-year basis, led by the higher gross margin and represented a record operating profit. In Q3, cash flow from operations was a record $66.5 million, up 26% sequentially and represented 34% of net sales as a result of the record operating profit and good management of working capital, while free cash flow increased 33% sequentially to 31% of net sales. In summary, the success of our growth engines of LoRa-enabled, our Tri-Edge PAM4, 10-gig PON ,5G wireless and broad-based protection platforms enabled us to deliver a record net sales, a record gross margin, record operating profit, record earnings per share and record cash flow in Q3. In Q3, net revenue from the industrial end market increased 17% sequentially, led by record results from both our LoRa business and our broad-based protection business and represented 35% of total net revenues. In Q3 of fiscal year '22, our Signal Integrity Product Group increased 3% sequentially and achieved a new revenue record, led by growth from the PON and base station infrastructure markets and represented 39% of total revenues. In Q3, demand for our protection devices used by the broad-based industrial markets grew 31% sequentially and 71% annually and achieved a new quarterly revenue record, led by growth from our automotive, communications and broad-based industrial customers. Now one of the things that's really transpired and really exciting for us is that LoRa which is predominantly a range-driven technology, low power long range driven technology, but we're seeing in that kind of half a mile to 5-mile range, LoRa really starting to get adopted as well, which is pretty exciting because it opens up a whole bunch of use cases that makes the market, essentially the LPWAN market become much bigger, and I think we'll grow faster. And that is in terms of LoRa gateways, I guess, entering the year, if my numbers are right, I think you had maybe 1.3 million gateways and you're adding -- that's in your entire existence, and now you're adding 1.7 million this year, just massive growth on the gateway side."
}