{
    "symbol": "SMTC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-16 20:59:07",
    "content": " In Q4 of fiscal '22, net revenues from the high end consumer market decreased 22% substantially and 6% over the prior year and represented 25% of total revenues. Q4 gross margin increased 70 basis points sequentially to 64.5%, which represented the upper end of our guidance range and the new quarterly record, driven by a higher mix of our growth drivers that include LoRa-enabled, a 10G PON, a Tri-Edge PAM4 CDR, 5G wireless and broad-based industrial protection products. In fiscal year '23, we believe the long term secular nature of our growths of LoRa-enabled Tri-Edge PAM4, 10G PON, 5G wireless and broad based industrial protection platforms positions us nicely for another record financial performance in fiscal '23. In Q4 fiscal year '22, our signal integrity product group grew 21% over the prior year and achieved another quarterly record and represented 39% of total revenues. Moving on our protection product, in Q4 of fiscal year '22 net revenue from our protection product group, decreased 7% sequentially as expected due to seasonality and increased 11% over the same period last year and represented 28% of total revenues. Turning to our wireless and sensing product group, in Q4 of fiscal year '22 revenues from our wireless and sensing product group increased 13% over the prior year and represented 33% of total revenues. For Q1 of fiscal year '23, we expect net revenues from our wireless and sensing product group to increase and deliver another record quarter led by our LoRa business. In FY '22, our signal integrity product business grew 14% over the prior year to achieve record revenues. Our SIP product group achieved record bookings in FY '22, and we expect our signal integrity product group to deliver another record in FY '23, driven by strong growth from our Tri-Edge PAM4 products for the hyperscale data center market and 5G wireless space station market, and continued strength from the PON market. In FY '22, our protection business grew 26% over the prior year, driven by our broad based protect action business, which grew 34% to achieve a new revenue record. For FY '23, we are expecting another record year from our LoRa business and anticipate a 40% CAGR for our LoRa enabled business over the next several years. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Thank you,\n Ladies and gentlemen, we have reached the end of, of the question and answer session, and I will now turn a call over to Mohan Maheswaran for closing remarks\n In closing, we were pleased with our strong Q4 and record fiscal year '22 results, despite the challenging pandemic and supply chain environment, we believe our multi-sourcing initiatives and our investments in infrastructure and tools has enabled us to maintain best-in-class business operations."
}