{
    "symbol": "SMTC",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-01 23:12:07",
    "content": " For Q2 of fiscal year '22, net sales grew 9% sequentially and 29% year-over-year to $185 million, which was above the midpoint of our guidance and represented a new quarterly record led by the secular momentum that contributed to new records achieved by several of our growth -- of our key growth platforms. You may proceed with your question. I would say, it's not going to, you're not going to see the it's very high and drop it just more just kind of, whatever the industry is growing at plus X% and I think one of the things about this business is that we are really just starting to play in the broader industrial protection business. You may proceed with your question. You may proceed with your question. Coming back to the PAM4 question, we've invested heavily in our Fiber Edge and Tri-Edge PAM4 products, both for 5G wireless and for data centers as you know and I think now we are just starting to release those products to production, get design wins, and we're starting to see the ramp of those and there's limitations at this point because our products are mostly short reach, at least on the Tri-Edge side of things. You may proceed with your question. I'm wondering if you could calibrate us in terms of where that makes us today and where, when you would expect non-mobile applications to surpass mobile applications on the protection front, and lastly, seasonality fourth quarter, typically seasonally a little bit down it's been anywhere from, I think 4% to 9%, depending on the year, this is certainly an unusual set of circumstances, given demand and supply headwinds. You may proceed with your question. And I think we anticipate that it's going to continue to grow, whether it's on the access side which will help PON whether it's on the kind of base station side as 5G deployments occur or in the data center side, we would expect those three areas to continue over the next three to five years to get quite sizeable investments around the world, just for more bandwidth and we should see the benefit of that. You may proceed with your question. You may proceed with your question. You may proceed with your question."
}