{
    "symbol": "CSGP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 21:08:05",
    "content": " Total revenue for the third quarter grew 13% year-over-year on a constant currency basis to $557 million, coming in at the high end of our guidance range and above consensus estimates. We delivered exceptional results in the third quarter with annualized net new sales bookings of $76 million, a 62% increase over the same quarter in 2021. Apartments.com revenues were $190 million in the third quarter, increasing 11% over the third quarter of '21. Revenue for CoStar was $213 million in the third quarter, representing a 17% increase over the same quarter a year ago on a constant currency basis. LoopNet third quarter revenue was $59 million, up 13% over the prior year on a constant currency basis. While CRE transactions were down in the market by almost $30 billion in the third quarter, the volume of properties brought to the Ten-X platform increased 88% over the prior year. CoStar product revenue has grown at least 15% every quarter this year, and we expect 15% revenue growth to continue in the fourth quarter, which is 16% on a constant currency basis. With strong sales momentum and an improving economic backdrop for advertising on Apartments.com, we now expect multifamily revenue growth of 16% in the fourth quarter and 10% for the full year of 2022. LoopNet revenue grew 13% in the third quarter on a constant currency basis, in line with our guidance expectations. We expect fourth quarter revenue to grow, to trend similarly to the third quarter at 12% to 13%, with full year revenue growth of 11% to 12%. Other marketplaces revenue grew 12% in the third quarter of 2022, led by continued strength in our lands and business for sale marketplaces. As a result, we now expect revenue growth in our other marketplaces sector to be 10% in the fourth quarter and 17% for the full year of 2022. Although it takes 12 to 18 months to get a return on a new salesperson, when fully productive, these 300 new sellers can produce approximately $70 million to $80 million in subscription revenue every year, and this is revenue that renews at over 90%. Subscription revenue on annual contracts was 79% for the third quarter of 2022, 4 percentage points higher than the third quarter of 2021, reflecting the strong recovery in Apartments.com this year. We expect full year 2022 revenue to range from $2.175 billion to $2.18 billion, which represents an increase at the midpoint of the range by $5 million and implies an annual growth rate of 12% at the midpoint. We expect fourth quarter revenue to range from $566 million to $571 million, representing revenue growth of 12% to 13%."
}