{
    "symbol": "CSGP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 22:25:03",
    "content": " Apartments.com revenue was $198 million in the fourth quarter, increasing 16% over the fourth quarter of 2021 and $740 million for the full year was a 10% increase over the prior year. Our commercial information and marketplace businesses delivered strong operating leverage, improving margins by 300 basis points in 2022 to get within 1% of our established 40% margin goal for the year, and we made excellent progress with our residential investment program while spending less. Our multifamily revenue growth continued to accelerate throughout 2022, ending the year at 16% in the fourth quarter, up 5 percentage points from 11% revenue growth in the third quarter. CoStar's 2022 revenue growth rate was 7 percentage points higher than that of 2021 on the strength of our sales efforts and the global product upgrade initiative, which to date has contributed approximately $40 million of revenue to CoStar. For full year 2023, we expect CoStar revenue growth to moderate somewhat to 12% as the global product upgrade campaign nears completion and our CPI renewal pricing is expected to soften throughout the year with the rates of CPI. LoopNet revenue grew 12% in the fourth quarter and 11% for the full year of 2022, in line with our guidance. Other marketplace revenue was $38 million in the fourth quarter of 2022, a growth rate of 8% year-over-year. With our biggest commercial businesses of CoStar, Apartments.com and LoopNet growing in the strong double digits with bigger sales teams, we expect revenue growth rates to accelerate for our commercial information and marketplace businesses from 13% in 2022 to 15% organic revenue growth in 2023. Your line is now open. So we'll be at the about the 21% margin rate next year Interestingly enough, and this wasn't planned that way, but when we made the Apartments.com investment back in 2015, our margins also went to 21% at that point and have moved up nicely since then, and we are in a market with residential that's at least 2 to 3x the size of the Apartments.com opportunity. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And so adding another, let's say, 100 folks in 2023 versus the 300 we added last year seems like a layup for us now, but there's still a lot of work to do to onboard and make sure all of the 300 are getting to be productive and contributing members to that strong revenue growth and then to replace the ones that inevitably, there are some that won't be able to pass that hurdle and we'll know that within about six months and then we replace and move on. Your line is now open. Your line is now open."
}