{
    "symbol": "PKOH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 11:00:25",
    "content": " In the second quarter, our consolidated net sales were $429 million, up 22% compared to the second quarter of last year. SG&A expenses were $45 million compared to $43 million a year ago, with the increase due to higher selling expenses from the higher sales levels and general inflation, which has impacted costs in each of our segments. During the second quarter, in connection with the consolidation of our pipe threading equipment operation in our Engineered Products segment, we sold the related real estate for net proceeds of $4 million and recorded a gain on the sale of approximately $3 million which is excluded from adjusted earnings per share. During the quarter, we used operating cash flow of $28 million to fund higher working capital levels driven by the sales growth in each segment. In Supply Technologies, net sales were a record $176 million, up 4% over the previous record set last quarter and up 13% compared to last year's second quarter sales of $155 million. Operating margins were 60 basis points higher than a year ago, driven by the profit flow-through from the higher sales levels and successful customer pricing strategies as we continue to recover a high percentage of our increased inventory costs with customers in this segment. In our Assembly Components segment, sales for the quarter were $154 million compared to $110 million a year ago, an increase of 41% year-over-year. On an adjusted basis, excluding the onetime charges related to the restructuring of certain plant operations in our aluminum and fuel products businesses, our adjusted operating loss in this current quarter was $3 million, an improvement from an adjusted loss of $5 million a year ago. In our Engineered Products segment, second quarter sales were $99 million, up 15% compared to $86 million a year ago and at their highest level since the first quarter of 2020. For the remainder of 2022, we expect continued year-over-year improvement in sales and operating income in this segment as we convert our strong capital equipment backlog into sales and from the recovery in certain key end markets in our forged and machine products business. And finally, corporate expenses totaled $7.5 million during the quarter compared to $6.8 million a year ago, the higher expenses in the current year were driven by higher personnel costs and incremental professional fees in the current period."
}