{
    "symbol": "PKOH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 04:14:06",
    "content": " During the quarter, adjusted operating income and EBITDA improved both year-over-year and sequentially as a result of the strong end market demand, increased customer pricing and the impact of restructuring efforts implemented throughout our businesses. Interest expense totaled $9.6 million compared to $7.6 million a year ago, with the increase driven by higher interest rates on our revolving credit facility compared to a year ago as well as higher average borrowings driven by the acquisitions we completed during the quarter and working capital needed to support the significantly higher sales levels. In Supply Technologies, net sales were a record $186 million, up 6% over the previous record set last quarter and up 21% compared to last year's third quarter sales of $154 million. Adjusted operating income in this segment totaled $11.6 million in the current quarter, an increase of almost $1 million year-over-year as the profit flow-through from higher sales levels was partially offset by higher freight costs, including ocean freight and blank sailings as well as higher product costs. In our Assembly Components segment, sales for the quarter were $153 million compared to $120 million a year ago, an increase of 27% year-over-year. On an adjusted basis, operating income was nearly breakeven in the current quarter compared to a loss of $5.5 million in the prior year. In our Engineered Products segment, second quarter sales were $97 million, up 15% compared to $84 million a year ago, driven by increased customer demand in both our capital equipment and Forged and Machine products business. In our Forged and Machine products business, sales in the quarter were $30 million, which is their highest level since the first quarter of 2020 as our key end markets, including aerospace, rail and oil and gas continue to improve from the previous two years. During the quarter, operating income in this segment was nearly $6 million compared to less than $1 million a year ago."
}