{
    "symbol": "PKOH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 14:31:04",
    "content": " Key highlights in 2022 included the following; first, we achieved record consolidated net sales from continuing operations of $1.5 billion, up 17% year-over-year, driven by growth in all three of our business segments. Consolidated net sales from continuing operations in 2022 were $1.5 billion, up 17% compared to $1.3 billion a year ago, with higher year-over-year sales in all three of our business segments. Significant improvement in operating income was delivered in each business segment, most notably in our Engineered Products segment, which improved year-over-year by $22 million. During the fourth quarter, we reduced net working capital by $7 million and over the next 12 to 18 months, expect further reductions in net working capital days, resulting in significant improvement in free cash flows year-over-year. With respect to our Aluminum Products business, which is now classified as discontinued for financial reporting purposes, we reported a net loss for the year of $24.3 million, which was driven by losses incurred on a product line that we exited in midyear, non-cash charges for idle assets, and startup expenses related to our plant in Mexico. Moving now to our fourth quarter results, net sales from continuing operations of $382 million were up 17% year-over-year compared to $327 million in the prior year, driven by strong year-over-year customer demand across all three of our business segments. In Supply Technologies, 2022 net sales for the full year were a record $712 million, up 15% compared to $620 million in 2021. Operating income in this segment totaled approximately $46 million in 2022, up 7% compared to $43 million in 2021, driven by the higher sales levels. In the fourth quarter of 2022, net sales were $181 million were up 18% compared to $153 million in the fourth quarter of 2021 and operating income was $10 million in each period. In our Assembly Components segment, which now excludes our Aluminum Products business, sales were $389 million for the year, up 21% compared to $322 million in 2021, resulting from sales on new programs launched and increased net price realization, which helped offset product inflation and other increased costs in this segment during the year. Excluding charges related to plant closure and consolidation activities, 2022 adjusted operating income was $7 million compared to $3 million in 2021 with the improvement driven by profit flow through from the higher sales levels, price increases, and benefits from profit improvement initiatives in this business. In the fourth quarter, net sales of $95 million were up 13% compared to $83 million in the fourth quarter of 2021 and adjusted operating income improved $5 million year-over-year to $2 million in the quarter. In our Engineered Products segment, 2022 sales were $393 million, up 17% compared to $336 million dollars in 2021, driven by strong customer demand in both our Capital Equipment and Forged and Machine Products businesses. Excluding charges related to plant consolidation activities, our adjusted operating income for the year was $23 million compared to $1 million a year ago, with a significant improvement driven by profit flow through from higher sales levels, implemented operational improvements, the benefits of plant consolidation actions, and other margin enhancement initiatives. In the fourth quarter of 2022, net sales of $106 million were up 17% compared to $90 million in the fourth quarter of last year and adjusted operating income was $6 million in the quarter compared to a loss of $100,000 a year ago. In addition, we expect year-over-year improvement and adjusted operating income, EBITDA as defined, free cash flow, and adjusted EPS in 2023, driven by the sales growth, benefits from the plant consolidations completed over the last two years, and other implemented margin improvement initiatives across each business segment."
}