{
    "symbol": "RDWR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 10:35:05",
    "content": " Good morning, everyone, and welcome to Radware's third quarter 2022 earnings conference call. During today's call, we may make projections or other forward-looking statements regarding future events or the future financial performance of the company. These forward-looking statements are subject to various risk and uncertainties, and actual results could differ materially from Radware's current forecast and estimates. Factors that could cause or contribute to such differences include, but are not limited to, impact from the COVID-19 pandemic, general business conditions and our ability to address changes in our industry, changes in demand for products, the timing and the amount of orders and other risks detailed from time to time in Radware's filings. We refer you to the documents the company files and furnishes from time to time with the SEC, specifically the company's last annual report on Form 20-F as filed on April 11, 2022. During the last few weeks of the third quarter, we saw closing delays in some customer deals and an increase in multi phased contracts, in response to macroeconomic headwinds. We have a healthy pipeline and we see strong activity level among customers and prospects, which continue to be driven by a significant increase in cyber-attacks. Given that, we're taking several measures to manage the business and leverage opportunities that will position Radware for long-term success. First, we will continue to focus on and cater to the large enterprise market with our state-of-the-art protection. For example, during the third quarter, we closed a multimillion dollar application security deal with a Fortune 500 SaaS company. In partnership with Cisco, we also closed another new logo deal with a major U.S. financial services company to provide hybrid cloud DDoS protection. In times of financial uncertainty and an increased threat landscape, cloud security can help customers boost their security without committing to larger upfront CapEx investments. In response to this market need, we are constantly expanding our global footprint by opening more cloud security centers. During the third quarter, we opened two new centers in Dubai and Italy to expand our market share. For example, in the Emirates, several new customers already onboarded to the security center. This customer bought our cloud while following the demonstration of our advanced capabilities and was convinced in Radware technology advantage, especially considering the local cloud center. However, the capacity and skill talent that mid-market companies have to manage their security environments are more limited. To leverage this opportunity, we are targeting mid-market security needs by expanding our channel relationships and offering cyber protections through our cloud first approach. And lastly, we're taking measures to fine tune our operational expenses to ensure our business is profitable with strong positive cash flow from operations. As we look at the state of the cybersecurity landscape, we believe there are several market forces playing to our advantage. In fact, in the third quarter, Gartner recognized Radware for its application security solution. In its critical capabilities report, Gartner once again ranked Radware the number two solution out of 14 companies for API security and DevOp use cases as well as high security use case. According to Gartner, Radware provides our best set of application security controls and offers one of the stronger API security offering on the WAF market. According to our multi cloud application security reports, 70% of respondents are not confident in their ability to apply security across on-prem and multi-cloud platforms. In short, more organizations are looking to have a dedicated application security solution in the public cloud amid the that Radware is especially suited to meet. Our company is healthy with a large and diversified customer base, and robust balance sheet with more than $400 million on hand. We continue to generate cash from operations, build our annuity business and invest in our cloud security footprint and capacity. Although this quarter revenue fell below expectations, we expect to end the year with a record revenue. With cyberattacks increasing in complexity and gliding in sheer volume, we believe the need for our solutions and specifically real time protection of applications will remain strong. As we continue to fight for the good guys in this cyber world, we are confident that Radware is on the right track and well positioned for long term growth. As Roy noted, we saw longer sales cycle as well as resizing in some of our large enterprise and carriers customers. Revenue in the Americas in the third quarter was $32.9 million, representing 8% decrease in Q3 2022 as compared to Q3 2021. On a 12 trailing month basis, Americas revenue decreased by 1%. On a 12 trailing month basis, our revenue grew by 18%. In the third quarter, Americas accounted for 47% of total revenue. Gross margin in Q3 2022 was 82.9% compared to 82.6% in the same period in 2021, an expansion of 30 basis points. Our main gross margin improvement is related to the complete integration of Security-Dam, partially offset by higher costs related to recently launched cloud infrastructure coupled with lower revenue. To improve profitability, we are reallocating internal resources as evidenced by headcount growth this quarter of only 1% compared to the second quarter. Compared to Q2 2022, operating expenses decreased by 2%, demonstrating our ability to manage our cost structure in a responsible manner and in accordance with the market environment. Despite a decline in revenue in the third quarter, we met our, a, earnings guidance, which is the testimony of our commitment to manage our expenses and our ability to navigate the company and generate cash even during challenging times. Within the third quarter, we repurchased shares in the amount of approximately $6 million and we ended Q3 2022 with approximately $434 million in cash, bank deposit and marketable securities. Our strong balance sheet provided us with great foundation to navigate in the current market conditions and volatility, while focusing on long term opportunities to drive profitable growth. During the third quarters, Radware Board of Directors has authorized an increase of $20 million buyback of the company's ordinary shares. And as of today, the remaining approved buyback budget is $81 million. Radware is a robust company with global team of professionals, a profitable business model based on critical cyber solution, a strong balance sheet and loyal customer base. Moreover, RPO for the end of the third quarter grew versus the third quarter of last year and all of which give us the confidence in the fundamentals of our business. As we said in previous call, while a challenging microenvironment posed some uncertainties on customer spending behavior, we expect cyber security demand to remain resilient in the long run. However, we're still witnessing protracted sales cycle and a growing preference for multi-phase deployment among large enterprise end carriers. Given all these trends and developments reviewed earlier, we anticipate Q4 2022 non-GAAP diluted net earnings per share to be between $0.16 and $0.19. In the end, it's -- I would say, it's an outcome of the revenues. In general, we see continuous growth in cloud ARR and more challenging on the product and services side. And I assume within that, I guess I assume the maintenance contracts that are inside that number that are on appliances or traditional hardware sales, is that the piece that's sort of softening and that's getting offset by cloud and products subscriptions and therefore you're getting to like a net flat sequential number. So that is definitely in our model, but we believe that with heightened level of revenues plus even more focused on cloud security as we've noted in our prepared remarks that should drive faster growth of the cloud based to overshadow any decline if happening on the maintenance contract. So can you just talk about the -- I know it seems mundane, but obviously, you've got a very large cash balance and with interest rates going up, a 3 point increase in interest rates would add about $8 million here to your numbers, if once it's fully rolled through. Is the $2.4 million or $2.5 million (ph) in the third quarter, the run rate and how will it step up as interest rate benefits go through the balance sheet? Alex, so we expect more or less same income from interest in the coming quarter, $2.4 million, $2.5 million third quarter. So just mechanically, I mean, interest rates have gone up a lot more than 3% and probably be to go up another three quarters today in the U.S. Can you talk about how that -- how you're structured against that? We are balancing between convertible bonds and investing in just putting the money in banks for six and 12 months, which currently yields even higher interest than bonds that actually feels in our investment policy. So looking out to next year, you're not going to get more -- a nice uptick in the interest income because it's a pretty big number. I mean, we're talking about again, on your cash and then short term investments, a 3 point swing which we've already seen is an $8 million change and it's not trivial. Let's say about half is still based on, let's say, convertible bonds that still has lower interest rate. Going back to the competitive landscape, it does sound like EMEA is under a lot of pressure, pretty clear that conditions there are going to get worse over the next couple of quarters as winter comes in and the economies continue to decelerate. So it's not only the creation that continues and depends on the region, might be more challenged or less challenged, but also because of delays of closing that obviously increases the current pipeline but overall pipeline is robust. And as I've mentioned, we did not see competitive pressure or losses on the pipeline. They ended up with saying, okay, we'll do 10 MAX first, one-third, the next year as we deploy the MAX, et cetera, we will do another one and maybe towards the end of the year or the another thing. So they are -- because of supply chain budgets, whatever they are phasing their own deployments and they're phasing our orders. So in that case, a product deal that's generally create immediate impact on revenues, of course, for us, immediate recognition is moving from $3.5 million to $1.2 million. We are seeing, for example, customers that instead of taking the full cloud security solution at one shot, they're trying to stage it for cloud, and then some appliances et cetera. So it has different shapes and forms, but budget allocation, more lengthening sales and approvals, cycles, all of that we see either of the whole deal pushed or some of the deal getting booked and then delayed. We see it in very large deals, the regular mid-sized deals or even medium to large, we did not maybe yet, but we did not experience that. But on the larger commits, in the very large enterprises or areas, that's where we see this phenomena. For example, the example I gave from the carrier, it's an existing large customer of value, the deployment towards 5G is new. So I would split it to where we are thought of a new infrastructure build and then it might be on the long side because it depends on their plans for a new data center or deploying of 5G, et cetera, et cetera. And then I would say, we are aligned to other overall business environment and investment capability, so that's one end. On the other end, when it's serving existing infrastructure and existing business, I don't think it can be delayed too much because the hackers and the cyber activity is there. So you can delay budget, you can try to resize it or to fit more your current needs versus buying for three years ahead of time, et cetera, et cetera, but the investment you would need to make otherwise it would be vulnerable. So I think the heightened cyber activity levels would actually accelerate budget spend in our areas, as long as it belongs to existing infrastructure, existing applications, et cetera, I think it's hard to delay too long. I know it does not show in the current quarter numbers, but in general, we've seen especially in cloud our win ratios going up in the last three, four quarters. I mentioned Gartner report, we have other reports attesting to the same and very strong customer references in Gartner,  et cetera. We do need to take the steps we've mentioned going more cloud, strengthening the mid-market to accelerate our growth."
}