{
    "symbol": "RDWR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 13:50:04",
    "content": "  Operator: Welcome to the Radware Conference Call discussing Second Quarter 2022 Results, and thank you all for holding. As a reminder, this conference is being recorded, August 8, 2022. I would now like to turn this call over to Yisca Erez, Director, Investor Relations at Radware. Good morning, everyone, and welcome to Radware's second quarter 2022 earnings conference call. Joining me today are Roy Zisapel, President and Chief Executive Officer; and Guy Avidan, Chief Financial Officer. During today's call, we may make projections or other forward-looking statements regarding future events or the future financial performance of the company. These forward-looking statements are subject to various risk and uncertainties, and actual results could differ materially from Radware's current forecast and estimates. Factors that could cause or contribute to such differences include, but are not limited to, impact from the COVID-19 pandemic, general business conditions and our ability to address changes in our market and our industry, changes in demand for products, the timing and the amount of orders and other risks detailed from time to time in Radware's filings. We refer you to the documents the company files and furnishes from time to time with the SEC, specifically the company's last annual report on Form 20-F as filed on April 11, 2022. In the second quarter, we drove solid results. Our total revenues grew 8% year-over-year, EPS was $0.18 and cash flow from operations was very strong at $31.5 million. And Radware is a provider of real-time protection, serves as a fundamental force in defending our customers most critical applications and data centers from cyber attacks. As the threat landscape continues to evolve with continuous increase in number and size of attacks, our customers must ensure their business continuity, strengthen resilience and improve the customer experience. Therefore, we have every reason to believe that the demand for our solutions will continue to grow in the long-term. At the same time, we also believe that uncertainties present in the current macro environment might impact the spending behavior of our customers in the short-term. Recently, we've seen some delays more than usual, and lengthening sales cycles in large deals in America's enterprise, with some customers opting for stage deployments. Looking at the bigger picture, Radware is a healthy company and we are well-positioned for times of recession. We continue to deliver and forecast sustain growth, high gross margin and healthy cash from operations. We have a large customer base that is diversified across industries and geographies, and we have a strong balance sheet with more than $440 million in cash. A couple of months ago, we announced that Ukraine State Service of Special Communication and Information Protection is using Radware cloud DDoS protection and cloud application security to protect the infrastructure and applications in face of daily attacks. In the second quarter of 2022, DDoS attacks were relentless. Not only are DDoS attacks mounting, but so are web application attacks, which during the second quarter their number increased by 24% and bad bot attacks that rose 148%. The midsize customers have the same cyber threats and security requirements, like the large enterprise peers, yet they cannot afford the required CapEx investment and personnel needed to deploy and manage by themselves the high-end solutions. In the second quarter, we continue to expand our cloud service footprint and capacity. We also continue to innovate on the product front, we just released a new set of crypto mitigation algorithms that block sophisticated bots that evade the additional solutions. At the same time, these algorithms enable genuine website visitors to enjoy a frictionless CAPTCHA free user experience. GigaOm awarded Radware the highest possible scores in Key Criteria categories, such as rules bundles, AI enhancement, API discovery, data leak protection, and bot management. In addition, Quadrant Knowledge Solutions named Radware the leader in its SPARK Matrix for DDoS Mitigation report, with comprehensive technology and customer experience management, Radware received the highest combined ratings for technology excellence, and customer impact, making it the leading vendor overall. For instance, we signed a large DDoS deal with an IT services and web hosting company. They experienced multiple high volumetric attacks that were not blocked by their incumbent solution, alerting them that they needed more comprehensive and robust protection. Our solution is blocking massive attacks in these customers daily, automatically and without any intervention from their staffs. During the quarter, we also expanded our business with one of the world's leading software and SaaS company. This customer has been suffering for a long time with outages, occasioned by sophisticated and massive bot attacks. To recap, we've been building a leading comprehensive portfolio of data center and application security solutions. We are a strong and healthy company in terms of financials and well diversified in terms of customers and geographies, enabling us to overcome macro challenges and deliver sustained revenue growth with profitability. With that, I would like to thank our customers, shareholders and employees for their confidence and trust they place in Radware. Before beginning the financial overview, I'd like to remind you that unless otherwise indicated, all financial results are non-GAAP. Second quarter 2022 revenue grew 8% year-over-year to $75.1 million, compared to $69.7 million in the same period of last year. On a regional breakdown, revenue of the Americas in the second quarter increased to $29.5 million, representing 6% growth in Q2 2022, compared to Q2 2021. In the last week of the quarters we saw lengthening sales cycle in some of our large enterprise customers, which affect our growth in the region. APAC revenue was $15.7 million, a decrease of 10% compared to Q2 2021. Gross margin in Q2 2022 was 83.3% compared to 82.3% in the same period in 2021, an expansion of 100 basis points. Our gross margin improve is mainly the results of the complete integration of Security-Dam, partially offset by higher cost related to cloud infrastructure and supply chain. Operating expenses in the second quarter of 2022 were $54.1 million, representing an increase of 11% compared to the same period in 2021. Last quarter, we shared with you the new structure of Radware, which consists of the core business of application delivery, application and data center security and cloud security as a service and the Hawks business which comprise of SkyHawk, and EdgeHawk. Radware's adjusted EBITDA for the second quarter was $10.5 million, which include the negative $2.1 million impact on adjusted EBITDA of the Hawks group. We generated strong cash flow from operation in Q2 2022, which totaled $31.5 million compared to $8.8 million in the same period of last year. Cash flow from operation was favorably impacted primarily by strong collection, as reflected in decrease in account receivable and by increase in deferred revenues. During the second quarter, we repurchased shares in the amount of approximately $18.1 million and we ended Q2 2022 with approximately $442 million in cash, bank deposit and marketable securities. As Roy mentioned earlier, while we current -- while the current global macroeconomic environment poses some uncertainties, we expect cybersecurity spending in our domain to remain resilient in the long-term. However, we're witnessing longer sales cycle among large enterprise customers. Given our long-term positive view on the market and our opportunities, we continue to invest in infrastructure, and R&D in order to capitalize on these future opportunities. Given all these trends and developments reviewed earlier, we anticipate Q3 2022 diluted earnings per share to be between $0.15 and $0.18. As a result of the expected revenue for the third quarter, we are forecasting 6% annual revenue growth for 2022. So first one was in the quarter, it looks to me like you would have had earnings about $0.04 higher had it been not for the currency translation hit in the quarter. And then second, as we look forward, can you remind us how youâ\u0080\u0099re hedged and what your approach to the shekel is, at this point. Obviously, youâ\u0080\u0099ve seen a very significant move in the exchange rates over the last pretty much since the war started in Ukraine. So we already hedge from the first half, let's say middle of the first half of the year. So your hedge -- yes, just going -- before you get off of that, your hedge â\u0080¦\n Partially mid 2022. Again, if the FX stays as it is today, we expect to reduce, let's say, OpEx based on the same headcount as of today, more than 100 basis point in 2023. Going back to the operational aspect of your business, where you guys have been making a pretty, pretty aggressive play to sign up a lot of partnerships. And generally speaking, take a long time for them to go from concept signing, a contract to impacting your revenues. I would say partnerships that were more of the natural reselling type of partnership, you might be right, they would look to minimize future investments to be more conservative, et cetera. At the same time, what we see from partnerships that are more towards the MSSP side, or the  or even the CDN, is that they actually feel an opportunity to increase their footprint and market sharing the customer. So some of those partners, I've mentioned, for example, as the with the bot management wing, and we have many others, especially in the MSSP domain, we're actually seeing a lot of activity from them, as they can increase their share of wallet in their customers, they can actually play very strongly on the fact that security now is a fully managed service at a very high level versus the need for dedicated OpEx and CapEx. So I would say it depends on the partnership, but definitely, some of them are acting very well, and we plan to continue to invest in them. Yes, it's still early, but we see promise there. So with those products, how do we think about their backlog and your realization of revenues into that account because it's a non-material PC business at this point. Obviously, the pieces of Radware software that reside on top of Cisco hardware, let's say the Firepower Firewall, if the firewall cannot chip , then obviously we don't get our result. So I do expect Cisco to be more active with our cloud DDoS offering, cloud WAF offering as a result of the lack of ability on their end to ship, maybe firewall in the quantities they we're used to. So I think we can actually, time will tell, it's still early and we will update you in the future calls. I think in my comments, I've mentioned that we took that into account in our forecast as much as we can at this point. So at this point, we were quite consistent in previous quarters around 8%, 9%, this quarter even 10%. But let's call it the 7% to 9% CAGR that we were alluding to, as the growth rate of the company, I think it's well backed by the ARR. And by the deferred revenues, that is I would say future looking. And together with that our pipelines today are at record level, some of it because of the delays in closing, but some of it because we continue to enhance pipeline. So looking on everything together, I think the focus that we gave is well  and we have the ARR and deferred even giving us some tailwind for that so we feel confident about it. Any thoughts on sort of North American contribution growth hiring, that would be great. So definitely, we are looking for North America to grow faster, it's clear. But obviously those people are relatively new in the organization, most of them are, 3 months, maybe even less 6 months and so. Together with this ramp of personnel and sharper focus on cloud security solutions, we believe that we will be able to get North America to faster growth rates. But if I look on specifically, like three large deals that we had in North America, all of them in the -- each one of them in the millions of dollar range that I -- that I can think of as the prime examples of those delays. So we saw budget freezes towards the end of the quarter that I think is more macro than anything, because we're talking on a very large, successful, profitable growing company. In financial services, we saw a delay in pushing of investments towards even Q4. And in the last case of  infrastructure, it's more scrutiny, more look on architecture, on budgets, et cetera. By now, I think we have a variable for forecasting this quarter. But that's what we've seen in June, beginning of July. But those are not the -- those companies that we work with are the larger enterprise, the carriers, it's not a risk for their business. It's those delays, recession, budgets, scrutiny of the budget that comes into place in those times. I think the supply chain is not only from last quarter, we've seen it. We increased inventory, Guy mentioned also in his remarks, we were paying more for components, we were suffering in gross margin, but we were able to supply. However, in some cases, we do see that they're building a new data center, the switching equipment is not ready to ship in the next 6 months. So there is some, I would say overall delay because of supply chain globally. But that's already built into our guidance, forecast, et cetera, we're seeing that. I would say, that's another good reason to focus in hardware and on cloud security services. And just lastly, so I know you're kind of talking about the revenue growth, 7% to 9%. We might do that, at least in the short-term that's our decision to continue to invest. Over the long run, I must tell you that with the resumption of sales growth towards the 7% to 9%, I believe you would see delivered in the model . We want to bring back the groceries back to our 7% to 9% CAGR, I think the delivery will be seen."
}