{
    "symbol": "RDWR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 12:17:06",
    "content": " Today, we report that despite the challenging macro environments, we ended the fourth quarter of 2022 with $74 million in revenues and $0.17 of EPS. Full-year revenue was $293.4 million, an increase of 2% compared to the full-year 2021. In 2022, topline was driven by our cloud and subscription business revenue, which increased 13% in 2022 to $105 million and accounted for 36% after the revenue in 2022, up from 32% in 2021 and 26% in 2020. As for the annual recurring revenue, total ARR grew 7% in 2022 to $202 million and cloud and subscription ARR accelerated to 14% growth in the same period. On a regional breakdown, revenue in the Americas in the fourth quarter 2022 increased by 2% to $32 million compared to Q4 2021. For the full-year 2022, America revenue decreased by 4% to $124 million compared to the full-year 2021. EMEA revenue in the fourth quarter was $24 million, representing a decrease of 18% when compared to the same period of the last year. For the full-year 2022, EMEA revenue grew by 6% to $104 million compared to 2021. EMEA accounted for 33% of total revenue and 36% in the fourth quarter and full-year 2022, respectively, and APAC accounted for the remaining 24% and 22% of total revenue in the fourth quarter and full-year 2022, respectively. Operating expenses in the fourth quarter of 2022 were $54.9 million, slightly below our midpoint guidance, representing an increase of 5% compared to the same period in 2021. Radware adjusted EBITDA for the fourth quarter and full-year was $8.2 million and $37.7 million, respectively, which included $3 million and $8.5 million negative impact for Q4 and 2022, respectively, on adjusted EBITDA of the Hawks Group. During Q4 2022, we generated $9.6 million in cash flow from operation compared to $28.9 million during the same period of last year and $32.1 million in the full-year 2022 compared to $71.8 million in 2021. During the fourth quarter, we repurchased shares in the amount of approximately $12.3 million and $59.5 million during the full-year 2022."
}