{
    "symbol": "BILL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-05 22:57:11",
    "content": " Bill.com's organic core revenue grew 74% year-over-year, and revenue from our Divvy spend management solution increased 155% year-over-year. As of the end of fiscal Q3, more than 380,000 businesses trusted Bill.com to manage their financial operations, and we processed over $55 billion of total payment volume on our platform. We experienced strong demand across all channels, particularly among financial institutions where our white-label platform for Bank of America's small business customers continue to roll out to new regions in the US. We are combining Bill.com's AP platform, powerful distribution capabilities and significant scale with Divvy's spend management expertise, customer success initiatives and modern design, and with Invoice2go's account receivables capabilities, mobile experiences and global reach. We ended Q3 with 18,100 spending businesses using our Divvy spend management solution, representing growth of 2,600 net new adds in the quarter. During the quarter we processed 2.1 billion in card transactions from spending businesses using our Divvy spend management solution, which is an increase of 118% year-over-year. Organic Bill.com core revenue was $102.1 million, an increase of 74% year-over-year due to strong demand across channels and increased customer adoption of our ad valorem payment products. Transaction revenue increased to $113.3 million, up 286% year-over-year due to TPV strength, increased adoption of our ad valorem products and increasing spend on Divvy, which totaled $53.6 million in transaction revenue for Q3. For Q4 Bill.com organic core annual revenue growth is expected to be approximately 60% on a standalone basis, while Divvy spend management revenue is expected to grow approximately 120% year-over-year from approximately $29 million in fiscal Q4 of 2021. Hi, Rene and John. I would just add like we're -- in addition to that confidence for being able to scale customer acquisition over the long-term given our investments in our go-to-market distribution in the near term, we're still comfortable with net adds being around that 6,000 level mainly because of our current investment programs and the incremental step-ups that we've seen the success that we've driven from our financial institution partners and accounting firms, we don't necessarily control the timing of those. Hi, Rene and John. Yes, the just to step back when you think about the millions of transactions that we do every quarter the billions of dollars that we do every quarter there's lots of different sizes of suppliers in the network that are getting paid through the Bill.com solution."
}