{
    "symbol": "LND",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-08 16:51:03",
    "content": " 04:23 I'd like to remind you, last year, when we talk about two sixty million in dividends they are linked to an excellent operational results last year and a small part of this came from the sale of farms, real estate, here we already have relevant results from the sale of real estate. The second sale, the most important sale of the company higher volume, five and eighty nine million reais, and also, we told the market about a farm that we acquired in the past in twenty zero six, two thousand and six worth ten thousand per hector and now we're selling at a hundred and fifty hundred and sixty thousand per hector. So, when we looked at BrasilAgro and Brazil and Sugarcane, we have almost five hundred and eighty five hundred ninety, which is, and we see the harvest at the end of now with five hundred and twenty thousand tons. 19:07 The last line is cotton, where we have progress, an important progress, sixty eight percent in sales in relation to the previous harvest, actually in relation to this harvest with a price of one hundred and sixty three reais. As Ana mentioned, and our – this is the year until two thirty next year and here what we can see an increase of eighty three percent in net revenue of the company. We see a net profit one hundred and zero seven million reais, forty three percent above last year, and it's important to stress. And with prices, in soybean forty five percent higher, and in the case of corn thirty two percent, So, we reinforced, we're expecting an EBITDA that will be very similar to that of June thirty last two, but the impact in the price of sugarcane will provoke a significant increase. We see here assets, four point one percent, also, and the company's cash on September 30, it had an increase in relation to June thirty because we're selling the inventory of soybean and corn. It's important to say that accounts receivable short-term, long-term four hundred million reais, due to the sale of farms, here we're including receivables of the use farms that we sold and we will record in the next quarter. Here, one objective we had in the past that we mentioned to you to have a longer debt, two hundred and forty million, we have for five years and three hundred million reais, which is what we need to plant as the company's operation. Here, this is, we'd like to say that the general assembly approved the payment of two hundred sixty million reais in dividends, we will pay on the tenth after tomorrow, November tenth, after tomorrow, and here I'd like to stress that although we don't have a clear dividend policy, the objective of the company is to have a dividend yield of five five point three percent. 33:57 We should record three thirty million during this year and the remainder, the five hundred ninety million only in twenty twenty four and the sale of Rio do Meio should also be recorded during this year, but it is also sold in installments. It's important to see when we look at the price of last year, the price of sales for this harvest, we're expecting very positive margins for us. 42:48 The way we see it, after winter in the Northern hemisphere with more natural gas available at the end of the first semester next year beginning of the second semester twenty twenty two, we can expect a drop in the price of fertilizers, especially nitrogen and phosphate."
}