{
    "symbol": "PAYX",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-22 16:22:05",
    "content": " Also as I mentioned in my comments, if you just think about the things we've done with Flex in our PEO offering, 99%, almost 100% of POE employee's, worksite employees handled open enrollment online digitally now, and that reduced calling in for questions and issues by over 25%. As many of you know, you've got HCM solutions that are roughly about, a little bit under half of that revenue stream, but then I would say there's two other parts that we don't talk about as much, but increasingly have become very, very important, which are the combination of retirement services and also what we would call ASR, HR Outsourcing; this not PEO. We have sold that extremely well and when you look across the board, Efrain mention between time and attendance, but HR Solutions you know in a COVID environment is so critically important and the technology that we've been reduced on the mobile apps, so the ability to really handle distributed workforces, to be able to track vaccinations, and those who were unvaccinated, all these things are part of a digital experience that clients are really seeing. From a price standpoint, I think we're feeling like we still have good price realization, you know and I don't think there's some pressure on it, but as Efrain mentioned in this inflationary kind of time frame think it's – one probably is difficult to get it as it was and also while it's still very competitive in the market. Yeah, so Bryan to your point, I think that we've had very, very good average revenue price per client, especially on our HCM clients, it's been very positive and our price realization in this environment when you triangulate the retention, plus the extra, the additional value added in terms of services sold we we've been able to do very, very well. This partnership we have with Indeed, where you are connected digitally through Paychex Flex to Indeed the world's largest job posting site, you get a credit on Indeed, Indeed, you can post the job electronically, digitally then if they respond to the post, it goes right into the system, if you hire them, everything is paperless, these are all things that mid-market clients in particular right now need and we've been ahead of it and really hats off to the product management and development teams. You know in the last year what we’ve seen in the clients sizes, especially in our mid-market business are trending up, not down, and I think that part of it is, there – in this environment the ability to bundle the right level of value added services to a mid-market client is valued very highly and not all of the competition can do that, because not all of the competition has an integrated platform, plus world class service and I think that that's a winning proposition in the marketplace right now. And the sales engineering team, and so they’ve just done a great job in kind of building out sandboxes and different examples for a client that are very personalized so the client could say, ‘this is what you're going to get, this is how you work through it, and frankly it's probably easier to do it virtually and digitally than it is in front of the client you know, because they can all see it right in front of them and they can take them through it. We're well staffed, we're you know great products;, everything's really moving very well, so it feels very strong right now, but we'll know at the end of selling season, but we feel pretty good right now with the momentum. Yeah James, it's pretty early but we're getting a lot of great feedback from clients, because everyone's looking for that kind of information and I mean we certainly use the same kind of thing and have for some time internally and now it’s much more built for mid-market and small clients to be able to use. Yeah, its early innings for pre-check, but we're getting very good feedback and that it's very easy for them to check that the accuracy that from a client perspective they feel the accuracy is helping them, you know from the standpoint that their employees aren’t going to complain that something they – they got something that they didn't expect in the paycheck. I think you're going to see over the next, it'll take I think the next couple of years, but I think they'll be a very big demand for that as you know employees just say, ‘hey, look I want to get paid today’ and I think you'll see a resurgence of more gig economy kind of thing where I'm working two or three jobs, but they're all I want the money now because it's eight hours here in eight hours there. So I'd say still pretty light success for those who do it, they like it, and we're trying to find new ways to build that out and grow that business, because we think it's really going to be a big demand in the future. So we are still getting a very small on the low end, there is more typically on the very low end as you know, but we're still seeing a lot of start-up businesses, and I think it's just part of the economy right now. One of the things that we just did a survey and it comes out very strong is, the need – if you're going to attract and retain employees, you got to really look out for their wellbeing and that’s from a financial standpoint, that's from benefits, retirement included, they're really looking for that overall perspective. Yeah, and Peter on the margin part, you know one of the things that I think you've seen in the model certainly over the last three, four quarters or so is that when you have growth in revenue, you don't have attendant costs associated with it typically, and so you scale mostly and drop a lot to the bottom line. You know we still haven't seen necessarily the federal mandate, but that's been discussed a lot, but a lot of states, California in particular, New York, some others are coming out saying that you know businesses – in some cases all sizes have to offer a retirement plan of some sort to their employees."
}