{
    "symbol": "PAYX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-29 16:20:04",
    "content": " And I just want to call out the margin in the quarter, we made very deliberate choices in the fourth quarter to invest back in our client base and in our -- among our employees, thatâ\u0080\u0099s why all of the flow through did not go down to the bottomline and that was a deliberate choice that we think leads to the future sustainability of the business and we think we are positioned very well, as a result of those choices. The strongest year we have been in mid-market, probably, in our history and I think itâ\u0080\u0099s a great combination of sales execution, the products and the full suite of products that we are offering, that is really tailored to exactly what clients are looking for now. The products have just been very responsive and the continued used by the clients and their employees have made the retention stick and we have talked about that for many years, but I donâ\u0080\u0099t think thatâ\u0080\u0099s ever been stronger and it really accelerated during the pandemic as people were much more distributed in a workforce, remote workforces. I think particularly in the mid-market, mid-market that we havenâ\u0080\u0099t been as strong, I think, if you went back four years, five years ago, is we want it to be the introduction of the products over the last three years really positioned us, they have a really strong sales response to this last year and itâ\u0080\u0099s continuing into the first quarter. If things turn and itâ\u0080\u0099s a recession and you got to manage people out or cost down, we have the products, the technology and the people to help you do that as well and I think we showed that as Efrain said in the pandemic when people thought, jeez, I donâ\u0080\u0099t know, will they be able to keep their margins, we did extremely well. So itâ\u0080\u0099s not just about health and dental envision now, itâ\u0080\u0099s really, as John said, this broader offering that the PEO can bring to small businesses in particular to say, hey, you can offer other things in insurance and you can offer more mental health support that is very hot right now and you can offer other plans that you would not be able to do by yourself. But with the cash that Efrain talked about, we are well positioned to take advantage of opportunities that come up, whether itâ\u0080\u0099s a recession or just kind of a repricing on some of the valuations, that I think will happen, because you can see it already in the private markets where there is a lot of cost cutting and a lot of much more conservative approaches, things to get themselves positioned better to make sure they donâ\u0080\u0099t lose so much on the valuation."
}