{
    "symbol": "PAYX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-30 11:01:04",
    "content": " Within service revenue, Management Solutions revenue increased 13% to $960 million driven by higher client bases across our HCM suite, check volumes, revenues per check -- revenue per client, payroll funding and outsourced service for temporary staffing clients and ancillary HR services resulting from ERTC, which Marty just mentioned. The outlook reflects the current macro environment, which saw improvement in the quarter despite some disruption from Omicron, we've taken that into account -- we've taken into account the fact that third quarter results exceeded expectations, but have tempered our outlook given the changing macroeconomic environment, and we provided the following updated fiscal 2022 guidance as you saw, Management Solutions revenue is now expected to grow in the range of 12% to 13%. And when you think of our average client size, it's a significant dollar amount that adds, as Efrain mentioned earlier, a lot of value -- and then to say, 'hey, not only are we helping you with that, here's how we can help you continue to sustain your growth in your business. But I think that the value of the products to our clients have increased is the -- all the things we've talked about before, with the help that we're giving them through government subsidies, with all of the value we're giving them in HR, then all the product investments we've made. Well, I think right now, as I've said, it's a little dicey given, okay, we had some government stimulus that they were able to -- some clients were able to take advantage of. It is going to -- we continue to do a lot, again, as I said, with our data and from a digital standpoint and really maximizing the use of that mobile app, so that we can build even more retention strength with the employees of our clients -- they're the ones that are using that mobile app and always have, even more than our clients. So we're giving -- trying to give our clients, employees everything they possibly can on their mobile app to produce better retention for us and not allow their employer to leave Paychex or want to leave Paychex, just like the diamond attendance, just like punching in and out, ship swapping and being able to do things like when we hire someone, everything is digital now. I think you'd see a majority probably from upsell, but there's plenty of new logos now that are coming in new businesses that for the first time are -- and especially in those states where we're prominent, the Florida is the Georgia, the Texas they're new to PEO and are not necessarily coming from ASO. Look, hey, it's all fun and games to say that, we're going to get all the benefit from six, seven, eight raises depending on your perspective, but you've got to be somewhat cautious about what the impact on the economy as a whole, especially on the small end of the market would be, I – we don't have any crystal ball."
}