{
    "symbol": "TWST",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-03 14:10:02",
    "content": " For the first quarter of fiscal '23, we reported revenues of $54.2 million, consistent with our guidance shared on our fiscal year-end call in November, and we posted strong orders of $64.7 million. Revenue for quarter 1 was $54.2 million, which is year-over-year growth of 29% and a sequential decline of 5%, which is in line with our guidance of $54 million. Orders were $64.7 million for the quarter, a sequential increase of 4% and 30% growth year-over-year. Gross margin for the quarter was 45.7% and we shipped approximately 2,100 customers, and that's up from approximately 1,800 customers in quarter 1 fiscal '22 and we ended quarter 1 with cash and investments of approximately $439 million. SynBio revenue for the quarter was $21.7 million, and that's exceeding our guidance and representing a year-over-year increase of approximately 21%. Genes revenue increased to $16.2 million, and that's up from $13.5 million in the first quarter of fiscal '22 and last year-over-year growth of approximately 20%, and we shipped 134,000 genes in the quarter, and that's an increase of 7% year-over-year. Biopharma revenue for fiscal first quarter '23 was $8.2 million, and that's year-over-year growth of 70% and is consistent with our prior guidance. On a regional basis, EMEA revenue rose to $16.3 million in the first quarter of fiscal '23 compared to $15.4 million in Q1 fiscal '22. U.S., including Americas revenue increased to $33.6 million in the first quarter as compared to $22.6 million for the same period of '22. Net to operating expenses, our operating expenses for the fiscal quarter, including R&D, SG&A and change in fair value and mark-to-market adjustments of acquisitions were approximately $69.4 million as compared to $78.9 million in Q1 fiscal '22. To break it down, R&D for the fiscal quarter was $31.2 million, and that's an increase from $22.6 million in the same period of fiscal '22. Factory of the Future pre-commercialization costs include Included in SG&A were $12.5 million in the first quarter, which includes compensation costs of $4.3 million; material expenses of $4.7 million associated with pre-commercialization trading activities; facilities and depreciation costs of $1.8 million as well as services of $1.2 million. We continue to project fiscal '23 revenue in the range of $261 million to $269 million, including SynBio revenue of $104 million to $106 million; NGS revenue, $120 million to $123 million; and Biopharma revenue was $37 million to $40 million. As we scale our revenue in the second half of fiscal '23, we're projecting our gross margin to be 39% to 40% for the year, which is in line with the guidance provided in our previous earnings calls. I think -- so Vijay, I mean, your correct overall, strong orders in the first quarter, I mean particularly in NGS, we've done a number of large customers come in, place larger orders, getting us well positioned for the second half. If you look at NGS first half, it's about $50 million in terms of revenue."
}