{
    "symbol": "PR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 13:43:10",
    "content": " A replay of the call will be accessible until May 12, 2022 by dialing 8558592056 and entering the conference ID number 3033538 or by visiting Centennial 's website at www.cdevinc.com. Yesterday, May 4th, we thought a Form 8-K with an earnings release reporting first quarter results, as well as operational results for the company. Many of these risks are beyond our control and are discussed in more detail in the risk factors in the forward-looking statements sections of our filings with the Securities and Exchange Commission, including our quarterly report on Form 10-K for the quarter ended March 31st, which will be filed with the SEC later this afternoon. Although we believe the expectations expressed are based on reasonable assumptions, they are not guarantees of future performance and actual results or developments may differ materially. Overall, Q1 was a strong quarter and we are very pleased to have started the year off with robust financial and operational execution. From a financial perspective, we generated record free cash flow that allowed us to fully repay all borrowings under our credit facility and build a significant amount of cash. This net debt reduction delivered leverage of 1.1 times at the end of the quarter, a level that is ahead of previous expectations. Operationally, we continued to deliver from a technical perspective with strong well results from our Northern and Southern Delaware positions across a variety of zones. Additionally, we were able to deliver capital expenditures in line with our expectations despite completing six more wells than originally anticipated. This dynamic underscores our operation team, focused on continued drilling and completion efficiencies, as well as continuing our quarterly success of drilling and completing wells ahead of schedule and under budget. In my comments from the year-end 2021 call, which is highlighted on the Slide 5, I laid out a differentiated 2022 game plan that was predicated on three core principles. First, delivering meaningful, free cash flow generation and reducing leverage below one term. And third, announcing and executing on our two year $350 million share repurchase program once we have achieved our leverage target. As I look back at our execution in the first quarter, and look ahead to our expectations for the remainder of the year, we believe that these objectives are not only on track, but are ahead of schedule relative to our initial expectations. From a growth perspective, we believe we are well-positioned to deliver on our targets based on our strong well performance and continued operational efficiencies to-date. From a free cash flow and deleveraging perspective, we have made significant progress in Q1 and are raising our free cash flow target by $150 million, from greater than $400 million, to now greater than $550 million at today's strip. Third, with our revolver fully repaid, meaningful free cash flow in the balance sheet, and leverage nearing our target levels, we look forward to commencing our Share Repurchase program in the near-term. All-in-all, Q1 was a very strong quarter, and I'm excited for our continued financial and operational execution of our 2022 game plan. Turning to our financial and operating results on Slide 12 of the earnings presentation, overall Q1 results were in line with our expectations. As we had previewed during our Q4 earnings call back in February, Q1 production levels declined quarter-over-quarter due to the shift to larger development packages in addition to the carryover of DUCs from Q4. As a result, net oil production for the first quarter was approximately 32,750 barrels per day, while average net equivalent production totaled approximately 61,400 barrels per day. Oil as a percentage of total production declined to 53% from 55% in Q4, due in part to the completion of six wells in the high GOR area of our Reeves County acreage, several of which were the highest rate of return wells in the quarter. Despite lower production levels compared to Q4, total revenues increased by 10% quarter-over-quarter to almost 350 million as a result of higher oil and NGL prices. GP&T was slightly above expectations mainly because of higher than anticipated natural gas and NGL prices, which increased the expense associated with our percent of proceeds contracts. As I mentioned on the last earnings call, Q1 is expected to be our lowest production quarter this year. While Matt will touch on this further, it is important to note that as a result of efficiencies, we completed six more wells during the quarter than anticipated, but still posted CapEx in line with our original expectations. This acceleration of well completions into Q1 coupled with over half of our Q1 wells being brought online during the last month of the quarter, set Centennial up for significant quarter-over-quarter production growth and strong free cash flow in Q2. Total net debt decreased by 8% from year-end to approximately $765 million at March 31st, and net debt to LTM EBITDAX declined to 1.1 times compared to 1.4 times at year-end. Additionally, we had approximately $51 million of cash-on-hand which we expect will build over time. Finally, with our first note maturities scheduled for early 2026, Centennial has significant financial flexibility going forward. First, we have the free cash flow profile and balance sheet to return a significant amount of capital to our shareholders. In fact, our $350 million program represents approximately 15% of our market capitalization. Second, we expect the Share Repurchase program to be accretive to our long-term shareholders as it delivers higher per share ownership of production and cash flow as the plan is executed over time. Our strategy will allow for both regularly timed buybacks, as well as opportunistic repurchases during periods of market dislocation. With March 31st leverage at 1.1 times and strong anticipated free cash flow in Q1, we look forward to beginning to repurchase shares in the near term. Q1 was an outstanding quarter with the operations group, as we continue to build upon the significant operational efficiencies gained last year with incremental improvements to completion cycle times. Staying on this topic, on Slide 6, as we first mentioned during our Q3 call last year, our operations team began testing a new completions design which utilizes less fluid, resulting in shorten pump times and additional cost savings. As you can see on the slide, we've driven a step change in our completion cycle times, increasing both stages per day and lateral feet completed per day by 17% and 32% respectively, when compared to Q1 2021. Most importantly, since we began pumping this new design late last year, we've seen strong initial production results, as essentially every well utilizing this design has been at or above our original expectations. As George alluded to, these completions efficiencies were the primary driver of us completing six additional wells during the quarter, and places Centennial on a strong footing for the start of the year. On the drilling front, our team continues to carry over the efficiency gains from last year, which has been driven by larger pad developments and reduced mobilization times. Additionally, we recently drilled our longest lateral in the company history, the Challenger AC 32H, which reached total depth in just under 16 days for a 2.5 mile lateral, or approximately 24,000 feet of total debt. For reference, our previous data point for a 2.5 mile lateral in reach county was the Dot Gardner AU 23H, which drilled to a total depth of approximately 23 thousand feet in 44 days back in 2018. Shifting to the bottom right-hand side of Slide 6, we began implementing centralized tank batteries in our development program during 2018, and continue to increase the percentage of our development program utilizing this new facility design. Once built, these centralized tank batteries are easily expandable to accommodate additional nearby wells and can do so at significantly lower costs than new build facilities. For 2022, we expect that roughly 60% of our new wells will flow into existing expandable facilities. Finally, we will be evaluating the potential to retire some of our legacy facilities over time and flow those wells into nearby newer facilities with expandable capabilities. The team's continued focus on innovation and efficiency will be particularly critical as we look to help offset some of the inflationary pressures, we continue to see in 2022. In Reeves County, Texas, the powder doughnut wells came online in our Miramar block, which as many of you know, is the higher GOR portion of our Texas asset. This four well, development consisted of laterals in the third Bone Spring sand, Wolfcamp A and Wolfcamp C, with average lateral lengths of almost 10,000 feet. The pad delivered an average IP30 of over 2400 BOE per day per well, with a 42% oil cut, or approximately 1,000 barrels of oil per day per well. Furthermore, the powder doughnut wells represent another solid infill results from the third Bone Spring and Wolfcamp C. Further bolstering our confidence in our remaining inventory across the Texas acreage position. In New Mexico, we completed two separate six-well developments during the quarter, both targeting the second Bone Spring sand interval. In the central portion of our Lee County position, the Chimichanga and Caso Blanca wells were drilled as a six-well development with approximately 8,400 foot average lateral lengths. These wells generated robust results, averaging IP30 of over 2100 boe per day, or approximately 1,800 barrels a day of oil. Further south in the New Mexico acreage position, the Pac-Man and Donkey Kong wells represent another six well development. Like the Chimichanga and the CAISO package, production numbers were strong, posting IP30 numbers of approximately 1750 BOE per day, or over 1400 barrels a day of oil. Overall, our team did a tremendous job during the first quarter and brought online some outstanding wells. More specifically, we estimate that all our wells brought online during the quarter will achieve payout in approximately four months assuming the current strip prices. Lastly, I'd like to finish up reviewing our outlook for natural gas takeaway in house Centennial plans to navigate the potential headwinds. Depending on future Permian production growth, we do believe that natural gas aggress out of the basin could become tight in future periods until a new pipeline is built. As such, we have been evaluating and are close to executing multiple term sales contracts, which would provide transportation for essentially all our expected gross revenue residue gas in the near term out of the Permian Basin during these expected periods of tightness. Given where we are in these discussions, we feel very good about our ability to execute on these agreements over the next few months and look forward to discussing in more detail on future calls. While we continue to focus on driving further efficiencies, in an effort to partially offset inflation, we are also very mindful to avoid any material delays or lost time to our operations. In light of the current oilfield supply chain challenges, our team has been very focused on sourcing the necessary equipment well in advance of the anticipated schedule. Year-to-date, we have not experienced delays or procurement issues primarily due to our team's efforts on both the planning and execution fronts. Overall, this is a strong start to the year from our operations team and we look forward to building upon this performance going forward. In closing, we are very pleased with our execution in the first quarter and excited about the go-forward game plan for Centennial. These factors will allow Centennial to embark on the next chapter of our company with a focus on shareholder returns, which we expect to commence in the near-term and have a has us well-positioned to succeed for the remainder of 2022 and beyond. Your line is open. First, just wanted to compare the two lead developments you brought on this quarter. Both seemed like really strong results, both six-well developments, one kind of in that staggered pattern. I'm curious how you think about the comparative economics and performance versus your expectations, and each of those developments given their kind of relative same zip code. And we have been very pleased with both stack stagger programs that we've been working in the upper end, lower second Bone Spring sand. In past years where we were doing one or two wells, or maybe smaller groupings, a higher percentage of our new wells brought online were subject to some of the depletion effects that we saw from prior producers. Relative to our internal expectations, these wells are performing right on par with what we expected them to and the costs coming in right where we needed to come in relative to these expectations\n Thanks for that. But with our vendors, in our lead times that we put out there, we've just not been able to -- we've not had any those kind of delays relative to our operations, and we're very proud of that working relationship with our vendors and our folks in the field with the long-term planning. Your line is open. We haven't seen any delays or issues with procurement because of our advanced planning and our current 2 rig program, it does provide significant growth on a year-over-year basis, differentiated from most of our peers. So as we think about growing the business, we're going to do so within our own current operations and don't have a necessary and need to add a third rig to provide additional growth. But again, I'll reemphasize that our two-rig program to-date provides the growth that others may need to add a rig to accomplish, so pleased with what we have in our plan going forward. As we think about commodity prices in the flexibility of what's going on relative to the macro situation out there, whether it's China or Russia, or OPEC, there's a lot of factors that come into play. What we are going to focus on is growing our business, our production, as it stands right now at tend to 15% year-over-year so that's where we're focused on. That's we're going to execute and look forward to giving further 2023 guidance in coming quarters, if you will. I think -- It's a good question, particularly as we look at our cash flow. As you heard probably in my prepared remarks, we are increasing our free cash flow this year up from an estimated $400 million to greater than $550 million. So your point is valid as we think about that, but I will say that we are -- we've yet to begin the execution of that share buyback program. And as we get towards the point where we are exhausting that share repurchase program, I do think there's additional opportunity to be incremental to that down the road. Your line is open. I think that, first of all, it's a compliment to our operations team that we have been ahead of schedule. I would say significantly ahead of schedule bringing on six more wells to this quarter than originally anticipated, and that's really an operational efficiency improvement. And should that continue throughout the rest of the year, I think it will be towards the high side of our estimated completed wells for the year, which then of course translate likely to a towards the high-end of our capital budget. That being said, at this point, we're not moving our ranges, our guidance for capital I do think that there's an opportunity there to have flexibility at the end of the year, whether that is pushing completions in the next year, some of that will depend on commodity prices right now. But again with the efficiencies we've driven out of field, we've got some real options down the road as to how many wells we're going to complete. We a -- we're very specific, I guess, in what we provided last quarter on leverage targets and whatnot before executing. As you probably heard and saw from the release, our quarter ended at 1.1 times and we had been very specific of reaching a leverage target of less than one times before initiating our share buyback program. Your line is open. The other thing we try to do, as I said in an earlier Q&A question is, we try to order our steel far enough in advance for tubulars and things like that, that we can accommodate the delays in terms of the production timing for steel costs. And at this time, based on what we can see, we don't anticipate seeing additional inflation relative to our steel pricing for the remainder of the year just by virtue of what we've been able to work through so far. For my follow up with the understanding that you have 15 years of quality inventory, I was highlighted by some strong wells this quarter. I would say that we had very high standards because of that 15 year inventory, we're not out to fill a void from an inventory perspective, we are looking for opportunities that are accretive across a number of fronts. Your line is open. Just one last question, you-all said  GAAP tax rate this quarter, I think it was around 30%. What I'd say with respect to the rate you saw this quarter, that was a one-time true-up related to a state apportionment rate, which gets a little bit complicated. I think from a tax standpoint overall, the first thing I'd say, it's fairly remarkable that we're discussing cash taxes so broadly within the industry, that's my first observation. And if you dig through our 10-K, you'll note that it's approximately 500 million at year-end 2021. As we look at the current business plan, activity levels, commodity environment, we believe we're a couple of years away from fully utilizing those NOL's and being a federal cash taxpayer. So to summarize, we're in a relatively -- relatively well-positioned, not to have any material cash tax liabilities in the near term. So just to clarify, to make sure I'm thinking about it correctly, took you on where it's that book tax rate probably going to be closer to peers around 20% to 25%. We have a bulletproof balance sheet, meaningful production growth, significant and sustainable free cash flow and a robust shareholder return program that's been board approved."
}