{
    "symbol": "BP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 12:05:04",
    "content": " Second, we plan to invest up to $8 billion more this decade, on average, about $1 billion more each year in today's energy system, which depends on oil and gas. With the plan we're announcing today, we now expect to deliver around $3 billion more EBITDA in 2025, rising to a name of $5 billion to $6 billion more in 2030. We expect our additional investment in transition growth engines to contribute around $1 billion in EBITDA in 2025, and we aim for around $2 billion in 2030. We expect our additional oil and gas investment to contribute around $2 billion additional EBITDA in 2025, and we aim for around $3 billion to $4 billion in 2030. We expect this investment to accelerate earnings growth from our transition growth engines, increasing EBITDA to $3 billion to $4 billion in 2025, and $10 billion to $12 billion in 2030, up from greater than $10 billion that we announced previously. In Bioenergy, we are deepening our investment and now expect to deliver around $2 billion EBITDA in 2025 and aim to deliver more than $4 billion in 2030. Having grown production in 2022, we plan to grow underlying production to 2025, adding around 200,000 barrels per day of oil equivalent of high-margin production from 9 major project start-ups by continuing to manage base decline to between 3% and 5%, by increasing BPX production by 30% to 40% and retaining some assets for longer than previously planned. We also remain focused on high-grading our portfolio and aim to divest around 200,000 barrels a day of oil equivalent of lower-margin assets by 2030, less than previously assumed given the strong progress we have made improving operational reliability and commerciality across our portfolio over the past few years. And to maximize value, we intend to maintain investment discipline with hurdle rates of 15% to 20% at $60 per barrel, maintain a balanced portfolio with a broadly equal mix across oil and gas, drive capital productivity through strong execution capability across our subsurface wells and projects organization and sustained cost efficiency and reliability improvements in our operations. We expect to invest more than 40% or $6 billion to $8 billion of our capital expenditure in transition growth engines in 2025, up from 3% in 2019 and around 50% in 2030, or about $7 billion to $9 billion. And we're focusing our capital expenditure in hydrogen and renewables power, planning to reallocate around $10 billion across the decade towards Bioenergy and Convenience and EV Charging. In our transition growth engines by 2025, we expect an 80% increase in our biofuel volumes, around a 30,000 barrel oil equivalent per day increase in biogas supply, a 25% increase in the number of strategic Convenience sites and around a doubling of EV charge points. In oil and gas, by 2025, we expect an incremental 200,000 barrels per day of high-margin production, an increase of 30% to 40% in production from BPX Energy and more than a 30% increase in LNG supply to around 25 million tonnes per annum from Coral, Venture, Mauritania, Senegal, Tango and the return of Freeport. We have increased our ROCE target and now expect to achieve over 18%, both in 2025 and 2030 and at $70 per barrel 2021 real; third, debt reduction through our intention to allocate a proportion of surplus cash flow to strengthening our balance sheet; and fourth, compelling shareholder distributions through our resilient and growing dividend and with leverage to higher prices through our share buyback commitment. And then finally, I would say commerciality, if you look at what we've done, say, in Azul Energy, we brought together 2 very mature sets of assets with our friends in D&I brought them together into a company now called Azul that's doing over 200,000 barrels per day has 3 major projects coming towards it has a huge growth potential actually. And looking forward, we'll be guided by the price range that's out there in the market each year as we think about that 14 to 18 range if prices fall back to the $40 level, we'll obviously be at the lower end of the range as prices remain high, we'll have the flexibility to stay at the upper end of the range."
}