{
    "symbol": "TFFP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 20:42:10",
    "content": "  Operator: Good day, and welcome to the TFF Pharmaceuticals, Inc. First Quarter 2020 Earnings Conference Call. Hello, everyone, and welcome to TFF Pharmaceuticals First Quarter Financial and Business Results Conference Call. With me on the line today is Glenn Mattes, President and CEO of TFF; Kirk Coleman, Chief Financial Officer; Dr. Dale Christensen, TFF's Director of Clinical Development; Dr. Bill Williams of the University of Texas at Austin; and Chris Cano, TFF's Chief Operating Officer. Factors that could cause actual results to differ are described in the disclaimer and in our filings with the U.S. Securities and Exchange Commission, including the Risk Factors section of our 2022 quarterly report on Form 10-Q filed with the SEC. Good afternoon, and thank you for joining us today to review the company's first quarter operations and recent highlights. During this call, I will provide an update on our overall progress then ask our Chief Financial Officer, Kirk Coleman, to review our first quarter financials. Having announced our fourth quarter and year-end 2021 results, just a few weeks ago, we decided to provide a more focused formal commentary of our meaningful progress for this call. This will leave more time for Q&A, and please note that Chris Cano, Dale Christensen and Dr. Bill Williams are present on today's call and will participate in that session. And this momentum carries over from our very successful fourth quarter, which saw numerous accomplishments, including the final data from the Phase Ib study of inhaled voriconazole powder in asthma patients and the initiation of our Phase II studies for both inhaled tacrolimus and voriconazole powders. In addition, we began the Phase I inhaled niclosamide powder study in Canada to treat COVID-19. In general, this patient was considering only palliative care for his disease and now has reported outstanding efficacy and safety. After completing enrollment in the 40-patient Phase I study earlier in the quarter, in April, we announced positive safety and pharmacokinetic data showing that niclosamide inhalation powder was well tolerated with no serious adverse events across all subject cohorts. Importantly, the study also helped us identify what will be the optimal dosing level for the product in the Phase II program. At the 6-milligram dose level, niclosamide inhalation powder is estimated to produce a concentration of 10 micromolar and the epithelial lining fluid in the lung, howling delivery as a dry powder, which would be considered highly potent with respect to inhibiting viral replication. Furthermore, the study's Safety Management Committee also expressed no questions or concerns about the safety and recommended the 6-milligram BID dosing as safe for progression into Phase II testing. Further highlighting the product's potency, in February, we announced the results from recently completed in vitro and viral replication assays, which shows the niclosamide inhalation powder completely inhibited viral replication of both the Delta and Omicron variants of SARS-CoV-2. In our view, the high potency of inhaled niclosamide powder suggests that the product may have major advantages over oral delivery, including improved safety and tolerability. New and disruptive technologies are often supported by a steady stream of basic research and development which over time leads to a significant body of scientific literature, and this is clearly the case with Thin Film Freezing. At this year's RDD meeting, Dr. Bill Williams and his colleagues at the University of Texas at Austin presented 5 separate papers highlighting the versatility of Thin Film Freezing technology. These data also support the differentiation of Thin Film Freezing from other methods to create dry powder, particularly in biologics. In fact, one of the papers, which explores the use of machine learning algorithms to analyze how Thin Film Freezing impacts aerosol delivery of dry powder therapies. The client base of over 1,000 companies, we are confident in the short-, mid- and long-term productivity from this relationship. In particular, Catalent will introduce Thin Film Freezing to a targeted list of potential licensing candidate. I'm happy to report that TFF and Catalent have been working very well together to successfully launch the partnering effort, and I look forward to reporting multiple successes as we work together. During the quarter, we were also pleased to announce a second cooperative research and development agreement with the United States Army Medical Research Institute of Infectious Diseases and the Geneva Foundation. We consider our partnering activity in the government, defense and other public related sectors as a core area of focus for our business. And as applications of Thin Film Freezing continue to expand, we anticipate that our public sector collaborations could provide a significant source of non-dilutive funding over time. Speaking of non-dilutive funding, TFF continues to work to capitalize on the language in the omnibus budget legislation, which highlighted the opportunities created by Thin Film Freezing. Now looking at progress on other existing collaborations, TFF is continuing to work with PLUS Products who recently announced the transaction with Glass House. As this partnership is freshly minted, we are in discussions on a path forward on the TFF inhalation cannabinoid products that have been successfully tested with consumers. And finally, we are working with our development partners at Augmenta to identify next steps for Augmenta 3387, which has been identified as a highly potent monoclonal antibody to treat COVID-19 in preclinical animal models. In general, based on the robust pace of our ongoing partnership work and discussions, we remain highly confident that 2022 will see TFF Pharmaceuticals enter into meaningful monetized new collaborations while expanding many of our existing partnerships. The first quarter also saw TFF Pharmaceuticals, bringing a wealth of new and diverse talent in the form of senior level and Board of Director appointments. As the number of collaborations grow in our internal clinical programs advance, an appropriate level of investment is required to optimize such growth. We believe these additions will lead to the expansion of existing collaborations, the forging of new and more strategic partnerships and the advancement of multiple programs into late-stage testing, all of which will generate significant value for our shareholders. And with that update, I will turn the call over to our Chief Financial Officer, Kirk Coleman, for a review of the financials. For the 3 months ended March 31, 2022, research and development expenses for the company were $5.3 million compared to $5.3 million for the same period in 2021. General and administrative expenses for the 3 months ended March 31, 2022 for the company were $3.2 million compared to $2.6 million for the same period in 2021. The company reported a net loss for the 3 months ended March 31, 2022 of $8.4 million compared to a net loss of $7.7 million for the same period in 2021. Weighted average common shares outstanding basic and diluted for the 3 months ended March 31, 2022, were 25,371,781 compared with 23,140,607 for the same period in 2021. As of March 31, 2022, we had total assets of approximately $33.8 million and working capital of approximately $29.3 million. At the end of the first quarter, our liquidity included approximately $26.4 million of cash and cash equivalents. And with that, I'd like to turn the call back over to Glenn. Since our last call only a few weeks ago, market conditions have clearly not improved. The work we are doing at TFF Pharmaceuticals to address this significant demand places our company in a unique and, in my view, quite enviable position. From the research being conducted at the university benchtop all the way through to the progress we are demonstrating in the clinic and through our partnerships, the value being created by our Thin Film Freezing technology continues to set new high watermarks quarter after quarter. Without question, we believe our technology represents a true breakthrough in formulation technology and one that the industry has been seeking for decades. As investors attempt to reconcile the latest short-term market conditions against TFF demonstrable progress, we can only provide our shareholders with the assurances that our company will continue to work diligently to maximize value across every facet of our business. This quarter, we did exactly that by signing a strategic collaboration agreement with Catalent, entering our second CRADA agreement with USAMRIID and announcing positive data from yet another clinical stage pipeline asset with inhaled niclosamide powder. And with that, I will turn the call back to the operator and open it up to questions. And to all of you that are asking questions, I will either answer the question or ask 1 of the members of the TFF team to respond to this question. And actually, it's really appropriate because Dale has been the one that's been really working these programs personally, I would . In the immediate aftermath, the patient has now been outpatient, taking the inhaled voriconazole for 11 weeks. And in the 11 weeks, he's lost less than 3%. In addition to that, one of the things that we speak about with as the positive benefits of the inhaled voriconazole is minimization of drug-drug interactions. This patient has not had to have a dose adjustment to his tacrolimus, which would have had -- if you had taken the oral voriconazole, there would have been major dose adjustments required to achieve levels because of those drug interactions. So all in all, the results from this one patient are exactly why I went into this business to improve people's lives because this person has truly benefited from this therapy. So I think let me just add from a business perspective and Dale, I'd probably give you a minute or 2 to think about your response. So as you know, Jonathan, and I think most of you who know the company, with our data that we will glean from the Phase II trials leading up to probably the latter part of the third quarter, we think that will certainly be based upon the Phase Is and based upon what we're seeing from the Phase Ib and now albeit 1 compassionate use patient and hopefully more. We think that, that will be the final piece of the puzzle to attract interested companies to bid on licensing the product. So certainly, from a business and revenue standpoint, this is a big piece of how we look at our capitalization. Now from a clinical perspective, I believe -- I've always believed that the probability of technical and regulatory success here was extremely high. So just as -- to take one step back, we selected the voriconazole, the TAC and the niclosamide for the internal development programs because each of them is a validated drug best-in-class. In the case of tacrolimus, it's already used for 90% of lung transplant patients, but the problem is significant toxicity when delivered by oral because you have to put up -- push up the levels to get enough into the lung to be effective. In order to get enough into the lung where it can be effective, that comes along with systemic toxicities. And so in each of these cases, the premise has been can deliver the drug effectively to the lung, reduce the toxicity and avoid drug-drug interactions by direct topical delivery to the lung. As I just mentioned, the patient that is on tacrolimus and went on inhaled voriconazole saw no need for dose adjustments, which -- that is one of the key premises of this that it will be easier for the patients and the physicians to use because there will be limited drug-drug interactions. And we fully expect, and I think we're seeing that the drugs can reach efficacious concentrations. And so in all cases, the programs, as we've advanced, they're performing exactly as expected. And some of the results are -- it's hard to say better than we expected because we have high hopes, but they're performing very well. So as you know, Jonathan, we finished the Phase I trial. But in essence, they do have, we believe, enough information to begin their diligence. In fact, we did get a list of diligence questions from them this morning. So I would say, certainly, their option deliberation period has commenced. And if they exercise that option, they will have the -- they will take over the development of niclosamide. And you said has commenced, it sounded a bit formal, so they have a formal time by which they have to say, yes. I mean as you go by the letter of the agreement, I think practically, it's commenced. I mean there is a -- by the letter of the agreement, we have to have complete all the case report forms, but I believe they've had enough information that actually the option period. But they are -- in my feeling and the company's feeling, the option period has begun. And good luck with partnerships that results in some upfront non-dilutive cash, hopefully sooner than later. Just about the general market conditions, I'm wondering if you've noticed that progressing your deals has been impacted at all by this. Daniel, we have not noticed and obviously, we can't, but notice what's happening in the marketplace. Look, so many of the partnerships and with that, I mean the open MTAs and statements of work have been going off for some time with those companies that we believe are close to transacting. If anything, I would say some of the smaller companies. And there aren't many in the splits for us, where they're obviously now more acutely concerned about cash. I think that it does come up, but it also hasn't slowed down the pace of any of the work we're doing, hasn't slowed down any of the pace of the negotiations. Thanks, Glenn, and thanks, Daniel for the question. I was going to say with the timing on the VORI and TAC, Dan. So right now, right, we're in the preparation process. So right now, we're doing -- from a process standpoint, we've done all of our work. That data room is -- currently, we do have potential partners in the data room performing diligence right now. Yes, we'll take that and practical. I think -- I don't know how many -- we're trying to get away for the numbers, but the last couple of weeks, we've opened up a handful of new -- just in the last couple of weeks, new MTAs. And as I think about it, they're like mid-tier. So the pursuit of the technology as an opportunity to reformulate or do formulation, it doesn't seem to be diminishing at all. And then just in other words, most of our work is on NCEs, it's not on reformulation. So that also, I think, makes us a little bit more bulletproof. And look, I'm sorry to do this, I can't help but also say, look, you have to think of TFF as a platform technology company. Our platform technology is going -- has value, and we'll bring in revenue. And look, I get it, but I just couldn't help us saying it. I'm just trying to if you could help me understand the significance of the data that he presented at that conference that, that would be great. Thanks, Dan, and hello to everyone. So the data at the RDD meeting, we had 5 presentations, and we were able to present on different applications of tacrolimus, voriconazole, some of our new work on biologics, the plasma DNA work. And in fact, I was in several other presentations during the time. And then Glenn, one last question for me, just kind of related to the Union and niclosamide. But to validate that, we are doing an extensive deep dive strategically into what those viral infections are that would pose the most opportunity. We went into the exercise thinking perhaps RSV and VSV, but we're also broadening that horizon. We're looking at the IP issues, if there are any around what we would have. So to sort of validate the scientific and clinical hypothesis, we're also doing a deep strategic dive to understand what's our best path forward. We'll have those data in the next 2 to 4 weeks to go along with Dale's working up what clinical trials might look like, costs for that. So we have a good understanding of not only important clinical significance might be, but what the business opportunity might be. Well, right now, Union would have the options first for that. So there is published information out there that has existed for a while, showing that niclosamide is broadly active agent against all coronaviruses with activity against the MERS coronavirus that came out in the Middle East area as well as the original SARS coronavirus that emerged in the 2004 to 2007 time frame. And so we think that there's a high degree of ultimately, the vision would be that a patient experiences a severe upper respiratory infection that could be viral. They call their doctor, and they get this. Dale, we just -- we decided to disclose those, but you would know it's just -- if we have, you . Essentially, what we're -- both of the studies are open-label studies. As you can imagine, when you're doing a comparator between an oral and an inhaled therapy, and especially when the oral therapy can require dose adjustment to hit a target blood level, it is really difficult to think about how you blind that. So we are using completely objective endpoints, things like overall survival dose requirements for dose adjustment discontinuation due to going on to salvage therapies as well as things like in the case of voriconazole, chest CT scans and looking at the cultures to see if we're clearing the lungs of the fungus. And so all very clear objective endpoints, and therefore, we can do open label because the more objective your endpoints are, the more accepted in open label type trial is because you don't have that kind of judgment involved in determining an endpoint. The -- we'll also be looking at, as mentioned before, drug-drug interactions because many of the patients in this study are going to be on tacrolimus or other chemotherapy drugs that are interacting with CYP3A and therefore, would require drug-drug interaction monitoring. And so it will be the proportion of patients that had to have their other concomitant medications adjusted due to the introduction of the voriconazole and overall safety and then overall kind of stabilization from a clinical perspective, how many achieved essentially clearance of the fungus from the lung, how many achieved reduction in chest CT scan infiltrates. In the TAC trial, again, it's open label, and it's all one armed because these are -- the patients that are going into this study are all receiving oral tacrolimus but are experiencing significant kidney toxicity to the point that their physicians are contemplating either drug holidays or significantly reduced doses of voriconazole to try and spare the kidneys. So we will be looking at the stabilization of kidney function, can we see that we either stabilize, stop the increases in creatinine or reduction in GFR. And then from the efficacy standpoint, we are looking at several different markers using different biomarker techniques from endobronchial biopsies that can tell us if there's signs of acute rejection going on in the lung. And the next question will be from Anthony Pogesma , a private investor. I was wondering if you could give us the status on the Augmenta program and then followed up with any updates you could give on the UGA, ACOM and UPenn. And as you know, we have been really enjoying our work with Augmenta, very unique and innovative company. And this is a common theme, as you know, in what monoclonal antibodies have become in the overall armamentarium to treat COVID. We have a number of, I think, very creative ideas in terms of how to continue to develop Augmenta 3387. Because I think they're very unique, and we don't want to tip what we've come up with to the rest of the marketplace. Dale, I don't know if you want to add anything to that, but we still believe in Augmenta, we still believe in the compound. Dale, I don't know if you want to add to that or not. As Glenn pointed out, part of our commitment is to monitor ongoing and emerging variants as they occur and looking at the activity. So as we proceed, we are testing against various emerging variants and ensuring that it works. And as you've seen with the Omicron variant, there's been and especially with VA2 now, every commercial antibody that's already been given EUA either had the EUA removed or revoked. It was on if you could give any updates on what you're doing with UGA, UPenn along those lines. So on our academic collaborations, you had mentioned UGA, Albert Einstein and UPenn. So we're working with Dr. Kartik Chandran at Albert Einstein, right? For UPenn, our collaboration with Dr. Drew Weissman, we've completed our initial mRNA formulation work. We finalized our protocols for animal testing, and we're preparing to deliver our TFF dry powder samples to Dr. Weissman so that they can commence these animal studies in the very near future. But you did just announce another major commercial partner which is Aptar, which -- if people don't know them, they're on the New York Stock Exchange. And even on this market conditions, they're $6.8 billion major corporation. First of all, thank you, Richard, for noticing that. We did put out a new corporate presentation and I guess, Richard doing his diligence notice that I went out on a commensurate with the press release. So we're running some initial experiments and if these initial experiments proved successful, we believe that our TFF dry powder brings unique attributes, right, for nasal administration. So depending on the compound and the disease states, this could be very advantageous for both patients and prescribers. And at TFF, we're fielding very similar inquiries from our partners, can you deliver intranasally. So again, as I mentioned, it really depends on the compound and the disease state where dry powder intranasal spray could be very advantageous for delivery of vaccines and therapeutics. We, as a team, have the opportunity to visit just a couple of weeks ago, their site in Boston, which is an inhalation site and they're doing nasal work as well. Glenn, to be very candid, the elephant in the room is your balance sheet and what 3/4 of cash. And so far, there's no progress in terms of any incoming revenue. The rest of what you're doing is fabulous, but the fact of the matter is, okay, there are companies that's got about $8 million a quarter in expenses. Well, Ted, just to correct you, we capitalized through to the mid part of next year, almost through August. Glenn, I got a question regarding your open MTAs. I'm going to put my friend, Chris Cano on a spot here, that he knows, but he may not know of . So if I take a look at all of our ongoing collaborations, right, in our different MTAs, we have a tremendous focus on biologics. So we're -- of all of our different NTAs, over 87% of them are really focused on biologics. And as Glenn had mentioned earlier, all of these biologics are NCEs, right, to our partner or to the originator of the technology. Well, of that 65% of these projects are oral inhalation, right, as the primary route of administration of our dry powder versus 30% of our projects, which are more of a stable dry powder for reconstitution and injection as the route of administration. Based on demand, we're now looking at intranasal delivery of our dry powder. So hopefully, that addresses your question, Leo, and gives you a little context of where our focus is and where our MTAs are. You did mention in your presentation that you had interacted with Glass House, which has finally purchased PLUS Products. Obviously, your business plan has monetization of TAC, VORI, niclosamide, the cannabis products, government programs themselves evolve into higher and higher levels of product development and thus inventory purchase, those alone would be enough to start a separate company. So I just wanted to throw that in as Ted's comments seem to be out of line with the reality of what you've done, putting all of these products into final stage over the last year or 2. Thanks for the comment, Richard, and other opportunities, clearly. Specifically, we have what we believe, first and foremost, Richard, our go-to-market assets, our formulations. And I have to really -- again, I said this call after call, PLUS has been a remarkable partner to us in helping us develop these go-to-market assets. The feedback I have from the PLUS management is that Glass House is interested, certainly. But we have -- in all this time, we have contingencies in place to get our compounds to the marketplace as quickly as possible. And as I said, we will hopefully, do this through Glass House. And our goal is to get the first commercial sale as quickly as possible, realizing look at the PLUS situation didn't help with timing, but we use that timing productively. Just want to -- before concluding, I wanted to -- I personally want to use the answer I gave on the Union. And if anything, the niclosamide opportunity, it's gotten much larger than we first engaged with Union or first started doing the work with Union. Everything that you have seen and believe in TFF is there, but I think even bigger than perhaps you may realize will come out of this period of market darkness. As you know, I make myself quite available to you. So if you have any questions at any time, you can contact me or Corey, and we'll answer your questions."
}