{
    "symbol": "ORTX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 12:55:29",
    "content": " Hello, everyone, and welcome to Orchard Therapeutics First Quarter 2022 Financial Results and Corporate Update Webcast. Braden Parker, our Chief Commercial Officer, is joining us to highlight the success we've recently had expanding commercial access for Libmeldy. In March, we spoke about our decision to strategically prioritize the focus of our platform to synergistic indications where we believe HSC gene therapy is scientifically and clinically differentiated from where it can deliver the most value. Through the insights we've gained for many years of scientific and clinical development in this field, we believe indication selection in our space is paramount, and this is what is driving our strategic approach and decision-making. Firstly, we want to focus where the HSC approach has differentiated itself scientifically and clinically, that is in neurodegenerative conditions like MLD, where the migration of gene-modified HSCs into the CNS is key to delivering the gene where it is needed. With Vamed, we have seen how focusing in this area can lead to clinical benefit, regulatory approval and increasingly commercial success. Throughout the start of 2022, Orchard has built sustained commercial momentum for Libmeldy as the first HSC gene therapy with meaningful reimbursement coverage in Europe. We are extremely pleased by the recognition of Libmeldy value commensurate with its clinical impact, which is reflected in the published net price of EUR 2.4 million attained in Germany and which is indicative of our agreements throughout the region. We're encouraged by the continued progress we're making to identify, refer and treat eligible patients with this therapy. In addition, we believe that a further focus on neurometabolic diseases such as MPS disorders, will offer a synergistic approach and enables us to leverage a common infrastructure from manufacturing and CMC to distribution, supply chain and our commercial network as well as regulatory capabilities. As we develop these further and as the preclinical data matures, we believe these programs provide opportunities for significant value creation, either on our own or through potential partners with an interest in our platform or indications. At the upcoming ASGCT meeting, data from our neurodegenerative programs will be presented that continue to demonstrate the unique ability of our approach to enable broad distribution of gene-corrected cells and localized delivery of therapeutic enzymes and proteins in the brain. Future presentations include updated results on the OTL-203 clinical program for MPS I Hurler as well as preclinical work to advance the platform's applicability to address other neurodegenerative and CNS-related conditions, including the pro granular form of FTD. Since Libmeldy approval and launch, we have been building out multiple facets of our commercial infrastructure to identify and treat as many eligible MLD patients as possible. By design, this foundation can also support our next wave of neurodegenerative programs in the MPS space. Since the launch, we've prioritized the activities and initiatives we believe will generate the most value for Libmeldy patients and providers. On the access and reimbursement front, we've seen our positive engagement with health technology assessment bodies and payers throughout the region, yield agreements securing reimbursement for all eligible MLD children. After announcing an agreement with NHS England in February, Italy and Germany became the second and third major European markets to recognize the value of Libmeldy commensurate with its clinical impact. These agreements come after Libmeldy received the highest possible therapeutic benefit rating in presymptomatic patients by the German Federal Joint Commission, which only 4 other medicines have ever received, and the Italian Medicines Agency recognized the significant potential clinical benefit Libmeldy offers by granting innovative status. We have plans to enlarge our network of treatment centers in a similar fashion by qualifying centers to administer Lenel in Sweden and Spain, in addition to our existing centers in the U.K., Netherlands, Germany, Italy and France. Over time, this same network of centers would be utilized to support future potential launches in similar indications. And in order to help ensure we are identifying as many eligible patients as possible, we are continuing to increase our support for newborn screening to drive early diagnosis. We now have 7 studies ongoing in Europe and 1 in the U.S., which are intended to generate data to support the adoption of regular screening at the state, national and regional levels. As we've mentioned previously, our partner, Genpharm in the Middle East, has already identified a patient who received Libmeldy through reimbursed international treatment abroad at our qualified treatment center in Milan, Italy. In the U.S., we believe we have all the data needed to move forward with a submission for OTL-200, and the team is working with our clinical site and CDMO partner to prepare the package. We are planning to have a pre-BLA meeting with the FDA in the second half of this year in advance of the file, which we expect to submit in late 2022 to early 2023. The key reason we are emphasizing our focus on our neurometodic portfolio, and in particular, our next-in-line NPS programs is because our experience with MLD provides validation that we can translate to potentially transformative clinical outcomes into regulatory and commercial success. Moreover, the infrastructure we are building to support the Libmeldy launch is synergistic and directly applicable to OTL-203 in MPS I Hurler as well as our earlier-stage program for the treatment of MPS IIIA OTL-201. We the areas of clinical, regulatory, manufacturing, distribution, patient identification referral and treatment can all be utilized for potential future neurometabolic launches. We have been developing a protocol for a global MPS-I registrational study with feedback from last year's parallel scientific advice for and are focused on the importance of being able to show a meaningful difference from current standard of care, not only for regulators but ultimately for payers commercially. The regulators have been highly engaged, and we think that speaks to the opportunity we have with HSC gene therapy in this condition. As part of our ongoing interactions with regulators, we have received additional and more specific feedback related to study design and endpoints that will likely delay initiation to 2023. We while the time lines have moved into 2023, we believe the alignment we are gaining with regulators will support a stronger application in the U.S. and in the EU. Recall from our prior communications that we treated and therefore, recognized revenue from 2 commercial patients in the first quarter. Importantly, the cash flow from these patients will be paid upfront rather than over multiple years. Revenue from product sales of Libmeldy was $5.1 million for the 3 months ended March 31, 2022. However, with a net sales figure of about 2.5 million per patient, you'll note that it's similar to the final negotiated and published price in Germany. Cost of product sales were $1.6 million for the period, and it's worth spending a few minutes here is there are 3 primary items that make up COGS for Libmeldy. On the first item, the cost of manufacturing does not currently include the cost of the lentiviral vector that was used in these first patients since those vector batches were produced and expensed prior to Libmeldy approval. The royalties to third parties total about 20% of net sales in the current quarter, and that's a reasonable assumption to use going forward. Beyond Libmeldy revenue and COGS, you can find the full financial results from the first quarter in our press release this morning. The changes we announced in March will extend our runway into 2024 while maintaining operational focus on several value-creating milestones, including the potential approval and launch of Libmeldy in the U.S. and additional regulatory milestones and data releases. Since the restructuring happened at the end of March, there wasn't a meaningful impact on our operating expenses in the quarter, but we do expect to start to see those benefits beginning in the second quarter. We also took onetime charges totaling about $4.7 million, which are included in their operating expenses for the first quarter related to the restructuring of our organization and certain program termination costs. The company used about $21 million in cash during the first quarter to fund operations, which is net of $16 million in R&D tax credit refunds from the 2020 tax year. Going forward, I would expect our operating expenses and quarterly burn rate to come down over the course of 2022, exiting the year closer to $20 million to $25 million per quarter, giving us runway into 2024. As we think about funding the business beyond 2024, we see many opportunities for business development across the platform. The farming deal we announced in 2021 is a good indicator of where our BD strategy might go, bringing together Orchard's expertise in HSC gene therapy with a proven partner in a particular disease or therapeutic space that has clinical and/or commercial capabilities. The ideal partners would bring more than just capital but also have an existing set of capabilities, disease state knowledge, a commercial infrastructure or an idea or IP that could leverage our HSC gene therapy platform. Looking forward, we're pleased with the progress we've made and the changes we implemented to our business at the end of the first quarter. We're at an important inflection point for Orchard as we balance commercial activities for Libmeldy with an exciting pipeline of clinical and research candidates, and we are 100% dedicated to making the promise of our therapies a reality for the benefit of patients, our community and our stakeholders. And just additional color on how much revenue you expect per quarter in 2022, if you're able to provide that color. So as we've said, we are looking to hold a pre-BLA meeting in the second half of the year and with a view to -- on the basis of the interactions that we have to a late 2022 or an early 2023 file. With respect to the first question, let me take that -- turn that over to Braden \n Thanks, Bobby, and thanks for the question. In terms of the number of agreements and/or revenue for the rest of the year, I would say that, first of all, we're extremely pleased with the progress that we've made thus far. So we're going to hold off on any type of guidance in terms of the number of agreements before the end of the year, though we are in current Similarly, on the revenue front, we haven't guided to year just based on the uneven nature of these early quarters because of the timing of patient identification, the geography they may be in as well as the timing of reimbursement and treatment. First, I wanted to ask a bit about your latest regulatory interactions for MPS-I and MPS-IIIA actually. We understand you're looking or incorporate some of that feedback into study design, et cetera, for the pivotal trial. And I guess in that same van, just wanted to see what the latest timing is for a potential MPS-IIIA pivotal study. It's part of our leadership and the application of this HSC gene therapy approach for neurodegenerative disorders, and we've seen the success that we've had with Libmeldy. And the important piece of this is to be able to show a meaningful difference from the current standard of care, which is allogeneic HSCT. And so we've been having ongoing interactions with the regulators and we have received additional and more specific feedback related to the study design and endpoints that again, as I say, will show a meaningful difference from current standard of care. And that is what we want to incorporate into the study design, and that will likely delay the initiation to 2023. The most -- I think we've had very highly engaged interactions with the regulators, and I think that speaks to the opportunity we have with HSC gene therapy in this condition. And although the time lines have moved out, we do believe that the alignment that we're getting with the regulators will support a stronger application, both in the U.S. and in the EU. So like I said, this study is just recently finished enrollment, and the most recently treated patient was not treated that long ago. So as we are evaluating potential study designs, that's really going to be informed by these observations in the proof-of-concept study as that cognitive data matures. And I think it's certainly possible to leverage the learnings from our interactions on MPS-I, which is also characterized to some extent by cognitive decline, but is also characterized by a number of systemic manifestations that may be meaningful in that disease as well. So just Bobby, if you can walk us through sort of your confidence that sort of the feedback you are incorporating now is indeed going to be sort of the final iteration, if you will, before you initiate -- and would that be sort of a 1-half issue or second half initiation... So let me hand that over to Braden to talk about patients for Libmeldy, and then I'll pick up on the MPS-1 contraction. Part of the challenge of MLD is identifying patients within that treatment window of opportunity where they may benefit from Libmeldy, which is part of the reason why it's somewhat of an uneven identification process. As we've noted, we have treated 3 patients, 2 of which are representatives in this quarter, and there are a number of active cases that we're working on right now. But moving forward, we're not going to be providing intra-quarter updates on individual treated patients. So in terms of designing specific endpoints, it's extremely important to look at that because that is the overall burden of disease in MPS-I. So I just really had one on maybe understanding the, I guess, patient journey for the commercial MLD patients. But generally speaking, once a patient is identified as potentially MLD, they'll be referred into one of our major treatment centers in the countries that we have treatment centers in right now, the U.K., France, Germany, Italy, the Netherlands, where they'll be assessed by the clinical experts there and confirmed diagnosis for MLD. And once that happens, then they'll schedule for apheresis where the cells will be collected and then sent to our manufacturing site in Milan, Italy, where they'll be transduced with Libmeldy and then cryopreserved and sent back to the center for reinfusion in the patient. Do you think you will target only younger patients, so that clinical benefit on --- cognitive benefit can be observed or perhaps you can go for a broader range of patients that will be separated into subgroups or cohorts based on age. So maybe Leslie, if you're happy to take that question. So for the first question around the target population, specifically in terms of age, we'll be able to share more detail on specific game drains when we have the final protocol. But I will say that we're looking to evaluate how this therapy compares to the current standard of care, which is allogeneic HSCT. And generally speaking, the approach is to administer current standard of care as early as possible in the disease course. It's something that we actually see in our proof-of-concept study prior to patients entering the trial, 7 of those patients out of 8 total had prior exposure to ERT and did have anti-IDUA antibodies, a disease study onset. The conditioning protocol that we've used in that trial, which we would also employ in a registrational design once that final allowed us to reduce levels of anti-IDUA antibodies to nondetectable levels upon treatment with the gene therapy. So we would anticipate even if that is something that patients are presenting with an enrollment, the protocol that we're using would minimize the likelihood of that being something that would be of concern following treatment with OTL-203. So what we presented so far from that study with the 5 patients that have enrolled is primarily biomarker data, expression of MCSH and clearance of GAGs in the periphery and in the CSF. Like I said earlier, the disease progression of MPS-IIIA is such that patients generally flat show around the age of 3 and then start to show a drop off around the age of side. So in -- at the point where we have at least a year of follow-up from all patients, some of those patients will have more follow-up, but some of those patients will still have less follow-up in terms of getting to that point where you might start to be able to incorporate differentiation from the natural history. I'll take the first part, and then I'll hand it over to Leslie to talk about the ASGCT abstract. So just in terms of the interactions with the regulators, we did have Palo scientific advice from the FDA and the EMA last year. Having said that, there is some commonality in the feedback and the kind of study design that they would like to see the endpoints that they think are meaningfully important. And we show and are continuing to show the unique ability of gene-modified HSCs to distribute broadly throughout the body, including in the brain and other harder-to-reach tissues and enable localized delivery of therapeutic enzymes and proteins in the brain and other difficult-to-access tissues. One is an invited lecture that is on the overall OTL-203 program, and we can expect that the investigators will be presenting the most current data available from that proof-of-concept study. We have a number of presentations as well in our preclinical area that is looking to advance the applicability of the platform in other indications and predominantly degenerative indications, especially some work we're really excited about in the progranulin form of FTD. And so you could have a ubiquitous promoting, you could have a macrophage-specific photo or you could have a promoter like we've thought about here, which responds to neuroinflammation. And certainly, in some Invitae studies that we've done and which will be presented, you can see that this promoter which is derived from LADR can respond to specific neuroinflammatory securitize. So FTD is one application for this type of promoter, but also if we want to use this in other neurogenetic conditions that are associated with new inflammation, it could be used in other indications as well. I mean there's still obviously quite some way to go, and we want to prove this concept both in first lien preclinical new line studies and then in a specific indication like FTD, but this is the kind of direction in which we want to move to be able to use HSCT therapy for a range of new genetic conditions."
}