{
    "symbol": "LC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 22:11:03",
    "content": " Recurring net interest income also contributed to grow $100 million in the quarter, a 20% increase reflecting both the growth in our health and investment portfolio, as well as an increase in mix of consumer loans that generates higher yield. During the quarter, we retained 27% or $856 million of new consumer loan originations, which is 7 points or $212 million above the midpoint of the 15% to 25% range we shared with you previously. You will see on page 14 of our presentation that in Q1 our net interest margin increased to 8.6% to 8.3% in the prior quarter and 3.3% a year earlier, primarily reflecting a higher mix of consumer loans. With regard to credit quality, we remain key performance of our portfolio and I point you to page 15, which shows that 30-plus date liquidity rates on our total portfolio, including solid loans, remains low, delinquency rates on our retained HFI portfolio over the last year are below that of the total prime book and we expect them to increase in line with our expectations as the portfolio seasons over time. Expenses were up 3% or 2% sequentially, primarily reflecting $5 million increase in marketing expenses, which were up 9%, driven by loan origination growth and the increased mix of new customers. So for the quarter, our pre-tax pre-provision income was $98 million, up $24 million or 33% sequentially, which highlights a certain trajectory of our new business model. This reflects, as I said in my comments, our effort to grow higher quality loans, David, remixing our assets to the most high quality or higher quality than we had in the previous quarters, a very good opportunity that we have given our low cost deposits and you will continue to see us move to higher quality loans probably throughout the year. I am curious, the first part of it is whether we should continue to think about marketing expenses in a similar zip code called 1.94%, 1.95% to 2% of volume or if the outperformance this quarter was better -- a better yield on your marketing expenses, because if you kind of unwind some of the asset performance you have been closer to that range in terms of if you took down some of the excess volume versus where most of those probably remodeling the first quarter?"
}