{
    "symbol": "IBEX",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-15 20:44:05",
    "content": " Today, we have over 50 clients that generate over $1 million per annum and we expect that number to increase to approximately 60 by fiscal year end as our new logo engine continues to run full throttle. This margin improvement resulted in 59.1% adjusted EBITDA growth over the prior year quarter to $18.2 million, and we expect to realize meaningful margin improvement as we continue to grow and sell into our available capacity built out over the last two years. In my discussions, of our first quarter fiscal year 2023 financial results, references to revenue, net income and net cash generated from operations are on an IFRS basis, while adjusted net income, adjusted earnings per share, adjusted EBITDA, and free cash flow are on a non-GAAP basis. We had a strong quarter, representing our best start to a fiscal year on record highlighted by 17.8% top line revenue growth to $127.9 million, compared to $108.6 million in the prior year quarter. We continue to experience high growth in our BPO 2.0 clients, those that were won since fiscal year 2016, as this cohort grew by 44% over the prior year quarter and now represents 76% of our total revenue versus 62% in the prior year quarter. On a non-GAAP basis, adjusted net income increased to $6.4 million, compared to $0.9 million in the prior year quarter. Adjusted EBITDA increased to $18.2 million or 14.3% of revenue, compared to $11.5 million or 10.6% of revenue for the same period last year. Net cash generated from operations was $8.8 million for the quarter, compared to $6.9 million in the prior year quarter, primarily due to stronger operating results partially offset by an increased use of working capital. Net cash generated from operations excluding working capital was $16 million for the quarter, compared to $7.8 million in the prior year quarter. Capital expenditures were $3.6 million, or 2.8% of revenue in the first quarter of fiscal year 2023 versus $5.3 million, or 4.9% of revenue in the prior year quarter, as we continued to utilize our available capacity as a result of the removal of social distancing requirements. Non-GAAP free cash flow increased to $5.2 million in the current quarter, compared to $1.6 million in the prior year quarter."
}