{
    "symbol": "AHH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 12:41:09",
    "content": " On the call this morning, in addition to myself, is Louis Haddad, CEO; Matthew Barnes-Smith, CFO; and Shawn Tibbetts, COO. For those who listen to the rebroadcast of this presentation, we remind you that the remarks made here in our as of today, May 3, 2022 and will not be updated subsequent to the initial earnings call. During this call, we will make forward-looking statements including statements related to the future performance of our portfolio, our development pipeline, the impact of acquisitions, and dispositions, our mezzanine program, our construction, business, liquidity position, our portfolio performance and financing activities, as well as comments on our guidance and outlook. definitions of these non-GAAP measures as well as reconciliations of the most comparable GAAP measures are included in the quarterly supplemental package, which is available on our website at armadahoffler.com. She has done a fantastic job for us over the past few years in building first class platforms for our marketing, communications and ESG efforts. Mike has been an outstanding member of our team for over 25 years, as well as a close confidant and friend. Today, you'll also hear from Matthew Barnes-Smith, our new CFO, who has been mentored by Mike for the last 20 months in anticipation of this planned transition. During the past 20 months, Matt has demonstrated to the Board that he is the right person to lead our finance team and manage our balance sheet. This morning, we reported $0.28 of normalized FFO for the first quarter, which was above our previous projections. Whether it's high single-digit increases in same-store NOI, re-leasing spreads and apartment tradeouts or portfolio-wide occupancy at 97%. Whenever you see one of our properties, you are likely looking at the newest and best in class in that submarket, be it the Whole Foods Center in Delray Beach, the 750 apartment units at the Town Center of Virginia Beach, or the Exelon building at Baltimore's Harbor Point. We believe these types of assets we own, office, retail or multifamily will outperform the competitive set through most any business cycle. As those who have followed the company closely know, our strategy of keeping our debt virtually 100% fixed or hedged has been a trademark of Armada Hoffler for many years. Our expectation is that our net interest expense will be largely unaffected for the remainder of the year due to the fixed rate long-term debt on many properties as well as the protection from hedging instruments, which effectively capped the expense on our floating rate loans well into 2023. These factors, rising rents and stable debt combined with an ability to raise inexpensive capital through the sale of premium quality noncore assets, support our belief that 2022 earnings will eventually skew towards the high end of the increased range. Let's now go over a few highlights in our various sectors, beginning with Multifamily. With occupancy at 97% and same-store NOI topping 15%, the assets continue to exceed all expectations. These apartments are already nearly 70% leased, and we expect the asset will reach full occupancy by year-end. Based on the occupancy levels present in that submarket, we expect another swift, efficient lease-out. As we've said on numerous occasions, our growing multifamily portfolio is a tremendous source of value that is yet to be recognized by the market. We continue to see strong demand for our office properties with occupancy at 97% and little rollover over the next 12 months, our biggest challenge this year is accommodating the tenants that are looking to expand. By way of example, Wills Wharf, the office building we brought online at Baltimore's Harbor Point at the outset of the pandemic, has signed several high-quality tenants, including Transamerica, EY, Morgan Stanley and RBC. Currently, we are negotiating 2 leases with credit tenants that would bring the building to over 90% leased. At the adjacent Thames Street Wharf, we are also in lease negotiations with a top flight company to substantially backfill the 2023 lease expiration of the Johns Hopkins space. Even further evidence of the state of the market at Harbor Point is the recent announcement that T. Rowe Price has increased their lease commitment for their global headquarters to 550,000 square feet from the original program of 450,000. At 97% leased and little anticipated turnover, we look to positive leasing spreads for continued growth. With the overall portfolio performing at an extremely high level and the debt on those stable assets a comfortable 5.6x EBITDA, we anticipate continued moderate growth in portfolio income over the next few years. Put another way, if we were to sell our development projects at cost and the mezzanine loans were paid off, the remaining core company would be levered at virtually the same mid-5x EBITDA than it has been for the past few years. Speaking of development, the primary driver of what we believe will be superior earnings growth will come from what is now the largest development pipeline in our history. First, as I mentioned previously, the T. Rowe Price global headquarters has grown by over 20%. Additionally, we have decided to increase our stake in the adjacent 300-unit apartment asset to 90%, requiring a total investment of $74 million. This project, combined with the 400 units we currently own and the option to construct a second tower on the site will give us nearly 1,000 waterfront apartments at Harbor Point, all located on the same campus as 10 acres of park and open-air plazas over 100,000 square feet of retail space and over 3,500 employees. These investments, combined with the previously disclosed projects, bring our development book to over $700 million, the vast majority of which is multifamily assets in A plus locations. As we all well know, NOI growth, while important, becomes largely meaningless if it doesn't translate to increases in NAV and earnings per share. In our position as the largest active holder of the company's equity, management is ever mindful of the cost of capital necessary to fund our activities and the effect it will ultimately have on our profitability as well as the need to minimize equity dilution. To that end, we are making appropriate adjustments in our game plan to take full advantage of current market conditions while maximizing long-term shareholder value. While we still intend to acquire 2 small grocery anchored centers on an off-market basis, the vast majority of the previously earmarked acquisition funds will instead be used to satisfy the increased equity requirements at Harbor Point that I just described. More notably, we intend to fund the remaining equity requirements of our development activities with proceeds from selling additional noncore assets. First and foremost, with the stock trading at a level far below what we believe to be true value, we have no desire to sell any equity at anywhere near these prices. Secondly, we have nearly $200 million of noncore assets that we believe will bring premium prices in the current market environment. Selling these properties at cap rates in the 4.5% range is by far the cheapest cost of capital available to us and should have little, if any, impact on earnings. These cost-effective funds should virtually fulfill the remaining equity required to complete the current pipeline and further ensure our development spreads, thereby allowing more of the projected dramatic increase in NOI to flow through to the bottom line. For four decades, we've been extolling the virtues of mixed-use assets, a diversified portfolio and the advantages of self-performing development and construction. For the 5 years preceding the pandemic, investors embraced this approach, which presumably led to our company tripling the returns of the REIT index over that period. I fully appreciate the confidence that you and the Board have placed in me, and I look forward to working together to grow our company in the years to come. We have some exciting updates to share with a strong performance this quarter, the perfect starting point to this new chapter. For the first quarter of 2022, we reported FFO of $0.31 per share and normalized FFO of $0.28 per share. As Lou stated, our outperformance in NFFO is due to virtually every core real estate metric across the portfolio continuing to trend positively. We have, therefore, increased our guidance range accordingly to $1.15 to $1.19 per share from our previous midpoint of $1.13 with multiple increases across the entire organization. Before I jump into the details surrounding our financial performance, I'll take a minute to discuss this quarter's supplemental financial package, which we released this morning and can be found on our website. Similar to previous years, this quarter, we have embarked on our annual refresh of the supplemental package, specifically looking to provide additional transparency with our leverage metrics. Firstly, as Lou alluded to earlier, the bar on the left illustrates our stabilized portfolio debt-to-EBITDA ratio at 5.6x. This is consistent with the average over the last 3 years, highlighting the conservative posture of our balance sheet. The bridge in the middle demonstrates our temporary leverage with all ancillary activities, inclusive of mezzanine lending and development spend. The final segment also adds our preferred stock, bringing our total debt plus preferred to EBITDA to 8.5x. For the first quarter, we achieved 97% occupancy across each segment of the stabilized operating portfolio, resulting in an all-time high portfolio-wide. In April, we have completed the sales of our 2 Charleston student housing properties, exiting the student housing asset class. Taking advantage of the value of our strong occupancy, pre-leasing activity and favorable market conditions allows us to recycle this low-cost capital from our noncore assets as alluded to earlier by Lou. The disposition of our last remaining student housing assets, coupled with the disposition of Johns Hopkins Village last quarter, cements our financing strategy, deploying capital surgically in the highest and most advantageous places. For quarter one, our overall same-store NOI growth was 7.3% on a GAAP basis and 9.4% on a cash basis, demonstrating our healthy leasing growth portfolio-wide and strong re-leasing spreads. Given the high quality of our portfolio, commercial releasing spreads were also positive for the quarter at 11.7% GAAP and 3.3% cash. As Lou referenced in his remarks, the combination of our loan maturity ladder to include our hedge positions, average interest rates and debt service coverage results in a fixed charge coverage ratio of 2.6x. As interest rates continue to rise, we will continue to monitor the environment to ensure we layer in new hedge positions when our current sets of positions mature. With respect to the $175 million of floating rate debt secured by the Exelon building acquired at the beginning of the year, we entered into a hedging corridor effectively capping this notional amount at 100 basis points. As we continue to experience market volatility and federal bank rate assertions, we are confident in our company's stable position with 100% of our debt fixed or hedged. Looking forward to 2023, we are starting to work with our lenders to secure refinancing of 2 notes maturing in the opening months of next year. The progress of our development pipeline and our liquidity position, coupled with current market conditions, will prescribe our direction with the 3 Town Center of Virginia Beach retail notes that mature in August of 2023. As previously mentioned, when I discuss the supplemental package refresh, we expect to maintain our stabilized operating portfolio leverage at or around 5.5x debt to EBITDA. Any additional temporary upticks for our ancillary activities will be included in the ancillary debt-to-EBITDA ratio, which is 7.4x for quarter one. Over time, as these temporary activities finalize, those components of our ancillary leverage will move into our stabilized operating portfolio debt-to-EBITDA at appropriate levels. One of the key themes over the last 12 months has been the rebalancing of our portfolio with the reduction of our mezzanine book, strategically selecting projects that we would like to own and that require an investment of preferred equity in the region of $15 million to $30 million. One of these such projects, Solis City Park closed in March, where we transacted on a preferred equity operating agreement with our strategic partner Terwilliger Pappas. We have committed to contribute roughly $20 million to this 250 unit $62 million multifamily development outside of Charlotte, North Carolina. On the Interlock in West Midtown Atlanta, our largest mezzanine investment, we still anticipate the sale of this asset later this year or early next. Our liquidity position continues to be strong at over $120 million, more than sufficient to cover our 2022 cash requirements for our development pipeline, projected acquisitions and preferred equity projects. This, combined with the potential sales of noncore assets, places the organization in a great position for earnings growth per share, as noted in updated guidance. Finally, to close the loop on our increasing guidance, we expect our strong operational performance to continue through the fiscal year, particularly in the multifamily segment. I am confident that quarter one's financial results, our strategic hedging plan and fiscally responsible use of capital sets us up for a superior 2022 performance. As I mentioned a couple of earnings calls ago, Ten Tryon was originally cast as an office building with a lot of spec space with the Publix grocery store down below and a parking garage. As I mentioned, again, a few quarters ago, we aren't comfortable coming out of the pandemic with new office space in that area. Yes, to Lou's point, we pivoted away from the office product in that market for good reason. So we will have more to report, we think, next quarter, but we'd certainly like to get in the ground this year and start that project moving forward. But I think the best way to answer that question is, we've re-envisioned that with the Publix and alongside the adjacent property owners. And we're in -- as Shawn mentioned, we're in conversation with those adjacent landowners to come up with the right solution and price points. But just casting into the future, as you start to backfill the predevelopment pipeline and look for other acquisitions, et cetera, how are you and the Board, Lou, thinking about your exposure to Baltimore, specifically your desire to start new projects there beyond the T. Rowe and the various related developments in and around that same area. First of all, with respect to Baltimore, we like to talk specifically about the submarket and not paint the entire region with the same brush. Down at Harbor East, Harbor Point, Fells Point, we've had great success with the security of the area as well as new residents coming in virtually at an unmatched pace, which is why we're continuing to build there. Beyond the 2 buildings that we've talked about that are in the pipeline, there is one premier site left on Harbor Point. That's going to be held in reserve by our partner, Beatty Development until the right users come along. That submarket has proven to be exceedingly strong, as I mentioned in my previous remarks. Remember, this is -- Greater Baltimore is a 3.5 million person area. It's 35 miles from D.C. and corporations are finding it to be a low-cost alternative to try and locate in Northern Virginia or in Washington, D.C. And so, we've been blessed with everything that's going on in virtually every market that we're dealing with. With regard to restocking the pipeline, we want to digest this $0.75 billion first. But at this point, it's really just selecting from the opportunities that are presented to us. We haven't seen any movement in high-quality assets, particularly with long-term leases of credit tenants. The -- what we've identified in terms of those off-market acquisitions, we have about 4 or 5 candidates, and we're going to pick the best 2 or 1 or 3 that present themselves. As I think we mentioned, we really want to focus on grocery anchored with good credit on the grocery side and not a lot of small shops, which is a hallmark of our portfolio. At some point, we would expect that cap rates would moderate even on the highest quality stuff. I'll ask Matt to take a look at the specifics, but the -- it really is across the board, Chris, whether it's Virginia Beach, or Charlotte, or Baltimore, we're seeing healthy trade outs in the high single or low double-digit increases when those things turn over. We had a very strong increase in occupancy and an increase in rates in those re-leasing spreads really across the board, both in our Baltimore area and here in Town Center Virginia Beach. Also, in the office space, we performed very well in our Baltimore segment as well. Chris, if you would like some really high-level specific details and you want to set up a call with us after the fact I'm more than happy to go through the fine details with you. We expect that those leases will be signed this quarter, again, with the state of-\n One moment, ladies and gentlemen."
}