{
    "symbol": "AHH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:06:05",
    "content": "  Operator: Good morning and welcome to Armada Hoffler Properties, Inc. Third Quarter 2022 Conference Call. On the call this morning, in addition to myself, is Lou Haddad, CEO, Matthew Barnes-Smith, CFO, and Shawn Tibbetts, COO. A replay of this call will be available shortly after the conclusion of the call through December 08, 2022. For those who listen to the rebroadcast of this presentation, we remind you that the remarks made herein are as of today, November 08, 2022, and will not be updated subsequent to this initial earnings call. During this call, we will make forward-looking statements, including statements related to the future performance of our portfolio, our development pipeline, the impact of acquisitions and dispositions, our mezzanine program, our construction business, our liquidity position, our portfolio performance, and financing activities as well as comments on our guidance and outlook. These risks and uncertainties can cause actual results to differ materially from our current expectations, and we advise listeners to review the forward-looking statement disclosure in our press release that we distributed this morning and the Risk Factors disclosed in the documents we have filed with, or furnished to, the SEC. We will also discuss certain non-GAAP financial measures, including but not limited to FFO and normalized FFO. Definitions of these non-GAAP measures, as well as reconciliations to the most comparable GAAP measures, are included in the quarterly supplemental package, which is available on our website at armadahoffler.com. Since becoming public 9 years ago within installing the virtues of mixed used assets, a diversified portfolio, the advantages of self-performing, development and construction and a strong emphasis on company culture. After raising our guidance for a third consecutive quarter, our new mid-point of $1.19 per share represents a 11% increase over full year 2021 earnings which has supported the 18% increase in the dividend this year. Although we are not ready to release guidance for next year, our expectation is for earnings and dividends to continue to rise in 2023. This is wholly consistent with the data included in our initial guidance presentation from earlier this year, where we projected that NOI would increase by 45% over 2021 levels over the next few years as our developments stabilized. With two multifamily development deliveries this year, a large mixed use development expected to enter service next year, and the expected 2024 deliveries of the T. Rowe Price global headquarters and 300 more luxury apartment units, we are right on track with that forecast. The rapid lease up of our development, deliveries and stellar performance in third party construction are important factors and are steadily increasing results. However, the largest source of the upward trajectory has been the continued high occupancy and rent growth in our stabilized properties. Continued increases in same store NOI, commercial releasing spreads and high single digit apartment trade out have become the norm for 2022. When you have prime properties amongst limited peer competition, you have the ability to sustain premium rents through essentially any macroeconomic backdrop. We believe the type of assets we own today office, retail or multifamily will outperform the competitive set through most any business cycle. Put another way, we expect our buildings to maintain the highest rate and occupancy in every one of our core markets, regardless of the asset type. To that end, I'll reference our two most recent press releases. First, you'll recall that last quarter, we reported that we expected another high credit lease to replace the soon to be vacated Johns Hopkins space at Thames Street Wharf at Harbor Point. Yesterday, we announced that Morgan Stanley has leased the entire 46,000 square feet. Perhaps more importantly, they've extended the term on their initial 195,000 square feet to 2035. With the recent addition of Morgan Stanley's Wealth Management Group, and 35,000 square feet in our adjacent Wills Wharf building, Morgan Stanley will have a presence of over 275,000 square feet at Harbor Point well into the next decade at a minimum. This commitment combined with the long term leases of the corporate headquarters of Constellation Energy Group, T Rowe Priceâ\u0080\u0099s global headquarters, Transamerica, RBC, EY and many others should validate to all our years old belief that Harbor Point is a top destination for class eight companies between DC and Philadelphia. These trophy office buildings complemented by what will ultimately be nearly 1000 luxury apartments and some specialty retail, all surrounding a five acre waterfront park make Harbor Point the premier destination for the top demographic in each of its asset classes. With occupancy across retail office and multifamily in the high 90s, our Asset Management Team began working on the few potential vacancies expected to occur over the next couple of years. Although the existing Hampton University space is leased through 2023,we negotiated a buyout and signed a new lease for 18,000 square feet with Old Dominion University to locate their school data science and cyber at Town Center. As Iâ\u0080\u0099ve said repeatedly, the competition for space in our trophy office properties is very robust. Consequently, the most pressing issue facing us in the office portion of our portfolio for the foreseeable future is accommodating our existing tenants with expensive plans. As most of you know, retail is the largest component of our asset base, and grocery anchored shopping centers make up the majority of that sectorâ\u0080\u0099s NOI, with occupancy at an all-time high, robust releasing spreads, and same store NOI growth, we anticipate very little turnover and increasing revenues for the foreseeable future. Please remember that both of these properties sit on what we consider to be prime multifamily acreage, one adjacent to town center, the other in the heart of downtown Harrisonburg. That said, we will continue to operate the theaters and is not interested in relinquishing either property at this time, nor do we have any interest in renegotiating rental rates. Although delivery of the first units occurred only last month, the property is already nearly 70% leased as of yesterday. Although the pace of apartment leasing traditionally slows over the winter season, we expect the property to still stabilize during the first quarter of 2023. In our last report, we told you that our Gainesville development in the Greater Atlanta area was the fastest multifamily lease up in our history at just under seven months. On the construction front, we continue to realize record profits and expect this division to produce its best year ever in 2022. And with over $525 million in third party contract backlog, we expect this trend to continue through the entirety of 2023. While third party construction profits continue to grow, the percentage of earnings attributable to fee income will continue to diminish relative to portfolio NOI. With respect to the interlock project in West Midtown Atlanta, we are now projecting our loan to be outstanding well into next year, given the current unsettled capital markets. As I mentioned earlier, this property is over 90%, leased, and cash flowing handsomely. With our priority position which requires all net income to be applied to our loan balance, we're happy to remain patient until the environment is more favorable for our partners to transact at a meaningful profit. Alternatively, should the opportunity ever arise to acquire this trophy property at a significant discount, we remain favorably disposed to that auction. Earlier in this year, we told you that in light of the continued undervaluation in our share price, we had decided to sell a few non-core assets to fund the remaining equity required for our active development pipeline. Well not surprising, needless to say we are very pleased with these results. As previously stated, we have no further need for capital through the end of this year and beyond. Collectively, the projected return on costs of the new assets in development is substantially higher than the cost of those funds. As a result, much of the anticipated income from our development pipeline is expected to translate into future FFL. In addition, we're evaluating a number of other development opportunities, the majority of which are in the multifamily sector. Some on acreage we already own, some brought to us by development partners, only those projects that meet our criteria for long-term growth and profitability will make it through our underwriting and onto the active development list. Our COO, Shawn Tibbetts is here to answer any questions you may have on our development activities and what we are seeing in the marketplace. Combine all the factors I just mentioned, with retail NOI and multifamily rental rates at all-time highs, we come to understand the continued rise in our top line numbers. Of course, in order to see those funds filter through to FFO, control of expenses and debt service must remain a priority. As those who have followed the company closely know, our strategy of keeping our debt virtually 100% fixed overheads has been a trademark of Armada Hoffler for many years. As Matt will detail later in the call, we expect our net interest expense to be largely unaffected by rising rates in 2023. This is due to the fixed rate long term debt on many properties as well as the protection afforded by our hedging instruments, which effectively kept the expense on our floating rate loans until the latter half of 2024. This action, along with strong top line growth, and strategic debt pay downs go a long way to restoring the upward trajectory of our earnings continued. Across all operations in our business model, our team continues to produce at an extremely high level. For the third quarter of 2022, we reported FFO of $0.26 per diluted share, a normalized FFO of $0.29 per diluted share in line with our expectations. For another consecutive quarter, we produced a robust set of operating metrics across our portfolio, resulting in an increase to our guidance range, now with normalized FFO at $1.18 to $1.20 per diluted share. Starting with our operational metrics, I'm pleased to report the stabilized operating property occupancy once again came in above 97% and 97.1% this quarter. The combination of our strong asset management teams lease  off efforts, coupled with high quality trophy assets located in strategically select sub market continues to produce winning results. The standout segment this quarter is our retail portfolio, and 98% occupied. Inclusive of this significant lease, our asset management team has executed nearly 1 million square feet of renewals and new leases since the beginning of the year. To put this into perspective, at historically high occupancy levels, we are continuing to maximize our market exposure and support all of the leasing objectives we set for ourselves at the beginning of the year. In the multifamily segment, we are seeing new lease trade out metrics and nearly 9% high releasing spreads coupled with operational focus has enabled the team to drive efficiencies and reduce expenses on a per unit basis across the multifamily segment, resulting in our high NOI growth statistics. Last quarter, I spoke about how our operational performance needs to be supported with sound fiscal management. Working with our diverse lender base, we closed on our credit facility recast in August, increasing both our term loan and revolving credit facility by approximately $100 million each, purposefully going to market 18 months early to ensure that we secured the most optimized terms, we were able to maintain our favorable pricing whilst extending the revolver and the term portions of the facility out to 2027 and 2028 respectively. For the third quarter of 2022, our stabilised portfolio debt to EBITDA leverage reduced to 4.9 times. In August, as stated earlier this year, we paid off our last 2022 maturity adding the Hilltop marketplace to our unencumbered assets. You will recall that this is a third asset this year, we've paid off that maturity. As noted earlier, and at length last quarter, our long range financing strategy is to surgically over time move to a more unsecured balance sheet. Continuing on this path, we are currently working with our preferred lenders to advance another unsecured term loan of $125 million with an accordion feature rising to $200 million. We expect this 51-month unsecured line to close at the end of November, and be utilized to convert our secured construction debt on the Wills Wharf asset and secure construction debt on our  to unsecured funds and leaner pricing. We will also look to transfer a couple of our higher interest rate smaller properties to this term loan, therefore further reducing our cost of debt. The third quarter or weighted average cost of debt was 2.9%, illustrating the success in maintaining that our debt is 100% fixed or hedge and reducing the risk of uncertainty in this rising interest rate economic cycle. Assuming the forward yield curve stays reasonably consistent with the current projection, our expectation is that our weighted average cost of debt will be below 4% for 2023. We're also looking to close our final refinancing of the year later this month, with a $30 million loan to the Gainesville apartments priced significantly below the construction note. As indicated on last quarter's earnings call, we have now not only taken care of all of our 2022 debt maturities, but with the recasts of the primary credit facility and the closing of our new unsecured term loan, we've also taken care of all of our explorations through the end of 2023. As you heard, for the third straight quarter, operational excellence continues to be an Armada Hoffler key competency and our better than expected performance is anticipated to continue throughout the remainder of the fiscal year. The strength and speed of lease up in our Gainesville and Chronicle mill multifamily assets coupled with a high occupancy continued expense management, strong releasing spreads and better than expected performance in our third party construction pipeline are the main drivers of this projected increase. For the specific assumptions affecting our guidance range, please turn to page five of our supplemental package, which is available on our website. We believe it is only a matter of time before the market fully appreciate not only the significant value of this management team has already delivered this year, but also the foundation for future value creation that will be harvested in the years to go. Operator, we're now ready for the question and answer session. Well, as you might expect, the velocity of sales has slowed meaningfully. We're seeing some deterioration in cap rates, which is, which, frankly, is welcome. I think as rates continue to rise, you'll see particularly on the retail side, cap rates starting to move materially. As I said, earlier, we sold the Annapolis Junction property and a 4.1 cap rate on trailing 12-month NOI. And with our multifamily partners, what we're hearing is what, six months ago, we were looking at sub four cap rates, and now they're lucky to get sub five. The as you know, we're strongest in grocery anchored shopping centers. Yes, we're watching there is there is a construction loan. So assuming they meet that coverage, middle of next year, they could stay another year. As you know, it's just not it's not a great time for people to deploy a lot of capital. So we're always going look for accretive acquisitions, as well as developments and with, with Matt having the balance sheet in its best shape ever, having all the liquidity we need to fully fund with what we have going on we're going to sit back and wait and watch as opportunities come our way. We can send it to you but you're going to ask you're going to round out around 40% retail, and 35% or so office and whatever, whatever the remainder 25% in multifamily. But we're, I don't believe we've missed any payments, and they continue to make good on their lease, and we'll see what happens in the future as, as we've said, for the last year and a half. At the same time, they have leases and they're willing to honor them. Matt, the guidance range for fourth quarters implied $0.31 to $0.33 versus $0.29 in the third quarter that you did. What are the one or two biggest things that are going to be responsible for that $0.02 to $0.04 sequential jump, especially given the sale of Annapolis Junction? Also, the acquisition of the Pembroke  grocery anchored retail asset that closed last Friday was another slight hiccup there. Yes, one other thing, Rob -- remember we've, we've delivered to multifamily properties this year, and there's not a full year of having that income in. Just looking at your same store NOI, it seems like much of the cost growth was driven by higher real estate taxes, particularly within your multifamily portfolio. So some of that is due to timing, some of that is due to as those assets in the Harbor Point development come online."
}