{
    "symbol": "RWLK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 12:37:04",
    "content": "  Operator: Good day, and welcome to the Q3, 2022 ReWalk Robotics Limited Earnings Conference Call. Good morning, and welcome to ReWalk Robotics' third quarter 2022 earnings call. Earlier this morning, ReWalk issued a press release detailing financial results for the three and nine months ended September 30, 2022. Before we get started, I would like to remind everyone that any statements made on today's conference call that express a belief, expectation, projection, forecast, anticipation or intent regarding future events and the company's future performance may be considered forward-looking statements as defined by the Private Securities Litigation Reform Act. ReWalk specifically disclaims any intent or obligation to update these forward-looking statements, except as required by law. For the benefit of those who may be listening to the replay or the archived webcast, this call was held and recorded on November 7, 2022. Since then, ReWalk may have made announcements related to the topics discussed, so please reference the company's most recent press releases and SEC filings. And with that, I'll turn the call over to ReWalk's CEO, Larry Jasinski. The ReWalk exoskeleton has always pioneered the exoskeleton industry starting with our de novo FDA clearance, more recently with our breakthrough designation for the pending stair, ascend and descend features and have now completed the first exoskeleton submissions to CMS. While coverage is in place under the code we established with CMS, the unfinished designation of the benefit category and of pricing exoskeletal is now a part of the MAC submission process to complete the ongoing supply of exoskeletal systems. Now CMS is using a new process and exoskeletons are unique, the timelines are not specifically defined. In Germany, ReWalk has led the way in establishing a coverage code and then entering into contracts with several large public and private insurers. While it has been an active process with several of the larger insurance entities, the question of whether exoskeleton provides a direct or indirect disability compensation from the spinal cord injured individual seeking to walk again has been pending in the court since May of 2017. In parallel with the coverage, ongoing innovation and improvements on the ReWalk personal exoskeleton system are moving forward. While the design has a breakthrough designation with the FDA, we are also presently reviewing the existing coverage codes that may support payment and have identified multiple potential coverage pathways. ReWalk reported revenues for the third quarter, 2022 of $886,000 as compared to $2 million in the third quarter of 2021. For the nine months ended September 30, 2022, we have recorded revenues of $3.3 million as compared to revenues of $4.7 million in the same period of the previous year. For the Q3, 2022 results, the decrease as compared to the same period last year was due to sales of a lower number of ReWalk exoskeleton units. Also important to note is that the prior period reflects the benefit of a large multiple unit order from the institution of physical rehabilitation that did not reoccur in Q3, 2022. On the positive side, in Q3, 2022, we generated revenue of about $250,000 from the sale of MYOLYN MyoCycles, which marks our highest quarterly performance for this product line. As we look at our progress during Q3, within our ReWalk Personal 6.0 commercial pipeline, we had a total of eight new insurance decisions to place a ReWalk device for rental or direct purchase and three new VA decisions to place a ReWalk device for rental. Our current pipeline of active rentals consists of 26 cases and our overall number of cases in process currently sits at 74 with 56 in Germany and 18 in the U.S. Not every case in our pipeline will translate into an - eventual sale, but these figures do provide some perspective on the scale of the opportunities on which we are working. Turning to gross margins, in the third quarter of 2022, our gross margin was 25% as compared to 58% in the prior year's quarter. Our third quarter of 2022 operating expenses, were $5.7 million as compared to $3.8 million in the prior year's quarter. In sales and marketing, we also had an increase in spending primarily due to higher consulting expenses related to CMS progress, sales-related expenditures for trade show activities since the COVID restrictions are being lifted and personnel-related costs. The proxy process contributed an incremental spend above typical levels of about $600,000 during Q3, which will not carry into Q4 for the year, the impact of the excess spending on the extended proxy process took, - a totaled $1 million. Our non-GAAP net loss for the third quarter of 2022 was $5.1 million or $0.08 per share, as compared to $2.3 million or $0.05 per share in the third quarter of 2021. As our cycle time for sales is about nine months, we are now moving past the final surge of COVID that was one element that limited the units closing in Q3 due to delayed starts early in the year. The second environmental factor, the company has remained active with several major trade shows globally year-to-date, and in particular, we're able to develop leads at the  Conference in September, our largest show in the world, which had not been held for the prior two years. Objective number one, revenue, due to the delayed timing of reimbursement decisions from our original projections, we no longer expect year-over-year revenue growth for 2022 due to the slower movements of pending cases year-to-date. Objective number three, CMS and the German court, in September, CMS affirmed that the MACs have discretion to cover and reimburse the ReWalk exoskeleton. Our fourth objective, technology development, our goal is two FDA device applications for improved ReWalk designs to launch in 2022 and 2023. The first of these submissions was made in June 2022, and the second submission is now expected for Q1, 2023 due to the addition of usability requirements in the submission. And then objective number five, the operational controlled but increased investment of an additional $3 million to $4 million year-over-year in reimbursement, product development, market development and access, Investor Relations and new business development. We have followed through on reimbursement support in a precise manner, have been able to restart market development and access programs post COVID, and have resourced the process for identifying and pursuing new business development."
}