{
    "symbol": "HHS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 21:25:07",
    "content": " The 1.4% revenue decrease in the second quarter, especially the $3.8 million decrease in customer care revenue reflects this expectation. As a whole, revenues declined 1.4% in the quarter to $48.6 million, but operating income increased $2.6 million or nearly 180% compared to the second quarter last year. On to Fulfillment & Logistics, its revenue increased approximately $3.9 million or 24.3% compared to the second quarter last year and EBITDA increased 91.7% to $3.2 million. Its revenues decreased just slightly to $13.5 million, but EBITDA improved to $1.8 million from $1.7 million in the quarter a year ago. And perhaps more importantly, we are delivering solid GAAP profitability, with fully diluted earnings per share of $0.52 compared to $1.27 in the second quarter last year which included a $10 million or $1.39 per share onetime gain related to the extinguishment of our PPP loan. Our Fulfillment & Logistics segment delivered $3.2 million in EBITDA, up approximately $1.5 million or nearly double from the year ago quarter. Our operating expenses for the second quarter were $44.5 million, down 6.9% from $47.8 million in the year ago quarter due to labor, advertising and SG&A expenses as well as the absence of $1.7 million in restructuring expense in the second quarter last year. Operating income was $4 million, up $2.6 million compared to operating income of $1.4 million in the year ago quarter. We posted net income of $4.5 million or $0.54 per basic and $0.52 per diluted share in the second quarter, compared to net income of $10.6 million or $1.36 per basic and $1.27 per diluted share in the second quarter last year. Additionally as Brian mentioned, we reached an agreement with Wipro at the end of the quarter, in which we will acquire all of the outstanding preferred shares for a onetime cash payment of $9.9 million and 100,000 common stock shares. And that nice strong performance there along with the revenue mix of both print and kitting fulfillment that we had both in both Boston and Kansas City really helped the business drive forward, including some ongoing project work that we got as a result of a recall that I think we talked about on our first quarter call that continued into the second quarter."
}