{
    "symbol": "AEP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 13:29:06",
    "content": " Today I'll provide a brief recap of the key financial highlights for the quarter, followed by updates on our Kentucky sale process, our unregulated contracted renewables portfolio sale, and the previously announced strategic review of our retail business, all of which are part of our strategy to simplify and derisk our business profile. Our long term earnings growth rate guidance of 6% to 7% is underpinned by a robust $40 billion capital investment plan for 2023 to 2027, which includes $26 billion in wires and $9 billion in regulated renewables investments. Later in today's call, Julie will walk through our third quarter performance drivers and share thoughts on the positive load outlook in our service territory as well as on our targeted 14% to 15% FFO to debt range. Favorable drivers included rate changes across multiple jurisdictions, the impact of the Virginia Supreme Court ruling related to our APCo triennial review, which you'll see on the waterfall today is a $0.06 catch-up of the 2017 through 2019 under earnings, positive weather on our Western jurisdictions and increased transmission revenue. The AEP transmission Holdco segment contributed $0.33 per share flat compared to last year, favorable investment growth of $0.2 was somewhat offset by unfavorable income taxes. For the year-to-date comparison, AEP's normalized retail sales increased by 3.1%, with growth spread across all major retail classes and operating companies. The third quarter continues to provide a solid foundation for the rest of 2022 and allowed us -- at our recent Analyst Day, in narrow and raise our operating earnings guidance range to $4.97 to $5.07 with a midpoint of $5.02. This, along with the updated 2022 load forecast we provided at our October 4 Analyst Day and the Virginia Supreme Court ruling related to APCo's 2017 to 2019 triennial review, position us to navigate headwinds, remaining this year that you would expect, such as continued inflation, interest rates, weather risks, et cetera, which is why we maintained a $0.10 range when we recently lifted and tightened our 2022 guidance range. So as a swag and we'll do better with this as we go into 2023 to give you a more granular view of the transmission component in the aggregate from AEP, but assume that roughly 50% of the earnings on the vertically integrated utilities and T&D utilities is essentially the part of the 95% -- or I'm sorry, adding $0.95 to another -- let me say it in another way, I'm totally tripping over myself here."
}