{
    "symbol": "AEP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 12:56:05",
    "content": " Additional regulatory activity in the quarter included a commission order received in May on SWEPCO's Arkansas rate case, including a 9.5% ROE, marking a net revenue increase of $28 million and a capital structure of 55% debt to 45% equity. Specifically, you'll see that we made an adjustment to arrive at our operating for the quarter and year-to-date periods consisting of Kentucky sale costs and the write-off of one of the unregulated universal scale wind projects that's included in the portfolio. Just as a reminder on the O&M and depreciation front, as I mentioned on the first quarter call and included in our 2022 guidance details because of a change in accounting related to the Rockport Unit 2 lease at I&M, we're seeing approximately $0.05 of favorable O&M offset by $0.05 of unfavorable depreciation in each quarter of 2022, but no consequential earnings impact. There's no question that as we look at all the resources that are needed, the changes and the transmission system, fiber type issues that I'm sure that they'll be interested in as well in a regional activities associated with planning, ensuring that we're able to invest the way that we should on a timely basis with as little risk as possible. Certainly we believe with the original agreements and the ability to operate under the operating committee under that agreement, we can really focus on the status quo and ensuring that we're able to move forward with a partner that's a third party, so that the provisions of the agreement already provide for the ability to make those kinds of adjustments. That's why I sort of said, it's a continued execution around, and I use taking care of business, but adding a dash of let's go crazy that sort of says we're going to be thinking on the edge about what can be done to make sure that we fund these real opportunities we have ahead of us. So again, I would say, post election you're probably dealing with either some form of a smaller package, or extenders which that's a typical thing that happens toward the end of the year, when ITCs, PTCs start to roll off, again, you'll see extenders or the IRS of supply chain activities being able to extend it for some period of time. So anything we get from that perspective will ultimately be a benefit to our customers from an economic standpoint and that will be good for, not only our movement to a clean energy economy, but the options that we have available to us, namely with storage, nuclear, hydrogen hubs, those kinds of things need to continue to be looked at to make sure we're resilient and reliable going forward."
}