{
    "symbol": "FBRT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 11:26:10",
    "content": "  Operator: Good morning, and welcome to the Franklin BSP Realty Trust Fourth Quarter 2022 Earnings Conference Call. With me on the call today are Richard Byrne, Chairman and CEO of FBRT; Jerome Baglien Chief Financial Officer and Chief Operating Officer of FBRT; and Michael Comparato, Head of Commercial Real Estate at BSP. Before we start today's conversation, I want to mention that some of today's comments from the team are forward-looking statements and are based on certain assumptions. The company assumes no obligation to update any statements made during this call, including any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. Additionally, we will refer to certain non-GAAP financial measures, which are reconciled to GAAP figures in our earnings release and supplementary slide deck, each of which are available on our website at www.fbrtreit.com. So, this morning, we're going to review our financial results for the fourth quarter and for the year-ended 2022. I'm going to start, and I'm going to begin on Slide 4 where I want to quickly cover FBRT's milestones throughout 2022. First, we closed $209 million of new loan commitments in the fourth quarter. Importantly, throughout the year, we liquidated and recycled the capital underlying the entire -- virtually the entire 7.1 billion of ARMs we inherited from Capsteadâ\u0080\u0099s merger into our commercial real estate portfolio. We issued two managed CLOs in the first half of '22, raising over $2 billion. We have cash and total liquidity of $179 million and $1 billion, respectively. We have just over $48 million left on our buyback authorization, which was extended through the end of this year, December 31, 2023. Additionally, Benefit Street Partners, the advisor, purchased $35 million of common stock during the second and third quarter. So in total BSP and FBRT's combined purchase activity totaled $52 million in common stock, and obviously that was purchased at attractive levels. Overall, we executed our strategic plan for 2022 and are encouraged by the growth in our portfolio, strengthened our credits, and believe we are well positioned from many perspectives, including our liability structure. So with that, now I'd like to focus more specifically on the fourth quarter. First, we generated $0.37 in distributable earnings in the fourth quarter, an increase of 12% from the prior quarter. This was the same dividend we've paid for the past six consecutive quarters, and it is delivering a yield of approximately 9% on our 12/31 book value. During the quarter, two loans were added to our watch list, and three positions were added to foreclosure REO, two of which were previously on our watch list. Importantly, 71% of our performing loan portfolio was originated in the last 18 months. To conclude, we remain comfortable with the quality of our diversified portfolio that is predominantly multi-family. We also look forward to taking advantage of accretive new origination opportunities throughout the year, as we believe the origination environment will become still more opportunistic as values adjust and new capital is needed. With that, I'll let Jerry walk through our performance for the quarter. This is Jerry Baglien, like Rich mentioned, I'm the CFO and the COO for FBRT. In Q4, FBRT generated distributable earnings of $38.8 million or $0.37 per fully converted share. A walkthrough of our distributable earnings to GAAP and income can be found in the earnings release, definitions are at the far back as well, if that's helpful. Deal flow in the broader market continued to be lower during the quarter, but we selectively originated $209 million in new commitments. And our total real estate securities this quarter increased to $457 million with $221 million in CRE CLO bonds, and $236 million in remaining ARMs. Subsequent to the end of the quarter, we paired this back a little bit and we sold $128 million of the CRE CLO bonds, and another $98 million of the ARM bonds both at slight gains in the first quarter. We view our leverage position as a structural highlight with net leverage ending the quarter at a very conservative 2.5x, and on a recourse leverage basis, much lower at 0.68x. While we received a benefit from buying back shares and retaining capital from overearning our fourth quarter dividend, our book value declined modestly to $15.78 and this is mostly a result of the CECL reserves and some non-cash mark-to-market on the remainder of that ARM portfolio. Moving on to Slide 6, you'll see we had our third consecutive quarter of distributable earnings growth, and over the quarter we saw an approximate 140 basis point increase to SOFR and this continued to provide increases in benefits to our earnings. Moving to Slide 7, this walks you through the activity in our portfolio for the quarter and the year ended 2022. We received $247 million in loan repayments in the fourth quarter, and we transferred out $82 million in foreclosures or deed in lieu of foreclosures. For the year, our total commitments grew by $1.1 billion or 23%, and we ended the year with total commitments of $5.9 billion. Regarding our REO, we added two new positions this quarter in addition to part of the Walgreens portfolio. Our watch list is composed of five loans, four of those are rated a 4 and Walgreens, which is rated a 5. Our watch list loan balance represents 4.2% of our portfolio, and Mike will touch on the watch list assets in a little more detail later. Our financing sources are diversified and as Rich mentioned, over 78% of our financing on our core book is non-recourse and non-mark-to-market, and this further demonstrates our conservative posture and an ability to withstand continued market volatility. As Rich mentioned previously, we ended the quarter with $1 billion in total available liquidity, and this is a combination of cash on, hand available CLO reinvest and capacity on our warehouse lines that we can access. I'm Mike Comparato, Head of Commercial Real Estate at BSP, and I'm going to start on Slide 12. Our commercial loan portfolio consists of 161 loans, of which 99% are senior mortgages and 98% are floating rate. Similar to last quarter, office exposure continues to be a focal point for the market and one I want to further expand on. After quarter end, our second largest office loan was repaid in full. Our traditional multi-tenant office exposure, when excluding this loan and the loan that just repaid, is only 5.2% of the total portfolio and has an average loan exposure of only $23.9 million. Moving to Slide 13, this shows our activity specifics for the fourth quarter. As we have discussed for several quarters, negative leverage continues to be an issue and one that may not resolve itself quickly. Transactional deal flow on tighter cap rates assets continues to be limited, although we have seen a meaningful increase in deal flow for the first six weeks of the year versus the fourth quarter, and I'm pleased to say we have the largest forward pipeline that we have had in almost six months. Finally, on Slide 14, we have five loans on watch list and three positions as REO as of December 31. Jerry already talked about the REO, but I will provide a little more detail on the Walgreens REO and our watch list. On the two loans that were added to watch list this quarter, both were assigned a loan risk rating of 4. Those were a CBD office complex and CBD limited service hotel, each with a carrying value under $40 million. However, through today we have foreclosed on 13 of the properties and expect to foreclose on the remaining 11 this year. Just thinking about the portfolio at $5.3 billion and your leverage at 2.5x, as we look out to 2023 for modeling purposes, do you think that the portfolio will remain roughly static, maybe in the range of $5 billion to $5.5 billion? We think we have a lot of tailwinds coming our way both in terms of SOFR, and then specific to our portfolio with the resolution of the hotel and hopefully the resolution of the Walgreens portfolio. And historically, I think if you look at us as a platform, we've been opportunistic in times of dislocation. And as opportunities present themselves through this marketplace, we very much would like to expand the balance sheet if the right credit and returns present themselves. So, I think we're clearly very happy with where we are today at dividend coverage. And can you roughly quantify in terms of the impact of, I guess -- you've given -- gone through the ratings, but let's just think of it from an accrual, what is accruing and what is non-accrual. And if all of those were to be resolved and that capital deployed, how much impact would that have roughly on, not so much EPS, but I mean, just what -- I guess what percentage of your 5.3 portfolio is not earning you anything on a run rate basis today? Now, the only caveat I'd add there is, we still get rents on Walgreens, so there's some contribution there, but it's obviously not commensurate with the returns that we would earn on our normal loan portfolio. I think you put your finger on it, because we've always given a range of leverage that could go a little higher than 2.5. But with all the debt capital that we have, I mean, think about it, the Brooklyn Hotel has been in bankruptcy for years, just completely unproductive capital that hopefully will come to life as Jerry is describing, plus the cash we have. But you've got some tailwinds and you've got some, let's just say, underutilized capital in those couple of assets. I think it's a mix of repeat borrowers, repeat brokers as well as some new clients. And typically, that's three buckets: high net worth individuals, smaller funds, and then syndicated equity positions. So if you look at our forward pipeline, it just very much reflects the existing portfolio and the borrower structures there. In terms of what it looks like, we're seeing a lot of really interesting opportunities on the construction loan side of things. And then as a follow-up to that, I'm assuming the construction loans are kind of the same mold that you guys like Southeast, Southwest, multi-family, industrial. Just from an operational standpoint, as you know, we run two equity platforms here as well, both the multi-family REIT as well as the Franklin Templeton value add equity portfolio. And because of how solid our balance sheet is, how much liquidity we have, we don't feel like we need to be forced sellers in what is an overall difficult environment. But I think, we're not in the business in this vehicle of owning commercial real estate for an extended period of time."
}