{
    "symbol": "FBRT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 12:53:04",
    "content": " After today's presentation, there will be an opportunity to ask questions. With me on the call today are Richard Byrne, Chairman and CEO of FBRT, Jerome Baglien, Chief Financial Officer and Chief Operating Officer. Michael Comparato, Head of Commercial Real Estate, and Roy Kim, Managing Director of our Capital Markets Group. Before we start today's conversation, I want to mention that some of today's comments from the team are forward-looking statements and are based on certain assumptions. The company assumes no obligation to update any statements made during this call, including any forward-looking statements, whether as a result of new information, future events, or otherwise, except as required by law. Additionally, we will refer to certain non-GAAP financial measures which are reconciled to GAAP figures in our earnings release and supplementary slide deck, which are available on our website at www.fbrtreit.com. So for this call, we're going to review first-quarter results and walk you through the current status of the portfolio. After my initial remarks, Jerry, our CFO will cover our financial highlights, then Mike will discuss the portfolio in more detail and provide some really good general market color. But first, I want to go through FBRT's current position and the progress we've made in the first quarter of 2022. FBRT produced Distributable Earnings, that's Distributable Earnings before trading and derivatives gains and losses on our ARMs portfolio of $40.1 million or $0.39 million a share. Importantly, our 9.3% ROE was attributable to our strong net interest margin, which in turn was the product of the high-quality loans we underwrote and the low cost and flexible balance sheet we have. So based on our 331 book value of 1,650 per share, this is an 8.6% dividend yield. We took a more conservative posture this quarter, choosing to hold back a bit and wait for spreads to widen. This quarter we closed on our largest deal to date, a $1.2 billion CLO, further increasing our non-recourse non-mark-to-market liability structure. Now, importantly, I want to give you an update on our residential ARMs portfolio, where Fed rate hikes have made this market very tough. As an additional update, in Q2, our progress in reducing the ARMs portfolio has continued to accelerate. In all we have sold over 6.4 billion in ARMs since we acquired the portfolio in the fourth quarter, which represents a 91% increase. Our objective is to continue the rapid pace of transition from residential ARMs to commercial loans, and we continue to be ahead of schedule. Our chief motivation for this transaction -- for this, excuse me, transition is the higher earnings potential, lower volatility, and lower historical leverage of our commercial portfolio. Lastly, I'd like to provide a quick update on the company and manager stock purchase program. B PS spent approximately $21 million, purchasing roughly 1.5 million shares of FBRT common stock. At that point, the company's $65 million program will be initiated. Before I turn it over to Jerry, I want to underscore the strong performance of our commercial real estate strategy. We are excited that the transition of our legacy, a residential ARMs assets into our higher-yielding commercial real estate lending opportunities is nearly complete. As Rich mentioned, in Q1 FBRT generated a run rate distributable earnings of $40.1 million or $0.39 million per fully diluted converted share, representing a 9.3% ROE. And that represents a yield of approximately 8.6% on our fully converted book value of 1,650. Our fully converted book value declined this quarter from 1,725 at the end of Q4. The leverage on our core book, as Rich mentioned, is 2.5 times. On Slide 7, I wanted to highlight the advantage of our floating rate portfolio for both assets and our liabilities. With the Fed's announcement of increases to short-term rates, our portfolio will see an almost immediate benefit in earnings. So if you're going from where we were at the first quarter and then increasing from there, that's how you think about this chart. So all things equal in terms of our portfolio at March 31, the first 100 points basis increase in rates for March 31 results in a $0.04 increase in our earnings per share annually. Thereafter, it's about a $0.04 incremental increase for every 50 basis points of increase. While index floors have helped insulate our earnings through the declining rate environment we've experienced the last two years, our weighted average floor is now 37 basis points. Our net portfolio growth was $319 million, bringing our core portfolio to $4.6 billion of principal balance with 166 positions. Additionally, we ended the quarter with approximately $500 million of add-on funding to take our total commitments to just over $5 billion. First, our average financing costs were 1.4% in Q1, and that compares to 1.6% in the fourth quarter. And when looking at our core portfolio, 81% of our financing is non-recourse and non-mark-to-market through our CLO financing. And as Rich mentioned, in the first quarter, we issued $1.2 billion through a new CLO, which was our eighth issuance and our largest to date. FL8 was on the heels of FL7, which we issued in the fourth quarter, a $900 million CLO. In consent with the volatility we're seeing in capital markets, the pricing of new CLOs today is meaningfully wider than what we did on those, giving us a clear advantage on a go-forward basis with a large portion of our liabilities priced well inside current market levels. Turning to Slide 11, we can discuss the ARM portfolio. As Rich said, there has been substantial market volatility during our first quarter, with the Fed announcing an end to quantitative easing and their intentions to raise interest rates via series of hikes. As of 3/31, the market value to ARMs portfolio stood at $1.9 billion compared to $4.6 billion at December 31st. Looking at Slide 12, you can see that we've had continued progress in slowing down the portfolio in the second quarter. In the second quarter so far, the company has experienced losses of $6.9 million net of hedging related to the ARMs security portfolio. It's driven by changes in value, in addition to pay down, sales, and hedging. With that, I'm going to turn it over to Mike and he can give you an update on what we saw in the market during the first quarter. The portfolio consists of 166 loans, of which 99% are senior mortgages. The portfolio is largely MultiFamily, with 72% of the book allocated to that sector. Towards the end of the quarter, we elected to ramp up our originations and have a robust forward pipeline today and some of the most attractive spreads we've seen in years outside of the early days of COVID. We witnessed one of, if not the largest percentage increases in new treasury rates in my career during the quarter. While we did believe the direction was going to be higher, the velocity of the move back to slightly above 3% was remarkable and unexpected. As a result, low cap rate assets are now experiencing negative leverage in both the floating rate and fixed rate debt markets. As I mentioned last quarter, we are actively looking to increase exposure to non - MultiFamily assets if we can achieve what we believe to be the correct risk adjusted returns for those asset classes. We're very pleased with our decision several quarters ago to focus origination on higher quality, newer vintage MultiFamily assets, and strong primary markets. We believe in a MultiFamily valuation pullback, higher quality, newer vintage assets, and primary markets will be less volatile, have stronger value retention, and be more liquid. At the end of the quarter, we only had one loan with a  rating and overall believe the credit quality of the current portfolio to be very strong. I was wondering if you could give us some thoughts on feedback in terms of market reception to higher rates and assets like MultiFamily, if you're starting to see those lending rates being pushed higher, if the markets pushing back or accepting them. Value-add buyers continue to believe that they can add value through the renovation programs, but I think the very different change is now they're experiencing negative leverage to a pretty meaningful extent through that renovation and transaction -- transitional period. And then how should we think about the roughly $0.5 billion of commitments that remain outstanding in terms of draw down schedule, or timing? So, Jerry, you want to -- I know last quarter we did $65 million approximately. I mean, we see a general range of call it $45 million to $75 million, depending on how quickly the projects move through. So thinking about how spread out that is, that's obviously over the course of a couple of years that you're actually going to deploy that. There's always some portion of that, that never ends up being deployed, based on how business plans actually get executed. And I would add to that, that there's a decent amount of that future funding is in our construction loan, MultiFamily construction loan business. In terms of the collateral mix of origination activity in the first quarter, the surprise is the industrial in there, given the appreciation for that asset class right now. I would say, generically, we are trying to look for non - MultiFamily assets. So we're looking to add industrial, retail, certainly hospitality, and we're also looking to do some more non-conventional stuff; condo inventory loans, condo construction loans. If you'll allow me, I have some specific questions, but I'd like to just make a brief comment about the agency MBS market. We've been receiving -- since we launched coverage on FBRT, we've been receiving a lot of inquiries and questions from customers about the ARMs portfolio and the fair value losses. And I can say to anyone who is concerned about the ARM losses and how they might have been avoided, we basically are seeing every one of these companies down 10% to 20% in book value in the first quarter. And just this morning, one company mentioned they're down another 13% in book just in the month of April. Gosh, you can always talk about hedging this or hedging that, but we're in -- this is the reality of the world in the residential agency MBS base, that there are fair value losses broadly. Turning to the real business and the future of FBRT and why JMP was interested in picking up coverage, I'm curious on Mike's comments as far as opportunities to widen spreads. Generically, MultiFamily today, I think is around 350 over. -- into some of the more non-traditional asset classes, as I mentioned, some condo inventory loans, you can see 78 handle on the spreads. And I think I mentioned on our last call, we definitely did not see that going higher and hope that we will be able to pair that back by finding other opportunities. Obviously, Franklin's program does benefits -- provide support for the stock in the market, but has absolutely no impact on your balance sheet or your book value per share. Once that's completed I guess, then management and the board has to decide what to do about the $65 million and that will obviously impact your balance sheet. Well, first of all, we have about another slow more money to go on our $35 million purchase program through the advisor, as you said, Franklin or Benefit Street Partners. After that, it's $65 million from the company, just to bring everybody up to speed. Hopefully it won't be, but we think it's an important support mechanism. We just brought the company through the merge -- the reverse merger broader public, and wanted to have as much firepower as possible to take out any kind of technical factors that could impact our stocks. Those shareholders consisted of the legacy shareholders, most of it retail, and about $400 million that we raised ourselves through the institutional market. So our expectation is that it's stickier, maybe even a little less fickle than retail can be sometimes. But we've -- even while we were private, we treated this company as if it we're a public company. We've been pretty consistent in our performance, in our message, and hopefully our shareholders will be with us for a long time. Well, I think the retail guys, they're focused on that dividend. And I think as long as you maintain or even grow the dividend, they're going to be happy campers, I would expect. Listen, thank you all for your comments this morning and we look forward to doing this again on your second quarter call. So this concludes our question-and-answer session, and I'll turn the conference back over to Lindsey Crabbe for any closing remarks. Thank you for attending today's presentation, and you may now disconnect."
}