{
    "symbol": "LMNL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-17 16:08:04",
    "content": " Iâ\u0080\u0099d like to remind everyone that we will be making forward-looking statements today during the webcast, including remarks or current expectations concerning future developments of the pipeline, the properties of our product candidates and the timing of initiation or nature of preclinical and clinical trials and potential therapeutic areas, all potential of our programs to address significant unmet medical needs, our regulatory plans, financing plans, our company, our financial position, including our expected cash runway, our ability to actively seek and closing opportunities to monetize noncore assets or to continue or comply with Nasdaq listing rules and possible changes in the industry and competitive environment. These statements are subject to risks and uncertainties, including those contained in our updated reports that we file with the U.S. Securities and Exchange Commission or SEC and Canadian securities commissions from time to time, including our annual report on Form 20-F and 6-K containing our press release of the results of the fourth quarter and year ended December 31, 2022, each of which we have filed with the SEC and on SEDAR that could cause actual results to differ materially from those contained in the forward-looking statements. Research and development expenses from continuing operations was $15.3 million for the year ended December 31, 2022, compared to $18.3 million for the year ended December 31, 2021. Administration expenses from continuing operations decreased $14.1 million from $31.9 million in the comparative period to $17.9 million for the year ended December 31, 2022. Finance costs from continuing operations decreased by $5.3 million from $6.3 million in the comparative period compared to $1.1 million for the year ended December 31, 2022. Net loss from continuing operations, net of taxes, decreased by $16.1 million during the year ended December 31, 2022, compared to the corresponding period in 2021. Total income from discontinued operations, net of tax, decreased by $27.1 million during the year ended December 31, 2022, compared to fiscal 2021. Net income was $0.6 million for the year ended December 31, 2022, compared to net income of $12.2 million for the year ended December 31, 2021."
}