{
    "symbol": "ZBRA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 13:25:33",
    "content": " In Q1, adjusted net sales increased 6.1% including the impact of currency and acquisitions, and 5.4% on an organic basis, as we successfully secured a greater supply of mobile computers and data capture products than we had anticipated. First quarter adjusted EBITDA margin was 19.9%, a 540-basis-point decrease from the prior year period, primarily due to negative gross margin impact of unprecedented supply chain costs. We anticipate Q2 adjusted EBITDA margin to be between 20% and 21%, which assumes gross margin contraction from the prior year due to unfavorable sales mix and expected premium supply chain costs of $60 million, which translates to an approximately 260-basis-point detrimental margin impact as compared to the prior year period. We now anticipate full year 2022 adjusted EBITDA margin of approximately 22% to 23%, which is 1 point lower than our previous guide due to our revised expectation of supply chain costs, which are $60 million higher than the impact we realized in 2021. We now expect our free cash flow to be at least $800 million for the year, which we have reduced due to the increase in expected supply chain costs, as well as the anticipated increased use of working capital due to the timing of sales and inventory replenishment. So very complementary product offerings, very complementary go-to-market activities, where we are leveraging our channel centricity and able -- we are able to bring that expertise to Matrox to help accelerate their growth\n Perhaps, the only thing I’d add on the go-to-market side is that, recruiting channel partners is the primary thrust for developing the go-to-market opportunity, but we also see a good opportunity in bringing machine vision applications to our existing large customers. So we did see a decrease in inventory here in the first quarter as we were able to ship more than what we had expected driving the sales in Q1 ahead of our guide and that is the expectation for the remainder of the year is that we would slowly build back inventory both from a strategic reserve WIP at our Tier 1 and Tier 2 suppliers, as well as ultimately building back our finished good stock in our own warehouses."
}