{
    "symbol": "BY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 14:13:10",
    "content": " Good morning everyone, and thank you for joining us today for the Byline Bancorp first quarter 2022 earnings call. Thank you, Brooks, good morning, and welcome everyone to our first quarter earnings call. As this our normal practice, I’ll start by walking you through the highlights for the quarter, and then pass the call over to Lindsay who provide you more detail on our quarterly results before opening up the call for questions. During last quarter’s call, we mentioned that the momentum we had in 2021 would carry-forward into the first quarter 2022. Notwithstanding the fact that the first quarter turned out to be one of the most volatile periods we’ve seen driven by continued elevated inflation, a more aggressive response from the Fed than expected and the challenging situation in Ukraine, we delivered excellent first quarter results. First, we had terrific loan growth during the quarter, which was in part aided by lower pay of activity and higher line utilization. All that said, we’ve been in this business too long to think the credit and or operating environment will always be so benign. Pre-tax pre-provision revenue was at $33.6 million, which puts our pre-tax pre-provision ROAA at a robust 203 basis points, up 74 basis points from the previous quarter and essentially flat on a year-over-year basis. Revenue for the quarter came in at $78.2 million, which was a bit lower linked quarter, but up 8% from the year ago period. This was the fourth consecutive quarter or very solid loan growth that culminated with loans, again excluding PPP growing by $915 million or 24% on a year-over-year basis. We originated $325 million in loans for the quarter up from $280 million the prior quarter, and benefited from lower than expected payoffs, strong lease originations and solid customer activity. As we saw utilization tick up by one percentage point to 54% from 53% last quarter, which contributed to commercial loan growth. Our government guaranteed lending business had another quarter of strong production with $129 million in closed loans, which as expected was lower than the fourth quarter, but up 16% on a year-over-year basis. With respect to profitability, our margin contracted 15 basis points to 3.81% from 3.96% last quarter. If we exclude accretion and PPP fees, which are both not material for us at this stage are margin declined by five to 6 basis points, and remains in the top decile for banks our size. Of note, this quarter was a nice pickup in our wealth management fee income, which increased by 36% on a year-over-year basis. The balance between revenue and expenses remained well managed with our efficiency ratio coming in at just under 55% for the quarter and improving both against last quarter and the prior year, asset quality results were very strong for the quarter. Credit metrics were solid across the board with NPLs, NPAs and charge-offs continuing to decline quarter-over-quarter in both dollar and percentage terms. Given the strength of the balance sheet, we believe we’re well positioned to continue support organic growth and best in the franchise and return capital to shareholders. And with that, I’d like to turn the call over to Lindsay who provide you more detail on our results. Our total loans and leases were $4.8 billion at March 31, an increase of $227 million or 20% annualized from the end of the prior quarter. While macroeconomic conditions may pose a heightened level of uncertainty, we are reaffirming our loan and lease guidance towards the higher end of our range with projected high single-digit growth for the year assuming normalized payoff activity. At March 31, the on balance sheet SBA 7(a) exposure was $478 million approximately $15 million higher than at the end of the prior quarter with $92 million being guaranteed by the SBA. The USDA on balance sheet exposure with $65 million, flat from the end of the prior quarter of which $26 million is guaranteed. As a result, we’ve slightly decreased our allowance as a percentage of the unguaranteed loan balance to 7.4% from 7.8% at the end of the prior quarter. As expected our total cost of deposits remain flat at 8 basis points, with rates expected to rise we would anticipate deposit pricing pressure at some point later this year. Our net interest income was $58.7 million for the quarter, a decrease of 4.8% from the prior quarter. Net interest income on a year-over-year basis increased 12.3%, as a result of replacing PPP loans with organic loan growth. On a GAAP basis, our net interest margin was 3.81% for the first quarter down 15 basis points from the last quarter, but up 4 basis points from year ago period. PPP interest and net fee income combined contributed $2.7 million to net interest income for the first quarter, compared to $4.5 million from last quarter. Looking forward, our GAAP margin will be impacted by the $1.3 million of remaining net processing fees from PPP, which we expect to be recognized over the remainder of the year. As a result of the rising rate environment, our asset sensitive profile and our organic growth we believe our net interest margin, excluding accretion and PPP will begin to expand during 2022. And we estimate that an instant, 100 basis point increase in the interest rates will result in an additional 8.5% increase in net interest income and to break it down further every 25 basis point increase would result in approximately $4 million to $5 million of additional net interest income on an annualized basis. In the first quarter, our non-interest income increased 2.2% from the prior quarter. We sold a $102.3 million of government guaranteed loans in the first quarter, an increase of 38% from the year ago period. The net average premium continued to be strong at 11.6% during the quarter, which was as expected lower than the fourth quarter. Our pipeline for government guaranteed loans remained strong, and we anticipate premiums decreasing throughout 2022 and returning to pre-pandemic averages. Our non-interest expense was $44.6 million in the first quarter, a decrease of $14.4 million or 24.4% from $59 million in the prior quarter. First, we saw a decrease of $12.4 million in asset impairment charges, which were taken during the prior quarter due to branch consolidations and our real estate strategy. And second, we saw a decrease of $3.2 million in loans and leases related expenses, mainly related to the recapture of government guaranteed loan expenses of approximately a $1 million. Our provision expense was $5 million for the first quarter, an increase of 37 basis points compared to the prior quarter. We believe we continue to have a high level of total loss observancy, as measured by allowance plus acquisition accounting adjustments, which represented 132 basis points of total loans and leases excluding PPP loans at March 31. Of note, the rapid rise and rates resulted in an unrealized loss on an available for sales securities that combined with share repurchases, common and preferred dividends, net of the bank’s earnings resulted in a $0.99 reduction in tangible book value, a 5.6% decline. While the outlook is complicated by geopolitical uncertainty, high inflation and the corresponding forecast for aggressive tightening by the Fed, we’re well positioned to tackle both the challenges and opportunities this environment creates. Despite the potential macro headwinds, we’re optimistic on the outlook for the rest of the year. Our business is well diversified and our bankers are focused on growing new and existing relationships, which should translate into growth in loans and deposits. In closing, I’d like to shout out to our employees who once again, enable our strong performance through their commitment to clients, dedication, and hard work. And with that, Emily let’s open the call up for questions. Maybe just start off just on the deposit growth in the quarter, obviously super impressive to see that conjunction with a really strong loan growth as well. Yes, Nate, I think it’s fair to say. So, I think it’s a fair statement to say is probably a combination of all. So Nate, I don’t typically give guidance on exact percentages that the NIMs really an outcome more so than anything else, but we do think it’s going to expand. And so we do – we did give guidance in my prepared remarks around every 25 basis points, reflecting $4 million to $5 million of additional NII. So the next quarter it’ll be a little slower and then it’ll pick up because as you could see in the disclosures on that new slide that we added in the deck, you can see that really, that the bulk of the portfolio does reprice after the 100 basis points there. So, I think that there’s enough there to give you a good sense on a core basis, what it should look like. Nate, and to add to what Lindsay said, we also obviously the tightening that happened in the first quarter came very late in the quarter. So obviously we didn’t benefit hardly, but we saw any type of hardly a benefit this quarter from rising rates. So, we feel pretty good about where the margin is today, and as you know relative to our peer group our margin is pretty strong and we think we’re well positioned for pricing rates. And then just maybe turning to the government guaranteed lending segment, volumes were up nicely last year, they’re up year-over-year versus the first quarter of last year. And so we really think that the pipeline’s very robust right now, and it looks good. So we’ll see, but right now, the pipeline’s robust and we feel really good about our team’s ability to execute and continue producing. Hey, good morning everyone. Yes, I’m curious if we could take a minute to hear and talk about loan growth in general. I’m just trying to think about loan growth in general here like, you achieved basically half of your annual outlook. Well, I think the first quarter we have very muted payoffs Ben, so I think you got to take that into effects, in terms of our guidance. So again, assuming normalized payoffs, as I said, in my remarks, we think it’ll be at that high single digit number for the year. I think Ben also just to also add to that, I think in terms of kind of, we don’t know yet the impact that rising rates. I think it’s our sense is that there’s going to be an adjustment here at, over the course of the year as borrowers, particularly on the real estate side is where we kind of see probably more potential in the short run as borrowers just adjust to higher rates. We don’t really have a good sense of, we don’t have any view on that. First off, I’ll just reiterate what Nate said. Maybe my first question Lindsay, I think you just said you expect higher deposit costs later this year, which I think we all on the call would agree with. Have you had to adjust rates and I guess, the underlying kind of thesis, but behind your comments was just expectations that rates go higher and at some point the market will change in Byline will need to react. In terms of the market right now, we’re not really seeing a lot of competition and price adjustments going on at this point in time. But right now we’re definitely seeing that lag and we anticipate seeing the lag here for the near future as we head into the remainder of 2022, that’s where we think we’re going to see some pressure. I think it’s a combination of both Terry, I think certainly the environment you have cost of raw materials going up I mean even, with inflation and a lot of our customers being able to pass on to customers in the form of higher prices, ultimately finish goods that translates into ultimately higher receivables, right, for the same number of units. So there’s no question that higher inflation plays part in the sense that inventories are rising as a result of that, receivables rise as a result of that. But also to the second point that you bring up, it’s also driven by customer activities. So, I think it’s a combination of both. I’m just trying to interpret that second to last bullet on Slide 13 just based on M&A pricing expectations, as well as just the cost to bring on new teams. Team lift outs are, our view as team lift outs are always and I think in the past and I think this is a question that was asked just now is anytime that we have an opportunity to really attract talented bankers to the organization, we are going to take advantage of it. It’s just, and we think we have a great platform. So we always want to drive organic growth and team lift out is something, that we’ve been able to prove in the past that, that has translated well for us and for our shareholders. Hey, good morning everyone. As we said, in our prepared remarks, we don’t think that this is something that will stay forever. And that’s something that we’re looking at and on top of, but I do think that the provisioning going forward, Damon’s going to be a function of loan growth here in the near term. So, I do think that, we’ll continue to provision here as we go forward and grow. And then in terms of charge-offs, I do think you can look back historically at some point they are going to go back to those historical averages. And so we’re, obviously didn’t see a whole lot this quarter and the credit outlook right now is great, but we don’t anticipate that lasting forever. It was down this quarter, so we do think it’ll go back up to the 25% to 27% range as we’ve guided historically. And maybe just, it sounds like, obviously the great quarter on the loan growth side and just, it sounds like the pipelines are still really strong even though, all the production this quarter. Can you just give any, a little bit more granularity on where your, where the optimism in that – in the pipeline today is, what do you expect the growth over the next couple quarters here based on what the pipeline showing today. I understand the comment Lindsay about the payoffs potentially coming, but just sounds like there’s still, a lot to be optimistic about on the loan growth front. Probably real estate is one that’s, I think the market as a whole is going through an adjustment, you’re seeing projects have to grapple with not only higher interest rates, but also much higher material costs for projects. And I think ultimately I think the market will adjust, but that’s probably where I would, in relative terms expect some weakness relative to the other. And maybe just one just on the comments about the sensitivity Lindsay, just the deposit betas you guys are thinking about. Brian, in terms of betas currently they’re lagging in near term, I think they’ll still lag. Historically we were kind of between 30% to 35% call depending on what you’re looking at any timeframe, but we look back over the history and we think that it’ll be a little slower this time, just given the liquidity that’s out there. But I did provide in my remarks to an earlier question that I do think it’s a functional loan to deposit ratios and as we see those creep up, then I think it could speed up. So it’s all those factors at play right now Brian, so we’ll see what happens, but we do think it’ll be a little slower. Now, I mean, we’re always looking to grow deposits. Yes, I mean, you’re always going to have some ebbs and flows, especially with some larger commercial customers, but nothing that I foresee that’ll swing it one way or another. Dialogue I think is very good Brian, I think it’s – a lot has changed in the quarter from where we were early January to all of the things that have transpired. Again, we seem to say this at least once a year, where we have expectations and then sure enough, things change materially, but I think dialogue is good. It’s just, I think the market in general and M&A is not any different. Thank you for your time today, your interest in Byline and we look forward again to speaking to you next quarter."
}