{
    "symbol": "BY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 16:00:26",
    "content": " Our return metrics continue to be solid across the board with pre-tax preparation income of $34.7 million, up 8.9% quarter-over-quarter and pre-tax preparation ROA of 1.93%, again up 9 basis points from last quarter. Just thinking about kind of the deposit growth outlook going forward, obviously it's nice to see some core deposits come back on balance sheet, as discussed last quarter. I just was going to add something to what Tom said, because it's -- when rate increase -- when the Fed moves rates matters, so obviously as you, if you -- we're potentially getting a rate increase here in November and potentially another one in December, so kind of factor that in, as you're thinking about the margin expanding, we do think that we're positioned for that here in the fourth quarter. I think it's -- we want to obviously continue to see a balanced approach, meaning, our philosophy is we want to fund the loan portfolio with deposits and having multiple strategies and multiple ways in which we can continue to sustain solid growth and quarter process as part of our strategy and part of what we do to continue to grow the bank accordingly. We'll see if the Fed stops here in December and what's pauses and make some assessment before deciding what to do next or if they continue to raise into the fourth, the first quarter of next year, so obviously Fed dependent, but at some point, what you're describing is probably the right way to think about it at some point the margin will peak for us probably and again Fed dependent. Obviously it's a holiday season coming up, so things do slow down a bit, but our sense is probably in the and we don't give guidance, but you were asking for some color, probably in the kind of a low $200 million range is kind of what we're expecting as far as payoffs are concerned and should still translate into kind of that mid-single-digit kind of range for loan growth at this point is our best take on it as things stand today."
}