{
    "symbol": "BYRN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 19:12:09",
    "content": " Excluding long-term stock-based compensation and one-time severance costs, our non-GAAP adjusted EBITDA was $1.4 million for this year making this a second sequential fiscal quarter with positive non-GAAP adjusted EBITDA. Taking a look now at the full year financial results, revenues for the full year increased by 13.8% to $48.0 million compared to $42.2 million in the prior year. In 2022, the company saw increases in international sales, dealer sales and Amazon sales specifically, international sales increased by $5.7 million or 164%, dealer sales rose by $1.6 million or 28.4% and Amazon's sales grew by $4.6 million or 522.5%. Obviously, this is significantly lower than the $56.4 in the balance sheet at the end of 2021 after having raised $56 million from the sale of 2.8 million shares of common stock in the third quarter of that year at $21 per share. Our accounts receivable balance of $5.9 million was $4.3 million higher than the prior year end balance, mainly due to large international sales in the fourth quarter. Sales last quarter grew by 43% in comparison to the fourth quarter of 2022, while operating expenses were actually down slightly, down 1% compared to the same quarter last year. And as David mentioned, this decline in the first half the sales of 2022 was due to the $9 million spike in sales in the first half of 2021 resulting from an unexpected and frankly unsolicited endorsement from Sean Hannity on live television in April of 2021. If we back out the $9 million of Hannity effect sales that occurred in the second quarter of 2021, sales in the first half of 2022 would have been up 47% year-over-year and full year 2022 sales would have been up 45% year-over-year more in keeping with Byrna's long-term growth trajectory. Rather, we are forecasting revenue growth for fiscal year '23 of approximately 20% and accordingly, we are providing revenue guidance of $55 million to $60 million for the full year of 2023."
}