{
    "symbol": "PSX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 16:46:02",
    "content": " DCP Midstream adjusted pretax income of $31 million was down $80 million from the previous quarter, mainly driven by unfavorable hedging impacts, partially offset by lower operating costs. Marketing and other decreased $199 million from the prior quarter this was primarily due to lower marketing margins, mainly resulting from rising spot prices as well as seasonally lower demand. Specialties generated first quarter adjusted pretax income of $113 million, up from $97 million in the prior quarter, mainly due to higher finished lubricant margins. Your line is open. So that $700 million number, that’s what we view as kind of the bare minimum that we have line of sight on and we are focused on transforming the organization to ensure that, that cost reduction is sustainable and we have got about 800 people, employees and contractors working on that. Your line is open. And while that trend will not necessarily continue forever, we do feel comfortable that having a cash balance that we used to say sort of $1 billion to $1.5 billion sort of minimum cash level, we are probably looking more at a $2 billion to $3 billion level that we feel more comfortable with on an ongoing basis and it’s not that we need that much cash, but they just provide us more flexibility. Your line is open. Your line is open. I think one thing I would emphasize, Roger, just the amount of volatility that we are seeing on a daily basis with crude trading in a $5 to $10 a barrel range on a daily basis, and products, especially diesel trading in wide range on a daily basis, that average crack you see at the end of the day, there was a lot done across that period of time. Your line is open. Your line is open. Your line is open. Your line is open. And for the most part, I think we are probably right on those calls and you think about -- we started at 2012 with $450 million of EBITDA at Midstream and we are $2.2 billion, $2.3 billion today. Your line is open. Your line is open."
}