{
    "symbol": "ETRN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 13:18:06",
    "content": " Today, we reported full year 2022 results, including a net loss of $257 million, adjusted EBITDA of nearly $1.1 billion and deferred revenue of $345 million. This morning, we reported a full year net loss attributable to E-Train common shareholders of $328 million and a loss per diluted common share of $0.76. Net income attributable to E-Train common shareholders for the fourth quarter was impacted by a $5.1 million unrealized gain on derivative instruments, which is related to the contractual provision entitling E-Train to receive cash payments from EQT. Other items impacting full year results include a $25 million loss on extinguishment of debt, primarily from the tender offers we executed in early 2022, a $10 million unrealized gain on derivative instruments, a $4 million gain on sale of noncore gathering assets, and the previously mentioned $8.1 million of expenses related to the Rager Mountain storage incident. After adjusting for these items, full year adjusted net income attributable to E-Train common shareholders was $200 million and adjusted earnings per diluted E-Train common share was $0.46. For the fourth quarter, operating expenses increased by $18 million compared to last year, primarily from the $8.1 million of expenses related to the Rager Mountain storage incident and higher O&M, SG&A and depreciation. Also, based on initial estimates, we've included approximately $8 million to $10 million of operating expenses and approximately $5 million of CapEx related to the ongoing work following the Rager Mountain incident and our 2023 guidance. While we are able to estimate these expenses and capital associated with the Rager Mountain incident, based on what we know today, under scenario two with the absence of MVP forward construction and completion in 2023, the full year forecast, our CapEx and capital contributions of $510 million to $630 million, free cash flow of $270 million to $350 million and retained free cash flow of $10 million to $90 million."
}