{
    "symbol": "ETRN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 14:05:05",
    "content": " Today, we announced an impairment of $583 million, primarily on the basis of the increased timing uncertainty now present in the normal permitting path through the Fourth circuit quarter. That said, based on the hearing conducted by the Fourth Circuit panel last week regarding a challenge to the West Virginia 401 certification, it was evident that the same court panel that has consistently overruled technical conclusions of federal and state regulators more than 10x, again appeared hostile to the West Virginia Department of Environmental Protection's issuance of a permit for MVP. However, having been under construction since early 2018 and now being roughly 94% complete with total project work, the best path to complete MVP by the second half of 2023 and get off landowners' property, flow natural gas to help lower cost to consumers, while adding to our national and energy security is for Congress to pass legislation requiring the completion of the project. First, the $583 million impairment to our investment in the MVP joint venture, Second, by $117 million increase to income tax expense primarily due to a valuation allowance placed on our deferred tax assets resulting from cumulative losses that were driven by the impairment to our investment in the Mountain Valley Pipeline joint venture. Brian, I think the run rate -- the burn rate is somewhere between $20 million and $25 million a month, largely for the maintenance of the right-of-way, which -- because this court has continued to vacate permits has been remained not restored for 4 years. So even with the heightened level of, I'll call it, burn rate for MVP, we will continue to delever at a slower pace, but the free cash flow remains constant and predictable so that while we need to bring MVP into service to execute on our larger plans, there's not a deterioration because we're generating such strong free cash flow quarter after quarter."
}