{
    "symbol": "MXCT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 21:41:02",
    "content": " Ron will provide more details during the call regarding our financial results, including strong full year revenue, total revenue of $44.3 million representing a year-over-year growth of 31% in 2022. For the fourth quarter, core revenues increased 4% compared to the fourth quarter of 2021, with revenue from cell therapy and drug discovery customers growing at 4% to 5% year-over-year. We generated $1.9 million of milestone revenue during the fourth quarter and $4.6 million of milestone revenue for the full year in 2022, exceeding our full year milestone revenue guidance of approximately $4 million. The total pre-commercial partnership revenue potential for our SPL programs is now greater than $1.55 billion, up from $1.25 billion at the end of 2021, an increase of over $300 million in potential pre-commercial milestones payments. In the fourth quarter, we reported core revenue of $10.6 million compared to $10.1 million in the fourth quarter of 2021 or 4% growth, this includes revenue from cell therapy customers of $7.5 million, growing 4% year-over-year and revenue from drug discovery of $3 million, up 5% year-over-year. For the full year 2022, we reported core revenue of $39.6 million compared to $31.4 million in 2021 or 26% growth. We expect full year total revenue growth of between 21% and 26% over 2022, including core business growth of between 20% and 25% and SPL program-related revenue of approximately $6 million. In 2023, we expect to return to more normal historical seasonality with roughly a 40%, 60% first half, second half revenue split, revenues from TAâ\u0080\u0099s, instruments and milestones grow strongly as later-stage partners approach and enter commercialization, but it can be lumpy, impacting quarterly outcomes and annual seasonality as weâ\u0080\u0099ve seen in those â\u0080\u0093 and weâ\u0080\u0099re seeing those effects in 2022 and 2023. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}