{
    "symbol": "LTC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 20:35:05",
    "content": " We have locked in attractive rates for both, our long-term debt and term loans, including locking in a rate of 3.66% for our newly issued senior unsecured notes for a period of 11 years and entering into swap agreements to lock in our term loans at 2.56% and 2.69%, respectively, based on our current applicable margins for a period of 4 and 5 years, respectively. This growth was attributable to a $2.3 million increase in rental revenue, primarily due to rent received from transition portfolios and from our recently acquired Texas properties. Interest and other income increased $954,000 from last yearâ\u0080\u0099s third quarter, mainly due to a 2022 first quarter mezzanine loan origination and additional funding under working capital loans, partially offset by loan payoffs. Interest expense increased $1.3 million from last yearâ\u0080\u0099s third quarter, due mainly to the origination of term loans in the fourth quarter of 2021, the issuance of $75 million in senior unsecured notes in the second quarter of 2022 and higher interest rates, offset by scheduled principal paydowns on our senior unsecured notes. Transaction costs decreased by $3.4 million from the third quarter of 2021, mainly related to the settlement payment we made to a former operator in last yearâ\u0080\u0099s period. Net income available to common shareholders increased $2.3 million, principally resulting from loan origination, the increase in rental revenue previously discussed and a decrease in transaction costs. Regarding our former senior lifestyle portfolio for the 6 buildings under 2 separate leases with quarterly market-based rent resets, we received $80,000 in the third quarter, in line with our expectations. Regarding the former senior care portfolio now leased to HMG, we received rent of $2 million in the third quarter, which is down $500,000 from our prior projections of $2.5 million for the quarter. We also borrowed $95 million under our unsecured revolving line of credit at a weighted average rate of 3.24% and paid $23.1 million in common dividends, as Wendy mentioned. For the six communities under two separate leases with quarterly market-based rent resets, occupancy was 88% at September 30, 2022, compared with 80% at June 30 and 76% at March 31."
}