{
    "symbol": "BWMN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 14:20:04",
    "content": " At the time of the IPO, we talked about our five year strategic growth initiative, which included a 12% organic compound growth rate target and an aggressive acquisition program which when combined with the results at a five-fold growth trajectory from a $100 million of net revenue in 2020 to $500 million of net revenue in 2025. Based on acquisitions closed since our last call, and order trends weâ\u0080\u0099ve been experiencing so far in the fourth quarter, we raised guidance for the year and concurrently introduced net service revenue and adjusted EBITDA guidance for 2023, which we believe suggests as Gary indicated rational optimism about next year. Turning to the year, gross revenue for the nine months ended September 30, 2022 increased $78.1 million or 72% to $186.1 million. Based on relatively unchanged utilization rates, and a 23% growth in our core non-acquisition headcount, we estimate that approximately 92% of the organic gross to net revenue is the result of increased work suggesting roughly 8% of the growth â\u0080\u0093 of the organic growth is due to inflation â\u0080\u0093 rate inflation. The distribution of gross revenue for the quarter was roughly 63% building infrastructure, 19% transportation, 12% power and utilities, and 6% other emerging markets, which includes water resources, mining and other energy transition services. Again turning to the year, the distribution of gross revenue for the nine months ended September 30, 2022 was roughly 68% building infrastructure, 14% transportation, 13% power and utilities and 5% other emerging markets. During the year, we have reduced building infrastructure from 74% to 63% of gross revenue, while increasing transportation from 8% to 19% and emerging markets from 4% to 6%. Year-to-date, we've acquired over $50 million of annualized net revenue at an average multiple of under 6x 2022 adjusted EBITDA estimates."
}