{
    "symbol": "BWMN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 13:55:02",
    "content": " Gross revenue for Q4 was $75.6 million, which represents $33.7 million or 80% increase over Q4 last year, including organic growth of approximately 30%. Most of the year-over-year increase came from building infrastructure and transportation, which accounted for $27.8 million of the increase, split relatively equally between the two markets with transportation increasing $14.2 million and building infrastructure increasing $13.6 million. Net service billing also referred to as net revenue was $66.2 million, which represents a 75% increase over Q4 last year, including organic growth of 24%. For the year gross revenue was $261.7 million, which represents $111.7 million or 74% increase over last year, including organic growth of approximately 31%. Most of the year-over-year increase came from building infrastructure, which accounted for $65.2 million of the increase, while at the same time building infrastructure decreased as a percentage of gross revenue to roughly 65% from a little over 70% in 2021. Net service billing was $235.2 million, which represents a 74% increase over last year, including organic growth of 26%. Adjusted EBITDA for the fourth quarter was $9.4 million, an increase of $5.9 million or 169% as compared to the fourth quarter of 2021. For the full year adjusted EBITDA was $34 million, an increase of $17.5 million or 106% as compared to 2021. On December 31, we had $243 million of backlog, which was comprised of roughly 50% building infrastructure, 31% transportation, 14% power and utilities, and 5% emerging markets including water resources, mining, and energy. We estimate that at any given time, approximately 85% to 90% of our backlog will turn within a 12 month period, meaning nearly $200 million of 2023 revenue was already booked at the beginning of the year. We expect to continue being acquisitive this year, employing a similar capital allocation strategy for acquisition, and we endeavored outpace last yearâ\u0080\u0099s acquired annualized revenue at closing of roughly $60 million. Brent, please go ahead. Brent, please go ahead."
}