{
    "symbol": "CARR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 13:24:14",
    "content": "  Operator: Good morning, and welcome to Carrier's First Quarter 2022 Earnings Conference Call. This call is being carried live on the Internet, and there is a presentation available to download on Carrier's website at ir.carrier.com. I would like to introduce your host for today's conference, Sam Pearlstein, Vice President, Investor Relations. Thank you, and good morning, and welcome to Carrier's first quarter 2022 earnings conference call. Except as otherwise noted, the company will be speaking to results from operations, excluding restructuring costs and other significant items of a non-recurring and/or non-operational nature often referred to by management as other significant items. The company reminds listeners that the sales, earnings and cash flow expectations and any other forward-looking statements provided during the call are subject to risks and uncertainties. Carrier's SEC filings, including Forms 10-K, 10-Q and 8-K, provide details on important factors that could cause actual results to differ materially from those anticipated in the forward-looking statements. Once the call is opened up for questions, we ask that you limit yourself to one question and one follow-up to give everyone the opportunity to participate. With that, I'd like to turn the call over to our Chairman and CEO, Dave Gitlin. Thank you, Sam, and good morning, everyone. Q1 was another strong quarter for us, and I am proud of how our team continues to execute in the face of global challenges. We delivered 12% sales growth, excluding the impact of Chubb. Adjusted operating profit was up 7% compared to last year and up high teens, excluding the impact of Chubb. Free cash flow was a larger-than-expected outflow in the quarter, mainly due to supply chain shortages impacting inventory levels. We remain focused on the priorities that you see on Slide 3, above-market organic growth, margin expansion, strong free cash flow and disciplined capital allocation. This slide summarizes our value creation framework as presented at our recent Investor Day, which not only forms the basis for our updates to our investors but also drives our priorities via our internal goal alignment process. From our world-class operations in our Singapore container factory to the tremendous innovation from our colleagues in Hyderabad and New Delhi, to the discipline and energy in our sites throughout Poland, it was encouraging to see the power of focus, culture and talented empowered teams coming together to provide solutions for our customers. On healthy indoor environments, we saw $125 million worth of orders in Q1, and our healthy buildings pipeline is now $850 million, up more than 20% sequentially from the fourth quarter. As an example, our low GWP heat pump chiller orders in Europe were up over 30% in the first quarter. Electrification is equally critical in transport refrigeration, where we recently added Woolworths, Australia's largest supermarket chain. In terms of digitalization, our key focus remains on rapid adoption of our Abound and Lynx platforms. We've incorporated energy monitoring and alert reporting capabilities into our Abound platform and achieved key wins across verticals, including education, retail and industrial. For example, within the Abound platform, our CORTIX solution recently won several key awards, including the 2022 Artificial Intelligence Excellence Award organized by the Business Intelligence Group; and the AI Breakthrough Award's 2021 Best Predictive Analytics platform. CORTIX offers predictive insights and autonomous actions to optimize equipment performance and building operations, and is currently connected to over 300,000 pieces of building equipment from multiple OEMs. We have also expanded our Lynx capabilities, including asset tracking, prognostics and temperature alarms, and we remain on track to have 100,000 Lynx subscriptions by the end of this year. We remain confident that the increasing middle class will continue to drive demand for our products in countries such as India, where income levels are increasing and penetration levels of our portfolio of solutions remain low. In addition to the tailwinds from these secular trends, we continued to accelerate growth in our core businesses through innovation and differentiation, which you can see on Slide 5. After releasing 21 new products in Q1, we remain on track for more than 125 new product introductions in 2022. Our innovation pipeline is centered around our core strategy of healthy, safe, sustainable and intelligent building and cold chain solutions. (inaudible) recently led Honeywell Aerospace's 10,000 engineers and previously held critical roles at BorgWarner and Bosch. Another critical growth driver for us is aftermarket and recurring revenues, which you see on Slide 6. After 11% growth in 2021, aftermarket sales were up high single digits in Q1. Across Carrier and within each segment, we have detailed KPIs across the vectors that you see here: parts capture; service coverage; digital solutions; and healthy and sustainable offerings. We remain committed to delivering on our full year KPIs, including having 70,000 chillers under long-term agreements and 20,000 connected chillers by year-end. At our Investor Day, we committed to over 50 basis points of margin expansion per year with 2022 projected to be closer to 75 basis points, and we exceeded that in the first quarter, growing adjusted operating margins by 110 basis points. Related to that productivity improvement, we are very purposeful about building a more resilient supply chain and we are tracking to our commitments around dual sourcing of critical components and increasing factory automation. Thank you, Dave, and good morning, everyone. As expected, reported sales were down due to the Chubb divestiture. Organic sales growth was better than our high single-digit Q1 guidance, with all segments growing organically. Residential and light commercial HVAC growth was stronger than expected, with resi up over 20% and light commercial up over 30% compared to last year. Productivity and higher JV income also contributed to strong adjusted operating profit, which was up 7% compared to last year despite lower reported sales. Core earnings conversion, excluding the impact of price/cost, was well over 50%. Adjusted EPS of $0.54 was also better than the guidance we provided in February given stronger sales, margins and a lower share count. For your reference, we added an adjusted EPS bridge in the appendix on Slide 19. We still expect to generate $1.65 billion in free cash flow for the full year, but this will be more back-end loaded as we expect supply chain conditions to improve in the second half. HVAC organic sales were up 18% driven by continued very strong growth in residential, light commercial and our ALC/Controls businesses. Within Commercial HVAC, Applied and Controls grew double digits. Adjusted operating margins were up 120 basis points compared to last year, mainly due to volume leverage and mix. Organic sales were up 1% in the quarter, a bit lower than expected due to supply chain challenges mostly affecting truck and trailer. As expected, container was down mid-teens compared to a record quarter last year. Commercial refrigeration was up mid-single digits, driven by solid growth in EMEA, and Sensitech continues to do well and was up double digits. Adjusted operating margins were down 130 basis points compared to last year, mainly due to lower volume and price cost. Excluding Chubb sales from the first quarter of 2021, Fire & Security segment sales were up 8% with strong broad-based growth this year. Adjusted operating margins expanded 160 basis points in the quarter, mainly as a result of the Chubb divestiture. Price/cost was neutral in this segment, better than expected. As expected, Residential HVAC orders were down modestly in the quarter, with Light commercial orders about double last year's levels. Commercial HVAC orders also remained very strong, with backlogs for this business up over 30% compared to last year. Order intake for our Fire & Security products remain very healthy, up about 20%. As you can see on the right side, we saw continued strong orders growth in all areas of the world. Order strength continued in all regions in April, with the exception of China, which was down year-over-year. We collected $2.9 billion from the Chubb sale, repurchased about $740 million worth of shares and paid down $1.15 billion worth of debt. In addition, we announced the acquisition of our JV with Toshiba for about $900 million. Total debt reduction for 2022 remains $750 million, consistent with what we shared with you in February at our Investor Day. But with just 1 quarter behind us, we are maintaining our guidance for organic sales growth, adjusted operating margin, adjusted EPS and free cash flow. From a calendarization perspective, we expect the lockdowns in Shanghai to impact Q2's sales by about $100 million, mainly in commercial HVAC and truck and trailer as both businesses have a manufacturing footprint in that area. This assumes businesses open up in the next few weeks, and we currently do not expect this to impact our full year. With that, I'll turn it back to Dave to Slide 15. Our backlog gives us confidence about continued strong growth, and the team continues to overcome unexpected macro challenges to deliver results for our customers and our investors. With that, we'll open this up for questions. So I guess, just maybe first question on the commercial side, where you saw some momentum. No, I think it has a lot to do with the secular trends and some of the initiatives that we've launched. You look at K-12, our orders were up 50% in the first quarter, which is, as you know, Josh, significant. So, we're starting to see SR2 and SR3 funds being released in K-12, and that's encouraging. Controls was up north of 20%, which has been a big focus area for us. And then when we look more broadly at the underlying business itself, we now have seen, I think, 14 straight months where ABI was north of 50%. So, orders continue to be very strong. So, when we look at ALC, Controls, aftermarket trends, healthy buildings where the pipeline is now at 850 and then K-12, a lot of these underlying trends that we've talked about are dropping through. And then just on the resi business, we're kind of price-on-price-on-price at this point in terms of the marketplace. Inventories are at healthier, if not a little higher than usual. What we are seeing is, I guess really, record levels of price realization. We said that resi for us in the first quarter was up over 20%, more than half of that from price. And by the way, we have to because of the input costs that we're seeing. So really, what we're doing is dealing with the inflationary pressures we have through trying to stay out in front of it through price increases. But clearly, for resi, we watch movement very carefully. That was generally in line with field inventories, both up kind of in that low single-digit range if you focus on splits and furnaces. And orders were down modestly, but we expected that orders have been fine here in April. And then, of course, as we get into the back half of the year, we'll have to see how the switchover takes place as folks gear up for the 2023 introduction. So clearly, Q1 was better than we expected at neutral versus negative. I'd say that for the full year, you do recall, we said $1 billion price, $1 billion inflation. Based on the current quarter and what we're seeing, it is likely that will do a little bit better than the $1 billion. Frankly, with all the price increases we've announced, we have -- we're on the -- on track for that $1 billion. It could be a little bit better than $1 billion, but at the same time, we've seen some of the input costs come up as well. And so for the time being, we continue to target price cost neutral for the year, but we understand that pricing will be likely a little bit higher than $1 billion, and so will inflation. Well, Julian, our expectation is that Q1 will be the low point for margins in Refrigeration. We expect price/cost to be neutral starting in Q2, and that will help improve the margins versus where it is today, where it's a more significant headwind. Since -- frankly, since the second quarter of last year, price realization has improved every quarter and price realization in Q1 was almost double of what it was in Q4. So, I believe -- we believe we're on the right track there. One of the commentaries referred from the channel is that the reason the distribution is comfortable carrying as much inventory as it does right, is because the floor financing is pretty cheap. That has not been a major focus area for our discussions with our -- not only our distributors, but our dealer channel as well. So, I know there's sort of this general anxiety about residential. And what they're seeing is generally a strong consumer, the same trends that drove a 10% growth 2 years ago, drove 20% growth last year, drove north of 20% in the first quarter, generally continue. We had probably about 100 bps of share gains in the last year or so, and that continued in the first quarter. The challenge we have is that the higher end you get, the more chips you rely on, and that's where we've struggled on the supply chain side. I think the biggest discussion we have is not as much around interest rate impact, but it's just more around the switchover and the cutover that's going to take place in the second half of the year as we gear up for the 2023 units. And especially in the South, because that is such an unprecedented move where it's date of installation. And we -- that's going to be the switchover that is unprecedented and that could be great news as we get into the second half, it could not be. The good news is that Chris and Justin are completely tied in on a daily basis with our channel partners, and we're managing their needs as best we can. But I can tell you, I think, with confidence, we've been doing better than others and availability has helped us gain some share as well. No, that's a great answer. Well, I'll tell you, without giving you a specific number, Andrew, we are very, very bullish on the European heat pump market. I mean -- and I think that if you look at it, you look at it on the commercial side, -- we can say with confidence we're the market leader with commercial heat pumps in Europe. We're going to, of course, be -- we've added Giwee, we'll be adding Toshiba in the next few months. And it's helped by the fact that we introduced a great new product in the first quarter of last year, this low GWP air cooled chiller that we've talked about. So we're not a player, but we'll be adding Toshiba, we have Giwee. Good quarter, good start of the year. Sorry, I joined the call a little late, so I apologize if this has already been discussed. So what we said earlier was that with everything we've announced to date, we're comfortable that we'll realize $1 billion or more of price this year. And so it's likely, given our performance in Q1 that we'll do better than $1 billion this year. The good thing is with the prices we have announced, we think we're comfortable with the $1 billion -- or at least $1 billion of price realization this year. That's announced, not yet realized, of course. What I would add, Nigel, is that when we talk price, I think a lot of our investors assume we fixate on resi. Jurgen and his team in Fire & Security, Tim and his team in Refrigeration, all pushing price in a very concerted way with I would say, more effectiveness than we've ever seen in our history. So clearly, Chris and the team in overall HVAC have done very, very well on the price side, which gives us great confidence in our numbers for the rest of the year. And then that obviously implies that HVAC was positive for the quarter, if you can just confirm that. I mean, that's -- I guess the short answer is that we -- Nigel, we expected Q1 to be negative, as you said, and it was neutral. Right now, we feel very good about where we stand on price cost going through the year, but we do have to keep an eye on it and give us a few more months to see how things continue to play out. We said residential was up over 20% overall sales, more than half of that driven by price. Steve, no change for the overall year. We still continue to target $100 million -- no, sorry, $300 million of productivity, $100 million of reinvestment. I will say that last year, you may recall, the margins in HVAC were exceptionally high, I think they were almost 19%. We expect margins in HVAC to be up a little bit compared to Q1, but not to the extent that it was last year. I think these days, I don't know what normal is. Well, Q2 EPS is expected to be higher than in Q1, also because the volume -- the volumes tend to pick up in Q2 and Q3. Yes, I was looking for a little more precision there, but I guess I'll just take what I can get there. No, the current strategy is that we will be introducing the 2023 product really focused on the South starting in the next few months. So as we start getting into August, the products that they'll be receiving in the South will be the 2023 products because that's what they have to gear up to start selling right on January 1. So introduced the '23 product earlier for the South later for the North, and then we'll have to see the cut-over. We all watch inventory levels and movement levels, I would tell you, Steve, very, very carefully. So we watch inventory levels not only with our distributor partners, but also what's being stocked in the dealer network as well. We do expect year-end inventory levels be down year-over-year, depending, of course, what happens with movement in inventory over the next 6 months or so. Well, movement, we've been seeing low single digits, not 10% on (inaudible). On price, on the difference in price per unit, per unit, right, at the minimum level. The price -- yes, good point. Yes, that's the one way to look at it. So, just -- maybe just elaborate a little bit more on China. You guys mentioned in April, the orders turned negative. Well, we're watching this one carefully, Joe. We believe in China, it's part of our growth vector. We're a leader in transport, commercial fire, commercial HVAC, as you know. But the good news is that only 1/3 of our sales in China are real estate and less than 10% of that is where the biggest focus area, which has been these multifamily residential. What's happened over the last I would say, a couple of months is these lockdowns have had a significant impact on a lot of folks. We -- it's been really acute for us in Shanghai, where we have 4 of our factories in Shanghai, a couple in commercial HVAC, 1 for Riello, 1 for transport. But for us, we need to just keep -- keep heads down, being compliant and pushing for reopening, and it's also having a knock-on effect on logistics. So, we do believe it's a timing issue. Like Patrick said, it could impact us a couple $100 million or so this quarter. We do show an ability where there are shutdowns throughout COVID that we recover very quickly, and I'd expect the same to happen in China. But we really are pushing very hard for a rapid reopening in Shanghai, not only for China, but for the global market. I guess maybe one quick one, a quick follow-up on China. And then the follow-on question, just on margins. But clearly, you're off to a better start than the annual guide. Yes, I'll start with the second half of the -- of your question, Joe. We think that Q2 and Q3 margins will be ahead of Q1, and Q4 will be slightly below where we were in Q1. And as I mentioned on Steve's question, we do believe that Q2 margins may be slightly below where we were last year. And then on the decrementals related specific to China, we have really not shared what our incremental or decrementals are in that part of the world. Yes, Deane, I'll take the first one very quickly. Yes, you're right, we brought off $9 million of assets related to Ukraine and Russia. But if it is, it's going to be in the few million dollars. Keep in mind that last year when we had Chubb, it was close to 30% of our sales. And now without Chubb, it's closer to 22% of our sales. What I will tell you is that we're watching this very carefully, but Q1 orders were very strong. But obviously, with everything going on in the world, we'll continue to watch it quite carefully. And then as a follow-up, can you update us on any lost sales or past due because of supply chain issues. In the fourth quarter, I think it was $300 million to $400 million, you couldn't ship. The root of a lot of our issues, I would tell you, 2/3 of our issue are chips. So I do believe our team is doing all the right things, which gives us some level of optimism as we get towards the second half of this year into next year. The things that we're doing to help ourselves as we get into 2H are, number one, the direct relationships with many of our key chip OEMs like TI and Microchip and STMicro and those. And they're doing their best to support us where I know they have a lot of customers that are pushing on them, but we're really establishing these direct relationships. And then, we're really -- we're redesigning many of our key chips. But supplier on-time delivery and line stoppages, it's about what we've seen. But chips are not only impacting us, they're impacting our suppliers as well. I just would like to point out, it's more of a comment that, that sounds to us like some of the fastest redesign pace that we've heard that OEs are trying to do. It's something that -- it's unfortunate, honestly, because what we've had to do is reallocate engineers that we want working on new product introduction to redesigning chips; so it is what it is. I think our engineering and operations teams are doing all the right things, but this cannot recover quickly enough. Clearly, Q1, much better than you guys initially thought. I didn't hear the 16% again for the full year, but assume that probably is still in the right ballpark. As you said, good start to the year. And if I look at the margins versus where we expected it to be, volume was a little bit better in that segment, but the big driver was price/cost. So a good start to the year, but still too early for us to change our full year outlook. Clearly, there is an upward, call it, pressure in a good way to our margins in this segment, but still early in the year. And as I mentioned earlier, we're still seeing increasing inflationary headwinds. So good start to the year, better-than-expected price/cost, 16% clearly on path to do a little bit better than that, but too early for us to change our guidance. I know one quarter is tough to kind of extrapolate, but applied, you've put up some really good growth. And then 1 of your competitors on Light commercial, I guess, kind of walked away from some new build stuff. Light commercial, I think it's clear we've gained significant share, by the way, while raising prices significantly. So -- we saw, I would tell you, over 400 basis points of share over the last year or so, and that continued into 1Q. So proud of the team on Light commercial because it's been pricing, it's been operational performance, it's been innovation, it's been customer stickiness, it's been all the things that we push and the team is executing well in a strong market. And Applied is probably flattish; I think we've seen some share gains in China and North America, and Europe's may be slightly less than what we thought. But overall, I would tell you, Applied share is probably flattish in 1Q. I wanted to continue on the global applied HVAC business, so up mid-teens in the quarter, which is good to see. In the first quarter, Tommy, North America was the strongest. That was up around 20%, Europe was around 10% and Asia was around 10%. So overall, around 15% in the first quarter. We've sort of said high single digits across the board for the rest of the year, but we're going to have to keep an eye on it. The good news on Overall Applied is; Number one, the underlying trends that we talked about at the beginning of the call, the underlying demand remains very strong. ABI metrics, as we mentioned, stays very strong. Aftermarket for HVAC up over 10%, the ALC/Controls business, high margins, really differentiated product lines that doesn't get enough credit, up double digits. So a lot of strength, especially in some key verticals like data centers and warehouse, education, health care, commercial buildings coming back online. Following up on M&A, noted Toshiba is on track to close by 3Q, I think you said. And then a related point on potentially smaller scale investments, you recently announced the Venture Capital Group, and there were a couple of deals underneath that umbrella already. Well, on the first, we continue to have plenty of cash and firepower for more M&A. So we're actively working our pipeline along the lines of what we talked about at our Investor Day with a huge focus on sustainability leadership, things that relate to aftermarket and our overall trends. So if we had the right deal, could we do a deal, obviously, north of $1 billion, we certainly could and would if it made sense. In terms of our Carrier ventures, we were very excited to launch it and announced a couple of important deals with OhmConnect and AddVolt, one on the energy management side, one on batteries as we think about our reefer  unit. So right in the core of what we're focused on, -- and we have a pipeline, Jennifer Anderson and the team working a pipeline of a number of interesting investments we're looking at. And if we see the right investments there, we'll make them. So, I just wanted to dig in on the strength you're seeing in the K-12 market a little. Yes, we're seeing a transition to a more system-level sales. So, we're seeing a transition. We were very fortunate to sell a bunch of OptiClean units and point solutions, and we're seeing a transition to more sustainable system-level solutions. So obviously, it's important for COVID and the spread of airborne illnesses and diseases, but it also helps with asthma. We've done studies to show that better ventilation and lower CO2 levels, improve testing scores in schools. So, what we're seeing from the schools that we interact with is looking for a more structural, sustainable solution. And the good news is with -- especially with SR3 funds being released, they have the funding to make long overdue investments. Maybe just 1 follow-up for me, shifting to your productivity efforts. And I know your comments on sort of adding an additional 100,000 factory automation hours in 1Q was interesting, and you've talked about ramping that significantly through 2026. So just given what you've seen in the deployments you've done to date, is there a way that you can frame, sort of, how you're thinking about automation's impact on productivity annually over the next few years as you ramp those efforts? Well, remember, what we said is that we said that we would increase our automation hours from 3 million to 6 million over the next -- between now and 2026. And remember, that's on a base of, say, 30 million or so manufacturing hours. So, it becomes a much higher percentage of our total hours. Obviously, you have to look at your variable costs that you're eliminating and replacing with automated hours. Obviously, there's an investment that goes with that. So, there's a lot of benefits that we're seeing from the automation investments. I guess kind of just going back to the first question, I believe, on the resi HVAC cycle. I guess like is there any concern going forward on the consumer behavior, maybe mixing down buying parts versus full system replacement. It's something -- again, we watch this market, which is -- evolves on such a short cycle. In fact, we've seen the opposite, a lot of desire for our higher-end Infinity systems. Obviously, as you get into the higher SEER units, you're probably going to be looking at more system-level changes. And then as we get into 2025 with a new refrigerant, probably more system-level changes. So -- it's something we watch, but we've seen no evidence of. And then I guess just kind of switching gears to commercial, if I can just sneak another one in. I guess, like given the backdrop with rates going up, inflation kind of increasing here. Just at commercial, like orders were strong this quarter. While the underlying trends remain strong, our backlog is up in commercial, up of 30%. Underlying trends like ABI, I think March was at the highest levels we've seen in over a year at 58%. Again, we're specifically watching China right now. But a lot of the underlying trends, including things like aftermarket and controls continue to be encouraging. Well, we'll have to see. How quickly we recover on that, we'll have to see. And then how much is this year and how much goes into next year, we're going to have to see if it's a fluid situation, Brett. But I can tell you that our team, I believe, is working all the right things, frankly, working around the clock in a very, very challenging environment. And it's not just chips, it's logistics. But at the same time, I do think our team is doing the right things. The key for, I think, the entire industry is chip capacity coming online as soon as possible. Brett, I would just add that, especially within Fire & Security, we are counting on some of the, call it, the backlog -- the past due backlog to improve in the second half of the year. And we are working on improving our supply chain and availability of chips, as Dave mentioned. And so, we are expecting some of that to turn into sales in the second half of the year, particularly in the F&S segment. And just 1 follow-up on F&S, orders very strong on the product side, up 20%. I mean, it's been positive. So, demand has been strong in the Access Solutions piece, we're very well positioned. But the key is that operationally, we need more chips online so they can start recovering. First, thanks to our team here at Carrier, our more than 50,000 people globally. And of course, Sam will be available for any follow-up questions."
}