{
    "symbol": "CARR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 11:18:04",
    "content": "  Operator: Good morning, and welcome to Carrier's Third Quarter 2022 Earnings Conference Call. I would like to introduce your host for today's conference, Sam Pearlstein, Vice President of Investor Relations. Thank you, and good morning, and welcome to Carrier's third quarter 2022 earnings conference call. These non-GAAP measures are reconciled to GAAP figures in our earnings presentation, which is available to download from Carrier's website at ir.carrier.com. The company reminds listeners that the sales, earnings and cash flow expectations and any other forward-looking statements provided during the call are subject to risks and uncertainties. Carrier's SEC filings, including Forms 10-K, 10-Q and 8-K, provide details on important factors that could cause actual results to differ materially from those anticipated in the forward-looking statements. Let me start by saying how proud I am of this tremendous carrier team, which continues to deliver strong and consistent results. Total company organic orders were up 3% in the quarter, and our backlog is up about 10% year-over-year. Importantly, we continue to deliver double-digit aftermarket organic growth. Adjusted operating profit was slightly better than we expected, and price cost continues to be positive. We are tracking to about $300 million of gross productivity, about $100 million of which will come from G&A reductions. The improvements, though study have been later in the year than planned, thus impacting our full year free cash flow forecast. As supply chain and working capital improve, we expect to return to 100% free cash flow conversion. We successfully closed the Toshiba Carrier acquisition during the quarter, and we are making important progress on integration and are starting to realize synergies. Earlier this week, our Board approved a $2 billion share repurchase authorization, which is on top of the $300 million remaining on the previous authorization. We are confident in our strategy and long-term prospects and remain committed to delivering shareholder value through disciplined capital allocation, including organic growth investments, M&A, dividends and share buybacks. Our team remains laser-focused on these four principles of driving above-market organic growth, expanding margins, delivering strong free cash flow and disciplined capital allocation. Our customers in both the commercial and residential verticals are motivated to achieve their ESG targets and reduce their carbon footprint and energy bills with government mandates, policies and incentives further fueling this demand. Today, over 30% of our residential split sales include heat pumps. In Q3, our residential heat pump shipments were up over 30% compared to last year. In addition to heat pumps, we continue to lead through innovation with energy-efficient solutions. The cutover to our differentiated new 2023 SEER 2 compliant units has gone well, and our resi HVAC team has done a great job managing the production and inventory transition. In addition, a 45% SKU reduction provides flexibility and operational efficiencies to the channel and to us. We are driving aggressive cost reduction actions and are pricing the new more efficient units, at least a 10% to 15% premium over previous generation products. In Europe, where we are the leader in commercial heat pumps, Q2 and Q3 heat pump orders were up 30%, and we anticipate the same magnitude for the full year. Just recently, vector equal earned the top Product of the Year Award from the Environment and Energy Leader Awards program. In addition to sustainability, we continue to lean into the opportunity presented by the increased focus on health and wellness. In Q3, healthy building orders were up over 55% compared to last year, and our pipeline increased to about $900 million. Within the K-12 vertical, Q3 orders were up 20% and we are up about 35% year-to-date. Our intense focus on digitalization goal for many reasons, but at its core, we are transitioning carrier from an equipment-centric provider to a solutions company with more aftermarket and recurring revenues. Abound not only provides healthy and sustainable solutions, we have also introduced new applications, including Abound predictive insights that reduce the total cost of asset ownership by enabling smarter, more predictive maintenance to optimize equipment health and performance. My leadership team and I are interacting directly with scale customers, and I can tell you that their willingness to make long-term commitments to Carrier is encouraging. Recent Abound wins include a nationwide drugstore chain that will add an additional 2,500 stores to our growing portfolio of managed multisite retail locations and an installation of more than 100 commercial office buildings for a key scale customer. Our efforts here are being recognized as the Abound EcoEnergy has received 5 awards in 2022 for innovation, impact and customer service excellence and its ability to deliver positive outcomes. Growing Abound sales will generate higher margin, more predictable recurring revenues and a stronger pull for additional equipment sales and services. We continue to add capabilities to our Lynx platform focused on providing our customers with greater flexibility, visibility and intelligence across the cold chain. Our advanced refer equipment insights and analytic models provide early and automated detection of refrigerant loss, enabling our customers to improve their asset uptime and operational performance and to protect the invaluable refrigerated cargo. In our North American truck trailer business, Q3 saw a more than 60%, 60% year-over-year increase in service revenues driven by thousands of new Lynx subscriptions. We remain on track for 100,000 new Lynx subscriptions by year-end. Our traction on solution selling driving more recurring revenues is reflected in our continued aftermarket performance, as you can see on Slide 5. Aftermarket was up double digits organically in the third quarter, and we continue to expect to realize over $7 billion in revenue by 2026. We remain on track for about 20,000 connected chillers, our attachment rate was 40% in the third quarter, and we expect to have 70,000 chillers under BluEdge contracts by year-end. Our aftermarket playbook is deeply embedded in our DNA, and we are seeing the results quarter-over-quarter. We have consistently exceeded our expectations, and we will utilize that same playbook in 2023 and beyond, driving strong and recurring growth through differentiated solutions that address secular trends and increased aftermarket opportunities, eliminating waste and driving tenacious cost reduction and remaining disciplined in our capital allocation to accelerate growth and return capital to shareholders. Reported sales of $5.5 billion were up 2% compared to last year, and organic sales were up 8%, driven by price, with volumes flat. The Chubb divestiture reduced sales by 10% and acquisitions, substantially all Toshiba Carrier increased sales by 8%. Price cost, although positive in the quarter, is a margin headwind of about 30 basis points. Adjusted EPS of $0.70 was stronger than expected and includes a $0.02 benefit from Toshiba, which will reverse in Q4, in essence, timing of integration expenses. For your reference, we have a year-over-year Q3 adjusted EPS bridge in the appendix on Slide 17. While there has been some improvement in the supply chain, component shortages continue to affect deliveries and shipments and thus, inventory levels. As a result of the Toshiba Carrier acquisition, we recorded a onetime gain of about $730 million in Q3, which, in essence, is the step-up associated with the ownership stake we already had in Toshiba Carrier. HVAC reported sales were up 22% and of course, reflect the impact of Toshiba, which added 12 points of year-over-year growth. HVAC organic sales were up 13%, driven by high single-digit growth in residential and strong double-digit growth in our light commercial and commercial HVAC businesses. Resi movement was down mid-single digits in the third quarter, and quarter-end field inventory levels are up about 20% year-over-year. Commercial HVAC had a very strong quarter with double-digit growth in applied equipment, aftermarket and controls. As expected, operating margin was down 260 basis points with about 150 basis point impact from the Toshiba consolidation and 90 basis points due to price cost. We expect the HVAC segment to remain price cost positive for the full year and to deliver full year margins of about 15%, consistent with what I shared with you last quarter. Organic sales were down slightly, given significant supply chain constraints as truck trailer growth offset declines in container and commercial refrigeration. With transport refrigeration or within transport refrigeration, North America truck trailer saw strong growth in the quarter, up high teens. However, supply chain issues affected Europe truck trailer leading to increased backlog and inventories. Adjusted operating margins were up 80 bps compared to last year despite lower sales with favorable productivity, price cost and currency translation more than offsetting the volume headwind. Excluding Chubb sales from the third quarter of 2021, Fire and Security segment sales were up 6%. Adjusted operating margins expanded 220 basis points in the quarter mainly because of the Chubb divestiture and productivity, which more than offset the impact of negative volume. This segment is particularly impacted by supply chain challenges, especially in the higher-margin access solutions business. The total company organic orders were up low single digits for the quarter, and backlog remained strong throughout all segments. Similar to last quarter and as expected, resi HVAC orders were down in Q3 as the business continues to prioritize their order book and normalize the backlog that is still measured in months, versus typically weeks. Backlog is up 3.5x year-over-year within that business, which should position us for a good start to 2023. And as I mentioned, commercial HVAC saw double-digit orders growth for the seventh consecutive quarter. All regions within commercial HVAC saw double-digit growth and the commercial backlog, excluding NORESCO, is now up over 35% compared to last year and extends well into 2023. Refrigeration orders were up mid- to high single digits in the quarter, driven by an almost tripling of orders in North America truck trailer as we opened the order book for the first half of 2023 in September. Given how we manage the order book, a better year-over-year comparison for North America truck trailer is properly looking at year-to-date order performance. Through 9 months, orders are up 27% year-over-year for North America truck trailer. Orders were positive in each of the businesses, except for access solutions, which has been most impacted by supply chain challenges. As you can see on both the left and right side of the slide, we saw strong demand in many of our businesses. However, we have seen some weakness in a few areas such as in Europe, driven by Europe truck trailer and commercial refrigeration. In addition, the weaker container orders impact Asia, excluding China, given that this business mainly books orders in Singapore. For reference, with the addition of TCC, China sales are about 9% of our total company business. Compared to our prior guidance, we are reducing our full year expected sales by about $400 million with most of the reduction due to currency translation, the balance due to slightly lower organic sales growth. Accordingly, we now expect full year revenues of about $20.4 billion versus the prior guide of $20.8 billion. We now expect adjusted operating margin of 14.2%, up 60 basis points compared to last year and up 20 basis points compared to our prior guide. However, as I mentioned earlier, the timing of the planned integration costs shifted from Q3 to Q4 causing a TCC adjusted EPS contribution in Q3, but a negative impact in Q4. Last quarter, we said achieving our free cash flow target has become more challenging given continued supply chain headwinds. While we did see supply chain improvements in Q3, the improvements are coming later than expected, and so it will not be enough to reduce our inventories by year-end to get to $1.65 billion of free cash flow. In addition, and to a lesser extent, free cash flow is negatively impacted as we acquired cash from the acquisition of TCC rather than receiving that cash through dividends from equity investments. As a result, we now expect to generate closer to $1.4 billion in free cash flow. In summary, another good -- another quarter of good performance enables us to increase our adjusted operating profit and adjusted EPS guidance. Your line is open. I would say that as we've looked under the covers at Toshiba, we're even more encouraged by what we see in the opportunity. And I think the most exciting thing, as you look at the integration of the businesses, the VRF business is fundamentally a heat pump business. It's going to help us with our growth, not only in Asia, but in also in Europe. And I think in terms of margins, if you fast forward out five years or so, I think you're looking at an EBIT ROS that's in the mid-teens. I assume it's kind of in your guidance, but it sounds like we should be expecting some absorption pressure in Q4 as you work down inventories. But also just curious maybe the apparent mismatch between backlog being very extended, but maybe inventories being seasonally higher than you'd like. I think that our -- we've been watching that this very tricky balance between movement, inventory levels and the cutover quite carefully. Our key objective working very, very carefully with our channel partners is to make sure that we end this year with inventory imbalance. almost all of the new product will be shipped next year, and that's at about a 10% to 15% price premium. So I think we're trying to manage that inventory balance, and we're still sitting on around 4 months of backlog when usually we'd have 4 weeks. So in some of our facilities, we'll take a little bit more downtime than we expected just a couple of months ago. Your line is open. So we're seeing some pretty divergent trends between heat pumps and AC units, and I'm guessing that will continue into '23, '24 and beyond. I would say, Nigel, that if you look over the last 12 months, I think it's clear we picked up, I don't know, 30 or so bps of share. And I do think that on the flip side, we are working again with our channel partners to manage their inventory levels as they head into next year. I think at a high level, when you look at overall resi for the first -- for the third quarter, we had good price. But we do get, as you know, and I'm answering kind of more broadly, Nigel than your heat pump question, but we get a lot of questions about resi overall. And just a bit of a reminder for folks is that some perspective, it's, say, 20%, 25% of our sales. And I think the thing, as we look at next year that will be most acutely under pressure will be the residential new construction piece. So that means it's about 5% of our total business, which means that if that residential new construction piece, just pick a number, was down 10%, that would impact our top line by 0.5%. And then you have these countervailing things like what you're bringing up, which is we have a number of positive mix stories, which is the shift to heat pumps. It's whether it's cooling only to heat pumps where we're doing particularly well, especially because we have outside share in Florida in places in the South. And then we also have, depending on how the inflation reduction act plays out, you have the heat pump mix from entry level to higher efficiency. So we are watching some of the concerns around volume overall, but there are some I guess, encouraging counterforces that should position us well as we go into next year. So I think, yes, we worked on this we've worked on this for a long period of time, and we're there. As we mentioned, sales up 30% year-over-year in the quarter. We believe we're number one in Europe, commercial HVAC each pumps. And then, of course, with the TCC acquisition, we even further strengthened our heat pump position that we can benefit from not only in Asia, but also in Europe with the residential opportunity over there. Your line is open. For Q4, we expect organic growth to be high single digits. And actually, we do expect to have some volume growth in HVAC in the fourth quarter of the year, very modest. Generally, we would expect to have seen continued growth in commercial, in light commercial 2 businesses that are doing really well with strong backlog. Yes, Julian, it's kind of a mixed bag for us in Europe. And first, I just mentioned for context, it's about 20% of our total sales. Having said that, we have been pleased with the orders in key parts of our business. Commercial HVAC, fire and security have done quite well on orders in Europe. The things we watch, as you said, is really on the refrigeration side in both European truck trailer and CCR. The European truck trailer, I think that -- our sense is, as of right now, our lead times have increased a bit because of supply chain. But of course, that's something we have to keep an eye on. So that was down in part because of the market, I think, in part because we are going to great lengths to improve our margins. So there's probably a bit of a mix in there, but Too early to say that's a trend, but there are a couple of watch areas for sure there. Your line is open. We now sit on a pipeline of $900 million, it's up 40%. But we signed -- I can't mention the name of the customer, but we have a customer in particular that's a really respected key scale technology customer  that is encouraging people to come back to the office. And as they do that, they have 100 office buildings that are going to be putting Abound in part, they want to use it to give their employees confidence as they come back to the office around the indoor air quality. So honestly, Dean, I think it's a trend that's here to stay. Is that -- you would expect, given the kind of payback that attachment rate would be higher at this stage, maybe it's still early. Well, what I would say -- by the way, just to clarify, it's not necessarily up 40%. But look, we said that we were going to improve our attachment rate by percentage points a year, and that would put us at year-end in the low 40s. And I just think we continue to drive the playbook, where when it comes off warranty, we are there to get a long-term agreement. And we continue to see traction as we add salespeople in the right cities, in the right locations with the right digitally enabled offering. We take a very strict interpretation of what we call an attachment rate because if we look at -- after we sell a chiller, do we get predictable sales, that's 100% of the time. If that's what the definition is that we want to use, it's 100% because we always get parts sales, we always get service to it. We want a long-term agreement that's sticky, that's recurring revenues, and that's the definition we use, and that under the BluEdge paybook is growing 5 percentage points a year. And the other one we really look at is total chillers under some form of LTA, and that's growing 10,000 chillers a year, and that will be 7,000 by year-end. Your line is open. And then as you're thinking about the carryover effect into 2023, maybe just provide some color on that as well. But from a dollar perspective, it was a favorable thing, give or take, about $50 million in Q3 alone. With respect to carryover based on prices that we have already implemented, we would expect carryover next year to be several hundred million dollars. At the same time, I'll have to say though that we would also expect some carryover inflation next year, especially inflation related to purchases where we have material pricing formulas. So the net impact to the P&L, the price cost called for next year will be lower than just a few hundred million dollars of good news. And I'll also say that for next year, of course, what we're looking forward to is a potential good impact from commodity cost tailwinds. And then maybe just kind of my next question, really focusing on the strength that you're seeing on the commercial HVAC market. obviously, double-digit orders now for 7 quarters in a row. Well, let me tell you what we're seeing, Joe, is that you mentioned the 7 quarters of double-digit orders growth. So we're quite well booked for next year in commercial HVAC, where our backlog is up 30% year-over-year. And that's been above 50% now for 20 months straight, toggles between 52%, 53%, 54%, but for it to be above 50% for 20 months in a row, is encouraging. And then we have a lot of investments around Abound that's going to create a lot of pull for long-term sticky revenues, but also some of our products. So I would tell you on see HVAC and of course, the same is true for light commercial encouraging trends. Your line is open. Well, there's a couple of things at play. If we start with K-12, the ESR funds, they've only spent very little of the $190 billion that's been allocated towards the school. So I do expect as strong as our orders have been that spending continue to pick up, which, of course, regardless of economic cycles, government-funded spending on K-12 should withstand whatever happens in the broader economy. On the Inflation Reduction Act, the big thing that will play out over the next couple of months is whether the $2,000 a year incentive applies to both the kind of the mid-tier SEER units as well as sort of the higher-end SEER. If that happens, I think you're going to see a very broad-based upgrading from your entry-level heat pumps to that mid-tier heat pumps, which would be obviously good for the planet, good for our customers' energy bills and frankly, good for us as well. Your line is open. We started out by saying that we would target $300 million in productivity, and that remains our target for the year. And frankly, we're on a path to achieve that for the full year. One is -- we continue to have tremendous opportunity to take cost out of our system, whether it's our factory footprint, whether this is from a sourcing point of view, we still have way too many vendors that we intend to consolidate over time or G&A opportunity. In addition, I will say that what we've been struggling with the last year or 1.5 years is tremendous inefficiencies in our factories, shortages of parts, causing inefficient manufacturing operations, expedited freight, logistics, wherever we look, we probably have significant pockets where we are less efficient now than we were two years ago or maybe even three years ago. So if there would be a downturn, not only would we expect to continue to go after cost that we see today, we would expect to get back to much higher levels of efficiency in some of our facilities. We expect -- we -- of course, we see important input costs come down. We would expect commodity input costs to further go down, and we would expect to benefit from that as we've been very clear that we would have no intention of giving up price. I think it was another $2 billion that the Board approved and your cash flow guidance was reduced, but you're still expecting a pretty significant haul for this year, especially in the back half. Funding organic growth in organic, for example, what we've done with TCC, a growing and sustainable dividend and then share repurchases. You mentioned $1.4 billion of free cash this year, so we're counting on a big last quarter of the year that is not unheard of. And all in, we expect to end the year with about $3.3 billion in cash. So in addition to the -- what's remaining of the prior authorization, we have about $2.3 billion left for share repurchases. And the way we're thinking about this, obviously, is depending on opportunities for M&A or what the share price does or, of course, the general macro outlook, we'll either lean in more or we'll pull back a little bit. Your line is open. Just on the kind of the market call for next year, so you mentioned new housing being down and I guess you didn't really touch on \n I didn't. Well, I think new housing is the obvious one. We're -- as you know, we're coming off some really strong years there. You have these 3 different mix changes that are playing out, the mix of the higher sear, the mix from cooling only to heat pumps, the mix from potentially entry-level heat pumps to the higher efficiency one. And then you have all those underlying trends that we've seen that in some respects, continue to go into '23, like people working from home and in some cases, mixing up. Will there be some volume pressures on the replacement market potentially on the volume side, but there's a lot of things that whether you put it in price or mix are a tailwind. And then just on like commercial, it looks like Lynx bounced back a little bit in their production, but we're hearing the train is now having materially extended lead times. When we're seeing orders up 50%, we're seeing sales up 25%, which we saw in the third quarter. I think if you look over a 12-, 24-month period, I think folks would agree that we've taken share. And we continue I think the benefit from not only some operational performance, but we've introduced a new product that is 40% more efficient than the one that it replaced. It puts us in a position for like commercial, Steve, where our backlog is at record levels. Patrick said it in the script, but our backlog is up 3.5x versus the third quarter of last year. So that does position us well, obviously, for 4Q, but as we head into next year. Obviously, the orders are very strong in North America, but there's perhaps some timing around opening up those order books. It's a --Yes, it's fluid, as you just said, Steve. And this year, we did see -- we expected it but Q3 was down something like 20%. We've gotten some recent orders, but it's something that we do have to watch. And as Patrick said in his script, we can't really look at the strong orders in the third quarter. We have to look at it kind of year-to-date, where I think it was up in European truck/trailer, you look at that and the orders were down, but I mentioned the very strong backlog position. So it's a little bit early to say, but we know there's broader economic concerns in Europe. So the good news is global truck trailer, our backlog is up 15% year-over-year. I saw the same stuff you just mentioned with ACT taking down some of their numbers for next year, but it would still would be positive over this year for NATT, and we're sitting on good backlog. So a bit early to say, but it's something that we are sitting on a strong backlog. Your line is open. I think one of the big targets that we have for ourselves for next year is to maintain the pricing and we're going to have to keep an eye on commodities, but that should be copper, steel and aluminum that should be coming down for next year. So it's a little bit too early to say, but that might be -- that spread could be a positive story for us as we go into next year, not only for resi, but more globally. But commodities, I think, will certainly be down next year, and we have to maintain price. But in the middle of all of that is you're going to get a mix up from a number of these changes that we're not only seeing in resi, but you're also seeing, as you look at things like the shift to electrification in our transport business as well. Well, listen, I just want to close by saying thanks to all of you on the call, and thanks to the Carrier team. If you look at things over the last couple of years, this team has gone through the same kind of macro challenges all of our peers have gone through with COVID supply chain challenges. But I can tell you through a person that our 55,000 people come in every day determined to be best in class in everything we do and we're seeing it in our results."
}