{
    "symbol": "QGEN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 14:00:31",
    "content": " First, we exceeded our outlook for net sales growth and adjusted EPS, both for the fourth quarter and for the full year 2022. For the full year 2022, we also exceeded our outlook for net sales, with result of $2.26 billion at CER. Lastly, we have taken a prudent approach to our outlook for 2023 given the macroeconomic trends, while continuing to expect double-digit CER sales growth in the non-COVID portfolio. We continue to feel confident in achieving the double-digit CER growth target for our non-COVID product group for the New Year 2023, while also planning for a significant decline in COVID-19 sales. In the fourth quarter, we again saw better-than-expected growth in our non-COVID product groups with these sales up 15% CER over the year ago period. For the full year 2022, non-COVID sales were up 14% CER and in line with our outlook for double-digit CER growth. As expected, sales from the COVID product group declined over 60% CER from the fourth quarter of 2021 and they're also down about 30% for the full year to $470 million at actual rates. For 2022, non-COVID sales in this product group rose at a mid-single-digit CER rate and represented a large majority of full year results. However, NeuMoDx sales still exceeded the 2022 target for at least $80 million at CER and driven by sequential quarterly growth in non-COVID applications from the third quarter to the fourth quarter of 2022. In the Americas, non-COVID product group sales in the fourth quarter rose more than 10% CER, over the year ago period and led by solid gains in the U.S. In the Asia Pacific, Japan region sales in the non-COVID product groups was about 7% CER in the fourth quarter and were also up 8% CER for the full year over 2021. Sales in China rose in 2022 and this is a big achievement by our teams, given that the country was essentially in lockdown during most of the year. Sales in China rose in 2022 and this is a big achievement by our teams, given that the country was essentially in lockdown during most of the year. Turning to cash flow for full year 2022, operating cash flow rose 12% over 2021 to $750 million thanks to the solid business expansion. As noted earlier, we are planning for double-digit CER sales growth for the full year in the non-COVID product groups and these represented US$ 1.67 billion in 2022. First, our results for both the fourth quarter and full year 2022 exceeded the outlook for sales, driven by double-digit CER gains in the non-COVID group of QIAGEN product. And last, we have announced an outlook for 2023 that continues the trend from 2022 in terms of double-digit CER non-COVID sales group for the full year, while taking a prudent view on the current macro trends. Yes, on interest â\u0080\u0093 on the net interest income side I think the delta between 2022 and 2023, I probably would take somewhere I would say probably an additional $30 million compared to last year depending on the cash flow and also the interest development."
}