{
    "symbol": "ADAP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 13:09:02",
    "content": " As evident in the separate data press release we issued this morning, the SURPASS trial with our next generation SPEAR T-cell targeting MAGE-A4 continues to produce compelling response data across ovarian, bladder, and head and neck cancers with increasing durability and a new complete response in bladder cancer. So, I mean, we could probably have a lengthy discussion going through tumor type by tumor type and maybe we should find the time to do that, but in general, the monotherapy arm is â\u0080\u0093 of the SURPASS trial is relatively mature, and we're really focusing on getting additional data in combination in the Phase 1 trial. So, I think the strategy in both of those indications is that there are patients in both first-line head and neck and second-line bladder cancer for whom checkpoint inhibitors whilst the indicated,   for those patients have a relatively low response rate as monotherapy, in the 20% range depending on patients. And just, I think one dimension I would emphasize is the co-development, co-commercialization strategy that we've applied in our most, more recent partnerships with Astellas and with Genentech in relation to assets that we develop, and given the stage and potential value creation that we can achieve with a broad indication asset like MAGE-A4, we clearly have a lot on our hands in terms of development, demand, and commercial opportunity, but we'll be thinking quite carefully about working with partners where there is a potential win-win on how we think about co-development and co-commercialization. So, I don't know that I could definitively say that responses are more likely in one group versus the other, other than in general, I would say those with lower tumor volume tend to do â\u0080\u0093 have better responses than those that have higher tumor volume and that's true for afami-cel and that's somewhat certainly true for CD8, almost certainly true for most cancer therapies, but we do see responses across here again a wide range of tumor burdens and this is not unique to ovarian cancer."
}