{
    "symbol": "ADAP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 15:40:06",
    "content": " Second, we each have a strong clinical pipeline that has been highly focused on MAGE-A4 and mesothelin and have significant value creating near-term catalysts, including the filing and potential approval of the first engineered T-cell therapy for a solid tumor indication. As Ad said, this is truly an exciting time for cell therapy focused on solid tumors with many cancer patients already benefiting from treatments in clinical trials. Going forward, we are initiating new cohorts in first-line head and neck and second-line bladder cancer in combination with pembrolizumab, and the Phase II trial SURPASS-3, which we intend to become registrational for patients with platinum-resistant ovarian cancer. A shared focus on solid tumors by far the largest opportunity for cell therapy, compelling data and clinical progress in solid tumors with our existing clinical pipeline, a deep preclinical pipeline focused initially on PRAME and CD70, backed up by our expert teams, specialized end-to-end capabilities a decade in the making and all made possible by our extended cash runway. And it's obviously a range of things that you could look for in terms of the advantages that has come from both the operational advantages that I've talked about during the scripted portion of the discussion, such as the ability to jointly screen with - for ovarian cancer, such as the obvious potential synergies over time associated with the manufacturing capabilities that Adaptimmune has created, as we think about putting multiple products on to the market in due course, and obviously, establishment costs. We have an ability since both of us are focused on ovarian cancer to co-screen for MAGE-A4 and mesothelin, which makes us a little more attractive to physicians who know that they'll get a cell therapy treatment for their patients if they work with us. So, I think the Phase I program for SURPASS - for CD8 of the SURPASS-trial itself and the original cohort of that, which was recruiting across a basket of tumors types, all of whom are reasonable or high MAGE-A4 expression in late-stage patients were not having heavily pre-treated multiple prior lines of therapy, obviously. But together, the opportunity to offer a cell therapy treatment to a larger population of ovarian cancer patients and to look at the patients with multiple antigens and think about whether there's the opportunity to multi-antigen strategies, to be able to get to better outcomes for patients with multi-antigen strategies. And I would just endorse that in our own data set, we just don't have enough patients to be able to parse out lines of therapy versus dose escalations or use of checkpoint inhibitors or re-dosing or other strategies, but the principle that's been shown, I think, in many other studies in oncology is that the earlier lines of therapy give you a better shot at treating patients. So, I'd just like to close by referring you back to the five rationales for why this is a compelling transaction at this point in time; the solid tumor focus, the catalysts achievable within the extended runway, the deep innovative pipeline and the end-to-end capabilities that both companies have shown that I think between them in the combination will make this a compelling cell therapy company for the future."
}