{
    "symbol": "RL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 14:25:26",
    "content": " Looking to the fourth quarter, we will continue to drive this momentum with iconic brand moments in sports and culture, including our Spring '22 fashion show in New York, our sponsorship of Team USA in the Winter Olympics opening today and our second year sponsoring the Australian Open, all of which you will see amplified across our global digital campaigns. We were particularly encouraged to report North America's pivot back to high-quality revenue and operating profit growth versus pre-pandemic levels, continued double-digit growth across Europe and Asia businesses and strong digital momentum, all while investing for growth and delivering both growth and operating margin expansion. This 4% includes 7 points of negative impact from last year's strategic reset of our distribution and our Chaps business, which moved to a license model, implying low double-digit growth to LLY on an underlying basis. Total company adjusted gross margin was 66% in the third quarter, up 60 basis points to last year on a reported basis and 90 basis points in constant currency, despite increased freight headwinds of approximately 150 basis points. Our brand elevation work continued with third quarter AUR up 18% on top of 19% growth last year, with increases across every region. A very strong holiday selling season accelerated third quarter revenue to 30% growth to last year, with both wholesale and retail performing significantly above our expectations. We are also raising our operating margin outlook to approximately 13% on both a reported and constant currency basis, up from 12% to 12.5% previously, reflecting our stronger performance through the first 3 quarters of the year. As I said, we were very pleased with our Q3 performance, and we're pleased that we've been able to raise our gross margin outlook again this quarter all in the context of comping last year's outsized gross margin gains that were primarily channel mix-driven, offsetting this year's supply chain and logistics pressures, and we're able to raise gross margin while still gaining momentum across all of our regions even on a pre-pandemic basis. And Beth, to give some color on specific categories or channels or geographies where we've seen different AUR growth, the one thing I would highlight -- because it was actually pretty broad-based and you saw, right, plus 18% on top of plus 19% last year total company, pretty broad-based."
}