{
    "symbol": "LPX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 16:30:28",
    "content": " Revenue grew year-over-year by $82 million or 27% to $394 million, prices were 16% higher due to the combined effective two list price increases in the past three quarters in addition to the mix of lift from ExpertFinish. Siding growth net of selling and marketing investments added $60 million in EBITDA and Structural Solutions growth added $24 million from which for the purposes of this analysis, I will deduct $7 million representing the lost opportunity to sell commodity volume instead of higher margin Structural Solutions. South America referred to on the Slide as LPSA saw similar raw material inflation and demand appears to be slowing more meaningfully than in North America, but a constant dollar exchange rates revenue fell year-over-year by $12 million or 16% and EBITDA fell by $17 million. With work accelerating on converting the Sagola OSB mill to Siding production the fourth quarter will be the highest for CapEx this year, bringing us to somewhere between $400 million and $420 million in total spending for 2022. Just under $200 million of that spend was for the Sagola mill conversions, and while ultimately spend just under $100 million on other growth projects to expand capacity in ExpertFinish and Structural Solutions and between $120 million and $130 million in sustaining maintenance. This growth is enabled by the additional capacity from Houlton's continuing ramp-up, as well as the non-recurrence of press rebuild in the fourth quarter of last year, which provided an admittedly soft comparison, and this would bring full-year Siding revenue growth to about 24%. The result of all this would be a fourth quarter EBITDA for LP as a whole of around $100 million, and within that $100 million we expect Siding EBITDA of at least $85 million for a fourth quarter Siding margin of around 23%. Your line is open. Your line is open. Your line is open. Your line is open. First, on the Houlton expansion if I heard right, $400 million in capital, I think, Alan, you mentioned a 30% type return and also suggested that it was about 300 million square foot of incremental capacity."
}