{
    "symbol": "STR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 10:56:10",
    "content": " We had a tremendous 2022 and demonstrated strong execution on our large scale minerals consolidation strategy through a series of transactions that transformed us from a private company with approximately 106,000 net royalty acres in the Permian Basin at the beginning of the year to one of the largest publicly traded oil and gas mineral and royalty companies in the US upon completion of the Brigham merger in December. Due to lower commodity prices, Sitio's average realized unhedged revenue per barrel of oil equivalent was down 17% from $65.71 per Boe in the third quarter to $54.68 per Boe in the fourth quarter. Sitio generated adjusted EBITDA of $93.1 million and discretionary cash flow of $77.5 million in the fourth quarter, which both included three days of contribution from the Brigham assets since that transaction closed on December 29th. On a standalone basis, as if the Brigham merger had never occurred and at our standard 65% payout ratio, Sitio's fourth quarter dividend would have been $0.58 per share. Outperformance of the Brigham assets created a $0.02 per share accretion versus Sitio on a standalone basis, increasing the fourth quarter declared dividend to $0.60 per share. And assuming that Sitio and Brigham had been combined since July 1 of 2022, we have declared or distributed approximately $200 million in aggregate dividend for the second half of 2022, which is more than any other US publicly traded minerals company over this time period. Our line of sight inventory of $47.9 million net normalized spud and permitted wells, which on average typically come online within 12 months, remains near record high levels and provides visibility into near term production growth, particularly when compared to the 128.1 net normalized wells that were turned in line on our acreage over the past four years combined. We also provided an annual cash G&A guidance range of $25 million to $27 million, which implies cash G&A of $2.01 per BOE, a $0.26 per Boe reduction versus Sitio on a standalone basis for the fourth quarter of 2022."
}