{
    "symbol": "FUV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 19:24:04",
    "content": " We've implemented a really great CRM program so that we can understand customer behavior, target the right audiences, making sure that we're focused on the customer that's really ready to move forward as we sort of nurture some of those newer leads that we're having into the data base. And that's what we're really focused on right now in our engagement\n Lynn, I think probably the most exciting part of Arcimoto's story right now is how your team has increased our reservation quarter-over-quarter. We can prioritize people differently based on what their timeline looks like, if they want to drive now, if they've already driven, if they're looking to get out of a vehicle before they purchase a FUV, if they live in a state that we're not open in yet and how do we keep them engaged until we open that state. I think the biggest -- heaviest as part of our operating expenses has really been in the weight of our -- size of our fleet because we've been testing things, giving people vehicles, seeing how something works, what doesn't work, then moving them maybe to another partner to test that out, and just trying to understand which markets are going to be most viable. There's a lot of fluidity between demo drive and rental and ownership and we're trying to sort of blend all those lines together, so that you have a really great brand experience. And because we do get good feedback from a lot of different sources, we get them through social media inputs, we get it through direct conversations that we have with customers, whether it's at a rental center, whether it's at a ride and drive event, we hear, and we're listening all the time for what people are asking about. So I guess what I'm really thinking about is in the longer term, let's say, just over the course 2023, what are we thinking this -- the primary focus, trying to get more and more Deliverator sold into fleets and maybe creating a unique niche and last mile delivery because the Deliverator can carry a lot more stuff than an Uber bag on somebody's back. So as we're seeing traction on the consumer side that Lynn's team has been creating, we're seeing that likely able to stabilized production and carry us through the first couple of quarters of next year. And the -- to the point, I think, Jeff, that you brought up just around consumer sales versus commercial sales, it is -- at least as I've kind of envisioned it, Arcimoto started with the consumer market because it's just -- it's a market that can be achieved for a new vehicle venture."
}