{
    "symbol": "FUV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 21:37:06",
    "content": " After that short intro, I'm going to give a little bit of founder's perspective, talk about the leadership growth, financing and the focus of our many shots on goal strategy into our first shot for the wind plan for scale, followed by a factory update from Terry, the introduction of Dwayne Lum, Arcimoto's Chief Product Officer; Lynn Yeager; Arcimoto's Chief Experience Officer; and a Q1 financing and future look update from Doug. Longer term, as most of you know, we are further targeting the federal government's advanced technology vehicle manufacturing loan program for additional financing of the mass production of the fully enclosed two-seat consumer Arcimoto vehicle and we're in the pre-application process for what we believe will be our final application to this program. I want to shift gears from the future to the present and moment at our current product family, specifically focus around our maturing fun utility vehicle and the push to really hone in and streamline the customer experience from when you first hear about an Arcimoto, all the way through all of the touch points to trying it, buying it and taking care of it over time. Before we dive in, I just want to explain a little bit the reason why Friday's executive meeting was the best one I've ever had is because I got to sit through two hours of people smarter than me in every single piece of what we're doing at the company and watch as every problem that I thought I had the answer to got said before I could get it out of my mouth. So it's been very gratifying and we've -- one of the reasons I'm off the road for the foreseeable future is that for the next coming months, we have a large stream of folks coming our way to see what we are doing and how we're doing it and look forward to sharing with you all the full Arcimoto experience. There's a longer-term process, which we talked about very briefly at Ramp It Up, which is our new cylindrical cell packing architecture to use the common form factor 2170 cells that can cells in our packs from -- and this is -- we've developed what we think is an incredibly flexible, low-cost, high-volumetric energy density and thermally safe packing architecture for 2170 cells that will scale from -- all the way from the mainly machine up to very large vehicles. I believe it's out there online on their YouTube channel, but it's the first public demo of an Arcimoto driving with nobody on board, pulling up, avoiding people and that provides the concept foundation for our Robo Vale  initiative as well as factions delivery vehicle that they're using for B2B delivery."
}