{
    "symbol": "SAIC",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-06 16:31:08",
    "content": " But I'd reinforce the comment that an early view of FY2023, we'll have an opportunity to talk about margin rate guidance for next year, and I will remind you that because we're focused on improving margins in the business via profitable growth, it's an important incentive compensation metric. So, we certainly we're paying a lot of attention to it, it's top of mind, it's a key part of our strategy, and our growth strategy, but we believe we're well-positioned going into next year. The answer is, there are a couple of big swingers on the new business front which could position us to grow a little bit faster than what's implied in the current year guidance with 1 important health warning, which is  portfolio is in -- contract is in the portfolio this year and we could have potential headwinds depending on how the protest gets dispositioned as well as the timing of the protest itself. So, I'd say good solid pipeline on the new business front was an opportunity to grow at rates perhaps better than where we were at, but with the health warning that the outcome on NASA NICS could then have a little bit of a headwind effect to growth rates, which is why we're comfortable, given how much of the year we have left to go and how much we have in the way of new business starting out the year, committing to continued organic growth in the portfolio. So, because of the variability, we'd rather not get into guidance around book-to-bill other than to say our backlog has remained at about $24 billion at the end of Q3 and we are committed to growing the total backlog as well as the funded backlog, and importantly, it is not an incentive comp metric to grow backlog, but it does reflect the quality of the pipeline that Nazzic referred to, but also effectively not just growth rates, but also the margin rates implied in the pipeline. There are a couple of opportunities to share the reason we're signaling potentially up to 10% increase in free cash flow next year, is if you think about the contract mix, we have in a predominantly cost-plus business and a TNM business, it is our contractual right to be paid net 30, more or less. That's going to be a key for persistent improvement to cash flow potential, but as we sit here, we see improvement potential in working capital and that's why we signaled in the prepared remarks there's up to 10% improvement of free cash flow next year, and we see that FY 2023 free cash flow as offering a base off of which we can grow an extra 10% beyond that. And the fact that it's an important incentive complementary both in the near-term metrics as well as the longer-term operating cash metrics, we see some real opportunity and the team really committing to improving this at the enterprise level and we've gotten enterprise level initiatives that Nazzic and I are chairing and we're committed to truly making a difference over the next few years because there's real value here. And then on the quantitative side, as we think about the quality of the pipeline, one of the metrics we use to measure health and quality is whether there is an implied improvement to the margin rate organically at the Company level, that's an important metric, and we have thresholds in place that allow us to put some extra eyes on bids that go below threshold rates, if you will, to make sure that we're thinking about bids on a consistent long-term basis. As we've touched on for next year, the 2 most significant ones, there's always stuff coming in and coming out of the portfolio, but the 2 that I would bring your attention is the NASA recompete that we've touched on, given you an update on that, as well as the Vanguard program, which is the Department of State program that we've held for the last 10 years that will go through bit of a different re-compete cycle as we get into mid next year."
}