{
    "symbol": "AENZ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-16 14:30:24",
    "content": "  Operator: Good afternoon, and welcome to the Aenza's Third Quarter of 2022 Earnings Conference Call. The first 1 announced in August is a project with Compania Minera Buenaventura in Peru, valued at $86.9 million with an execution period of 21 month. The second contract announced in October is with Ecopetrol, the leading energy and hydrocarbon company in Colombia for approximately $230 million with an execution period of 22 months. On the plea bargain agreement, representing a crucial step in the company's recovery process on last September 15, Aenza singed the final agreement on settlement in cooperation with the ad hoc Public Prosecutor Office and the Attorney General office. On the ESG aspect on October 21, our company's score stood at 7 out of 100 points in the 22 S&P Global Corporate Sustainability Assessment, reflecting an improvement of more than 60% over the last year's score. Consolidated revenues at the end of third quarter 2022 reached PEN 3.2 billion, 16% higher than figures reported at the same period of 2021. Gross profit, consolidated gross profit increased 11.4% in third quarter 2022 compared to the same period of 2021 due to higher oil and gas prices as well as better margins in Norvial and Line 1 as a result of traffic increase and tariff indexation mentioned before. Gross margin was lower in third quarter 2022 compared to that of 2021, 9.9% and 10.3%, respectively. Operating income, expenses decreased by 13.4% in third quarter 2022 compared to that of 2021, reaching 3-point percent of sales, 4-point percent of sales in 2021. As a result, of the situation, the company registered this remaining balance of the provision related to this plea agreement of PEN 247 million. After third quarter 2022, total provision recorded in Aenza in this regard is PEN 484 million, of which 321.9 million are in sol and 40.7 million are in dollars. As a result, operating income decreased in third quarter 2022 compared to that of 2021 with a margin of minus 1.6%. Also, it includes the adjustment of the present value of the accounts related to the Gasoducto Sur Peruano, which generated a negative impact of PEN 63.3 million up to third quarter 2021. The dollar exchange rate reached PEN 3.984 per dollar at the end of the third quarter 2022, $0.15 lower than the last year's same period. Considering company's net position of assets and liabilities in dollars, this situation generates a positive impact of PEN 2 million in results. Consolidated net loss in the third quarter 2022 is PEN 331.5 million, which represents a net loss margin of minus 3.8%. Adjusted EBITDA increased 19.6% compared to that of the third quarter 2021, increasing from PEN 337 million to PEN 403 million. Consolidated backlog amounted $2 billion, of which $809 million correspond to recurring business, which are oil and gas segments of Norvial concessions."
}