{
    "symbol": "CDAY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 23:04:03",
    "content": " Noemie will then provide insights on our Q4 performance, 2023 full year guidance and reaffirm our medium-term goal becoming a $2 billion revenue company with industry-leading cloud recurring gross margins of 80% and adjusted EBITDA, up 30% by 2025. Our annual Dayforce gross retention rate remains best-in-class at 97.1% and our cloud annual recurring revenue surpassed $1 billion, growing 34% year-over-year. And we did all of this while at the same time meaningfully globalizing our business, and the way in which we support and service our customers driving customer NPS scores up across both our support and services businesses, while also decreasing the number of support tickets logged in year by 13% and maintaining our world-class retention rates of 97.1%. We have always known that this was the structure we intended to move toward and this is the right time to bring our sales, revenue and customer functions together to drive toward our growth goals and to continue delivering the quantifiable value that we promised through every single touch point of the customer experience. Our adjusted EBITDA margin of 20.1% exceeded the high end of our guidance range and operating cash flows was $41.9 million above Q4 last year, driven in part by revenue upside and operating margin improvements. For the full year, Dayforce recurring revenue excluding float is expected to be in the range of $936 million to $946 million, growing 26% at the midpoint at constant currency. As such, this modernization effort in our tech business is expected to contribute approximately 460 basis points of Dayforce recurring ex float revenue growth in fiscal year '23. Bryan, I think the best way to look at it if you look at our cloud recurring gross margin progression, we've always said that we're aiming to be close to 80% by 2026 and we're going to make progress every year and that's going to be pretty linear until then. So over the last number of years, we've actually been rewriting the tax component into the Dayforce platform, such that, it becomes a true cloud system, but also that it allows us to get a foothold in the actual customer's that gives us future growth, and hence the branding exercises and the marketing exercise that Noemie is talking about. I guess, on -- if you think about the guide for Dayforce recurring revenue, if you do actually exclude the $14 million wallet and the 450 basis points of tax migration, it does appear a little bit more conservative than your historical guidance methodology for Dayforce recurring revenue."
}