{
    "symbol": "RBLX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 11:48:06",
    "content": " This growth, in addition to being powered by our amazing content developers and our amazing viral community is supported by our innovative tech, some of which is iterative and measurable, including improvements to our Roblox's translation system, including the quality and personalization of our search and discovery system, and even including things that might not be ratably noticeable, such as the speed that our mobile app and game joins occur in is raw performance. And it's the notion that in an immersive 3D space, it's a lot less -- there's a lot less friction when we see appropriate advertising, just like we would in the real world of billboard ads, for example, which we can scale across all the experiences on Roblox. But we're also optimistic now that we see many brands establishing a presence in Roblox that some of these brands will also want performance marketing, which is a way for â\u0080\u0093 in the appropriate case for people to be able to go to one of our brand partners directly from someone else's 3D experience. There is so much opportunity here because as people come to our platform from different regions, from different ages, from different interest, there's an amazing opportunity to personalize the types of experiences they see when they both first join our platform as well as when they become mature users, and we have a lot of signals that you might not find on a traditional platform, including what are your friends doing, what do people like you do, what have you done in the past. I want to highlight the opportunity on our platform, both for traditional experienced developers who are new developers creating new games and experiences on our platform as well as brands who are establishing presence for people to interact with clothing, people to interact with music, people to interact with beauty, people to interact with a wide range of things and potentially even monetize within those experiences. And we're going to continue to see these larger studios go well beyond 100 people in the studio, which highlights the economic support they're getting from creating on our platform, as well as more developers down around 1,000 or even 10,000, who are starting to make money, and filling out that super long tail of talent that's starting to build on our platform."
}