{
    "symbol": "NEE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 12:11:03",
    "content": " With these new additions, net of approximately 1.3 gigawatts of projects placed in service and roughly 680 megawatts of projects removed from our backlog, our renewables and storage backlog now stands at roughly 20,000 megawatts and provides strong visibility into the significant growth that is expected at Energy Resources over the next few years. NextEra Energy's 2022 third quarter adjusted earnings and adjusted EPS were approximately $1.683 billion and $0.85 per share, respectively. Inclusive of the increases in our expectations in both January and June of this year, NextEra Energy's adjusted earnings per share expectations reflect a roughly 10% compound annual growth rate from 2021 to the high end of our range for 2025. Last week, the NextEra Energy Partners Board declared a quarterly distribution of 78.75 cents per common unit or $3.15 per common unit on an annualized basis, up approximately 15% from a year earlier. Consistent with our long-term growth prospects, today, we are also introducing year-end 2023 run rate expectations, which are built upon NextEra Energy Partners' strong existing portfolio and cash flow generation potential and continued ability to access low-cost capital to acquire accretive renewable energy projects. At the midpoints, NextEra Energy Partners' new year-end 2023 run rate expectation ranges reflect estimated growth in adjusted EBITDA and cash available for distribution of roughly 23% and 12%, respectively, from the comparable year-end 2022 run rate expectations. NextEra Energy Partners continues to expect year-end 2022 run rate adjusted EBITDA and cash available for distribution in the ranges of $1.785 billion to $1.985 billion and $685 million to $775 million, respectively, reflecting calendar year 2023 contributions from the forecasted portfolio at the end of 2022. Additionally, we believe that the long-term organic growth potential for NextEra Energy Partners has increased, with potential new opportunities to repower its roughly 8 gigawatt existing wind and solar assets and to pair battery storage with this nearly 7 gigawatt existing wind portfolio. Combined with its current yield and the expectation of 12% to 15% annual distributions per unit growth through at least 2025, NextEra Energy Partners has the potential to deliver a total after-tax return of approximately 20% annually through this time frame."
}