{
    "symbol": "NEE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-22 10:34:02",
    "content": " NextEra Energy's 2022 second quarter adjusted earnings and adjusted EPS were roughly $1.6 billion and $0.81 per share, respectively. Inclusive of the increases in our expectations in both January and June of this year, NextEra Energy's adjusted earnings per share expectations reflect a roughly 10% compound annual growth rate from 2021 to the high end of our range for 2025. Yesterday, the NextEra Energy Partners Board declared a quarterly distribution of $0.7625 per common unit or $3.05 per common unit on an annualized basis, up approximately 15% from a year earlier. With another strong origination quarter at Energy Resources, NextEra Energy Partners' growth visibility is as strong as ever, and we remain on track to deliver on our best-in-class 12% to 15% annual distribution per unit growth expectations, which we extended through 2025 last month at our investor conference. Finally, last week, S&P favorably revised NextEra Energy Partners' business risk profile upward, from satisfactory to strong to reflect its positive outlook on the Partnership's continued growth and portfolio diversification while maintaining highly contracted revenue streams with highly rated counterparties. NextEra Energy Partners' second quarter adjusted EBITDA was $500 million, and cash available for distribution was $207 million. NextEra Energy Partners run rate adjusted EBITDA and cash available for distribution expectations for the forecasted portfolio at year-end 2022, which we increased last month at our investor conference, remain unchanged. NextEra Energy Partners continues to expect year-end 2022 run rate adjusted EBITDA and cash available for distribution in the ranges of $1.785 billion to $1.985 billion and $685 million to $775 million, respectively, reflecting calendar year 2023 contributions from the forecasted portfolio at the end of 2022. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}