{
    "symbol": "NEE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 14:13:10",
    "content": " In 2022, NextEra Energy continued its long track record of outstanding execution, delivering full-year adjusted earnings per share of $2.90, up nearly 14% from 2021. Due to our long-term visibility into clean energy incentives and the significant growth opportunities at both FPL and Energy Resources, I am pleased to announce that we are extending our adjusted earnings per share growth expectations at NextEra Energy by an additional year through 2026. As always, our expectations assume our usual caveats, including normal weather and operating conditions. For 2022, NextEra Energy Partners grew its LP distributions per unit by approximately 15% year-over-year and delivered more than 20% year-over-year growth in adjusted EBITDA, highlighting the strength of its operating portfolio. The significant tailwinds provided by the IRA and Energy Resources' future renewables outlook, combined with NextEra Energy Partners' third-party M&A and organic growth opportunities and continued ability to raise low-cost capital, even in a challenging capital markets environment, provide us with long-term growth visibility. For the full-year 2022, FPL's year-over-year net income growth of nearly $500 million was aided by favorable weather, increased customer growth, and effective cost management that supported our ability to continue to deploy smart capital for the benefit of customers. NextEra Energy's 2022 fourth quarter adjusted earnings and adjusted EPS were approximately $1 billion, or $0.51 per share, respectively. As always, our expectations assume our usual caveats, including normal weather and operating conditions. Relative to the growth in NextEra Energy Partners' full-year adjusted EBITDA, its cash available for distribution from existing projects was also impacted by relatively higher allocation of production tax credits to investors due to favorable wind resource versus 2021. Yesterday, the NextEra Energy Partners Board declared a quarterly distribution of $0.8125 per common unit, or $3.25 per unit on an annualized basis, up approximately 15% year-over-year and at the top end of the range we discussed going into 2022. During the fourth quarter, NextEra Energy Partners entered into a new convertible equity portfolio financing for approximately $900 million with a low implied cash coupon of roughly 2.8% for up to 10 years, to be funded by the investor's share of ongoing portfolio cash flows. With this available revolving credit capacity and the final funding of approximately $180 million expected from the 2022 convertible equity portfolio financing, NextEra Energy Partners enters 2023 with significant financing capacity to fund future growth. From an updated base of our fourth quarter 2022 distribution per common unit at an annualized rate of $3.25, we now see 12% to 15% growth per year in LP distributions as being a reasonable range of expectations through at least 2026, which is an additional year beyond our prior expectations, driven by the partnership's tremendous long-term growth visibility."
}