{
    "symbol": "NEE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 12:48:05",
    "content": " The recommended Ten-Year Site Plan includes roughly 9,500 megawatts of new solar capacity across our service territory over the next ten years, which would result in nearly 20% of FPL's forecasted energy delivery in 2031 coming from solar generation. Compared to current levels, the recommended plan projects an approximately 65% increase in zero-carbon-emissions electricity produced by the FPL system over the next decade, largely as a result of FPL’s continued rapid expansion of solar energy through the execution of its 30-by-30 plan, which we now expect to complete by 2025, and the solar additions that I previously mentioned. NextEra Energy’s 2022 first quarter adjusted earnings and adjusted EPS were approximately $1.46 billion and $0.74 per share, respectively. Let me now turn to NextEra Energy Partners, which delivered solid first quarter results, with year-over-year growth in adjusted EBITDA of more than 16% driven primarily by contributions from the approximately 2,400 net megawatts of renewables and storage added during 2021. The transaction is expected to close later this year, upon the project reaching its commercial operations date, and supports NextEra Energy Partners’ projected adjusted EBITDA and cash available for distribution growth in 2022. We are pleased with this transaction and look forward to redeploying the proceeds into accretive renewable energy assets, like the battery storage acquisition from Energy Resources that I just mentioned, to support NextEra Energy Partners’ long-term distribution growth expectations. Turning to the detailed results, NextEra Energy Partners’ first quarter adjusted EBITDA was $412 million and cash available for distribution was $169 million. NextEra Energy Partners continues to expect run rate contributions for adjusted EBITDA and cash available for distribution from its forecasted portfolio at December 31, 2022, to be in the ranges of $1.775 billion to $1.975 billion and $675 million to $765 million, respectively. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead."
}