{
    "symbol": "SR",
    "quarter": 1,
    "year": 2021,
    "date": "2021-02-05 00:34:10",
    "content": " And secondly, other things that come from that, for example, are the technical committees that are a part of ONE Future are going to allow us to potentially have access to better leak detection technology too, you know, things that help us, that predict artificial intelligence around damage prevention, all the pieces, that you know, if we had to do this independently as companies it may take a longer period of time, I think that helps us accelerate that. Yeah, that the rate proceeding that you referenced did have - that every company has their own unusual items that they have to deal with, with the staff and the Commission and that one in particular had a bunch of issues around cap structure and especially around cap structure with the holding company versus the operating company, which are things that we've addressed a long time ago, what I think we got to the right spot, from our customer perspective and from a business operating perspective at the last rate case, and I think we're in a pretty good spot to be there in. This is Steve Lindsey, the one piece that I would add that's a little different about this one than maybe some of our prior cases is, is one of the things we're looking to do is to combine the two utilities, Missouri East and Missouri West under one tariff, we think obviously that provides consistency across the state for 1.2 million customers, you think there's efficiency opportunities, and so that's something that's a little different about this one. And I think what we're seeing in both of our jurisdictions is, it's being supported by those Commissions which I think is a win-win for both, you know, the company, the customers and really the state from an economic development perspective. Yeah, so the team is always working on, you know what those opportunities might be, nothing that we've announced, like Steve Lindsey said earlier, we're highly satisfied with the operation of that pipeline, you know, I'm an old operator, believe it or not, and I know what it's like to be in gas control and operate pipelines and the pressure volumes that we're bringing in, the design that, you know, in terms of into our system and around the different parts where we have difficulty holding pressures and so forth like Steve Lindsey said, that pipeline has outperformed our expectations."
}