{
    "symbol": "CCK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 12:49:10",
    "content": " Segment income was $383 million in the quarter compared to $369 million in the prior year primarily due to improved profitability in North America n tinplate businesses and can-making equipment, including a net benefit of $30 million from lower cost inventory, offset by the timing of insurance recovery for the incremental costs related to the Bowling Green tornado and $8 million of unfavorable foreign exchange. Your line is now open. We're a little concerned with our summer inventory levels, given that we lost capacity early in the year, and we've, obviously, won't have full capacity until we get the plant back through initial learning curve stages at Bowling Green, but it does not appear that demand for beverage cans -- that the momentum is slowing that much. Think about incremental $20 million of headwinds in Europe from where we were at a couple of months ago when we talked to you and Brazil, while it's offset by a minority interest at the EBITDA line, Brazil maybe 10 to 15 million, offset by gains, that we didn't anticipate at the time we talked to you in Asia beverage and food and obviously some out performance in European Beverage in the first quarter, that gets you to a 30 million net EBITDA reduction. Your line is now open. Your line is now open. So I think -- if we think about transit for the full-year, I think we're probably considering currencies a headwind, and we sold a fairly profitable business that after those two items were probably still going to be up on the order of $15 million for the full year, which would tell you that in the next three quarters, we're going to be up about $20 to $25 million net of the loss of the Kiwi business and a little bit of currency headwind. So I -- you would expect perhaps, with everything that's reopening as Ghansham noted, that perhaps we'd see a little, dampening of demand but it hasn't happened I think that, I said it last time on the earnings call I think the prospect of eating out, at restaurants is not a very compelling prospect right now. Your line is now open. Your line is now open. Your line is now open. But is there opportunity for margin expansion or uses ensuring that you were getting back inflation,\n I think Kevin described net 30 million inventory and think about inside of transit we probably had a headwind of 3 or 4 or 5 million, add that to the 30 and that gives you what we had on the tinplate side, about four or $5 million headwind in transit, you got two things you've got, obviously we're trying to make sure we recover inflation. Your line is now open. Your line is now open. Some of that momentum offsetting the slowdown in growth of , all those , while the growth has slowed or  an incredibly important part of the beverage can market, it's 10% to 12% or maybe even a little bit more of the beverage can market, and -- so many of these drinks are in sleek cans and, obviously, all of the capacity we've announced as sleek capabilities, one of the reasons for expanding the industrial footprint is to grow the business in line with volume demand but also grow the business for the types of products, and the size or shape of the can that the marketers and the consumers prefer, so yes. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}