{
    "symbol": "CCK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 16:13:05",
    "content": " Segment income was $336 million in the quarter $344 million at constant currency compared to $379 million in the prior year, primarily due to higher energy prices in Europe, the costs associated with higher inventory levels in Europe and Asia, partially offset by improved profitability in North American tinplate and can-making equipment businesses and 6% global beverage volume growth. As a result of lower-than-expected third and fourth quarter beverage unit volumes, we now carry too much raw material inventory across our Asian and European operations at a time when the price of aluminum has declined approximately 10% to 15% from July and August averages. Unit volumes in European Beverage increased 3% in the third quarter with shipment growth noted in Italy, the Middle East and the U.K. And again, while volumes advanced versus the prior year, they were short of our earlier expectations, largely related to hyperinflationary conditions in Turkey and customer supply chain issues in the U.K. The other thing simply and it doesn't feel good to say this but with our growth being flat in North America for 2022, the prospect of 10% growth in '23 is easier than it was when I suggested to you that we could have, let's say, 10% growth back in July when we expected higher growth this year. And perhaps in the fourth quarter, think about another $20 million to $25 million, something like that, as we try to work down this metal and get it behind us here in 2022 and not have anything exposed going into next year. I think the 2 big swing factors are we're looking at -- we're estimating, let's say, 6% volume growth for next year and will we have 4%, 6% or 8% and then -- globally, I'm talking. I think that the two segments, almost all of the increase that we're going to have next year will be in the Americas and European Beverage businesses with Asia Transit offsetting the non-reportable. A little early to say because we're not there yet and we don't know what the world is going to bring us in terms of opportunity but it's not out of the question to think that, that number couldn't fall to something like $600 million. Listen, I -- as we sit here today, we're -- we've got customers who have given us requirements contracts, for the most part, saying that they expect a certain amount of volume next year and we're committing to supply them that volume. I think the -- if you were putting the pieces together for the other segment, I would say it's the inventory gain we had last year and it's the expected decline in aerosol can sales next year versus the full year this year. Maybe Iâ\u0080\u0099m getting a little too precise but if -- I think coming into the year, there was an estimated, I want to say, $40 million headwind or so in Europe Beverage as it relates to aluminum conversion costs that were supposed to be rectified over the next 2 years."
}