{
    "symbol": "CCK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 12:23:11",
    "content": " Segment income was $432 million in the quarter, compared to $395 million in the prior year, primarily due to improved profitability in the North American tinplate and can-making equipment businesses, and 4% Global beverage volume growth. Looking ahead, with Bowling Green further through learning curve and coupled with commencement of operations late this year in Martinsville and mid next year in Mesquite and also based on contracts in place, we currently project 10% volume growth in North America for 2023 over 2022. Your line is now open. I mean, I would say that second half Asia, if I'm looking at something here, it looks like it's -- we're going to have some significant growth in Q3, just due to the lower shipments we had last year in Q3. So spending on can beverage products certainly much more discretionary in a market like that than we're used to, but we are forecasting increases in the market, and for the full year, we have a small increase forecasted and that's certainly several percent lower than we would have estimated at the beginning of the year. Your line is now open. I would hope we're up a minimum of 5% next year, but that -- but we don't have the budget yet for that's so I can't give you that. Your line is now open. Your line is now open. Thinking about the $60 million, let's assume we get about $12 million in the second half of this year and we'll get the balance of that through next year. It's a big number and we're not happy, but I'd ask you to think about and perhaps we -- I think we said in the first quarter, we might have told you it was $5 million, we probably had the wrong number. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. If you just put back the $20 million to $25 million of steel losses that we had this year into our first half performance, I'll bet you, you get a -- I even done the math, it's got to be 2% or 3% based on what we had already, or maybe it's not that much, but it's not insignificant. I know in food cans, it look like two piece food can for the market was down about 3%, now we were up 13% and that's just customer mix and end market mix, but I canâ\u0080\u0099t -- without guessing I can't give you a CMI beverage number, because it's not been released yet. Your line is now open. So I think we're looking at -- we'd like to say that we think for the full year we will be up 5% to 6%, that's a bit off of -- I think last time we talked we probably told you 8% and we're seeing 5% or 6% now. So if you're thinking about what we're going to recover over and above incurred costs based on our forecast for the balance of the year, it's $10 million and Kevin is saying that will occur in the fourth quarter, not the third quarter. Your line is now open."
}