{
    "symbol": "CCK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 13:56:10",
    "content": " Net sales in the quarter were down 1% from the prior year as global beverage can growth of 3% and the pass-through of higher raw material costs were offset by foreign currency and as expected, lower volumes in the Transit Packaging business. Segment income was $292 million in the quarter compared to $357 million in the prior year, primarily due to timing of costs associated with higher inventory levels, lower cost absorption from planned inventory reductions and higher energy prices in Europe. Contractual terms will allow us to begin to recover significant inflationary increases, our inventory positions have largely been rightsized at year-end 2022, renewed European contracts with more appropriate terms, initiated significant overhead cost reduction activities within Transit Packaging and have or will commercialize significant new beverage and food can capacity in the United States and Europe to continue to serve our customersâ\u0080\u0099 growing requirements. Your line is now open. Your line is now open. So we â\u0080\u0093 I think if you take the mid-point of the EBITDA range we provided you, if you take the $500 million of cash flow that weâ\u0080\u0099re going to generate, less the dividends we pay to the common shareholder and the dividends to the minority partner I think if you flush all that, you probably get yourself down to around 3.2, 3.25, something like that by the end of the year. I think the real thoughtful part of your question is what is the appropriate level of leverage within that range, just given the current global economic environment weâ\u0080\u0099re in, the central banks around the world, what their motives are to curb inflation, and just the cost of the debt and the relative dilution, letâ\u0080\u0099s just call it, relative dilution that comes from higher cost debt then the free money we all experienced for the last several years. On the steel re-pricing headwind, I think last year, in the first â\u0080\u0093 principally in the first quarter, a little bit into the second quarter, we had $35 million to $40 million of gain. So if you had $35 million to $40 million gain last year and youâ\u0080\u0099ve got $15 million to $20 million loss this year, the year-over-year impact in the first â\u0080\u0093 principally in the first quarter, a little into the second quarter, totaling somewhere between $50 million and $60 million headwind. Your line is now open. I think between volume and price, youâ\u0080\u0099re well over $200 million, youâ\u0080\u0099ve got some cost reduction principally in transit, but also in Europe and Asia, probably in the 25% to 30% range than a little bit more than that, adding for the overhead reduction in transit weâ\u0080\u0099ll have higher benefit â\u0080\u0093 higher bonus accrual. Not sure I really want to give any more than that on a public call, Ghansham, but thatâ\u0080\u0099s â\u0080\u0093 think about price cost and volume being in the range of $200 million to $250 million cost reductions and overhead restructuring benefits being in the range of 50. Your line is now open. But we look at I think the big headwind in the first quarter is the steel re-pricing benefits we had last year and the steel cost this year, summing to $50 million to $60 million, I would say, for the most part. But youâ\u0080\u0099ve got the earnings estimate, and you can work through the earnings estimate, you can probably come up with a â\u0080\u0093 you got $50 million to $60 million headwind on steel and everything else, youâ\u0080\u0099d probably get yourself a total of $75 million EBIT headwind in the first quarter, principally centered around, as I said, the steel and the start-up costs. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. So actually, as we sit here today, the outlook for that business is quite strong this year despite â\u0080\u0093 from an income perspective, despite what you might think about a softening industrial economy, we think that the need for back-end automation lowering cost with automation, we think weâ\u0080\u0099re really well positioned in that business to benefit from. Your line is now open. Your line is now open. Your line is now open."
}