{
    "symbol": "GENI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 12:14:15",
    "content": " We believe that by using this fixed exchange rate as presented on the Investor Day, our strong results in the first half of the year would enable us to raise our guidance to approximately $350 million in revenue and $17 million in group adjusted EBITDA. So, my job as Chief Commercial Officer is to make sure we continue to sell land and expand those and the way that we do that, it's sort of in the way that we've talked about some of the things that Mark touched on in the presentation really like their business is growing, the size of the market is growing, we get the benefit of all of that, we sell them more content -- additional content in terms by data, but also our streaming content, which we're selling now increasingly to the U.S. operators. And I think this is really important to focus on, it's really -- when we doing these deals, when we're selling additional products, yes, as a business, we think a lot of our leverage, and we think a lot about leverage sales, but also we do that in a way where the sportsbooks are setting their own targets for acquisition costs of customers and things like that. Yes, on the 2022 guidance, you're right, we're guiding to 340 on a real currency basis, an actual currency basis, at a revenue basis, and $15 million in EBITDA, but let's be clear, if we were still at our guide rate, which is set as you know, in the Investor Day in January, we will be confident lifting that to the $351 million revenue position and the $17 million EBITDA. So, that's 2022 and 2023, we are not exchanged fundamentally in the business, we're very confident at our range of $430 million to $440 million at revenue basis and $40 million to $50 million in EBITDA basis. That was costing us north of about $1 million in interest to a year in actual cash payments by doing it this way, that saves that money, deal it's actually a much better deal for us that cash is still our cash and it reduces in size over the course of the next 18 months, towards a zero petition for May 2024 and returns to our cash and cash equivalents line."
}