{
    "symbol": "W",
    "quarter": 3,
    "year": 2021,
    "date": "2021-11-04 15:03:13",
    "content": " CastleGate, the inherent advantages of CastleGate between our ability to access ocean freight at a competitive price and get availability in a congested time all the way through to our ability to forward position and therefore, offer customers both speed of delivery while the outbound cost actually falls, all of which manifests also in customers getting sharper retail, those benefits have actually been very -- they've been very -- kind of a very nice bright spot through this period. And if you think about stores, the cost -- there's obviously the cost of a store, but typically, the big costs that are associated with that are also the cost of the physical supply chain to enable the flow of goods and delivery, the cost of the inventory in the supply chain and the cost of whether you want to call it advertising or marketing or building a brand, but the cost for someone to know who you are and to kind of understand why they would want to visit. So all of a sudden, you start thinking about, man, if you get that store, right, and it's just another channel you've added into the mix, in addition to the stories you tell on TV and what you're doing on social media and what you can do with catalogs, what you do online, you can start to see, well, man, that's quite a nice leverage point if, roll it forward, one day, it's 50% online, 50% offline. The only reason we commented on wayfair.com, because we generally don't break out the whole business and try to tell you about every segment, and there's meaningful segments, obviously, the different countries, the different retail brands we have, the lines of business, professional versus the consumer side, was simply that a lot of times, folks take our Wayfair Inc. number, and they may compare it with someone where the more comparable number might be wayfair.com, which is our U.S. mass business. Just one thing I would just add to your point, I mean, the AOV is certainly many times higher than that on Wayfair, which I think it appears what you're asking, it's definitely -- we don't disclose the exact number, but it's multiple times higher."
}