{
    "symbol": "W",
    "quarter": 2,
    "year": 2021,
    "date": "2021-08-05 13:27:12",
    "content": " While interior designers can have access to a vast array of product options across our universe of brands, all with fast delivery, powered by our logistics capabilities, we can meet the specific needs of these customers, thanks to our more than 16,000 suppliers, nearly 18 million square feet of fulfillment space via CastleGate and our own middle mile and last mile network in WDN Though each set of B2B customers is unique, it should perhaps come as no surprise to you, the professional customers as a whole have a very different profile than our B2C shoppers. But in fact, there's four pillars Now, gross margins higher, I think Michael guided this quarter at 27% to 28% sort of despite what we're seeing in the market with supply chain congestion and these things, and that's still, there's a large, large runway ahead of us. But in truth, the number of people come to our sites far more than that, one of the stats we gave out is that we have 4 billion visits last year, so if you think about the number of active customers, that they wouldn't do for because let's just write this way, say we had 100 million people visit last year, that would mean they came 40 times each. No, I think the only thing I would say is, as we've talked about the last few quarters, the U.K. business is sort of hit what we would call the sort of flywheel working really great, we feel really terrific about how that sort of continuing a pace and all of this is sort of ex-COVID registered, like where we're at those businesses, which I think is the question you were asking. And I think in terms of the sort of the brand work we've done there, understand how customers are sort of seeing us and our brand and the investments we've made, they're starting to see some really good payback in Germany. I think there's a math optical illusion there, as well as point to like Q1 to Q2 of last year, we added 5 million active customers, the way the math works is if you don't buy for a 12 month period, you fall out of the number. So the fact that a customer purchased from us during that immediate COVID pandemic period in Q2 last year and hasn't purchased since then, doesn't mean that they're not actively engaged on site, opening emails, putting stuff in their idea boards, like all of the things that we look to manage engagement, is how we work it every day, and where we choose to sort of spend our ad dollars and sort of how we want to be in front of the customer. And so I want to be careful here and there is sequentially, we're sort of continuing to see I think, over the last few months of very similar level of engagement from our customers and sort of where the revenue is coming in, particularly when we look at it on a year-over-year basis."
}