{
    "symbol": "NARI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 10:40:10",
    "content": " So hopefully, that's a little bit of additional color that would help in terms of how we're thinking about how the business would track towards that guidance we provided of the $360 to $370 million of total revenue. We like the post-COVID operating environment here, the post-pandemic, perhaps we're in a post pandemic phase, but certainly, the operating environment has been much more conducive to the sorts of things that we wanted to do all along, which is develop these programs, STEMI, stroke-like programs that will more successfully, consistently identifying triage patients that simply are not -- they're not even seeing the right patient -- right physicians for a consult at the moment. So, we like what we're seeing, but I think to Mitch's point, maybe a little bit up here in Q2, but not -- we don't want to get over the tips of our skis. So, we've been very pleased with the growth that we've seen in -- not just in revenue, but in terms of the number of patients being treated, and I think that goes for not only any gains we might make against other types of advanced therapies from lytics to other thrombectomy devices, but maybe more importantly, expanding the market, putting more patients into the queue here, so that they actually see the right physicians. But clearly, we like what we're seeing, and we think longer term, there's a huge potential there for us to impact patients internationally, just like we've done here in the U.S.\n Really appreciate that color. But I think on a relative basis, when there's staff shortages and some patients and procedures are going to be prioritized, I think it's really benefited us in the -- in this COVID era -- in this post-COVID era -- this post-pandemic era where we're still trying to recover from the staff shortages and that sort of thing. Again, I think sitting in a market that's so underpenetrated, I think that the entry of high-quality rivals, people that really know what they're doing and have excellent sales and marketing capacity is really useful for driving awareness and hopefully putting more patients into the queue, right, putting more patients into the line of sight for a consult for physicians, putting aside whose device gets used and who should get treated, who shouldn't get treated, that sort of thing."
}