{
    "symbol": "NARI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 23:18:10",
    "content": " But I think one of the things that we're really excited to share is you have mentioned this or referenced our communication about transformation in the organization, I think it's underway and the capabilities have been installed throughout the organization, the depth of the bench, the depth of the talent on the team not just at the executive level but much deeper into the organization, I think we want to convey that as well. I do think, as we look ahead to the back half of the year, we'll continue to make some more opportunistic and incremental adds to that team, but I think the real focus going into the back half of the year here is going to be less on bringing on board another big class and more on some of the things I described around execution and new product launch and really trying to settle into this much larger group that we just brought on board. One of the things that we've seen and it will - I think it's obvious in the P&L is that our commercial system has been incredibly efficient, right, productivity of the sales  in the presence of a really strong gross margin and has put us in position much earlier in our commercial history and our history as a public company to hit that breakeven mark. But the impact of that I think could take us, for instance, let's say, the $9.3 million operating loss that we just reported to something that could be in the low- to mid-teens, I call it, in Q3 and then hopefully improving in Q4 for the reasons we've discussed. You look at the market opportunity, you look at the productivity of the sales team, you look at the gross margin of the business, the opportunity to really drive leverage through the productivity of the sales team, as Bill just mentioned, and we think that's something that we are certainly looking forward too. And just to remind everybody, that entire program is part of our second growth driver and is really designed to address one of the key challenges of the VTE market and that's the fragmented care that has existed historically for these patients and the lack of systematic systems and processes that identify these patients, 100% of the time, risk stratify them and bring them forward to a group of caregivers that really understand the disease and can make a fully informed decision on how best to care for those patients. It's actually a really nice position to be in, in terms of going to those hospitals whether they're independent hospitals or whether they're large part of larger hospital systems to say let's look at the value we're providing to the interventional physicians and the tools that they can pick from to get the best possible outcomes for the patients. So there hasn't been any really meaningful changes there in the pricing side, that's been something we've obviously been pleased to see as we're building the business certainly with the macroeconomic stuff going on in the U.S., we were wanting to make sure that we wouldn't face any pricing pressure for the business and we're comfortable with where we are. And I think his skill set is going to - it's already been on display, the reason that we promoted him to COO couple of years ago was because he was just really good at the problem solving, a lot of the systems and the processes and the programs that are necessary for the explosive growth across function communication, the complex problems that have allowed us to explode with new products and new team members, a lot of that was installed and executed by Drew. Let me just say one last thing, when we raised money maybe three, four months ago, everyone was asking, we have a strong balance sheet, you're operating pretty consistently near breakeven, you don't really need the money, why are you raising money, and I said, at that point, if I were you the question that I think you really want to ask but you were all too nice to ask it is are you about to do something really stupid with this money and of course we didn't have a merger of equals or spend of $1 billion or $0.5 billion on the new company, something like that."
}