{
    "symbol": "DLX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 11:31:03",
    "content": " For the full year on a comparable adjusted basis, payments revenue grew 4.7% and adjusted EBITDA dollars grew 8.3% with margins expanding 70 basis points from 2021. For the fourth quarter, total comparable adjusted revenue improved 1.2% to $564 million. Adjusted EBITDA came in $112 million, down $3 million or 2.8% on a comparable adjusted basis from last year. Adjusted EBITDA margins were 18.7%, down from last year's 20.2% due to business mix and the impact of pass through price increases to offset inflation. Payments grew fourth quarter revenue 2.5% year-over-year to $171 million, with merchant services growing 3.3% year-over-year. Payments adjusted EBITDA margins were 21.6%, up from last year's 20.6%, largely driven by operating leverage in our treasury and management business. For the year, payments grew revenue 33% year-over-year to $679 million, driven by the acquisition of First American and sales driven growth for standalone Deluxe. On a comparable adjusted basis for the year, payments revenue increased 4.7%, EBITDA increased 8.3%, and EBITDA margins were 21.4% up from 20.7%. Data's adjusted EBITDA margin in the quarter increased 340 basis points year-over-year to 27.6%, which again relates to timing as well as operating leverage from strong DDM volume. For the year, the Data segment comparable adjusted revenue increased 8.6% year-over-year to $268 million. For 2022, Data's adjusted EBITDA margins declined 130 basis points versus prior year to 25.5%, driven by business mix and the investments in our Data platform. Promo's fourth quarter revenue was $154 million, up 3.1% on a comparable adjusted basis, driven by new sales wins and pricing actions. Promo's adjusted EBITDA margins increased 100 basis points year-over-year to 19.3%, but improved nearly 600 basis points sequentially as we benefited from continued pricing actions, stable supply conditions, and normal seasonal upticks. For the year, Promoâ\u0080\u0099s revenue was $563 million, up 6.1% year-over-year on a comparable adjusted basis or 3% on a reported basis. Fourth quarter adjusted EBITDA margins were 42.5%, down 270 basis points year-over-year as we experienced off-cycle supplier price increases for both materials and logistics inputs, some of which are temporary seasonal base surcharges. Check's full year 2022 revenue was $729 million, up 3.7% year-over-year and adjusted EBITDA margins were 44%, down 210 basis points, but consistent with our long-term expectations of mid-40% margins. Your line is open. Where I'm going with this, Barry, is I'm thinking about your adjusted EBITDA guidance of $390 million to $405 million, which right on the face of it, it looks like it's down versus the $418 million that you printed this year or for 2022. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}