{
    "symbol": "TJX",
    "quarter": 3,
    "year": 2023,
    "date": "2022-11-16 14:34:06",
    "content": " And so I think it's actually tough to see are you taking from one trade down area when, in fact, I think in some cases because we've had some great buys I see a list every week at the good level, which means in some cases, we could -- we're taking good sideways, not necessarily trade-down from other retailers, if that makes sense. And I also look at the on order because we can see some of the -- again, we buy close to need, but we still can see our first quarter on order because as we start buying and putting goods into those buckets, so to speak, the branded content based on what's been available in the market, this applies not just to apparel. And we still are assuming that due to -- whether it's less demerge or some of the ocean freight or some of the other factors and over two years switching some of it to more intermodal than we currently have, we do see a freight as a tailwind, but we're not going into the details, certainly give that more on the -- when we give more detailed guidance on the February call. What's really neat, I think, for us on what we've done in every banner and every geography we're in, as we have become a cooler -- we've talked about our entertainment question and all that, but we have been cooler for gifting because now we're hitting even younger audiences that are very comfortable buying gifts from us. I think the big thing that's happened over the last handful of years, and we have really accelerated during COVID is, a, our in-store experience from our -- and I mentioned this in the script, let's start with our store ops teams and our field organization really does an amazing job on setting up our stores for gift-giving well beyond what we did 6 or 7 years ago. So, we think one of our fourth quarter opportunities this year is to have fresh flowing branded goods that are gift-oriented coming in later, which we are significantly going after this year, which I think is going to bode well for our Q4 sales, especially in the last week or two right before Christmas. So that -- so I think what we were trying to say before is we can't read if it's trade-down because again, part of that goes to we buy across good, better -- we're buying -- we're trying to service almost every customer. It's too hard for we can't seem to read -- and Scott even mentioned, I think if you look region by region, where you would look at some of the stores that might be closing where might have created the trade down, we're not seeing any significant difference by region, which is telling us we're kind of getting a little everywhere. We're hoping that next year, we get to a home sales trend that's more back to -- as I said earlier, back to those low single-digit comps is what we would hope."
}