{
    "symbol": "AWI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-26 08:44:10",
    "content": " For the full-year, net sales increased 11% from 2021 results and EBITDA improved 4%, driven by strong AUV growth in Mineral Fiber, strong Architectural Specialty sales and earnings growth, and as well as solid productivity gains in our mineral fiber plants. We expect the first half of 2023 activity to be at fourth quarter 2022 levels with further â\u0080\u0093 potential, further weakness in the back half of 2023, and to result in full year Mineral Fiber sales volume down mid-single digits. Mineral Fiber volume declines were driven by weaker market demand in the fourth quarter, in addition to lapping a strong prior year period in which some customers were buying ahead of a January 2022 price increase. Looking at the full-year EBITDA bridge, favorable AUV and positive volumes were partially offset by higher inflation, increased SG&A expenses primarily related to the investments and company-wide growth initiatives, including AS sales growth and lower WAVE equity earnings. I think we're going to have some â\u0080\u0093 again, historically, normal carryover rates going into the year that's going to support foundationally the price realization we need to have to expand margins in 2023. I think what we've seen in the grid side of the business â\u0080\u0093 the steel products in particular, we've had unprecedented levels of steel inflation in back-to-back years that drove inventory levels as everybody was buying ahead of these price increases, reminder, we had nine price increases in 2021. But as Vic mentioned earlier, on the raw side, that's really where we're going to see a lot of the continued inflationary pressure with some of those input costs, kind of rolling by way of contracts that are picking up here in 2023, and had higher levels of inflation. And we're expecting above historical performance in AUV, primarily because we're going to get good like-for-like pricing again against a more modest inflationary environment, but still an inflationary environment, plus the missing component of mix, which as you alluded to, I think in 2022, we had channel mix, in particular, in our retail channel and our highest AUV channel being softer, we had a negative channel mix going on. What happened throughout the year though, so when you get to the back half of the year, I think we're going to continue to have favorable comps and WAVE maybe different than what we â\u0080\u0093 certainly different than when we had in the tile business."
}