{
    "symbol": "CG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 13:38:13",
    "content": " Year-to-date FRE is $632 million is 49% higher year-over-year, through a combination of strong organic growth as well as the positive impact of various strategic transactions completed earlier this year. Distributable earnings of $644 million this quarter and year-to-date DE of $1.5 billion, is 10% ahead of last year's $1.3 billion and is already more than double any prior full-year results other than our record result from last year. As you've heard Carlyle delivered strong third quarter and year-to-date results and a particularly challenging quarter, a testament to the strength of our investment platform and quality of our three global business segments. Global private-equity is also poised for future growth, having raised almost $10 billion in new capital year-to-date and having deployed almost $16 billion into new investments. Year-to-date, net realized performance revenues of $780 million, highlights the strength of our portfolio and our team's ability to monetize investments despite difficult conditions. Our net accrued performance revenue balance of $4.1 billion and remaining fair-value of investments in our carry funds of $136 billion, gives us confidence that over time we will realize a high-level of performance revenues and distributable earnings. So let me just bring you back to the beginning of 2021, which actually wasn't that long ago and we set a goal for 2024 to generate $800 million of fee-related earnings, $800 million of net realized performance revenues and $1.6 billion of pretax DE, we've met those goals. And we continue to deploy it also despite the current market conditions and we expect actually to be back-in the market next year with several strategies and being able from the opportunities that we see in the market, which are especially obviously also present in the secondary business where our liquidity needs are increasing across markets at this point in time. And so while we continue to embrace our balance sheet light model, being able to use capital that is generally been generated from carry production to be able to reinvest that into fee-related earnings businesses to grow just like we did with Fortitude and C-Band earlier this year, we'll continue to look for those opportunities."
}