{
    "symbol": "KKR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 14:18:06",
    "content": " At this point, we are at $7.1 billion already surpassing in size, the prior European PE vintage, and it's worth highlighting the regional approach we've taken in our traditional private equity business with individual funds across the Americas, Asia and Europe, instead of having a single global fund. We think this allows us to maximize our fundraising potential, committed capital across our three regional private equity funds currently exceeds $40 billion, and we're still raising capital for our European PE strategy. So from a standing start five years ago, we've put together this incredible global portfolio, which now number over 15 companies and growing, and with $32 billion of AUM that is third party capital together with balance sheet capital, we believe we have the largest core PE asset management business in the world and a return since inception have been very strong with a gross IRR of 26%, which gives us the confidence that we'll be able to continue to scale the franchise. Please proceed with your question. Please proceed with your question. And that's part of the reason I think you've seen the portfolio perform well, and in terms of your question about how we're helping our portfolio companies, in addition to the very specific procurement programs and other things that we do to kind of be able to use our scale thoughtfully, we're making sure that they have access to the information that we have, that the information is traveling. And what you've seen, I think over the last number of years is both, highly durable pipeline to potentially generate fees, a broadening of transactioning transactions and just loss of growth areas and those growth areas are going to come from continuing to follow KKR's loan growth. I referenced core private equity a little bit earlier, but there's a number of different opportunities like that across the firm and obviously we believe we're going to continue to be able to take a lot of share given our business model and our access to talent with third party clients as well. So what we've announced is at current exchange rates, I think close to $14-ish billion of incremental AUM, that's all perpetual capital to managed REITs in the Japan market, we see a lot of opportunity to grow that franchise in Japan. Please proceed with your question. And so we've got a team that's very much focused on how we can really leverage the core competencies we have here at KKR to be able to continue drive ROE and we think a lot of times that's going to lend itself to incremental FRE as well, but that's not necessarily going to be the primary driver here of any transaction. The only thing I would add Brian, is I think the point we're trying to get across as well, we'll continue to remain active looking at inorganic opportunities and that's something we'll keep you updated on, but if you just look back, I think what we're trying to say is that the balance sheet has allowed us to pursue those with minimal equity issuance while also buying back 10% of our outstanding shares since 2015. Please proceed with your question. I think we're in a fortunate position where we've got a lot of avenues to organically really grow our business, but if we can find something where we can use our balance sheet to complement what we're doing and drive additional growth, we're certainly going to look at that. Please proceed with your question. Please proceed with your question."
}