{
    "symbol": "KKR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 13:58:04",
    "content": " To give you a sense of the growth weâ\u0080\u0099ve experienced here at the end of 2019, so two and a half years ago, real assets AUM was $28 billion. Within real estate, AUM has increased from $9 million at the end of 2019 to over $60 billion today, and thatâ\u0080\u0099s pretty evenly split between real estate equity and real estate credit. AUM increased from $92 billion at the end of 2019 to $172 billion  today, driven by the continued growth of our flagship private equity funds alongside the scaling of core private equity and our growth strategies. Real estate equity investment was concentrated in the Americas, really on both the opportunistic and core plus fronts and private equity accounted for $6 billion in the quarter, driven by activity in the U.S. Year-to-date, our after-tax DE was over $1.8 billion, up 14% year-on-year, which I think highlights the continued strength of our business model. Management fees in turn, are up 39% for the first half of 2022 and with $44 billion of AUM that will become fee-paying when it enters its investment period, we have a good line of sight on future management fee growth. When you look at the $44 billion of capital, thatâ\u0080\u0099s up, I think, $8 billion quarter-over-quarter from last quarter, blended management fee rate on that is just north of 1%, at 1.04%. So if I look at net realized performance income prior to 2021, it was running at about $1 billion annually for a few years despite varying operating backdrops, and then as the business scale that essentially doubled the $2 billion plus in 2021, and based on results in the first half of this year, youâ\u0080\u0099re still run rating at about $2 billion. And in terms of real estate, really from a blank â\u0080\u0093 beginning with a bank like late in 2013, the platform has grown into a powerful, fully integrated platform $60 billion of AUM today split pretty equally between debt and equity. Just more broadly, as a reminder, Rufus, as we came into this period of time in a really fortunate position around PE broadly, that we had raised the vast, vast majority of the capital for our flagship private equity funds before this year started, including the vast bulk of the capital for our core strategy."
}