{
    "symbol": "SUI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 07:04:03",
    "content": " During the year, we achieved a record of over 2,900 revenue-producing site gains, driven by more than 2,250 conversions of transient RV sites to annual leases, which topped last year's record conversions of nearly 1,700 sites and represented a 36% year-over-year increase. Full year transient Same Property RV revenues grew by 3.1%, reflecting an average rate of growth of 14.1%, despite an almost 10% reduction in available site nights from the strategic conversion of transient sites to annual leases. But that being said, we can't underscore the fact that with this increased cost, as Fernando mentioned of $18 million, we're still seeing at Same Property growth of 5.4% at the midpoint. So, like Gary said, the demand continues to be very strong, so much so that we -- I think we shared before that we've built out almost 700 expansion sites over the course finishing in 2022, that all sold up in 2022, and look to expand another 500 going into the season this year, which will be filled up by the end of 2023. As we look at our -- as we look strategically at the portfolio, and Gary mentioned in his remarks, right, we can -- we look at our investment program and ground-up development and expansion, we will be able to practically self-fund our investment activity in 2023, are selectively looking at opportunities on the capital recycling front, there's a couple of assets here and there, that over time can also reduce variable-rate debt. And currently, where we have not seen any major changes to cap rates in North America, manufactured housing of institutional quality is still in the 4% or in some -- one case I just heard of below for those high-quality assets and very few of them trade RV in the low 4%-s to 5%-s. Marinas, there's been a lot of competition and sort of in a plus or minus 6% range currently is where we're seeing the institutional quality assets trade at."
}