{
    "symbol": "CERS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 23:51:04",
    "content": " Examples of forward-looking statements include those related to our future financial and operating results, including our 2023 product revenue guidance and goals, operating expenses, anticipated cash used from operations, gross profit and gross margins as well as commercial development efforts, future growth and growth strategy, future product sales, product launches, ongoing and future clinical trials, ongoing and future product development and our regulatory initiatives, including the timing of these events and activities. In 2022, Cerus kept assets momentum in progressing on our goal to safeguard the global blood supply, building upon efforts in establishing INTERCEPT as the standard of care in multiple geographies, most recently in the U.S. On our last several calls, we have spoken about the momentum the business has seen in the U.S., and we continue to see this trend play out in the fourth quarter with sustained growth of our INTERCEPT platelet business, driven by excellent commercial and operational execution as we manage the growth with an evolving manufacturing capacity expansion. We expect these TAMs to continue to grow, surpassing $1.5 billion and $200 million for the global and U.S. platelet opportunities, respectively, over the next 5 to 7 years, driven by mid-single-digit overall platelet demand growth. Product revenues for the fourth quarter of 2022 grew 10% on a year-over-year basis and 11% on a sequential basis, once again driven by a strong contribution from our U.S. platelet franchise. In North America, we saw continued growth in platelet utilization across U.S. blood center customers with product revenues growing 27% year-over-year and 16% sequentially. We posted fourth quarter 2022 product revenue of $44 million, representing year-over-year growth of 10%, led by sales in North America. Full year 2022 product revenues of $162 million were up 24% year-over-year, also driven by North American sales. This headwind was offset by INTERCEPT platelet sales growth across our U.S. customer base, with sales to the largest blood center customers growing 18% year-over-year on a quarterly basis and 47% year-over-year on an annual basis. Our fourth quarter product gross profit was $24.5 million compared to $20.4 million during the prior year period, an increase of over 20% year-over-year. Full year 2022 losses, as reported by our non-GAAP adjusted EBITDA were 58% better than the prior year total with the full year 2022 figure totaling to a negative $12.4 million compared to a negative $29.5 million for the full year of 2021."
}