{
    "symbol": "CERS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 22:15:03",
    "content": " Examples of forward-looking statements include those related to our future financial and operating results, including our 2022 product revenue guidance and goals, operating expenses, anticipated cash use from operations, gross profits and gross margins, as well as commercial development efforts, future growth and growth strategy, future product sales, product launches, ongoing and future clinical trials, ongoing and future product development and our regulatory initiatives, including the timing of these events and activities. Our first quarter 2022 product revenue up $37.4 million reflects year-over-year growth of 60% and importantly, all of our major regions North America, EMEA and rest of world posted positive growth during the quarter. Wrapping up my prepared remarks with one full quarter behind us and the continued strong demand in the market today, we are raising our 2022 product revenue guidance range from $157 million to $164 million to a new range of $160 million to $165 million, which now reflects year-over-year growth in a range of 22% to 26%. Taken together, 2022 is shaping up to be another strong year of growth for Cerus, as we make solid progress on our key initiatives for the year, including facilitating further adoption of INTERCEPT in Europe and the U.S. increasing our manufacturing capacity to meet the growing demand, launching our IFC product nationwide, executing on our targeted R&D portfolio and moving towards our non-GAAP adjusted EBITDA breakeven goal. So I think what we’ve been able to accomplish with the Red Cross and thanks to their early advocacy for pathogen reduction is to really show the or demonstrate the operational benefits and sort of in an environment where there's increasing platelet demand and inadequate supply or at least the pandemic effect on donor availability you are actually able to see the benefits of early release of products, and so a better shelf life combined with the fact that INTERCEPT platelets have a single SKU if you will in the sense that it albeit it need to do CMV testing or gamma irradiation. Thanks a lot, Eric. Thanks a lot, Eric."
}