{
    "symbol": "KFS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 06:20:05",
    "content": " Under his leadership, Ravix has been highly successful in its first year, generating more than $2.9 million in operating income and more than $3 million in non-GAAP adjusted EBITDA and achieving nearly 90% of the earn-out related to his gross profit targets, which we have accrued. For the 12 months ended July 31, 2022, CSuite had $9.4 million of unaudited revenue, 900,000 of an unaudited U.S. GAAP income before income taxes and $1.8 million of unaudited non-GAAP adjusted EBITDA, making it immediately accretive to Kingsway. Additionally we've always viewed our rail yard and VA hospital holdings, which are part of our leased real estate segment as vehicles to monetize some of our net operating losses, which totaled approximately $792 million as of September 30, 2022. Ideally, we're targeting two new acquisitions per year that will generate annualized non-GAAP adjusted EBITDA in the range of $1.5 million to $3 million a piece. For the third quarter, our combined operating income for extended warranty in KSX was $3.2 million compared to $1.4 million in the prior year quarter and $3.8 million in the second quarter of 2022. However, excluding the results of PWSC, which we sold in July of this year, pro forma operating income was $3.3 million for the third quarter compared to $900,000 in the prior year and $3.1 million in the second quarter 2022. Pro Forma non-GAAP adjusted EBITDA for our extended warranty segment was $2.8 million, or 15.7% of segment revenue compared to $1 million or 6.4% of segment revenue in the year ago quarter. Non-GAAP adjusted EBITDA for KSX, which as a reminder is just a Ravix business as of September 30, 2022 was $800,000 or 20.4% of segment revenue in the third quarter of 2022. If we were able to successfully execute these, then we would be able to reduce our September 30, 2022 outstanding debt by approximately $251 million or by 89% and our deferred interest by $19.2 million, all while retaining the operating income and adjusted EBITDA of our extended warranty in KSX segments. First, from an industry perspective, we're focused on companies and industries that are large, sort of like greater than a billion or $2 billion of addressable market, growing, and by that we mean, at sort of greater than two times GDP, and are fragmented. And so, if you look at the acquisitions we've done, in warranty, but also within the Search Xcelerator segment we're looking for businesses and large and growing industries that meet those attributes, sticky customer base, low customer concentration, recurring revenue, high margin, and low or no capital intensity. So, if I just take your adjusted pro forma EBITDA from warranty plus Ravix plus the CSuite acquisition, I'm kind of getting into the high-teens millions per year, maybe somewhere between $16 million and $17 million. So if I'm thinking about kind of this proxy for economic cash flow, maybe it's a little bit higher than I'd suggested something like $17 million or $18 million, and then hopefully, you'll be able to grow it from there. And when we're buying operating businesses, just kind of quick math, if you're buying a business with no growth and we don't have leakage for tax, then we would be willing to pay five times cash flow to hit that 20% unlevered target. And then they also, like, what -- PWSC we sold it for $51.2 million, which you guys see coming through the income statement, kind of TTM at the time we sold, it was probably around $2.2 million of EBITDA -- GAAP basis EBITDA, it looks like we sold over 25 times kind of thing, right?"
}