{
    "symbol": "AEHR",
    "quarter": 1,
    "year": 2022,
    "date": "2021-09-24 00:26:05",
    "content": " Since the end of the quarter we have announced an additional $19.4 million in bookings, bringing our total bookings for the fiscal year to over $40 million as of today's date. For fiscal year 2022, ending May 31 of next year 2022, we are raising our previously provided guidance for full year total revenue by approximately 80% to at least $50 million which is over three times our revenue from last fiscal year. We finished the first quarter with record bookings for the company a single quarter of $20.7 million, and since the end of the quarter we've announced an additional $19.4 million in bookings, bringing our total bookings for the fiscal year to over $40 million as of today. The increase from Q1 last year includes an increase of wafer level of burn-in revenue of $3.4 million and customer service revenue of $231,000. This compares to non-GAAP net income of $870,000 or $0.04 per diluted share in the preceding fourth quarter, and non-GAAP net loss of $2 million or $0.09 per diluted share in the first quarter of fiscal 2021, which excluded the impact of a non-cash net gain of $2.2 million and a tax benefit of $215,000 related to the closure of Aehr’s Japan subsidiary during the quarter. Operating expenses in the first quarter were $3.3 million, an increase of $341,000 or 12% from $2.9 million in the preceding fourth quarter and up $860,000 or 36% from $2 million in the first quarter of last year. For our fiscal 2022 year ending May 31, 2022, we are raising our previously provided guidance for full year total revenue of greater than $28 million by almost 80% to at least $50 million which is over 3x last fiscal year's revenue. Now, the second thing is test times, and I will tell you there are a lot of folks out there that hire a full-time pay trying to figure out unique tricks and things and how do I stress devices and twist and turns and temperatures to try and reduce test time, and it's fully our expectation that customers will reduce their test times over time, particularly of mature designs, but perhaps as is historically the case with all burn-in over the last 40 years. On this recent $19.4 million deal, my interpretation, although it was for Aehr’s XP’s were going to be delivered over the course of the next nine months, is it the hope that those would be delivered within this fiscal year, because it's going to be pretty close. So then the final question, it looks like with your raise and the cash flow generated from all this business that's piling up, you're going to end the fiscal year close – in excess of $40 million in cash."
}