{
    "symbol": "AEHR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-20 00:52:09",
    "content": " Our strong revenue growth in fiscal 2022 was driven by the demand for our wafer level test and burn-in solutions, particularly for wafer level stress and stabilization of silicon carbide devices for use directly in electric vehicle market. The silicon carbide market for electric vehicles and its supporting infrastructure requirements are growing at a tremendous rate with Canaccord Genuity estimating that wafer capacity will increase from 150,000, 6-inch wafers in 2020 to 2021 to over 4 million 6 inch equivalent wafers in 2030 just to meet the electric vehicle market alone. Today, we're excited to announce that we received $12.8 million in new orders from them for multiple FOX-XP systems, a high-volume production wafer pack aligner and a small number of WaferPAK full wafer contactors to meet their increased production capacity needs for silicon carbide-based power semiconductors for the electric vehicle market. We're excited to see them continue their ramp, and we continue to expect significant additional system and wafer pack purchases from them over the next several years and to the end of the decade, as they strive to be a market leader -- market leading supplier of silicon carbide devices. As a result of all these positive evaluations, we believe that we will receive orders from at least several new silicon carbide customers and begin shipping systems to meet their production capacity by the end of our current fiscal year that ends May 31, 2023. This compares to non-GAAP net income of 4.1 million or $0.14 per diluted share in the preceding third quarter, which excludes the impact of stock-based compensation, and a $1 million, one time charge for excess and obsolete inventory and non-GAAP net income of 930,000, or $0.04 per diluted share in the fourth quarter of fiscal 2021, which excludes the impact of stock-based compensation. Non-GAAP net income for fiscal 2022 was 11.7 million or $0.42 per diluted share, which exclude the impact of stock-based compensation, a 1 million adjustment taken in the third quarter for excess and obsolete inventory and forgiveness of the 1.7 million paycheck protection program loan received in fiscal 2020. Accounts receivable at quarter end was 12.9 million up from 8.5 million at the preceding quarter end due to the impact of higher revenue levels, inventories at May 31 were 15 million an increase of 899,000 from the preceding quarter end and up 6.2 million from Q4 '21 to support our expected fiscal 2023 growth. But there's -- we're going to have a pretty significant number of silicon carbide customers, and we're just trying to make sure people understand that that will include at least several this year that will not only buy from us, but will already start taking production orders for their ramps. And one of them was the one that actually talked about that 1% failure rate, that's just not going to be good enough, we think that you need to be down in the 100 or single-digit part per million failure rates and you're going to need to have longer burn-in times. So if a tester supplier want to come in, first of all, they would step all over our patents, everything from how we contact a WaferPAK to how we distribute power to onboard components, there's a number of patents that we do that they can't do this blade architecture, if you're a pro-card supplier, you would have to build a pro-card that would look just like our WaferPAK that absolutely positively would violate a half dozen no more of our patents. I think when we started the year, we were expecting, and I think I would have shared that we were going to get one or two, probably single system orders or something by the end of the fiscal year and they didn't come in from the new customers."
}