{
    "symbol": "AEHR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-07 01:12:03",
    "content": " With our strong backlog and the incredible performance of our manufacturing and supply chain team, as well as the great job our suppliers are doing in ramping to meet the significant uptick in revenues, we're confident and are reiterating our previously provided guidance for full year total revenue of at least $50 million for the fiscal year ending May 31, 2022. During this last quarter, we received a follow-on $19.4 million order for FOX-XP wafer level test and burn-in systems from our lead silicon carbide customer. The new entrants are actually quite interesting to us, as several are starting from a greenfield without any installed base of test or burn-in equipment and are looking to Aehr for advice on the best solutions for them to meet the critical quality reliability needs of the electric vehicle as well as other silicon carbide markets. I do want to be clear that independent of different companies' timelines, we expect that we will add several new silicon carbide customers that will ramp into production with our solution by next fiscal year, as they look to capitalize on the rapidly expanding silicon carbide market. We provide a very cost effective solution for testing and burning in these silicon carbide devices, and we're confident in our ability to capitalize on the expected growth in the silicon carbide market over the next several years and for many years beyond that. Again, as the only supplier of a commercially available and cost effective solution for testing and burn-in in the silicon photonic devices and wafer form, we're also very confident in our ability to capitalize on the expected growth in the silicon photonics market over the next several years. With our record bookings and the strength of our semiconductor test environment solutions, we're confident in our ability to deliver significant revenue growth and are reiterating our guidance of at least $15 million in revenue for the fiscal year ending May 31. With our record bookings and the strength of our semiconductor test and burn-in solutions, as well as the positive response we're getting from multiple new potential customers in the silicon carbide space we're confident in our growth forecasts and ability to meet them. For fiscal 2022 ending May 31, 2022 we are reiterating our previously provided guidance for full year total revenue of at least $50 million, which would represent revenue of three times that of last fiscal year. What we ended up doing is there was a couple of people that had done this, and I think it's still very conservative rule of thumb, and that is for every million cars that are shipped, you're going to need at least eight of our systems in the world, either from us or somebody else, and keep in mind these are 18 wafer systems. And so in that commercial disconnect, we call it, where it's like, wow, you're going to have to go write a check to somebody for $20 million, with a package for burn-in systems, it's like, well, if you buy my machine, it's $12 million, and it's wafer level."
}