{
    "symbol": "WOR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-23 12:30:02",
    "content": " In the prior year quarter, we had inventory holding gains of $31 million or $0.44 per share. Gross profit for the quarter decreased to $143 million from $164 million in the prior year quarter, and gross margin was 10.4% versus 21.6%, primarily due to the swing from inventory holding gains to losses, which were partially offset by increases in both consumer and building products. In Steel Processing, net sales of $1.1 billion more than doubled from $504 million in Q3 of last year, primarily due to the average selling prices being higher and the inclusion of both Temple Steel and Shiloh's BlankLight business. In Q3, Steel generated adjusted EBIT of $7 million compared to $62 million last year. The large year-over-year decrease was driven by the inventory holding losses I mentioned earlier, estimated to be $25 million in the quarter compared to inventory holding gains of $31 million last year, an unfavorable swing of $56 million. In Consumer Products, net sales in Q3 were $162 million, up 41% from $115 million in the prior year. Building Products generated net sales of $133 million in Q3, which was up 38% from $96 million in the prior year. Building Products adjusted EBIT was $50 million, and adjusted EBIT margin was 37.3%, up significantly from $27 million and 28.4% in Q3 last year. In Sustainable Energy Solutions, net sales in Q3 were $31 million, down slightly from $32 million in the prior year despite significantly lower volumes due to the divestiture of our LPG and gas business. We started to see our operating working capital levels decreased during the quarter, primarily due to lower steel prices, which added $49 million to cash flow. During the quarter, we received $29 million in dividends from our unconsolidated JVs, spent $270 million on the acquisition of Temple, invested $24 million in capital projects, paid $14 million in dividends and spent $54 million to repurchase one million shares of our common stock at an average price of $54.26. Congratulations, in just having that $15.7 million charge when steel prices fall $1,000 a ton, it could be a lot worse. But the bottom line for us in North America, and our belief is that between the EAFs and between the integrateds who candidly are pretty vertically integrated, including having their own mines in certain respects that we, at least at this point, in the near to midterm, don't believe that there will be a shortage of steel that's available, prices obviously come up and price increases have been announced by the mills as they contend with significantly higher input costs."
}