{
    "symbol": "RELY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 17:41:11",
    "content": " Given that Remitly has only 2% of the global remittance market, combined with a very strong product offering that drives repeat usage, these new and repeat customers will drive revenue growth for many quarters to come. Given our high retention rate, adding new customers tends to be the leading indicator of revenue growth for the quarters and years to come, and as a result, we expect our revenue to become even more diversified across corridors. As you can see on Slide 16, a number of factors drove the strong 49% active customer growth, including setting another record number for new customer acquisitions in the quarter and high retention of existing customers, who, in many cases, continued to transact with us over many years. While acquiring these new customers in the quarter impact short-term profitability, we fully expect these customers will continue to drive Remitly strong growth going forward. Your line is open. I think the only thing I'd add is, pretty shaping up on new customers, because it was a record quarter in terms of new customer adds and we're also excited that we did it with an 18% decline in CAC from Q2 and 19% decline from Q1 -- sorry Q3, 2021. And so that's what enabled us to not only bank a lot of new customers, which is going to -- which bodes well for not only this quarter's growth and hence our improvement in terms of revenue guidance, but also gives us more confidence going into '23, not only around growth, but the levers that we can pull around growth and profitability, given that we are banking a lot of new customers that have strong paybacks and therefore flows through to transaction margin, and then ultimately gives us flexibility from that standpoint. I think as we look into Q4, as we mentioned in the remarks, I think that it is a unique time where a lot of customers send money back home and so there is a demand capture from being able to capture a lot of new customers in Q4, that again will give us a lot of optionality, both in terms of revenue growth and being able to flow that down to the bottom line. Your line is open. There are word of mouth network effects as we mentioned, that gives us operating leverage from a business standpoint and from a customer standpoint just really organic additions to efficient organic additions to using Remitly, and we measure things like brand awareness and other things that are signals for that, that I think bode well for continued efficient growth, but it is a broad based acquisition across both legacy players, as well as sub-scale players, both subscale legacy and subscale digital, which is where a lot of the market resides. And I think it's harder for those companies to build real reliable peace of mind that delivers for customers on a consistent basis, which is something that I think we did well and that shows up in fast transfers, without any sort of friction and cutting through a lot of complexity, that's inherent in international payments, that we're good at, and we're continuing to get better at with our scale size and growth rate and ability to invest in every aspect of friction, that customers may face. Your line is open. Your line is open. Your line is open. Well, I think that the strategic perspective, that I would add is, as I mentioned earlier, that it's because we're seeing great record -- we saw record addition of new customers in Q3 and we're optimistic on that front, in Q4. Your line is open."
}