{
    "symbol": "BBDC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 13:23:03",
    "content": " Our net investment income was $0.34 per share compared to $0.26 per share last quarter, an increase of 33% quarter-over-quarter as our portfolio benefited substantially from the rise in base rates. The increase in base rates have increased the weighted average yields in our middle market and cross platform investments to 10.2% and 11.1%, respectively, more than 100 basis points higher than last quarter. As I mentioned, continued strong investment performance and higher base rates drove total investment income meaningfully higher to $63.5 million, up 13% quarter-over-quarter. That said, new middle market investments included 21 new platform investments totaling $167 million and $39 million of follow-on investments in delayed draw term loan fundings as we continue to deploy capital at a very attractive risk return profiles in partnership with longstanding sponsors. As we have discussed in the past, the goal of this slide is to provide details on the key categories of our portfolio, which are the Barings originated middle market portfolio, the legacy MVC Capital and Sierra income portfolios, as well as our cross-platform investments. The underlying yield at fair value on our middle market investment portfolio is 10.5%, up from 9.2% last quarter and weighted average first lien leverage of 5.2 times with no loans on non-accrual. In addition to our middle market exposure, we continue to draw upon Baringsâ\u0080\u0099 wide investment frame of reference to complement our core portfolio with $335 million of investments in the legacy MVC and Sierra portfolios and $611 million of cross-platform investments. The cross-platform portfolio contributed $9 million of the total price driven depreciation, primarily tied to the more liquid investments, such as situational BSLs or underlying investments in our joint ventures, while the majority of the credit related write down was due to Core Scientific. Excluding certain equity investments, Barings BDC deployed $229 million at an all-in spread of 758 basis points, which represents a 59 basis point spread premium to comparable liquid market indices at the same risk profile. As Ian said, you can put 5 turns of leverage on something, earn 10% to 11% with the best documentation we've seen in years -- many, many years and we compare that to what we saw on the liquid side on a secondary basis, we looked at that and said it wasn't the right time to go into the secondary part of the liquid market relative to what we can generate through our cross-platform and direct middle market business."
}