{
    "symbol": "MX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 18:10:06",
    "content": " Moving on to our results, we closed Q3 revenue at $71.2 million, which was within the guidance range that we provided, but represented a disappointing 43.9% decrease year-over-year and 29.8% decrease sequentially. Beginning with our Display business, Q3 revenue was $6.4 million, down 89.1% year-over-year, and 77.6% sequentially. Q3 revenue was $56.4 million, down 4.2% year-over-year, and 10.4% sequentially, in-line with the broader slowdown weâ\u0080\u0099re seeing in a global economy, particularly in consumer end markets. Total revenue in Q3 was $71.2 million, down 29.8% sequentially and down 43.9% year-over-year. Revenue from the standard products business was $62.8 million, down 31.2% from Q2 and down 46.5% year-over-year. Gross profit margin in Q3 was 24.2%, below the low-end of our guidance range as we recorded a $3.3 million charge to scrap 12-inch wafers as a result slowing demand caused by elevated smartphone inventories in China. Q3 SG&A was $11.4 million, as compared to $12.7 million in Q2 2022 and $12.6 million in Q3 last year. Q3 R&D was $13.3 million, as compared to $13.4 million in Q2 2022 and $12.3 million in Q3 last year. Stock compensation charges included in operating expenses were $0.9 million in Q3, compared to $2 million in Q2 and $2 million in Q3 2021. Adjusted operating loss in Q3 was $6.6 million, compared to adjusted operating income of $4.8 million in Q2 and $22.7 million in Q3 a year ago. We recognized a tax benefit of $3.9 million in Q3 due primarily to pre-tax book loss of our operating entity in Korea, mainly driven by non-cash foreign currency translation losses in connection with its intercompany loans. Regarding our CapEx plan, Q3 CapEx was $10.3 million and we now anticipate total 2022 capital expenditures to be approximately $23.5 million, which is lower than our prior plan of $28 million, including about $8 million special CapEx for Fab 3 capacity upgrade."
}