{
    "symbol": "ETN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 15:06:03",
    "content": " And I'd emphasize that nearly all of our end markets remain strong, but we're seeing significant strength in commercial, in industrial and data centers, and residential markets and our Electrical businesses. This strength, I'd say, is reflected in order growth in Electrical, which was up 25% and the Aerospace business, which was up 19% on a rolling 12-month basis. As you can see, for the second time this year, we're increasing our organic growth guidance for all but one of our segments really based upon continued strength in all of our end markets. We're raising our overall organic growth from 9% to 11% to 11% to 13% on the back really of strength in our Electrical segment, where we've increased growth by 300 basis points in the Americas and 150 basis points in Global. So overall, I'd say a strong first half, including robust demand and orders, record levels of backlog, and we're very well positioned for the year. And so I'd say that in the Americas business, the big message here is that our end markets are very strong across the board and it's the growth in our end markets that it's allowing our business to perform as well as it is. And so I think aerospace is another one of these businesses that's really poised for, let's say, cyclical growth on the commercial side and giving some of the geopolitical challenges in the world, defense spending is likely to go up around the world. And so I'd say at this point, once we get to that plateau and consistently deliver these longer-term targets, which I believe we said were 22% for the Electrical Americas business, I mean we'll then as we took -- we do every year as we think about it in our investor meeting, we'll take a look at whether or not it's appropriate to raise those numbers. No, I'd say that on the order side, these big numbers that we're talking about, and we'd love to think that we're getting 25% to 30% price, but trust me, it's nowhere close to those numbers. And Joe, one of the things we said is that because we're in so many different businesses and so many of our different businesses have really different makeups that we would not have given out a number, and we're not going to do that today either in terms of price versus volume, I will tell you that we are getting significant contributions from both certainly in our results as well as in our order outlook. Having said that, we had a good quarter in Europe, both in our sales as well as in our orders, which continue to be quite strong through Q2 every place, I'd say, in markets other than perhaps in our Vehicle business, which is where I mentioned that our sales were essentially flat. If you think back to what took place back in the '08, '09 timeframe and so those markets, I'd say, are still below those levels, but we're certainly seeing strong double-digit growth in that side of the business as well."
}