{
    "symbol": "ETN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 15:35:06",
    "content": " Our sales were $5.4 billion, up 15% organically and for the second quarter in a row with particular strength in utility, industrial, commercial institution, data center markets for electrical and commercial aerospace, vehicle and eMobility markets on the industrial side. It's worth noting that our largest business, Electrical Americas, delivered 16% organic growth, 2x the midpoint of our original guidance. Second, I'd note that we continue to demonstrate our ability to drive profitable growth with record margins of 20.2% in 2022, which was 10 basis points above our original guidance at the midpoint. Organic sales growth accelerated from 18% in Q3 to 20% in Q4 with robust growth in every end market and particular strength in utility, data center and commercial and institutional markets. On a rolling 12-month basis, orders were up 34%, which remains at a high level with strong growth across the board and particular strength in data center, utility and industrial markets. In addition to the robust trends and orders in backlog, our major project negotiations pipeline in Q4 was up nearly 100% versus prior year from especially strong growth in manufacturing, data center, industrial and utility end markets. For Q4, we posted organic growth of 15%, incremental margins of 44% and operating margin of 21.8%, which was 250 basis points of year-over-year margin improvement. For the full year, our Electrical segments grew 15% organically, generated 33% incremental margin, increased margin 140 basis points, posted 25% rolling 12 months order growth and increased backlog 68%. Similar to Q3, we saw especially strong growth in military OEM orders, up 80% in the quarter, which positions us well for growth in 2023 and confirms our expectations for increased defense spending, including breakout performance in 2024. For Q1, we are guiding organic growth of 8% to 10%, segment margins between 19.5% and 19.9%, and adjusted EPS in a range of $1.72 to $1.82. But given the secular growth trends that we've talked about, our strong orders and healthy backlog, we would expect to see growth in most of our end markets with six of our end markets representing some 70% of the company up nicely. The quarterly cadence of the organic sales growth, the 9% we discussed in the first quarter, the way you're thinking about the rest of the year, is it all just sort of at the same kind of 7.5% level?"
}