{
    "symbol": "EOG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 14:58:07",
    "content": " Credit for EOG’s resilience for the steady improvement in our ability to generate free cash flow in any environment and the ability to make this free cash flow commitment to our shareholders goes to our employees who embrace our premium return hurdle rate six years ago, which requires that all investments are in a minimum of 30% direct after tax rate of return using a $40 flat oil and $2.50 flat natural gas price. Combined with EOG’s low operating costs and advantaged market position located close to several major sales hubs in South Texas, including access to pipelines to Mexico and several LNG export terminals, Dorado is in an ideal position to supply low cost, low emissions natural gas into markets with long-term growth potential. One thing, one reason we have given this guidance as a minimum of 60% return on free cash flow is because it’s a guide that can be consistent and long term in nature through the cycle, like how we manage the business basing the guide off of a free cash flow, puts us in what we feel is the best overall position to create shareholder value through the cycle. When you think about a play like the Eagle Ford, that’s really a trailblazing type of asset for the entire industry to see how to continue to make one of these resource plays, long life resource plays even better year after year after 12 or 13 years of drilling it. Ultimately, I take a bigger step back and just say for the last few years, Neil, we’ve been pretty consistent with our model that chronic underinvestment and exploration in our industry is really going to lead to generally lower supply, under supplied for the global supply and demand market longer term. That was – and I think we said at that time, it’s dynamic, at that time that 8% to 10% model was reflective of what we could do to optimize near-term and long-term free cash flow with the current inventory and our current knowledge base."
}