{
    "symbol": "OHI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 13:55:04",
    "content": " Our adjusted FFO was $177 million or $0.73 per share for the quarter and our FAD was $171 million or $0.70 per share and both excludes several items as outlined in our adjusted FFO and FAD reconciliation to net income found in our earnings release, as well as our fourth quarter financial supplemental posted to our website. First, regarding LaVie, in the fourth quarter of 2022, we placed LaVie on a cash basis of revenue recognition, recorded the $24.8 million received for rent in the quarter and wrote-off approximately $58 million of straight-line rent receivables and lease inducements through rental income. In January 2023, LaVie paid $2.5 million or 34% in rent pursuant to the deferral agreement and we will only recognize revenue adjusted FFO and FAD in Q1 2023 to the extent cash is received from LaVie. We recorded $20.2 million received for the fourth quarter rent and interest, and wrote-off approximately $29 million of straight-line rent receivables and lease inducements to rental income. Agemo, starting in April of 2023, we expect Agemo to resume paying approximately $27.9 million in annual rent and interest, and both adjusted FFO and FAD will be reported as cash is received. Also, as discussed in previous calls, an operator representing 2.4% of our Q1 2022 contractual annualized rent and mortgage interest revenue was placed on a cash basis in the second quarter of 2022. In both the third and fourth quarters, the operator continued to underpay its rents, paying $2.5 million in Q3 and $1.5 million in Q4, which was recorded on a cash basis for both adjusted FFO and FAD purposes. Of the $2 million in January contractual rent owed, $500,000 was collected and we will only recognize revenue, adjusted FFO and FAD in Q1 2023 to the extent cash is received by this operator. In the third and fourth quarter of 2022, we recorded $5.5 million and $3.8 million to both adjusted FFO and FAD after application of security deposits. During the third quarter of 2022, our operators cumulatively recorded approximately $18.6 million in federal stimulus funds as compared to approximately $29 million recorded during the second quarter. EBITDAR coverage for the standalone quarter ended 9/30/2022 for our core portfolio was 0.91 times, including federal stimulus and 0.83 times excluding the $18.6 million of federal stimulus funds. As part of our restructuring, Omega has agreed to, one, defer rent escalators through year-end 2025, two, deferred interest payments due on our secured credit facility by permitting payment-in-kind until cash flow permits future payments anticipated to begin in 2024, and three, increased the secured credit facility by $13 million to support near-term liquidity needs for lease-up at the Carnegie Hill facility in Manhattan and the Princeton facility. In the second quarter of 2022, another Omega operator, representing approximately 2.2% of Omegaâ\u0080\u0099s total rent began making only partial monthly rent payments, thus causing Omega to begin utilizing existing $5.4 million security deposit to offset shortfalls. To that end, in the fourth quarter of 2022, Omega released three facilities to an unrelated third-party for an initial annual rent of $1.6 million. So far, in the first quarter of 2023, Omega has released an additional 16 facilities to third-party operators for an initial annual rent of $11.2 million, thus leaving only four remaining facilities with this operator. As a result of these releases, including the remaining four facilities, Omega expects to receive new rent of roughly 77% of the previous operators former contractual rent or $17.3 million versus $22.4 million. So I indicated the cut was about -- well, the new rent, if you will, from all the transitions including the four that are still to come, we end up with rent approximately 77% of what it was previously, which is $17.3 million versus the old rent of $22.4 million, so call it, $5 million."
}