{
    "symbol": "YPF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 16:44:06",
    "content": " During the quarter, our total hydrocarbon production continued with a positive trend, bring it to a market over 500,000 barrels of oil equivalent per day, a 5% increase from the previous quarter and 16% on a year-over-year basis on the back of yet another quarter of outstanding growth within our shale operations. Total hydrocarbon production continued with the expansion path that began a year-ago, reaching 506,000 barrels of oil equivalent per day, showing a remarkable 16% increase when compared with the average production of the first quarter of 2021 and growing by 5% when compared to the previous quarter. Crude oil production averaged 222,000 barrel per day, increasing by 3% on a sequential basis when natural gas remains flat at 38 million cubic meters per day, and NGLs recovered in a meaningful way to over 44,000 barrels a day as operations at MEGA's processing plant were fully restored after the program maintenance activities performed in the proceeding quarter. On the back of the solid operating performance and positive pricing environment, the first quarter resulted in yet another quarter delivering some operating cash flow, which increased by 34% sequentially to $1.4 billion, as positive working capital contributions that were anticipated during our last earnings call, added to the healthy adjusted EBITDA results. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. In terms of the reconciliation, it's mostly related to working capital variations to a very large extent, as you probably recall in our last earnings call, when asked about also the, the reconciliation between plan, and at that time mentioning that we were not necessarily expecting higher EBITDA than in 2021 for 2022, which – that's clearly changing as we move along and probably we are seeing some potentially better conditions of our cash flow generation during the year from an operating side. Thank you very much. And in terms of capital allocation, then clearly as we are not expecting a huge net cash flow generation, I would say that or at least the higher than expected cash flow generation is going to be mostly dedicated to first of all comply with, and then potentially exceed our CapEx plan to monetize the opportunities that we envision that we see on our – particularly on our upstream operations, where we see tremendous opportunities to monetize our natural resources, hydrocarbon resources, particularly in Vaca Muerta. Thank you very much."
}