{
    "symbol": "VTRU",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 23:43:06",
    "content": " So a clear advancement in our numbers here, as expected with UniCesumar, when we see the adjusted cash flow from operations, we increase in 161% in â\u0080\u009822, with improvement in cash conversion for operations from 83%, more or less to 96% last year, it is an important pillar in our financing strategy. We now have around 750,000 students, and organically within Uniasselvi, almost 400,000, coming from 287,000, a year and a half ago when see the hubs, we went from 600 to more than 2,100 hubs now, more or less have with UniCesumar and with Uniasselvi throughout the country, and a strong growth in the southeast region, as I'm going to show later. So, first about intake, this information is not new, this is what we disclose already in November, Uniasselvi grew 23% in the second half of last year, compared to the second half of â\u0080\u009821, while UniCesumar grew 51%. So we saw in the last two quarters, an organic increase already in the continuing education net revenue of Uniasselvi and now UniCesumar, we are growing around 30%. So selling expenses on organic basis, there was an increase of 24%, itâ\u0080\u0099s slightly higher than the increase of net revenue as a whole, but at a lower CAC given the important intake that we had last year. By the way about net debt, when we see the overall numbers that we have for last year, I mean, if we take the full year of Vitru x UniCesumar plus, if we take the normalized annualized numbers of UniCesumar for a full year, our adjusted EBITDA number for last year was more or less around R$600 million. Now when you see the two different brands, you saw that there was a very important increase in intake at UniCesumar not only the second half of last year, which is here on the screen 51%. But also in the first semester, in the first method, there was even higher increase in intake within UniCesumar, why would that number of Uniasselvi was more or less aligned to more or less between 20% and 30% growth that we have been showing in the last year. So when we see our continuing education segment, it is a bunch of things, mostly graduate courses within only, but we are looking for future growth not now in the very short term, but more in the medium term, with other growth avenues, apart from our core business of undergrad business because we do believe that we have the two leading brands that on an organic basis Uniasselvi and UniCesumar will keep growing and we'll keep gaining market share."
}