{
    "symbol": "VTRU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 22:06:04",
    "content": " Our intake in the first quarter of this year increased 36% in our core business, which is a Digital Education undergraduate. On Page 6, not only we grew a lot but also we increased average ticket in our Digital Education segment, which increased 8.5% on average comparing the first quarter of this year to the first quarter of last year, which reached more than R$300 per month per student, which shows and confirms the resilience of our model and how – I’d say how we are positioned different than the other competitors. Regarding margins, our margin was stable at 28 – 26.7% this quarter, which means that our adjusted EBITDA grew again 18% compared to what we had last year. And finally regarding adjusted cash flow from operations, we had an increase of 20% more or less reaching R$47 million in the first quarter of this year, which means a cash conversion of 115%, again higher than 100% that we had last year. When we see our core business, in the intake as I said, we grew 36% reaching 179,000 fees in the first quarter -- the first calendar quarter of this year. So we do say, the most of the shift is over and net revenue this quarter was already higher than what we achieved in the fourth quarter of last year and we do expect that the net revenue in the second quarter of this year showed is higher than what we achieved now in the fourth quarter of this year. Cost of service is slightly higher than what we had last year, 2% of net revenue higher than what we had last year. So, when we look for the second quarter, we will have not as high growth in intake as we had in the first quarter as I said because last year the whole intake force was much more back-ended. So, when we see the overall intake focus, we shall have a reduction in tax for the whole input segment when we look together the first and the second year,  and intake in the second quarter will not grow 33%  compared to what it was in the second quarter of last year."
}