{
    "symbol": "JKHY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-04 12:48:13",
    "content": " As Dave mentioned, our deconversion revenue was up $13.1 million for the quarter compared to last year's quarter. Net income grew 19% to $84.7 million for the third fiscal quarter compared to $71.4 million last year with earnings per share of $1.16 for the current quarter compared to $0.95 last year, for a $0.21 or a 22% increase over the previous year quarter. Included in total amortization is amortization of intangibles related to acquisitions, which decreased to $12.4 million this year-to-date compared to $13.3 million last year's first 3 quarters of the fiscal year. Operating cash flow was $301.4 million for the year-to-date, which is up from $266.3 million last year, which this is primarily due to increased net income during the first 9 months compared to the previous year and the timing and change of various operating assets and liabilities considered in the calculation of operating cash flow. For GAAP revenue growth for fiscal '22 based on the amounts in the release yesterday, our revenue guidance continues to reflect a little higher than 10% growth over fiscal '21, which we still anticipate deconversion revenue to be approximately $49 million to $50 million for the entire fiscal year. But I'd just go out on a limb and say, I see no reason why we can't continue to grow top line, non-GAAP revenue in that 8.5% to 9% similar to this year for FY '23 and also get some leverage to the operating margin line on a non-GAAP basis of at least 50 bps or so. The pace of adoption is -- that's going to be interesting to see that -- When Zelle first rolled out, the thing that I said back years ago was as long as Zelle is kind of the really easy, fun-to-use application, it poses a real threat to Venmo. But with the backlog of sales that we're having, I still feel we're going to have some really solid growth in all of our lines of payments in Q4 compared to last year, even with a little tougher comps. And so I don't know that I would say, oh, there's some big opportunity here because people will kind of revert back to working -- now that their bank or credit union has cooler technology, they're going to revert back to work primarily with the bank or credit union. But you're right, there's going to be -- on a GAAP perspective, with only predicting that we're going to have $1 million or $2 million in deconversion fees compared to last year, there is going to be some margin pressure on a GAAP basis going forward in Q4. If you look back 5 years or so, you'll see us running at roughly 14% of revenue that we're putting back into R&D, and we're going to continue at that rate going forward, including this tech modernization strategy."
}