{
    "symbol": "BNS",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-28 12:24:16",
    "content": " In addition to a rock-solid foundation, a diversified revenue base last year of approximately $32 billion and net profits of over $10 billion, we have many competitive advantages, unique areas of strength and opportunities for growth in the bank, including the credit quality of our loan book, our Scene+ loyalty program, which will be a key enabler in diversifying our Canadian P&C business mix. In the Canadian business, I was pleased to see the continued progress with our commercial customers and encouragingly, deposit growth of 10% outpaced 9% year-over-year loan growth. This quarter's net income was impacted by the $579 million income tax expense payable for the Canada recovery dividend of $0.48 of earnings per share and about 12 basis points in the common equity Tier 1 ratio, and this was recorded in the other segment. Revenues were down 1% year-over-year, driven by lower noninterest income, which was down 8%, driven primarily from lower wealth management revenues and underwriting and advisory fees, although banking revenues were up a strong 11%. Year-over-year, adjusted expenses increased by 6% or 4% excluding the impact of the unfavorable impact of foreign currency translation, primarily driven by higher personnel and technology spend to support business growth. The net interest margin grew 7 basis points year-over-year due to higher deposit spreads, reflecting the 425 basis points of Bank of Canada rate increases, partly offset by lower spreads across all loan products. Loan growth moderated to 9% year-over-year, driven by a 22% increase in business loans and 7% increase in residential mortgages. Expenses increased 13% year-over-year, driven by higher personnel and technology costs to support business growth. Revenue declined 7% year-over-year due primarily to lower fee income, driven by a decline in trading volumes and lower assets under management, partly offset by strong loan growth in private banking and higher deposit margins. Revenue increased 7% as net interest income grew 22% year-over-year, driven by solid business banking performance with strong loan and deposit growth and improving margins. Expenses were up 15% year-over-year due mainly to higher personnel costs, cost to support business growth and regulatory initiatives and the negative impact of foreign currency translation. If you're not getting the appropriate returns, we're going to be laser focused on getting our return on risk-weighted asset or return on equity more than we have done in the past, particularly in light of we know capital liquidity, all these are going to be constraints either based on market events or just based on regulatory changes that are coming, including Basel III, and we're going to evaluate all that in the context of how we set our strategy for growth going forward."
}