{
    "symbol": "SNCY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 21:13:13",
    "content": " Iâ\u0080\u0099m joined today by Jude Bricker, our Chief Executive Officer; Dave Davis, President and Chief Financial Officer and a group of others help answer questions. Before we begin, I would like to remind everyone that during this call the company may make forward looking â\u0080\u0093 certain statements that constitute forward-looking statements. Our remarks today may include forward-looking statements which are based on managementâ\u0080\u0099s current beliefs, expectations and assumptions and are subject to risks and uncertainties. With that said, I would now like to turn the call over to Jude. Since July 1st, weâ\u0080\u0099ve run a 99.8% controllable completion factor with 83% A14. Today, itâ\u0080\u0099s been 96 days since we had a cancellation. Operational results like these are a team effort, and Iâ\u0080\u0099m really proud of what our folks were able to deliver after coming through a tough spring. Since the demand environmentâ\u0080\u0099s rapid recovery began earlier this year, our focus of Sun Country has been to staff for growth to restore passenger fleet utilization to pre-pandemic levels. However, particularly in the case of pilots, we continue to work through training overhang. Last quarter, we were constrained primarily by first star officers, this quarter captain availability has become the constraining input. As our rapid hiring works through our training program, we expect fleet utilization to continue to improve into the beginning of 2023. Based on our sales for travel into 2023 in industry schedules, we anticipate yield strength to continue for the foreseeable future. In scheduled service, weâ\u0080\u0099re still seeing strength across all our markets, leisure, VFR, international, domestic, peak and off peak. Due to the lower cost of incremental capacity adds in the strong yield environment, we expect margins to widen in the next year. Typically, Fort Myers in particular is an increasingly larger part of our network through our March peak. Our customers will travel, however, we have less certainty about historically reliable demand. Weâ\u0080\u0099ve launched two new markets into Florida, and weâ\u0080\u0099ll redeploy capacity to other sunny destinations. However, the uncertainty is why we have a wider guide than usual for the fourth quarter. We buy used aircraft in the spot market, so prices will adjust to finance costs, global weakness and a strong dollar. Based on our current fleet commitments, we expect the fleet to grow to 54 aircraft, while also reducing net interest expense in â\u0080\u009823 over â\u0080\u009822. To summarize, weâ\u0080\u0099re not limited by opportunities, capital nor aircraft. Before I get into a discussion of our results, I want to point out that Iâ\u0080\u0099ll be making comparisons about last year as well as 2019 in some cases. Adjusted operating margin was 7.2%, well ahead of our prior guidance. We achieved these results despite continued industry challenges, including third quarter fuel prices being 75% higher than last year, lingering under capacity driven by staffing issues and the impact of Hurricane Ian in the State of Florida. Third quarter revenue totaled $221.7 million, a 28% increase versus last year and 29% better than 2019. Q3 scheduled service revenue was $152.5 million, a 34% increase year-over-year. Q3 scheduled service TRASM increased a very strong 39% versus last year, and 46% versus Q3 of 2019. Scheduled service TRASM continue to improve within the quarter as July increased 33%, August 39% and September 55% versus the same period last year. Charter revenue for the quarter was $42.9 million, a 27% increase year-over-year, driven by a large increase in flying under our long-term contracts, such as for MLS and Caesars. While weâ\u0080\u0099ve been able to sequentially grow our ad-hoc flying, capacity remains constrained as we focus resources on other flying. As we continue to make progress towards normalized pilot staffing levels, thereâ\u0080\u0099s a large opportunity and simply returning to historical levels of ad-hoc flying. Versus the third quarter of last year, ad-hoc charter flying is almost 70% lower. This reduction is due entirely to a one-time payment from Amazon in Q3 of last year for flying that had been done soon after we started our cargo operations, but had not yet been billed. Since Q3 of â\u0080\u009821, our average passenger aircraft count grew 12% and our cargo aircraft count remained flat. As was the case in Q2, weâ\u0080\u0099re still working through the process of expanding our pilot production pipeline. As such, the utilization of our fleet was 6.4 hours in the third quarter of this year versus 7 hours last year. On a normalized basis, we expect aircraft utilization to be on the order of 8 hours per day, which provides us with significant opportunity for very high-margin earnings growth as we return utilization to normal levels. The aircraft we have already purchased, one entered service in Q3 and five more will enter service during Q4 and Q1 of â\u0080\u009823. Additionally, weâ\u0080\u0099re in the process of acquiring three aircrafts to be delivered during Q4 of â\u0080\u009823 and Q1 of â\u0080\u009824. The increase in our non-fuel CASM is largely driven by the fact that our aircraft utilization remains lower than target in the impact of our new pilot agreement, which we signed at the end of last year. We paid an average of $3.93 per gallon for fuel in Q3 â\u0080\u009822, to 75% higher year-over-year. As a reminder, given our differentiated business model, we pass on approximately a third of our total fuel usage to our cargo and charter customers. At $3.75 jet fuel, weâ\u0080\u0099d anticipate an operating margin of between 4% and 8% in the fourth quarter. As Jude mentioned, weâ\u0080\u0099re still assessing the impact of Hurricane Ian on our bookings in Southwest Florida during Q4. Finally, we announced that the Sun Country Board of Directors has authorized us to repurchase up to $50 million worth of Sun Countryâ\u0080\u0099s shares. Our intent is in the near term is to enter into a $25 million accelerated share repurchase agreement, allowing us to quickly acquire a portion of these shares. Our balance sheet is very strong, with $318 million in total liquidity as of October 31st, which includes $25 million in an undrawn revolver. At the end of the third quarter, our net debt to EBITDA ratio was 3 times which is among the lowest for airlines in the US. Weâ\u0080\u0099ve invested heavily in our staff members, purchased the new aircraft we need to grow and steadily paid down our aircraft debt as it comes due. Weâ\u0080\u0099ve used Sun Countryâ\u0080\u0099s shares as a good investment, especially at current values, and we have sufficient liquidity to return capital to our shareholders in a prudent manner. We believe the fundamentals of our business remain strong, and as we continue to demonstrate our model is highly resilient to changes in macroeconomic conditions. Dave, your unique seasonality kind of gives you probably a little more kind of forward look than many of your peers maybe into â\u0080\u009823 even. So you know itâ\u0080\u0099s too early, obviously to make predictions on year over three or year over TRASM improvements into that period. Keep in mind, while we do have a leisure focus, we are fairly focused geographically, particularly in the wintertime with Minneapolis origination in the surrounding region into you know, sunny destinations across the south, Mexico and Caribbean. So from what weâ\u0080\u0099re seeing, it looks really good. No slowdown like we sort of talked about previously, neither bookings or in TRASM growth. I mean, it sounds like if youâ\u0080\u0099re shipping like sports teams around the country, it doesnâ\u0080\u0099t sound particularly macro sensitive. I mean, I think particularly as the business is now configured, itâ\u0080\u0099s probably even more resilient than it has been in the past, which it typically is. I mean, the vast bulk of our flying now is under contract and thatâ\u0080\u0099s under contract for things like Major League Sports, some casino flying, which proves to be pretty resilient during recessions. You know even some of the ad-hoc stuff, we think we can get back even if we sort of enter into a recessionary mode, the military stuff and so forth. Scheduled service in our peak periods, is clearly the best opportunity that we have. Itâ\u0080\u0099s also the one thatâ\u0080\u0099s being cut the most due to crew availability, because a lot of the other segments are long-term contracts, which is great. But itâ\u0080\u0099s also you know when we have these kind of really rapid yield recovery environments like weâ\u0080\u0099re in today, we canâ\u0080\u0099t put a lot of capacity into these peak periods. And in the wintertime, itâ\u0080\u0099s the very well established leisure destinations that tend to consume a big portion of our network like Minneapolis to Cancun, Fort Myers, Orlando, Vegas, LA, Phoenix. Yeah, so on the charter side itâ\u0080\u0099s typically not a straight pass through. When an agreement is signed with a charter customer, thereâ\u0080\u0099s typically a reference price thatâ\u0080\u0099s inherent in the per block hour rate that the contract is set at. Then if fuel goes up, there is additional reimbursement from the charter customer, which is a revenue item. On the cargo side, that is in fact a straight pass through with Amazon paying for the fuel and therefore the fuel cost netting out not showing up in our fuel line. As well, just also wanted to curious if you could just talk about the benefit youâ\u0080\u0099re seeing from highest interest rates that we saw the interest income line and it really jumped this quarter. Yeah, I mean Iâ\u0080\u0099ll take the last and first, which is just to say, I was just calling it out, because it will be probably an outlier in the industry. And that is to say, we donâ\u0080\u0099t have any requirements for debt and supportive any of our CapEx and we donâ\u0080\u0099t have a lot of CapEx planned for next year. And also with the spot market being the source of airplanes, we expect you know if you did see a global recession or you know even regional recessions around the world, then there would be more and cheaper airplanes coming available to our benefit. On the first part, you know weâ\u0080\u0099re hiring full classes every month. So weâ\u0080\u0099re getting all the new hires we need, thereâ\u0080\u0099s not a whole lot of you know adding to that wouldnâ\u0080\u0099t help us that much, because now weâ\u0080\u0099re to the stage where we have sufficient FOs, we just need to transition FOs into the captain seat. And the process is taking several months to kind of get through â\u0080\u0093 gearing up our new hire process into being able to handle classes of the side that weâ\u0080\u0099re doing about 20 to 25 a month, and then gearing up all the infrastructure we need in order to upgrade FOs into captains. You know I think what everybody really wants to hear is, when weâ\u0080\u0099re going to kind of get back to where utilization is what it is and the â\u0080\u0093 is what it was and we have the pilots we need to fly this fleet to its optimal level. And weâ\u0080\u0099re still probably several months out you know say, six months until we kind of get caught up to ourselves. Keep in mind, the fleet grew for us about 70% since pre-pandemic levels, because we onboarded a whole cargo fleet through the pandemic. And you know a lot of my commentary is really around â\u0080\u0093 that flying thatâ\u0080\u0099s going to be facilitated by that crew growth is really, really valuable in this environment. With respect to the excise tax on share repos, does that â\u0080\u0093 that doesnâ\u0080\u0099t kick in until January 1st, 2023. So basically weâ\u0080\u0099re structuring this is, is our intent when we donâ\u0080\u0099t have the paperwork totally finalized, but weâ\u0080\u0099re very, very close, is to do a $25 million ASR and then $25 million open market. the ASR portion, the shares at auction, the vast bulk of them will be delivered to us very quickly, which means, weâ\u0080\u0099ll basically be able to take possession before that excise tax kicks in on that full â\u0080\u0093 on that first 25. Weâ\u0080\u0099re losing some FOs, but for the most part, our captainsâ\u0080\u0099 attrition is de minimis, itâ\u0080\u0099s just about giving them into the less seat at this point. And then, Dave, Iâ\u0080\u0099ll just squeeze in a quick one on cash taxes, when I think about you know some of the losses that you and others have incurred. I mean youâ\u0080\u0099ve been mostly profitable over the last year, year and a half, you were the first back to profitability. So effectively if you look at the cash flow of the business, weâ\u0080\u0099d look like full cash taxpayers. Yeah, well the 8 hour number is sort of our â\u0080\u0093 is where we would like the fleet utilization to be. So like I said, weâ\u0080\u0099re in the 6s now, weâ\u0080\u0099re going to be taking additional aircraft into service as we add pilots, thatâ\u0080\u0099ll sort of stay flattish, and then start to drift up in 2023. The â\u0080\u0093 we were doing like 9 hour utilization numbers in 2019, which is probably unsustainably high because at that time, we were doing some flying red eye stuff and other things that really wasnâ\u0080\u0099t that great. So I think if weâ\u0080\u0099re hitting 8 hours a utilization, thatâ\u0080\u0099s where we need to be and thatâ\u0080\u0099s a â\u0080\u009823 into the second half of â\u0080\u009823 number. So as fuel prices rise, marginal flying is cut, and therefore we were able to manage pass through more effectively the most carriers and as fuel prices fall we can increase utilization to absorb the increased marginal opportunity. But you know that number could be higher or lower, depending on where fuel goes. Yeah, and one other thing, I think because itâ\u0080\u0099s you know the model is a little bit different than some others. So remember, the utilization is not a steady utilization day by day, it is very, very dependent on peak periods. So into the â\u0080\u0093 you know low teens hours per day utilization at peak times, and then significantly lower than that on trough days. So for example, at this point, you have the schedule in place for this yearâ\u0080\u0099s peak season. You know right now the flying, because the pilots would be more efficient flying something else is probably we would like to be a little bit smaller and you know in the immediate future. And in the schedule cycle isnâ\u0080\u0099t delineated clearly, but weâ\u0080\u0099re on a pretty good pace of about 90 days, for 90 days. So 90 days out, weâ\u0080\u0099re planning the schedule for the 90 â\u0080\u0093 91st to 180th day, and that kind of repeats itself. And the schedule is very fluid, the volumes have been pretty consistent, but the schedule as to where the airplanes fly and when they go, itâ\u0080\u0099s pretty fluid. And so you know I think one of the main things is that, weâ\u0080\u0099re one of the carriers, the few carriers, perhaps that can do this for them, because itâ\u0080\u0099s so you know, itâ\u0080\u0099s also a schedule carrier where youâ\u0080\u0099re used to so consistent planning. One other thing that to point out, though, is, while there are no flying minimums, the revenue from Amazon comes in the form of both a fixed payment per aircraft not utilization dependent, and then a per block hour number."
}