{
    "symbol": "SNCY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 20:34:02",
    "content": " My name is Terry, and I will be your operator for today’s call. I’m joined today by Jude Bricker, our Chief Executive Officer; Dave Davis, President and Chief Financial Officer; and talented group of others to help answer questions. Before we begin, I’d like to remind everyone that during this call, the company may make certain statements that constitute forward-looking statements. Our remarks today may include forward-looking statements, which are based on management’s current beliefs, expectations and assumptions and are subject to risks and uncertainties. While it’s been a long and challenging time for our industry and its employees, the last 2 years have shown the resiliency of Sun Country and what makes us truly unique. We believe we have the best people in the industry, and I’m proud of them on a daily basis, serving our growing leisure, charter and cargo customer base. First, we’re already profitable. Although we’re tremendously excited about our growth prospects, we’re not reliant on growth to deliver consistent profitability and cash flow. So in the second quarter, in response to the fuel environment, we’ve been able to focus our growth on peak periods where fares can be achieved to compensate us for our fuel costs. And because of that peak focus, we expect to be able to deliver much stronger scheduled service unit revenue growth in 2Q versus the industry. While it’s great, the industry is seeing a resurgence in demand, our improved unit revenue will be as much a result of our own doing and design. In the first quarter, we grew block hours by 30% versus the same quarter in 2019. Through this time next year, we expect to continue to deliver over 20% growth without future CapEx while deleveraging as our debt amortizes and producing positive cash flow adding to our already strong liquidity position. Again, I’m so proud of all our team members here in Sun Country and what we’ve achieved to date and excited about the future. With that, I’ll turn it over to Dave. Q1 was another profitable quarter at Sun Country, including our sixth consecutive quarter of greater than 15% EBITDA margins. Adjusted pretax earnings for the quarter were $15.7 million, and adjusted EPS was $0.20 a share and revenue of $226.5 million, a record for Sun Country. Bookings were soft in January, but since President’s Day, we have seen some of the strongest demand in our history. In terms of quarterly unit revenue, scheduled service TRASM was down 1% on a 10% increase in scheduled service ASMs when compared to the first quarter of ‘19. However, scheduled service TRASM in March increased 4% versus 2019, while scheduled service capacity was up 8%. For example, we’re typically one of the largest charter carriers for the NCAA basketball tournament, but we didn’t participate this year due to capacity constraints. We’ll return to this type of flying in the future as our staffing picture steadily improves, again, illustrating the unique optionality that our 3-pronged model affords us. Despite Q1 being the first full quarter of operating under our new pilot agreement, our adjusted CASM of $0.0621 was only 0.6% higher than Q1 of ‘19. Excluding fuel and special items, total cost per block hour in the first quarter was 5.9% below Q1 of ‘19 despite the cost of our new pilot agreement. We paid an average of $3.20 per gallon for fuel during the quarter, which was significantly higher than our initial Q1 plan and almost $1 per gallon higher than it was in the first quarter of ‘19. In March, which was our heaviest flying month of the quarter, fuel costs were $3.58 per gallon, yet we still produced an operating margin of greater than 20%. As we enter a seasonally weaker second quarter, we’re pleased with how the quarter is shaping up. We expect operating margin to be in the plus 5% to 9% range for the quarter, even in spite of forecasting a fuel price of $3.50 per gallon and facing some unit cost headwinds in Q2. We’re rightsizing our capacity to maximize profitability in a high-fuel environment, while responding to staffing challenges. As we implement our new agreement, we’re expanding our training capacity and plan to increase the size of our new hire classes, allowing us to grow faster in future quarters. With that, I’ll open it up to questions. A little commentary on cargo though is keep in mind, it’s a long-term contract with escalation annually that’s fixed. I mean you said that you didn’t fly the NCAA planes this time because of availability, and that makes sense. I’m just wondering kind of how much flexibility you guys have in your charter contracts because I think one of the good things about this contracts that they are long-term contracts, and they’re pretty sticky. Hello, Ravi, it’s Dave. Remember, our charter business is composed of a fixed component, basically a component under contract, I’ll call it, which we fly and we want to continue to fly and we will. And as we’re prioritizing the use of our resources, let’s say, pilots, whatever the constraining resources is at any time. And then the rest of it, we adjust for the yield environment or for fuel prices, most of that’s in scheduled in the ad hoc, which comes at the very end of our planning horizon, we can adjust for the staffing situation at the time, the opportunity cost from sched service, anything really. Understand 1Q is a bigger quarter for you historically on scheduled service, but wonder if you could sort of give any color on the composition sequentially. As we move into the year, I mean, remember, Q1 is our big quarter, particularly from a scheduled service perspective. So as we move into the year, particularly in Q2, there will be a modest shift away from the scheduled service business into the charter business as we reallocate resources there. Also our MLS and Caesars contracts, I think Caesars didn’t get really started until March. So that’s really ramping up now, and that will be a bigger piece of our flying in the second quarter as well. The cargo business, the number I gave you is plus or minus 1% or 2% on a quarterly basis. And then just on scheduled service, it’s natural in the face of like what fuel did that, you’d pull back on that and protect your margins. And obviously, the revenue environment has played out such that it’s been a lot stronger, certainly a lot stronger than what we were looking for. Well, so first, I mean, keep in mind that we’re still having a distribution of opportunities that include weak and strong flights. We certainly have looked at really peak opportunities where we can -- we’re tied on crews, and we’re thinking always about how we can allocate those across the opportunity set. So if you look at some of the cuts we made, that’s because of fuel prices. So I think -- we can’t give you an exact answer, but we’re just always modifying the schedule based on inputs to include the yield environment and the fuel prices and trying to continually hit a hurdle rate in every given period. Yes -- I mean our third quarter plan, we think, is appropriate at today’s forward curve, which is in backwardation. So if we don’t get a decline in fuel prices, we’ll probably have to cut a little bit more. And if fuel falls faster than we expect, then we’ll probably have some opportunities to add. In other words, I think we’re probably about right. Yes, that’s about right. The company -- we have so our company’s been around for a long time and traditionally was hiring 5 or so a month on a lumpy basis, and now we’re growing sort of unprecedented rates. And we’re starting to hit bottlenecks across the training production timeline to include SIMs which we have -- we went from 1 to 2, we need to go to 3, check airmen, which we’re in the process of training more and getting more approval from the FA for more of those. So we’re eliminating these bottlenecks, but we’re just -- we’re growing at 30%, and that’s difficult to do in this environment. Yes, the other thing -- hello, Brandon, it’s Dave. That’s one metric, but a more relevant metric for us is total block hours because we’ve got this big cargo business now that we didn’t have 2 years, 3 years ago or whatever. When you look on that metric, we’re up 25% in terms of total capacity in the second quarter. It hasn’t come down to what it was before, which we wouldn’t expect it to given all of the hiring at legacy carriers. And the good news is applications continue very strong, and we’re filling our new hire classes. What we’re working on now diligently is expanding the size, the aperture of that funnel so that we can get our classes up even larger and continue the growth sort of going forward. And one last one for me, I think you said rates were up like 30% with the new contracts, but you had a lot of efficiency offsets that you expected with it. So preferential bidding, which almost -- which most other airlines have, we didn’t have. There’s some of the other stuff that we’re seeing that is bearing some fruit, some of the commuter stuff, but that PBS change is going to be the big benefit to us. But you do have the new pilot contract, and you just said one of the biggest productivity offset doesn’t come until next year, but you still saw cost ex-fuel on a per block hour basis down 6% from ‘19. I mean, there’s a few things. One is just we’re bigger, so we’re spreading costs overhead over more block hours, which is also reflected in our CASM number. We’ve done a lot of work, as we’ve talked about a number of times here on the fleet front over the last few years and driven our ownership costs, which is one of our biggest cost items, clearly, down significantly in excess of 25% over the last several years. We’ve got an active program now buying green time engines as opposed to expensive overhauls, which is another benefit of our older fleet strategy. And so is there may be just as we think about -- I think you said over the next year, you’re going to keep growing like 20% plus just with the aircraft you’ve got locked in. I mean, I can’t give you the exact numbers in the quarters ahead, but that all of those concepts are absolutely still there. And particularly, as we continue to grow and add flying, we’ll continue to spread our costs out over more block hours. Yes, that’s the big wildcard is how -- as we talked about before, we’re very targeted in where we fly. I mean I think the right way to think about our margins is when it’s as good as it can get for everybody else, we’ll be right there with them. So the ancillary products that are most relevant are ones that are accretive to total revenue per passenger -- and we think we have about $5 to $7 of upside in there based on third-party products, increased efficiency, effectiveness of our pricing in bags and seat assignments. And we’re rolling out bundles, which is going to be really effective. But what you’re going to see in our financials, just to warn you, is pretty rapid acceleration of our ancillary revenue per passenger because of that PIF and that’s just going to be a displacement of the airfare. So when -- you just may be careful as you interpret comparisons across the industry for ancillary revenue per passenger, the stuff that matters is the stuff that is accretive to total revenue. And that is particularly if you think about the stack of ancillary products, bag seats, people kind of expect to have to bring a bag and therefore it’s priced into the airfare, seat  a little less, so you don’t have to buy one. Third-party product sales you’re going to buy anyway, those are totally accretive. The PIF, I think, Allegiant calls it a customer convenience fee, it’s a CIC, customer interface charge, at Frontier. I can’t remember what Spirit calls it, but they all have one and it’s basically just a fee that moves money from fare. We’re not in a big rush to grow our cargo business, quite frankly. I mean we need to try to continue to push peak period scheduled service, which is really strong today. I mean, it’s a steady hill of average airfare sold every day. It’s linear and this kind of inflection point, I know you’re hearing all the CEOs across the airline say it, but it’s very rare. You’re going to pay a lot of travel because there’s, not enough seats out there. Presumably, that’s the strip. Yes, that’s the strip along with some assumption for some crack spread narrowing, to be honest with you, that’s probably, I don’t know, 4 or 5 days, 6 days old, something like that. So if you look to the first quarter, we probably paid a little higher fuel price -- significantly higher fuel price than comps. And that’s because the majority -- as compared to them, more of our flying happened in March when fuel is higher, which is -- that’s our business plan. It’s the reverse in the third quarter, et cetera. And then this last quarter, I mean, you did make a pretty meaningful shift to your scheduled capacity, and it’s -- look, it’s the right thing. I know you said you were 66% in the March quarter, June quarter, it looks like it’s going to be a little bit less than for scheduled. 2, 3 months ago, what were you above 70 and maybe there was less for Charter and now you’ve been able to shift. And so optimally, we’re at about 25% fixed flying 75% sched. So -- and then there’s other variations of that inputs associated with the yield environment or fuel prices or anything else, competitive backdrop, aggressive or benign or whatever. And so -- but I think over time, we’re going to kind of correct into that place where it’s about 75-25 sched versus track and cargo, which basically operate the same -- in our business and, Grant, if you’ve got anything else? And so as we -- if you would have stepped back in time, we definitely made the adjustments you made -- or you commented on from a scheduled service, which were absolutely the right ones done with this -- through a strategic framework. So you’ll see a little bit of reduction there, but still executing and operating at a high level for our biggest customers. And how does it compare to this time last year and then, let’s say, 3 to 5 years on average pre-pandemic. Hello, Chris, let me make a couple of general comments, and I’ll throw it over to Grant. It is a -- if there’s low prices in a flight, it cut, we just won’t fly it. And I’d probably give us a grace of about 2 weeks to the end of February to kind of this is real and different and good, where we would say, okay, now we’re pricing in the new environment. And we had sold in the second quarter about 1/3 of our segments by the end of February with 2/3 yet to be priced into the new environment, and it’s about 15% at the third quarter. But all fair, so post March 1, it’s kind of on a year over 3-year basis high, but like steady. It’s just back in 2019, it’s just we’re selling a lot of higher fares. And the only thing I would add to that, Jude -- we have teams, the revenue management, the yield management team especially these are folks who know these markets really, really well. So they’re seeing this, and they’re doing a really good job of making sure that we are selling fares at the highest level that the market will bear, being cognizant of other things. So when we look at kind of the model historically in scheduled service, you’ve had good revenue. You’ve had decent fares, you’ve had decent yields. It’s a good question, and I’ll let Grant answer, but I just want to highlight a couple of differences that we have. The nature of seasonal flying when it begins and ends is that there’s a naked leg, right. We fly when people want to fly, so we’re getting the ancillary benefit from that as well. So while at a system level we may be down, you can absolutely look at markets that we’re really excited about, and we’re making strategic bets there."
}