{
    "symbol": "SEM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 13:15:17",
    "content": " Excluding grant income, adjusted EBITDA for this quarter would have been $165.9 million compared with a 10.5% margin compared with $244 million with a 15.6% margin last year. Excluding the decrease in CARES income, the most significant contributor to the decrease in Q2 adjusted EBITDA for prior year was the salary, wage and benefit increase in a critical illness division, while Q2 was the first quarter to show reduction in agency expense. Adjusted EBITDA margin for the critical illness was 4% for the quarter compared to 13% in the prior year as our salary, wage and benefits to revenue ratio increased by 14%. The overall salary, wage and benefit to revenue ratio for inpatient rehab hospitals increased by 4% from prior year Q2, but improved by 3% from Q1, 2022. Although, when comparing this quarter to prior years, revenue declined by $15 million as a result of the significant demand for COVID related testing and evaluations in the second quarter of 2021. In the second quarter, outpatient division experienced a 5% increase in salary, wages and benefit to revenue ratio compared to prior year but improved by 1.5% from Q1 2022, which represents an improvement for the last two quarters. The reductions we realized during this period were 22% for rates with the average rate for Q1 of $143 an hour, dropping to $111 for Q2, a 13% reduction in utilization moving from 37.5% in Q1 to 32.5% in Q2, and a 37% reduction in agency expense from $89.4 million in Q1 to $56.4 million in Q2. We saw a reduction from April to June of 23% on rates from an average rate of $123 in April to $95 in June, dropping 29% in utilization from 38.2% in April to 26.9% in June, and a drop of 48% for overall agency expense from $24.4 million in April to $12.8 million in June. We have seen this trend continue for the month of July with a 5% reduction in rate to $90 an hour, 10% utilization reduction to 24.1% and a 13% reduction in total agency expense to $11.1 million. Our debt balance at the end of the quarter included $2.1 billion in term loans, $350 million in revolving loans, $1.2 billion in 6.25% senior notes and $88.4 million of other miscellaneous debt."
}