{
    "symbol": "SEM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 15:07:05",
    "content": " For the quarter, the total company adjusted EBITDA was $153.1 million compared to $208.6 million in the prior year. Our outpatient rehabilitation hospital division experienced a 4% increase in net revenue, with patient volumes increasing by 3% compared to same quarter prior year. The decline in adjusted EBITDA margin is primarily due to a 5% increase in salary, wage and benefit to revenue ratio and a 14% increase in other operating expenses to revenue ratio compared to same quarter prior year. With the continued improvements in our indirect labor costs along with the anticipated reductions in orientation, education, incentive bonuses, administrative fixed costs and increased revenue we are confident that our SW&B to revenue ratio should be in the 55% to 57% range in Q1 of 2023. Our debt balance at the end of the quarter was $2.1 billion in term loans, $380 million in revolving loans, $1.225 billion in 6.25% senior notes and $84.2 million of other miscellaneous debt. We still expect capital expenditures to be in the range of $180 million to $200 million for the year and as stated last quarter, we will readdress our business outlook and target growth rates for adjusted EBITDA and earnings per share when we believe the labor market has stabilized and are predictable. We're hiring -- I mean I think if you take a look at year-to-date, between 2021 and 2022, we've hired 70% more nurses. I mean it sounds like you sort of have a time frame in which these onboarded nurses training will be done and you're expressing confidence in the 55% to 57% SWB as a percent of revenue, what incremental piece of information are you looking for to get back to starting to give guidance again on the operating income. And as â\u0080\u0093 I mean if you take a look at what's going on in labor market if the labor market continues the way we think it will, which we'll probably see over the next quarter or two, we'll be in a position to determine whether we feel comfortable giving guidance on EBITDA and EPS. Well, it's 1% is the LIBOR rate and then you have a -- with the spread on top of that our spread is in the $250 million range."
}