{
    "symbol": "FATH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 16:01:15",
    "content": " Before we begin, I'd like to mention that today's presentation and earnings press release are available on Fathomâ\u0080\u0099s website at www.fathommfg.com, where you will also find links to our SEC filings along with other important information about our company. The forward-looking statements represent management's expectations only as of today, and the company disclaims any obligation to update them. Thanks, Michael, and welcome everyone to Fathomâ\u0080\u0099s third quarter 2022 conference call. Our performance for the quarter was in line with management's expectations, as we continue to increase our orders and sales momentum, while extending our track record of profitability in our core operations and cash generation, a key differentiator of Fathom. In Q3, we posted revenue of $40.2 million, while adjusted EBITDA totaled $7.1 million. Additionally, we work closely with enterprise level customers who seek a comprehensive digital manufacturing partner to help them iterate faster and reduce time to market. As we discussed on our previous call, we made important strides during the second quarter building out a high performance, platform based strategic sales team to help drive long term growth. During the quarter, both our orders growth and revenue growth improved each month and encouraging sign as we aim to close out the year and enter 2023 with increasing momentum. In fact, Fathom achieved record order performance in the month of September for additive technologies. While Mark will discuss our financials in more detail, our orders totaled $40.3 million in Q3. During the quarter, we secured new additive orders from two notable customers in the fast growing EV market totaling $1.2 million. We also achieved new wins in other key end markets, including aerospace and defense, semiconductor, and robotics by taking advantage of our robust technology agnostic platform, which allows us to adapt our 25 plus manufacturing process to our customers' specific needs. As you've heard me talk about before, one of the key strengths of the Fathom platform is our entrenched relationships with large strategic customers, which provides Fathom with an attractive reoccurring revenue stream given our retention rate of 90%-plus. By partnering with some of the world's most innovative Fortune 500 companies, working with them across multiple sites and developing extensive contacts within each company, we have seen continued growth among our strategic accounts over the past year. On an LTM basis, we have grown the number of customers spending more than $1 million with Fathom annually from 26 customers in 2020 to 35 customers today, an increase of approximately 35%. More importantly, we have generated a revenue CAGR of approximately 20% within our $1 million plus revenue customers since 2020. As our commercial activities continue to take hold, we plan to open our new Silicon Valley technology center in early Q1 â\u0080\u009823. This advanced hub will ensure continuous proximity to our strategic customers and provide a unique opportunity to demonstrate first-hand, our cutting edge technologies and provide an outlet for Fathom to better partner with leading OEMs to showcase new technologies. This facility will be where we introduce our customers to some of the latest advancements in additive and advanced manufacturing, including the EVOLVE system. Throughout 2022, we have made important progress expanding our industry leading platform by adding new technologies, which have considerably strengthened both our capabilities and growth prospects. Most recently, we took delivery in the quarter of three new multi-jet fusion machines from HP, providing breakthrough productivity for additive manufacturing ideally suited for low to mid-volume production environments. Regarding EVOLVE, we expect to take delivery of this new additive technology by early 2023 at our Silicon Valley Technology Center. This technology is a one of a kind additive process, which dramatically reduces lead times for parts compared to traditional injection molding processes. Our facility in Oakland is scheduled to officially close in January, following the transfer of our entire CNC operations and additive technologies to our company headquarters in Hartland, Wisconsin. In addition to our new MJF, DMLS and SLS technologies that I just mentioned, a Hartland facility recently took delivery of two DMG Mori 5-axis machines. This dynamic, high performing technology integrates speed and precision and will help expand our dedicated quick turn CNC capabilities which is a high margin and our fastest growing segment within Fathom. Our state-of-the-art MPI facility in Hartland will enhance our national manufacturing footprint while serving as a valuable complement across our other sites to provide a one stop outsourced solution for low volume, high mix production that supports customization and delivers a superior customer experience while generating greater economies of scale across the entire data manufacturing platform. Consistent with our strategy to create world class manufacturing centers in key strategic markets, we remain on track to open a greenfield site in the Austin, Texas area in the first half of next year. This week long event, which was held in September for the first time since 2018, represents the biggest manufacturing event in North America with over 85,000 attendees and 2,000 exhibitors. We met with existing customers exploring opportunities to expand our relationships, while securing a significant number of new high quality leads across a wide range of the industries. By executing our go-to-market strategy, we expect to build deep and entrenched relationships with additional Fortune 500 tier companies and achieve greater market penetration for our additive and traditional manufacturing technologies. In quarter three â\u0080\u009821, revenue totaled $41.5 million. Our performance in the quarter was driven by growth in precision sheet metal and CNC machining, we continue to build positive momentum on the commercial front and posted a sequential increase in our monthly sales throughout the third quarter. For quarter three, our revenue by product line was as follows. As mentioned earlier, we are investing in new additive technologies and believe our new Silicon Valley Technology Center will further strengthen our growth prospects in this segment. We remain focused on adding more resources to improve our overseas supply chain, including the development of a new software support system to drive future growth in our injection molding business. CNC machining climbed 9.7% to $15.5 million or 36.8% of total revenue, reflecting our ongoing ability to capitalize on cross-selling opportunities and previous acquisitions completed in the first half of 2021. And finally, ancillary technologies, our smallest product line, rose 4.5% to $1.8 million representing 4.5% of total revenue. For the first nine months of the year, our revenue increased 13.8%, primarily due to acquisition related activity and growth within Fathom's strategic accounts as we maintain our focus on expanding our share of wallet with existing strategic customers and adding new corporate accounts. On Slide 5, we provide our adjusted EBITDA performance for the third quarter. In quarter three, our adjusted EBITDA totaled $7.1 million representing a margin of 17.5%. In the prior year period, we reported adjusted EBITDA of $8.6 million for margin of 20.8%. This was driven in part by strategic pricing adjustments and ongoing cost improvements, partially offset by lower volume leverage. Upon completion in mid-â\u0080\u009823 of our various initiatives, we expect to generate annualized cost savings totaling approximately $5.5 million. We also held additional Kaizen events at our facilities in Hartland, in Tempe, Arizona to foster a culture of continuous improvement following our initial workshop at our Miami location earlier this year. SG&A increased year-over-year by 12% to $11.9 million, primarily due to the incurrence of public company expenses following our listing on the New York Stock Exchange. Now excluding stock compensation, our public company costs in quarter three declined as anticipated on a sequential basis by approximately 13% to $2.1 million. We ended the third quarter with available liquidity of $31 million, this includes $8 million in cash and cash equivalents, and $23 million of undrawn commitments under our $50 million revolving credit facility. As of September 30, our total gross debt excluding cash was $149.7 million and net debt totaled $141.7 million with no debt maturities before December 2026. We generated $2.3 million in operating cash and our CapEx totaled $4.3 million, which is higher mainly due to timing as we do expect a notable decline in CapEx spending in the current fourth quarter. Our CapEx spending for the year is slightly ahead of our plan, but our year-to-date CapEx also reflects payments from previous commitments that were made at the end of 2021. Now as Ryan mentioned earlier, we continue to execute our capital deployment strategy with key investments in additive and CNC machining to further enhance our unmatched capabilities increase throughput and we expect to begin generating positive returns on these investments beginning in 2023. We also continue to integrate multiple ERP technologies into a single scalable cloud based solution to boost our productivity, in line with our efforts to improve the overall digital threat of our business and expect to complete the ERP process by the end of next year. Now as a final note on this slide, subsequent to the end of the third quarter, we amended our existing credit agreement, providing for covenant relief for both leverage and interest coverage. Specifically, the maximum net leverage ratio increased to 4.5 times through June 30, 2023 with a step down to 4.25 times through December 31, 2023. With just under 50 days left in the year, we revised our range for annual revenue, which is now expected to be between $163 million and $165 million for an increase of approximately 8% at the midpoint on a reported basis. For quarter four, we expect adjusted EBITDA of $8 million to $10 million representing a higher margin of 20% to 23.8%. At that time, we intend to begin issuing guidance on a quarterly basis only. We are pleased with our performance for the third quarter, which was consistent with our expectations as we continue to deliver profitable results and generate positive cash flow. We also gained solid traction from our commercial actions with expanding our monthly orders and sales throughout the quarter, and continued strong growth within our most important segment of our large strategic accounts. We're encouraged by our increasing productivity, which bodes well for further improvement in Q4 and into 2023. In addition to building a strategic platform based commercial team, we successfully bolstered our growth prospects by taking delivery of new technologies, particularly in additive and CNC as we continue to invest in the business. With numerous steps we have taken to date in 2022, Fathom is in a much stronger position to drive long term, profitable growth than when we went public just under a year ago. And with the ongoing execution of our optimization plan, we expect to enhance our ability to fully leverage our scalable platform for the benefit of the company and our shareholders. Although, the macro environment remains uncertain, we are focused on what we can control and we believe in our differentiated business model, highlighted by extensive and entrenched blue chip customer base across diverse end markets, comprehensive manufacturing services and a track record of profitable growth during previous downturns such as what we encountered in March of 2020, when our key customers leaned on us even more. I'm proud of the progress our team has achieved in transitioning to a New York Stock Exchange listed company, and I'm confident the best is yet to come as we advance our mission to accelerate manufacturing innovation for the most product driven companies in the world, while creating a more agile and responsive supply chain. I would say, as we talked about in our prepared remarks, we saw through the addition of our -- the commercial resources that we talked about in the second quarter. I think the value of our platform is really the diversification around the different technologies, the end markets, the entrenched customer base that we have. As it relates to that, so we've seen -- I think as we talked about before in the second quarter specifically and even a little bit into the beginning of the third quarter, we saw a lot more pressure on the more commoditized really quick turn additive. I think some of the larger projects that we're seeing, -- we're still seeing really good demand in those. We're seeing a lot of especially as I talked about earlier in the call on the EV space, we're leveraging maybe three or four different manufacturing processes where we may be helping a customer go from that initial prototype 3D printing to urethane casting through bridge production injection molding and the opportunity of the reason they're looking for us is that we're able to reduce their entire time to market. In a lot of cases, somewhere between 25% to 30% by -- being able to handle all those different phases of the development all the way through to mid-production. We'll get a little bit of it in fourth quarter, but most of it will start cutting in. Iâ\u0080\u0099d say, if I handicap, I'd say 75%, 80% of it will start first quarter and 100% by the end of quarter two next year. So the additive is probably the biggest area that we saw -- the turnover in the sales team to get the right team in place to be able to grow this platform, which we're fully staffed and we're really excited about the team that we have in place. You saw the impact in the revenues because that would -- the revenues per additive in the third quarter would be the orders that you would have gotten May, June, July time period. Just as an example, I talked about the 3 HP multi-jet fusion machines that we added in the third quarter. We're continuing to see strong demand there, especially for some aerospace and defense customers with running pretty much 24/7 there as well. So we're seeing the ramp up from the orders which will translate into the revenues into fourth quarter and into Q1 of next year, Jim. I think as we look across the margins in our different manufacturing process, they're all relatively similar from a margin perspective, which is why we really think about technology agnostic approach to the customer and trying to understand what's the best technology, what's the best material, what's the best process to solve the manufacturing challenge they have. If you think about the areas from end markets that we're seeing that are really strong for us right now, the medical space, we're continuing to see strong growth there. So it's additive, both plastic and metal, injection molding, CNC machining. Typically, we've done $2.5 million to $3 million of CNC machining of high precision kind of mid-volume production components for them. It's our ability to provide a faster solution to allow them to ramp their new products, which is a key initiative for their company. And so that's kind of where we see it from broad in a couple of different examples of different industries and markets that we're seeing in spite of maybe the macro environment that a lot of people talk about, we think there's still a lot of opportunities to gain market share and continue to grow. What I would say is, it will be probably down roughly 5% from quarter three as we continue to normalize and to improve our -- get more efficient, I would say, on managing the public company costs. I would say, if you look at the performance through the first-nine months and in Q3, you can see the growth that we're having within the CNC machining and precision sheet metal, which is a little more of our mid to low volume production side of our business. The additive injection molding, the revenues in Q3 is really more of an impact related to as we talked about really getting the right sales team in place. And so as you experienced, as we transitioned our sales team from kind of a legacy to more of a strategic platform based sales team. We certainly saw an impact in the orders momentum in the second quarter, which then impacted the growth in the third quarter, specifically within injection molding and our additive side of the business. Like I talked about before, we're really excited, we're fully staffed from a commercial team. And so a lot of those reps are still in months, three at this point, but we think we can ramp them faster because of the industry experience and we believe that will lead to. And so we still feel -- we're still very, very bullish, which is why we talked about the investments we've made from a capital perspective to be able to support the orders ramp. We don't see as much customer related seasonality, but there is an impact from the commercial impact on our business that we do historically tend to see a little stronger fourth quarter and a little weaker first quarter because of that commercial impact on how your reps are pushing for the end of the year. That's how it's going to behave, which potentially, I'll be honest, could be an upside in quarter four, but we're not guiding in that matter. We're trying to be cautious here as we move forward, but that's normally what we see in the business Wamsi. So just on gross margins, you saw kind of like 165 basis point increase here in 3Q with kind of similar run rate of revenues from last year and also kind of up sequentially here, kind of expand on the drivers. Paul, we've talked about on previous calls that we've been selectively, particularly on some of our low to mid production business, gone back and raised pricing on certain relationships and we haven't really gotten pushed back. We do expect a nice improvement and that's one of the key ingredients that we think can move us back towards that 40%, low 40% level of gross margin and that's why we're pretty positive. And obviously with the optimization plan benefit, which is half of the $5.5 million, that also will support pretty significantly our ability to improve the margins as we go into 2023. And then lastly on cash flow, I know there's a lot of moving pieces with restructuring and very dependent upon top line and scale. The other is, we taken some one-off charges related to taxes related to vesting of shares that's an almost $3 million cash usage we had. I think we're running in the 30%, 40% range right now and the ability to improve that by 30% to 50% is something we're working on for 2023. And as I mentioned in the prepared remarks, we're -- from a commercial perspective, at this point, we're fully staffed. We've got roughly in our overall commercial organization between strategic sales, regional, inside sales, sales support, and our marketing team, there's roughly about 60 resources that's associated with that. And then of that, about half of those are focused on the front end of the business between our strategic sales team, which covers roughly our top 100 accounts that generate about 70% or so of our revenues. And I think it's a real testament to what we're doing at Fathom, the value proposition that we're selling and the capabilities that we have both through our internal 12 different manufacturing facilities and different centers of excellence around different manufacturing processes. So think it's a real testament to what we're building, the value proposition that we have and the people we've been able to bring on. So normally, as I said, it's about a six to 12 month ramp about half of the team is new to their role within the last three months. But we think because of the experience and the types of people that we hired in Mcalibur (ph), we think we can get them ramped even faster and so that's where we're really excited."
}