{
    "symbol": "FATH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 15:17:13",
    "content": " On an organic basis, excluding the impact of acquisitions, revenue was up 9.4% in the quarter, including growth in all four of our key manufacturing technology line, and adjusted EBITDA increased 16.1% to $8.7 million, representing an industry-leading margin. Although the positive secular drivers in our business remain intact, including the condensing of product development life cycles, reshoring of U.S. manufacturing, consolidation of supplier partnerships and the digitization of manufacturing, our second quarter orders of approximately $40 million were slightly below our expectations. Now during the second quarter, we invested $3.3 million in capital expenditures mainly related to two new technology offerings in Additive and CNC as well as the integration of multiple ERP technologies into a single scalable cloud-based solution to boost productivity. Now based on our performance in the second quarter and year-to-date, combined with our current outlook for the second half of the year, we now anticipate revenue for 2022 to range between $165 million and $171 million, representing an increase of approximately 10% at the midpoint on a reported basis. Our Q2 revenue growth of 17% demonstrates the continued demand for our comprehensive manufacturing services and positive secular tailwinds and our adjusted EBITDA increased 16.1% to $8.7 million, representing a margin of 20.6%. We're making investments in more efficient post processing to be able to provide better parts faster to our customers in the plastic additive, and that's why we've also talked in the past around the investment that we're making in the EVOLVE technology, which we think will be a really differentiated technology that won't be as commoditized and price driven in some of the other areas of additive manufacturing. If you think back to the second quarter, which the orders that you're going to get in the second quarter are typically where you're going to see the revenues in the third quarter, those types -- the companies that are in the S&P 500 had the worst performance from a stock perspective in the last 50 years. But as you think about the long-term value creation of this business and really being an extension of the manufacturing and R&D teams for these enterprise customers, I feel stronger now than ever that we're going to continue to be the leader in being able to grab significant market share in that market with the large enterprise customers."
}