{
    "symbol": "BABA",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-23 14:32:07",
    "content": " During December quarter, we have continued to improve operating performance of our loss-making businesses by enhancing operating efficiency and optimizing costs that resulted in 16% year-over-year increase in adjusted EBITDA to RMB 52 billion. Non-GAAP net income was RMB 49.9 billion, an increase of RMB 5.3 billion or 12% year-over-year, mainly due to increase in adjusted EBITDA, partly offset by a decrease in equity pickup of our equity method investees results. Direct sales and other revenue grew 10% to RMB 74 billion, primarily driven by strong growth of our Freshippo and Alibaba Health's direct sales businesses. Our local consumer services segment revenue in December quarter grew 6% to RMB 13 billion, primarily due to positive GMV growth of 2 home business, driven by higher average order value of Olam. Revenue from Tania, after intersegment elimination, grew 27% year-over-year to RMB 16.6 billion, primarily contributed by the increase in revenue from domestic customer logistics service as a result of service model upgrade since later 2021 to enhance consumer experience as well as increase in revenue from international fulfillment solution services. Revenue from cloud segment after intersegment elimination was RMB 20.2 billion in December quarter, an increase of 3%, mainly driven by healthy double-digit public cloud growth, partially offset by declining hybrid cloud revenue as we continue to drive high-quality recurring revenue growth. Adjusted EBITDA of cloud segment, which comprise of Alibaba Cloud and Ding Talk was a profit of RMB 356 million in December quarter, increased by RMB 222 million year-over-year. I'm just wondering if you could break that down for us a little bit and explain which of the businesses this year we can expect to see adopting new technological innovations that lead to new business models and new opportunities that will, for example, result in accelerated CMR growth or boost cloud revenue or will perhaps be in local services, where these breakthroughs will be met."
}