{
    "symbol": "WHD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 16:53:16",
    "content": " Some fourth quarter highlights include revenue increased 2% sequentially to a company record $188 million; adjusted EBITDA improved by 4% sequentially to a company record $66 million; adjusted EBITDA margins were 35%, up 90 basis points versus the third quarter. We paid a quarterly dividend of $0.11 per share, and we increased our cash balance to $345 million. As Scott mentioned, Q4 revenues of $188 million were 2% higher than the prior quarter. Rental revenues were $27 million for the quarter, up 1% versus the third quarter. Fourth quarter adjusted EBITDA was approximately $66 million, up 4% from $64 million during the third quarter. Adjustments to EBITDA during the fourth quarter of 2022 included approximately $3 million in stock-based compensation, $7 million in FlexSteel acquisition-related fees and expenses, and an add-back of $2 million in other expense related to the revaluation of the company's tax receivable agreement. Consistent with the fourth quarter's presentation, we've now revised the adjusted EBITDA for the third quarter of 2022 to exclude $1 million in FlexSteel acquisition-related expenses that were not previously added back to our adjusted results. Depreciation expense for the fourth quarter was $8.1 million, approximately $8 million is expected in the first quarter of 2023. We prefer to look at adjusted net income and earnings per share, which were $44 million and $0.57 per share, respectively, during the fourth quarter versus $40 million and $0.52 per share in Q3 2022. As previously stated, we've revised the adjustments for the third quarter of 2022 to include the $1 million in acquisition-related expenses that were not previously added back. During the fourth quarter, we paid a quarterly dividend of $0.11 per share, resulting in a cash outflow of approximately $8.4 million, including related distributions to members. Operating cash flow was approximately $39 million during the quarter, with net working capital representing a cash outflow of approximately $21 million. At this time, we expect to close on a new $125 million Term A facility with a new $225 million upsized revolving credit facility upon transaction closing, which had occurred during the first quarter of this year."
}