{
    "symbol": "CR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 19:00:06",
    "content": " On a full-year basis, adjusted EPS was a record $7.88, up 15% compared to last year, driven by 6.4% core sales growth and 220 basis points of margin expansion to a record full-year adjusted operating margin of 17.7%. At Aerospace and Electronics, fourth quarter sales accelerated increasing 15%, compared to last year to $181 million; segment margins of 20.6% increased 750 basis points from 13.1% last year, reflecting the combination of strong leverage on higher volumes, improved pricing and productivity. Moving on to total company results, on a full-year basis, free cash flow was negative $210 million, because of accounting rules, which treat the one-time contribution from the August divestiture of asbestos liabilities as an operating cash outflow and we had additional one-time costs related to both the asbestos transaction itself, as well as the separation. Specific to the businesses, at Aerospace and Electronics, we are guiding to 10% core sales growth with 35% operating leverage, which should bring margins to just under 20% for 2023. However, with 10% sales growth, we would have approximately $50 million of cumulative unmet demand by the end of this year related to supply chain constraints. However, the overall message for the segment is unchanged, we expect 7% to 9% long-term annual sales growth plus this $50 million catch up of sales in the next year or two with strong operating leverage in the 35% to 40% range, a really fantastic position to be in. Net non-operating expense, which is interest expense and related financing costs of $16 million, a normal post separation adjusted tax rate of approximately 23% and diluted 2023 shares of $57.3 million. We aren't guiding to a specific free cash flow number for 2023, because of complexities of allocating first quarter cash flow to Crane Company and Crane NXT, but free cash flow conversion or adjusted free cash flow divided by adjusted net income should be approaching 100% in 2023 and beyond. At Crane Currency, we expect flat core sales and a modest decline in margins to a still very impressive 24% roughly 2 times to 3 times the margin rate when we acquired the business in 2018. Net non-operating expense, which is primarily interest expense and related finance costs of approximately $47 million, normal post separation adjusted tax rate of approximately 20% and 2023 diluted shares of approximately $57.3. You talked about just a little bit, but flat core growth, the 17% OP decline, I guess I'm looking at it, $11 million in revenue, operating profit down $23 million."
}