{
    "symbol": "MOFG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 11:18:04",
    "content": " Total assets increased $482 million from the linked quarter, which reflected the $515 million of assets acquired in the Iowa First or IOFB acquisition we completed on June 9, 2022. Adjusted core loans, which exclude both SBA PPP and Iowa first acquired loans increased $82.3 million or 10.5% annualized from the linked quarter. Excluding the $464 million of deposits assumed from Iowa First, deposit balances, as Charlie indicated earlier were basically flat from the linked quarter. Total shareholders' equity was down $38.6 million from year-end 2021 due to $56.4 million after-tax change in valuation adjustment on available-for-sale debt securities, $9.7 million in cash returned to shareholders in the form of quarterly dividends and share repurchases, partially offset by net income of $26.5 million. Noninterest income was $12.3 million for the first quarter -- for the second quarter of 2022, which was up from the linked quarter, primarily due to the $1.4 million provisionally measured bargain purchase gain from the Iowa First transaction. We expect the first quarter of 2023 to be the next clean quarter for expenses, following the core system conversions of the former Iowa First Bank in Muscatine, which is scheduled for the fourth quarter of this year -- sorry, third quarter of this year, excuse me. But overall, if you look at the decline in non-pass credits, we see core commercial, again, excluding PPP and Iowa First, core commercial growing $54 million of the quarter, and that's net of a $33 million decline in non-pass credits. We're probably somewhere in the $33 million to $34 million range on a quarterly basis, and that reflects the addition of Iowa First. If you look at the core margin, which factors out some PPP fees that we took in the first quarter that really didn't have in the second quarter, our core margin expanded 15 basis points, and I think that's probably a better reflection of the earnings power."
}