{
    "symbol": "UXIN",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-30 12:26:03",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to Uxin's Earnings Conference Call for the First Quarter of Fiscal Year 2023. I'd now like to turn the call over to your host for today's conference call, Ms. Joyce Tang, IR Director of the Company. Welcome to Uxin's earnings conference call for the quarter ending June 30, 2022. will review business operations and company highlights, followed by John, who will discuss financials and guidance. These statements are based on management's current knowledge and assumptions about future events that involve known or unknown risks and uncertainties, which could cause actual results to differ materially from those in the forward-looking statements. In the first quarter of fiscal year 2023, which was from April to June 2022, we maintained our growth momentum despite peak COVID resurgence across the nation. Our retail transaction volume increased by 30% quarter-over-quarter and more than 250% year-over-year to 2,407 units. We continue to gain trust among consumers with our high core vehicles, efficient processes, transparent pricing and reliable services. We also continue to expand our market share leadership in both in Xiâ\u0080\u0099an CD and Hefei CD, where our two IRCs are located. The two IRCs are the largest 100% self-owned used car superstores in East China and Northwest China, respectively. In this quarter, our Net Promoter Score was 60, remaining stable at an industry top level, consumer reputation through word of more recommendations started to fuel our business growth. Consumers can see our categorial rating for each retail vehicle, including ways for the interior appearance, engine components, cockpit, emission tests, road tax, checks and et cetera, in them of a highly compliant report, we use simplify, standardize and visualize ways to tell our customers the pros and cons of the cars and the applied savings. In this quarter, our operation efficiency continued to improve across the whole business process. For example, the reconditioning time from vehicle acquisition to listing for sale is reduced by about 50%. Following previous measures to reduce value-added tax rates and digitize vehicle reputation nationwide, the regulators have completely lifted restrictions on cross-regional circulations of used cars with National Emission Standard five or above. All these policies will significantly help streamline used car transaction processes from more efficiency circulation, reduce operation costs and facilitate working capital financing. Finally, all major opcos that have hindered used car industry development in the past decade have been completely reduced. Starting from next year, the same regulators will begin strengthening oversight of the used car operations, requiring all dealerships to operate as compliant vehicle enterprises instead of learning the business as individuals. This will mark the gradual ending of the small-size highly segmented  business operations, which are currently dominating the used car industry in China. These policies signified a well-branded, scalable and compliant used vehicle companies to thrive and become major market players. As new opportunities emerge, we believe that customer charts, vehicle quality and service capability, which we have been consistently pursuing as our fundamental principles will be the most important foundation for the future growth of the used car industry in China. Uxin as a used car business leader in China, we've been benefited from this variable policy and sustained our high quality growth on the back of the industry tailwind. Our transformative of upgrades to management systems, supply chain processes as well as product and service quality will set a stage for our next phase of growth. Looking ahead into the fiscal year 2023, we expect our retail sales through continued growth each quarter. Our Hefei IRC will continue to operate at least through capacity, at the same time, the construction the Super IRC co-invested and opacity is currently included, all of our business plans have been making steady progress. Outside are set on the long term, we are committed to providing high positive vehicles, creating a superior shopping experience and offering satisfactory services to our customers. Welcome to our earnings call for the first quarter of fiscal year 2023, which is the three months ended June 30, 2022. Driven by a 29% quarter-over-quarter growth in our overall transaction volumes, our total revenues were RMB626 million, increasing 23.8% quarter-over-quarter and 125% year-over-year. Specifically, retail sales revenues were RMB348.4 million, increasing 9.1% quarter-over-quarter and 279% year-over-year. At the same time, we have been optimizing our inventory structure to better meet mainstream demand called mid-range priced cars as we are targeting broader and middle-class customers. The average selling price of retail car swapped to RMB145,000 in Q1 from RMB180,000 in the prior quarter. Although the decrease in ASP partially offset the increase in revenue growth from retail sales volume, an optimized inventory structure with more widely expected price range will lay a healthier foundation for our long-term sales growth. Gross margin was 1.1% for the three months ended June 30, 2022, compared with 0.2% in the last quarter. As I just mentioned, we have been shifting towards mainstream mid-range priced vehicles. These actions led to a currently move gross margin, if we excluded the impact of inventory adjustments, our gross margin would be at the 4% level. While the inventory structure becomes more and more reasonable as planned, we expect our gross margin to improve quarter-over-quarter this year towards a normal gross margin level. We continued our stringent expense management, and the total operating expenses were relatively stable compared with the prior quarter. Although our retail sales volume continued to grow, we redeemed the overall customer acquisition costs, thanks to our cost-effective marketing channels and strategy. The non-GAAP adjusted loss from continuing operations this quarter was RMB84.9 million, an improvement of RMB11 million compared to the prior quarter. As our business continues to grow and our inventory adjustment is finalizing, we expect to see further improvements in the remainder of the fiscal year. At the end of the first quarter of fiscal year 2023, similar to the past quarters, there was a fair value impact related to our financing transactions. In the end of August, the Company issued ordinary shares to clear at a price of $1.03 per ADS in exchange for fully releasing the Company's obligations under the convertible note with an aggregate principal amount of $2.6 million. Today, new capital estimate further payments on -- further payment schedule as part of its total $100 million strategic investment to support our C&IB expansion and pro superiority construction. In addition to revenue guidance, we have added guidance on transaction volumes and average selling prices to give you a better picture of our business progress. For the three months ending September 30, 2022, the Company expects its retail transaction volume to be around 3,000 units representing an increase of 25% quarter-over-quarter and an increase of 192% year-over-year. The average selling price for retail cars is expected to be around RMB118,000. The Company also expects a wholesale transaction volume to be around 2,800 units with ASP expected to be around RMB82,000. The Company estimates that its total revenues, including retail vehicle sales revenue, wholesale vehicle sales revenue and value-added services revenue to be in the range of RMB590 million to RMB610 million. Your retail transactions are expected to grow, while wholesale transactions are expected to decline. As more consumers recognize our products and services, our retail channels will continue to grow. Additionally, as we expand our inventory size and enhance our vehicle acquisition and expansion and reconditioning capabilities, we will have more retail standard vehicles, which will also contribute to the growth of our retail sales. As our retail sales force become more potent, we will retain more vehicles and naturally decrease the percentage of wholesale business. In the long term, we expect 75% of our total sales to come from retail and the remaining 25% from wholesale. Our device purchases from consumers accounted for nearly 40% of our total acquisitions this quarter, and we expect this percentage to increase further. Currently, we collect cars from consumers, mainly from the two IRC locations in Xi'an city and Hefei city as well as the surrounding cities. However, as we expand our inventory set, we will also increase the percentage of vehicle repurchase from consumers in other locations, especially after the removal of cross regional transfers which facilitates the national calculation of high-quality costs. In terms of our vehicle acquisition cost, they mainly consist of the vehicle purchasing price and the related transaction causes such as title transfers and delivery logistics. In addition, this implementation of electronic filing, temporary license plates, a new test treatments, we can reduce our transaction costs in vehicle by doses of dollars. Consequently, the state regulators limited the total number of used cars and individual is able to trade every year, whereas dealerships are now able to complete vehicle transfer directly. In fact on the same regulatory perspective, we still need more companies that can provide high-quality vehicles and reliable services as the driving force to crystallize the used car industry and win customers love for used cars as a product. The used car industry is currently experiencing its most crucial changes in decades, and we hope to take full advantage of such tailwinds to fuel our growth. Repeat my question in English. We will utilize the funds mainly to expand our inventory size, enhance our reconditioning process and support the expansion of the Xi'an IRC and the development of the Hefei superstore that's currently in the construction. Repeat my question in English. Currently, 25% of our transactions are generated purely from online. However, all the customers generally look at the vehicle license, the difference is whether they are located close to our IRCs or not. For customers near our stores, they are more willing to rely us offline after checking out the vehicle offer."
}