{
    "symbol": "KBR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 16:27:10",
    "content": " And in terms of getting ready, I think weâ\u0080\u0099ve said before about the delay, and this in terms of going through this process period has really allowed us to do a lot of the backbone development work and set up the systems and get the resources in place to de-risk the transition, but there still is a nine month transition period, once the award. So, I think that all bears while going into â\u0080\u009823 and other than the, perhaps people override some of the HomeSafe assumptions, I think maybe the underwriting the STS assumptions, I donâ\u0080\u0099t know, but certainly I think weâ\u0080\u0099re feeling pretty strong about the business performance in that area. I think in terms of military space, which is really up going into next year I think thereâ\u0080\u0099s a lot of excitement about our positioning there and the funding thatâ\u0080\u0099s flowing into that arena. So I think, again, thatâ\u0080\u0099s a, itâ\u0080\u0099s an early indication, but that weâ\u0080\u0099ll be able to give you more color, I suspect when we talk about full year â\u0080\u009823 when we meet with end the earnings and in the end of Q1 really, February, or next year. I mean, we said when we redefined KBR that, that what the focus would be on quality of earnings and delivering cash as a consequence, which is a true measure, I think of profitability, and weâ\u0080\u0099ve been very focused on that, really is just that as Mark and that hasnâ\u0080\u0099t changed for several years. In terms of the outlook across the various segments, I think weâ\u0080\u0099ve been very clear that GSI continues to perform really well, has strong backlog, terrific margins, and itâ\u0080\u0099s going great guns. I think weâ\u0080\u0099re seeing in our systems engineering business, which does things like -- and these recurring quick to procure type contract vehicles, itâ\u0080\u0099s good, thatâ\u0080\u0099s going really, really strong and has and weâ\u0080\u0099ve actually reported that quarter-on-quarter for many quarters. And so youâ\u0080\u0099ve got all these factors at play that are hugely aligned with our technology and high end solutions and our technical capability and so I really think itâ\u0080\u0099s, I cannot see that slowing down and I think weâ\u0080\u0099re very well-positioned and certainly our book-to-bill would reflect that actually, this will say the proof of the pudding is in the -- but how many because you have to regardless, I heard people talking about the output. So if the market holds, but ultimately, weâ\u0080\u0099re seeing a portfolio selling very, very well, rather than just one or two technologies, itâ\u0080\u0099s across a range, which I think actually is terrific, because you can never predict timing of these awards. So weâ\u0080\u0099ve not set the guidance for â\u0080\u009823 yet, so itâ\u0080\u0099s difficult to tell you what kinds of contract levels but weâ\u0080\u0099ll be going in with obviously a quite a substantial amount of work under contract given what Iâ\u0080\u0099ve just said in terms of the long term, bedrock of business, but also the book-to-bill and STS as well."
}