{
    "symbol": "MOH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 14:23:03",
    "content": " During our call, we will be making certain forward-looking statements, including, but not limited to, statements regarding our 2022 guidance, our long-term growth strategy, our recent RFP awards and RFP submission and the projected revenue and earnings growth associated with these awards, our outlook with regard to both fiscal year 2023 and 2024, our acquisition and M&A activity. Last night, we reported third quarter adjusted earnings per diluted share of $4.36, representing 54% growth year-over-year. These new contracts are expected to add approximately $5.8 billion in annual premium revenue and at least $3 of earnings per share, once we achieve full run rate margins. Given our strong current performance, we are raising our 2023 core earnings outlook, the earnings that would have been produced by our company before these recent wins from at least $20 per share to at least $20.25 per share. This core earnings outlook, a meaningful measure of underlying performance, represents 14% growth on today's updated 2022 guidance of at least $17.75 per share. When we include the onetime nonrecurring $0.75 per share implementation costs, our reported earnings per share outlook for 2023 is now at least $19.50. As previously described, the $5.8 billion in incremental revenue in 2024 from our recent RFP wins adds at least $3 per share in incremental earnings. Combined, this has created a solid and growing financial profile, at least $20.25 per share of core earnings in 2023, $37 billion of premium revenue in 2024. We increased our full year premium revenue guidance by $500 million to approximately $30.5 billion, driven by 3 components: approximately $200 million for the third quarter outperformance, approximately $200 million for the addition of AgeWell, which closed October 1; and approximately $100 million to reflect the impact of the latest extension of the public health emergency through January and the related delay in resuming redeterminations, which we now expect to begin in 2023. Third quarter outperformance of about $0.15 per share, margin on the additional revenue from the extension of the public health emergency, which we estimate at about $0.05 per share and additional net investment income of approximately $0.10 per share in the fourth quarter, driven by the recent rise in interest rates. Partially offsetting these items is approximately $0.15 per share of expected higher G&A, driven by fourth quarter marketing and open enrollment activities as well as the recent new contract wins. Based on the expected timing of the known revenue building blocks, our initial outlook for 2023 premium revenue is approximately $31.5 billion. Third, a combination of new operating catalyst should enhance our 2023 earnings growth, including our recently renegotiated PBM contract, our expected real estate reduction, and finally, we expect higher interest rates to translate into correspondingly higher net investment income. Recognizing the onetime nonrecurring implementation costs of $0.75 per share on our new contract wins in California, Iowa and Nebraska, yields our updated outlook of at least $19.50 per share for 2023. We start with our previously reported 2022 embedded earnings of $3 per share, we add at least $3 per share of earnings from our recent new contract wins, we decreased it by $1 that is now in our 2023 outlook, and finally, we add the implementation costs for new contracts of $0.75 per share to recognize the onetime nature of IT platforms, program enhancements and several months of staff ramp-up. The following building blocks provide a path from our expected 2022 premium revenue of approximately $30.5 billion to $31.5 billion in 2023, and to ultimately, at least $37 billion of projected revenue for 2024. Third, the incremental premium revenue for the full year impact of AgeWell and the My Choice Wisconsin acquisitions is expected to be approximately $1.4 billion, most of which will emerge in 2023. Obviously, with $6 billion of incremental revenue, growing our Medicaid book of business  by 25% in a short span of time, we expect to get a significant amount of fixed cost leverage off these installations but we kind of hold that back. The $0.75 charge actually creates a little bit of complex -- accounting complexity here, but it's either $5 per share or $5.75 depending on whether you're pro-forming the $19.50 or the 2025. Our embedded earnings concept, given the historic nature of the pandemic and then the incredible growth we've had due to acquisitions and new contract wins, is to give our investor base a view of the future earnings power of the business, whether it's $5 or $5.75 or $6, it's sitting on top of $19.50 or $20.25 of earnings per share in 2023 and should give you a pretty good leading indicator of where the business is headed. But as we said, when you're trying to bridge from the $17.75 of earnings per share guidance for this year to the $19.50 reported for next year or 2025 core, the components are harvesting a component of embedded earnings, organic growth, which we have a great track record of harvesting, significant operational catalysts that Mark mentioned during his prepared remarks, and then, of course, we do expect a tailwind from interest rates given the short-dated nature of our portfolio."
}