{
    "symbol": "MOH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 12:33:03",
    "content": " During our call, we will be making certain forward-looking statements, including, but not limited to, statements regarding our 2022 guidance, our 2023 outlook, our growth strategy and expected growth, our RFP submissions, the COVID-19 pandemic, our acquisitions, our future margins and embedded earnings power and our long-term outlook. Today, we will provide updates on several topics: our financial results for the second quarter 2022, our full year 2022 guidance in the context of our second quarter results, our growth initiatives and the reaffirmation of our strategy for sustaining profitable growth, and an early outlook on 2023 premium revenue and earnings growth. Last night, we reported adjusted earnings per diluted share of $4.55 for the second quarter, with adjusted net income of $266 million on $7.8 billion of premium revenue. For the quarter, we produced 18% premium revenue growth and 34% earnings per share growth. Year-to-date, we produced 19% premium revenue growth and 21% adjusted earnings per share growth. Our increased 2022 outlook features strong premium revenue growth of 12%, which includes the impact of our conscious decision to reset the size and scope of our Marketplace business, a pre-tax margin at the midpoint of our long-term guidance range, and strong earnings per share growth of 30%. That being said, with 2022 adjusted earnings guidance of at least $17.60 per share, embedded earnings power of $3 per share, the earnings contribution of organic growth and the operational catalysts we just mentioned, we fully expect our 2023 adjusted earnings to be at least $20 per share. We have increased our full year premium revenue guidance by $750 million to approximately $30 billion, driven by two components: approximately $250 million, reflecting the latest extension of the public health emergency and the related delay in resuming a redetermination of Medicaid eligibility and approximately $500 million for the second quarter outperformance and some additional Texas pass-through revenue. The increase is driven by three items: second quarter performance above our expectations by about $0.25 per share, margin on the additional revenue from the extension of the public health emergency, which we estimate at about $0.15 per share; an additional net income of $0.10 per share in the second half, driven by the recent rise in interest rates. Beginning with premium revenue, our initial outlook is for the announced pending acquisitions of AgeWell and My Choice Wisconsin and organic growth to drive approximately 10% growth of our current 2022 premium revenue guidance. Turning to adjusted earnings, first, our embedded earnings power is now approximately $3 per share, comprising $2.50 net effect of COVID, $1.50 from our closed and pending acquisitions went at target margin, offset by approximately $1 from the eventual impact of redeterminations. Third, as Joe described, we see a combination of new operating drivers that should enhance our 2023 earnings growth, including our recently renegotiated PBM contract, which improves the economics on 15% to 20% of our total medical cost spend and our expected real estate reduction. We just printed , revenues growing at 18%, earnings per share growing at 34% on both a six-month and a three-month basis, our pretax margins are 5% and after-tax margins are at 3.7%, and we did that by outperforming the ranges of our MCRs, which produce best-in-class industry margins."
}