{
    "symbol": "HT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 10:48:09",
    "content": " As an example, while second quarter RevPAR for our comparable hotel portfolio is still 4.7% below 2019 levels, comparable hotel RevPAR for the go-forward portfolio was 1% above second quarter 2019 levels with EBITDA margins growth 179 basis points above our reported comparable hotel portfolio and 414 basis points above the 2019 period. Urban RevPAR increased 17% from April to June, and the portfolio generated $31.6 million of EBITDA, more than triple that of the prior quarter. Pricing power was especially robust in Manhattan, which in June drove ADR growth of 14% compared to 2019, despite occupancy still trailing pre-pandemic levels by 1,600 basis points. With that, I will shift the focus to our resort portfolio, which, once again, continued its stellar performance throughout the quarter, with occupancy just shy of 75% and RevPAR growth of 36.5% to the second quarter of 2019. The resort portfolio generated $15.8 million in EBITDA, an increase of over $7 million or 80% growth over the second quarter of 2019. The hotel generated $3.3 million of EBITDA, a 158% increase from the second quarter 2019. The Ritz-Carlton, Coconut Grove drove nearly 50% ADR growth and over $1 million in EBITDA, a 148% increase to the second quarter of 2019. In California, the Sanctuary Beach Resort continued its robust performance, posting an ADR of $572 for the quarter, an increase of 49% to 2019, leading to RevPAR growth of 29% for the quarter. The Hotel Milo in Santa Barbara generated just under $1.5 million in EBITDA in the second quarter, an increase of 80% to the second quarter of 2019. Comparable RevPAR achieved 95.3% of 2019 levels in the quarter, the lowest spreads since the onset of the pandemic, while our comparable portfolio EBITDA exceeded our 2019 second quarter EBITDA. Comparable GOP margin was 49.1%, which exceeded the second quarter of 2019 by 282 basis points, while hotel EBITDA margin of 38.7% was 236 basis points higher than 2019. Overall, our resort portfolio continued strong margin growth performance with GOP and EBITDA margins up nearly 1,100 basis points each compared to the second quarter of 2019. I think that if you look out maybe a year from now, maybe by second quarter, weâ\u0080\u0099re probably 85%, maybe 90%, but we donâ\u0080\u0099t really see us â\u0080\u0093 see our portfolio the need to exceed that based on efficiencies that weâ\u0080\u0099ve garnered through the pandemic."
}