{
    "symbol": "HT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 16:01:02",
    "content": " The resort portfolio generated $15.2 million in EBITDA, a 21% increase to the prior quarter and approximately 80% growth on the first quarter of 2019. The Miami Beach market turned in another great performance in the first quarter as the Cadillac had its best EBITDA producing quarter ever, generating $5.5 million; a 73% increase to first quarter 2019. The Ritz-Carlton Coconut Grove rounded out this record-setting quarter with 19.5% RevPAR growth compared to the first quarter of 2019 and generated $1.8 million of EBITDA, its best quarter ever, and the 72% increase through the first quarter of 2019. In California, the Sanctuary Beach Resort continues to demonstrate the pricing power of well-located, high-quality differentiated offerings, posting ADR of $478 for the quarter; an increase of 76% to 2019, leading to RevPAR growth of 36.7% compared to 2019. Our ability to drive ADR growth along with our stringent cost controls and asset management initiatives resulted in GOP and EBITDA margins for the quarter of 40.8% and 28.3%, respectively; roughly 370 basis points better than first quarter 2019. The incremental growth in occupancies in conjunction with our focus on rate integrity and expense savings initiatives resulted in margin expansion and material cash flow generation at our hotels in March as comparable GOP and EBITDA margins for the month came in at 47.4% and 34.7%, respectively; both higher than March of 2019, and we are witnessing this type of margin performance in April as well. So, with additional occupancy, we believe that our pricing, which is now getting to be anywhere from 3% to 5% off on 2019 in these urban markets is going to exceed urban market RevPAR ADRs from 2019, probably in Q2 or Q3, which is really going to drive margins even further. As we look forward, the hotels that require additional capital in the next couple of years to drive portfolio-level EBITDA growth rates; there's two to three hotels that would fit that that criteria for looking at recycling assets. And once pricing gets to a level, you're not seeing like these kinds of hotels like we have, like purpose built, high-quality, newly built assets trading in the marketplace because the sellers -- there's not many sellers at today's price."
}