{
    "symbol": "NGVT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 15:24:06",
    "content": " Adjusted gross profit of $636 million was higher by almost 10%, but margins were down for the year as input costs accelerated faster than our price increases with a particularly noticeable impact late in the year as sales volumes in certain higher-value product lines fell off significantly in the last six weeks. Given the inflation we saw in raw materials, logistics, energy and wages during the year, we're pleased that we maintained a strong full year EBITDA margin of 27.1% despite fourth quarter EBITDA of $74 million being heavily impacted by the sudden deceleration of sales due to customer inventory destocking and the COVID-related slowdown in China. In addition, Q4 was negatively impacted by significant customer destocking of higher value products in the second half of the quarter, particularly in adhesives, as well as lower sales in our payment business as many municipalities had depleted their budgeted dollars for the paving projects prior to year-end. Revenue for the full year was up 24% to $241.3 million, which includes fourth quarter revenue from our newly acquired road marketing business, Ozark Materials. I think when you're in an environment like we were at the end of last year, four or five months ago, where everyone was really calling for a big recession and a lot of anxiety in the marketplace, that causes customers to want to kind of clamp down. Your line is now open. Yes, John, this is Ed. I think that growth will come down a little bit from last year because it was pretty explosive, but well above sort of GDP or market growth we talked about the tailwinds that we expect to have and payment, what you're left with is Industrial Specialties margins, which we think will come under some pressure potentially because of the CTO. Your line is now open. Your line is now open. Thank you, very much. Thank you, very much. Thank you, very much. Your line is now open. Yes, John, this is Ed."
}