{
    "symbol": "TMUS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 12:15:02",
    "content": " These results reflect our differentiated strategy to unlock growth across smaller markets and rural areas, T-Mobile for Business, network seekers in the top 100 markets who hadnâ\u0080\u0099t previously considered us and in new product categories like 5G broadband. And for the first time, T-Mobile 5G surpassed the nationwide speeds of cable providers, looking at Comcast and Charter on cable connections as compared to T-Mobile customers on 5G smartphones, the T-Mobile customer 5G speed test nationwide median were higher and that really shows you one more data point on the competitiveness of our ability to use this network to serve high speed Internet customers. Our mid-band footprint, our ultra-capacity 5G, which is where the 5G story really comes to life, 235 million people covered well on our way to 260 million by the end of this year and that footprint covers 87% of T-Mobile customers today. And then another cool thing in SMB, because we are seeing a lot of growth in SMB as well, we just announced -- we partnered with Apple to launch the only wireless plan that includes Apple Business Essentials, which is really cool for small businesses to really where they are looking at cost, when they are looking at getting more efficient and effective, how they can manage all of their devices at once with an incredible rate plan and an iPhone 13 included. Our big point of differentiation is what you have heard from several of us today, itâ\u0080\u0099s this value proposition that gives customers the best value without having to make any trade-offs on network and that proposition, I think, is more important now than it ever has been before, because with the macroeconomic environment, customers are looking for ways to save money and not have to make trade-offs and experience and really only T-Mobile is the one that provides that. So I think what you are seeing is and what you will continue to see is customers picking us because we have the best overall value position, because we can save them in expenses across their entire lives and thatâ\u0080\u0099s translating into things like you saw this quarter with sequential and big year-over-year churn decreases."
}