{
    "symbol": "TMUS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 21:27:02",
    "content": " Our ongoing focus on delivering the best value while simultaneously capitalizing on our network leadership position has delivered another quarter of industry leading growth in customers, EBITDA and cash flow, and we are raising our 2022 guidance for the third consecutive quarter this year. As we told you when our merger closed, our plan was to expand on our fame as the industry's best value while building and becoming known for having the best network in the country, finally giving customers the ability to have both from one provider for the first time ever. Through Magenta MAX, our most popular plan and the best expression of T-Mobile's 5G network, we're providing features that are meaningful to customers in their daily lives like with the recent addition of Apple TV+ and our Un-carrier move, Coverage Beyond. I think the way that we'll continue to talk about this is coverage in places where customers really care about and with our Coverage Beyond move, we've featured coverage both on the ground, the best 5G network, and increasingly, the best network when you're on the ground, covered when you're in the air and covered internationally. And when you think about the history of T-Mobile and even the plans that we had anticipated during Analyst Day when we came out, the ability to have Magenta Max be such a tailwind and allow us to get to the point where we're increasing ARPU guidance year-over-year and expecting a 2% increase is just phenomenal. And when you think about this inflation, pressured budget cycle that so many households are in and you think about what we're doing with Apple TV+ now included on Magenta Max, Netflix included, all of the Wi-Fi included on airplanes, think about taxes and fees, that's something that we talked about and rolled out some number of years ago, I think at the beginning of 2017. Now if we look at â\u0080\u0093 to the previous question about we're learning and there's opportunity and we're growing increasingly confident, if we look at that fixed wireless space and decide to augment our capital-free business plan with an additional business plan that's burdened with some capital, we'll let you know about that. I'll just give you a premise on it, which is ever since we wrote this business plan during the merger and then gave you our outlooks for what we thought we could accomplish, we've always been assuming that, that dilution event is coming because it's only $150 where it would trigger, and that's all the way out to, what, 2025, I think."
}