{
    "symbol": "SWN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 11:47:05",
    "content": " Prioritizing debt reduction, as we progress toward our $3.5 billion to $3 billion a target debt range benefits shareholders by expanding our opportunity set, including LNG, reducing the volatility of our stock, enhancing the resilience of our free cash flow through the cycle and supporting our expected return to investment grade. With an increasingly -- with an increasing and resilient free cash flow generation profile, a strong balance sheet, near investment-grade credit ratings, and advantaged access to the LNG corridor and other growing demand centers, we believe Southwestern Energy offers a compelling value and differentiated rate of change investment opportunity in a structurally constructive long-term natural gas outlook. As you kind of look into next year and sort of the point Doug made about having the lower strip prices out there, how do you think about stock buybacks balance between that and that debt reduction target, because it looks like you bought back at about 7.40 in the third quarter. The new entrants to the game are more interested in looking for ways to create some kind of an enabling event, whether it's a very healthy in-basin producer that's got the financial strength and the reserves to back up an agreement and negotiate something going forward that has increased pricing, or as you've seen in some of the press where somebody comes in and builds a pipeline to the facility to enable it to happen or something like that. We've used the same approach that we used in 2022 around contracting the major spend categories early well in advance of the coming year, and that served us well in 2022, especially from a quality of the goods and services where in Haynesville and in Appalachia, we did not have any of the execution issues that some of the operators have seen around supply chain and around timely getting all their goods and services done."
}