{
    "symbol": "SWN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 14:30:22",
    "content": " In the Haynesville, we have 20 years of 250 or below breakeven inventory and that inventory has -- it's all dry gas mix between our Haynesville and our middle Bossier the profile of those Haynesville wells, as we've talked about before, really high initial rates, we're getting close to 45% of the EUR recovered in the first year. When you look at the capability of the Company and the 1.5 Bcf a day of gas, we already moved into the LNG space and the overall company gas production rate at just under 5 Bcf a day assuming that we can work terms and do those on a risk-adjusted basis, we have the capacity to enter into additional ideas around LNG, and that's the part that we're exploring now whether they're domestically priced or internationally priced is a part of that. And for the second quarter in a row, our wells to sales in the Haynesville have averaged about 34 million a day of gross production rate and that's elevated from the prior operators and the public data and part of that is us gaining a better understanding of the subsurface, continuing to optimize the flow-back and how much pressure differential we're willing to see when we're flowing back those wells. The IPs have ranged from 25 million a day to as high as 50 million a day in different areas of the field, and so we think that's part of the Tier 1 high-quality inventory that we have, and it's showing up in the production performance, and it's occurring in both our Haynesville wells and the middle Bossier wells. And remember, part of why our wells have the strongest EURs and some of the strongest returns is because we're in the deepest, hottest, highest pressure part of the Haynesville that has incremental costs versus other parts of the Haynesville but those are more than offset from an economic standpoint by the well performance. So what our intention was is that this incremental capital since we're seeing higher-than-expected inflation, was to allow us to maintain the planned activity levels through the fourth quarter, so that the 2023 program stays strengthened on track for us to come into the year with the high-quality service providers with the third-party equipment that we need so that 2023, we hit the ground running as we enter the year and that we're maintaining all of those goods and services, like you mentioned in this environment and the quality that we've seen as we've moved through the year so far."
}