{
    "symbol": "AXP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-21 10:06:02",
    "content": " Billed business was up 24% on an FX-adjusted basis over the record growth we delivered a year earlier, led by the continued strength in Goods & Services spending and the ongoing strong rebound in Travel & Entertainment. In the quarter, total T&E spending was up 57% from a year earlier on an FX-adjusted basis, driven by the continued strong demand from consumers and small business customers. Based on our performance through the third quarter, we also remain confident in our full year revenue growth guidance of 23% to 25%, and we expect to be above our original full year EPS guidance range of $9.25 to $9.65. Our revenue performance in the third quarter drove reported net income of $1.9 billion and earnings per share of $2.47, representing EPS growth of 9% year-over-year, a great result considering the sizable credit reserve releases we had in the third quarter last year. Millennial and Gen Z customers, again, drove our highest bill business growth within this segment, with their spending growing 39% year-over-year this quarter. You see that spending from our US SME customers represents the majority of our billings in this segment and that spending from these customers continued its strong growth, up 17% in the third quarter. Net card fee revenues were up 23% year-over-year in the third quarter on an FX-adjusted basis, with growth continuing to accelerate, as you can see on slide 15, largely driven by the continued attractiveness to both prospects and existing customers of our fee-paying products through the investments we've made in our premium value propositions. When looking at slide 17, I would point out that we have now seen six consecutive quarters of revenue growth above 24% on an FX adjusted basis as we are now showing strong growth even on top of the strong recovery-led growth in the prior year quarter. Please proceed with your question. Hey, good morning, guys. Year-over-year earnings growth and the top line revenue growth is not something you're used to seeing from us, unless you've been looking at the last six quarters. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Hey, good morning, guys. Please proceed with your question."
}