{
    "symbol": "AXP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-22 11:50:05",
    "content": " Billed business was up 30% from a year earlier on an FX-adjusted basis, led by a vigorous rebound in travel and entertainment spending and continued strong growth in goods and services. It was at 108% of 2019 levels for the quarter, led by strong growth in Global Consumer and SME spending, and a significant uptick in large and global corporate travel. Most importantly, our second quarter revenues were $13.4 billion, up 33% on an FX-adjusted basis, strengthening sequentially from last quarter's already strong 31% year-over-year growth rate. First, beginning on Slide 6, millennial and Gen Z customers continue to drive our highest global consumer billed business growth, with their spending up 48% year-over-year. While a smaller part of our business, it is worth noting the significant acceleration in growth of 58% of the large and global corporate customers, significantly above last quarter's growth rate. Before I get into more details about our largest revenue drivers in the next few slides, I would note that service fees and other revenue was up sharply at 79% growth year-over-year, largely driven by the uptick in travel-related revenues that accelerated this quarter, with cross-border spend in particular surpassing pre-pandemic levels. Our largest revenue line, discount revenue, grew 32% year-over-year in Q2 on an FX-adjusted basis, as you can see on Slide 13, driven by both our sustained growth in goods and services spending and the accelerated T&E recovery that you saw in our spending trends. Net card fee revenues were up 19% year-over-year in the second quarter on an FX-adjusted basis, with growth continuing to accelerate, as you can see on Slide 14, largely driven by the continued attractiveness to both prospects and existing customers of our fee-paying products as a result of the investments we've made in our premium value propositions. This quarter, we acquired 3.2 million new cards, with acquisitions of U.S. Consumer Platinum Card numbers again reaching a record high and increasing 20%, above last quarter's record levels, demonstrating the great demand we're seeing, especially for our premium fee-based products. On Slide 15, you can see that it was up 31% year-over-year on an FX-adjusted basis, accelerating above last quarter's growth rate due to the continued recovery of our revolving loan balances. I mean just look at sort of how the services around our card products have evolved over the last few years, whether that be from a small business perspective where we can meet a wide variety of reworking capital needs, banking needs and so forth, and then look at it from a consumer perspective and look at what we've done with resi, with over 30 million registered users on resi, and we have cards on file, a huge acquisition."
}