{
    "symbol": "AXP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 13:13:03",
    "content": " Fourth quarter billed business reached a record quarterly high of $357 billion and was up 25% for the full year demonstrating our continued ability to acquire, engage and retain high spending premium card members. Millennial and Gen Z customers continue to be the largest drivers of our growth, representing over 60% of proprietary consumer card acquisitions in the quarter and for the full year. On this basis, pre-tax, pre-provision income was $11.8 billion for the full year and $2.9 billion in the fourth quarter, up 27% and 23% respectively versus the prior year, reflecting the growth momentum in our underlying earnings. Our focus on attracting, engaging and retaining younger cohorts of card members through our value propositions, drove the 30% growth in spending from our millennial and Gen Z customers on Slide 5, who you can now see make up 30% of spend within the segment. We saw another quarter of solid growth in U.S. SME, though you can see that it was the slowest growing customer type this quarter, up 80% year-over-year. The interest-bearing portion of our loan balances, which surpassed 2019 levels last quarter also continues to consistently rebuild with over 70% of year-over-year growth in the U.S. coming from our existing customers, which is about 10 percentage points more than what we saw in the years leading up to the pandemic. Full year 2022 provision expense was $2.2 billion, which included a $617 million reserve build, primarily driven by loan growth, the continued steady and expected increase in delinquency rates and changes in the macroeconomic outlook as the year progressed. Net card fee revenues continued to accelerate throughout this year, up 25% year-over-year in the fourth quarter and 21% for the full year on an FX-adjusted basis, as you can see on Slide 14. This steady growth is powered by the continued attractiveness to both prospects and existing customers of our fee-paying products due to the investments we have made in our premium value propositions, as Steve discussed earlier, with acquisitions of U.S. Consumer Platinum and Gold Card members and U.S. business Platinum Card members, all reaching record highs in 2022. Starting with variable customer engagement expenses, these costs, as you see on Slide 17, came in at 42% total revenues for the fourth quarter and 41% for the full year. First and most importantly, we expect the strategies that Steve laid out earlier to deliver continued high levels of revenue growth, leading to our revenue growth guidance for 2023 of 15% to 17% and setting us up well for 2024 and beyond. We feel good about the momentum we see in our business and in any environment, remain committed to running the company with a focus on achieving our aspirations of sustainably delivering revenue growth in excess of 10% and mid-teens EPS growth in 2024 and beyond as we get to a more steady-state macro environment. So you put all that together with the comments that youâ\u0080\u0099ve now heard both Steve and I make, which is, look, we got to run the business based on what we see with our customers who are premium consumers, select segments of small businesses and the largest companies in the world, and thatâ\u0080\u0099s where you get to the 15% to 17% revenue growth. So from an expense perspective, the reason weâ\u0080\u0099re able to say that we think marketing will be where it is and operating expenses will not grow at the same level that they will because we believe weâ\u0080\u0099ve gotten to that scale component that we now believe that we can grow revenues 15% to 17% get into a 10% growth mode 2020 â\u0080\u0093 plus 10% plus growth mode 2024 and beyond with that scale until the point in time. The U.S. economy shrank in the first two quarters of 2022, and we just posted revenue growth for the full year, 25%. And so one of the things again, that Steve and I have both just talked about, because I think people seem a little surprised to you by the 15% to 17% is a key driver, why we are comfortable with that is our tremendous success over the last year, and in the first weeks of 2023 and bringing great new customers into the franchise. But look, I think international, we have seen which is really good and just look at the slides, you have seen really good growth from not only a consumer perspective, which is over 20%, but international SME and large corporations are growing at 32%."
}