{
    "symbol": "CNX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 15:05:03",
    "content": " Before we kick things over to Alan, who's going to discuss the third quarter financial results in detail, I want to provide a couple of thoughts talking about the macro backdrop and how CNX is continuing to position itself uniquely, not just among energy companies, but I think also when you look across the broader equity markets. And we laid out our vision with Appalachia being the heart of a sustainable energy revolution, and we talk about the numerous opportunities that CNX is developing to leverage our existing asset base and core competencies to create significant free cash flow opportunities for our ownership beyond what you'll see with the free cash flow from our core gas development activities. Our combination of consistent quarterly free cash flow generation and then that extensive available liquidity and our long-term debt maturity runway, those things position us not just strongly but uniquely to take further advantage of any deepening valuation disconnects that might occur in either the equity or the debt markets, frankly. And although we have not given an explicit capital allocation framework, if you extrapolate these levels of buybacks moving forward, you can see that we will continue to dramatically reduce our denominator and thereby meaningfully grow our free cash flow per share. Additionally, given our now lower share count, approximately $700 million of free cash flow is expected to result in a free cash flow per share of $3.88. Consistent with 2022, our 2023 capital focus will remain on operationally derisking our long-term free cash flow annuity by investing and retaining the best crews, securing critical materials and prioritizing investments that lower overall execution risk. Despite these inflation challenges and other macro uncertainties, CNX's sustainable business model uniquely positions the company to generate significant free cash flow year after year in any commodity environment. For example, even if NYMEX prices were to return to below $3 per MMBtu and in-basin differentials were to widen after this winter, the company would still generate an average of $500 million of annual free cash flow. Assuming a constant enterprise value and that 80% of the future free cash flow is allocated to share repurchases and the remaining 20% to balance sheet management, total shares outstanding would reduce by an additional 54% while still achieving significant deleveraging. We have built a uniquely sustainable business model that generates a significant amount of free cash flow in any commodity environment, and our focus will remain on steady execution and taking advantage of future market disconnects to grow our free cash flow per share. From an overall balance sheet strategy, I think we've talked about before, one of the things the hedge book does allow us to do is to invest significant amounts of free cash flow back into shareholder returns."
}