{
    "symbol": "CNX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 20:57:05",
    "content": " And then the third theme, the last one is in addition to our organic free cash flow annuity and our growing free cash flow per share, weâ\u0080\u0099re creating demonstrating and deploying new technologies, which will create incremental free cash flow and free cash flow per share beyond that base business and plan. Our new technology team itâ\u0080\u0099s got numerous projects in various phases of development, which are going to help the world move to a lower greenhouse gas emitting future while also maintaining reliable energy resources so that society properly functions. So whatâ\u0080\u0099s better for the planet and for greenhouse gas emissions and for the regional economy and for business models, making products overseas using coal-fired power and inefficient power plants and factories to utilize core labor practices and having all that wasted cost and energy transporting these products all the way to the United States to sometimes work depending on the weather, if itâ\u0080\u0099s windy or if itâ\u0080\u0099s sunny, or in the alternative, simply manufacturing these products here with low carbon footprint natural gas, more  and factories, using local well-paid workers and shipping it within a 1-day drive. And although we have not given an explicit capital allocation framework, if you extrapolate these levels of buybacks moving forward, you can see that we will continue to dramatically reduce our denominator and thereby meaningfully grow our free cash flow per share. And despite being materially hedged for the remainder of the year, the magnitude of the pricing volatility we are experiencing can materially impact our expected free cash flow for the year, either positively or negatively and both in terms of realized prices on our open volumes and in terms of swings in working capital related to the timing of derivative settlements that can materially shift cash flow between periods. Additionally, given our now lower share count, approximately $700 million of free cash flow is expected to result in free cash flow per share of $3.69 for 2022. Slide 7 illustrates the core tenet of the CNX investment thesis, the incredible and unique opportunity for rapid low-risk free cash flow per share growth that results from our sustainable business model. Looking forward, assuming a constant enterprise value and assuming 80% of future free cash flow is allocated to share repurchases and the remaining 20% to balance sheet management, total shares outstanding would reduce by an additional 54% while still achieving significant deleveraging. But like one thing I want to emphasize is, what we do with new tech investments and venture opportunities, it is going to be additive to the $700 million per free cash flow program for us, and itâ\u0080\u0099s going to be going to continue to deploy a clinical math on how we deploy that additional free cash flow and what it does to the free cash flow growth. So, weâ\u0080\u0099re always in the know of whatâ\u0080\u0099s going on in the M&A space, but with the low-risk opportunity to grow free cash flow per share, so visibly in front of us of buying ourselves, itâ\u0080\u0099s hard to compete with that."
}