{
    "symbol": "CNX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 15:30:27",
    "content": " So although these two issues are going to impact near-term free cash flow generation, we're still able to execute the core tenets of our sustainable business model, basically, just as we've consistently done year after year across all phases of the macro and commodity cycles. And while the core projects that underpin our long-term plan, they very little, the magnitude of these investments, it's going to vary from year-to-year with those inflationary pressures that I discussed, as well as with shifts in planned timing as we're always looking constantly evaluating how to best de-risk and delineate and profitably develop our stacked pay fields. And while we initially expected to be able to make schedule adjustments to offset those delays and basically hold production levels flat year-over-year, weather-related and other operational delays in last year's fourth quarter completion schedule, it further impacted production levels in early 2023. So from overseas North American operations for a Fortune 500 oil and gas producer to his proven track record of building effective teams and successfully developing new shale plays to work in offshore basically across the globe, his diverse set of experiences and Nav's impressive technical expertise, I can tell you they're already valuable as we continue our efforts to pioneer the benefits of the deep Utica here in the Appalachian Basin and of course, site, remain focused on the daily safe and compliant execution of our operational plan. As Nick mentioned, this quarter represents the 12th consecutive quarter of free cash flow generation through the execution of our sustainable business model that is grounded in clinical capital allocation to optimize long-term free cash flow per share growth. And although we have not given an explicit capital allocation framework, if you extrapolate these levels of buybacks moving forward, you can see that we will continue to dramatically reduce our denominator and thereby meaningfully grow our long-term free cash flow per share. The current 2023 free cash flow is lower than our expected future run rate due to 3 main factors: First, the lower first half production for the year that we discussed; second, the impact on capital of assuming annualized second half 2022 inflation levels persist throughout the year; and third, incremental investments and high IRR discretionary capital projects."
}