{
    "symbol": "POSH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 23:04:06",
    "content": " First quarter GMV grew 12% to $493.4 million and revenue grew 13% to $90.9 million, beating our expectation for the quarter, which is our most difficult comparison for the year and positioning as well for the year ahead. We celebrated Australia's one year anniversary during the first quarter and continue to lay the foundation for building an active community and seller base, and we look forward to holding in person events in that country. GMV grew 12% to $493.4 million, up from $441 million in the first quarter of 2021 or 60% growth on a two year basis despite a tough comparison period as we lapsed tenuous. Net revenues grew 13% to $90.9 million, up from $80.7 million in the first quarter of 2021 or 57% growth on a two year basis. This result was ahead of our guidance of $86 million to $88 million due in part by a better than expected take rate and a 15.8% growth in trailing 12 month active buyers to a record $7.8 million, up from $6.7 million in the first quarter of 2021. Our take rate in the first quarter was 18.4%, up slightly from 18.3% from last year due to lower than expected first quarter cancellation rates from the holidays, which more than offset the pressure from continued mix shift to more orders greater than $15. Marketing expenses, excluding stock based compensation or SBC, of $41.3 million in the first quarter was 45.6% of revenues, up from 39.6% in the first quarter of 2021. Market increased 30% from $32 million in the first quarter of 2021 due to higher CPU, more in-person events and community building initiatives. Moving toward expenses, ops and support excluding SBC of $14.3 million in the first quarter was 15.7% of revenues, which is flat from the first quarter of 2021. G&A, excluding SBC of $13.2 million in the first quarter was 14.5% of revenues, up from 12.6% in the first quarter of 2021, primarily due to the ongoing cost of being a public company. However, it's important to note that these numbers were ahead of our guidance of negative $7 million to $9 million due to lower marketing expenses and lower G&A expenses as we postponed some G&A investments that will hit in the second quarter and second half of 2022. As such, we expect second quarter revenues of $86 million to $88 million resulting in a growth rate of 5% to 8% as we lap difficult comparisons of 22% growth and 72% growth on a two year basis. In closing, consistent to our messaging the last earning release, while we expect that macroeconomic factors could continue to impact consumer behavior in 2022, we are focused on execution with a strong focus on our core business; first, continuing to enhance our product experience; second, continuing to build our brand with the global consumer; and third, invest in marketing, talent and a robust operating mechanism to drive execution."
}