{
    "symbol": "POSH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 22:30:14",
    "content": " During the second quarter, we rolled out a as a new payment service provider in Canada, which enabled us to process payments locally in Canada, instead of cross border to the us, which saves in card network, cross border costs for the second half of 2022, the majority of our international investment continues to be focused on driving growth through advertising community development and shipping innovation to grow our seller base. This result was ahead of our guidance of $86 million to $88 million driven in part by a better than expected take rate and a 14% growth in trading 12-month active buyers to a record $8 million up from $7 million in the second quarter of 2021 On a two-year basis, trading 12-month active buyers grew 32%, thanks to our continued marketing investments and product innovation. Marketing expenses, excluding stock-based compensation or SBC of $42.6 million in the second quarter was 47.8% of revenues up from 38.6% in the second quarter of 2021. Market increased 35% from $31.5 million in the second quarter of 2021, due to higher CPU, more in-person events in community building initiatives though CPUs have improved slightly from their peak in January. Moving to other operating expenses and support excluding SBC of $14.6 million in the second quarter was 16.4% of revenues, which is up from 14.9% in the second quarter of 2021, and is slightly better than expected due to lower cancellation rates and is low down hiring in certain areas. G&A excluding SBC of $14 million in the second quarter was 15.7% of revenues up from 11.4% in the second quarter of 2021, primarily due to the ongoing cost of being a public company. We are focused on driving growth while managing our cost structured and expect negative adjusted EBITDA of $9 million to $11 million in the third quarter, as we continue to invest in R&D to drive product innovation G&A, to build the infrastructure necessary, to evolve as a publicly-traded company in marketing to grow our community of users. And as we build out finance, accounting and legal teams, we continue to expect marketing, excluding SBC as a percentage of revenues to be in the high forties in the third quarter, in fourth quarter, as we invest in our brand diverse firewall marketing channels and address higher costs in digital advertising, we have proved that our platform is a sticky, our cohorts deliver net positive GMV dollar retention over time with high gross margins in the strong balance sheet, we have the ability in conviction to continue to invest in marketing, to accelerate GMV growth for the future."
}