{
    "symbol": "TRUP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 23:17:20",
    "content": " More importantly, our adjusted operating income or the profits we earned from our existing pets before we invested in growth grew approximately 13% or 16% on a constant currency basis. We invested about $20 million acquiring new pets at an estimated 31% internal rate of return, an additional $2 million in development expenses and nearly $6 million repurchasing shares of our common stock. Total revenue for the quarter was $219.4 million, up 30% year-over-year, driven by strong pet additions and sustained high levels of retention in our subscription business, along with continued growth within our other business. On a constant currency basis, monthly average revenue per pet increased 1.8% year-over-year and continues to be impacted by the mix of business dynamics that we've previously discussed. Nonetheless, our subscription adjusted operating margin was 12.9% in the quarter, down from 13.8% in the prior year period. With additional cost actions, we expect to drive sequential expansion in subscription adjusted operating margin, both in Q3 and Q4 and in Q4 in the range of 14% to 15%. In dollars, our subscription business delivered adjusted operating income of $18.8 million, an increase of 13% over the prior year period. As a result, our total adjusted operating income was up 13% over the prior year period to $20.8 million. During the quarter, we invested 18% more year-over-year or $20.2 million to acquire 61,000 new subscription pets. As highlighted in our 60-month plan, it is our goal to deliver 25% year-over-year growth in adjusted operating income. With the backdrop of rising cost of care, growing need for Trupanion in North America, additional distribution channels, products and international expansion, we believe 25% growth in adjusted operating income remains the right target. Yes, we're expecting to get closer to 71% with additional cost action across fixed variable and loss adjustment expense to produce that 14% to 15% adjusted operating margin. Well, I mean, at a macro level, we're seeing in the first half of the year, our ARPU is going up 1.4% and our claims per pet is going up 1.5%. If we are indeed going to see 10% to 15% increase per year in like-for-like cost of vet care over the next 3 or 5 years, I think you said. And if I think about our total subscription pets which is how we get our revenue, if I look at it over a period of time, '17, '18 and '19, our growth rates were about 15%. We were pretty easy to predict 15% year-over-year growth in '17 in subscription pets 15% in '18, 15% in '19 and you added about 5% in ARPU and you got about a 20% increase in revenue. And then, I look at the year-over-year growth of the adjusted operating income and then how many dollars are we able to deploy at outsized internal rates of return which I define it anything over 30%. And what you'll see over time is that third bucket will become a smaller percentage, unless veterinarians start to increase their rates, not what I'm hoping 10% to 15% but if they were to increase at 25% year-over-year."
}