{
    "symbol": "TRUP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 23:25:04",
    "content": " If the team is focused and continues taking action on price, not only for the accelerated rate of inflation weâ\u0080\u0099re seeing today, but also for that which we expect will come, I am confident that weâ\u0080\u0099ll get back to our targeted adjusted operating margin of 15% by the end of 2023. In the last five years, weâ\u0080\u0099ve grown our adjusted operating income over 300% and deploy this capital consistently within our target internal rate of return of 30% to 40%. In dollars our subscription business delivered adjusted operating income of $19.5 million, an increase of 5% over the prior year period. On a constant currency basis, subscription adjusted operating income wouldâ\u0080\u0099ve been $19.7 million, up 6% year-over-year. During the quarter, we invested 15% more year-over-year, or $20.1 million to acquire over 70,000 new subscription pet. Total adjusted operating income or the dollars we have to invest in growth is expected to be in the range of $87 million to $89 million, at the midpoint this is up 12% over last year. When it comes to a ARPU growth as, Iâ\u0080\u0099m sure you noticed in the script, so Iâ\u0080\u0099m talking at a macro level about absent changes in mix, what we have that is flowing through into next year, 11% within additional seven plans to be filed, already filed or to be filed in the next 30 days so that weâ\u0080\u0099re positioned well if, if current inflationary rates continuing to next year. Yes, I mean, I would say obviously weâ\u0080\u0099re still mapping out next year and weâ\u0080\u0099ll give a lot more visibility on the February call with, projecting our current rates of inflation and the rates we have flowing through to average 5% for the full year. Yes, at a high level, and Iâ\u0080\u0099ll speak more about, when we look at things absent dramatic changes in mix, I mean going into the year as weâ\u0080\u0099ve talked about before, particularly in the first quarter as we were coming out of COVID, we definitely saw more changes in frequency with people going back, checking â\u0080\u0093 catching up on things, small, more normal-ish, call it 2% year-over-year changes in severity, but nothing overly dramatic. If I can start with retention, it was down a little bit quarter over quarter and kind of piggybacking off the last question, but with pricing growth accelerating substantially in the coming quarters, I mean, do you have confidence retention will either maintain at its current levels or do you think itâ\u0080\u0099ll climb back to kind of the 98.74%-ish range? If the retention rate goes back to letâ\u0080\u0099s say 98.6%, which would still be leading the category that would have a little bit of downside on our total net PET growth, but the offset on having 18% rate increases of what theyâ\u0080\u0099ll do to drive our revenue growth is well offset. So, weâ\u0080\u0099ve been through this type of cycle before in small regional areas or anywhere else, and itâ\u0080\u0099s most important that we price accurately and weâ\u0080\u0099ll take the revenue growth benefits from the ARPU and we might get a small subtraction on retention, but net over it will help our revenue growth and itâ\u0080\u0099ll also more importantly help our adjusted operating income and our lifetime value."
}