{
    "symbol": "BBAI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-13 23:13:06",
    "content": " Good afternoon, everyone, and welcome to BigBear.ai's 2022 Fourth Quarter and Full Year Earnings Conference Call. During the call today, we may make certain forward-looking statements. In the fourth quarter, we achieved our 2022 financial outlook and took significant steps to bolster our fundamentals and set the stage for long-term growth. As discussed in previous calls, we have continued to take material steps forward in reducing our recurring operating expenses and improving our liquidity position. I see 2023 as a critical foundational year for us, as we support some of the challenging things that are happening in the world right now. BigBearâ\u0080\u0099s capabilities and decades long heritage in this field gives us a competitive advantage in delivering a higher form, a reliable, scalable decision intelligence solution. We will continue to focus on delivering solutions in three core markets; complex global supply chains and logistics, autonomous systems and cyber. In November 2022, the U.S. Department of Defense released its national defense strategy, which stated that the government would continue to invest in AI and aggressively seek to fill technology gaps in its AI specialization. In December 2022, the U.S. National Defense spending bill was passed allotting over $800 billion in funding to our national security and recommending boosted spending on AI solutions to protect our nation from increasingly sophisticated cyber threats. And just last week, President Biden put forward his 2024 defense budget proposal, which included a record amount of $145 billion for research and development. At BigBear.ai, we are uniquely positioned and view the unfolding global market dynamics as an opportunity for us to be a catalyst. There will be millions of models that might play a role in the orchestra of how weâ\u0080\u0099ll achieve true augmented decision intelligence in high stakes environments and there will not be a single company that provides all of these models, an organization needs to step up for production grade AI adoption to happen at scale. Throughout 2022, we deepen these relationships and see examples of this and selections such as the $900 million 10-year multiple award Air Force IDIQ contract vehicle, where we will have the opportunity to compete for task orders. Phase 2 work, where our solutions are empowering senior leaders and combatant commanders to man equip, train, ready and resource the army more effectively by transitioning 14 legacy system into a single solution to provide real time holistic data for 160,000 users. This phase 2 work is significant in that it builds on our successful fee from prototype efforts during phase 1, and accelerated what was supposed to be a $2 million award for a second prototype into a $14.8 million award to deliver a minimum viable product. Additionally, the phase 2 award accelerates the program timeline while naming BigBear as the sole prime contractor to deliver this critical capability and puts us in a strong position to receive the phase 3 production award. We are continuing to demonstrate our expertise in autonomous systems through our participation in the digital horizon event series, which supports the Navy's efforts to integrate AI technologies in unmanned surface vessels. Our experience and lessons learned through these events sets us up to be a premier partner with the Department of Defense as they tackle their broader Debt 2  strategy, a multibillion dollar effort to use AI, ML and predictive analytics to better sense, make sense and act at the speed of relevance. Our process simulation and modeling solutions help companies manage massive and complex physical and information environments, delivering clarity on facility, equipment and personnel systems, forecasting requirements and simulating real world situations. Additionally, in the first quarter of 2023, we closed a private placement for $25 million in a very challenging market, bolstering our balance sheet and providing us with sufficient liquidity to execute on our strategy in 2023. Revenue for the quarter was $40.4 million compared to $33.5 million in fourth quarter of 2021, which was 21% year-over-year growth, primarily driven by our analytics segment at $23.1 million in the quarter, an increase of $6.5 million, or 39%, compared to the same period in 2021. This growth was driven by key program wins in 2022, including the phase 2 award for the global force information management or GPM program with the U.S. Army that Mandy walked through earlier. Revenue in our C&E segment was $17.2 million in the quarter, compared to $16.8 million in Q4 2021. For full year revenue, we achieved our guidance target with revenue of $155 million representing 6% year-over-year growth versus 2021. The gross margin was 29% in the quarter, an increase from 11% in Q4 2021, driven by the growth in our analytics segment. Turning to segment adjusted gross margins, we are continuing to see growth in our higher margin analytics segment, which includes our commercial business outpace our C&E segments. The segment adjusted gross margin was 35% in Q4 2022, compared to 31% in Q4 2021. Segment adjusted gross margin in Analytics was 47% in Q4 2022, compared to 34% for Q4 2021, driven by prior investments that were successful in winning and executing higher margin follow on awards. Segment adjusted margin for C&E was 20% compared to 28% in Q4 2021, primarily driven by a onetime year-to-date fringe rate true up adjustment that was recorded in fourth quarter of 2021, resulting in a higher than typical segment adjusted gross margin in that period. Backlog was $222 million at year end, which is down 23% or $66 million compared to the third quarter. This was largely driven by contract converting into Q4 revenue of $40 million, as well as a couple of contracts that expired period of performance in the quarter. In most cases, we simply roll into the next option year on the contract and we continue to work with these customers to extend these contracts at the end of their option years to recapture these funds. As a reminder, when comparing our backlog in prior quarters, we made a change in our methodology of measuring backlog to take a more conservative approach that does not include anticipated follow on awards, and also updated estimates as it related to unpriced unexercised backlog. Now turning to expenses, for Q4, operating expenses were $38.2 million, or $19.9 million excluding the non-cash goodwill impairment charge. Q4 operating expenses included R&D expenses of $1.2 million, and SG&A expenses of $15.6 million or $16.8 million in total. Excluding the impact of stock-based compensation and non-recurring integration expenses in both periods, Q4 expense still reflect a 27% decrease in spending compared to Q2, driven by a full quarter benefit of cost savings initiatives we implemented in the back half of the year. While we believe the actions we took in the third and fourth quarters of 2022 and the first quarter of 2023 have positioned us to operate efficiently going forward we will continue to be disciplined in our expense management as we grow and we will be focused on implementing scalable processes, operating rigor and driving overall efficiency across our business. Looking ahead, we are also focused on ways to improve efficiency of contracting processes and timeliness of payments. We reviewed goodwill for impairment in the fourth quarter and while we saw improved financial results in our analytic segment this quarter, relative to fourth quarter of 2021, we concluded that our goodwill was impaired due to several factors, including current macroeconomic headwinds, and previously anticipated growth rate. Adjusted EBITDA was a loss of $2.5 million in Q4 compared to adjusted EBITDA loss of $3.9 million in the third quarter, and $7.7 million in the second quarter. Our total adjusted EBITDA loss for the second half of 2022 was $6.5 million as we forecasted, compared to the $10.6 million in the first half of 2022. With our cost saving actions in the second half of the year, we now have a foundational baseline for future profitable growth. In review of the balance sheet, at the end of the fourth quarter, we had cash and cash equivalents of approximately $12.6 million. Of the $9 million operational cash usage in Q4, $6 million with our biannual interest payments. In January, we took steps to address liquidity with a $25 million private placement which provides us with sufficient liquidity to execute our 2023 strategy. Following the actions we took to right size, our operational cost structure in the second half of 2022 and early 2023, we expect to continue the trend toward a much lower cash burn in 2023. We are focused on achieving positive operational cash flow in the second half of 2023, which excludes non-recurring and non-operational items, including interest payments, transaction fees, tax payments for stock, vesting and severance costs associated with a reduction in force. Turning to Outlook, we are expecting 2023 revenues to be in the range of $155 million to $170 million. We have several significant expected contract awards in our pipeline, which given their size and timing of award could have a significant impact on our FY 2023 revenue. Additionally, as Mandy said in her opening remarks, it's clear that the race for AI dominance will continue in 2023. As we execute our strategy this year, we will undoubtedly have to make certain investments that we believe will be catalysts in accelerating our success as an industry leader in AI. Looking ahead, we remain disciplined on managing cost and focused on areas to drive operational efficiency. Following our cost reduction initiative, we anticipate substantially lower cash burn particularly in the second half of 2023 as we saw in the fourth quarter of 2022. After improving our near term liquidity position, we will make targeted investments to efficiently drive sustainable growth. We are well positioned to deliver increasing gross margins and steady revenue growth driven by increasing demand for offerings in federal markets, and our ramp up in commercial go to market efforts, as well as a continued shift in our business mix in favor of higher margin analytics segment. Please proceed with your question. And also related to this, will ChatGPT developments translate into contracts for BigBear.ai over the long-term or how should we in general think about the recent excitement for AI solutions? So ChatGPT as a whole right is I think there's been a lot of coverage on is derived off of LMs, right, large language models, which is a capability that's actually existed for a very, very long time, and has been applied. For us, I think what's important to know about BigBear is that we have more than a couple of decades of experience in working in even the early days of machine learning. And sometimes that, to your point, right, may require different types of artificial intelligence, whether it's the work that we do in predictive analytics, whether it's computer vision, or the underlying tools that we use to accomplish those things, we have skill sets that tap into each of them. But what I would note in terms of the you mentioned tensor, right. And it can be applied in a way that, even five years ago, we really couldn't tap into because of the limitations around compute. But at the end of the day, as a technology provider, and as a solution provider, our job is to use the right tools to solve the customer problem. And we're going to lean into things like tensor, right as a as an example. And we do use that and some of our solutions that are deployed with the federal government as we look forward into 2023, as well as beyond unquestionably we are seeing an unbelievable amount of interest in the application of artificial intelligence in both the federal sector as well as the commercial sector. What's putting us apart in those conversations, and what gets us excited about the future is that we're not new to the table. And so I would expect, and when we look at our pipeline, right, I see a lot of promise, right, associated with where we're headed. And it's really on us to do what we did, right, go execute, and then keep sharing it as we go. And last quarter, you discussed how your Med model and future flow RX platforms have been gaining some traction with hospital customers. And I do want to note, right, the commercial side of our business, which does include the future Clorox  solution, we don't break out separately in terms of recording, but the pediatric care crisis continues. Right, there is a unbelievable challenge happening in the world that I spent many years in across hospitals and health systems associated with staffing shortages associated with incredible optics, in particular types of illnesses that we just haven't seen, right in this kind of volume for a very long time. And our tools are incredibly well situated to be able to help with how to design, right patient flow solutions and optimization solutions for how to get patients to the right place at the right time and do prioritization. The U.S. Army, at an industry conference in January announced that it is looking to multisource its vantage data analytics dashboard program, and in your prepared remarks and over the past year, you've discussed the success that you've had with the GFIM program, which is also with the U.S. Army data analytics office. And I was wondering if this vantage, multi sourcing represents an opportunity for BigBear given its strong relationship with the U.S. Army, and what other potential defense prospects you may have in your pipeline? I think probably the best way to answer it was to maybe talk about some of the things we're seeing as it relates to consolidation of federal contracts, right, because that I think, is, is absolutely happening. We are seeing multiple contracts consolidated into larger contract, contract infrastructures, in certain cases, which allows the government to manage properties more efficiently and streamline the work. Now we've seen that in other instances as it relates to kind of the general, federal market, and how we position ourselves and what we're seeing in terms of opportunity. I think, in all three of the vectors, right, that we have strengthened, whether it's complex global supply chain logistics, whether it's autonomous systems like our work at IMX 23, right, whether it's cyber right, particularly with a focus on cybersecurity and risk, right and reverse engineering. I guess this is the short summary and I think it has, in no small part right to do with the fact that there is a level of geopolitical unrest that is pretty unprecedented right now and leadership that is in the seats and we are doing our best to help. So, we, we feel like we have done a really good job of getting the piping has really helped significantly on that liquidity profile, obviously. But when we look at our cash burn with the cost reductions that we've taken out in starting in Q3, again, in Q4 and Q1, we do expect the cash burn to be significantly lower. Now, you're already aware of our interest payments that do happen in second quarter and fourth quarter. I would tell you that, our targeting, we are targeting to be operationally cash flow positive in the second half of the year. Again, to be clear on what we mean by operational cash flow positive, we're focused on the on-going day to day business. So that includes, everything that would that would be normal operating expenses that you would see in the business as well as inflow of customer payments. It doesn't include, as I said, the interest payments, which you know, where those are, or transaction fees for severance costs and things like that. In the first half of the year just to be clear, we, I think we noticed this in our earnings release, we had some start-up costs in fourth quarter in early Q1 in advance of a contract that was awarded in late Q1. Please proceed with your question. Obviously, you have some really good successes with multiple contracts that you've talked about GFIM today, and, of course, IDIQ. Well not what kind of parse that and against your DACA wants to  I mean, it doesn't seem you're embedding much growth in there. I think when we, when we looked at kind of the year, we had in 2022, and then we looked forward into 2023. And in really establishing and sharing right, well, we have line of sight to, what we see what we think is reasonable, right, given certainly a continued challenging macroeconomic environment. But to reinforce what Julie shared, as well as what I shared earlier, that we, I think for many companies, right, ourselves included, January opened up a lot of conversations that I think we are seeing accelerate, right. And while we are pushing and being extremely responsive, and adapting and extending our solutions to meet those needs, our guidance reflects what I think is a very appropriate and measured approach between 2023. Yes, I would say yes, maybe say most of everything that I would have said, The only thing I would add is that there's a couple of things that I would add to that was this sense of we're trying to ensure that we don't get ahead of ourselves. We saw some challenges last year, as we experienced on shifting and funding from various different contracts that that we had in terms of timing of how those were going to be funded, or specifically some of the funding that was reprioritized to be associated with the war in Ukraine. And the only other thing I was going to just remind you guys and I think maybe said this but just to reemphasize, it's important to understand that in the government world, even with this really heightened excitement around AI and capabilities, there's typically three major stages that we have to go through in order to get these contracts awarded. And typically breakeven, there's a an MVP stage, which has to prove things out. And so even with the excitement around everything that we're seeing, and we're excited about what we're seeing, it's just going to take a while for people to move through that process and through that curve. And so I think that's why our guidance is where it is, we want to make sure that we're measured about how we're communicating and what we're committing to and how fast we can get there. Maybe if I could, on the GFIM part obviously did much better on phase 2. And our kind of do the same as the last which is, initial, as Julie walked through in terms of thinking about phases, right. As we as we move from where we are in phase 2 and compete for phase 3, which we continue to believe we're very well positioned for because of our execution and delivery, in the phase 2 process. Ultimately, the shift to production in, I think all example cases that we can look at means that it's larger, right, because you're talking about putting it into the real world doing it at scale. I think, ultimately, it's up to the customer to make that determination and to make the award as appropriate. But I mean, Julie, definitely weigh in, because we are certainly spending a lot of time talking about it. I mean, everything's going very well, on the program. It was announced back in September of last year for phase 2, we're still working toward the, toward the next phase. And again, I think we're still looking to accelerate the deployment of the overall solution. But as we've said, they continue to refine their contracting processes and decide how fast they're going to move down the curve, and whether they need some more, prove out during the process before they can land in a production mode. And so I think everything's going exactly as we hoped, and maybe even better than we hoped. And I can't I think right now that we just don't want to over commit to how quickly they're going to move into production, although we do believe it is calmed as part of the 2024 budget. So when we understand what you're doing, and one of the new avenues of revenue that could potentially affect the upcoming years. So we have a, and I think it's important to note first, right, this is actually not a new capability for us, we have a pretty mature and long standing cyber competency. But the area that I was referring to, that I talked about at the beginning of the call, is really in and around part of our business that we're seeing mature pretty quickly, which is that spacecraft solutions, so not only being able to do to not realistic reverse engineering work and vulnerability analysis on componentry. But also to be able to do simulation, right and modeling associated with potential, whether it be offensive or defensive security postures and monitor that. Now on an on-going basis, some of the things that we're seeing as well is that, as we all know, right, cybersecurity continues to be one of the great challenges for a wide variety of industries as we go through the fourth industrial revolution. A lot of these systems and sets of hardware were just not set up with the level of rigor, right, that is going to be needed as the threat landscape continues to mature. But the area where I guess I want to kind of focus and educate around is that we have a pretty unique competency and being able to do end to end reverse engineering and full scope, vulnerability work. I think, in in the face that we work in, right. So particularly focused, if I focus first on the face press solution, right, that's a pretty distinct solution that we have a partner, red wire around, right that we're doing that work. And as it relates to some of the kind of broader vulnerability work that I mentioned, in the reverse engineering work, I would say we do see a level of competition from both sides. So we, we continue to see the commercial business show promise, right, our pipeline is great, right, we're continuing to see that grow. I would say honestly, any what you saw in Q4 was pretty close to what we've been running slightly below what we've run all year. And last year, there was a kind of a onetime year-to-date catch up that happened in Q4 that caused the sandy margins to look a little bit out of sync with everything else in the fourth quarter of last year. But I think what you see in Q4, although right at that 2021 level is what we consistently ran through the C&E segments. And then at what level of revenue you think, you could probably get an EBITDA breakeven. But I mean, our guidance is, that we're going to, basically our target is between 155 and 170 on revenue. We're going to do everything we can to continue to focus on our cost structure and be very diligent and how we can take costs out and focus on that where we can, but we're not going to, we're not going to do the wrong thing. So, I think that's where we need to be right now. And that's, that's our guidance for the year. Please proceed with your question. Yes, I was going to say I just I want to make sure I heard the question right. So I think the way we handle that growth is, a two part answer, but it's not something that we typically give guidance on. Yes, I think the only other note that I would make, in addition to just the comments that everybody sells is that we have a strong partner channel as well. And it's a space that we're growing, right. So when we think about sales, but I would also encourage you to kind of also think about it from an indirect standpoint and channel, we have a growing degree of interest in some established relationships already there. But again, we don't get quarterly guidance. And so when we give guidance for the year, there is a reason why we don't give that quarterly guidance, we want to make sure that, we're offering the best perspective we have on the year, but it can be lumpy, and it can move around. I mean, as I mentioned, we had contracts that got delayed at the end of fourth quarter that came in in Q1. But bottom line is, it's just not something we're comfortable yet. We may get to a point where we get there where we start to get quarterly guidance, but we're just not quite to that level yet. We've been talking about this, for the past several quarters is right. Our analytics business, which is a higher margin business, for us an area where we're seeing a lot of growth, right continues to be a part of our business that we expect to drive, right, a lot of growth for us overall. I would say, C&E is projected to have a good year as well. Yes, I would just say, I would point to our performance, which you've seen recently, which is, we've clearly been focusing on a shift of our revenue mix toward that higher margin analytics segment, technology lead services, right. As I shared that I, I continue to be genuinely excited about BigBear.ai, our potential our future and we are doing all the right things and have a very clear focus on long-term and sustainable growth for the business."
}