{
    "symbol": "WMG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-09 14:41:04",
    "content": " In recorded music, our revenue was approximately 1.19 billion, an increase of 8.5% from the prior year quarter with streaming revenue up 2.7%. Even in a quarter where ad supported streaming revenue came under pressure due to macro trends, we still grew most of our revenue lines and saw significant growth in operating and free cash flow. Adjusted for the onetime items that I will describe in a moment, total revenue and streaming growth were 14.9% and 10.3% respectively. The impact to adjusted OIBDA growth and margins was magnified by the reduction in streaming revenue, which was primarily driven by onetime items. Streaming revenue increased by 3%, compared to a very strong prior year quarter that saw impressive growth of 27%. Our prior year quarter performance was driven by outsize growth and ad supported streaming revenue that was recovering from COVID, new deals with emerging streaming platforms, and some especially successful releases. By comparison, our streaming growth in Q3, 22 was more muted, due to deceleration and ad supported streaming revenue driven by the challenging macro environment, and shifts in the timing of new releases. Adjusting for the impact of these onetime items, recorded music total revenue, and streaming revenue grew 13.1% and 9.2% respectively. While the macro challenges to ad supported streaming revenue may persist for some time, we expect streaming growth to improve for us in Q4 bolstered by robust release schedule, a less challenging prior year comparison, and new deals with emerging streaming platforms. Your line is open. Your line is open. After two follow-ups really so after adjusting for the new deals and the catch-up payments, weâ\u0080\u0099ve seen a few quarters of decelerating on the line recorded music streaming growth. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}