{
    "symbol": "KARO",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-20 09:36:04",
    "content": " We are establishing the leading connected cloud platform, enabling customers to develop effective controls and workflows, while digitizing their daily operations in one enterprise grade platform. Our cloud platforms seamlessly embeds into the day to day activities of our customers and offers unprecedented visibility of varying aspects of their operations covering driver, vehicle, cargo, worksite and more. This helps customers understand and ultimately streamline their operations, enabling them to deliver on their service offering to a higher level and remain competitive within their industries. We are committed to providing our customers with the best possible service and support, and we are constantly looking for new ways to improve our platform and our service offering. We support over 100,000 small to large businesses in optimizing their underground operations, including global multinationals like Coca Cola and Cargill. Innovating through an entrepreneurial approach that prioritize customer needs, utilizes hands on experience and skills, and being adaptable in both planning and execution, offering a strong value proposition, proven track record of delivering value enhanced solutions and passing on cost savings to customers through successful execution while maintaining prudent capital allocation. Having a strong financial foundation, the ability to control prices and maintain higher operating profit margins, solid unit economics and a history of sustained growth at scale, our strong management, intraperitoneal culture, and vertically integrated business model puts us at a significant advantage by inspiring ownership and practically creative thinking throughout the business. Karooooo is using data to improve operations, and we are at an early stage of a large growing opportunity with over 40% of global GDP based on the underground operations. In South Africa, over 10% of all vehicles are connected to the Karooooo platform. Predictive analytics of historical data are not only leading to improve customer loyalty, but allow us to develop new products and services. These robust earnings were achieved despite the group's strategic investment for expansion, brand building, and custom acquisition, a testament to our resilient business model that is highly cash generative."
}