{
    "symbol": "ZIM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-18 10:11:06",
    "content": " Thank you, Natalie, and welcome to ZIM's first quarter 2022 financial results conference call. Before we begin, I would like to remind you that during the course of this call, we will make forward-looking statements regarding expectations, predictions, projections, or future events or results. You are kindly referred to consider the risk factors and cautionary language described in the documents the company filed with the Securities and Exchange Commission, including our 2021 Annual Report filed on Form 20-F on March 9th, 2022. We also continue to support our Ukraine employees, customers, and partners in anyway we can. As highlighted in this slide, slide number three, we maintain our strong trajectory into 2022, delivering another outstanding quarter of financial results due to the proactive strategies we've implemented to capitalize on both the highly attractive markets and the ZIM differentiated strategy. In Q1, we generated record revenues of $3.7 billion, record adjusted EBITDA of $2.5 billion, and record net profit of $1.7 billion. Our results also stand out operationally as we grew our current volume by 5% in Q1, compared to Q1 last year. Slide number 4, you can see that our strong performance to-date, combined with the 2022 long-term contract rates that we have secured, boost our confidence with respect to our 2022 guidance. The average rate of our long-term contract, which took effect starting about two weeks ago in May 1st, reflect a rate increase in excess of 100%, in other words, more than double as compared to 2021. As such, we are raising our full year 2022 guidance and now expect to generate adjusted EBITDA between $7.8 billion to $8.2 billion, and adjusted EBIT between $6.3 billion to $6.7 billion in 2022. It is also, noteworthy, that our exceptional performance allows us to continue to return substantial capital to shareholders where our policy to distribute a dividend to shareholders on a quarterly basis at the rate of 20% of net income. We remain focused on executing across our strategic pillars, including operational excellence. Following our first long-term charter agreement for 10,000, 15,000 TEU LNG dual-fuel vessels, intended to serve our Asia to US East Coast service, our focus shifted to highly diversity vessels. Since the beginning of 2022, we announced three charter agreements for a total of 17 newbuild vessels with total TEU capacity of approximately 96,000. We added three 7,000 TEU LNG dual-fuel container vessels to the 15 vessels already secured in 2021 as well as eight 5,300 TEU vessels and six 5,500 TEU vessels. In total, we secured 46 new build vessels, scheduled for delivery starting in Q4 2022 and throughout 2023 and 2024. It is also important to highlight that of this 46 new vessels, 28 are LNG powered consistent with our sustainability core value, we continue to position ZIM at the forefront of the carbon intensity reduction among global liner that will support our customers to meet their own ESG objectives. When we take delivery of this green LNG fuel vessels, which will represent approximately one-third of our operating capacity, ZIM will be more carbon and cost efficient than it is today improving our competitive position. Given our mostly chartering capacity, we can easily replace our operated capacity to more environmentally friendly tonnage. Moreover, by opting to charter these LNG vessels other than on ZIM, we are also maintaining flexibility to transition to newer technology if and when they become commercially viable. ZIM now has an established track record of making minimum adjustment to meet changing market conditions, optimizing vessel deployment, supporting high utilization of vessels and exporting specific trade advantages to drive outstanding results and superior profitability. Since the beginning of the year, we've increased our operated capacity by approximately 11%, and we currently operate 137 vessels. We continue to identify new market opportunities, advancing our global new strategy to meet customer demand. As far in 2022, we have launched 10 new lines, including six that are expansion of our network and four replacement line to better meet our customers , notably in keeping result focus on promoting alternative modes of transport for e-commerce customers. We recently launched our Baltimore eXpress line, ZXB, a first of its kind, speedy e-commerce service from China and Southeast Asia to the US East Coast operated exclusively by ZIM. As part of our vision strategy, we identified this opportunity to add another building block in our ZIM Ecommerce Xpress Line, and launch the Baltimore service at a time when customers are seeking a competitive alternative to airfreight. Finally, as we discussed on our previous earnings call, we've extended our operational cooperation with the 2M Alliance on the Asia to US East Coast and US Golf Coast trades, while we move to ZIM independent services in the Asia to Med and PNW trades. We continue to meet growing demand, and competitively serve our customers, particularly on key transpacific routes. Our record results were once again driven by continued positive market conditions, which kept freight rates significantly higher than prior year. ZIM has continued to prioritize better-paying cargo and undertaken initiatives to capitalize on the e-commerce demand, which enabled us to improve cargo mix. Specifically, our average freight rate per TEU of $3,848 in the first quarter was 100% higher compared to the first quarter of 2021, and also 6% higher than our average freight rate in the preceding quarter. Our free cash flow in the first quarter totaled $1.5 billion, compared to $645 million in the comparable quarter of 2021, an increase of 130%. Total debt increased by $984 million since prior year-end, mainly driven by the increased number of vessel fixture, longer charter duration as well as higher daily charter rates. Over the same period, our cash position grew substantially by approximately $1.3 billion. As a result for the second consecutive quarter, ZIM’s net debt has been driven down to a level, at which the company closed the period in an effective positive net cash position. The average remaining duration of our current chartered capacity today, is 28.6 months, slightly up from the 26.1 months in March 2022, and breaching our current operating capacity to the scheduled delivery of our newbuild vessels. Also, only 11 of our chartered vessels are now scheduled for renewal between now and the end of 2022. And 28 will be renewed in 2023, and 34 potentially also reviewed in 2024. Next on slide 8, you can see that, we are delivering consistent improvement in earnings, at the same time our net leverage has trended downward from 2.4% in Q1 2020 to zero. Importantly, we continue to be positioned in the third-tier of our industry in this regard, reflecting the strength of our balance sheet. Revenue for the first quarter was $3.7 billion compared to $1.7 billion in Q1 2021, driven primarily by improved freight rates, and to a lesser extent, also an increase in carrying volume. Most importantly, we grew profitably with Q1 net profit of $1.7 million, representing 191% year-over-year increase. Adjusted EBITDA was $2.5 billion for the quarter, compared to $821 million in the first quarter of last year that is an improvement of over 20%. Consistent with our focus on the delivering industry-leading margins, adjusted EBITDA and EBIT margins were 68% and 60%, respectively, as compared to 47% and 39% in the first quarter of last year. I would like to note that, as anticipated, ZIM is currently incurring 23% corporate income tax in this math. In Q1 2022, company began the impact of the ZIM and as such, during the first quarter, we paid tax event in a total amount of $246 million. Moving on to slide 10, we continue to outpace the industry in terms of growth in carried volumes, without compromising our profitability. We carried 859,000 TEUs in the first quarter as compared to 818,000 TEUs during the same period last year. So we grew, our current volume by 5%, while the general market contracted by almost 2%. Volume growth in Q1 in non-transpacific trade did compensate for the decline in transpacific volume, which was negatively impacted by rejection. Sequentially, our Q1 2022 carried volumes were flat, compared to Q4 2021, while again up, the overall market shrunk by over 6%. Regarding our cash flow, we ended Q1 2022 with a total cash position of $5.1 billion, which includes, cash and cash equivalents and investments in bank deposits and other investment instruments. I would remind you that in April, we paid a dividend totaling approximately $2 billion. During the first quarter, our adjusted EBITDA of $2.5 billion converted into a $1.7 billion cash flow from operations. The first quarter of 2022, CapEx mainly related to the secondhand vessels we purchased in Q4 of last year that we got delivered in the first quarter of this year. Moving to our guidance, we are raising our full year guidance and now do expect to generate adjusted EBITDA between $7.8 billion and $8.2 billion and adjusted EBIT between $6.3 billion and $6.7 billion. The combination of port congestion and strong demand, especially in the United States, are the underlying factors shaping the strong market we are currently experiencing. The forecast for 2022 has also increased from 12% in March to 15% today, and the port congestion to absorb 7% operating fleet capacity in 2020. As you can see, the end-to-end transport time from the exporters location to the port of destination on China to US groups, which stood at 45 days pre-pandemic, more than doubled and is currently estimated to be around 103 days. Despite growing inventories in the United States, strong demand results in inventory to sales ratio remaining at a level which is far below pre-COVID or normal levels. You can also see here on the right that global volume in March 2022 is higher by 6% when compared to 2019, the last normal year experienced by our industry. The overall supply-demand balance remained positive for 2022, despite projections for 2022 to be adjusted downwards, due primarily to the impact of the illegal war in Ukraine and China's zero-tolerance COVID policy. The supply-demand balance reverses in 2023, when more significant newbuild deliveries, including ZIM green hours are expected. The order book has also consistently grown over the past several months, yet our view of market fundamentals for the near and mid-term remain overall positive. With major retailers setting more aggressive reduction in carbon emission than mandated, the motivation to scrap older, less efficient vessels will grow, reducing the growth in effective capacity. Next is the more shorter -- is the more short-term, we show that the decline in freight rate since January 2022, which is in consistent with typical seasonality impacting the first and second quarters in our industry. Yet, when manufacturing in China returns to normal and demand picks up in peak season, the added volume may put additional pressure on already strained supply chain and congested ports in the United States and elsewhere. The graph on the right compares the development of freight rates from 2018 to 2022 to-date, and again, demonstrates the price decline in Q1 are consistent with typical seasonality. The downward trend in 2022 extended longer than prior years, again, most likely due to the Shanghai lockdown. With respect to our overall expectations for freight rate, we would contend that certain factors including the sustained historically higher than average freight rates, now entering the third year in a row, structural changes in container shipping, vertical growth strategy being pursued by various liners and higher cost incurred by all players will keep freight rates of declining to pre-COVID levels when rates finally normalize. As Xavier just outlined, strong underlying market fundamental support our optimism for the future as we leverage our global niche strategy to meet growing customer demand. Importantly, we have secured fuel efficient newbuild capacity that will strengthen our market position and commercial prospects moving forward, while maintaining ample flexibility in our operated capacity. We are pleased with our incredible progress today as a public company and excited to carry our momentum forward, continue to advance ZIM position as innovative digital leader of seaborne transportation and logistics services to maximize value for all stakeholders. Thank you very much. Obviously, if you look at your guidance and while your EBITDA for Q1 and what does that imply in terms of H2 actually, do you expect like steep normalization and rate because in one of your slides, you do say that disruptions might extend into 2023. The contract season for us on the transpacific is starting from the 1st of May and will extend up until the 30th of April, next year. So we increased the guidance on the back of higher than anticipated contract rates that will start to kick-in or started to kick-in, in the 1st of May. We made still the assumptions in and embedded in our guidance that the spot rates would start to normalize in the second half of this year and that to some extent, the reduction in the spot market would be offset by the incremental revenue that we will generate on the contract cargo compared to last year. So, we still expect a conservative view in that sense that we believe that it is a possibility that the spot market will start normalizing in the second half of this year. And when talking about the -- I think the third aspect of your question, what do we see in terms of the demand. Currently, as you know, there is the situation that has been affecting the whole of the industry, especially relevant in Shanghai with the lockdown of Shanghai and Shanghai being a very important export placed out of China. We are also hearing and reading the same as I think you do that -- the idea is that the situation should start to resume and production should start to resume and lockdown should start to ease, so that by the end of June, production should go back to normal as far as Shanghai is concerned. Up until today, we have -- we managed to compensate the shortfall of export cargo from Shanghai by reallocating some of our volume to South China and also Southeast Asia. But at some point, indeed, if the situation was to remain as is and if the manufacturing sites were not allowed to come back to production, then the situation would deteriorate, but we see -- we don't see that happening. And in terms of booking forecast, looking at our filling factors, the vessels for the weeks to come and for the few months, a couple of months to come, are expected to stay full. And then on the contract, we have a little bit more than that due to the -- not only do we negotiate contract risk, but more importantly for our customers today space in terms of the volume. If we look at the first quarter where we generated an increase of 5% versus the same quarter last year, we were affected by the congestion on the Transpacific. We've opened quite a few new lines within the Intra-Asia region, including between Southeast Asia to Australia, so the growth on Intra-Asia has been quite dynamic and allowed us to compensate for the slight reduction we've seen in volume due to the congestion on the US. The first question with regards to the current discussions in the union discussions in Port of LA, very difficult for us to comment on what could be the outcome, what we can say is that as is always the case, we hope for the best and get ready for the work. We've seen some of our customers be directing some of their cargo already in anticipation of what could be the outcome of the discussions, or if there was to be some action also in an action on the – in the Port of LA. So some of the cargo has been moved already from the US West Coast to the US East Coast, which also explains, to some extent, why there is an increase in the congestion of the US East Coast terminals. With respect to your second question, as we all know, 2022, is not going to be a year where we will see a significant new building being delivered in the 2023 on paper active and 2024, indeed are – or were expected to be years where significant amount of new tonnage are expected to be delivered. It is possible and time will tell, it is possible that the initial planning and we are sensing that some shipyards, especially in China, maybe more than the shipyards in Korea are being affected, as you suggested by the zero-COVID policy that is being enforced in China, may struggle to deliver the vessels as per the original schedule. As far as ZIM vessels are concerned, because you know that we are expecting some vessels in 2023. The first one being expected to be delivered in February 2023, we seem to be on schedule. And I think this is what we want to illustrate when we show and we keep on displaying that graph, which is the inventory to sales ratio in the US, which is for us a key metric that we track. The other one, obviously, there's the crisis in Europe, Russia, Ukraine is also having some effect on Asian offshore trade link. There is all the orders that have been placed prior to the Shanghai lockdown are still there, and we need at some point to be lifted to -- from China, Southeast Asia to the US. And what may also happen is pre-Thanksgiving, pre-Christmas shopping season, which is the peak season for us, you know, activity in our industry might start earlier than initially anticipated. The average -- if we look at what we have, we have -- we operate 135 vessels, 137 vessels today. And in terms of charter duration, they are all on charter for more than a year; we've contracted for more than a year. When we renew a contract or since already in late 2020 and throughout 2021, and today, still in 2022, when we renew a charter, when we fix a vessel, the average charter duration is between three to five years. Now when it comes to -- and I think this is a very important point that you're raising in the second part of your question, what is left in terms of fixture that will come up for renewal in the quarters to come. And looking ahead into 2023 and into 2024, we have out of the 137 vessels today that we operate, 11 vessels, for which the charter will come to an end between now and the end of the year. So then it is rightly that we want to renew those charter, and we might enter into charter contracts for duration between three to five years for those 11 vessels out again of the 135 vessels -- 137 vessels. However, looking ahead into 2023 and into 2024, that's where we cover the flexibility that we need and that we want in order to leave room for the new buildings that will be delivered -- will be delivered to us in 2023 and 2024. So in 2023, we have 28 vessels or charter that will come to an end. So that’s 62 vessels, altogether that will come to an end in terms of chartering agreement, and to put it into perspective to be compared with the 46 newbuilding that will be charted to us over the same period. And my second question is on the new Baltimore eXpress line, and you can speak generally to -- on the other Express and also the eCommerce lines. It is difficult to price it or to give an indication as what is the percentage of premium that we are generating on those trade lines, but we generate on average, better income or better margin per TEU that we would on a more traditional line\n Okay. The -- when we look at the cargo mix or the trade mix where every country operates, 45% of our volume is from trans-Pacific. But -- so 45% is trans-Pacific, and that is where we are talking about a long-term contract. And 50% of our volume will be -- or are contracted on a long-term contract basis and 50%, we remain exposed to spot. So from a volume perspective, you can think that 25 -- a bit more than 25% of our volume is contracted and you can apply that first line of our criteria. The second one that obviously, needs to be taken into consideration is that the trans-Pacific in terms of -- in terms of profitability may differ to the other lines in terms of volume -- in terms of EBIT margin per TEU. So from a profitability perspective, it is north of the 25% I just talked about that is being locked in already in for the future quarters. Just firstly, Xavier on your comments that you're now operating 137 vessels. Can you just talk a little bit about utilization of these assets in the most recent period and how you expect that to move ahead, I guess, as the lines pick up. I mean, news from some of the largest US retailers is a little bit confusing in terms of the sales growth being driven by price rather than volume and clearly there are associated implications. Maybe on the first part of your question with regards to the fleet utilization, 137 vessels compared to the 125. So that explains also to some extent why we are operating more vessels and you don't see the exact same translation in terms of carried quantity, because of -- as I said, we used to be a net buyer of space on board our partner’s vessels. The one thing that has had an impact, nevertheless, is the congestion issue, the waiting time, meaning that that translated into a longer transit time to carry the same volume of cargo from one place to the other. Looking forward to the capacity plan that is out, we want to make sure and we have taken all the necessary steps already to ensure that for our core lines that we have a very strong foothold that we have the capacity that we need in order to not only defend, but also increase our competitive position in those very important trades. And this is very much the 46 newbuilding vessels that we referred to earlier on that will come our way in 2023 and 2024, which will allow us to get a very efficient and the leaner tonnage that will position us very strongly. And this is why we are very pleased to see that we will have the option to do so, because as I was referring to earlier on in 2023-2024. The 20 -- or 62 vessels that we cover for renewal if we see that there are opportunities for us to enter into new trades, then we will renew those charter on top of the one -- or some of them on top of the new capacity that we will get delivery for. So we will have the option, not the obligation to operate more vessels into the coming years. We've been, I think, very aggressive in entering into this type of trade, starting with our liaison between Asia, Southeast Asia, China to L.A. and then we expand it to a same type of a trade between Southeast Asia to Australia and New Zealand. Now we're just announced the opening of the same trade length between a similar service, sorry, between Asia to the US East Coast. If we look at what it was over 2021, pretty much 25% of our transpacific trade and to a lesser extent on the Intra-Asia as well with the Australia, maybe 20% of our Intra-Asia trade were very much e-commerce trading. Obviously, with the current situation impacting Ukraine and as we all know, Ukrainian’s are greater seafarers and we have a lot of seafarers Ukraine’s situated on board. For us, it has a limited impact because largely as we mentioned, we are chartering in the capacity that we operate. And as part of the charter rates, the daily rates that we do pay to the tonnage honor that include as well the manning of the vessel, the ship management of the vessel that includes the seafarer wages and the technical support. And throughout the discussion, the first question that we were addressing with our customers was the amount of the space that we could allocate to each and every one of them. So it was more a strategic decision from the company to stick to the 50% allocation between contract and spot as we also like to be able to benefit from the spot market, especially during the peak season, where normally it is to be expected that, the spot can outpace the contract – with the contract rate. So that has been a recipe that has worked for ZIM over the past few years, and we didn't see any reason to change drastically on that front for this very specific contract season. Thank you very much. The second question is on the, the 46 vessels. The – on the first question, with respect to the transpacific contract rate, yes, we did mention that, the – we settled or we agreed on average at rates that are more than double compared to what we signed the – same time – same time last year. But by and large versus the spot today, we were or we – completely depending on when you are looking at in terms of over the past few weeks. With regard to your second question, the 46 vessels, we did indeed agreed to pay stuff or too – to put upfront some cash at the time we will get the delivery of those vessels. And it was actually not a request from the charter – the service providers, but more a request from us to be able to put our cash to good use, as opposed to have to – to remunerate the equity of the tonnage of owners that would otherwise demand a very strong remuneration of that equity. So, it was a way for us to reduce the daily charter rate that we would be paying over the duration of the chartering agreement. And by and large, I think we did communicate for the first series of vessels with Seaspan the tenth – 15,000 TEU vessels. We are talking about $13 million per vessel, so $130 million altogether for the 15 vessels. And then for the subsequent order of the 7,700 TEU vessels, 18 of them, we agreed for $20 million altogether in terms of payments. So, if you add everything altogether, the commitment in terms of cash out at the time, we will get the delivery of those newbuild will be in the region of over $500 million. And to the last question, it's difficult to answer that one, Sam, because obviously, we don't know, what the chartering renewal rate will be or would be, if we were to renew the charter in 2023 and 2024 as opposed to let go the vessels that we currently operate to make room for the ones that would be delivered to us. But obviously, we would only do it, if we felt that this was the right thing to do for -- from a business perspective, as you know, it is very high on our agenda to grow profitably and to enter into trade, where we believe that we can generate ongoing and sustainable profit. Thank you very much."
}