{
    "symbol": "SALM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 14:10:20",
    "content": " In the first quarter of 2022, our total combined digital revenue, that is the digital revenue within the Broadcast division plus the revenue from the national digital division, was $18.5 million, an increase of 10.9% from the first quarter of 2021. Revenue in the Broadcast division was up 10% compared to the first quarter of last year, and it's encouraging to note that some of the biggest growth areas in this division is from traditional radio revenue. Finally, digital revenue within the Broadcast division increased 16.1% to $8.2 million driven primarily by the growth of revenue at Salem Surround. Lastly, as I already briefly mentioned, the book publishing division had a 31.8% reduction in revenue in the first quarter as the book release schedule was significantly lighter compared to last year. For the first quarter, total revenue increased 5.5% to $62.6 million. Compared to last year, net broadcast revenue increased 10% to $48.4 million, and broadcast operating expenses increased 14.3% to $38.1 million resulting in station operating income of $10.3 million, a decrease of 3.7%. And looking forward, for the second quarter of 2022, Salem is projecting total revenue to increase between 6% and 8% from second quarter 2021 total revenue of $63.8 million. Salem is also projecting operating expenses before gains or losses on the sale of disposal of assets, stock-based compensation expense, changes in the estimated fair value of contingent earn-out consideration, impairments, depreciation expense and amortization expense to increase between 7% and 10% compared to the second quarter of 2021 non-GAAP operating expenses of $55.0 million. First off, even before you get into films that may be -- or content that would be banned on more general marketplace platforms, there's a very unique audience that we appeal to, and we can put content on SalemNOW that they -- it's just easier for them to find it on our site than it would be sifting through millions of titles on some other platforms."
}