{
    "symbol": "CD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 14:02:02",
    "content": " Our total client commitment increased by 100 megawatts in the fourth quarter, mainly contributed by four major projects in China and in Malaysia, supporting two of our key existing clients, specifically, we received 8-megawatt IOI for project MY03 in Malaysia, supporting the key international clients, making the product now 100% committed. On Slide 10, for our existing 613 megawatts of in-service capacity, 96% of them are committed by clients in either contract or IOI by the end of the fourth quarter compared with 96% in the previous quarter and 87% in the same quarter last year. For our total capacity on Slide 11, the commitment ratio is 92% by the end of the fourth quarter compared with 85% in the previous quarter and 87% in the same quarter last year. We added 71 megawatts of utilized capacity in the fourth quarter, bringing our total utilized capacity to 525 megawatts compared with 304 megawatts in the same quarter last year, which is 72.5% year-over-year growth and 15.7% quarter-over-quarter increase. Revenue in the fourth quarter decreased by 77.8% year-over-year or 15.6% quarter-over-quarter to reach RMB 1,390.3 million, which is in line with the 72.5% year-over-year and 15.7% quarter-over-quarter increase in utilized capacity. Looking further down on Slide 24, total cost of revenue in the fourth quarter increased by 88.5% to RMB 820.5 million from RMB 435.2 million in the same period of 2021, mainly driven by the increase in utility costs and the depreciation and amortization expenses. Selling and marketing expenses remained at normal level in the fourth quarter of last year, slightly decreased by 1.7% year-over-year to RMB 18.4 million primarily due to less share-based compensation expenses. General and administrative expenses in the fourth quarter of 2022, saw a spike of 134.5% year-over-year to RMB 214.5 million, a one-off long-lived asset impairment cost of around RMB 83.5 million has been the major contributor to such a change. With this, operating income in the fourth quarter of 2022 increased by 39.7% year-over-year to RMB 309.4 million, with a margin of 22.2% compared with 28.3% in the same period of 2021 and 76.4% in the third quarter of 2022. Net income in the fourth quarter of 2022 was RMB 116.5 million year-over-year 1.6% increase and a negative 51.7% quarter-over-quarter decrease, mainly due to the one-off impairment costs. Adjusted EBITDA, in the fourth quarter of 2022, increased by 78.4% year-over-year to RMB 720.9 million from RMB 404.2 million in the same period of 2021. Adjusted net income in the full year of 2022 increased by 99% to RMB 949.9 million, with margin improving to 20.9% compared with 16.7% in the previous quarter. Capital structure is healthy with total debt to capital ratio at 43.5% compared with 44.1% in the previous quarter, the healthy momentum on EBITDA growth based on the rapid ramp-up of our clients continue to support a strong return profile of the company with an 86% IT capacity utilization ratio by the end of the fourth quarter."
}