{
    "symbol": "CD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 13:24:06",
    "content": " We added 40 megawatts of utilized capacity in the first quarter, bringing our total utilized capacity to 344 megawatts compared with 238 megawatts in the same quarter last year, which is a 45% year-over-year growth. Take a closer look at our current deployment in the APAC emerging market, which is around 70% of our total capacity, our total around 117 in Malaysia and India, among which 89% are either contracted or was IOI by the end of the first quarter. On Slide 21, revenue in the first quarter increased by 43.1% year-over-year to RMB920.6 million, driven by the robust growth of the Company's e Company’s colo services. On Slide 22, in line with the company's revenue growth, total cost of revenue in the first quarter of 2022 increased by 29.1% to RMB499.6 million from RMB386.9 million in the same period of 2021, mainly driven by increased utility costs, and depreciation and amortization expenses. Selling and marketing expenses in the first quarter of 2022 increased by 6.8% year-over-year to RMB22.4 million, primarily due to higher share-based compensation expense. General and administrative expenses in the first quarter of 2022 increased by 32.9% year-over-year to RMB127.8 million, primarily due to higher share-based compensation expenses. Research and development expenses in the first quarter of 2022 increased by 5.4% year-over-year to RMB19.2 million, primarily due to higher personnel costs, as the company continue to invest in its research and development initiatives to further enhance its service offerings. With this, operating income in the first quarter of 2022 increased by 107.9% year-over-year to RMB251.6 million with a margin of 28.3% and net income in the first quarter of 2022 increased by 62.5% year-over-year to RMB94.6 million with a net margin of 10.3%. Your line is open. Thank you, Liu Yang. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Thank you, Liu Yang."
}