{
    "symbol": "CD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-22 16:16:04",
    "content": " On Slide 4, we added one new project, hold an additional 45 megawatt new capacity in the third quarter, burning our total capacity to 821 megawatts and total number of data centers to 31. We received an additional client commitment of 49 megawatts in the third quarter, burning our total contracted and IOI capacity to 700 megawatt, leading to still a healthy client commitment rate of our total capacity at 85%. Our delivery is generally in line with the original schedule as we put three projects into service in the third quarter with a total capacity of 68 megawatts, CN14 and CN18 located in our Shanxi and Hebei province campus respectively, are supporting the business of our anchor client. For the first nine months in year 2022, we have received a total of around 110 megawatts of client commitment, representing a 19% increase from end of last year. On Slide 11 for our existing 579 megawatts of in-service capacity, 96% of them are committed by clients in either contract or IOI in the third quarter compared with 95% in the previous quarter and 88% in the same quarter last year. For our total capacity on Slide 12, 85% of them were committed by clients by the end of the third quarter compared with 84% in the previous quarter and the same quarter last year. In addition, the majority of specifically 85% of the existing contract of our contracted capacity remains to be in 10 years term and the weighted average remaining term per contracted megawatts by the end of the third quarter is around 8.27 years. We added 53 megawatts of utilized capacity in the third quarter, bringing our total utilized capacity to 454 megawatts compared with 268 megawatts in the same quarter last year, which is 69.3% year over year growth and 13.1% quarter-over-quarter increase. Meanwhile, based on our existing client commitment, we have 246 megawatts of client commitment unutilized by end of the third quarter, which is around 54% of our current utilized capacity. Looking further down on Slide 22, total cost of revenue in the third quarter increased by 74.2% to RMB736.5 million from RMB422.9 million in the same period of 2021, mainly driven by increases in utility costs and depreciation and amortization expenses. General and administrative expenses in the third quarter of 2022 increased by 36.1% year-over-year to RMB116.1 million, primarily due to higher share based compensation and professional fees incurred during the period."
}