{
    "symbol": "WBS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 13:02:23",
    "content": " While you will see net charge-offs were elevated from prior quarter at a reported 25 basis points annualized, approximately $13 million of the net charge-offs resulted from proactive balance sheet management and optimization through the sale of more than $500 million worth of loans that were either no longer strategic or had suboptimal risk-return metrics. We expect GAAP net interest income on a non-FTE basis of $570 million to $590 million, excluding accretion, driven by our projection of a year-end Fed funds rate of 4.25%, as well as continued loan growth. Relative to last quarter, our outlook implies full-year net interest income excluding accretion of $2 billion, an increase of roughly $100 million or 5% from the outlook we provided last quarter. So we've talked publicly in the beginning that after diligence in closing the deal, we liked all the businesses, but over the next four to six quarters from close as good stewards of capital, we would continue to look at all of our businesses to see whether they remain strategic, whether the risk return dynamics were strong, whether or not there were any potential kind of credit weaknesses as you looked out over paradigm shifts and so we took the opportunity. I mean, think about it, we grew loans around 5%, including the disposition of over $500 million in assets and with the tailwinds from our asset sensitivity and the strong organic loan growth in key segments, we thought it was a great time to take those actions. And then I will tell you that as I'm looking at the portfolio, one encouraging kind of data point for me is that in each of the last three consecutive quarters, the average rating risk -- the average weighted risk rating of our originations is actually better than on a material basis than the actual weighted average risk rating of the existing commercial portfolio translated into the fact that we are bringing on lower risk assets. I mean that's, probably $20 million and sort of clawing that back is $9 million, so the net $11 million of those two things and that $9 million is really related to, as John highlighted, the improvement that we see in NPLs and our folks  commercial classifieds, et cetera at a weighted risk metric that's improving. I think you meant -- you said third quarter, it exited the quarter, the  (ph) spot rate for deposit costs ended 55 basis points, 60 basis points or you expect fourth quarter to end --\n I said the third quarter -- the third quarter right now, we're at 41 basis points. So it's going to be work and we're continuing to focus on it, right, because if you're growing loans at the clip we are, we need to make sure that we're continuing to generate good sticky deposits going forward, but we'll take the victory of growing deposits in the quarter, but we also did benefit from government seasonality. The scheduled accretion guide of $14.6 million in 4Q '22, do you have any visibility as to what accelerated accretion in the quarter could be, just kind of looking at the delta between third quarter accretion and the fourth quarter guide? So we talked about $2.2 billion in total office exposure, about a little over $500 million of which was kind of stabilized medical office, which has a much better operating profile and I think is not subject to paradigm shifts that would impact traditional office."
}