{
    "symbol": "WBS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 15:03:06",
    "content": " The combined banks had a total of a 109 relationships with exposure greater than $40 million with a bigger balance sheet, shifts legal day one of the merger on January 34 -- 31, we pre -screened 61 deals and approved 27 deals with exposures over $40 million. The non-PCD provision added $175 million in accordance with purchase accounting, this is recognized as a provision truly income statements that's commonly referred to as double-count -- as the double-count as the assets are both marked on the balance sheet and income statement. It's no secret and we're very transparent about the fact that for us, and I'd say particularly in a rising interest rate environment, the deposits are more valuable to us because we get the full benefit of the value of those deposits to deploy directly into loan and asset growth, and with respect to the investments through both our proprietary offering and  and our other vendor, we only get really 12b-1 fees from that, so we're talking somewhere between 10 and 30 basis points depending on which avenue that runs, and so it is less profitable on its face. So I will tell you that as of quarter-end, our regulatory defined definition of leverage loans was roughly 6% of the entire loan portfolio of the organization with like-credit performance to the rest of the portfolio as we've said before, that's held historically through both the great financial crisis, through the pandemic in that while there may be volatility in risk rating at times, it really -- it performed at or better than the rest of the portfolio and it goes to some of the things you're talking about. Yeah, I think it's around $5 million on an annualized basis and it really is not related to either exiting markets or changing headquarters. And extrapolating then you're $9 million to $10 million -- you're falling to $9 million to $10 million or so per quarter -- by the third and fourth quarter, so then that's going to be a 6 basis points or so. Your growth -- commercial charge-offs growth, not net, of $11.2 million was such a jump from last quarter and from what it's been running, last quarter was 800,000, was most of that Sterling or was some of that vintage Webster, anything one specific, any color around that? I fundamentally believe that we've got enough leverage, enough geographic opportunities, a bunch of interesting business niches and verticals that historically we've been able to grow commercial loans, which now make up the predominant portion of the balance sheet at roughly 10% CAGR and it's been about six or seven years."
}