{
    "symbol": "FTAI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 13:02:06",
    "content": " During the second quarter, the $109.4 million FAD number was comprised of $161.6 million from our aviation leasing portfolio, $9.9 million from our infrastructure business, and negative $62.1 million from corporate and other. Weâ\u0080\u0099re making good progress by supplying all information requested by the insurers regarding our $290 million in claims for assets lost in Russia, Ukraine. To pull it all together, we expect aviation without any insurance recoveries will produce per quarter $90 million to $100 million in EBITDA from leasing, $20 million to $30 million in asset sale gains, which we think will be recurring each quarter, and $20 million to $30 million in EBITDA from aerospace products, totaling $550 million to $600 million in per annum EBITDA from aviation. In total, our Infrastructure business posted $26.7 million of EBITDA in the second quarter, up 34.8% sequentially from $19.8 million in the first quarter of 2022, importantly, each of our four core companies reported sequential growth in revenue and EBITDA. As we head into the second half of the year, weâ\u0080\u0099re seeing good momentum across the portfolio and expect to continue to generate meaningful sequential growth as our businesses continue to ramp up operations, following recently completed developments, and as new contracts kick in. In the aggregate, weâ\u0080\u0099re targeting achieving annual adjusted EBITDA in excess of $200 million in the next 12 months to 24 months. We expect this contract to generate approximately $20 million of incremental EBITDA annually, bringing substantial committed throughput volume to the terminal and provide a springboard for increased volumes â\u0080\u0093 growth and volumes. As we have communicated in the past, we target quarterly EBITDA for our 50% share of Long Ridge to be in the range of $12 million to $15 million per quarter. In July, we enter into agreements with Newlight Technologies for the construction of a new $300 million facility to rebuilt on Long Ridge property, which will produce carbon negative and biodegradable plastic products from natural gas, Long Ridge will sell power and natural gas to Newlight, as well as provide land under long term lease. And so weâ\u0080\u0099re seeing indications and seeing business in this month of July that make us very comfortable with our outlook for $80 million of EBITDA, in the next 12 months to 24 months. I know in the slides you called out a $200 million plus EBITDA run rate for the infrastructure businesses over the next one to two years, you referenced $80 million from Jefferson earlier. Jefferson $80 million, Long Ridge, weâ\u0080\u0099re targeting $50 million, could easily be more to the extent we produce excess gas, particularly at current market pricing, but behold $50 million plus for Long Ridge, and Repauno right now, weâ\u0080\u0099re including at $10 million, which is really only including, Phase 1 and a little bit of incremental activity that does not include Phase 2. So, we see it with a nice ramp in terms of, if we did double the volume, if we had 10 engines, we might have 15 engines and/or as much as 20, but if each engine is sort of $2 million to $3 million, itâ\u0080\u0099s not a huge investment to get that kind of a turnover ramp, which we would expect to turn a module within three months to six months and sort of and do it multiple times a year."
}