{
    "symbol": "FTAI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 15:45:02",
    "content": " Secondly, as to Russia, Ukraine war and our assets lost in that conflict, we are writing off $195 million in Q1 for impairments, bad debt and lost revenue, but we expect to recapture all of that $195 million over the coming year. Absent the impact to our assets in the Russian-Ukraine war, which we estimate to be approximately $70 million in Q1, adjusted EBITDA would have been approximately $122 million, down 2% compared to $124.8 million in Q4 of 2021. Including onetime charges, actual adjusted EBITDA was $51.6 million in Q1 '22, which is down 60% compared to Q4 2021 and down 9% compared to Q1 2021. During the first quarter, the $71.4 million FAD number was comprised of $117.1 million from our Aviation leasing portfolio, $7.1 million from our infrastructure businesses and negative $52.8 million from corporate and other. Most importantly, cash flow from operations for the quarter was $16.6 million in excess of adjusted EBITDA as cash realized from the optimization of Transtar railcar fleet was $3 million for the quarter, more than offsetting capital expenditures of $1.1 million. In total, we estimate an opportunity for approximately $30 million of incremental revenue -- sorry, incremental EBITDA over the next 12 to 24 months through these programs with minimal incremental capital need. First quarter EBITDA of $3.8 million was up 35% compared to $2.8 million in Q1 of '21 and up 66% compared to $2.3 million in Q4 of '21, driven largely by strong ship dock utilization for end up crude oil movements as well as the commencement of yellow wax crude by rail from the Uinta basin. So if you take the $475 million and then you look at the $375 million for the leasing, as I mentioned, we had about $35 million of leasing EBITDA in Q1 and the war in Ukraine cost us about 70, so call that roughly $105 million if the war hadn't happened for the leasing business. And so that if you use that as a base, the assets that we -- that came off lease that I mentioned that are either off-lease or stuck in Russia Ukraine figure that's about a $20 million impact to Q2 negative impact. Our ultimate goal is to get Jefferson to $80 million to $100 million of EBITDA, a precise trajectory for which we get there is -- I can't provide that kind of precision quarter-over-quarter. I think, Joe, you mentioned that you'd recover -- I think you said all of the $195 million that you're writing down. And I think the -- as I mentioned, we filed $290 million of insurance claims $75 million of that is for assets that are in Ukraine that look to us. So there is -- and we put out a slide on the capital structure in the deck, which I think is very helpful because the spin itself will generate $800 million of capital for aviation or FTAI aviation, which will reduce debt roughly to about $1.9 billion pro forma for the spin. And so instead of the engine, typically now, if you have a 10-year lease or 8-year lease and the shop visit is requiring you a 4, the airline has to do the shop visit it has to go out and get a spare engine, and it could take 6 months or 9 months, and it could cost $1 million just in getting a spare in transportation and all the downtime."
}