{
    "symbol": "NVEE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 03:11:03",
    "content": " And thank you for participating in today’s Conference Call to discuss NV5’s Financial Results for the First Quarter 2022 Ended April 2, 2022. Joining us today are Dickerson Wright, Chairman and CEO of NV5; Edward Codispoti, CFO of NV5, and Richard Tong, Executive Vice President and General Counsel of NV5. Before we proceed, I would like to remind everyone that today’s discussion contains forward-looking statements about the company’s future, business and financial performance. Please note, that unless otherwise stated all references to the first quarter 2022 comparisons are being made against the first quarter of 2021. In this presentation, NV5 has included certain non-GAAP financial measures as defined in Regulation G promulgated under the Securities Exchange Act of 1934 as amended. Non-GAAP financial measures included in this presentation are adjusted earnings per share, adjusted EBITDA and adjusted EBITDA margin. In addition, other companies may define non-GAAP measures differently, which limits the ability of investors to compare non-GAAP measures of NV5 to those used by peer companies. We will begin the call with comments from Dickerson Wright, Chairman and CEO of NV5 before turning the call over to Edward Codispoti, Chief Financial Officer for a review of the first quarter 2022 results. Thank you, Richard, and thank you to everyone that is joining us for today’s call. So, now let’s turn to slide five on that investor deck, where we will discuss our first quarter 2022 results. Gross revenues were $190 million, a 24% increase over the first quarter of 2021. Our adjusted EBITDA was $29 million, a 19% increase over the first quarter of 2021. Adjusted earnings per share was $0.99 per share, a 13% increase over 2021 first quarter. Although, we live in a difficult global environment with wars and the COVID pandemic, we continue to see positive opportunities for growth. NV5 has recorded a $683 million backlog with continued strong pipeline of opportunities for organic growth, and mergers and acquisition growth. Turning to page six, we will discuss our quarter one highlights and opportunities for the balance of the year. You will see we highlight growth from our six verticals, which all remain robust. We are seeing exceptionally strong growth in energy efficiency, geospatial services, utility and environmental transaction services, all of which are exceeding our budget projections for 2022. Let’s now go to page seven, where we will discuss our acquisition activity that has either taken place or opportunities that we see going forward for 2022. During the beginning of quarter one of this year, we completed two strategic acquisitions to strengthen our MEP services and our construction quality and tech services. River City testing allowed us to further expand our construction quality and kick services in the riverside in San Bernardino counties, two of the largest counties in Southern California. On page eight, I would like to briefly mention our backlog growth, which gives a strong indication of the continual growth of the company for 2022. Now turning to page nine, as you have heard us mentioned many times, cross selling is a major component of our internal organization’s growth. We will now transition the presentation to our CFO, Ed Codispoti to provide an overview of our first quarter financial performance. If you would please turn to slide 11 of the presentation, I will highlight some of our first quarter financial results. If you strip our incremental acquisition-related revenue, our year-over-year growth was 12%. Net income increased to $8.6 million in the first quarter of 2022, compared to $5.5 million in the first quarter of 2021, a 58% increase. Our GAAP earnings per share increased to $0.57 per share in the first quarter of 2022 from $0.41 per share in the 2021 first quarter, a 39% increase. And our adjusted earnings per share increased to $0.99 per share in the first quarter of 2022 from $0.88 per share in the 2021 first quarter, a 13% increase. On slide 12, you can see we continue to demonstrate strong cash flows on top of a relatively low net leverage position. Our cash flows from operations for the first quarter was $46.5 million, which was 1.6 times our adjusted EBITDA and our net leverage was 0.4 times. With that, I will turn it back over to Dickerson for some additional perspective on our growth positioning. You will see as a result of our strong performance for Q1 2022, we are increasing guidance for full year of 2022, where gross revenues from an original $773 million to $802 million now to $785 million to $810 million and increasing guidance for full year 2022 adjusted EPS from $5.39 per share to $5.70 per share to $5.39 per share now to $5.80 per share. I just wanted to start out, Dickerson, with a question on some of the businesses that you have around the commercial real estate, you have got clearly the MEP stuff that you have talked about and I know that you have been high on real estate transaction services, where we have seen very good momentum and that’s evident on your slide that you put out here today. That’s a good question, Andy, and it’s one that I often ask, how we are doing in their real estate transactional service business, because they are very sensitive and subject to interest rates. And it could be two things, it could be the portfolio, we do very large portfolio transaction services and I think many people are probably trying to get those done before they see the interest rate could go up. I can’t give too much away on forward thinking, but at the April results continue in that area from both groups. Our recent acquisition of Global Services and the Bock & Clark one that are make up our transactional real estate, both are operating very, very strong. But in that area, there could be erosion, there could be erosion at -- it’s a natural thing with interest rates to this type of services depending on those. That is probably the main area that we have that is subject to -- really subject to interest rates and I will speak in our concluding comments, how we try to position our company to be more end mandated work so that it’s not as sensitive to interest rates. I think I heard in the script that organic growth was 12% in the quarter and I was just wondering with the acquisitions that have been filtered in here, what’s your thinking the organic growth rate could be for the year that’s implicit in the in the revenue guidance that has been updated here today? I would say though that at our growth, we would continue and we feel comfortable sill with the hot mid-to-high single digits overall organic growth and that would be based on work that we are going forward replicate from now through the remainder of the year. I am going to let, Mark Abatto, the President of our GeoSpatial Group is on the phone and he may have some of the specific things, but let me give you a macro picture. And included in that budget was Geodynamics because of the acquisition happened, we have them in a full year rate right now. Initiatives, I -- we are going to be speaking up specific initiatives that we are doing for the year that continue to grow the company, and that hopefully what we mentioned some of those during our Investor Day presentations on May 26th. They have had a slight delay in one project that is going to be starting, but now we given through capital expenditure, we have given them the ability to do deepwater mapping that they weren’t able to do before and we are having a ship modified to do just that. So the geospatial area, we think is, where -- I am very pleased with it, certainly pleased with what’s been going from last year and that’s why I think we have some specific initiatives for the geospatial work. Mark maybe, you are there, if there’s anything specific you would like to comment, feel free to. I think that what we saw very encouragingly in 2021 was that, the large federal IDIQ contracting vehicles did start to close out in a timely fashion. The pacing of awards is roughly about the same as what we saw through 2021 and that is to say a little bit slower, but it’s a matter of timing and working through some of the kinks in the procurement cycle. They are positioned very well in a market, which is beginning to grow relative to offshore wind in cable corridor landing, which they are tailor made for, as well as a number of coastal resilience and charting projects. One on the direct -- the other direct cost line of the model that increased about 50% year-over-year, haven’t seen a number in the $15 million range on a quarterly basis in history as a company. In particular, our LNG business, which at times throughout the year depending on what phase of the projects they are in may have more pass through costs and others. And with respect to your question on contingent consideration, we did pay off about $1.5 million during the first quarter related to one particular earn out. Let’s see, so NV5 just recently added deepwater geospatial capabilities. Well, and I am going to let Mark go this, speak to the -- Mark Abatto speak to the specific of demand. But generally speaking, our work for any of the deepwater mapping and measurements, our clients are government agencies that are looking for mapping up and erosion of the seawall and many of that those measurements are taken because of change in the environmental conditions. But as the offshore wind energy market is developing, that is a space where we are investing and it’s a very under penetrated market and we see some great growth opportunities there as well and that happens to be more private sector. Well, I would give you that answer, but I may have to kill you, but so we don’t want to do that. And the reason I am a little bit hesitant, we will be speaking on Investor Day on some very specific initiatives that we are doing to capture the offshore wind power work. And so with each individual, there is one main general developer that we have just signed two initial contracts with and those are, I think, those contracts are for $3 million. But I can tell you the 16 -- of the 16, how much each of those are going to be, but there is one general contracting fact that we are having a ship built that’s being built to do that measurement and it should be completed, but it’s being done to the specifications that where we require and this particular client for the wind offshore has asked for. But I’d really defer -- I’d rather defer to our Investor Day, where we speak and we will have some visual on what we are actually doing -- going to be doing on wind and offshore measurement. Last question on from me, so it seems like there is a lot of acquisitions you have had in California. In the West, there’s huge issues with taking overhead power lines and putting them underground for fire mitigation and fire mitigation work and the major utilities in California, all have issues with buyers being developed from transmission lines. And so, we are doing a lot of work in the mitigation area and design area and those are for the Western utilities and so we think that there is a very good opportunity for that. We like the idea that we have tailwinds rather than headwinds, because infrastructure absolutely, it’s something that is mandated, it needs to be -- needs to have improvement. That infrastructure can be anything from water delivery service, drinking up clean water, going over safe bridges, going down roads that need to be done, then it’s probably we are defining infrastructure as work that for services that we actually provide. So I think we have seen the government funding that we are expecting to see hasn’t come to realization yet, Rob. Well, I don’t know if you mean from staffing, obviously, we want to keep most of our people utilized. And most of our work, so it’s based on our unit price basis where we have the people, we pay the people, they do the work. So it isn’t that we are being overwhelmed, but we can only utilize more people than we can. So I wanted to start with, I am trying to, if I remember correctly, last year geospatial started the year, maybe a little slowly or had some impacts around the weather and seasonality, just wondering if Mark could talk a little bit about that, because as to how that looked this year versus last year if I am remembering that properly. From time-to-time the weather patterns, particularly in the Northeast, snow and ice do disrupt the first phase of our value chain, the data collection and that was an impact in Q1 of last year. We had done enough of the data collection for some large projects, particularly for Utilities in the fourth quarter of 2021 with that kind of information available to us. It didn’t necessarily seem as though weather was particularly your friend this year either, so the idea that you were just still able to benefit is certainly a positive. I -- Mark can comment on this too, but it’s really geography driven. There is probably a competing firm one the Pacific -- in the Pacific area that we can still do some of that work, but not as much deepwater work. But as we also expand into offshore wind, that are very under-penetrated market, with very few competitors, especially in the particular part we play in, which is the nearshore cable corridor landing environment. And to do that, I’d first like to go back. And we have ranged, but basically speaking, our public entity service demands is usually 70% and this is mandated work and you have heard me say many times, this is work where people need to drink clean water, they need to go over safe bridges and they are not so dependent on that economy. So we have all been following the news and you know the international news, it’s very apparent that energy sources and delivery of those of energy is a worldwide concern. So there will be much more investment and we have seen this all over and this has been stated and you can see that there is going to be a tremendous amount of more investment in North America, where energy and we at NV5 want to be prepared and are prepared to support that. So what we will be doing and you have heard me reference this, we are having an Investor Day on 26th of May and you are going to see three specific initiatives that we will be talking about that will support the energy delivery systems, energy demand, existing utility support, and all of these will be initiatives that we tended to continue to do and add corporate resources to grow those. So we will be introducing those three and we invite anyone to -- any investor to come and attend who is in Chicago on May 26th and also for those that cannot attend in person, there will be a website and we will be answering many questions. I am very encouraged about what we are doing to grow this initiative, how we are supporting it from the corporate level and you will see a tremendous focus now on systems to deliver energy and new ways to map that, and hopefully, you will see those and we will be presenting those at the Investor Day to help grow the company. So, anyway, we live in very fragile times we know with the economy is changing and it’s very important that we at NV5 be nimble, as I said before, so that we can support opportunities and we can change. We can change from things that could be affected by interest rates, those that may not be, those that will be affected by higher demands for all of our services. So, anyway, thank you for the time you have given us today and we look forward to speaking to you either during the Investor Day or certainly be speaking with you in the next quarter. Ladies and gentlemen, this concludes today’s conference call."
}