{
    "symbol": "VATE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 15:59:04",
    "content": " However, for the first quarter of 2022 DBM achieved record revenues of $402.2 million, making strong progress on bigger jobs while maintaining a healthy backlog number. Consolidated total revenue for the first quarter of 2022 was $412.8 million, an increase of 140.3% compared to $171.8 million in the prior period. Net loss attributable to common and participating preferred stockholders for the first quarter of 2022 was $13.6 million or $0.18 per share, compared to net income of $12.2 million or $0.15 per share in the prior period. Total adjusted EBITDA, which excludes discontinued operations was $11.5 million in the first quarter of 2022 an increase from an adjusted EBITDA of $1 million in the prior year period. At Infrastructure, revenue increased 149.3% to $402 .2 million from $161.3 million in the prior quarter. As discussed earlier, this increase is due to the acquisition of Banker Steel resulting in an additional $136.1 million in revenue as well as higher revenues of the fabrication and erection business which was partially offset by a decrease at the construction modeling and detailed business due to the completion of certain projects in 2021 and the industrials maintenance or repair business. Infrastructure adjusted EBITDA for the first quarter of 2022 increased to $20.5 million from $11.3 million in the prior year period. The increase is largely driven by the contribution from Banker Steel and increased profit as a result of higher sales at the fabrication erection business, offset in part by lower margins in the industrials maintenance and repair business and the construction modeling and detail business as a result of the completion of higher margin projects in the prior year as well as an increase in G&A expense due to the acquisition of Banker Steel. Non-operating corporate adjusted EBITDA losses were $4.6 million for the first quarter of 2022, up from the first quarter of 2021 by $0.6 million, driven mostly by the timing of professional service expenses, accrued discretionary bonus largely due to the anticipation of the mix of bonus between cash and equity, as well as the settlement with the company's former CEO. At the end of the first quarter, the company had $26.4 million of cash and cash equivalents compared to $45.5 million as of December 31, 2021. As of March 31, 2022, INNOVATE had total principal outstanding indebtedness of $684.6 million, up $53.8 million from $630.8 million at the end of 2021 driven primarily by infrastructures expected rise in a line of credit as a result of working capital needs in the first quarter of 2022."
}