{
    "symbol": "VATE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 03:49:11",
    "content": " Consolidated total revenue for the third quarter of 2022 was $423 million, an increase of 7.1% compared to $394.8 million in the prior year period. Total adjusted EBITDA, which excludes discontinued operations, was $16.4 million in the third quarter of 2022, an increase from an adjusted EBITDA of $14.3 million in the prior year period. DBMG ended the quarter with $247.5 million of debt, which is an increase of $58.9 million from year-end driven by working capital movements, which were at a low at year-end combined with top line business growth. Nonoperating corporate adjusted EBITDA losses were $5 million for the third quarter of 2022, up from the third quarter of 2021 by $1.2 million driven mostly by accrued severance related to the former chief legal officer as well as increased legal expenses. As of September 30, 2022, INNOVATE had total principal outstanding indebtedness of $711.5 million, up from $80.7 million from $630.8 million at the end of 2021 driven primarily by Infrastructure's increase in its line of credit as a result of working capital movements, corporate's utilization of the remaining credit line, as discussed in the previous quarter, and R2's borrowing from Lancer Capital. One other thing, I don't know if you can talk about third quarter, but if you ended the quarter with about 5 -- or $5.1 million of cash at the corporate level, can I ask how you pay the coupon on the 8.5% notes in August? And then two, what happens around -- is this corporate interest payment of $30 million, and I guess you have overhead, how does that -- is that -- that's every 6 months, so I guess you can make -- help us understand and get comfortable with that because if we believe the thesis that there's so much incremental value, I'm sure you'll figure it out on what the options would be. And then on the Lancer debt to Life Sciences, I'd love to understand the equity component because I think a big part of the thesis, if you're an investor with Lancer is that's going to -- that we're going to be treated right by insiders, I'm certain we are, that a rights offering is always fair."
}