{
    "symbol": "VATE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 11:25:24",
    "content": " Consolidated total revenue for the second quarter of 2022 was $392.2 million, an increase of 60.9% compared to $243.8 million in the prior year period. Net loss attributable to common and participating preferred stockholders for the second quarter of 2022 was $13.6 million or $0.18 per share, compared to a net loss of $23.7 million or $0.31 per share in the prior year period. Total adjusted EBITDA, which excludes discontinued operations, was $12.1 million in the second quarter of 2022, an increase from an adjusted EBITDA of $6.5 million in the prior year period. In Infrastructure, revenue increased 64.7% to $382.1 million from $232 million in the prior year quarter. As discussed earlier, this increase is due to the acquisition of Banker Steel, resulting in an incremental $105.4 million in revenue, as well as an increase in DBM's commercial structural steel fabrication and erection business, which was partially offset by decreases at the industrial maintenance and repair and construction and modeling detail businesses, due to the completion of certain large projects in 2021. In fact, they have sold $483 million into reported backlog during the quarter, which increased reported backlog, while maintaining adjusted backlog of $1.7 billion, when compared to the first quarter. DBMG ended the quarter with $230.4 million of debt, which is an increase of $41.8 million from year-end, however, down slightly from last quarter. Spectrum delivered adjusted EBITDA of $0.4 million in the second quarter, compared to adjusted EBITDA of $2.7 million in the prior year quarter. Non-operating corporate adjusted EBITDA losses were $3.4 million for the second quarter of 2022, down from the second quarter of 2021 by $2.3 million, driven mostly by a settlement with the company's former CEO approved in the prior year, as well as decreased levo expenses driven by lower activity in 2022. As of June 30, 2022, INNOVATE had total principal outstanding indebtedness of $669.9 million, up $39.1 million from $630.8 million at the end of 2021, driven primarily by infrastructure's increase in its line of credit as a result of working capital movements."
}