{
    "symbol": "MHO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 21:01:05",
    "content": " At a time of rapidly changing market conditions, we had a very strong quarter, highlighted by record quarterly net income of $136.7 million, which is 27% better than a year ago and a 34% increase in earnings per diluted share. However, given that we are operating in fewer communities than a year ago, as well as the declining market conditions discussed earlier, new contracts for the second quarter in our Southern region, which consists of nine of our markets decreased by 21% and decreased by 18% in the Northern region, which consists of the other six markets. We ended the quarter with record shareholders' equity of $1.8 billion, an increase of 24% over a year ago, book value of $66 per share, cash of $188 million, zero borrowings outstanding on our $550 million credit facility and the homebuilding debt-to-capital ratio of 28%. As far as financial results, our new contracts were down 12% in April, down 15% in May and down 34% in June, and these comparisons are to last year's record second quarter sales. To our buyer profile, about 55% of our second quarter sales were the first-time buyers compared to 54% in last year's second quarter. Revenue increased 8% in the second quarter, reaching a second quarter record of $1 billion and our average closing price for the second quarter was an all-time record $477,000, a 16% increase when compared to last year's $411, 000  Backlog average sale price is $519,000, up from $454,000 a year ago, and our backlog average sale price of our Smart Series is $430,000. During the quarter, we generated $195 million of EBITDA compared to $156 million in last year's second quarter. Where in 2022 second quarter, we spent $121 million on land purchases and $111 million on land development for a total of $232 million, which was down slightly from last year's second quarter. Our land position is very good right now and well vintaged, excited about the fact that we're opening up a record number of new communities in the back half of the year, all of which were put into contract on average probably 2 to 3 years ago, reflecting prices in effect at that time, not prices today or at least prices before 3 or 4 months ago when prices started to stabilize. And - but I think things starts - in the last 2 years or at least beginning with May of 2020, just after COVID first hit and demand just skyrocketed from May of 2020, all through the rest of 2020 and through all 2021, there was no spring selling season, and there was virtually no seasonality in M/I Homes like almost every other build that was limiting sales in almost every one of our communities, whether it was May, March, December, July. I think that there is a little bit of maybe getting use - I don't want to create the wrong impression, but I think buyers are starting to get used to fact that rates are probably at least for now settling into this maybe 5 and 3/8%  to 6% range, and we'll see how that happens and it has a little bit of incentivization by some of our competitors, and we've known a little bit too with buying rates down, you know, we'll see. Now the good news is, we're not having to do much at all, sometimes may be an interest rate buy down a little bit, sometimes maybe a few closing costs being covered, but we're not having to do a whole lot thus far to get this backlog closed, and that's kind of job one."
}