{
    "symbol": "MHO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 19:30:07",
    "content": " In terms of our performance, we achieved record first quarter net income of $92 million or $3.16 per diluted share, which is an 8% improvement in net income over last year's first quarter. We had record first quarter total revenue of $861 million, an increase of 4% from last year. We closed 1,823 homes in the quarter, a 10% decrease from a year ago with an average sale price of $457,000, which is an increase of 16% an average selling price. Pretax income increased 11% to $122.3 million, a first quarter record. We sold 2,514 homes during the quarter, a decline of 19% from the all-time record 3,109 homes that we sold during last year's first quarter. Company-wide, our backlog sales value at the end of the quarter was $2.8 billion, an all-time record and 17% ahead of the year ago. Our units in backlog increased by 1% to an all-time record 5,526 homes with an average selling price in backlog of $505,000, which is 16% higher than the average price in backlog a year ago. However, given that we are operating in fewer communities than a year ago and as I noted, that we are limiting sales in nearly two-third of our communities, new contracts for the first quarter in the southern region declined by 27% and by 9% in the Northern region. As to our buyer profile, about 54% of our first quarter sales were the first town buyers compared to 53% in last year's fourth quarter. We delivered 1,823 homes in the first quarter, delivering 38% of our backlog compared to 46% a year ago. We're very pleased that we started 2,400 homes in the first quarter, up 4% compared to last year's first quarter. Our average closing price for the first quarter was $457,000, a 16% increase when compared to last year's first quarter average closing price of $395,000. Our first quarter gross margin was 24.8%, up 40 basis points year-over-year and up 160 basis points over our fourth quarter last year. And our first quarter SG&A expenses were 10.5% of revenue, improving 50 basis points compared to 11% a year ago. During the quarter, we generated $135 million of EBITDA compared to $125 million in last year's first quarter. Our earnings per diluted share for the quarter increased to $3.16 per share from $2.85 per share last year, up 11%. Revenue decreased 19% from last year to $24.1 million due to a lower volume of loans closed, along with significantly lower pricing margins due to increased competition for purchased business. Loan-to-value on our first mortgages for the first quarter was 84%, the same as last year. Our average mortgage amount increased to $377,000 in 2022's first quarter compared to $328,000 last year. Finally, our mortgage operation captured 82% of our business in the first quarter compared to 84% last year. During the first quarter, we spent $94 million on land purchases and $101 million on land development for a total of $195 million, which was up from $163 million in last year's first quarter. In last year's first quarter, we purchased about 2,500 lots, of which 75% were raw."
}