{
    "symbol": "CUBI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 12:15:06",
    "content": " Our core loans increased $2.2 billion in second quarter, up 18.7% from first quarter 2022, and well above the $500 million average quarterly target that we shared with you. Our loan book, as you heard from Jay grew an impressive 32% year-over-year to $14.1 billion ex-PPP at quarter end, total deposits grew by 22% or $3.1 billion year-over-year, driven by monumental efforts from our commercial teams, amplified by our digital bank team's success in deposit gathering associated with our customers Bank Instant Token or CBIT launch. Our new lending verticals have already achieved outstanding balances are well over $1 billion since the inception surpassing our full-year 2022 goal, led by our fund finance team and very well secured assets with -- deposit rich customer basis. We expect transaction banking to enhance the Customers Bank customer focused value proposition and facilitate significant low to no cost deposit, as well as fee income opportunities in commercial and large corporate, high-growth verticals led by digital assets, FIG, fund finance and tech and venture. Our very well secured and well structured fund finance business that has been led by a team of senior executives from top five banks, led the growth with $700 million added in the quarter. All in, customer payments more than doubled in the quarter and deposits increased with the growth being led by new customers funding their opened accounts with about $400 million added in non-interest bearing deposits. As Sam mentioned earlier, we continue to see remarkable organic core loan growth in the second quarter of 2022, up $2.2 billion from the prior quarter and up $3.4 billion year-over-year. In total, our specialty lending C&I verticals ended the quarter at $4.8 billion, an impressive 50% growth over the prior quarter and 192% growth year-over-year. The $11.5 million in charge offs for the quarter after adjusting for the approximate $2 million cleanup of overdrawn consumer deposit accounts managed by a third-party servicer was comprised of $9.9 million in consumer loan charge offs and $1.6 million in commercial loan charge offs, equating to an annualized net charge offs to average total loans and leases of approximately 31 basis points."
}