{
    "symbol": "CUBI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 13:33:04",
    "content": " As some of you may know, we are actually pleased to share with you again that about 10 years ago, Customers Bancorp became a publicly traded company using what was a troubled small $150 million asset Pennsylvania based bank as our charter and we invested our personal money into it and today this little troubled bank has been transformed into one of the 100 largest banks in the country. This brings our full year 2022 core earnings per share to $6.51, and when you exclude PPP and the provision release benefit from the sale of $500 million of consumer installment loans in Q3 our adjusted earnings per share for the year were $5.65. And the second after tax net losses on PPP loans of $6 million or $0.18, primarily caused by slower forgiveness than expected, leading to higher funding costs and one-time charge-offs of $11 million net of a $7.5 million gain recognized upon settlement with a PPP loan servicer. As a reminder, included in this amount was a pre-tax provision benefit of $36.8 million or $0.86 from the loan sale that Jay mentioned earlier, leaving $5.65 of sustainable core earnings for full year 2022, significantly higher than our $4.75 to $5 target and the $4.44 we made in 2021. Our Q4 2022 held for investment loan growth was about 300 million of which $200 million was in our low risk variable rate, corporate and specialty banking vertical, which prices at roughly 300 basis points over SOFR. Wrapping up based on continued strong credit metrics and a portfolio comprised predominantly of loans to no-to-low credit risk verticals, strong portfolio management with ongoing loan level stress testing, limited exposure to high risk credit segments such as investment CRE office and investment CRE retail, which standard only $132 million and $180 million in total exposure respectively and continued strategy of not lending into discretionary spending dependent verticals. We expect our tangible book value to be above $45 by year-end, which is a 15% growth rate over the next few quarters, and a CUBI  valuation convergence to book value or higher due to these action implies at least a 50% valuation upside from recent trading levels."
}