{
    "symbol": "CUBI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 16:28:03",
    "content": " Our digital asset banking team has brought in another approximately $500 million in non-interest bearing deposits since the end of the quarter, bringing the total digital asset deposits to $2.3 billion as of April 15. Our teams have posted another billion dollar plus quarter in net originations excluding mortgage warehouse and $559 million net of that businesses decline, representing 8% of year-over-year net growth, 5% of quarterly growth and about 20% annualized growth. This slide shows a trend of increasing net interest income over the past five quarters, largely driven by strong growth in our core CNI book, including our specialty lines of business, combined with an increase in spreads as we continue to drive down our total cost of deposits by strategically running off higher cost rates sensitive deposits. Moving on to expenses, as expected, our non-interest expenses declined by 7.7 million to about 74 million in the first quarter, largely due to the one-time or other transitory items that we discussed last quarter, including higher compensation related to higher incentive accruals last quarter, given 2021 record performance, higher occupancy costs associated with the relocation of the bank headquarters and higher ESG-related charitable contributions and corporate sponsorships recorded in the fourth quarter of 2021. Additionally, the consumer installment loan portfolio annualized net charge off ratio of 1.63% for Q1 of 2022 is actually slightly below the average annualized net charge off rate of same portfolio of 1.64% for the final three quarters of 2021, which again, rated by COVID-19 economic stimulus. We continue to expect an average as you heard from my colleagues, 500 million of quarterly loan growth and significant digital asset-related deposit growth by year end 2022. And we see that pretty much being flat over the next couple of quarters when we think about liquidity, I'll just point out that we have $2.2 billion of PPP loans that are still on our books, which we expect from large majority of those are given by the end of the period, which essentially creates cash that can be reinvested to support the organic loan growth."
}