{
    "symbol": "CUBI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 14:14:06",
    "content": " Core loan growth this quarter was led by increases in low risk valuable rates specialty lending verticals of $500 million, which were largely offset by an expected decline in loans to mortgage companies of $300 million and a sale of $500 million of consumer installment loans at a net gain to the company of about $13 million. Building off of the momentum of industry leading, responsible loan growth and our variable rate, low to no loss specialty lending verticals in the first half of the year, in the third quarter the team focused on disciplined balance sheet management, which helps deliver strong net interest income growth and record recurring earnings, even after backing out the benefit of PPP. Importantly, this included approximately $500 million of growth in our specialty C&I lending business, up approximately 10%, led by our low risk, variable rate, lending finance vertical, which has been a vertical of ours for the past seven years in which weâ\u0080\u0099ve experienced no losses or even a single delinquency. And third, it was the significant financial benefits in Q3 resulting from, one, lower risk weighted assets of approximately $420 million, which is expected to benefit our regulatory capital ratios between 30 and 40 basis points; and secondly, our Cecil reserve release of benefit of approximately $37 million, net of a loss on sale of roughly $2.5 million, unamortized customer acquisition costs of $18.6 million and other deal costs of about $2.4 million or a net benefit of about 13. Moving on to deposits on slide 10, we increased total deposits by about $600 million in the third quarter, while also experiencing some shift in mix and higher deposit costs, which was not unexpected given the 300 basis points of breakout weâ\u0080\u0099ve had so far this year. From a loan mix perspective, the $500 million sale of consumer installment loans at the end of Q3 reduced our consumer installment portfolio by about 21% ending the third quarter at approximately $1.4 million. Based on strong credit metrics, our loan mix comprised predominantly of low credit risk loans, strong portfolio management with ongoing low level stress testing, limited exposure to higher risk loan segments such as investment CRE office at only $132 million; investment CRE retail at only $172 million, and hospitality at just $452 million, of which 75% carrier recourse and 77% are flagged. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}