{
    "symbol": "ALL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 12:33:05",
    "content": " Moving down the table, an adjusted net loss of $359 million was incurred in the fourth quarter reflecting an auto insurance underwriting loss, which is impacted by reserve increases for the current and prior years. Auto insurance had a combined ratio of 112.6 in the quarter and 110.1 for the year, substantially worse than our targets given rapidly increasing loss costs throughout the year. As you can see from the chart on the left, which shows the auto insurance combined ratio and underlying combined ratio from 2017 through the current year, we have a long history of sustained profitability in auto insurance due to pricing sophistication, underwriting and claims expertise and expense management. Starting with rates, since the beginning of this year, weâ\u0080\u0099ve implemented rate increases of 16.9% in the Allstate Brand, including 6.1% in the fourth quarter, which significantly increased written premium. Starting on the left, over the last 15 months, weâ\u0080\u0099ve implemented Allstate brand auto rate increases of 19.8% for an estimated annualized written premium impact of approximately $4.8 billion. Moving to Slide 11, the table shows Allstate brand auto results in three major states: California, New York and New Jersey combined contributed approximately a quarter of the Allstate brand auto written premiums in 2022 but accounted for approximately 45% of the underwriting loss. Net written premium has increased significantly throughout 2021 and into 2022, increasing 9.3% from the prior year quarter and 12% for the full year, predominantly driven by higher average gross written premium per policy and a 1.4% increase in policies in force. Revenues, excluding the impact of net gains and losses on investments and derivatives, increased 6.1% to $643 million in the quarter and 8.7% to $2.5 billion for the full year 2022. Given, the longer policy term compared to auto and homeownerâ\u0080\u0099s insurance products, the unearned premium balance continues to significantly grow as well, reaching $2.6 billion at the end of the year. For the segment, adjusted net income of $38 million in the quarter, increased $9 million compared to the prior year due to a one-time net tax benefit in Allstate Protection Plans. Revenues of $579 million in the fourth quarter of 2022, excluding the impact of net gains and losses on investments and derivatives, decreased 1.5% to the prior year quarter as a reduction in individual health was partially offset by an increase in group health and other revenue. Adjusted net income of $50 million, increased $2 million compared to the prior year quarter, resulting in a full year 2022 income of $222 million. Look, I think when you look at that trend of states above 100 and the increase throughout the year, I think what Iâ\u0080\u0099d point you to is when you just â\u0080\u0093 you look at our underlying auto combined ratio as we reported it, increasing throughout the year and being driven by increases in our severity expectations quarter-over-quarter as the year played out, as well as increasing frequency between Q1 through Q4, only partially being offset by the rate that we took."
}