{
    "symbol": "ALL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 12:54:04",
    "content": " Total revenues of $13.2 billion or 5.8% over the prior year quarter as property liability premiums earned increased by $5 billion or 9.8%, which reflected higher average premiums and policy growth. A net loss of $694 million and an adjusted net loss of $420 million in the third quarter reflected a decline in underwriting income due to an increase in profit liability, prior year reserve estimates, which was $875 million that excludes catastrophes and increased loss costs in the current year. Our underwriting results reflect the high level of inflation and the impact of reserve strengthening in the quarter with a third quarter recorded combined ratio of 117.4% for auto, 91.2% for homeowners, 126.6% for all other lines and 111.6% for total property liability, which is shown on the left chart. While the homeowners business generated $245 million of underwriting profit, higher severity resulted in an underlying combined ratio of 74.6%, which is above where we manage it to, and we are increasing prices through both rates and the inflationary adjustment factor embedded in our homeowners product to improve underlying margins going forward. Over the last 12 months, we've implemented Allstate brand auto rate increases across 53 locations for an annualized written premium impact of approximately 13.7% or nearly $3.3 billion, including 4.7% in the third quarter. The third quarter combined ratio for homeowners improved to 91.2%, primarily driven by lower catastrophe losses compared to the prior year quarter, as you can see by the chart on the left. In the third quarter, non-catastrophe prior year reserves were strengthened by $51 million, and current report year incurred severity was increased primarily as a result of increasing inflation in both labor and material costs. Similar to auto insurance, there was an intra-year impact of 2.4 points related to claims reported in the first and second quarter of this year, which was reflected in the underlying combined ratio for the third quarter of 2022. The chart on the slide shows the Allstate Protection underwriting expense ratio since 2018 and quantifies the impacts from third quarter 2022 compared to the prior year quarter, reflecting actions we've taken to address the current operating environment. On Slide 11, let's begin with our prior year reserve development, property liability, prior year reserve strengthening, excluding catastrophes totaled $875 million in the third quarter. The chart on the right breaks down Allstate Protection auto prior year reserve strengthening of $643 million in the third quarter, which was primarily driven by noncustomer claim and bodily injury claims. Revenues, excluding the impact of net gains and losses on investments and derivatives increased 7.2% to $640 million in the quarter, primarily driven by a 12.2% increase in Allstate Protection Plans. Adjusted net income of $35 million for the third quarter of 2022 decreased $10 million compared to the prior year quarter due to increased severity on appliance repair for Allstate protection plans, in the absence of onetime restructuring expense at Allstate Identity Protection in the prior year quarter as well as investments in growth. Adjusted net income of $54 million increased $21 million from the prior year quarter, reflecting a lower benefit ratio, lower restructuring charges and increased revenue. As shown in the table, at the bottom left, our total return for the quarter was negative 0.8% and year-to-date is negative 6.4%, while adverse market conditions negatively impacted the portfolio, we estimate our duration shortening mitigated portfolio losses of approximately $2 billion. Our market-based income, which is shown in blue, was $50 million above the prior year quarter, benefiting from reinvestment into market yields that are significantly higher than the overall portfolio's current yield. And so yes, we're not making any kind of significant assumptions around a deceleration in inflation going forward given the current inflationary environment, that's why we made the statement that we expect to continue to take rate increases certainly for the balance of this year but into next year, and that's really a reflection of the environment we're operating right now and the continued elevated level of inflation, which we need to kind of catch up with and then surpass going forward. I just showed the level of cash we would have after we used deployable capital to finish the share repurchase program, you can see it's still well above our fixed charges, which we intentionally managed to keep at a modest level, which is even though we increased the dividend by about 50% a year ago, we tried to give a lot of money back to shareholders through share repurchases."
}