{
    "symbol": "ALL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 11:52:12",
    "content": " Net investment income of $594 million was 16.1% below the prior year quarter, reflecting lower fixed income reinvestment rates, the impact of reducing the bond portfolio duration and strong performance-based portfolio income that was in comparison to an exceptional prior year quarter. The increase in revenues was driven by continued growth at Allstate Protection Plans, generating a 19.6% increase in revenues to $329 million compared to the prior year quarter. Revenues of $581 million in the first quarter of 2022 increased 4.9% to the prior year quarter, driven by higher premiums and contract charges and other revenue, primarily in Group Hub. They haven't -- they've shrunk a bit in homeowners, but that's setting ourselves up for than the strategy part of this, which is as we get our middle-market products based on that Allstate data and the Allstate capabilities into the independent agent channel marketed as National General and Allstate company, the endorsed branding, that we think we have a really great opportunity to grow homeowners with the Allstate level of sophistication and pricing and all the things I talked about in the opening remarks. First, I guess, where I'd start is, the objective of providing that rate information monthly that we started this year was really to create a level of transparency into what we were doing with auto profitability with rates being such a significant lever and provide you all with a view of the progress we're making but also some color around what we're seeing on a forward-looking basis. And the statement we made in our most recent release was really a reflection of what we were seeing in loss trends in severity development both in terms of what we saw in last year, we strengthened reserves by $151 million in auto this quarter and what we were seeing in terms of the physical damage severity escalation as well as what -- how that translated into current year severity. When I think about nonrate actions across the Allstate book, it really goes back to what I was talking about where it's about -- I don't like to isolate it to the word underwriting because then it sounds like you're sort of deciding to write or not to write as opposed to getting the right level of rate for each type of risk, but that also goes into with underwriting and marketing and distribution how you go to market."
}