{
    "symbol": "INST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 22:37:07",
    "content": " We delivered this growth while continuing to demonstrate the strength of our business model with a non-GAAP gross margin of 77.8% in the third quarter, up roughly 90 basis points year-over-year as we optimize our third-party technology costs and improve the efficiency of our support operations. Third quarter adjusted EBITDA grew 15.4% year-over-year to $47.6 million, a 38.9% margin of ACR as we further demonstrated operating leverage on both the gross margin and adjusted EBITDA lines. In addition, we believe our focus on continuous improvement will drive enhanced profitability versus our already industry-leading margins. For the third quarter of 2022, we remained a rule of 50-plus company with 12.8% ACR growth and 38.9% adjusted EBITDA margins, further validating the underlying quality of our business. As Steve mentioned, we generated third quarter 2022 total GAAP revenue of $122.4 million, up 14.2% year-over-year and ACR of $122.5 million, up 12.8% year-over-year. Subscription and support revenue accounted for 89.6% of our third quarter revenue at $109.7 million, up 14.1% year-over-year, primarily as a result of the continued momentum within our core Canvas LMS product, both domestically and internationally, in addition to strong upsell and cross-sell of our other products. Professional services and other revenue accounted for 10.4% of our third quarter revenue at $12.7 million, up 14.9% year-over-year, driven by strong implementation and training services delivery in our higher education business. In addition, we believe our focus on continuous improvement will drive enhanced profitability versus our already industry-leading margins. As we mentioned in the remarks, we're seeing still a focus on digital transformation, a lot of -- a lot going on in K-12 right now, and they're dealing with a lot of things outside of these kind of platform installations, but I wouldn't say there's any change there."
}