{
    "symbol": "HI",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-09 10:39:03",
    "content": " Our first quarter revenue from continuing operations grew 16% compared to the prior year, driven by our recent acquisitions and healthy organic growth for our Advanced Process Solutions segment. In our first quarter, we delivered revenue from continuing operations of $656 million, an increase of 16% compared to the prior year, primarily due to acquisitions, higher aftermarket revenue and favorable pricing. Adjusted earnings per share from continuing operations of $0.70 increased $0.14 or 25% compared to the prior year, primarily due to pricing and productivity improvements, the impact of acquisitions, fewer shares outstanding and a lower tax rate. Cash flow from operations represented a use of cash of $6 million in the quarter down approximately $26 million from the prior year, primarily due to unfavorable customer advances resulting from order softness within MTS, which was more significant than we expected. APS revenue of $430 million increased 30% compared to the prior year, driven by acquisitions, higher aftermarket revenue and favorable pricing. Backlog of $1.63 billion increased 23% compared to the prior year or 11% on an organic basis, driven by strong order volume for large plastic projects and aftermarket parts and service. Turning to MTS on Slide 8, revenue of $243 million decreased 2% year-over-year, but increased 2% on an organic basis as favorable pricing and higher aftermarket parts and service revenue were partially offset by a decrease in hot runner sales. Turning to Slide 12, with the divestiture of Batesville, we were moving $600 million to $610 million of annual revenue and $0.95 to $1 of annual adjusted earnings per share from our guidance model, which reflects Batesvilleâ\u0080\u0099s previously expected financial contribution as well as the expected reduced interest expense from the planned paydown of debt with the net proceeds from the sale. As a result, our guidance now assumes slightly increased expected revenue of approximately $2.8 billion to $2.9 billion for the year, with adjusted earnings per share from continuing operations in the range of $3.25 to $3.55, reflecting year-over-year growth of 20% to 31% on a continuing operations basis. With the recent changes to our portfolio and the ongoing macroeconomic uncertainty, we are providing a Q2 guidance range for adjusted earnings per share from continuing operations, which we expect to be $0.65 to $0.73, which is essentially flat to slightly ahead of the prior year, as EPS growth, including acquisitions, is expected to be mostly offset by continued softness within MTS, unfavorable foreign currency exchange and a higher tax rate. As discussed at our Investor Day, weâ\u0080\u0099re well positioned to create value through our leading brands, serving large and growing end markets through our focus on highly profitable aftermarket growth and continuing to expand our capabilities through strategic M&A., by utilizing the Hillenbrand Operating Model to drive sustained operational improvements, productivity and synergies and by deploying capital towards high-return opportunities that we believe will maximize shareholder value."
}