{
    "symbol": "AIRS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 13:32:14",
    "content": " As a reminder, today's call is being recorded, and we have allocated one hour for prepared remarks and Q&A. At this time, I'd like to turn the conference over to Dennis Dean, Chief Financial Officer at AirSculpt Technologies. Good morning, everyone, and thanks for joining us to discuss AirSculpt Technologies results for the first quarter. Joining me on the call today is our Founder and Chief Executive Officer, Dr. Aaron Rollins, and our Chief Operating Officer, Ron Zelhof. Before we begin, I would like to remind you that this conference call may include forward-looking statements. These statements may include our future expectations regarding financial results and guidance, market opportunities, and our growth. Risk and uncertainties that may impact these statements and could cause actual future results to differ materially from currently projected results are described in this morning's press release, and the reports we will file with the SEC, all of which can be found on our website at investors.elitebodysculpture.com. During our call today, we will also reference certain non-GAAP financial measures. We use non-GAAP measures in some of our financial discussions, as we believe they more accurately represent the true operational performance and underlying results of our business. A reconciliation of these measures can be found in our earnings release, as filed this morning, and in our most recently quarterly report when filed which will also be available on our website. I'm happy to say once again, the second quarter saw us reach the highest quarterly volume and revenue ever achieved in our history. For the quarter, we generated $49.7 million of revenue, reflecting a growth of 42% over the prior-year quarter. During the quarter, we reached an exciting milestone, performing over 30,000 AirSculpt cases since our founding a decade ago. Previously, we announced the health research study we are undertaking on the effects our procedures have on a patient's metabolic parameters. Once we receive final approval from the IRB, we will begin enrolling patients which we expect to occur later this year. And we expect our first international site in Toronto to open later this year, once we receive final government approvals. As we have said on previous calls, we believe there's great opportunity to further expand our network of centers internationally, while still maintaining our growth domestically. Before I turn the call over to Ron, I want to also comment on the special dividend we are announcing this morning. As previously reported, our center in Las Vegas opened in March of this year, and we opened our newest location in Boston during the month of July. We have now opened four centers in the past seven months, which demonstrates our ability to execute on our de novo strategy at a rapid pace, and each center is performing well. We have also secured space in Austin, Texas, and Irvine, California, which will likely be our next domestic sites. We have a desire to grow at even a faster pace, but our top priority is to maintain exceptional quality and safety for our patients. As Dr. Rollins mentioned, we continue making investments in our support teams, so that we can accelerate our growth plans. Finally, I am pleased to announce that we have now completed our procedure room expansion projects on existing centers. With that, I'll turn it back over to Dennis to provide additional details on our financial results. First, I want to comment on the confidence we have in the strength of our business and our ability to sustain long-term growth. We continue to focus on making investments that are essential to our growth initiatives, while also delivering exceptional return on capital. During the quarter, our revenue increased $14.7 million to $49.7 million, a 42% increase from the prior-year quarter, and our cases increased 22.5% to 3,691. The increase is primarily a result of adding four de novo centers over the prior-year quarter, which expanded our footprint to 19 centers as of June 30, 2022. Our revenue per case was 13,453, a 16% increase from the prior-year quarter. We continue to be pleased with our average revenue per case increases, which are due to patients continuing to have more areas treated at once. Our same center revenue increased approximately 20% over the prior period, comprised of a volume increase of approximately 5% and revenue per case increase of 15%. As we mentioned on previous calls, we have been making clinical staffing additions to proactively prepare for accelerating our growth plans. And as expected, we began to leverage some of those investments during the second quarter, as our nursing costs as a percentage of revenue declined 100 basis points compared to the first quarter of 2022. As Ron mentioned in his remarks, we have opened four de novos in the past seven months, which negatively impact our margins in the quarter by approximately 80 basis points. This is an improvement from the 130 basis point impact reported in the first quarter, and we anticipate margins will continue to improve as the de novos ramp up in case volume. Our total customer acquisition cost for the quarter was approximately $2,000 per customer, and as expected was down sequentially from $2,200 per customer in the first quarter of 2022. Normalizing the prior year to include these public company costs, our adjusted EBITDA growth rate would have been approximately 24% and adjusted EBITDA margin for the second quarter was 30.7%, which represents a sequential increase of 590 basis points from the first quarter of 2022. Our long term debt was approximately $83 million, and our leverage ratio at the end of the quarter as calculated under our credit agreement was 1.6 times. Cash flow from operations for their quarter amounted to $10.4 million, which reflects approximately 68% adjusted EBITDA to cash conversion. As a reminder, we carry no accounts receivable as we receive 100% payment upfront. And our cost structure is highly variable, as our surgeons receive payment only after a surgery is performed. We invested $1.9 million during the quarter, primarily related to opening our center in Boston, and our upcoming opening in Philadelphia, as well as our procedure room expansion projects. We are reiterating our revenue guidance range of $175 million to $179 million for the full year, which represents a 31% to 34% increase over 2021 levels. In addition, we are maintaining our adjusted EBITDA outlook of $58 million to $60 million. Finally, as we announced in this morning's release, our board has approved a special dividend of $0.41 per share to be paid to shareholders of record as of August 26, 2022, with a payment date of September 14, 2022. Due to our ability to deliver excellent free cash flow and the modest cost of opening new centers, this special dividend will not compromise our ability to deliver significant growth in the future, while allowing us to provide cash return to our shareholders by using excess cash from operations without increasing our gross leverage. With that, I'll turn the call over to the operator for a few questions. I think, last quarter, you had suggested revenues would be kind of in that mid 40s range for the second quarter, always a seasonally strong quarter. But, obviously, a lot of upside in the quarter. And then, as I think about guidance, it doesn't look like you're assuming much of that flows through the second half. And as we've talked about, our rate can bounce around from quarter to quarter based on the areas our patients get treated and things of that nature. It may be something we look at in the future, depending on where things shake out, but we felt like the dividend was something to demonstrate our confidence in the business, our ability to generate a significant amount of free cash flow. And, again, we're very excited we can do it without putting any additional debt on the balance sheet. I know there's been a lot of talk, given the inflationary impact on consumers and how that may impact demand. Korinne, again, without giving quarterly type guidance, reiterating our revenue numbers for the outlook is something we're very confident in. I'd like to add that we get patients from multiple income brackets, but our marketing strategy is geared toward the upper middle class and above, and they tend to be more resilient to challenging economic conditions. On your first question, as I said in the remarks earlier, we look forward to and we want to go ahead and increase our openings. As we mentioned, we've done basically eight this year, with the four, as well as expanding our procedure rooms from one to multiple rooms this year as well. In terms of Toronto, there's no risk. On a G&A perspective, John, I think that's where we should we should sort of shake out the remainder of the year. Obviously, our marketing costs which you may or may not be including that in there, if you're thinking about the total numbers. But for the most part, our G&A, we feel like we've gotten the majority of our support teams in place and expect to begin to leverage that even further as we move through this year, as well as into next for sure. We've talked about this on a number of quarters now that that revenue per case number can bounce quite a bit, depending on the patients that come in, what procedures they have performed, what areas and things of that nature. If the number would have dropped down sub $13,000, it wouldn't necessarily shock us right now because, again, we're pretty still small volume business. Just lastly for me, I'll get back in queue, obviously, the market went crazy with recession concerns, just remind us how far out your visibility is on your bookings. In our procedure, one of the things that we really have focused on over the last eight to nine months, is really getting patients scheduled quicker. One of the things that gave us backlog historically was that a significant number of our centers were single procedure room centers, those legacy facilities that Dr. Rollins started with. But now that every one of those have been expanded, it allows us to get patients treated really quickly, so we never expect now a significant backlog because, as a center kind of gets to the point of a utilization that we think we need to begin to expand again, we'll do that as well. When I look at the rate per case on the non-same store centers, it's running pretty high, north of $14,000. I just presume it's higher demand for the fat transfers, which presumably is good as we kind of think out over the next year as those roll into the same store count. From a rate perspective, there's nothing that we would necessarily want to call out, or that really surprised us one way or the other on the same store group or the new the new center group. Again, those numbers can bounce, again, from quarter to quarter on a per case rate basis, but what I would say is, obviously, we're very pleased with where we are from a rate and we feel good about it. Yeah, I think it just kind of reiterates our confidence in all the markets that we go into. Whether they be larger markets or mid markets, they're all performing well. And maybe just finally, the follow up on that, you have accelerated some of those investments in the infrastructures as you sort of referenced in the last six months. And because we are hiring so many doctors, both for existing centers that have expanded and for new centers, our needs for training are being met. And we're able to train these doctors very well and thoroughly, and get them going faster, more efficiently, and honestly, at clinical quality than we could before. I'd also like to add that in terms of our expansion of our legacy one room centers, we'd mentioned that it would be done by the end of the year, and we've already completed our expansion projects. Right now, just to give you the estimate, our full capacity is at 85%, Simeon. I don't think we have the comparisons, I think, to last year. And two, that means in the revenue per case component, we shouldn't assume much higher than what we hit this quarter going forward. Simeon, last year, second quarter, we were at $11,600 per case. Again, this quarter, we were at $13,400. We've talked a number of times how we really, over the last year, have gotten a lot of benefit we believe from AirSculpt TV and really educating the consumer to get more areas done at once. And so, that's uplifted our rates. And again, I kind of use that range of upper 12s to mid-13s as a range to kind of look for. And so, sometimes when your rate may go up, your volume may tick down just a little bit because you're spending more time with a patient in a procedure room and vice versa. As you know, we hired a chief marketing officer/branding officer in July, and we're really excited about her. Right now, we have a strong return on our customer acquisition costs, with gross margin per case in excess of $8,000 per patient. So, I do think that customer acquisition costs, at least for the time being, while we gear up, what I like to say, other legs of the marketing table, will fluctuate. The more people that we're competing against, the more the costs and vice versa. And it's just to allow patients to bank their stem cells, if they wish. It's something that's being rolled out slowly, and we really haven't made a verdict on whether or not we'll roll it out completely. On the metabolic study, we're proceeding according to the timing we set. We expect to enroll patients later this year, likely in the fall, with results expected in 2023. Ladies and gentlemen, this does conclude today's teleconference."
}