{
    "symbol": "AMRS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 12:32:11",
    "content": " Gross margins for the quarter continued in line with our expectations for the first half -- in the second half of the year, we expect gross margin expansion underpinned by Barra Bonita production, the transition of approximately 70% of our consumer production from third-party contract manufacturers into our own production and a reduction in packaging costs and also much reducing China source components, which have resulted in significant air freight charges during the first half. This included $55 million in CapEx for Barra Bonita, $25 million in cash for two consumer manufacturing plants and supply chain infrastructure, $45 million in working capital to build six months of extra inventory to avoid supply chain related out-of-stock issues for our retailers, and $15 million in expense to build and launch three new brands in the third and fourth quarter of this year. Based on our current performance and quarterly growth rate, we expect to deliver core revenue of around $250 million in the fourth quarter of 2023 or think of it as $1 billion in annualized revenue run rate by the fourth quarter of 2023. Our strategy with our consumer portfolio is simple, create brands that can achieve $1 billion market valuation in categories like skin care, hair care, color cosmetics and menopause where we can deliver the best performing products in the category at an accessible price and select partners that have access to a unique community so that we can grow awareness and revenue most efficiently. Core revenue, which includes consumer and technology access revenue and excludes strategic transactions and other one-off items, increased 54% to $65.2 million when compared to Q2 of 2021. Core revenue included record consumer revenue of $43 million, which increased 108% and technology access revenue of $22.2 million, which increased 3% versus prior year. Increased gross margin in the second quarter of this year reflects a year-over-year increase in technology license revenue, which was partially offset by lower average consumer gross margin due to brand portfolio and channel mix. So first, just a follow-up on Steve's question about the consumer guide, so you're reiterating the consumer revenue growth of greater than 150% for the year. I believe you stated during that May conference circuit that you guys were going to be north of $250 million of consumer revenue this year, which really implies more like 170% growth. Technology Access was -- and because R&D revenue or collaboration revenue and the license revenue is 100% kind of margin accretive, you can get a little bit of flux from quarter-to-quarter, more so than certainly we see with the consumer portfolio."
}