{
    "symbol": "AMRS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 15:01:06",
    "content": " Our core revenue increased 75% year-over-year, supported by a record $35 million of revenue from our consumer brands, delivering 121% growth versus the prior year quarter. Our new brands, brands that will operate this year for the first time, including MenoLabs, JVN Hair, Rose Inc. and EcoFab cosmetics, are expected to generate over $100 million of revenue. In addition to the incredible performance of new brands, significant expansion through retail partners and significant opportunities in international markets, we have also landed a significant strategic opportunity, where we are developing an across category brand of sustainable beauty and wellness products for Walmart. Our consumer portfolio is now set to deliver well over 150% growth this year, while our ingredient portfolio is also delivering better than expected growth that we will be in a position to recognize starting this quarter as we start shipping products from Barra Bonita. Based on current consumer revenue performance along with the Q3 launch of new brands and new in-house ingredients capacity from Barra Bonita taking full effect in the second half of the year, we are reiterating our full-year 2022 financial outlook and expect to be on the higher end of the status rates. We have been investing substantially in the future of our core business through capital expenditures and plant and production capacity, as well as operationally through brands, startups and leveraging the opportunity to educate and acquire consumers through sales and marketing growth. And, again, if you look at how our year ramps, I mean, we expect the fourth quarter to be well over 100 million in consumer revenue and we expect that our production assets for the products that it makes sense, because there are some products, some unique products that we are not investing the capital equipment to produce ourselves. So a combination of our current new brands to market like JVN, Rose Inc., MenoLabs and then the new brands we are launching, plus the fourth quarter seasonality really drive for significant build in inventory to ensure that we could meet market demand. Whenever those three components are present, I think we could get well over 100 million per molecule, and then if you think about the revenue going forward from these molecules, both of these molecules are in very high growth markets that we expect to continue growing at 30% to 40% going forward, so it is not a one and done. So significant expansion of margin on ingredients, significant expansion of margin on consumer, and then a significant reduction in cost which - fourth quarter based on volume, that is probably a $15 million to $20 million impact in cost reduction in the fourth quarter just by actually having a better cost of goods and a more efficient supply chain to reduce our shipping costs."
}