{
    "symbol": "AMRS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 19:08:08",
    "content": " Looking ahead, we expect gross margin expansion in the fourth quarter, resulting from increased production at Barra Bonita, the transition to consumer production from third-party contract manufacturers into our own production facility in Brazil, a reduction in packaging costs and reduced dependency on China-sourced components, which to date have resulted in significant air freight charges. First, discuss our Q3 financial results, as it relates to revenue, gross margin, operating expense and cash, secondly, provide an update on the Fit To Win revenue, cost and cash actions, we are undertaking to much improve our financial performance, and third, provide an update regarding our outlook for the fourth quarter and full year. Core revenue, which includes consumer and technology access revenue and excludes strategic transactions and other, increased 49% to $71.1 million, when compared to the same quarter last year. To support brand development and top line growth, we have significant investments, which have resulted in cash operating expense that have grown to $137.8 million, an increase of $56.4 million versus the same quarter last year. The Q3 quarter end cash balance of $25 million, combined with $100 million term loan that we just recently closed in the fourth quarter and Fit To Win actions are expected to support our needs until we complete the strategic transaction that John has already referenced. Key success factors in our revenue plan for the fourth quarter include China, 11/11 Singles Day, where we expect to see strong results with Biossance in particular, holiday shopping season for all of our consumer brands at the end of this year. We expect to deliver our first quarter of over $100 million of core revenue and expect our current growth rate to continue into 2023, while also setting a clear goal of achieving operating profitability. And I can tell you so far in the fourth quarter, we're seeing consistent growth with what we've seen in the third quarter and, obviously, year-on-year because of holiday playing in and additional doors in some of the geographies we played into, we're seeing very strong performance. All I can tell you is you're going to start seeing pretty big step changes in our cost of goods, really across both ingredients and consumer and Eduardo can describe exactly the actions he and his team took in the third quarter and how they flow into fourth quarter and then full year 2023. And because of the strength of our brands, we think we can do that and still maintain this north of 100% consumer growth, which is what we've been delivering all year."
}