{
    "symbol": "AMRS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 00:23:04",
    "content": " We are further focusing our consumer brand portfolio and expect to end with 5 to 6 brands that our market leaders represent over 90% of our current revenue and growth, use a lot of our ingredients and their formulations and have a clear path to profitability. This includes $200 million of upfront cash, $150 million of earn-out to be paid over 3 years and an expected over $150 million in gross margin dollars from the production of the products during the first 10 years of our long-term production agreement. In addition to fully funding our much needed next production facility, this opportunity can also help generate $50 million to $100 million in new cash to our balance sheet in the short-term and free up $50 million of current working capital that is used to support our ingredients business. Core revenue, which includes consumer and technology access and excludes strategic transactions, increased 17% to $75.8 million when compared to the fourth quarter of last year. Ingredionâ\u0080\u0099s product revenue decreased 12% to $14 million, reflecting temporary supply constraint as the business transitioned from higher cost total manufacturing to lower cost internal sourcing from our new fermentation plant in Brazil. We experienced significantly higher spending in the first three quarters of 2022 as compared to the prior year, particularly due to increased inbound airfreights and volume to support our growing consumer brand revenue as well as the importation of ingredients intermediate products. To support brand development and top line growth, we have significant investments resulting in cash operating expenses that have grown to $148.3 million in the fourth quarter of 2022, an increase of $44.9 million versus the prior year quarter. The year-end total cash balance of $71 million, combined with our Fit-to-Win actions, along with the $200 million of upfront cash we expect to receive from the Givaudan deal, along with the monetization of non-core assets and potential funding our core investors â\u0080\u0093 investments from strategic partners are expected to provide us with the funding required to get to self-sufficiency."
}