{
    "symbol": "IPWR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 21:16:03",
    "content": " Our team engaged with potential customers from e-mobility, energy storage, industrial motor drive, and solid-state circuit breaker applications, as well as potential collaborators in the power device, module packaging, driver, intelligent power module and semiconductor manufacturing spaces. Our project with DTI for NAVSEA is intended to develop and demonstrate a B-TRAN enabled high efficiency 12 kilovolt medium voltage direct current solid-state circuit breaker for the U.S. Navy with the subsequent objective of introducing a family of medium voltage DC circuit breaker products incorporating B-TRAN for sale to military, industrial and utility markets. This project is our second collaboration with DTI and the SBIR grant will potentially fund the development of a B-TRAN-based low loss, 13.8 kilovolt alternating current solid state breaker intended to be used in medium voltage power distribution in renewable energy and microgrid applications connected to the utility power grid. Saving customers from having to design themselves will be ready to design custom modules for potential customers, such as those looking to apply B-TRAN in electric vehicles and solid-state circuit breaker use cases where multiple B-TRAN die may be needed to be combined into a single package, either in series or in parallel to accommodate higher voltages and currents. And under the DOE SBIR grant, if in collaboration with DTI, we're awarded a Phase 2 grant, the completion of the build-out and testing of a 50 megawatt 13.8 KV alternating current solid-state circuit breaker incorporating B-TRAN's. Third-party testing of the B-TRAN adding more engineering and front end talent supporting our test and evaluation program, designing and introducing our initial commercial product and other B-TRAN commercialization activities with potential new customers and partners. It'll either be a module that includes the driver – a simplified version of the driver that we have or it may be a multi-die module also because we're finding that there's increased interest in that where it could be used for things like the solid-state circuit breaker application, where they want to put multiple dies together to achieve either higher current rating or higher voltage rating."
}