{
    "symbol": "IPWR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 20:04:07",
    "content": " In fact, B-TRAN is receiving increased attention in inbound inquiries from an array of commercial, research and government entities as a disruptive, highly efficient, bidirectional semiconductor technology that solves immediate needs in our targeted electric vehicle, electric vehicle charging, renewable energy, energy storage and interruptible power supplies for data centers and solid-state circuit breaker end markets. These two companies, in addition to other previously announced program participants interested in B-TRAN for solid-state circuit breaker applications and the number of government programs focused on circuit breaker research demonstrate the widespread interest in the development of innovative technologies that can solve the problems inherent in both traditional mechanical circuit breakers and solid-state circuit breakers, utilizing conventional semiconductors. Given the strong demand and current high pricing for electric vehicles, the expected explosion in demand for power semiconductors with the increasing electrification of everything from automobiles to distributed generation and the intended need for increased national security in today's geopolitical deployment, the legislation represents a seismic positive change and an opportunity for significant investment for our domestic developmental fabrication and packaging partners. Our development and commercialization plans for the balance of 2022 include additional larger wafer fabrication runs, including the qualifying run with a high-volume production wafer fabricator, continued development and fabrication of B-TRAN drivers, third-party testing of the B-TRAN, adding more engineering and product management talent, supporting our test and evaluation program, designing, fabricating and introducing our initial commercial product, starting the design of our second commercial product and intelligent power module, and other B-TRAN commercialization activities with potential new customers and partners. And then with projects like the NAVSEA project and other things that we're doing, the word of those projects is getting out, but it's not lab scale stuff, it's being done at really large-scale demonstrations and that is really getting people interested in the technology understanding how it can impact things like Solid State circuit breakers and companies that want to go leverage that work to do things that fit their own product offerings. So we think there's going to be some pretty broad opportunities across the board, whether it's clean energy or whether it's technology development under the CHIPS Act or things that are coming to support the infrastructure for electric vehicles that will all create opportunities for us to either do things be get government funding either independently or more likely in collaboration with industry partners that will result in product pool into those market segments. So I think the interest there really is the long-term opportunity that it creates as part of a military application, but also the fact that what we're doing there applies directly to the electric utility industry for the distribution and transmission networks and for industrial applications because we're -- both us and DTI are not limited in any way to take that product and introduce it to the industrial segments of the marketplace because the Navy wants to see volume to help drive cost down."
}