{
    "symbol": "CTHR",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-06 06:41:02",
    "content": " We delivered $7.4 million in revenue in Q1 while down 28% and to the year-ago quarter, in part due to logistics and supply chain issues caused by Hurricane Ian, which had an adverse effect on our quarterly results. With that being said, and with online channels comprising 66% of our revenue in Q1, up from 52% in the year-ago quarter our strategic focus is to continue to drive and elevate our direct-to-consumer presence and brand strategy, which we believe will better position us for long-term growth and help bolster against the current macroeconomic uncertainty and geopolitical unrest as we strive to reduce our dependencies on others. Although lab-grown diamond prices have experienced some downward pressure and increased competition, our Caydia, lab-grown diamond revenues on charlesandcolvard.com continued to decline, and an increase of 85% to the year-ago quarter as we expanded our collections and assortments to better meet consumers' demands and increased our efforts to become more vertical. Net sales for our online channels segment, which includes charlesandcolvard.com, moissaniteoutlet.com, marketplaces, drop ship retail and other pure-play outlets totaled $4.9 million for the quarter or a decrease of 10%, now representing 66% of total net sales. Net sales for our traditional segment, which consists of wholesale and brick and mortar customers totaled $2.5 million for the quarter or a decrease of 49% representing 34% of total net sales. As an update to our $5 million stock repurchase program we announced in the prior fiscal year as of September 30, 2022, an aggregate of approximately 388,000 shares of the company's common stock have been repurchased under the program that are held in tertiary stock for an aggregate purchase price of approximately $489,000 at an average purchase price per share of $1.26. Our liquidity and capital position remained strong as we ended the quarter with $16.6 million of total cash compared to $21.2 million at our last fiscal year ended June 30, 2022. I mean, obviously, no one has a crystal ball but it looks like inventory at $24.5 million is up literally 25% over the same quarter a year ago when it was 19.6% if I've done the math right. So also with that being said, we've made two product category launches, one being obviously, the Lab ground diamonds which is a large moving category for us and you see the percentages keep climbing as a percentage of sales on our direct-to-consumer business model as well as that the need to build up inventory and make investments in inventory to support that business."
}