{
    "symbol": "CHD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 16:32:03",
    "content": "  Operator: Good morning, ladies and gentlemen and welcome to the Church & Dwight Second Quarter 2022 Earnings Conference Call. Before we begin, I have been asked to remind you that this call -- that on this call the companyâ\u0080\u0099s management may make forward-looking statements regarding, among other things, the companyâ\u0080\u0099s financial objectives and forecasts. I would now like to introduce your host for todayâ\u0080\u0099s call, Mr. Matt Farrell, Chief Financial  Officer of Church & Dwight. So I got promoted as CEO about seven years ago, but anyway. And when Rick's done, we'll open the call for questions. Now this was $0.06 higher than our outlook, but that was due to lower marketing. We grew consumption in 11 of our 17 categories in which we compete and in some cases, on top of big consumption gains last year. Fill rates have improved to 90% in June, and we expect to get back to historical levels by the end of the year. Regarding brand performance, we experienced double digit consumption growth in six of our 17 categories. In Q2, online sales, as a percentage of total sales, was 16%. Our online sales increased to 15% year-over-year, and we continue to expect online sales for the full year to be up -- be above 15% as a percentage of sales. Since early 2021, we have announced price increases to combat inflation. And through mid-2022, we have already announced price increases covering 80% of our global portfolio. So since we spoke to you in April, we are now expecting $50 million of new incremental costs inflation. Now, the incremental $50 million of inflation, combined with currency headwinds caused us to lower our full year EPS outlook. Looking at market shares, as I said before, we had good numbers, as eight of our 14 power brands gained share. Looking ahead, we expect even further improvement in our market share positions by year end, as our fill rates will improve and promotional and marketing spend increases in the back half. For example, during Q2, the liquid laundry category grew 7%, but value laundry detergent grew 11%, while premium laundry grew 4%. In Litter, the category grew 12%, both our black box, which is premium and our yellow box, which is value had double digit consumption growth in Q2. The dry shampoo category, was up 18% in Q2, while Batiste consumption was up 43%. Over in Gummy Vitamins, the sequential quarterly growth of the category is slowing down. For the last three quarters, the category growth rate has been 16%, 10% and most recently, 5%. Our most recent acquisitions are performing well, TheraBreath which we acquired in December 2021 had a great quarter with 33% consumption growth. Now looking ahead to the rest of the year, the regular flu season in the US is projected to be more severe than recent years based on what the southern hemisphere is experiencing right now. Despite significant disruptions, our international business delivered organic growth of 6.5% in Q2, primarily driven by Batiste in Europe, Vitamins and Batiste in Canada and growth across the GMG business which is our export business. In April, when we spoke to you, we expected flattish growth in Q2 and a continuation of the supply chain lows we experienced in Q1, such as fill level issues and delivery issues. However, fill levels and delivery issues will continue to weigh on our Global Markets Group in the near term. Our Specialty Products business delivered a strong quarter with 6.3% organic growth, driven by both higher price and volume. Similarly, there is a lower demand for WATERPIK showerheads and this is due to less yourself projects, a lot of those got completed during COVID times. WATERPIK is a discretionary purchase, and we continue to invest in demand-driving activities such as launch and learn to drive household penetration of flosses. Now this is a business that has averaged high single-digit growth top line, since we acquired them in 2017. We're experiencing lower consumption, but that is largely due to the absence of our new products in this fast-moving beauty category. China lockdowns have impacted our manufacturing, and the new product launches that were planned for the first half have been delayed until the end of '22. Now, I want to spend a few minutes on the health of the consumer, private label trends, innovation and our ability to supply. I think back to April during our Q1 call, we called out the strengthening value detergent segment. In the latest four weeks ended July 17, value liquid laundry detergent category is up 8%, deep value is up 1%, and premium is down 1%. Here's another an early indicator of trade down, this time in oral care. We had one major retailer point to the strength of manual toothbrush, which has held up well for them in contrast to declines in rechargeable and power toothbrushes. This trend impacts both WATERPIK and SPINBRUSH, and here are a few numbers to illustrate the trend. And battery-operated toothbrushes, the category was down 4% also in Q2. It's important to point out that 40% of our portfolio is value, and we expect to perform well in a difficult economic environment. Our largest businesses, detergent and vitamins, are value products. As you saw in the release, we have a strong lineup of innovation across our personal care and household categories. I want to highlight the early success of ARM & HAMMER Baby Laundry Detergent, which has already achieved a 10% share of the baby laundry category at Walmart. The other product I'd like to highlight is TROJAN RAW, which is the thinnest condom now in the market, which is already the number six out of 400 SKUs sold at Amazon. We expect, over time, this will enable us to get our fair share of the lightweight litter category. Now regarding ability to supply, you may recall, we hit bottom in Q1 with the Omicron resurgence when we saw our fill rates dip below 80%. The overall Q2 fill rates improved to 89%, although recovery in our high-margin personal care side of the business is still lagging. We're on track to be near historical fill levels by the end of the year, and the good news is July continues to show improvement. We have confidence in our revised full year outlook for several reasons, improving fill rates, trade down to value, healthy new product innovation and consumption strength in our recent acquisitions. Regarding support, we have key promotional events lined up in the second half, and two-thirds of our full year advertising spend is concentrated in the second half. In closing, we expect our portfolio of brands to do well, both in good and bad times, and we continue to hunt for new TSR-accretive acquisitions. Second quarter adjusted EPS was $0.76, flat to prior year. Reported revenue was up 4.2%, reflecting a 1% drag from currency. Organic sales were up 3.4%, in line with our outlook. Our second quarter gross margin was 41.2%, a 220 basis point decrease from a year ago. Gross margin was impacted by 600 basis points of higher manufacturing costs primarily related to commodity inflation, distribution and labor as well as a 10 basis point drag from currency. These costs were offset by a positive 270 basis point impact from price volume mix, positive 20 basis points from acquisitions and a positive 100 basis points from productivity. Marketing expense as a percentage of net sales was 7.8%, and we expect two-thirds of advertising to be concentrated in the second half as case fill improves. For SG&A, Q2 adjusted SG&A decreased 10 basis points year-over-year. Other expense all-in was $15.1 million, a $3.7 million increase resulting from higher average debt outstanding. And for income tax, our effective rate for the quarter was 24.1% compared to 24% a year ago. For the first six months of 2022, cash from operating activities decreased 10% to $310 million due to lower cash earnings and higher working capital driven by higher inventory levels. Looking ahead to Q3, we expect reported sales growth of approximately 2% to 4%, organic sales growth of approximately 1% to 3% and gross margin contraction. Sequentially, we are decelerating from Q2 and as our VMS business comps to COVID surge a year ago, and we see a tightening in the consumer for our discretionary products such as WATERPIK and FLAWLESS. Those two reasons, coupled with the inventory issues we've all heard from retailers compressed Q3 growth. Adjusted EPS is expected to be $0.55 per share, a 19% decrease from last year's adjusted Q3 EPS. This is largely due to higher SG&A, which is normalized levels of incentive comp versus a year ago, plus higher marketing and promotional support. We now expect the full year outlook for reported sales growth to be approximately 4% to 6%, reflecting an incremental drag from currency of 1%. As you read in the release, we now expect an incremental $135 million of cost inflation for the year, which is $50 million higher than our April outlook. On a longer time horizon, we continue to plan on offsetting inflation with incremental pricing, laundry compaction, and productivity. We expect cash from operations for the full year to be approximately $900 million, down from $920 million, and our full year CapEx plan is now approximately $180 million as we continue to expand manufacturing capacity. Our share performance improved again in Q2, and we expect further market share gains in the second half, as we invest in our brands and supply chain fill levels improve. As far as the categories go, let's start with discretionary. But -- if you think about our portfolio, 90% of our portfolios are just our everyday essentials, only 10% that's related to discretionary products. So, we -- although we spend a lot of time talking about the discretionary products and because they do have it have had an impact on full year call, it's not the whole story. You have, I mentioned that we had growth in 11 out of our 17 categories that we're in, and we do expect that to continue in the second half. There are a few categories I call that besides of WATERPIK and FLAWLESS like Spin brush for example, rapid was down a little bit. As far as others -- and another one that was soft in the quarter depilatories and also oral gel, but everywhere else you know those categories you saw you saw growth. So, from EPS perspective, we've announced a second round of pricing as an example for laundry and litter that'll be a tailwind. Our personal care, fill levels returning from low 60s back to normal will be a tailwind. Promotional support because we didn't have the fill levels in the first half of the year to do promotions, like we normally would do in the back half. We also mentioned, Q3 is down big, but Q4 is up big and Q4 is also lapping some of those investments in one timer's that weâ\u0080\u0099ve talked about previously. On Productivity, we talked last quarter, I think Lauren asked the question about productivity phasing and that's so true because early on in this year and even late last year, it's hard to break in to get line time to go do qualification to do any productivity type efforts. And so we said it last quarter, it's still true. And as we have back at the right capacity and fill levels, then we'll have more and more time to devote to productivity at our plants. So, I guess I just want to go back to the gummy vitamin category. So, you guys talked about slowing category growth. And then secondarily, you mentioned that your fill rate is still being challenged. We expect the fill rates to be back where it should be, which is in the mid to high 90s by the end of the year, Rupesh. So, that's the one we're focused on the most right now. Just to give you an example on that, Rupesh, right, we were in the low 60s on fill rate for Personal Care within the portfolio. In Q2, we had 74% in the month of July. And as far as the vitamins go, if you keep in mind, you've grown off really gigantic base in the last couple of years with growth in 2020 and 2021. It's because of the comps year-over-year, but last year Q3 was just a huge spike for -- in the quarter because of the Delta variant, Q3 of last year. So, consequently, that's a really tough comp and so consequentiality we expect it to go negative year-over-year. As an example, Rupesh, Q3 last year, the category grew 33%. The rest of the quarters grew 19% Q1, Q2 and Q4. So, it's just -- it's more of a comp issue than--. On the cost side, we do think there will be inflation next year. So, we're -- usually, we would be, I don't know, 50% hedged from a commodity perspective for next year by now. Just -- maybe we could talk a bit more about the phasing for the year, Q3 versus Q4. And perhaps within that, you can comment on whether there are specific volume headwinds you expect to improve in Q4 versus Q3. So for example, the fill level improvement, we're leaving money on the table in several categories. So we do think that once that gets fixed, particularly on the personal care side that we're going to benefit from that. We do think as the economy, the recession or what some people call a recession deepens that the trade down will continue and accelerate. So I mean, you're calling out the right levers with respect to the second half. So our guide for Q3 organically is 1 to 3, which implies a 5% plus number in Q4. And so as Matt said, personal care fill levels are fully back. So all those reasons we think organically, we're doing better. But we also have some higher inflation expectations in Q3, higher SG&A as we had some one-time catch-up year ago for incentive comp was a lot lower a year ago. So we believe both organically and from an EPS perspective, we have an inflection going from Q3 to Q4. Then a quick follow-up would just be in Q2, price/mix was below our expectations, perhaps a bit below your expectations going into the quarter. So really, what I'm trying to get a sense of is the Q2 price/mix key drivers and just how that's really informing your back half expectations. It's pretty straightforward, Chris. That's going well, early days. But Q1 to Q2, we decelerated from a price volume -- price/mix perspective from 7.8 in Q1 to 6.2. One moment for our next question. First, I just want to follow-up on that and ask you to talk a little bit about your price/ mix expectations from here, given that you called out your two highest per unit categories as seeing the deceleration. And then just broadly, if you could just comment about what you're seeing in terms of elasticities of demand, private label, as private label starts coming back, how that's impacting your view on trade down. Yeah, I'll take the price/mix question. So first half, volume would be down 4%, and price/mix was up 7%. That's really a slowdown in the discretionary stuff like WATERPIK Showerheads, for example, or FLAWLESS and offset by the value trade down and whatnot. Price/mix, on the other hand, is pretty consistent, 7% in the first half, 7% in the second half. And that's what I said before to Chris was really lower mix on WATERPIK is a -- as the trade down happens, therefore, is a negative, but then the positive is higher price on laundry and litter. And your question about the private label, as I said in my opening remarks, there's five categories where we compete with private label. It's now 11.9%, but we haven't been interacting with private label in that category as opposed to some of our competitors. So that's why we feel confident that the private label is at least in the near-term, next six months, we don't expect that it's going to be a big issue for us. One moment for our next question. One on kind of the cost environment in your hedges, historically, I thought you did some hedging on diesel costs. We entered this year, and I'd say we're about 80% hedged. Most of the cost inflation that we're talking about is primarily raw material impact, and that's coming through incremental discussions with third-party manufacturers. Our outlook this time versus last time is minimal on commodities, I would say. We just called out the 1% drag on the top line, 1% drag on the bottom line. Transactionally, we hedge about 80% of our transactional exposures, whether that's the euro or the Canadian dollar. And I do remember, you got away from some of the contracts in private label, so I was just double checking if it happens this down trade, as you mentioned, in some categories like laundry, that helps you. Just with respect to private label, private label shares in vitamins are stable. So, we're not seeing growth in private label. The only one -- only of the five categories we compete in, it's only litter that had an uptick. We walked away from private label manufacturing for vitamins a couple of years ago, to get back into that. On gross margin mix, there's not much of a mix impact on vitamins, whether it grows or it decline from a revenue perspective. In Q2, we said it was a lot like Q1 and it did, down 220. Q3, we're going to improve from -- a little bit from Q2, but it's not going to be the same improvement that we had thought previously. And then in Q4, we think we're going to inflect positive. And it's the same reasons why we talked about last time, personal care fill levels, productivity builds, round to pricing. And then can you also maybe talk about what inventories look like at retail for -- particularly for WATERPIK and some of the discretionary items as -- discretionary items at retail, a series of other categories seem to be quite high. I think you saw in the release, we said we had to get back in line by year-end. And really, WATERPIK wasn't really because of consumption per se. And so yes, it takes a couple of quarters to work through that, especially as consumption comes in a little bit. And then at retail, I think in-stock levels are good, especially for our household business. Thing to kind of remind everybody is that WATERPIK, about half the flosser business is online. I know you mentioned many, many times private label share has been flat. But if we can maybe just talk about that consumer and the value part of your portfolio and just from a consumption perspective, not trading down or trading up. I know you're not seeing trading down, but maybe they're consuming less, buying less, clearing their pantries. Well, if you think about value detergent now, some of the numbers that I quoted just like in the last four-week period ended July 17 is that value laundry detergent is up 11%, and deep value is up 1%, and premium is a minus 1. So that's -- so we would say -- and by the way, there isn't a lot of private label in the laundry category, liquid laundry detergent. In litter, the category grew like 11%, 12% in the quarter. And it wasn't just our premium brand, our black box,  but our yellow box, which is the value grew double digit as well. But as I said earlier, it's ticked up 1% to 11.9%, but we haven't interacted as much with the private label as some of our peers. The other big category would be vitamins, where it's stable. And again, the private label shares are pretty stable right now. Hey, Steve, it's Rick. Now remember, if you take a big step back, the category has more than doubled over the last two years or three years. So again, we're really happy with the vitamin category. In terms of fill levels for vitamins, they get better every single day. We really have two issues on two SKUs, and that's really driving the issue right now. And it's ingredient-related, and we finally worked through alternates. In the next 30 days or so, we should be back on vitamin fill. And Steve, the other thing just to add to what Rick said, yes, we're super happy with the growth of the category over the last few year, but keep in mind that the other tailwind is the transition from pills and capsules to gummies. And you guys are value priced in the category, too. So then I wanted to pivot also 1.5 months ago, we talked a good deal about how your portfolio has evolved since 2009. And I appreciate it's only 10% of the portfolio now, but it's obviously having an impact. And what kind of drag this may be if the economy evolves the way that it seems like you're positioning for in 2023, number one. And number two, I'm wondering if it changes at all how you approach incremental M&A because a good deal of your M&A with FLAWLESS and WATERPIK has skewed to these discretionary categories of late. Our two most recent acquisitions were ZICAM in a couple of years ago in 2020, which got us into a cold shortening category, and then TheraBreath, which got us into mouthwash. Of course, it's discretionary. And yes, okay, we're going sideways right now, but keep in mind that the change in EPS is driven by cost and currency. We do think by the end of the year, we'll have our fill rates back in line. We'll be growing from a smaller base with respect to WATERPIK, but we do think that once the economy settles down again, that will rekindle the growth of WATERPIK. One moment for our next question. I think when you spoke at recent conferences and even last quarter, you discussed that you thought, should you need incremental pricing beyond the July, increases you mentioned they would come more likely in the form of package size adjustments. And then B, I think you'd also mentioned that those -- that, that approach would require some CapEx investment and some lead time to deal with tooling. And the CapEx guidance is a little -- it's small, but a little bit lower for this year. Hey Lauren, really from a pricing perspective, you're right. We said last quarter that primarily next year, we're focused on pack size versus pure price increases. On CapEx, it's immaterial to CapEx outlook on change parts for like a line, for a carton or for a new mold, for a bottle. So, it's a handful of million dollars or so, it's not that impactful. It's more about 6 to 12 months in order to design a mold, cut a mold, to do a -- change parts, order the change parts for a line to do a different size carton. One moment for our next question. Obviously, there's always some timing lag. I think right now, like we just said with Lauren, we're really focused on pack size changes and adjustments that way, which is effectively a price increase. And then if inflation continues to go and we continue to chase the ball downhill, we'll evaluate doing incremental pricing. In general, our comments wouldn't change from last quarter. But if there's any noise, it's usually because of fill levels, not because of price volume sensitivities. And then last, just in terms of price gaps, obviously, with a lot of substantial pricing and then more in July, are there any categories where price gaps have either expanded where you're premium or narrow where you value where you think they may have gotten out of whack with competitors. Well, what I would say there is through the end of June, we were pretty happy with elasticities. Remember, we have new price increases that are just hitting shelf in July. And as far as the promotional environment goes, there was a pullback in Q2. If you look at liquid laundry, for example, the sold-on deal was around 31%. So we pulled back because we were going through concentration, and others may be pulling back as a way to modulate price. And also in litter, litter's also a category that promotions are down again year-over-year. And then back to liquid laundry, about 31% sold-on deal. And as for our most recent price increases, we're going to kind of watch the third quarter and see how they react with our peers. And, Dara, I will say that, in general, we're happy with all of our price gaps. And even when we've led in a category, if you take a step back, then the category has also reacted. I think, I heard you in the prepared remarks that you expect -- it may be in the press release, I don't know. Well, laundry is the big one, where we expect that trade down. Remember, in Q1, what we said was that the previous several quarters that value detergent have been losing share to premium. And in the latest four weeks, value detergent is, like I said, is up significantly 11% versus the premium down 1%. So we do think that, that's going to accelerate. But I think everything is going to be in place by the fourth quarter, many price increases that others have been contemplating. And yeah, we do have a fair amount of support, both advertising and trade behind our detergent in the second half. So that's the reason, the context for why we think things are going to accelerate. And they did reference marginally promotional activity, paper bath, but not to get more price, but because they hit a capacity ceiling that's now been resolved. So I don't think that, that's as big a factor. Now yes, it's true that Tide Simply is still is around. And we'll have to see what happens with their pricing in the second half, the pricing and trade. Our reported now for the full year is 4% to 5%, organic 3% to 4%. Because 1% is currency, and the rest, the other 3% is cost. And we've got big support in place for the second half, and we'll talk again with you at the end of October. Thank you, ladies and gentlemen, for your participation in today's conference."
}