{
    "symbol": "HIBB",
    "quarter": 1,
    "year": 2023,
    "date": "2022-05-27 14:09:05",
    "content": " Comparable sales declined 18.9% versus the prior year, coming on top of an 87% increase in the first quarter of last year. As Mike referenced earlier, we are very pleased that our inventory levels ended Q1 at over $300 million, up $94 million from year end and therefore are well positioned to drive results as we move into the second quarter. This improved throughout the quarter and when compared to fiscal ‘20, inventory levels at the end of the quarter were up in the low 20s, in line with our order sales growth when compared to fiscal ‘20. Before I discuss the first quarter fiscal ‘23 results, I would like to remind everyone that stimulus funds in the first quarter of fiscal 2022 provided significant boost to sales and growth leverage in a number of expense categories. And looking back 3 years to fiscal 2020, the last relevant comparable period prior to pandemic, current quarter sales of $424.1 million were 23.5% higher than the $343.3 million reported in the first quarter of fiscal ‘20. Brick-and-mortar comp sales decreased 22% versus the same period in the prior year, but have increased by 13.6% versus first quarter of fiscal ‘20. Depreciation and amortization in the first quarter of fiscal ‘23 increased approximately $2.4 million in comparison to the same period last year, reflecting increased capital investment on organic growth opportunities and infrastructure projects. Turning to the balance sheet, we ended the quarter with $23.2 million in cash and cash equivalents, slightly higher than the $17.1 million balance at the beginning of the quarter, although well below the $270.9 million we had at the end of the first quarter of fiscal ‘22. Fiscal 2022 gross margins as a percent of sales are anticipated to be in the range of 36.6% to 36.9%, down from the results of fiscal ‘22, although above pre-pandemic levels, attending supply chain challenges, freight headwinds, a higher mix of e-commerce sales and carry for lower margin and brick-and-mortar sales, inflationary pressures and de-leverage on store occupancy will all contribute to this anticipated decline. Please proceed with your question. I think what we referenced, first and foremost, the trend that we referenced in the acceleration compared back to fiscal ‘20 as I mentioned, on inventory, we began the year in a pretty significant decrease compared to inventory levels from fiscal ‘20. Please proceed with your question. As we mentioned, we are very confident in the inventory position, especially related to the sales acceleration that we saw during the quarter compared to fiscal ‘20  effects. We’re very confident in the composition of the inventory and the vast majority of the inventory growth that we saw from the end of the year to the end of the first quarter is in high demanded footwear, so very confident in our ability to move through that inventory. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}