{
    "symbol": "NWG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 12:02:03",
    "content": " Retail banking deposits 187 -- 189 billion, 40% current accounts, 60% savings accounts, an average cost of five basis points for the first quarter. So on NatWest market I think what I talked about is we would expect to see a sort of stabilization of the performance of that business on the restructuring of NatWest markets that's largely complete, we've made all the decisions around products and capital and the businesses very much on the front foot now in terms of growing. On your interest rate and asset quality point, I think in terms of interest rate rises and at what point does it become a negative very, very significantly higher than any of the forecast on interest rates, and what we can see when we look through both leverage that's sitting with our customers and the level of liquidity, we have no concerns from a credit perspective caused by interest rates at these levels or forecast levels. So then the way I would think about it, guys to say, well, actually, if I have a view that the forward curve is the one that we're going to land in, it's more of those kind of two and a half pieces, then I think we've given you the guidance in the managed margin piece. Can I maybe just come back briefly on other operating income, because it was down Q-on-Q and -- but I think that seasonality which is may be something we kind of overlooked during COVID, just given some of the distortions and it was up 10% year-over-year. If you look for example, around the amount -- and if I think about in our small business, Banking side, our small business customers, 50% of customers are on fixed rates. In terms of the, kind of the excess savings point, they are held by the wealthy, but they're also held across our retail franchise and also by small businesses in terms of that piece, which is there, that's where you've seen that kind of -- our slight kind of increase. So if I think about your NII run rate, it's about 8.2 billion for the quarter, and the average change in rates that we saw that generated something like a 730 million benefit based on the deposit margin improvements you show us in the slides. So the way that I would kind of think about -- when we’re looking at NIM for the whole year, we're definitely -- we're expecting it to continue to increase, and if I look at the kind of the rate rises, we've talked about how they've got two more kind of baked in."
}