{
    "symbol": "NWG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 18:47:02",
    "content": " We are on track to deliver our 2022 targets on cost and capital and have increased our income guidance for this year to around Â£12.8 billion, based on the current Bank of England interest rate of 2.25%. For example, by extending our asset management expertise to customers in retail as well as private banking, we have increased our affluent investment customer base and attracted new net inflows, which amount to Â£1.7 billion for the first nine months of 2022, of which 17% was via digital channels. So can I just check we're not talking about low single-digit positive operating jaws and something more significant, otherwise anticipated -- given anticipated revenue growth, we're talking about north of 5% cost growth for nearly six months ago, the guidance was 3% takeout, and that level of revision looks largely even set against the inflationary backdrop. Because I mean, looking at the -- at least consensus at this stage around 13.9 total revenues around 11 NII, it seems like a lot of the step-up from 2022 to 2023 is driven by the hedge rollover, which I think is around Â£100 million a year for 25 bps just in we had around eight-point-something hike so far. And then the second question I had was just on -- sorry to come back on costs, but just looking at the implied Q4 cost number, given that your costs are up 1.8% year-to-date, obviously, you're sticking by your guidance of reduction. I guess I was thinking more conceptually about the variability you have in your cost base because -- and I guess the context of that is you're clearly hugely benefiting from higher rates, but one's got to imagine that at some point, the central banks will finally crack inflation, and we'll start to see rates coming down then. On your cost questions on variability, of course, we obviously have A lot of our costs are on staff, making sure that we're looking after our colleagues, we've put through this year, the highest pay rises that we've done in five years, and we put an exceptional pay rise in at the half year as a permanent pay rise to help people Obviously, with our investment, we are increasing automation in our business, our straight through processing that gives us a degree of flexibility in our cost base. we're not upgrading the target today, but what we have said is we are increasingly confident in our 14% to 16%, and that's really because of the strong tailwinds that we'll get and that significant movement that we'd expect to see in terms of the revenue -- sorry, the cost impairment guidance and that positive jaws that we're expecting to see coming through. So I think let's wait and see how we run our models through, but comfortable with the guidance we've given you -- to you based on what we're seeing on the book today and the economics that we've -- the update on the accounts we shared with you this morning as well."
}