{
    "symbol": "NWG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 10:03:07",
    "content": " This guidance is underpinned by our assumptions that the U.K. base rate increases to 2% by the end of the year, and U.K. spot rates remained broadly in line with where they were at the end of June, leading to a net interest margin above 270 basis points for the full year. And obviously, you'll have seen on the slide as well that we've got increase in notional of Â£17 billion in the second quarter, and that was invested at a blended rate of 2.5%. So if you look at the pass-through rate that we've got within our managed rate within retail savings, it's 17%, so an increase of 20 basis points compared to the 115 basis points since the rates have gone through. And actually, what we can see, Chris, which is interesting, is still around 24% of the bounce back loans sitting on deposits what we obviously do is look at our whole commercial sector really very much by large, mid-corporate and SMEs and we also take a sector lens, but we're not seeing deterioration ores. Clearly, one of the areas we're really focused on is the degree of change of challenges that businesses are facing with supply chain disruption with fuel costs and hedging, which is why we've put this very targeted support out, and I talked this morning about the Â£1.25 billion we put agriculture, the 42,000 farmers we support. I've got two, please. I've got two, please. I mean on the government scheme lending, that really has actually, when you -- as we've talked last year and earlier quarters that that's a muted demand for lending from us because customers are sitting on that liquidity and 24% of those bounce-back loans are still sit as on businesses, current accounts. And particularly given the sort of RoTE guidance you're now giving, if I was in the treasury thinking about ways of saving a bit of money, given your basis cost of living pressures, then banks earning 14%, 15% RoTEs, the reserve remuneration would be one of the first places I would go. Well, look, I think what you're talking about tail risk and so far, it's been ruled out by both the Bank of England and One of the things I would say is taking the top-down view, when I set the strategy for NatWest Group when I stood up before I said what I wanted to have was a bank that was stable and secure, well capitalized with a good balance sheet where we were able to deploy credit safely and operate in a low interest rate environment, which has really driven our strategy going forward."
}