{
    "symbol": "DCPH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 13:50:03",
    "content": " As we begin enrollment in the new Phase 3 INSIGHT study for QINLOCK, we also expect to readout another pivotal trial, the Phase 3 MOTION study of vimseltinib, our highly selective switch-control kinase inhibitor of CSF1 receptor in patients with tenosynovial giant cell tumor, or TGCT, in the fourth quarter of this year. As Steve mentioned, it was our privilege to present additional ctDNA data from the INTRIGUE Phase 3 study at QINLOCK at the ASCO Plenary Session last month, which we believe represents a potential practice-changing event in the treatment of second line KIT-driven GIST. The results strongly support our planned INSIGHT study and the potential to expand QINLOCK's label which, if approved, will allow physicians for the first time to optimize treatment for patients in the second-line setting based on the mutational profile to improve outcomes over the current standard of care. Based on the INTRIGUE ctDNA data and regulatory input, we plan to initiate INSIGHT, a new pivotal Phase 3 study of QINLOCK versus sunitinib in this group of second-line GIST patients. We began enrolling patients in the Phase 3 MOTION study in early 2022, and I'm very pleased to announce today that we now anticipate completing enrollment this quarter, enabling us to readout the top-line results in the fourth quarter of this year. Additionally, we plan to present updated data from the single-agent dose escalation cohorts and initial data from the combination dose escalation cohorts of the Phase 1/2 study and initiate one and more expansion cohorts in the second half of this year in combination with the MEK inhibitors, trametinib or binimetinib or the KRASG12C inhibitor sotorasib. This time in the second-line setting based on mutational profile, we believe that if we are successful in expanding the label with a second line KIT exon 11 plus 17 or 18 indication that it would double the QINLOCK peak revenue potential to 350 million to 400 million in the U.S. alone. Your line is now open. Please stand by for our next question. Your line is now open. And then lastly, I would just offer that what we continue to hear from investigators and from thought leaders is a considerable amount of enthusiasm given the data that's now been reported at ASCO for the potential of QINLOCK in the selected group of patients, and I think that's going to serve as a real tailwind in terms of not only getting sites up and running, but also getting patients enrolled on study. Please stand by for our next question. Your line is now open. Please stand by for our next question. Your line is now open. Please stand by for our next question. Your line is now open. Please stand by for our next question. Your line is now open. Your line is now open."
}