{
    "symbol": "GSBC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 17:09:10",
    "content": " Another big driver, the biggest driver really -- the change between the quarters was the change in provision expense, which was -- we had $3.3 million in provision expense in this year's quarter versus the negative provision of $2.4 million in the year ago quarter. Noninterest income was about $1.8 million, lower in the third quarter of this year, mainly as a result of lower gain on loan sales -- gain on loans. So, we were up $2.7 million and this was with a -- about a 9% lower share count, I think our fully diluted shares in the 2021 quarter were 13.6 million versus 12.4 million in this year's quarter. And as Joe said, our net interest income for this quarter increased about $8 million, thatâ\u0080\u0099s $52.9 million compared to the $44.9 million in the third quarter last year. And again, we've touched on some of these already, but for the quarter, we -- our noninterest expense increased about $3.5 million compared to the year-ago quarter. And then the other operating expenses, that category, just to kind of miscellaneous expenses was up about $570,000 from the prior year quarter, and we mentioned in our earnings release that related primarily to some deposit account fraud losses, some additional business development and some additional charitable contributions that we made in the third quarter that are sort of one-off type things at least for the contributions. So, I mean, assuming that we still continue to see a little bit more of that shift out of non-time deposits, which I'm not sure we will, but I would think that to fund growth, in particular, it's going to be probably more -- not be more time deposit type products as opposed to non-time. But as we kind of think about the base for the next three or four quarters, do you think it kind of trends up a little higher from this -- like the $34.5 million range when you exclude the swap fees? Well, I mean that $1.1 or $2 million of the systems, that's going to be in there until the third quarter next year. And probably, I mean, I think all of you know that there is FAS 91 concept where we can defer origination compensation related to origination of loans and that deferral was about $300,000 higher in the second quarter than it was in the third quarter. Like, as you say, if you strip out the things that we would say are for sure ultimately nonrecurring, the $34.6 million or whatever we were at, is probably more likely $33 million and then the other items would be occupancy costs and other expenses, just kind of a -- they kind of bounce around a little bit from quarter-to-quarter."
}