{
    "symbol": "GSBC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 17:20:23",
    "content": " First of all, Legal and Professional fees, we told you that for the remainder of 2022, and then probably the first-three quarters of 2023, we would be having between, the $21.1 million and $1.3 million of quarterly expense related to professional services for helping us with our conversion and we did have actually a little more than that $1.4 million of those expenses during the quarter. We had an investment sale loss of $168,000 during the quarter and we had an income tax adjustment, which reduced income tax expense by $1.1 million, although, we expect going forward our income tax expense or income tax rate will be more similar to what it's been in previous quarters. Our net interest income for the fourth quarter of 2022 increased about $10.4 million or 23.5% compared to the previous year quarter, it was $54.6 million in fourth quarter '22 versus $44.2 million in the fourth quarter of 2021. However, we did see an increase in salary and employee benefits of about $1.4 million from the prior year same quarter, some of that's related just the normal merit increases, a lot of folks are in our company are -- they do their merit increases at the beginning of the year, there's others that are throughout the year. And then we had a negative provision of $1.7 million in the fourth quarter last year, $3 million negative provision on outstanding loan portfolio and the $1.3 million provision expense related to unfunded in that fourth quarter of 2021. So, when we finished up our Federal and various state income tax returns for the 2021 tax year in the fourth quarter of '22, the company updated its combined tax rate applied to deferred tax items and we also made some adjustments in our taxes receivable, payable balances related to some carryback claims that were put into place and filed in 2022. And then Joe, just on your comment in the release about net interest income plateauing or possibly declining that sounds like the fourth quarter run rate, is that correct not the full year 2022 number."
}