{
    "symbol": "NGL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-09 22:17:06",
    "content": " We are augmenting our free cash flow with asset sales of excess real estate and unused assets, we have closed on $12 million of sales thus far in fiscal 2022 and we have another $8 million in process to close before year end and we've identified another $20 million to sell in fiscal 2023. So we have very good ability and very reliable system, because of the redundancy and the large diameter of our pipelines and our ability to move water throughout the system away from seismic impacted areas there, but we can still pick up, like I mentioned, we're picking up quite a bit of new interruptible contracts and water from those others affected within the seismic of SRAs. Processed barrels totaled approximately 1.84 million barrels per day growing approximately 79,000 barrels per day over the preceding quarter and approximately 425,000 barrels per day or 30% and when compared to the third quarter of last year. Our Liquids segment reported adjusted EBITDA of $48 million which was primarily driven by positive results in our butane business as tighter supply market driven by increases in demand for exports have benefited product margins, as well as our refined products and bio diesel businesses were extended refinery downtime in certain markets and favorable location differentials have increased anticipated margins as well. Your line is live. Your line is live. Your line is live. Your line is live. We – so to answer the – probably the most important question you're asking is does the Q2 revenue per barrel is that the norm, or is the Q3 due to the – really due to the increase of – it's a pretty large increase of our large contracts that are at the lower fees as I mentioned – that has some impact on our average. I would again now, I think, if you look at last year's third fiscal quarter compared to this year's third fiscal quarter we actually – I think last year EBITDA for this segment was a bit lower than what we've reported this quarter. Your line is live. Your line is live. I think Mike had mentioned on the last call, we've been scrubbing the asset portfolio for what we would consider to be idle or underutilized assets and are forecasting $20 million this year and $20 million in sales next year which isn't a ton admittedly but it's very low to no EBITDA impact in every dollar. Your line is live. Your line is live."
}