{
    "symbol": "NGL",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-09 21:53:03",
    "content": " Overall, NGL had another very strong quarter in our Water Solutions segment as it reported adjusted EBITDA of $87.4 million. For the remainder of the fiscal year, we expect to see water volumes increase ratably by 100,000 to 125,000 barrels per day per quarter and anticipate exiting the fiscal year with approximately 2 million barrels per day of processed water volumes. Our Crude Oil Logistics segment reported adjusted EBITDA of $48.8 million, which includes an estimated $15 million of realized gains associated with deferred profits that were embedded in our inventory and hedge book at June 30. Our Liquids segment reported adjusted EBITDA of $18.5 million, which was primarily driven by results in our butane business as increases in demand for exports and tighter supply markets have benefited product margins. Putting it all together, total adjusted EBITDA for the quarter totaled $146.3 million and year-to-date adjusted EBITDA is $237.4 million. As previously mentioned, our capital expenditures were weighted towards the first half of the fiscal year, and we expect CapEx for the full fiscal year to be approximately $115 million. So if you double that for the full year, you're $124 million, you add the impact of these increased margins, and it will result in a full year EBITDA, we believe, of about $140 million. So starting with fiscal 2022, the calculation using the numbers we talked about, EBITDA of $570 million, minus interest expense of $250 million, less maintenance and growth CapEx combined of $115 million, adding back $50 million for some asset sales, net of some margin requirements, provides about $250 million of free cash flow for fiscal 2022. And then last one for me, just -- and I apologize for the nit question, but on adjusted EBITDA, that's a $13 million adjustment for CMA role differentials. So what we've done is we've hedged 50,000 barrels per day through December of 2023, and we've locked in a CMA role of about $0.20 per barrel, which will result in about $9.2 million to $9.3 million of CMA role that we will generate between May of this past year -- or this year, sorry, and December of 2023. That -- yes, that would be basically additional -- as far as the earnings in each quarter as far as -- as Linda spoke to the $9.3 million, that basically $300,000 per month over the next 3 years that we'll be collecting."
}