{
    "symbol": "NGL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-06 21:55:17",
    "content": " Our Water Solutions segment saw tremendous growth in fiscal â\u0080\u009822 with adjusted EBITDA of $342 million, growing 42% or more than $100 million year-over-year as underlying volumes grew over 30% on a volume basis, and as our skim oil sales benefited from higher realized crude oil prices. Our wholesale propane business had a challenging fourth quarter and full fiscal year due to lower volumes and margins, as we experienced lower demand and increased competition in the areas in which we operate, as well as challenging market conditions related to a backwardated propane price curve over the course of our fiscal year. Crude logistics reported adjusted EBITDA for the year of $146 million, which was higher than expected due to realized gains on the sale of inventory due to rapidly increasing crude oil prices. Additionally, our distributable cash flow for fiscal 2022 includes approximately $55 million related to certain realized losses on commodity derivatives related to our previously discussed CMA differential role hedge strategy that will return to the Partnership in the form of realized gains on or before the expiration of the hedge strategy in December of 2023. Before we get into the specifics, I briefly review our current focus; one, prudent management of the balance sheet, reducing absolute debt and leverage, 2023â\u0080\u0099s are the primary target; two, reduce leverage below $475 million in order to reinstate the preferred dividends and increase our financial flexibility, we will achieve this through a combination of reduced debt and increased EBITDA; three, generate significant free cash flow from operations to provide the cash to repay the debt; four, enhance that free cash flow by reducing working capital requirements, decreasing CapEx and monetizing underutilized assets. Your line is live. You sort of touched on a little bit in your opening remarks, but that sort of $600 million of total EBITDA less the $400 million of water EBITDA on the low end would sort of imply $200 million of EBITDA out of crude oil, logistics and liquid logistics and that clearly would be sort of down from about a little over $240 million in 2000 and fiscal 2022. Your line is live. So, obviously, the outlook for the water business is really strong, but it seems like the next couple of quarters could be a little challenging from an outright total cash flow perspective, including settlements and everything, which I think is -- I guess, as I understand, it is part of the $100 million increase on the revolver. Robert, your line is live. All right, very good. All right, very good. Robert, your line is live. Your line is live. So that's the challenge for the common shareholder, maybe the preferreds are looking at and say, hey, great, we're going to be back into money next year late, but for a lot of the common shareholders there is still some questions left there and I think you mentioned maybe three or four quarters ago possibility that we don't see the price go back up until absolute common dividend is put back in place. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. Those continue to roll in and they are -- they will grow while we are in this high commodity environment everyone asked about our system and how utilized has our system been from a capacity basis, where we overbuilt maybe over the last few years, I think, based on what we see with these new interruptible agreements, these agreements are anywhere from $0.80 to $1 in a quarter for fee, that's us capturing water that is committed to our competitors, but their systems are not built with the capacity or the throughput and we're able to capture those barrels ourselves at those very high return fees. It's been year-end, GAAP accounting gets pretty focused on making sure that we've captured all of our accruals and there were some of those we would have even outpaced at $34 million in March, but there were some one-timers that in the quarter, really, really at the GAAP accounting nothing strategic or operational just to wrap up fiscal year. That sounds like you're doing quite well, so the exit rate of $34 million was better than the $32 million and it would seem that if that's the exit rate, $34 million, you should do better than $400 million probably dramatically so, given where crude is now."
}