{
    "symbol": "CHRA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 11:37:05",
    "content": " As we execute on our current backlog of work, Charah continues to win new business and year-to-date wins currently totaled nearly $88 million. Since our last call, the total value of future opportunities we see being put out to bid in the next two years has expanded from $7 billion to $8 billion across all of our business lines, capturing even a portion of this universe of work would put Charah Solutions on great footing. In addition to first quarter seasonality, the Charah typically experiences in our business, during colder months we were impacted by weather events that delayed project progress in particular three projects that were nearing completion but that experienced cost overruns due to weather delays. This increase was partially offset by lower byproduct services revenue of $2.5 million, primarily due to net completions of operations work. General and administrative expenses decreased to $9 million during the first quarter of 2022 as compared to $9.4 million in the first quarter of 2021, primarily attributable to improved expense management. This increase was partially offset by increase in gains on sales of real estate, property, and equipment net due to increased scrap sales from the demolition of the Gibbons Creek power plant and an increase in gains on ARO settlement due to the difference between the original estimated cost used in the measurement of the fair value of the company's ARO and the actual cost incurred for the specific remediation tasks. Adjusted EBITDA decreased to $400,000 for the first quarter of 2022 as compared to $9.5 million for the first quarter of 2021 due to the impacts previously noted. I would say though that the one thing that we believe differentiates us from anybody else is we're the only ones offering the full suite of services at the depth that we do as it relates to ash management, ash sales, the large remediation work that we perform and then especially here once since we've added on our new business line of environmental risk transfer or ERT that we call it really nobody else is providing that full suite of services."
}