{
    "symbol": "DAN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 17:10:26",
    "content": " Over the last decade, Dana has won three PACE awards, two partnership awards and has been named finalist 12 times, whether it’s individual components, fully integrated systems or complete vehicle E-Propulsion, we are leveraging our expertise in design engineering, manufacturing, and integration to meet electrification needs of our customers across all mobility segments. While it’s normal for our business to use cash in the first quarter, this year, our use of cash was $237 million, which was $211 million higher than the previous year due to lower adjusted EBITDA, working capital requirements and higher capital spending, each of these contributing about a third of the change. I can tell you that there’s plenty of discussion about what to do with the other three pillars, because at the end of the day, as I’ve said on every – I think almost every quarterly earnings call, I’ve had with all of you is that the OEMs have definitely adjusted to be much more flexible and to work with suppliers more since the 2008, 2009 crisis, because without a stable and healthy supply base, there’s no notional vehicle production. The current $120 million is obviously higher than the headwind that we had assumed in our guidance in the first quarter, that obviously reflection of what’s going on from a macro perspective across all of our end markets. And as Jim mentioned, we’re in – really on a daily basis talking with all of our customers across all of the end markets about recovering these higher costs. So maybe you can just give us a bit more color on how inflation and the operating and efficiencies are hitting the segments differently, because it is just interesting to see that off highway is doing still really well, pretty good conversion, interesting actually that all of your or a lot of your Europe exposure is in off highway and yet really no impact from what’s going on in Ukraine, but auto like vehicle seems to be hit much harder. If you have a customer in one market that’s a low volume high complexity market and they end up having different interruptions, short noted, stoppages, so on and so forth, obviously your ability to control cost and impact on having, for example, a full plant or full plants – full of people, on site already, or whatever example you want to use, it’s going to multiply faster in the larger plants, larger volume. And then back to your question really on inflationary cost outside of commodities, I’d like to give you a more direct answer, but it’s just a – it’s a complicated puzzle, would I take you back again to it depends on the end market recoveries for the reasons I’ve already mentioned less."
}