{
    "symbol": "DAN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 22:11:17",
    "content": " Moving on to Slide 4 and our update for the second quarter, Dana had another quarter of strong sales totaling $2.6 billion, a $381 million increase over last year, driven by robust customer demand in all of our end markets, including $60 million incremental EV sales. We generated strong free cash flow this quarter of $167 million, an increase of $180 million over the prior year driven by lower working capital requirements as we effectively manage inventory and customer receivables. Sales were 2.6 billion, that's $381 million higher than last year's second quarter driven by stronger demand across all of our end markets and recovery of commodity costs, partially offset by currency impacts. Net income attributable to Dana was $8 million for this year's second quarter, compared to $53 million last year, mainly due to lower operating earnings. This loss was driven primarily by input cost inflation, which was $38 million of the total organic change in profit, lower cost savings from suppliers, and operational inefficiencies from the supply chain driven volatility and our customers' production schedules. While the incremental EV sales are profitable, continued investment in engineering to expand and commercialize these new technologies and input cost inflation drove a $4 million reduction in contribution in the second quarter, a margin headwind of 40 basis points. Gross material costs were $145 million higher in this year's second quarter, compared to a 2021. In the second quarter, we generated free cash flow of $167 million of which â\u0080\u0093 which was $180 million higher than the previous year, even with lower adjusted EBITDA. First, profit on organic sales were down about $115 million, about a quarter of that's due to higher net inflation with the remainder due to further customer and supply chain inefficiencies in the business and higher launch costs, as well as higher net investment in our EV business. However, in our full-year comparison, there is an additional headwind of about $50 million, due to the sale of higher value inventory, driven by the run up of commodity costs over the last several quarters."
}