{
    "symbol": "DAN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 14:09:02",
    "content": " Starting on the left side, Dana achieved record sales of $10.2 billion last year, a $1.2 billion increase over the previous year driven by often erratic but solid customer demand, new business backlog in all of our end markets, and successful cost recovery efforts. In todayâ\u0080\u0099s presentation, Iâ\u0080\u0099ll also provide you a sense of the magnitude of the number of launches and roll-on business Dana has throughout 2023, and I will share details on the record sales backlog of $900 million over the next three years, which is $100 million improvement over the prior backlog. To this end, Dana has amassed $900 million of sales backlog through 2025, a record for the company that is $100 million more than our prior three-year backlog, and as you can see in the upper part of the slide includes $300 million of incremental new sales coming online in 2023. Turning your attention to the upper right-hand of the slide, you can see that our sales backlog is well balanced across end markets and regions, and if youâ\u0080\u0099ll move to the bottom right corner of the page, you will notice the EV versus ICE chart shows that 65% of our total $900 million backlog is coming from electric vehicle programs. Fourth quarter adjusted EBITDA was $176 million for a profit margin of 6.9%, which was 170 basis point increase over last year driven by better operating performance and customer recoveries, partially offset by higher input costs. Finally, the recovery of prior period commodity costs added $48 million in sales, but we did not see the net profit benefit we expected due to commodity costs remaining elevated longer into the fourth quarter than expected, resulting in a 20 basis point margin headwind. Finally, capital spending was $71 million higher than in 2021 as we continue to invest in our capabilities and capacity to support market share gains as well as our new business backlog, including electrification programs. Free cash flow is expected to be approximately $25 million at the midpoint of the range, which is a decrease compared to last year as working capital is aligned with growth and capital spending increases to support our backlog and market gains. Beginning with organic growth, compared to last year we expect an additional $450 million in sales from traditional products through a combination of new business, market growth, market share gains, and customer recoveries. This strong growth combined with market share gains and higher content on EV products has us targeting sales between $11 billion and $12 billion with adjusted EBITDA in excess of $1 billion, driven by conversion on higher sales and improved profitability in our EV business. Your line is open. Your line is open. Your line is open. Your line is open. Got it, and just one last one - when I look at Slide 21, I would have thought that some of your growth would reflect recoveries for some of the net inflationary costs, but if I look at traditional and/or EV growth, that $600 million, and I think your slide before said it was 300 market, 300 new business, so where would the benefit of price recoveries for inflationary costs fall in the sales walk? Your line is open. Your line is open. When I look at the backlog over the next two years, it looks like maybe $400 million of that billion dollar growth comes from EV business over those two years, and you did mention that that business is expected to get to breakeven and presumably itâ\u0080\u0099s a $50 million loss right now, but maybe you can give us a little bit of color on whether this turnaround for the EV business, or overcoming the initial launch costs is a significant part of that $200 million of additional EBITDA that youâ\u0080\u0099re targeting for mid-decade."
}