{
    "symbol": "DAN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 22:12:09",
    "content": " Moving to Slide 4 and our update for the third quarter, Dana had another quarter of strong sales totaling $2.5 billion, a $330 million increase over last year driven by continued robust customer demand in all of our end markets. The differentiator is our ability to move past just developing and manufacturing components and systems to also help our customers design vehicles and then develop and integrate a complete customized e-propulsion and e-power system with a global network of suppliers, market expertise, and EV technical centers, we leverage these capabilities across all markets, whether it's the light-vehicle delivery vehicles, mining or electric access equipment, or Class 8 long haul trucks, Dana assists in determining how these systems are best integrated into a fully electric vehicle, no matter the application. In fact, we're in the process of securing a number of confidential new programs that we will share in greater detail early next year, whether it's long established global OEMs requiring full customized integration to non-traditional vehicle manufacturers in the market who may prefer an off-the-shelf solution from Dana's established and validated product of electrodynamic products, we are able to provide the capabilities and solutions for their specific needs. Sales were $2.54 billion thatâ\u0080\u0099s â\u0080\u0093 that is $331 million higher than last yearâ\u0080\u0099s third quarter, driven by strong demand across all of our end markets and recovery of commodity and inflationary costs, partially offset by currency impacts. We generated $77 million in free cash flow in the third period â\u0080\u0093 third quarter, compared with the use of $170 million in the third quarter of last year. Second, EV product sales increased $73 million over last year's third quarter. In the third quarter, we generated free cash flow of $77 million, which was $247 million higher than the previous year, even with lower adjusted EBITDA and higher interest in taxes. That is a $300 million improvement over the third quarter last year, as we continue to manage inventory and align commercial terms with our suppliers and customers. Beginning with organic growth compared to last year, we expect an additional $900 million in sales from traditional products through a combination of new business, market growth and recoveries."
}