{
    "symbol": "ARNC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 13:24:03",
    "content": " Demand across our end markets remained strong, and our operations generated $162 million in cash in the quarter, which will be fundamental to growing -- as growing free cash flow is supporting high-return organic investments and substantial returns to our shareholders. Our second quarter net income included an after-tax net foreign currency gain of approximately $48 million, primarily related to foreign exchange fluctuations in Russia and the second quarter of last year included an after-tax noncash pension settlement charge of $423 million. Since we announced this program in May of last year and through the end of the second quarter, we repurchased approximately 6.7 million shares or approximately 5% of our outstanding shares for $214 million against our $300 million program. Revenue in the second quarter increased $747 million year-over-year, primarily due to the impact of higher aluminum prices, as well as realization of pricing actions and improved volume and mix. Adjusted EBITDA for the quarter was $204 million, up $17 million or 9% year-over-year due to improved pricing, volume and mix, partially offset by inflation. Our savings net inflation was a negative $154 million as our shaft productivity impacts were limited due to production issues and could not offset the approximately $150 million of inflation in the quarter, primarily from energy, transportation and alloying materials. Revenue in the second quarter was approximately $2.1 billion, up 14% organically year-over-year, driven by the growth in every market, except industrial, which was impacted by the operational issues in Tennessee. Adjusted EBITDA in the quarter was $174 million, up $1 million or 1% year-over-year, reflecting stronger price, volumes and mix, which were offset by operational inefficiencies and cost inflation. Revenue on our Building and Construction Systems segment in the second quarter was $329 million, up $72 million year-over-year and up 26% organically. Adjusted EBITDA was $53 million, up $18 million or 51% year-over-year, driven by increased prices, which offset the inflation and higher aluminum costs we are experiencing. Revenue in our Extrusion segment in the second quarter was $105 million, up 43% organically year-over-year. Adjusted EBITDA was a loss of $12 million versus a loss of $8 million last year's pricing actions, and volume growth were offset by inflation and operational issues. Adjusted EBITDA in the second quarter in Russia was $24 million, which is flat with $24 million in the same quarter of last year. There's still a great deal of uncertainty in the rest of the year, but we are increasing our guidance slightly to $50 million to $80 million from $40 million to $80 million to reflect the strong second quarter performance."
}