{
    "symbol": "HWM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 13:51:02",
    "content": " For the full year, revenue of $5.62 billion, plus $30 million, minus $20 million; EBITDA of $1.27 billion, plus $6 million, minus $5 million; earnings per share of $1.40, plus or minus $0.01 as we've narrowed the range from previous guidance. Free cash flow of $560 million, plus $20 million, minus $40 million, and this is driven -- this reduction compared to prior guidance is driven by the higher year-end inventory carried into 2023 for the continued commercial growth -- aerospace growth in the first quarter. So we've booked additional orders for -- during the third and fourth quarter, and that's looking better for us, albeit there's still significant areas to go because we still have, in particular, 1 of the airframe manufacturers, which has got a lot of inventory and hasn't really yet moved to cut orders lease on the supply base. As we all know that those production levels probably have not been achieved and the airframe manufacturers and certainly on the engine side, and so where we've been in line at or even, I would say, meeting for rate increases next year is that, that inventory is being taken back out of the system to bring it down to what actually has been produced and the requirements seen for, in particular, the engine manufacturers towards their own year-end and the inventory that they're carrying. John, I wonder the -- so the 10% growth outlook for next year if aerospace is growing 20%, and that's, let's say, 45% of the sales base this year, it implies really minimal growth in the rest of the portfolio. We do note that the order intake, for example, for Class 8 truck was the highest it's ever been in a September, I think, 53,000 plus trucks, which is really, I'd say, great number, probably inflated by the fact that many say, the truck manufacturers haven't been willing to take orders for next year until they were clearer regarding the input prices of their materials. So it's difficult to separate out what's really going on, except that the fourth quarter should see solid production improved compared to we've been, and I think that will continue in the first and second quarters next year. And I think all we're talking about here for Howmet is that where some of our parts are being brought into line with what they cash for elsewhere and maybe just a little bit of a less ambitious plan in terms of build rates just because I mean we -- I think you can see that probably we haven't built -- or there has not been as many MAXâ\u0080\u0099s built or maybe as many narrow-body Airbusâ\u0080\u0099s built as visually envisaged, is my guesstimate from trying to assess the information available from what's been said publicly on the earnings calls of all the companies. And if anything, probably let's say, just take the $150 million or a little bit less, is probably the -- our assumption, which will be an increase on the production in last year."
}