{
    "symbol": "FUL",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-30 13:55:04",
    "content": " On a year-over-year basis, adjusted EBITDA was stable in the first quarter, and adjusted EBITDA margin increased 40 basis points to 13.6%. Adjusted EBITDA for HHC increased 28% year-on-year, and adjusted EBITDA margin increased 360 basis points to 15.6%, driven by favorable price and raw material cost management. In Engineering Adhesives, organic revenue declined slightly in the first quarter impacted by continued weakness in China as well as some destocking and somewhat slower demand in durable goods and products used in the construction trades as expected. Adjusting for these items, organic revenue was down 2.5% with pricing having a favorable impact of 8.3% year-on-year in the quarter and volume down 10.8% reflecting a continuation in significant customer destocking in Construction Adhesives and a general slowdown in end market demand. Adjusted gross profit margin was 26.9%, up 190 basis points versus last year, as the net effect of pricing and raw material cost developments more than offset the impact of lower volume. Adjusted EBITDA for the quarter of $110 million was at the top end of our expected range, but down slightly year-on-year, reflecting the favorable impact of pricing and raw material development being more than offset by lower volume, higher wage inflation and unfavorable foreign currency translation. Adjusted earnings per share of $0.55, was down versus the first quarter of 2022 as expected, driven by lower volume, unfavorable foreign currency and significantly higher interest rates. We continue to expect adjusted EBITDA to be between $580 million and $610 million, representing a 9% to 15% year-on-year increase, up 11% to 17% adjusting for the extra week in 2022. Finally, based on the seasonality of our business and the timing of pricing and raw material development over the course of the year, we would expect to realize about 42% to 43% of full year EBITDA in the first half of the year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}