{
    "symbol": "PLXS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-27 11:42:05",
    "content": "  Some of the statements made and information provided during our call today will be forward-looking statements including, without limitation, those regarding revenue, gross margin, selling and administrative expense, operating margin, other income and expense, taxes, cash cycle, capital allocation, and future business outlook, including the impact of COVID-19 on the Company's business and the results of operations. In addition, these appointments support Plexus long-term succession planning and strengthen our position to sustain industry-leading revenue growth and operating performance as we build toward our goal of $5 billion in revenue with 5.5% GAAP operating margin by fiscal 2025. I guess, first of all, just stepping back and thinking about where you're at from a supply chain standpoint and the revenue guidance today versus getting to, say, the $1 billion you mentioned in terms of revenue support that you see in your order book. I mean, in the near-term, meaning the next couple of quarters, we don't see supply breaking enough to be able to hit that billion-dollar mark, but what we do see is we have -- particularly as we get into Q3, a significant amount of our anticipated revenue increase is major new program ramps, and those new program ramps we've been pipelining material for a long period of time and have a line of sight to that material. I mean, we've been working the issues for many quarters and we -- some of them are just getting into where the supply is becoming available now for the original projections, so we do see an ability to be able to drive the sequential increase in revenue and EPS that we're expecting. So again, I'd say the anecdotal evidences were performing very well in the market\n Yeah, I would add that, firstly, I have several calls of some of the customers that have been challenged and as I'm talking to their executive teams, they're acknowledging that they're having supply challenges from many suppliers, it's not just us."
}