{
    "symbol": "RAMP",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-24 23:25:17",
    "content": " I would now like to turn the call over to your host, Lauren Dillard, Senior Vice President of Finance and Investor Relations. First, as the economy enters a period of market uncertainty, we believe LiveRamp is well insulated from macroeconomic headwinds relative to most companies. We're resilient, 80% subscription-based and embedded into the very fabric of the data economy. Second, in the recently completed Q4, we posted another quarter of growth with a number of notable client wins. And third, we're by no means satisfied with where we are and have clear line of sight to areas that we think can improve our top line growth, profitability and return on shareholder capital. This year feels really different, however, given the absolute chaos of the financial markets in recent weeks. With the devastating war in Ukraine, supply chain challenges, rising inflation rates and volatility in the financial markets as well as lingering impacts of the global pandemic, this year has brought a significant amount of uncertainty. As we have seen in the past, broader market uncertainty can serve as a strong catalyst for LiveRamp's business as companies shift their dollars toward resources that more directly enable them to address and measure their marketing performance. Since our founding over a decade ago, LiveRamp has been recognized as a leader in the customer experience economy. We've grown through multiple industry cycles and ecosystem changes, delivered category-creating innovation to our customers and future-proofed our product for the next generation of data-driven experiences. Despite recent macroeconomic uncertainty, we are entering FY '23 from a position of strength with conviction in our ability to deliver a balance of solid top line growth and enhanced operating profit, all while continuing to transform customer experiences and generate more valuable business outcomes. Moreover, our success in identity, addressability and data collaboration have embedded us into the very fabric of the data ecosystem. Case in point, today, more than 1,500 publishers representing more than 11,000 domains are leveraging LiveRamp's authenticated addressability technology, including roughly 80% of the Comscore 50 and the major walled gardens. In part due to these integrations, LiveRamp is now connected to over 85% of consumer time spent online in the U.S. and continues to scale internationally as well. For example, earlier this year, we announced an expanded partnership with The Trade Desk to power their EUID in Europe. And of course, on the origination side, 80% of our revenue is comprised of predictable SaaS subscriptions which help insulate us from large economic fluctuations. Second, LiveRamp continued to grow and win with clients in Q4. Normalizing for the wholesale contraction, total revenue grew 26% and subscription revenue was up 31%. We exited the quarter and year with approximately $400 million in ARR, up 19% as reported and up 28% normalized for wholesale. In the quarter, we added 15 net new logos and continue to see particular strength in our large enterprise customer segment as a result of increased adoption of our enterprise product suite, Safe Haven. Our $500,000 to $1 million customer count was up 30% and our $1 million-plus customer count grew to 87, an increase of 24% compared to the prior year. In the quarter, we signed a new Safe Haven deal with Colgate in the EU for projects in both the U.K. and France and a TV measurement deal with a major North American insurance provider. For example, last quarter, we talked about a new Safe Haven deal with JD.com. In the quarter, we expanded this relationship to include an emerging new use case enabling collaborative personalization on JD.com's owned and operated properties. As part of this multiyear strategic partnership, LiveRamp will power the identity and collaboration suite for top clients in the retail, CPG and financial services verticals. Given the breadth of use cases enabled by the platform, Safe Haven customers have higher ACVs and upgrade at higher price points. As we continue to upgrade our customer base to Safe Haven, we expect the average length and size of our contracts to continue to increase and the average churn and contraction to remain lower than what we have typically seen on average. Our gross margin expanded to 76%, ahead of our long-term target of 75% and we delivered sustained profitability. For the full year, operating margin was roughly 8%, up 400 basis points. This performance reflects the leverage in our model and our ability to generate strong free cash flow across the business which is perhaps a great segue to the final topic I would like to discuss, our focus on and commitment to value creation. Third, we are not remotely satisfied and have implemented plans designed for faster growth, improved profitability and greater return for our shareholders. They recognize that there are always ways to better serve clients, grow even faster, improve efficiencies and build better market traction. LiveRamp aspires to be not just great but an exceptional, an exceptional company. While some of these may explain our recent performance and near-term outlook, all of them represent opportunities to further improve on our operating plan for the coming year. Opportunity number one, accelerate our top line growth. Although we grew subscription revenue by roughly 20% over the past year, I think we can do better. We intend to accomplish this through four discrete initiatives: one, expanding our sales and marketing capacity; two, improving our product efficacy; three, expanding to new geographies; and four, accelerating our partner channel efforts. In FY '22, we came out of the blocks fast, fast in bookings, the early indicator of future revenue but we slowed in the back half of the year. Now let me be clear, we're not -- we're not seeing material competitive headwinds, adverse economic conditions or changing client demands. In the U.S., for example, year-over-year revenue increased by roughly 20% compared to sales and marketing headcount growth of approximately 8%. When you further refine this number to just experienced commercial salespeople, we were roughly flat. We've hired 18 new commercial leads over the past three months, an increase of about 25% to our sales capacity. With the influx of talent, we've also introduced new training and development programs to ensure sales reps are more persuasive, well trained in enterprise selling and more effectively achieve their quotas. And while we know that not every person we hire will succeed, we strongly believe that successful SaaS sales at scale is a math equation. It just requires growing pipeline, strong sellers and predictable conversion rates. Now in SaaS, there's an old axiom that great product sells itself. To this end, we also think our recent refinement of our Safe Haven suite will continue to pay dividends for us. Safe Haven represents a holistic integrated suite of all of LiveRamp's capabilities that can be easily purchased and used through a common user interface and is interoperable with all kinds of complementary technologies, major data destinations, CDPs, storage and compute to clouds. A simple buying process and user experience, seamless across hundreds of valuable use cases and increasingly cloud-agnostic so that clients can plug us into any partner. Within the next year, our goal is to double the number of clients leveraging the Safe Haven suite. As existing onboarding or television clients, they won't experience disruption but rather we'll simply start to use a cleaner, more intuitive UI with access to capabilities to which they may not have been previously exposed. Today, we serve over 40 markets, up from 12 only a few years ago. In FY '22, our international bookings outpaced the U.S. and revenue for the quarter was up 33%. A final key initiative in FY '23 is to expand our partner channel strategy, the initiative that James Arra has been leading for us. And as more customer data migrates to the cloud, key LiveRamp technologies, identity, for example, can be deployed natively in these environments. This enables these customers to achieve faster returns on their cloud investments, reduce data fragmentation and allows for greater flexibility and simplicity with using identity in the cloud. A year ago, we announced a strategic partnership with GCP which has been a nice source of lead gen for us. And since then, we announced similar partnerships with AWS and more recently, Snowflake to power identity natively within their cloud environments and data warehouses. In the coming year, we expect to launch additional LiveRamp technologies like advanced segmentation and activation natively in the cloud as well. But over time, we think that this could be a catalyst for us. Operating cash flow over the past 12 months was $78 million, an improvement of over $100 million from just two years ago. As the travel restrictions of COVID ease, we'll absorb additional T&E but we'll continue to improve profitability in the coming year. While we'll increase sales capacity and invest internationally, most other areas of our business will benefit from increasing returns to scale. And opportunity number three, improve shareholder return on capital. Of course, the best thing we can do is simply continue to grow revenues, profits and satisfied clients. And as I just discussed, that's our intent. But in this erratic market, as we have done historically, we will also explore returning capital to shareholders. For example, we have a strong track record of opportunistically and aggressively buying back shares based on market conditions. As a result, over the course of the last decade, we have returned over $1.2 billion to shareholders in the form of share repurchases, including more than $800 million since the LiveRamp-Acxiom separation in late 2018. Given the current market, we today announced our intention to repurchase up to an additional 150 million of LiveRamp's common stock before December 31. First, in a period of market uncertainty, we believe LiveRamp is a safe choice. Second, Q4 represented another quarter of growth and we anticipate more of the same in the coming year. In the coming months, we will seek to grow bookings and revenue even faster by increasing our sales and marketing capacity, improving our products, expanding geographically and broadening our cloud and partner channels. And we will explore creative ways to unlock shareholder value, included -- including an accelerated buyback program. Finally and importantly, we have a strong team in place to execute against our goals and we enter FY '23 focused and energized to deliver on the year ahead. With that, thank you again for joining us today and a special thanks to our exceptional customers, partners and to all of our LiveRampers across the globe for their ongoing hard work and support. Thanks, Scott and good afternoon, everyone and thanks for joining us today. And while there is always room for improvement, the one thing we can say is that amidst the sea of change and uncertainty, we continue to deliver. Today, I would like to focus my remarks on three areas: first, share a few highlights for the year in Q4; next, provide guidance for Q1 and FY '23; and finally, discuss our approach to capital allocation and provide an update on our buyback program. We grew, total revenue was $529 million, up 19%. Our gross margin was 76%, up 400 basis points. We were profitable, not only for the full year but in every quarter, too. During fiscal '22, we repurchased 1.3 million shares for $59 million. In the fourth quarter, total revenue was up 19% and subscription revenue increased 22%. In the quarter, we added 15 net new subscription customers. Current RPO or our next 12-month contracted backlog was $309 million, up 21%. As a reminder, the timing of renewals can and will cause volatility in this metric. ARR ended the quarter at $399 million, up 19%. And net retention was 111%, while platform net retention was 110%. Excluding this, total revenue increased 26% and international, up 45%. Beneath the top line, our business model is working. For the quarter, gross margin improved 200 basis points to 76%. We were profitable and operating cash flow was approximately $60 million, driven in part by a tax refund of roughly $30 million related to a carryback of losses. Growth, a trended CAGR of 23% since FY '19. Non-GAAP gross margin improvement of 1,200 basis points, non-GAAP EBITDA improvement of $104 million and $812 million of cash returned to share owners. In summary, FY '22 is a mirror of the past, growth and gross margin expansion, operating leverage and capital stewardship. Before jumping into the numbers, I'd like to talk about our priorities and considerations for FY '23. First, while our foundations and product market fit remain strong, we're being appropriately cautious in our outlook, given macroeconomic uncertainties. Also, as Scott mentioned, our overall growth bookings slowed in Q4 and we expect relative softness for the first half of the year. We expect our operating profit to increase despite the post-COVID rebound in expenses, continued R&D investment and costs associated with our global expansion. For the first quarter, we expect revenue of approximately $139 million and non-GAAP operating income of approximately $1 million. For the full year, we expect revenue of between $608 million and $625 million and non-GAAP operating profit of approximately $49 million or a margin of roughly 8% at our midpoint. For Q1, we expect subscription net retention to be roughly 112% and platform net retention to be approximately 114%. The sequential decline from the adjusted net retention of 119% is driven by an expected lower relative contribution from usage and to a lesser extent, anticipated contraction. In Q1, we expect our gross margin to be roughly 75%. For the full year, in order to help you think about our top line guidance, let me provide a high-level bridge from our FY '22 performance. The factors impacting our year-over-year performance are; lower relative contribution from both bookings and usage, the previously disclosed incremental $15 million of wholesale contraction and to a lesser extent, our assumptions for FX. Usage; in FY '22, usage was approximately 14% of revenue. Given the macro uncertainties, we expect usage in FY '23 to be approximately 11%. Marketplace; given the strength of data marketplace, our plans for FY '23 and our outlook for our service business, we expect marketplace to grow in excess of 25% for the year. Over the course of the last decade, our approach to capital allocation has been consistent and focused on three priorities. We want a strong balance sheet that allows us to invest in the business to extend our market leadership and global opportunity, strategically take advantage of acquisition opportunities and as appropriate, return capital to shareholders through our repurchase program. With that as a backdrop, we exit FY '22 with a business that has a strong balance sheet, has financial flexibility and one that is profitable in generating meaningful cash flows. Given that strength, we intend to repurchase an additional $150 million of stock by the end of Q3 FY '23. Through the challenges of this past year, LiveRamp again delivered on its commitments. We have consistently demonstrated an ability to navigate change, to ensure our customers are competitive and can use data to create lasting and personal relationships with their customers. Our model works, growth, strong gross margins and demonstrated profitability. On behalf of all of us here at LiveRamp, thank you for joining us today. Just curious, I mean, it definitely sounds like you're baking in the usage being down a bit for fiscal '23 and it seems like that has a -- of the factors, that's the biggest impact on guidance. I would say when you think about our guidance, I'd use, maybe three words. And then number two, given the macro set of uncertainties, I would say an appropriate level of conservatism. But given everything that's going on, we felt it prudent to be, again, appropriately conservative. And as I mentioned in our prepared remarks -- or in my prepared remarks, also a small impact for FX. And then finally, I would tell you, while our guidance reflects appropriate level of conservatism, our direction and ask of our team is exactly on the other side of that trade is, we're asking them to go blow away these results. But again, to your question, given the macroeconomic backdrop, we think that we've given the appropriate guidance. I always think back to a quote from Warren Buffett, probably said many, many years ago, \"In hard markets, winners win.\" I hate myself for allowing ourselves over the last quarter or so to get behind in hiring because when we recruit people, we have a pretty good message to tell them, too. And there's not a company in the planet that isn't trying to figure out how to use their data more effectively, to power better customer experiences, better ROI, better decisions. I always tell people when they're talking to us, \"Hey, judge us by the company we keep.\" And the companies that we've talked about even here on this earnings call over the last couple of quarters, we've talked about Amazon, we've talked about Walmart, we've talked about Target, we've talked about Carrefour. Peter, if I could add just a couple of things in there. Just as Scott mentioned that we -- our priority is hiring coders and callers, there's also a lot of discipline that we're forecasting into our operating performance for FY '23 as well. If you think about the fact that we're absorbing about $20 million of incremental COVID costs, we're also expanding internationally which is an investment of roughly $6 million, we're projecting to generate an increase in operating income. But at the same time, we're being very disciplined in our approach to cost and also disciplined in our approach to delivering higher operating profit in FY '23. Today, we're in about 40. First of all, we've said it before on multiple occasions and Scott mentioned it earlier today, the combination of Safe Haven and ATS is a winning combination. The second thing that I would highlight which is a little bit tied to the last thing I mentioned, is that our customers are pulling us into these global markets. So as we move to another 20 countries, its global advertisers that want to be in those markets and they're asking us to be there. It's our customers taking us to Brazil, to Italy, to Spain and so on. And third, it's our customers that are driving our expansion. And Scott, did you want to -- Scott, did you want to add or -- Warren, that's great. Obviously, the holiday quarter is a bit seasonal for us, too. The one thing I would layer in, I mean, this speaks to the fact that we hired 20 new sales reps in the last quarter. And for us, check, check and check, then if we hire the right number of people and deliver against our product builds, then the revenue is going to happen. I'd start off with what Scott mentioned in his prepared remarks and I'd even go back to some of our earlier calls, where we think our platform is applicable to every single LiveRamp customer. I think last quarter, we talked about ARR for Safe Haven-related revenue to be about $76 million. Well, that's now even one quarter later, pushing $100 million. And again, I'm really stealing thunder from Scott and what he mentioned in his prepared remarks, is what's really interesting is just how important it is that our products be integrated into the platform and actually it's exactly what our customers are asking for. Again, this is something that all of our customers are asking for. When you think about the potential for TV, well, integrating TV into the platform is exactly what every large advertiser wants. So for us, we think the potential is 100% there. Maybe I'll add one thing, Shyam which is if you think back over the last few years, I mean, we were certainly -- we've always been SaaS. Historically, as we created new features, new offerings, our clients were forced into kind of a weird world where we would sell them a variety of kind of disjointed, unbundled products. Hey, let's plug into data marketplace. And more specifically, a client can now log in and regardless of what they choose to start with us for, maybe they're an onboarding client, well, they're a Safe Haven client now because they buy the subscription to Safe Haven and maybe they're only using onboarding. But in the UI, every other thing that they could possibly want to use is right there. Now you may marry that up with professional services and some evangelization there and we'll do that just as other big SaaS companies have done before us but this transition to a bundled, discoverable SaaS offering, it really does change how we go to market in a very positive way both for ourselves but more importantly for our clients. And then, I'll take the second part of the question on both Walmart and also on Carrefour. Next taking about Carrefour, a couple of key words that I would say. Let me just kind of tell you again a few things that I find incredibly interesting right now is we're now up and running in France, we're now up and running in Brazil, we're now up and running in Belgium, we're now up and running in Italy, we're now up and running in Spain. Two, as a result of the work that we've been doing globally with ATS, we also are building incredible ATS publisher relationships in each of those markets. So a lot of really, really positive things going on that are helping us now to accelerate that partnership. As a result of our overall relationships not only with Carrefour but other CPGs and retailers, we are building up a tremendous level of expertise in CPG, retail media and retail that is extremely valuable in this market, in particular where retail media networks are exploding. Two, our product just continues to get better. We're incredibly excited about our analytics library and what that can mean for assortment management and pricing and category management and also more effective media inactivation and then finally I think we're starting, again, I'd still put it very early innings to see what network effects can be created. I think it was last quarter we talked about partner tenants being at roughly 100, today overall we're now over 180. So again it's the beginning, a lot more work to do but I think some exciting progress. As you go forward, Scott, you talked about how you're not happy with those rates as we look across '23. And what I'm not going to do is give guidance that trumps the, I think, appropriate guidance we just gave. If you look back at our history, we don't have a history of missing our guidance and we don't intend to this year either. But Warren, I think you indicated a re-acceleration there in FY '23. So overall, up 6% while data marketplace was up 15%. As I mentioned, we're pretty excited about what's ahead for data marketplace next year. Again, as I mentioned just a little bit earlier, this is one of the number one things we're hearing from clients, is they want data marketplace integrated into Safe Haven so they can directly access third-party data. So having data marketplace integrated into, say, mini-walled gardens which we also think is an opportunity. And then finally, something we really haven't talked about today but is equally exciting is what's going on in our service business. So the combination of what's going on in data marketplace, coupled with the exciting momentum that we have inside of our service business gives us a lot of optimism for the year ahead. I just wonder if you could talk a little bit about what such non-ID-based moves would mean for LiveRamp if they gain traction, just not clear what the distinction is between what you do and how that would pan out. Well, first off, I would tell you that I think there are a couple of big regulatory trends. And it's funny, I mean, some of the companies that you mentioned, whether it's the walled gardens or I think there's now a case study of how we performed on mobile apps and on Safari inventory live on our website. If you have the consumer's consent and they have visibility into what's being done, then you generate much better marketing returns. If you don't, then you have to fall back to an alternative form of targeting, oftentimes contextual and they just don't perform nearly as effectively. What's interesting is if you look at the best contextual targeting and then you layer in addressability on the top of it, it becomes significantly better yet again. Now, I'd also say that there's been a real -- some negative news recently about some forms of targeting and they're all forms that we don't do because, again, everything we do relies on consumer consent. But anything that is a device ID or relies on fingerprinting or some kind of technology that allows you to build an identity without necessarily knowing the identity and obtaining consent, we think those are losers. The other big mega trend that we're seeing, Tim which has gotten some news recently is we've long been out front of the market and talked about the fact that we're neutral. We'll work with anyone and everyone who's ethical, including companies that have called themselves our competitors. And again, that's going to help us a lot, whether it be with the cloud providers, where we're increasingly working with many of them. It's not necessarily in our forecast but we think it's some nice upside as we scale that, whether it's with the thousands of publishers that we work with, whether it's the walled gardens, whether it's the CDPs, whether it's the marketing cloud, we'll continue to be interoperable because what we bring is so unique. And those capabilities are things that are best done at scale, neutrally and interoperably for the entire industry which is exactly our strategy. Yes, in the past, you've talked about connected TV-related revenues being the fastest growth driver within LiveRamp. I was hoping just to get an update on connected TV-related growth and exposure and your thoughts maybe on the outlook within this segment, particularly as some of these social media companies are seeing some ad-related weakness. I'll tell you, connected television continues to be something we're bullish on. But I think it was probably up 30%, maybe a little bit more for the year. Overall, we're very optimistic about the opportunity. This is also an area, though, where if there are any clients on the phone listening to this, we've heard you that you want us to make it even simpler to buy, more integrated into the rest of our offering and so that's what we're doing as we integrate it into our Safe Haven product suite. And ultimately, we think that this is a secular trend that's going to continue to benefit us and others in the industry. CTV is growing explosively but it's still the case that it's probably only 15%, maybe a little bit more of overall television spend. And then just one on Safe Haven, I've thought Walmart was obviously just such a huge win for the Safe Haven product. I won't comment on that one, in particular but I would tell you, overall, 100%, 100% true. I mean, we're good. They're telling their partners, \"Hey, we want you to work with LiveRamp. And if you do, here's the data that's going to be accessible to you and here's the value that together we'll be able to unlock.\" And when the companies that are the most respected in the world are all partnering with LiveRamp, that's a good trend. They heard a lot about the Carrefour example from our team, including Vihan -- Vihan Sharma, who helped spearhead the Carrefour win and now is responsible for our entire selling effort worldwide. And we're not even getting started because retail leads to financial services, leads to travel. And we had a great representative -- representation of CPG of retail of others of publishers, all of whom are very familiar with the work that we are doing with Safe Haven. So almost regardless of geography around the world, whether it's Latin America, whether it's Asia or whether it's Europe or even the Middle East, Safe Haven has become -- again, a lot more to do but it's becoming a known brand. So I mean, in the past, you guys have talked about advertisers just becoming more ROI-driven within uncertain times which I think benefits LiveRamp through the use of ATS, obviously providing the ability for user targeting relevant ad delivery, insightful feedback for these advertisers to justify their spend. Well, I'm so glad you asked this question because it's something that we talk about internally quite a bit. And first off, I'd just tell you, I know that there's a lot of hand wringing in the market around economic softness, we're not seeing that right now. And the good news, I'd just reiterate the fact that we're SaaS, we're subscription. I mean you could see that in the early part of COVID, for instance, when media take rate businesses were falling off the cliff, we weren't because we tend to be just as staple and have a lot of persistency or consistency with respect to our revenue model. Now the downside to that is when times get great and all of a sudden, there's a huge boom in media spend, we don't necessarily get the roller coaster ride up that some others have seen. Every time there has been a recession, the last three U.S. recessions, there has been a flight away from branded, what I would call pray and spray advertising to accountable, addressable advertising. So, I think back to a quote from one of the big travel marketers in the early part of COVID. And they said, \"Hey, LiveRamp is going to be the last thing I turn off. And sure enough, that travel marketer was back online after a brief kind of 60-day pause at the early part of COVID. One, we believe our foundations remain very strong at LiveRamp. And while we 100% take nothing for granted and would be the first to say that we still have a lot to do, we're also very confident in our guide today. And then finally, I want to invite everybody, if you happen to miss RampUp in San Francisco here a couple of months ago and you happen to be headed to Europe, we're having RampUp Paris on June 14 and we would love to have you join us. So with that, thanks to all of you for joining us and behalf of all my colleagues here at LiveRamp, we really appreciate your support. Ladies and gentlemen, this concludes today's conference call."
}