{
    "symbol": "NATR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 19:03:05",
    "content": "  Operator: Good afternoon, everyone and thank you for participating in todayâ\u0080\u0099s Conference Call to discuss Natureâ\u0080\u0099s Sunshineâ\u0080\u0099s Financial Results for the Fourth Quarter and Full year ended December 31, 2022. Before we go further, I would like to turn the call over to Mr. Brower as he reads the companyâ\u0080\u0099s safe harbor statement within the meaning of the Private Securities Litigation Reform Act of 1995 that provides important cautions regarding forward-looking statements. On the call with me is our new Chief Financial Officer, Shane Jones and I'd like to take a moment to officially welcome Shane to Nature's Sunshine and say what a pleasure it is to have him as part of our management team. Shane joined the company in December and brings over 25 years of experience, having previously served as the Chief Financial Officer at well-known companies such as West Marine, 1-800 CONTACTS and Backcountry.com. In his role as CFO, Shane will be working closely with our management team to improve performance and drive sustainable, profitable growth across the business. He's already added significant value, as we continue to take steps to mitigate external cost pressures, drive efficiency and build financial resilience into the business. Today, I'll provide some context to our fourth quarter and full year 2022 results and give some details on how we believe the business continues to develop. Turning to the fourth quarter, we continue to recalibrate and adjust to the changing macroeconomic environment and shifts in consumer behavior, but saw several encouraging signs in the quarter. Second, our business in Central and Eastern Europe continued to show signs of stabilizing, as we rewired operating practices to address the new reality on the ground and expanded our footprint to include a few new markets that helped partially offset the unique risks of doing business in that part of the world. Third, our digital initiatives continued to demonstrate strong potential to drive new customer acquisition and the integration of our Amazon business into our internal processes is expected to enhance our focus and improve performance moving forward. And finally, the product stock-out issues that slowed our business in the first half of 2022 appeared to be returning to pre-COVID levels as we saw product ability availability improve across the board. At the same time, macroeconomic and geopolitical headwinds continued to negatively impact both our top and bottom line business dynamic in the fourth quarter. Consolidated fourth quarter net sales on a reported basis came in at $103 million or $110 million when removing the impact of foreign exchange, which is a 6% decrease versus prior year. Clearly, we're operating in an extremely challenging external environment, but we believe the underlying fundamentals and strength of our brand remain firmly intact and that the steps we've taken to create more diverse consumer -- a more diverse consumer-focused portfolio will build momentum as the external headwinds subside. Looking at the full year, we reported net sales of $422 million, making 2022 our second best year in the company's history. When you adjust for the impact of foreign exchange, our 2022 sales were $445 million, which is up slightly versus prior year, again, a tremendous accomplishment given the unprecedented headwinds we faced. To be specific, foreign exchange wiped away about $23 million in sales for the year. On a constant currency basis, Asia was up 5% in the fourth quarter and 16% for the full year. It's worth noting that while China was a drag on the quarter, sales momentum increased each month as the country started to reopen. Looking forward to 2023, we believe a continued focus on targeted new product introductions, next generation branding and sustained investment in field activation will allow us to continue to drive profitable growth in Asia in 2023. Our business in Europe continued to be resilient with sales for the quarter and full year performing better than expected, due to the incredible resolve of our team in Central and Eastern Europe. For the fourth quarter, sales were down 17% and were down 10% for the full year in constant currency versus last year's historic results. Fortunately, our investment in customer growth helps support geographic penetration in new markets like Turkey and the Baltic states, partially filling the gap from lost sales in Ukraine. As we move into 2023, we believe continued stability in Central and Eastern Europe combined with strong execution of our field fundamentals will create opportunities for us to deliver modest growth in the region. In North America, orders remained relatively flat versus prior year, but the business continued to be challenged by average order declines from customers who bought about one less unit on average per order. As a result, fourth quarter sales were down 14% while full year sales were down 11%. Our investment in digital activation continued to gain traction, driving new customer acquisition and adding new members to our Subscribe and Thrive auto ship program, which now represents about 26% of sales and continued to increase versus prior year. As we move forward, we believe there's an opportunity to stabilize the North American business in the latter half of 2023 by continuing to expand our digital footprint, bringing Amazon -- bringing our Amazon business in-house, and by increasing the number of nutrition health practitioners recommending our products, thus extending our leadership position as the number one nutrition health practitioner brand. Last quarter, I invited our new supply chain leader, Martin Gonzalez, to walk you through our plans to improve gross margin with a series of initiatives designed to streamline our operations and drive out costs. Since then, we've made significant progress on our $10 million to $12 million gross savings target. It's important to note however, that the benefit of these actions won't start being reflected in our results until the end of 2023, with the material impact coming in 2024. The structural changes we're making to our product line and supply chain operations will provide significant improvements to gross margin, but many of the initiatives involve redesigning processes and revamping sourcing relationships. In the meantime, we're planning strategic price increases in Asia-Pacific, Europe, LatAm and North America to help offset the impact of inflationary headwinds and improve profitability. In challenging times like these, we believe it's more important than ever to stay focused, keep moving forward, and lean into our strategies, and that's exactly what we're going to do. As we move into 2023, we're focused on restoring growth and building positive momentum, delivering low to mid-single digit revenue growth for the year. Field energy will focus on attracting a new generation of digitally-enabled distributors, retailers and nutrition health practitioners, and digital first will focus on building customer acquisition and retention capabilities around the globe. And third, we're fighting back against the external macroeconomic environment with a roadmap that improves gross margins and overall profitability to make us more valuable and more competitive in the future. Jumping right into our results, net sales in the fourth quarter we're $102.7 million compared to $117.9 million in the year ago quarter. As Terrence mentioned, excluding the impact from foreign exchange rates, consolidated net sales decreased 6% in the fourth quarter versus last year. The decline was primarily driven by foreign exchange headwinds, increases in material production, transportation and distribution costs, as well as changes in market mix. As a percentage of net sales, volume incentives were 30.3% compared to 29.1% in the year ago quarter. Selling, general and administrative expenses during the fourth quarter declined 15% to $38.8 million compared to $45.4 million in a year ago quarter. As a percentage of net sales, SG&A expenses were 37.8% for the fourth quarter of 2022 compared to 38.5% in a year ago quarter. Reflective of the gross margin pressures, operating income was $4.2 million or 4.1% of net sales compared to $7.5 million or 6.4% of net sales. As a part of our capital allocation plan, we continue to utilize our share repurchase authorization buying 909,000 shares in a full year for $13.6 million, or an average of $14.93 per share. As a result of this event, we expect to record a one-time pre-tax charge of up to $4.8 million in the first quarter of 2023. Now turning to our 2023 outlook; so far during Q1, we have experienced a sequential improvements across most of our markets, and we expect to report sales growth for the whole year in the loads mid-single digit range. We do expect inflation and foreign exchange headwinds to continue to have a negative impact to our cost of sales in the first half of the year, but we would expect modest improvement in the second half. Despite market headwinds, most of which remain out of our control, we're very excited about and remain committed to the long-term growth opportunities for the business, and we are committed to pursuing opportunities to maximize value for our shareholders. So as I think you said the FX impact, it's kind of still there pretty negatively in first quarter, and then it might, -- it sort of would get less and negative or better as the year progressed. Yeah, I think we've built some of the strategies too, to build momentum throughout the year, just in general. No, I think we're just, again, at this point, it's still early in the year. We've got costs under control, but we got to want to get the top line moving and kind of see where the business is going from there and then we'll -- and we'll take it from there. Obviously, we'll have some growth that will add to some of that, but we will more than offset that growth with just right-sizing our -- the amount of inventory that we have because we have more than we likely should have had at the end of the year. Yeah, as I mentioned, we're starting to see some momentum come back into the business. So, as I mentioned we're hopeful that the trend line continues, but, I'm going to say it's still a bit early to tell, but again, I think we feel good that we're getting positive momentum there. So when I talk about, us getting some stability, we really are seeing that kind of type of stability where the business is moving forward, people are selling. The performance that we're seeing in Turkey and the Baltic states, at this point in time is providing, again, it's some partial -- it's partially filling the gap that we would've seen from Ukraine. Still new markets for us, but it's enough that it's actually I'd say meaningful to relative to what we were losing in the Ukraine. And then I guess just finally, I'd like to ask about North America because I guess, you're still having some declines there, and I just kind of wonder about maybe the consumer pressures still facing some inflationary pressures and things like that, and yet you're kind of talking about taking price. Yeah, that's, that's an important one, especially when it comes to taking some price there and what we're going -- what we're specifically looking at is, on some of our -- some of our specialty products, especially the botanicals where, we really kind of own some of these therapeutic areas, there is an opportunity for us to take price on some of those products. We'll be kind of looking at all of our products and all of the pricing again, just to sharpen our pencil and make certain that we're hitting relevant price points, kind of just some of the prices are -- they just -- we just landed on them and I think there's a better price point that people would be willing to pay. Again, but what's happening is as we're bringing in new customers, we're just seeing that the average orders are different than they were just 12 months ago. There are several hundred thousand health practitioners out in the marketplace that we're not tapping into right now, that would ideal kind of distributors for our product. And if I could just add on a little bit there, on the price increases in North America especially, we've been very thoughtful, very careful about the way we're doing that, and frankly, are really measuring our elasticity of demand when we're doing it. Hey, I'd like to thank everybody for listening to today's call, and we look forward to speaking with you when we report our first quarter, 2023 results in May of 2023."
}