{
    "symbol": "NATR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 14:23:11",
    "content": " Despite the extraordinary challenges in the market, we were able to deliver second quarter sales of $104 million on a reported basis or $109 million removing the impact of foreign exchange, which is slightly up versus prior year. A closer look at the second quarter results shows sales were led by exceptional performance in Asia Pacific, where we continue to see historical sales, with 19% growth versus prior year in local currency and 26% growth year-to-date. In Japan, second quarter sales were up an impressive 38% in local currency versus prior year as consumers continue to be highly engaged throughout the period. In Taiwan, the competitive nature of our top distributors continues to fuel growth as sales in the second quarter surged 164% in local currency. As a result, second quarter sales were down 5.7% on a local currency basis as the negative impact of COVID lockdown had a significant impact on the consumer's ability and willingness to spend. In South Korea, second quarter sales were down 7.6% in local currency as the market continues to rebound from the long-term effects of the pandemic and the COVID restrictions that put our business on hold for 2 years. Sales in the second quarter were down 16% on a local currency basis as consumer pessimism reached an all-time high, spending patterns changed due to inflation, and the warrant Ukraine continued to create uncertainty. Second quarter sales were also negatively impacted by an increase in the number of product shortages versus Q2 of the prior year, with less than $1 million of lost sales or about 20% of the North American sales decrease for the quarter. Finally, in Latin America, second quarter sales were down 15% in local currency, driven by product availability issues, increased macroeconomic pressures and significant social unrest that slowed sales in several markets. Year-to-date, sales are down 8% in local currency, but again, we're still on the front end of our transformation and are very pleased with the progress our new leadership team has made building talent and creating a road map to deliver sustainable growth. Reflective of the margin pressures and higher SG&A spend, operating income was $5.8 million or 5.5% of net sales compared to $9.5 million or 8.7% of net sales in the year-ago quarter."
}