{
    "symbol": "WELL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 13:54:09",
    "content": " On a same-store basis, our Senior Housing Operating portfolio revenue is up 11.2% year-over-year driven by a 4.6% occupancy growth and 4.6% rate growth. With a median vintage of 2016, we're extremely pleased with the average price of 197,000 units, which is meaningful discount replacement cost with 63% of current average occupancy this sizable deal will be dilutive to our 2022 FFO per share, but properties are anticipated to generate significant occupancy, margin and cash flow growth in 2023 and beyond on the StoryPoint's enhanced operating platform. In the first quarter, our outpatient medical business delivered 2.7% same-store NOI growth over the prior year's quarter, while occupancy declined modestly to 94.5%. And when excluding provider relief funds received in the respective periods, or $0.82 per share represents 15% year-over-year growth versus the first quarter of 2021. Underlying this FFO guidance is estimated in second quarter total portfolio year-over-year same-store growth of 8% to 10%, driven by sub-segment growth of outpatient medical, 2% to 3%; long-term post-acute 2% to 3%; Health System, positive 2.75% and senior housing triple net 7% to 8%. And finally, senior housing operating growth of 15% to 20%, driven by revenue growth of 11% and underlying this revenue growth is an expectation of approximately 500 basis points of year-over-year average occupancy increase and continued robust rate increases. We continue to be pleased by the momentum of the top line recovery in our senior housing operating portfolio, driven by a combination of rate and occupancy growth, setting the stage for a multiyear recovery to average occupancy in the portfolio at 76.4% at quarter end, nearly 1,100 basis points below pre-COVID levels and nearly 1,500 basis points below peak occupancy levels. I mean you did make the comment hearing that you expect your year-over-year same-store NOI growth to improve meaningfully in the back half of the year, which would presumably factor in higher sequential occupancy growth than what you're seeing in the second quarter. So, that probably -- these two together, probably 35%, 40% of the triple-net portfolio, and that's why you are seeing, obviously, that's why not only you are seeing, we continue to see significant sort of above average growth as long as we have average inflation that sort of in the system. And I think this is -- this will expand a bit on the comment in my opening remarks around just our continued steady allocation of capital to distressed situations, near-term dilutive, even developments, the idea that we're seeing core earnings growth that's really driving the portfolio now."
}