{
    "symbol": "WELL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 13:34:23",
    "content": " In the second quarter, our outpatient medical business sequentially increased occupancy by 30 basis points and delivered 2.5% same-store NOI growth over the prior year's quarter. Despite short-term challenges driven by COVID, the tight labor market and inflationary pressures, the portfolio delivered 15.4% year-over-year same-store NOI growth in the period, the second highest in the company's history with the U.S. portfolio generating over 20% same-store NOI growth. And lastly, health systems, which is comprised of our ProMedica Senior Care joint venture with the ProMedica Health system, which had same-store NOI growth of positive 2.75% year-over-year and trailing 12-month EBITDAR coverage was negative 0.29x as operation continued to be impacted by high agency utilization in the first quarter. Underlying this FFO guidance is estimated third quarter total portfolio year-over-year same-store NOI growth of 7% to 9%, driven by subsegment growth of outpatient medical 1.75% to 2.75%, long-term post-acute of 2.5% to 3.5%, health systems of 2.75%, senior housing triple net of 5% to 6%; and finally, senior housing operating growth of 15% to 20%, driven by year-over-year revenue growth of 10%. The next initiative that I'm focusing on in a big way or workflow really relates to capital and internal investments, what I'd call it as how we reposition the portfolio, our senior housing business portfolio age is at the absolute sweet spot, just right under 20 years old on average, providing tremendous opportunities to reposition those assets. So what you're saying is possible, but I would say probably unlikely as we are finally seeing, as I said -- I talked a little bit about that that -- our operators have been talking about the overall availability of labor is increasing in June, it feels like, again, I'm going to be very careful how I describe it because it is not that we know everything that's happening. So you saw those increases in the first quarter and what you're seeing now kind of spreading from the first quarter to the second quarter is we've talked about in this business, historically, you've seen kind of 10% or high single-digit roll-downs between move-in and move-out rates. So let's just -- I'll take the essence of your question, and there's no debate about the fact that for -- specifically for third quarter, and I mentioned this in my script that some of the growth has leaped into next year because we're not getting that growth in the third quarter. And then secondarily, just going back to my opening question about sort of longer-term and focusing on all of the initiatives and investments that you've made, I think Burkart, when you were at Essex, you've put out a three-year plan, and I remember UDR and Aimco and there was a lot of that, do you think the company would benefit a little bit about -- you have done a lot of sending out all of the impacts and opportunities to start to understand the earnings as well as the asset value, NAV, because it just feels that the market is focused to short term and you can provide a lot more details. You've dropped little things like the transition, the $120 million negative cash flow, but actually getting the details and really putting the building blocks to your three-year return based on everything that's involved, I think, would be really helpful."
}