{
    "symbol": "CYTK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 22:15:24",
    "content": " We've continued to build our teams and create a commercial infrastructure to support the potential approval of omecamtiv mecarbil in the near term, and also the potential commercialization of aficamten following completion of our pivotal trials, SEQUOIA-HCM and subsequently its potential FDA submission for approval. Building on that theme, during the quarter, we also made significant advances in the development program for aficamten, including the opening of enrollment in SEQUOIA-HCM, the pivotal Phase 3 clinical trial of aficamten in patients with symptomatic obstructive HCM. Following the positive results from Cohort 3 of REDWOOD-HCM shared during the quarter, we're now enrolling patients whose background therapy includes disopyramide into SEQUOIA-HCM, a key milestone and opportunity to include the sickest patients in need of new therapeutic options. We're also evaluating the effect of aficamten on left ventricular ejection fraction, New York Heart Association Functional Class on Cardiac Biomarkers including NP pro-BNP, we expect the data from this cohort to inform the design and conduct of a potential pivotal Phase 3 clinical trial in non-obstructive HCM following the completion of Cohort 4. Towards our goal of sharing longer term data on the treatment of aficamten in patients with obstructive HCM, we're pleased to announce that the first data cut from the open label extension of REDWOOD-HCM will be presented in a late breaking science session at the Heart Failure 2022 Meeting in Madrid. As we have said, our growing cardiovascular commercial infrastructure supportive of the launch of omecamtiv mecarbil will be leveraged for the future potential commercialization of aficamten, with increased awareness in the market of HCM and the clinical utility of cardiac myosin inhibitors, we are confident in the opportunity we have for the future potential launch of our next in class therapy. We expect to continue enrolling patients with non-obstructive HCM in Cohort 4 of REDWOOD-HCM, and we expect to begin a second phase three clinical trial of aficamten in obstructive HCM in the second half of this year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. But with the recent approval and labeling of mava seeming to suggest the importance of continued development and additional population, just curious whether it's reasonable and maybe even prudent to expect further trials even beyond a second study in symptomatic HCM, just given the fact that there are sort of a number of different populations that could see benefit. Your line is open. Your line is open. We look forward to sharing with you the open-label extension data from REDWOOD-OLE soon and also continuing to update you on our progress, both with omecamtiv mecarbil and aficamten and as we move into the second half of the year, a first interim analysis with COURAGE-ALS."
}