{
    "symbol": "CYTK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 11:19:02",
    "content": " And while we do not yet have the agenda nor specific topics of interest to FDA, we expect that FDA may want to discuss the scope of the potential indication given that GALACTIC-HF was conducted in a broad population of more than 8,000 patients with heart failure and reduced ejection fraction, but the results demonstrated that the treatment effect of omecamtiv mecarbil seems to be amplified in certain prespecified and other subgroups of patients with worsening heart failure, whether that's measured by low left ventricular ejection fraction, high NT-proBNP, recent hospitalization, low blood pressure or other measures. We look forward to providing a further update with our next earnings call and sharing data from this cohort in the first half of 2023, which if supportive, would enable the start of a potential Phase 3 pivotal trial in patients with nonobstructive HCM to occur in 2023. The remainder of the proceeds will be divided among the following priorities: one, to expand the clinical development program for aficamten, including for the second Phase 3 clinical trial in patients with obstructive HCM and a potential Phase 3 clinical trial in patients with nonobstructed HCM. We also expect to begin a second Phase 3 clinical trial of aficamten in obstructive HCM in Q4 2022, and we expect to share additional longer-term data from Redwood HCM-0LE, the open-label extension study of aficamten in second half 2022. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I mean I think the -- with the papers that have been coming out with omecamtiv mecarbil and the data that have been published with regards to EF and low blood pressure and other things, when guidelines committees consider where to it fit it in, where does it fit in, what we would hope to see would be that they would acknowledge that in patients that have sort of failed on foundational therapy, meaning that they've been put on as much of the foundational therapy as they can tolerate and yet are still not doing well and still have high-risk features such as hospitalization or recurrent hospitalization or high NT-proBNP or other things that they may consider omecamtiv mecarbil as an option. Your line is open. Your line is open. Your line is open."
}