{
    "symbol": "ARDX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 10:48:05",
    "content": " We are now 6 months into launch, and weâ\u0080\u0099re pleased to report that IBSRELA is resonating with prescribers and patients as an important new treatment option for IBS-C. We are clearly gaining traction and building momentum in this marketplace. As Justin mentioned, we are 6 months into our launch, and Iâ\u0080\u0099m pleased to report that IBSRELA is rapidly becoming established as an important new treatment for IBS-C. Net product sales of IBSRELA were approximately $4.9 million for the second quarter of our launch and nearly $7 million from launch to the end of the third quarter of this year. Success of our access strategy centers on two critical factors: one, recognition by HCPs and payers that IBSRELA addresses an important clinical need as it works in a manner that is novel versus available branded options; and two, establishing IBSRELA as a specialty drug that could easily be integrated into currently existing office procedures to secure prior authorizations needed for patients to access therapy. The fact that the pool of IBS-C patients currently under the care of high-treating HCPs have typically been treated with an existing therapy, combined with the HCP willingness to submit the prior authorization requests will continue to support a favorable patient access environment for IBSRELA going forward. HCP experience with the early patients they have treated with IBSRELA has been favorable, reflected by positive refill rates as well as some launch tracking report issued by Spherix where 42% of IBSRELA users reported moderate satisfaction, which is a rating of 4 to 7 on a scale of 10, and 58% reporting high satisfaction, which is a rating of 8 to 10 on a scale of 10. And fourth, and quite notably, we have achieved this strong start with a targeted promotional approach not seen before in the IBS-C space, but one that has proven to be highly viable given the established nature of the market today and the clinical need for new treatment options, promotions focus on HCPs managing a high volume of IBS-C patients, with demand not dependent on DTC spend and access not dependent on heavy payer rebating. Your line is now open. Your line is now open. The Spherix data â\u0080\u0093 actually, the Spherix reports have been tracking the interest in novel mechanism drug for hyperphosphatemia, the awareness level of XPHOZAH persistently over the last several years, and the very last data point published, I think it was second quarter 2022, reflects the persistent interest across the nephrology-treating community for a novel mechanism drug, for new options to address the significant challenges that they put forward in the management of hyperphosphatemia and a high level of awareness and interest in XPHOZAH. Your line is now open. Your line is now open. Your line is now open."
}