{
    "symbol": "ARDX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 21:54:04",
    "content": " Our research indicates that 56% of high prescribers consider IBS-C a difficult condition to treat, and 83% reported that there was a significant unmet need in the treatment of IBS-C. 75% of these high prescribers reported a favorable response to the IBSRELA profile, rating its novel mechanism and efficacy data as the most compelling attributes and projected use of IBSRELA in a meaningful subset of their patients. Our objective is to establish IBSRELA with its new mechanistic approach and triple acting effect as a meaningful new treatment option for HCPs who treat patients with IBS-C. Our Salesforce efforts targeted at the highest writers will be further amplified by omnichannel tactics, leveraging the rapidly advancing dynamics in the marketplace on how and where HCPs receive their information. We are thrilled to bring this much needed, highly differentiated therapy to market, and most importantly, to make a difference in the lives of patients who are suffering from IBS-C. At the end of the first quarter 2022, we had total cash, cash equivalents and short-term investments of $89.7 million as compared to total cash, cash equivalents and investments of $116.7 of million as of December 31st, 2021. And although, we are just over a month into the launch, we like the positive response we hear from the field for IBSRELA and the role that it can play in treating patients with IBS-C. Susan has built a spectacular commercial team and they're laser focused on successful execution, working to gain meaningful market share. And what we will say to them is, the treatment of hyperphosphatemia is something that's considered at a minimum monthly, as it relates to the serum phosphorus levels that are taken of every single dialysis patients at least once a month and often weekly or three times a week when they're in a dialysis session, and a dietician social worker, the staff there continue to remind them to watch their phosphorus, which is standard there."
}