{
    "symbol": "IMBI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-22 11:55:05",
    "content": " The numbers youâ\u0080\u0099re seeing are aggregated between 123tv and ShopHQ, so there is--thatâ\u0080\u0099s the first point we need to make, is that 125tvâ\u0080\u0099s units, theyâ\u0080\u0099re average--you know, when we talk about ASP or AOV, the ASP - average selling price is not even half of what ShopHQ is, and that was one of the core things that was important for us to fix at the 125tv business and their customer profile, was we need to make sure that the ASP is growing in a way in categories that they do well in, so that when we do promotional events or we do free shipping, or we engage the customer and we have to pick, pack and ship it, weâ\u0080\u0099re not doing 10 units to get to $100, weâ\u0080\u0099re doing five units or four units. Taking buildings that were a fair market value of $45 million, all four of them, and turning that into cash and deploying that cash at a higher return was obviously the answer, and so we moved into that time frame of August-September and as we had more and more inbound traffic and interest in our buildings, particularly in the Bowling Green area where, as you know, those distribution centers there are very valuable, thatâ\u0080\u0099s the one area of the country where you have all the distribution networks because thatâ\u0080\u0099s the area of the country that reaches the highest percent of customers in the U.S. in one day. When you think about working capital, thatâ\u0080\u0099s something we--as we talked about earlier, something we feel like we do well even in tumultuous times, so the year-to-date working capital increase of $5 million, we also think that weâ\u0080\u0099ll do the same type of working capital management in Q4 and that will really be driven by the inventory levels and the inventory levels will come down. If you note on our first three quarters of 2022, a lot of our working capital management was around the decrease in accounts receivable, and thatâ\u0080\u0099s been a three-year effort of ours to reduce the amount of Value Pay and what our customers use Value Pay, so weâ\u0080\u0099re--you know, weâ\u0080\u0099ve moved our percent of sales under Value Pay, which is our installment sales basis, from as high as 60, 65 down into the 50 range, so that is producing more cash up-front, something that weâ\u0080\u0099re intentional about and we donâ\u0080\u0099t believe is affecting sales either. If you think about our year-to-date performance and you say, well, I hear all that good news but year-to-date, weâ\u0080\u0099ve lost whatâ\u0080\u0099s the net income, in the $40 million range year to date, but if you break those pieces down and you think about the core business and then the below-the-line costs or the integration costs, itâ\u0080\u0099s a very compelling picture and it works something like this. We expect to see our interest alone drop in the $4 million to $6 million range, depending on the complexities of how we use the additional sale proceeds from the sale-leaseback, so all of those elements along with the core business--you know, if you peel the onion that way, you look at the elements I just mentioned, the core business is profitable today and weâ\u0080\u0099re fixing these other one-time events, so the multiplier effect of that next year is pretty significant."
}