{
    "symbol": "IMBI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-24 11:10:02",
    "content": " We decided the short term hit to the top line and the less so hit to the bottom line was worth the pain to achieve our strategic goal of increasing ShopHQ's overall profitability by replacing less profitable carriage deals. Now that being said, DISH has been a great partner of ours for over 20 years and I expect together, we will figure out agreeable renewal terms in the fourth quarter. And if we don't, then ShopHQ will find replacement carriage that does achieve its profitability targets and DISH will fill our spot with another television network. Regarding that second revenue bump, it is a consequence of our relentless focus on capital allocation and simplification or as Churchill said, out of intense complexities, intense simplicities emerge. We decided the short term hit to the top line and the less so hit to the bottom line was worth the pain to achieve our strategic goal of increasing ShopHQ's overall profitability by replacing less profitable carriage deals. Now that being said, DISH has been a great partner of ours for over 20 years and I expect together, we will figure out agreeable renewal terms in the fourth quarter. And if we don't, then ShopHQ will find replacement carriage that does achieve its profitability targets and DISH will fill our spot with another television network. Regarding that second revenue bump, it is a consequence of our relentless focus on capital allocation and simplification or as Churchill said, out of intense complexities, intense simplicities emerge. We decided the short term hit to the top line and the less so hit to the bottom line was worth the pain to achieve our strategic goal of increasing ShopHQ's overall profitability by replacing less profitable carriage deals. Now that being said, DISH has been a great partner of ours for over 20 years and I expect together, we will figure out agreeable renewal terms in the fourth quarter. And if we don't, then ShopHQ will find replacement carriage that does achieve its profitability targets and DISH will fill our spot with another television network. Regarding that second revenue bump, it is a consequence of our relentless focus on capital allocation and simplification or as Churchill said, out of intense complexities, intense simplicities emerge. We decided the short term hit to the top line and the less so hit to the bottom line was worth the pain to achieve our strategic goal of increasing ShopHQ's overall profitability by replacing less profitable carriage deals. Now that being said, DISH has been a great partner of ours for over 20 years and I expect together, we will figure out agreeable renewal terms in the fourth quarter. And if we don't, then ShopHQ will find replacement carriage that does achieve its profitability targets and DISH will fill our spot with another television network. Regarding that second revenue bump, it is a consequence of our relentless focus on capital allocation and simplification or as Churchill said, out of intense complexities, intense simplicities emerge."
}