{
    "symbol": "BMA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-25 12:44:02",
    "content": " Operating income after general, administrative and personnel expenses was ARS44.5 billion, 4% or ARS1.6 billion higher than in the first quarter of 2022 and 39% or ARS12.6 billion higher than in the second quarter of last year. In the quarter, net interest income totaled ARS53.1 billion, 8% or ARS4 billion higher than the result posted in the first quarter of 2022 and 27% or ARS11.3 billion higher than the result posted one year ago. In the second quarter of 2022, interest income totaled ARS96.1 billion, 19% or ARS15.3 billion higher than in the first quarter of 2022 and 32% or ARS23.5 billion higher than the previous year. Within interest income, interest on loans totaled ARS41.7 billion and increased 5% or ARS2 billion quarter-on-quarter, mainly due to our 350 basis points increase in the average lending rate. In the second quarter of 2022, income from repos totaled ARS699 million, 38% or ARS192 million higher than in the previous quarter and 69% or ARS1.5 billion lower than the result posted a year ago. In the second quarter of 2022 FX gains including investments in dilutive financing totaled ARS5.4 billion gain, which was 49% or ARS1.8 billion higher than in the first quarter of 2022 and ARS4.3 billion higher than the previous year, due to the Bank's long dollar position and the peso depreciation during the quarter. In the second quarter of 2022, interest expenses totaled ARS42.9 billion, 36% or ARS11.3 billion higher, compared to the first quarter of 2022 and 39% or ARS12.2 billion higher on a yearly basis. Within interest expenses, interest on deposits increased 35% or ARS10.7 billion quarter-on-quarter mainly driven by a 650 basis points increase in the average interest rate paid on deposits, while the average volume of private sector deposits increased 5%. In the second quarter of 2022, the Bank's net interest margin, including FX, was 24.5%, higher than the 22.8% posted in the first quarter of 2022 and the 18.8% registered in the second of 2021. In the second quarter of 2022, net income from financial assets and liabilities at fair value through profit or loss totaled ARS7.7 billion gain, 2% or ARS180 million higher than in the previous quarter. In the quarter, other operating income totaled ARS3.9 billion, 1% or ARS54 million higher, compared to the first quarter of 2022. In the second quarter of 2022, Banco Macro's personnel and administrative expenses totaled ARS22 billion, 22% or ARS4 billion higher than the previous quarter. In the second quarter of 2022, expenses increased 20%, while net interest income plus net fee income plus other operating income increased 7%, compared to the first quarter of 2022. In the second quarter of 2022, the results from the net monetary position totaled ARS38.2 billion loss, which was 13% or ARS4.3 billion higher than the loss posted in the first quarter of 2022, due to higher inflation observed in the quarter, which was 123 basis points above the first quarter of 2022."
}