{
    "symbol": "RITM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 09:29:05",
    "content": " Everything we do when we think about acquiring assets and/or companies is around trying to acquire these assets at book value with a view towards a real value in the underlying assets in the event that, for example, in the Caliber business, we see rates go up and the origination side go down. As we go forward, 2023 and beyond, the growth of our private funds business been running around the globe a little bit, meeting with different LPs and look forward to really developing the private credit business as we think it's going to give us the opportunity to deploy capital more opportunistically when those situations arise. Genesis Capital I pointed out before, a little under $2.5 billion of origination, love the business, love the coupons, tightened up underwriting guidelines, and we expect some really good growth here as we go forward into 2023 and beyond. Couple that with our pivot from Fortress into being internally managed, we think the private credit business is going to be a big win for shareholders, and it's going to be a big win for all of us, as we're able to deploy capital more opportunistically and have access to those large pools overall throughout the financial services landscape that we invest capital in. I mean, what I would say over the years and how long I'm doing this in some of my partners, Charles and others, managing businesses in Europe and having identified an individual to run our European business, who should come online in Q2, I think we're going to look for more situations around distressed debt, and we'll likely raise some capital around that business, more likely in private funds. But I think it's really going to be saves in and around synergies on bringing these operating businesses together, not necessarily just the mortgage company. And if you look at our track record going back to 2013 in our core business, our real returns are probably in and around 12% on a return on equity basis while paying a $4.5 billion of dividends. The other thing I would tell you about our team, and we have third-party consultants on the economic side that we meet with monthly, we have a very strong presence, I think, in the markets as we think about the macro picture, and that's something that's really, really important for us to maintain discipline in the business and make sure we try to catch both the ups and downs of where rates go and mortgages go. So I think it's really going to come down to housing turnover, if home prices cheapen up, and I think it's more likely you'll see growth in the rental markets as things are less affordable today."
}