{
    "symbol": "LULU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-02 18:25:03",
    "content": " Even with the closures, our business remained solid in the first quarter, with revenue growing double digits versus last year and growing over 60% on a three-year CAGR basis. In our digital channel, revenues increased 51% on a three-year CAGR basis and contributed $721 million of topline or 45% of total revenue. Q1 product margin included an increase of approximately 340 basis points in air freight, related to macro supply chain challenges, which was higher than our guidance of 300 basis points due to increased usage relative to our initial plans. Operating income for the quarter was $260 million, or 16.1% of net revenue, compared to adjusted operating margin of 16.4% in Q1, 2021, and inclusive of approximately 340 basis points of additional air freight expense. On a three-year CAGR basis, unit inventory increased 36% relative to 2019 at the end of Q1 and is well positioned relative to our Q2, 2022, top line guidance of a 26% increase on a three-year CAGR basis. It's important to mention that due to ocean transit times, our in-transit inventory is up relative to 2019 and is contributing approximately 5 percentage points to the three-year unit CAGR of 36%. When looking at total revenue, our guidance implies a three-year CAGR of 24% to 25%, which continues to be higher than our three-year revenue CAGR of 19%, leading up to 2020 and higher than the target of approximately 15% growth we set forth in our new Power of Three ×2 growth plan. And when looking at operating margin for the full year 2022, we now expect it to be approximately flat with last year, inclusive of the 30 basis points of incremental air freight expense I just mentioned. And Matt, I'd just add to that in terms of May, I think we're pleased with the continued momentum in our business as reflected in our 26% three-year CAGR guide for Q2. We don't -- we feel confident in our top line trend going into Q2 at a 26% three-year CAGR and well aligned with our inventory growth, when adjusting for the in-transit piece on a unit basis and have no plans to change the markdown cadence of our business as we look throughout the year. And we continue to look across our business in terms of opportunities to deliver on our five-year average target of modest operating margin expansion, obviously, navigating those near-term challenges with air freight and ensuring importantly that we continue to drive the momentum in our business through key investments as well."
}