{
    "symbol": "LULU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-08 20:20:26",
    "content": " While the adult active apparel industry decreased its U.S. revenue by 4% in fiscal quarter three '22 compared to the same period last year, Lululemon gained 1.5 points of market share in the U.S. over this time, the most of any brand in this market according to the NPD Group's consumer tracking service. In terms of inventory, we ended quarter three with dollar inventory up 85% on a one-year basis and units up 38% on a three-year CAGR basis, both metrics in line with our expectations. Looking forward, on a one-year dollar basis, we expect the inventory growth rate at the end of Q4 to begin to moderate and increase approximately 60% relative to last year. When looking at total revenue, our guidance implies a three-year CAGR of 26%, which continues to be higher than our three-year revenue CAGR of 19%, leading up to 2020 and higher than the target of approximately 15% growth we set forth in our new Power of Three x2 growth plan. And as you mentioned, we are after the first three quarters of this year, trending above the guidance of the Power of Three x2 growth plan, which we're excited to see how the brand is responding and the guests are reacting to the newness in our new guest acquisition. So we know as we continue to drive awareness behind the brand in consideration, it's having an impact on our men's business, pleased with the growth in the quarter of 28% but really just getting started in terms of the potential of more being aware of and considering Lululemon in addition to, as we continue to build out some of the assortment and unmet needs that we have around those core activities that we focused on. So with the like new, it's currently live in 50 states in an approximately 390 stores and we're not sharing specific performance details, but where we are pleased with the results we're seeing is really on twofold one, guest acquisition on the resale side, new to the brand and the opportunity to enter at a different price point. And I think as we've seen through the three quarters of this year, the decision so far has been the right decision, where others that priced up are now heavily discounting and giving away any of that perceived gain and more so and having to mark goods down where we're able to continue to sell our product at regular price, not react and our markdown performance has been in our guidance in line with what we indicated we would be from a 2019 perspective. It's a fair characteristic, but I'd also indicate when we mentioned the 10% of assortment that we've moved pricing on, throughout this year, we've looked at our new innovation and priced it accordingly relative to where we see opportunity in the marketplace."
}