{
    "symbol": "LULU",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-28 20:10:26",
    "content": " On today's call, I plan to cover several topics: our quarter four and full year results; our product pipeline for 2023; an update our membership program; our recent market share gains; and finally, insights across our international business. Our momentum continued in quarter four, with revenue increasing 30% versus last year and 26% on a three-year CAGR basis. When looking at adjusted earnings per share, we continue to deliver strong gains as well, with quarter four EPS increasing 31% versus last year and 25% on a three-year CAGR basis. In 2022, our revenue increased 30% compared to 2021 and 27% on a three-year CAGR basis. Adjusted operating margin increased 10 basis points, while adjusted EPS increased 29% and 27% on a one and three-year CAGR basis, respectively. In quarter four and full year 2022, revenue in North America increased 29%, while our international business generated 35% growth in quarter four and for the full year as well. In quarter four, revenue in China increased more than 30% versus last year and over 50% on a three-year CAGR basis. Square footage increased 21% versus last year, driven by the addition of 81 net new lululemon stores since Q4 of 2021. In our digital channel, revenues increased 46% on a three-year CAGR basis and contributed $1.4 billion of top line, or 52% of total revenue. Within North America, revenues increased 29% versus last year and 24% on a three-year CAGR basis. And by category, men's revenue increased 22% versus last year and 26% on a three-year CAGR basis. At the end of Q1, on a one-year dollar basis, we expect inventory to increase approximately 30% to 35% relative to last year. We forecast deleverage of 120 basis points to 140 basis points versus 2022, driven predominantly by increased investments to support market expansion, improve our guest experience by enhancing our omni capabilities and continuing to make foundational investments to support future growth. So we know that our approach is working as well as we know that it's going to continue to fuel our ability to acquire guests and drive the overall momentum in the business across all markets, including North America and the U.S. Our current spend is in and around the 4% range. And I would say, at the end of Q1, we're going to see inventory moderate to 30% to 35% growth, and we expect it to come in line towards the second half of the year. So we have our 15% average growth rate annually as part of that plan, with a goal to 4x international business, double our men's business, double our e-commerce business, and that also included low double-digit North America growth as well as low double-digit women and store growth."
}