{
    "symbol": "ATR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-17 14:27:02",
    "content": " Starting on Slide 3 for the fourth quarter, Iâ\u0080\u0099m pleased to report that Aptar achieved core sales growth of 4% and delivered adjusted EPS of $0.92 per share. As we identified during our third quarter call, our dispensing solutions for food, personal and home care areas that had benefited from the pandemic were experiencing a decline in sales as certain customers especially in North America, are working through the safety stock they had built up over the pandemic. For the year, Aptar achieved strong core sales growth of 9% with pharma delivering 13% core sales growth, while beauty and home's core sales were up 7% and food and beverage grew 5% for the year. As shown on slide 11, we reported fourth quarter adjusted earnings per share of $0.92, which is a 5% increase over the prior year adjusted EPS when we neutralize the currency headwinds we are facing. Pharma's adjusted EBITDA margin was 32%, which included start-up costs for the injectables division capacity expansion, and enterprise resource planning system implementation of approximately $4 million. For our 3 large capital projects, our injectables capacity expansion projects, our state-of-the-art beauty site in France and our new site in China that will service all 3 of our segments, we spent about $24 million in the quarter and approximately $108 million in the year. We anticipate our strong momentum to continue and expect first quarter adjusted earnings per share, excluding any restructuring expenses, acquisition costs and changes in the unrealized fair value of equity investments to be in the range of $0.85 to $0.93 per share. In closing, as Bob mentioned, on Slide 14, looking ahead to the first quarter, we expect the momentum to continue in our pharma end markets, especially in prescription and consumer health care as well as in our beauty end markets such as fragrance and skin care."
}