{
    "symbol": "ATR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 15:31:08",
    "content": " For a more balanced comparison, keeping exchange rates constant with the current year and adjusting for restructuring and acquisition costs, the prior year's second quarter earnings per share would have been $0.85 per share compared to our adjusted EPS of $0.96 for the second quarter of 2022. Slides 10 and 11 cover our year-to-date performance and show the 11% core sales growth in our adjusted earnings per share, which were $1.92 compared to $1.89 a year ago including comparable exchange rates. Core sales increased 10% over the prior year first quarter, with 7% of the growth coming from price adjustments related to inflation cost recovery, as well as good volume increases in certain markets. This segment's adjusted EBITDA margin for the quarter was 12%, slightly higher than the prior year and included a net negative inflation effect of approximately $1 million in the quarter, which is already on top of a very high level of inflation in the prior year. This segment's adjusted EBITDA margin was 13% in the quarter and was impacted by softer demand for food dispensing closures and the resulting lower productivity, primarily in North America, following a period of strong growth in the prior year. In closing on Slide 13, we have started to emerge from the effective COVID only to find ourselves facing new economic uncertainties, having exposure across multiple end markets such as prescription drug, beauty, personal care, food and over-the-counter pharmacy products and with the presence in 20 countries makes us more resilient to shifting cycles and downturns. Our investment in R&D as well as laboratory analytical services has positioned us at the forefront of drug delivery innovation, whether it be liquid, powder, single-dose, multi-dose and via routes such as needle, pulmonary, ophthalmic, dermal, oral or injected our broad portfolio of innovative devices components and active material solutions will enable us to grow consistently in the healthcare sector for many years to come. But we're very encouraged by the volume growth that we're seeing if you -- we talked -- I talked about the 7% of the 10% being pricing in Beauty and Home which then naturally leaves 3% for volume, but that 3% is muted a little bit by a decrease in tooling sales in the quarter."
}