{
    "symbol": "ATR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 15:50:21",
    "content": " Turning to our beauty and home segment, poor sales increased 10% over the prior year first quarter, with 6% of the growth coming from price adjustments related to inflation cost recovery. Looking at each market, core sales to the food market increased 18% due to price adjustments, and continued steady demand for food service trays, and dispensing closures for a variety of home food staples. In closing on slide 9, looking ahead to the second quarter, we expect the broad based momentum we experienced in the first quarter to continue with growth in each segment, including strong growth of our prescription drug device business, which will help compensate for lower demand for at home COVID-19 tests. Sure, let me kick off and Bob can chime in, so the war in Ukraine led to the tremendous tragedy, it is impacted three segments differently just as a reminder for everyone, before the war, we had roughly a $60 million business in Russia, and roughly half of that produced locally, the other half imported, and we continue to operate this facility Vladimir to support primarily essential customers and products in the pharma space, basic nutrition, especially infant nutrition and other essential products. And then you have the China situation – ahead of Asia in January, but because -- they're in the place and Shenzhen being lockdown, so it's just-- in one meeting in the planning, so if that continues for another two months – is everything we talked about, we see prescription accelerating, we see good demand in Europe and in the US. So yes, Q1, we – it’s a limit higher than when I would kind of project going forward, I would probably target more in that $15 million to $16 million range for corporate like we've seen in the past some of our equity awards, the accounting rules change when people hit certain substances vesting thresholds, meaning that awards which normally might have been expensed over the three year LTI period get expensed immediately."
}