{
    "symbol": "CSV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 15:20:06",
    "content": " For the full year, our total revenue reached $370.2 million, representing a decrease of only 1.5% after a high comparison driven by the peak impact from COVID related deaths. So at more perspective, our total revenue increased by $96.1 million compared to pre-pandemic levels, representing 10.5% compounded annual growth rates since 2019. Our net income for the year was $41.4 million, representing a 24.8% increase over the prior year, and a compounded annual growth rate of 41.7% from our 2019 base year. After carefully evaluating various potential partners, we're confident that there is a significant potential for growth in preneed funeral with projections indicating 30% to 40% increase in insurance sales within the first year of launching this new strategy. For the full year of 2022, we generated $49.8 million of adjusted free cash flow, a decrease of 34.2% versus 2021. While we invested approximately 60% less in maintenance and growth CapEx for the fourth quarter 2022 as compared to the fourth quarter of 2021, our year-over-year capital investments increased by roughly $1.2 million to a total of approximately $26 million for the year. To provide some context to our growth strategy, you can simply look at the last three and a half years, a time period during which weâ\u0080\u0099ve added approximately $80 million in additional revenue through acquisition. And to remind everyone, our portfolio has allocated roughly 46% fixed income, 43% equities, and 11% cash, which makes that full year positive return even more impressive, contributing to more than $22 million in financial revenue for the year. While our projected adjusted EPS for 2023 represents an impressive increase of more than 85% as compared to our pre-COVID benchmark in 2019, weâ\u0080\u0099re forecasting a decrease from last year driven primarily by increased interest payments of approximately $7 million. And so weâ\u0080\u0099re trying to have a little bit control over that, but also by being able to partner with one insurance company and maybe two â\u0080\u0093 one to three marketers, we will be able to increase strategy that shows year-over-year growth from a prearrange funeral perspective."
}