{
    "symbol": "VRT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 15:32:06",
    "content": " Our organic sales are expected to increase 15% year-over-year at the midpoint of guidance, mainly because of foreign exchange, we are raising our AOP guidance from the $730 million to $750 million we announced in October to $750 million to $800 million, now over 75% increase year-over-year. We're guiding to $300 million to $400 million in adjusted free cash flow, supported by our plan of increased profit and working capital optimization. As both Dave and Gio mentioned, there is still work to do, but fourth quarter adjusted operating profit of $211 million, was not only a record high, but a record high by about 40%. Adjusted operating profit of $211 million was below our guidance range and this was primarily due to lower-than-anticipated volume in China, which should just be timing and weaker-than-expected results from E&I. $165 million higher sales volume contributed $50 million higher adjusted operating profit, and foreign exchange, although favorable versus expectation was still a $15 million headwind versus prior year. And finally, on this slide, we generated $143 million of adjusted free cash flow in the fourth quarter, and that was $135 million higher than last year's fourth quarter. Although a strong year-over-year comparison, adjusted free cash flow was significantly below our guidance range driven by several factors, including delayed collections in China from the impact of COVID, higher-than-expected inventory as we continue to manage supply chain constraints, while managing a record high volume and also delayed receipt of advanced payments for several large orders, which were pushed into and likely spread throughout 2023. While there were puts and takes along the way, we execute it relatively consistent with the profile we presented in February and delivered sequentially improving performance each quarter improving adjusted operating profit by almost $200 million from the first quarter to the fourth quarter. And of course, our fourth quarter performance is not an end in and of itself, but it serves as a strong foundation for continued improving results in 2023 and well beyond which serves as a good segue, so moving from the rearview mirror to the road ahead, let's turn to Slide 12, which summarizes our full year 2023 guidance. Despite the recent strengthening of the euro, RMB and British pound against the U.S. dollar, we do anticipate a full year foreign exchange headwind of approximately $40 million, and that includes a $70 million headwind in the first half partially offset by a $30 million tailwind in the back half. Adjusted free cash flow guidance of $300 million to $400 million is primarily driven by higher adjusted operating profit and optimized working capital, which, as we mentioned, will be a significant focus going forward. And if you look at the $75 million use for full year 2023, we certainly assume success in some of the working capital initiatives that Gio mentioned."
}