{
    "symbol": "BPOP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 12:55:04",
    "content": " The increase was driven primarily by three factors: higher professional fees by $6 million due to higher processing and service charges; credit and debit card processing expenses were up by $4 million due to increased customer activity; and personnel costs were $2 million higher, driven mostly by profit sharing plan accruals. This brings the total average quarterly expenses for 2022 to $425 million, up from the previous guidance of $415 million. Net interest income on a taxable equivalent basis was $596 million, $47 million higher than in the first quarter. PPP income in Q2 was $5 million, down from $11 million in the prior quarter, due to lower recognition of fees upon loan forgiveness and lower balances. Excluding Puerto Rico public deposits, deposit balances grew by $255 million in the quarter. Tangible book value at quarter end was $46.18 per share, an 11% decrease, driven mostly by higher accumulated unrealized losses on debt securities available for sale of $563 million, a result of rising interest rates. In terms of capital, the transaction resulted in a negative impact to tangible book value of approximately $55 million, due to the net effect of the after-tax gain of the Evertec shares used as consideration for the transaction, minus approximately $167 million in goodwill and other intangible assets recognized in connection with the transaction, and finally, the effect of purchase accounting-related adjustments. This was driven by lower mortgage NPLs of $22 million, primarily due to the combined effects of collection efforts, increased foreclosure activity, and the ongoing low levels of early delinquency compared with pre-pandemic trends, coupled with lower commercial NPLs of $21 million, primarily due to the return to accrual status of $11 million commercial relationship. In Puerto Rico, total inflows decreased by $6 million, driven by lower commercial inflows of $4.5 million and lower mortgage inflows of $1.5 million. Net charge-offs amounted to $6 million or annualized 8 basis points of average loans held in portfolio, compared to $4 million or 5 basis points in the prior quarter. And then maybe just lastly if I heard it right, $444 million of expense quarterly guidance in the back half of the year. We're running lower than our guidance of $415, which means by definition that the last two quarters of the year, we're going to be higher anyway for us to hit that $415 million. And the other piece that addresses the increase is what Ignacio mentioned and I mentioned of the review of compensation of Popular, we've done a very comprehensive review of compensation that ended up increasing compensation expenses for something that looks like in the ballpark of $7 million a quarter or something like that, that will be fully effective starting on this quarter and the third quarter of the year and moving forward. So the average quarterly expenses are going up by $10 million, but the nominal expenses in the last two quarters would be up by a higher number, but it's just math."
}