{
    "symbol": "BPOP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 15:29:06",
    "content": " We also increased our quarterly common stock dividend to $0.55 per share, representing nearly $164 million in dividends paid in 2022. Credit quality remains strong throughout 2022. Our quarterly net income excluding the partial reversal of the DTA valuation allowance was $189 million, or $7 million lower in the adjusted third quarter net income of $196 million. Fourth quarter results were impacted by lower net interest income, which reflected higher loan income that was more than offset by the higher cost of public deposits, as well as a higher provision for credit losses. Our net interest income increased by 11% year-over-year to $2.17 billion due to higher rates, loan growth and the change in the mix of earning assets. Non-interest income increased by $254 million year-over-year, primarily driven by the impact of the Evertec Transactions. Net interest income for the fourth quarter was $560 million, a decrease of $20 million from Q3. For 2023, we expect non-interest income to continue around this $150 million per quarter run rate or approximately $600 million for the year. Excluding these items, expenses increased by $12 million, mostly resulting from a $10 million increase in technology expenses, seasonally higher business promotional expenses by $4 million, higher other processing and transactional services by $4 million, mainly due to higher network incentives received during the prior quarter and higher professional fees. Excluding Puerto Rico public deposits, deposit balances declined by $1.4 billion in the quarter, mainly from excess cash balances of corporate clients. As discussed in our last webcast, given the rapid increase in interest rates in 2022 as well as the uncertain outlook for interest rates, in October, we transferred to held to maturity $6.5 billion of U.S. treasuries in the 4 to 6-year term, thereby reducing the future impact of rates on tangible book value. To summarize our capital actions last year, we repurchased $631 million common stock or 8.25 million shares via two separate ASRs and increased our quarterly dividend by $0.10 per share to $0.55 per share. Annual book value at quarter end was $44.97 per share, an increase of $6.28 per share from Q3, driven mostly by quarterly net income of $257 million and a favorable variance of $183 million in unrealized losses on securities available for sale. In Puerto Rico, NPLs decreased by$8 million driven by lower mortgage NPLs of $10 million and lower commercial NPLs by $5 million, in part offset by higher order NPLs by $7 million. Compared to the third quarter, NPL inflows, excluding consumer loans, decreased by $3 million, driven by the U.S. health care relationship mentioned previously that was placed in nonaccrual in the prior quarter, offset in part by higher mortgage inflows in Puerto Rico. In Puerto Rico, net charge-offs remained stable, increasing by 1.5% quarter-over-quarter mainly driven by higher consumer charge-offs by $5.5 million, mostly due to the order portfolio, in part offset by lower mortgage net charge-offs by $4 million. The corporation allowance for credit losses increased by $17 million or 2.5% to $720 million, driven by changes in macroeconomic scenarios, higher loan volumes and changes in credit quality. The provision for credit losses was an expense of $48 million compared to $40 million in the previous quarter, reflecting the changes in allowance for credit losses and the net charge-off activity. In Puerto Rico, the provision for credit losses was $44 million compared to $29 million in the prior quarter. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}