{
    "symbol": "BPOP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 18:00:05",
    "content": " In the third quarter, we achieved net income of $422 million or $196 million, excluding the impact of the Evertec transactions. Our quarterly net income, excluding the impact of the Evertec transactions, was $16 million lower than the second quarter. Net interest income for the third quarter was $580 million, an increase of $46 million from Q2. Excluding the $558 million pretax gain from the Evertec transactions, noninterest income for the quarter was $168 million. This included $17 million in expenses tied to the transaction with Evertec, and the previously mentioned $9 million goodwill impairment charge related to last year's acquisition of our U.S. Equipment Finance business. Net interest income on a taxable equivalent basis was $647 million, $51 million higher than in the second quarter. Excluding Puerto Rico public deposits, deposit balances declined by $900 million in the quarter, mainly from deposits managed through our trust division. As of the end of the third quarter, other deposits were roughly $17.5 billion, an increase of $400 million from Q2. As we discussed last quarter, given the rapid shift to higher short-term interest rates, going forward, the cost of public sector deposits, which account for approximately 27% of our total deposits, will now move in tandem with market rates up with a quarter lag. Given the rapid increase in interest rates year-to-date, as well as the uncertain outlook for interest rates going forward, in October, we transferred $6.5 billion of U.S. treasuries in the 4 to 6-year maturity range from available for sale to held to maturity, thereby reducing the forward-looking impact of AOCI on annual good value. At the time of the transfer, these positions had recorded in AOCI a pretax unrealized loss of $873 million, which will effectively be amortized back into capital through the remaining life of the transfer positions at a rate of approximately $40 million per quarter to 2026, then tapering off until final maturity. Annual book value at quarter end was $38.69 per share, a 16% decrease, driven mostly by higher accumulated unrealized loss on debt securities available for sale of $782 million, a result of higher interest rates and the impact on the ASR and the dividend during the quarter. The decrease in NPLs was mainly in Puerto Rico, driven by lower mortgage NPLs by $32 million, and lower commercial NPLs by $9 million, in part offset by higher auto NPLs by $6 million. In the U.S., NPLs increased by $10 million, mainly due to an $11 million health care relationship that was placed in nonaccrual status during the quarter. Compared to the second quarter, NPL inflows, excluding consumer loan, increased by $6 million, driven by the U.S. health care relationship previously mentioned, offset in part by lower mortgage inflows in Puerto Rico. The corporation allowance for credit losses increased by $21 million or 3.1% to $703 million, driven by higher loan volumes, changes in credit quality, and an $8 million specific reserve recorded for the previously mentioned health care commercial NPL inflow. The provision for credit losses was an expense of $40 million compared to $10 million in the previous quarter, reflecting the changes in allowance for credit losses and the net charge of activity. In Puerto Rico, the provision for credit losses was $29 million compared to $9 million in the prior quarter. The quarter-over-quarter change in the ASL  was driven by loan portfolio growth and increases in specific reserves, offset in part by continued strength in Puerto Rico employment forecast and changes to the period Popular utilizes to revert its micro economic forecast of historical levels. First of all, is one that  happening, we don't have an equity pickup from Evertec anymore, and that was about $6 million to $7 million a year - a quarter, sorry."
}