{
    "symbol": "ALLE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 09:45:30",
    "content": "  Operator: Good morning, and welcome to the Allegion Q3 2022 Earnings Conference Call. I would like to turn the conference over to Tom Martineau, Vice President of Investor Relations and Treasurer. With me today are John Stone, President and Chief Financial Officer; and Mike Wagnes, Senior Vice President and Chief Financial Officer of Allegion. Our earnings release, which was issued earlier this morning and the presentation, which we will refer to in today's call, are available on our website at investor.allegion.com. John and Mike will now discuss our third quarter 2022 results, which will be followed by a Q&A session. Please, for the Q&A, we would like to ask each caller to limit themselves to one question and one short follow-up and then re-enter the queue. Allegion delivered a very strong third quarter and as we look at the market dynamics, we continue to see strength in the Americas non-residential sector. Leading indicators for that business like the ABI and AIA consensus are positive and continue to be in expansionary territory, particularly for institutional verticals. On the Americas residential side, our business grew nicely in the quarter, but we are seeing signs of a slowing market. Although Allegion International is experiencing broader weakness in many of its markets, we continue to see strength and demand for our electronics and software solutions. I do want to highlight that while we've made some progress, there's still choppiness in the electronic supply chain, backlogs, and electronics are still elevated as demand for those products has remained strong. At the beginning of the year, we underscore our commitment to aggressively pursue price across all products and in all channels. While we continue to experience inflationary headwinds, our price productivity inflation dynamic was positive this quarter, both on a dollar and margin basis. Lastly, the currency pressures impacting our international businesses persist, the reported revenues in the third quarter reflect $26 million of pressure related to foreign exchange rates. At the beginning of the quarter, on July 5, in fact, we officially welcome The Access Technologies business into the Allegion family. Together, we will deliver long-term value for customers, shareholders, and employees alike and we're already moving in that direction. The operational performance of the business was in-line with the expectations shared with you in last quarter's earnings call and our teams are getting well aligned on culture, vision, and strategy. Just as important, our early work together affirms that Access Technologies and Allegion are a great combination. This is where I get to say a picture says a thousand words, and we now have a well-established recurring service business that positions us to meet new customer needs as devices become more connected and technology advances. And we have expanded portfolio of products that fills gaps, complements our business, and takes full advantage of our demand generation specification engine in the Americas. Bottom line, Access Technologies is a strong business. Now, let's turn to Slide 6 and take a look at the quarter performance for more details. Revenue for the third quarter was 914 million, an increase of 27.4% compared to last year. The increase was driven by volume leverage in the Americas, as well as price and productivity exceeding inflation. Robust operational performance more than offset the unfavorable tax rate impact, which is compared against the prior year that had substantial non-recurring benefits. For the third quarter of 2021, reported earnings per share was $1.59 and adjusted earnings per share was $1.56. Operational results were very strong in the quarter, adding $0.49 per share, reflecting 31.4% growth. This was driven by strong pricing, volume, and operational execution, which more than offset inflationary and currency pressures. As anticipated, interest expense was a $0.12 per share drag on earnings, primarily driven by increased debt-to-finance the acquisition of Access Technologies. This results in adjusted third quarter 2022 earnings per share of $1.64, an increase of $0.08 or 5.1%, compared to the prior year. Lastly, we have a $0.34 per share reduction from adjusted EPS to arrive at reported EPS. This reduction is attributable to M&A and additional non-purchase accounting items related to Access Technologies, along with the loss on the divestiture of our Milre business in South Korea. After giving effect to these items, you arrive at third quarter 2022 reported earnings per share of $1.30. As indicated, we experienced a robust 18.6% organic revenue growth in the third quarter, driven by both price and volume. Strength in Allegion Americas, both non-residential and residential led to volume growth. Currency pressures continue to be a significant headwind, primarily impacting our international segment, bringing the total reported growth to 27.4% in the quarter. Third quarter revenues for the Americas segment was 747.2 million, up 42.5% on a reported basis and up 25.8% organically. Aided by substantial price and strong volume, non-residential grew approximately 30% in the quarter. Residential was up mid-teens, also driven by both price and volume. While it is important to note that electronic component supply chains remain choppy, our reengineering and alternate supply efforts are providing improved flexibility to our supply capabilities. This includes Access Technologies, which we previously stated, would be dilutive to margins. Excluding Access Technologies, the business drove a 300 basis point improvement in operating margins versus the prior year. Third quarter revenue for our Allegion International segment was 166.5 million, down 13.6% on a reported basis and down   organically. In the quarter, strong price realization mostly offset lower volumes. However, demand for our electronics and software solution remained stable. Third quarter international adjusted operating margins decreased 180 basis points compared to last year, and adjusted EBITDA margins were down 160 basis points. The margin decline was driven by reduced volume and FX pressures, which more than offset favorable impacts of the combination of price productivity and inflation. Year to date available cash flow is 225.6 million, which is a decrease of more than 102 million, compared to the prior year period. During the third quarter, we repaid approximately 140 million from the initial draw used to help fund the acquisition of Access Technologies. So, please go to Slide 12 and looking at our full-year 2022 outlook, and to reiterate a few things said earlier in the call, we see non-residential market demand in the Americas as remaining strong. Further, while demand for electronics products remain strong, residential markets in the Americas are indeed softening. As you've heard, the Allegion team has made significant progress on supply chain challenges, our electronics growth was strong this quarter, and we continue to navigate the choppiness of component supply. Long-term, we expect electronics adoption to remain a growth driver for Allegion. Given this backdrop, we're raising the outlook for Americas and are now projecting total growth to be between 22.5% and 23.5% with organic revenue to be up 13.5% to 14.5% for the year. However, we see the broader markets continue to soften, driven by macroeconomic and geopolitical factors and currency pressures are anticipated to remain. For the Allegion International segment, we're revising our outlook for total revenue to be down 10.5% to 11.5% with approximately flat organic growth. All-in for total Allegion, we expect revenue growth to be in the 13% to 14% range with organic revenues increasing 9.5% to 10.5%. And as a reminder, the incremental investment spend is predominantly related to R&D and technology investments to further accelerate our growth and support our seamless access strategy. The $0.20 per share increase in reported to non-GAAP adjustments from the previous outlook is driven by the loss on the mill rate divestiture and non-cash purchase accounting adjustments, which were primarily recorded in this quarter. We've made significant progress on supply chain challenges, although choppiness in electronics components persist. America's non-residential demand is still strong, leading indicators are still positive, and we continue to see strength and demand for our global electronics products. To reiterate, we see electronics adoption as a long-term growth driver for Allegion. Just wanted to begin a little bit on this, kind of non-resi backlog phenomenon, it's not really a metric you guys talked about as much, but with the growth in the quarter clearly supply chain improvement, but get some product out the door. Yes, Josh, as you know, we had built backlog starting the end of last year. And most of that driven by some supply chain, as well as really strong demand. As you look at the third quarter, we have better component availability as we talked about on the call. That helped drive more revenue in the Americas non-res at 30%, and not all of that obviously is demand. We don't disclose the exact amounts, but we did have a very strong volume growth, which we provided and that's driven by both demand being strong, as well as backlog reductions. With respect to margins, the key thing about margins for us is, we're driving that price realization to offset the inflationary pressures that we've been seeing. This quarter, we finally turned the corner on the margin percent. Last quarter, it was offsetting on dollars. So, we've made significant progress here as we progressed over the last few quarters on that element. So, it's those key items, I think that have led to the margin expansion you saw. So, that's â\u0080\u0093 there's been some cost inefficiencies over time that we've been working through and certainly that's on the way towards improvement as well, but just one other nuance there to your questions. I would say, the dynamic of price productivity and inflation will be positive moving forward. I would say, you know, going back to our comments, certainly the Americas residential market is softening. We have good products, people like them, we get good reviews. Our electronics growth, you saw, was very strong, which is quite prevalent in the residential sector, but the broader market is softening without a doubt. I think that's it, broader market softening a little bit, electronics is favorable, that's a tailwind, and yes, so we're still chugging along. Based on your results today, it doesn't seem as if you're seeing any signs of destocking, which we're seeing in some other industrial markets. I wouldn't necessarily say, de-stocking, restocking, just more normal point of sale pull-through based on retail demand. Hey, good morning and thanks for taking the questions. Ryan, if you look at Allegion, we always guide for the full-year. In July, we put a guide out there and essentially we reiterated the guide this quarter for the full-year, because we're a full-year guiding company. With respect to Q4, you can back into some math, see strength in the Americas, right, Americas top line guide implied in the high-teens. We are seeing obviously some weakness in that guide internationally, right, which we called-out. So overall, our business is seeing strength in Americas led by obviously non-res, which we talked about and seeing some softening internationally. So, I don't think there's major changes from what we told you previously, but you do have some mix between the two regions. And then for my follow-up, you mentioned progress on supply chain, but still some choppiness. Yes, that's the question of the year, I think, on fully catch up. But I would think of it like this, you know if three or four quarters ago we had like 50 suppliers on the severely delinquent list, today, that would be 7 or 8. Just to kind of quantify it for you, I think the choppiness still exists primarily in semiconductors, microprocessors. Now, the redesign work that Allegion did is obviously having benefits, we're seeing strong electronics growth. And it comes up both in terms of quantity that we need to fully meet retail demand, but then also linearity that we need to really have a productive manufacturing operation. So, that's kind of if we double click into what we mean by choppiness, I'd say this is definitely continuing on into 2023, but we're making progress and we feel good about the progress we've made. And then given the wraparound price, you should be able to get next year. Brett, with respect to next year, we'll give an outlook when we come back in Feb, I'm certainly not on the third quarter call going to get that specific of price productivity inflation. We were weaker last year, negative, got back to positive this quarter on a substantial way. Obviously, volume drives more ability to get that price because you have more revenue, but in general, we're going to fight that inflation and have that dynamic positive moving forward. And so, you're obviously working here to   that specifically on the electronic side. Yes, especially long-term, this is a great growth driver for us and that be a double-digit growth business for us as you think about the long-term. We talked about choppiness, right, but long-term, this is a double-digit growth opportunity for us. Yes, I'm not going to guide a specific quarter, but as you looked at our results for the Americas in particular, we have a pretty healthy top line guide in Q4. So, you can draw your conclusions to that particular item, but we still see strength in Q4 as indicated in our guide. And if you could just, sort of bridge from prior guide to revised guide, I mean, the numbers didn't change, but what some of the moving parts are and given the strength we saw in the third quarter, would have expected to see that that could have moved up, but if you could just talk, kind of the Americas piece, the international piece, the FX piece in terms of what moved from last guide to this one? So, Joe, if you think about FX, we actually took down our guidance in July when we reported our Q2 results for currency. So, a good chunk of the currency pressure you seeing with the dollar strengthening, we anticipated and put in that guidance that we put out in July. Currency rates have gotten a little worse since that period of time, but a good chunk of the FX pressure we called out previously. And then with respect to operations, we're right online with what we said in July for the year. Obviously, like I mentioned earlier, a little more strength in Americas as we took up the revenue outlook there, and a little more pressure from the markets internationally. And then I wanted to ask on the Americas margin, excluding Access Tech, clearly some nice progress that we saw sequentially, but when we go back to where, kind of pre-pandemic margins were, there still now appears be some good opportunity there. So, again kind of bridging to that, I mean, what are the keys to, sort of get back to those kinds of margins pretty good volume this quarter. If still from a price productivity inflation, there's room to go and you have visibility into that. If you think about the margin profile in Americas, the strong contribution margin those businesses have as we grow, we should get margin expansion. So, we think that there's margin runway for the Americas and we'll continue to drive that pricing to offset inflation with an understanding that this has been the most significant inflationary environment I've ever personally experienced and we're going to have to just combat that with pricing actions. Electrified and connected products are delivering substantially higher value to the end customer, which then should also be not just organic growth on the top line, but also a margin expansion opportunity too as electronics adoption continues. So, that's an element as well that we're really keen to continue to grow, and deliver more value to the customer. What we did share for the quarter was, they were both up pricing and volume for each segment, but the individual numbers historically we have not and don't anticipate disclosing that level of detail. I think as we said in the prepared comments, off to a great start, our teams are gelling very well. So â\u0080\u0093 and I think the early work on some of the heavy lift in terms of systems and things like this will continue for the next many months, but off to a very good start, cultural fit is very good, strategic fit is very good, the automatic doors is an excellent complementary portfolio to the rest of Allegion. Yes, it's certainly not appropriate for us to comment on that particular situation. I would say we feel good about our product portfolio, about our brands, about our competitive position in the market. I think our third quarter results reflect that that as we made the supply chain improvements, we continue to talk about, we generate good results. We've been saying for several quarters now, we were supply constrained versus demand constrained. I would say it all depends on what the future inflationary environment is, but as we sit here today, we would always communicate future price increases to the channel for an earnings call, but expect us if inflation persists, expect us to pass along pricing to mitigate that, but it all depends on the inflationary environment moving forward. This concludes our Q&A session, and we like to turn conference back over to John Stone for any closing remarks."
}