{
    "symbol": "BLKB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 13:25:35",
    "content": " The midpoint of our financial guidance ranges for this year cost for total revenue of approximately 17%, inclusive of our recent acquisition of EVERFI, a significant acceleration in organic revenue growth to approximately 5% and nearly 30% on the Rule of 40, which is roughly 250 basis point improvement year-over-year at constant currency. From a revenue perspective, we anticipate $1.085 billion at the midpoint of our guidance, calling for approximately 5% organic revenue growth at a constant currency, and our organic recurring revenue growth should be similar as we're anticipating minimal drag from one-time services and other revenue on a full-year basis. Please proceed with your question. Please proceed with your question. We do see transactions growing based on activity, the giving market super healthy grew a lot last year, so that drives our transaction side of our business quite well and we're seeing that in markets in the U.S. like non-profit and arts and cultural and we're seeing it as I've just mentioned on the JustGiving platform as well. Please proceed with your question. Please proceed with your question. So EVERFI was actually just slightly dilutive to our recurring revenue growth, they were a bit accretive on the one-time, but all of that 6% to 6.6% organic recurring revenue growth is really driven by the core Blackbaud business, which as Mike was just talking as EVERFI starts to ramp up when we start to see the impact of that should be really positive on the long-term for the business. Please proceed with your question. The Colo side as we said I think may have spoken about that in the Q4 call, but this year will be the first year we actually start shutting down some of the Colo data centers that will be a multi-year process, some of our data centers are very large, and we've got to move a lot of customers, a lot of products out of those, but we will start seeing some of the early benefits of shutting down Colo data centers this year starting to impact our margins to the positive and that's been a big drag, that's been a material drag on gross profit and gross margins over the last few years with all the duplicative costs. Please proceed with your question. All right, very helpful. All right, very helpful. The midpoint of our financial guidance ranges for this year calls for total revenue growth of approximately 17%, inclusive of our recent acquisition of EVERFI, a significant acceleration in organic revenue growth to approximately 5% and nearly 30% on a Rule of 40, which is roughly a 250 basis point improvement year-over-year at constant currency."
}