{
    "symbol": "BLKB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 11:03:02",
    "content": " Year-to-date, our organic revenue growth at constant currency also stands at roughly 5%, and our adjusted EBITDA margin was roughly 25% at constant currency. Next year, we're targeting the mid-30s on Rule of 40 at constant currency through a combination of mid-single-digit organic revenue growth and an adjusted EBITDA margin approaching 29%. So while we intend to provide our full year 2023 financial guidance on our Q4 call in February, as is our noble practice, the key point here is that we have high visibility towards accelerated Rule of 40 performance next year based on a combination of actions taken and initiatives in place that are well within our control to manage. What's important to take away from our price management efforts is that it's new to our model, multiyear in nature, benefits both growth and profit, and we have several initiatives at play some simply gets us up to competitive pricing and practices, while others are model changes that drive greater revenue for both Blackbaud and for our customers, which is a win-win, and we expect to see a high level of adoption. For example, the National Parks Foundation is connecting data across the organization to create insights and visualizations that are available at a moment's notice without manual intervention or the University of North Carolina at Chapel Hill, where the implementation of Blackbaud CRM provided new levels of transparency and allow them to focus in on key metrics and establish growth plans, resulting in annual fundraising going from less than $300 million a year to nearly $800 million in their last fiscal year, a 2.5-fold increase. We're positioned to achieve a Rule of 40 in the mid-30s at constant currency next year, which is a step-level improvement over our 2022 expectation of roughly 29%. Our year-to-date adjusted EBITDA margin of 24.9% is above our original expectation of 24% to 24.5%, which reflects the early benefits we are seeing from some of the cost actions taken in Q3, including slowing our pace of hiring and eliminating open roles. Turning to our outlook for 2022 from a revenue perspective, we believe we will end the year at or slightly above the midpoint of our guidance range of $1.05 billion to $1.07 billion despite further unfavorable movements in foreign exchange rates, continued softness in EVERFI bookings as well as our recent divestitures. Iâ\u0080\u0099ll just close by saying that we had a really solid third quarter and expect to meet or modestly exceed our financial guidance for the full year this year, and weâ\u0080\u0099re positioned to achieve the Rule of 40 target in the mid-30s at constant currency next year which is a step-level improvement over our 2022 expectation of around 29%."
}