{
    "symbol": "NRC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 09:49:04",
    "content": "  Operator: Hello, everyone, and welcome to the National Research Corporation First Quarter 2022 Earnings Call. Thank you, Seb, and welcome everyone to National Research Corporation's 2022 First Quarter Earnings Call. My name is Mike Hays, the company's CEO, and joining me on the call today is Kevin Karas, our Chief Financial Officer. Before we continue, I would ask Kevin to review conditions related to any forward-looking statements that may be made as part of today's call. For further information about facts that could affect the company's future results, please see the company's filings with the Securities and Exchange Commission. By way of sharing a few highlights at year-end 2021, we publicly announced the launch of NRC Health's Human Understanding Program, which enables health systems, our partners to deliver personalized care at scale. This past quarter, large numbers of current and prospective clients previewed and scrutinized the program. However, achieving personalized care at scale will not be instantaneous for any client organization, rather accomplished by measured deployment of the program over time, perhaps mirroring the adoption trends we experienced with our digital Voice of the Customer offering years ago. Our Human Understanding Program is an integrated offering comprised of most of our historical point solutions, with a much elevated mission-driven aspiration, that being to enable each partner organization to treat each patient as unique. Delivering that insight to empower personalized interaction for care teams at each interaction draws upon our expanded capabilities, which include delivering data across workflows and processes for care teams to optimize personal in action with patients based upon this new found insight about that person. Our growth strategy continues to focus on organic growth levers of increasing revenue from our core offerings, including our new Human Understanding Program within our existing client base as well as adding new clients to increase market share. Our TRCV metric represents the total revenue projected under all renewable contracts for their respective next annual renewal periods, assuming no upsells, downsells, price increases or cancellations, with that being measured as of the most recent quarter end. The effective tax rate for the first quarter of 2022 increased to 25% compared to 21% for the same period in 2021, mainly due to decreased tax benefits from the exercise of share-based compensation awards and higher state income taxes. Cash flow from operations was $8.3 million in the first quarter of 2022, down from $14.4 million in 2021. The company ended the quarter with a cash balance of $47.3 million, up from $43.5 million in the first quarter of 2021. The company's Board of Directors has established priorities for capital allocation with funding of innovation and growth investments, including both M&A activity as well as internal projects, as the preferred use of capital. In the first quarter of 2022, we paid $3.3 million in quarterly dividends to shareholders and $6.7 million for share repurchases. At this point in time, operator, we'd like to turn the call -- or open the call, excuse me, to questions from the group. One is our conference expenses, which those can change quarter-to-quarter, year-to-year based on timing of conferences, so that shifted some of the expense we may have seen in later periods into Q1. We'll see some increase for future conferences, but a good piece of that was timing, which won't recur as we moved some conferences in the first quarter. I mean those are decisions we make to -- as we generate additional operating income kind of in line with our capital allocation strategy, where we want to approve some incremental spending on innovation around our offerings as well as our -- some enhancements we made to our employee or associate benefit program. Going forward, quarter-to-quarter, it will really depend on decisions we make around how to allocate our capital and incremental operating income. Well, George, we typically do not give guidance on revenue growth. So, we don't really have an estimate or any kind of future growth rate that we have to share right now. I guess the reason I ask is because it seems like based on the total recurring contract value, I would have expected a lower growth rate. To some degree, when you look at our business model, as we grow contract value, the revenue growth tends to follow. So, it's not necessarily going to line up every quarter with contract value growth. The feedback that we're gaining actually is fairly universal and cuts across a multitude of customer segments, large, small, highly integrated health care systems as well as individual community hospitals. And those words, of course, differ depending on the organization, but given the fact that human understanding is a fundamental philosophy baked into most every health care organization's mission. I mean our goal is to get double-digit top line growth rates, and this program will, assuming successful deployment and implementation, this will check that box. So, we would look for a significant double-digit increase from current contract value amongst those organizations that purchase and deploy the program over whatever period of time that happens to take. So, it's -- the strategy is part and parcel of our aspirations to increase our top line growth rate. Thank you, Operator, and thank you all for your time today listening to Kevin and I's earnings call."
}