{
    "symbol": "NRC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 12:39:07",
    "content": "  Operator: Hello, and welcome to the National Research Corporation Fourth Quarter 2022 Earnings Call. Thank you, Elliot, and welcome everyone to National Research Corporation's 2022 fourth quarter earnings call. Before we continue, I'd like to ask Linda to review conditions related to any forward-looking statements that may be made as part of today's call. For further information about the facts that could affect the company's future results, please see the company's filings with the Securities and Exchange Commission. For almost 42 years, NRC Health has been committed to humanized healthcare and support organizations in their understanding of each unique individual. NRC Health's commitment to human understanding helps leading healthcare systems get to know each person they serve, not as point in time insight, but as an ongoing relationship that builds trust and loyalty. Over time, NRC Health has consistently led the industry with innovative and transformative solutions, including patient-centered care, market insights, real-time feedback, and online ratings and reviews. Revenue for the fourth quarter 2022 decreased slightly compared to the fourth quarter of 2021, primarily due to the scheduled closure of our Canadian location. Our operating income was also impacted by expense increases in 2022 due to some inflationary pressure as well as intentional resource allocation towards retaining and developing talent, solution innovation, process automation and marketing programs. Effective tax rate in the fourth quarter of 2022 was 30% compared to 23% in 2021, primarily due to the non-deductible cumulative translation adjustment. Our TRCV metric represents the total revenue projected under all renewable contracts for the respective next annual renewal periods, assuming no upsells down sales price increases or cancellations measured as of the most recent quarter end. The company's Board of Directors has established priorities for capital allocation with funding of innovation and growth investments, including both M&A activity and internal projects as a preferred use of capital. The company funded $12.2 million for innovation and growth purposes for the year-end December 31, 2022, in addition to quarterly dividend payments to shareholders totaling $21 million and $27.6 million for share repurchases. During fourth quarter specifically, we added four new organizations, two of those were new clients and two were conversion of existing customers. So at year-end, at this point, we've cumulatively reached 11 organizations have adopted the program, and about a third of those are new client additions and the other two-thirds were conversion over from existing clients. The majority, and as we mentioned, our total recurring contract value growth rate has declined this year due to lower new client sales. So, so far in Q1, there's been significantly less activity, although that's still one of the priorities from the Board. The dividend payment is always a quarter-to-quarter Board decision, but that is also one of the priorities for capital allocation. And then in terms of investment in innovation and other capital expenditures, that number will probably increase, partly because of the increased renovation expenses that we'll have in 2023 for the renovation of our corporate headquarters building in Lincoln. Thank you again, everyone, for attending today's call, and we look forward to sharing our results again next quarter."
}