{
    "symbol": "VIVO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-06 13:25:27",
    "content": "  Operator: Greetings, and welcome to Meridian Bioscience Fiscal Second Quarter 2022 Earnings Call. Please note that our SEC filings, earnings release and slides to accompany this call are available on our website at investor.meridianbioscience.com. Lastly, our Q3 fiscal 2022 earnings call is scheduled for Friday, August 5, 2022. Before we begin today, let me remind you that the presentation and the company's remarks include forward-looking statements. Forward-looking statements are subject to numerous risks and uncertainties, many of which are beyond the company's control including risks and uncertainties described from time-to-time in the company's SEC filings. Additionally, the company's remarks also include market data based on management's knowledge of the industry and good faith estimates of management. Lastly, throughout this presentation, we refer to non-GAAP financial measures specifically operating expenses, operating income, operating margin, net earnings and net earnings per diluted share each on an adjusted basis. Overall, we saw quarter with strong demand for COVID-19 products from both life science and diagnostic segments due to the Omicron variant. However, outside of sales of the COVID-19 antigen test diagnostics also saw growth in other respiratory products and enter urea breath tests for H. Pylori. As others have reported, we too saw demand for COVID-19 products subside in the last few weeks of the quarter, as one would expect as Omicron cases have decreased around the world consistent with the typical end of a respiratory season. In parallel, we are seeing laboratories and diagnostics increased focus on their core business of non-COVID testing which bodes well for a new normal in the endemic stage for the virus. In February, we completed the work necessary to bring LeadCare 2 assay back to the market six weeks ahead of schedule. As I mentioned in our last earnings call, our new Revogene manufacturing line in Cincinnati completed validation of the first line and began producing Group A strep kits. Also in the quarter, the Cincinnati team will began validation of the second Revogene assay C.diff. With regards to the new product development, you will notice in our slides some changes to the FDA submission expectations for the fiscal year. Turning to Life Science earlier this week, we announced the acquisition of EUPROTEIN, a company in New Jersey that specializes in the design and manufacture of recombinant proteins. Additionally, we expanded the sample specific master mix portfolio with the launch of the Lyo-Ready blood specific master mix and launched a new detergent free  antigen ideal for large lab based immuno-assay systems. Continuing with the format, I introduced last quarter, I would like to take a few minutes to dive deeper into our life science business in an effort to highlight the opportunity ahead of us. As a reminder, when I joined Meridian, there were two business units that made up what is today known as our life science segment, and each was run separately with different strategies. We merged these two segments into one at the end of fiscal 2018, we decided to pivot the molecular business to focus on large diagnostic companies that essentially required an overhaul of the sales team, as well as creation of an entirely new molecular product line designed for the needs of global diagnostic companies. Our R&D team focused on addressing the most clinically relevant patient samples such as saliva, sputum, blood, serum, plasma, urine and stool. In addition, we also developed master mixes to target the ag bio and food market where the sample is plant or food material. Leveraging our proprietary buffer systems and expertise and using excipient to suppress inhibitors, we set out to create a series of master mixes optimized for each of the sample types. We currently have the only portfolio of sample specific master mixes on the market and by the end of this fiscal year, we will have built out the portfolio to include mixes for all key sample types across both qPCR and lamp chemistries. Not only does this bode well for our approach, but it's also a clear signal that the focus has shifted away from building COVID assays and back to all other diseases that impact the global population year in and year out. Not only does this lower the cost of shipping and storage for our customers and their customers, but it is also more environmentally friendly, reducing the use of electricity and styrofoam. Not only did these innovations benefit our customers financially, but they enabled the development of the highest quality assays to improve patient care with the added benefit of reducing the environmental impact of diagnostic testing. And now it's my pleasure to introduce you to our new CFO, Andy to provide more details on the financial results for the quarter. As Jack mentioned, this was a great quarter not only for Meridian in total but also for each of the operating segments. Consolidated net revenues were $111 million, up 30% year-over-year and a new quarterly high for the company. Life Science also had a record quarter with net revenues of $70 million, up 32% year-over-year. This growth was driven primarily by sales of immunological reagents, particularly those related to COVID-19 testing. Limited demand in China due to lock downs, and a one-off project in the second quarter of last year that did not repeat this year. Adjusted operating expenses were 32 million, up 6 million year-over-year primarily due to increases in accruals for incentive compensation tied to financial performance in the current fiscal year. The higher operating profit for diagnostics was primarily driven by the incremental revenue generated in the quarter, and we expect diagnostics to continue generating quarterly operating profit in the quarters ahead. Adjusted diluted earnings per share were $0.66 per share, compared to $0.56 per share in the second quarter of fiscal year 2021. If you'd like to dig deeper into the drivers for the second quarter of fiscal year 2022, please refer to our press release and our 10-Q, which were both filed today. Additionally, I've been working with our operations and procurement teams to further de-risk potential supply chain issues through contractual guarantees on lead times and reliability with our key suppliers, adding additional suppliers and optimizing amounts and locations of inventories, among other things. Turning to guidance, we are raising our consolidated net revenue expectations to between $330 million and $345 million. You will notice that while we have raised Life Science guidance, we are essentially holding our expectations back for the back half of the year in line with our previous guidance. As you've heard another commentary regarding the pandemic, COVID-19 testing demand has slowed in parallel with infection rates as we exit the respiratory season. As I've mentioned before, we see COVID-19 entering the endemic phase, we believe that COVID-19 testing will continue for years to come but with higher levels of demand in our first and second quarters aligning with the typical respiratory season. While we cannot control the spread of the virus and the resulting demand for testing, remember that our reagents are in over 100 regulated assays and whenever there is demand for testing we will benefit. Looking ahead to next fiscal year, we continue to believe that COVID-19 has become endemic and we will see increases in cases and testing aligned with the respiratory season annually. While we did not expect to repeat the record level seen this year the adoption of our master mixes for uses beyond COVID-19 testing coupled with strong growth of our blocker products and other non-COVID immuno-assay reagents gives us confidence that we have an ongoing life science business with revenues believed to be approximately $150 million and generating operating margins of at least 50%. Diagnostics has shown signs of returning to growth and profitability and with both businesses performing strongly again, we're bullish on Meridian’s future in the post-COVID world. Please proceed with your question. For the first question, I know it gets a little bit of guidance for long-term in life sciences segment. It looks like in the back half of this year, you're kind of annualizing 130 million in the second half. And then on the diagnostics business, I know we didn't really kind of guide to the second quarter, but it looks like you  about 7 million but kept the guide flat. But just wondering what's going on in the back half of the year, because that still kind of looks conservative. So our diagnostic business, we're at about 74 million at the midpoint of the year. And the way we look at it, Dustin, first of all, is that we have some elements of seasonality in our diagnostic business. But we certainly have a stronger respiratory season, typically in our diagnostic business. So we do feel that the guidance we have we're holding it for the year, we think that it's on track for that. But high 30s types of quarters is kind of what we see in these Q3, Q4 types of quarters going forward. What you're seeing in the landscape right now for other deals, especially in the life sciences segment, where it seems like the market is particularly fragmented. So we've over the last three plus years, we've really worked to build a more consistent approach to M&A. It's a small bolt-on situation for us, but it's a technology enhancement that's going to really help us in our business. We do have a continual funnel that we're looking for in the life science, whether it be small bolt-ons. Please proceed with your question. So first of all, on the life science side of things, as you guys know, as we move into the endemic phase, we're going into a new phase on the life science side of the business. So for us, it will be harder to predict what happens with the COVID part of our business because we're not exactly sure what will happen in the endemic environment. But for us, there are some key things that we're doing on the life science side. Looking at non-animal derived products over time or something that we're working on as well, to move to more recombinant in general and moving away from native antigens. So we see strong growth in our life science business, clearly from the master mixes that we have, as we worked to get them into more and more assays, non-COVID related assays. We're actively working with our customers to make sure that they're up and running, again, that they're utilizing the technology. And so for us, it's about what can we produce in the near term, but ultimately going back to focusing on the organic growth. Andy also mentioned the urea breath testing, that is a huge area for us. So you have other forms of testing, like we talked about, that we can convert over to urea breath testing that we think can provide continual tailwind, if you will, to that business. Look, I will tell you this, we're excited about both businesses. And thankfully, we invested heavily in diagnostics over the last couple of years, even when we knew the business was going to suffer during COVID."
}