{
    "symbol": "TRMK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 13:13:03",
    "content": " Excluding the litigation settlement expense, Trustmark's net income in the fourth quarter totaled $41.5 million, or $0.68 per diluted share, and $147.5 million for the full year 2022, representing diluted earnings per share of $2.40. At December 31, loans held for investment totaled $12.2 billion, an increase of $618 million linked-quarter, and $2 billion or 19.1% from the prior year. Deposits totaled $14.4 billion, an increase of $12.5 million from the prior quarter, and a decrease of $650 million or 4.3% year-over-year. Net interest income totaled $150 million in the fourth quarter, an increase of $11 million or 7.9% linked-quarter. Non-interest income totaled $45.2 million, and represented 23.6% of total revenue in the fourth quarter. Non-Interest expense in the fourth quarter, excluding the litigation settlement, totaled $130.5 million or 3% increase linked-quarter. Turning to Slide 4, loans held for investment totaled $12.2 billion as of 12/31, an increase, as Duane mentioned, of $618 million linked-quarter, or 5.3%, and $2 billion or 19.1% for the prior year. Looking at deposits on Slide 9, deposits totaled $14.4 billion at December 31, a $12.5 million increase linked-quarter, and a $650 million decrease year-over-year. Turning our attention to revenue on Slide 10, net interest income FTE increased $11 million linked-quarter, totaling $150 million, which resulted in a net interest margin of 366, representing a linked-quarter increase of 16 basis points. During the fourth quarter, we continued implementation of the cash flow hedging program to manage our asset sensitivity by adding up $150 million notional of interest rate swaps, with a weighted average maturity of 4.1 years, and weighted average receive fixed rate of 3.64%, which brought the portfolio notional at year-end to $825 million, with a weighted average maturity of 3.4 years, and a weighted average received fixed rate of 310. Turning to Slide 12, non-interest income for the fourth quarter totaled $45.2 million, a $7.4 million linked-quarter decrease, and a $16.8 million decrease full year. Service charges on deposit accounts totaled $11.2 million in the fourth quarter, a linked-quarter decrease of $156,000, while increasing $8.9 million or 26.8% full year. Bank card and other fees totaled $8.2 million in the fourth quarter, a linked-quarter decrease of $1.1 million, while increasing $1.4 million or 4.2% full year. Mortgage loan production totaled $391 million in the fourth quarter, a decrease of 23% linked-quarter. Adjusted non-interest expense was $129.8 million in the fourth quarter, a linked-quarter increase of $4.3 million or 3.4%."
}