{
    "symbol": "TRMK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 13:58:04",
    "content": " At June 30th, loans held for investments totaled $10.9 billion, an increase of $547.7 million from the prior quarter and $792 million from the previous year. Deposits totaled $14.8 billion, a decrease of $343.1 million linked-quarter and a $138.1 million increase from this time last year. Revenue in the second quarter totaled $165.9 million, a $12.5 million or 8.1% increase from the previous quarter. Net interest income totaled $115.6 million in the second quarter, an increase of $13.2 million or 12.9% linked-quarter. Non-interest expense in the second quarter totaled $123.8 million, a 1.8% increase from the prior quarter. Loans held for investment, excluding PPP loans, totaled $10.9 billion as of June 30th, an increase as Duane mentioned, $548 million linked-quarter, or 5.3% and $792 million or 7.8% from the prior year. Deposits totaled $14.8 billion at June 30th, a $343 million decrease linked-quarter and a $138 million increase year-over-year. Net interest income FTE increased $13.2 million linked-quarter, totaling $115.6 million, which resulted in a net interest margin of 2.90% that represented a linked-quarter increase of 32 basis points. Higher loan yields contributed about $7.3 million of lift linked-quarter, while higher average loan balances contributed about $2.2 million of increase. The balance sheet remains well positioned for higher interest rates with substantial asset sensitivity driven by loan portfolio mix with 47% variable rate coupon, the securities portfolio duration of 4.3 years and cash and due balance of about $700 million. During the quarter, we deployed nearly $800 million of excess liquidity via loans held for investment growth of $548 million and securities portfolio growth of about $235 million. Non-interest income for the second quarter totaled $53.3 million, an $862,000 linked-quarter decrease, and a $3.2 million decrease year-over-year. Service charges on deposit accounts increased $775,000 linked-quarter and $2.6 million year-over-year. Insurance revenue totaled $13.7 million in the second quarter, a linked-quarter decrease of $387,000 and a $1.5 million increase year-over-year. Wealth management revenue totaled $9.1 million in the second quarter unchanged from the prior quarter and a $200,000 increase year-over-year. Mortgage banking revenue totaled $8.1 million in the second quarter, a $1.7 million decrease linked-quarter and a $9.2 million decrease year-over-year. Mortgage loan production totaled $681 million in the second quarter, an increase of 25% linked-quarter and 8% year-over-year. Retail production remained strong in the second quarter, representing 82% of volume or about $560 million. Adjusted non-interest expense was $122.4 million in the second quarter, a linked-quarter increase of $1.8 million or 1.5%. Salary and employee benefits expense in the second quarter totaled $71.7 million, a $2.1 million increase from the prior quarter, mainly due to increased commissions and annual merit increases. You wind up with quarter-over-quarter gain on sale, if you look at Slide 13, the gain on sale of loans net of about $6 million, I would anticipate that over the next couple of quarters, that will probably be about the level that we'll see."
}