{
    "symbol": "BBWI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 10:11:34",
    "content": " At this time, I would like to welcome everyone to the Bath & Body Works Second Quarter 2022 Earnings Conference Call. I would now turn the call over to Ms. Wendy Arlin, Chief Financial Officer at Bath & Body Works. Welcome to Bath & Body Worksâ\u0080\u0099 second quarter earnings conference call for the period ended July 30, 2022. As a matter of formality, any forward-looking statements we may make today are subject to our Safe Harbor statements found in our SEC filings and in our press releases. Joining me on the call today are Executive Chair of the Board and Interim CEO, Sarah Nash; and Brand President, Julie Rosen. Thanks, Wendy, and thank you, everyone, for joining the call today. The more time I spend in the day-to-day operations of the business, the more I appreciate the talented and experienced management team who lead this business. First, let's start with our second quarter results. This was driven by improvements in both sales and expenses in the second half of July as we closed out the quarter, which enabled us to report earnings of $0.52 per share. During the month of June and during our semiannual sale, we saw a deceleration in traffic trends as compared to our first quarter. Although our customers love our sale, they love our newness more. So as we entered July, we listened to our customers and took action to deliver the newness that they were looking for. Accessories are a large part of this collection, and customers are loving how they pair with our spooky sense for ghoulish fun. Our nimble, vertical supply chain enabled us to quickly react to customer want. We also launched our new Poppy floor set in July, which included our notable fall sense. This week, we successfully launched the program to our associates with significant enthusiasm, and we can't wait to launch across the country next week on August 22 and to invite our base of approximately 60 million customers to participate. We have numerous incentives and fun programs in place to encourage the buzz and enrollment, and they are dressing up for the occasion. In our test markets, we saw that our Loyalty customers have higher spend and retention rates than our average customer. We look forward to enrolling a significant number of our customers in the first year as well as attracting new customers, capitalizing on enthusiasm for the brand and helping drive the growth of our customer base. Now, a little bit about our positioning of Bath & Body Works for the future and some changes in our organizational structure. As we look to the back half of the year, we are investing in our customer experience, looking to chase winners and taking action to better position the business to drive future growth and improved profitability. We are proactively working to combat the inflationary pressures by challenging ourselves on expense management and working within our supply chain to decrease costs where possible, all without compromising quality and our focus on the customer, something we will never do. As part of our effort to more strongly position the business, we reviewed our operating structure and saw areas where we could streamline and simplify along with enhancing our omnichannel approach. Julie Rosen now has responsibility for the entire customer experience, including design, merchandising, marketing, planning, and the channel. We do not plan to fill the Chief Operating Officer role, and Chris' responsibilities have been absorbed by Julie Rosen, Wendy Arlin and Tom Mazurek. With these changes, we are confident that the organization will be more effective and efficient going forward in addition to delivering a true omni experience for our customers. By shifting areas of responsibility and changing how our teams work together across the company, we will be operating like the truly global omni-brand that we are. Taken together, we expect these organizational changes and additional cost control and margin improvement actions will generate savings of approximately $30 million in the second half of 2022. We will be taking meaningful actions to address the merchandise margin, and we are focused on pricing, promotions and assortment. Everyone, including those departing the business, has worked so very hard to position Bath & Body Works for great things in the future. Over time, I see exceptional opportunities to capitalize on Bath & Body Works' existing strength, including our agility, our speed, our innovation and our customers love of our brand. First, for the second quarter. As Sarah said, we exceeded our revised earnings guidance for the second quarter. In US and Canadian stores, first quarter sales were $1.16 billion, a decrease of 6% compared to last year. Second quarter direct sales were $367 million, a decrease of 10% compared to last year. Our customers love and are continuing to take advantage of our omni-focused option of buy online, pick up in store. We ended the second quarter with BOPIS availability in more than 1,200 stores, which is 500 more stores than we had just a quarter ago. For the third quarter of 2022, we expect sales to decrease between mid to high single-digits compared to the prior year. We are forecasting third quarter earnings from continuing operations per diluted share between $0.10 and $0.20, which includes an estimated $6 million expense for the previously announced and mentioned organizational changes. For the full year, we are forecasting sales to be down mid to high single-digits compared to 2021, in line with our most recent guidance. Total inventories ended the quarter up 33% compared to last year, in line with expectations. Approximately one-third of the unit growth represents planned accelerated receipts to generate capacity during the third quarter peak period, enabling our agility in the back half. The balance of the unit increase relates to certain categories, including body care and soaps, where we were lean in the prior year and a strategic investment in gifting and accessories. In summary, our guidance reflects a prudent outlook on the back half of the year, as the environment remains dynamic and uncertain. We, of course, will be looking to chase sales upside, maximize margin dollars and maintain a disciplined focus on expenses. I'm excited, as we enter the second half of the year. I'm thrilled to be leading this customer-focused organization, with merchandising, marketing, planning and the channels all under my purview, we will be able to put the customer at the forefront of everything we do. For the second quarter, we were able to deliver newness, innovation and trends that really resonated with our customer. Our single fragrance launch, Poppy, was a notable success, our best selling July singles fragrance launch ever. You might recall, we had another single fragrance launch success last quarter with Butterfly. We know how to leverage our product, innovation capabilities and combination with our unique ability to introduce fragrance throughout the shop in every category: body care, home fragrance, soaps and sanitizers. Increasingly, we plan to leverage the fact that we own the entire shop and have the unmatched ability to bring fragrance to many facets of our customers' lives. Soaps continued to perform well during the second quarter and benefited from the exciting July launch of our cleansing formula gel, which is formulated without paraben, sulfates or dyes and in a PCR bottle. Men's continue to outpace our shop, as our Father's Day collection of Hero, Sport and Legend were all very successful. I've mentioned it before, but just to reiterate, men's is a huge opportunity for us. As a reminder, we delivered $400 million last year, and we believe we can double that business. We've had robust testing in stores right now on antiperspirant deodorant in about 600 stores, and we're very excited to roll this form to all stores in spring of 2023. Our Pride collections performed well and was an opportunity for us to partner with nonprofits, including The It Gets Better Project to support the LGBTQIA+ community. Halloween, which launched in mid-July was incredibly well received and drove both traffic in stores, in sales, in stores and online. Halloween is led by decor with our accessories and wallflowers categories, where we saw success in our eyeball water globe and a distortion to our now famous, Witchâ\u0080\u0099s Hand. These items are prime examples of our strategic investment in gifting and accessories, where based on customer demand, we believe there's a greater opportunity. As we look forward to the call and a little teaser, we're excited to be launching a new innovative brand an exciting new product. In closing, we are navigating the current environment and taking aggressive actions to capture new opportunities and drive future growth. As always, we continue to focus on maximizing our performance by leveraging the strength of our brands, maintaining close connection to our customers and delivering compelling products and experiences at a great value. At this time, we'd be happy to take any questions you may have. There are a lot of outsized SG&A pressures this year, seem to be particularly accelerating in the third quarter. When you look at our SG&A, blend -- basket of costs, about two-thirds of our SG&A expenses are store selling and related expenses. So, as we think about that, we do obviously try and flex store selling up and down with sales. So you'd expect, as you think, look out that we would see low to mid increases in that overtime as we invest in our store associates. In terms of the change between Q2 and Q3, which you're alluding to, we are this fall, the fall is a very important time for our stores. So, as you compare Q2 to Q3, the store selling change represents us making a very thoughtful investment in our store associates as we go into that key time period. The other piece, the second biggest piece of SG&A is home office and as we said in our remarks, when you look at the home office expense in Q2 as compared to Q3, there's a couple of things to note. Number one, as we called out in our remarks, in Q2 LY, we are lapping about $20 million of some corporate and legal-related expenses that we incurred pre-spend that we did not have this year. So, that's a key difference when looking at the rate between Q2 and Q3. The other thing to note in between the difference between Q2 and Q3 is due to business performance in the first half of the year, our bonus expense was de minimis in Q2. And then the last piece, I think I would point out in terms of the difference between Q2 and Q3 is that in the technology expense that we talked about in our last call is a little bit back half weighted as we ramp up the separation work that we've talked about. So, you can think about that of the incremental spend that we talked about last call, roughly a third of it was front half of the year and about two-thirds of the back half. The other thing I would point out on SG&A, as you -- in terms of your question in terms of the future years. Marketing depends on the time period, but we generally shoot to spend about 2% to 3% of sales on marketing expense. We noticed that 2Q gross margins were under pressure, but remained above 2019 levels, while the second half gross margin guide implies a material decline versus 2019. This is despite similar AUR, mid-single-digit decline embedded in the plan and we're looking at slightly less inflation. So, yes, so as you've seen in our models, we do have a deceleration in the gross profit when you compare Q3 to Q2. And also, as you point out, our AUR assumption for Q3 and Q2 is about the same, so down mid-single-digits in Q3. So, in terms of what accounts for the drivers, about two-thirds of the sequential change, what you're asking about, is due to the merch margin rate. Lots of items in the merch margin rate, but the item that I would point out to be the most significant driver is the impact of the Loyalty program, which we're super excited to launch next week. So, as we've talked about, when we launch it and our customers accumulate points, we do book a revenue deferral related to the points accumulation. And as we're rolling that nationwide next week, we will have an impact in 3Q that you didn't see in Q2. Then I would say though after that merch margin is about two-thirds, the balance is B&O expense deleverage, also a lot of things in the details there. And then the second thing is consistent with SG&A, our buying organization is in gross profit in that line in the P&L. And consistent with the SG&A part of the organization, we had no bonus in Q2, and we are planning a par, so to speak, in Q3. And then you're referencing it, I mean you guys have a really nice cross-section of the US population. Yes, maybe I'll take that, Julie can add. So from an AUR standpoint, we have consistently and in Q2 as well, we consistently to see AURs at around the 20% higher than they were in 2019. And then, Julie, I'll go to you for the high versus low the income question. So we are seeing pressure, Simeon, in our lower income customers spending less. That being said, it is very clear to us that our customer comes to us for fashion trend and newness. And if they love it, they're going to buy it. Madison, weâ\u0080\u0099ll take the next question. Keep in mind, though, we're only two weeks in, in the month of August. And we think that we're well positioned, but we also think that our guidance is prudent given the quarter to come. Madison, next question, please. Also, the review that you're undertaking seems fairly comprehensive. So right now, we are definitely focused on winning in fall and winning at holiday. Of course, we're trying to expand our merchandise margin. But as we're doing this comprehensive review, we do see the potential for more improvements in 2023 and beyond as opposed to the short term. We're looking at pricing, promotion. We would, of course, would like to see some deflation in our cost base. So many initiatives in the business are ongoing focused on improving the merch margin rate, and we do anticipate seeing many of those come to fruition in 2023. So obviously, we are constantly evaluating our ticket prices as inflationary and macroeconomic costing pressures continue. We have taken a good, better, best approach in many of our categories, which we haven't necessarily had in the past as opposed to a single price point for each form. We have also increased prices in body care, where we have reformulated and better-for-you formula. And I know you all know, but we continue to have a robust testing agenda where we're constantly testing alternate pricing ideas to see really where we can garner more gross margin dollars. Obviously, based on the anticipated savings from the role reduction, it looks like fairly senior positions. As we mentioned, and as you have pointed out, our focus was primarily on leadership position. First of all, we've been a public company for a year. So over the last year, we've been settling in as a public company and thinking about how to run the organization and what makes sense. And we did a lot of combining teams, in particular, under Julie's leadership to really think about the customer as one customer and to think about us using one voice to the customer and thinking about inventory across all of our channels consistently. So it's truly a reorg to focus us to be nimble for the future, and continue to grow as an omni-focused organization. And Wendy, I think you mentioned that the $6 million one-time cost for the restructuring is included in your EPS guidance. Stephanie, I'll take the second part first, and then I will go to Julie for the customer question. I mean, as we all know, we had explosive growth in our customer file during the pandemic. So in 2019, we had about 53 million customers, and we got upwards of 60 million during the pandemic. And I am thrilled to say that, we have lost very few customers. So we feel that while we grew our customer base, they're still coming back. And with the addition of this loyalty program that we'll be launching next Monday, live, I think that the opportunity to get the $60 million of roles in the program, and incredibly loyal will only reap great benefits for us in the back half. Susan, your line is open. So, the story of the second quarter was interesting. So we started out in May, performing consistent with our guidance at the beginning of the quarter, and it was generally performing as we expected. And then when we turned to the month of June, starting in early to mid-June, we started to see a deceleration in traffic, in particular, in our stores. Semiannual sale is a key event for us to get our inventories clean, and so we did promote in semiannual sales to move our backward-facing old units, and we successfully cleared those units through SaaS. Now, when we flip the calendar into July, we knew that the customer was potentially getting tired of SaaS and wanted newness. And so as you heard us talk about it earlier this morning, we had a newness launch with a new favorable old fragrance launch with Poppy, and we accelerated our Halloween collection and those two items of newness along with the balance of shop showing new, resulted in an improvement of trends in July as compared to what we saw during semiannual sale. And while they are slightly price-conscious, they still want fashion trend in newness, and we deliver that for them. And we will be, as usual, delivering new themes, single-fragrance launches and ideas every four to six weeks, but you will see other drops basically every week just to get that excitement and to garner more traffic. And then, Wendy, I guess, maybe just high level. So, I mean, I think that traffic was a bit up and down in the quarter. I think that where we saw traffic softening, as we have said, is during our semiannual sale. I think that, we have always put a semiannual sale that was anywhere from 28 to 35 days. This sale, quite frankly, was 30 days, so not longer than in past, but the customer got tired of it. So we're finding that when we have the right deal, the right product, fashion trend and newness, we get the spikes in traffic. Which is why, as I just mentioned, we're going back and looking at how we're delivering all of our drops to ensure that we're garnering the most traffic possible, as well as offering the right deals that hit the right mindset. And Matt, to the second part of your question, I would say, it's upper teens to 20. Dana, we will go to Julie for your question on Halloween and the cadence throughout the back half on activity. The thing to note is this year, we had planned two drops with Halloween. As I mentioned, we will be delivering every couple of weeks a new idea, whether it's a cross-category single fragrance launch or whether we deliver our best in fall with our favorite fall stand, an early Christmas preview, so we have a lot of ideas every couple of weeks to spark newness and excitement. So we are not worried about that because as you know, we're about to go into Q4, which is our largest quarter, as Wendy likes to say, the Super Bowl of our...\n Of quarters. So we feel like we're covered with many not only great themes, ideas in single fragrance launches, but the sense and the effective spaces that our customersâ\u0080\u0099 love from us and expects to find. So for Q3, we are expecting our AURs to be down mid single-digits, which is consistent with what we saw in Q2. And the reason is because in Q4, we -- because there are so many huge days for us, as an example, Candle Day is a huge event for us. On those huge days or those huge weeks were -- just given the nature of the quarter, we're not planning to go down AURs in many of those promotions. Our next question comes from Jonna Kim from Cowen & Co. Jungwon, your line is open. And maybe, if there are things that change now versus 2019. So we are -- even though we are planning to be more promotional compared to LY, our promotional levels in the back half will still be substantially less than they were in pre-pandemic time periods. I mean, I think from a promotional situation, the thing to focus on is that based on pre-pandemic, our AUR is up. So we are winning on key event weekends, and that's really what we're focusing on, how big can big be, and how do we win even bigger. Madison, I think we have time for one more question. I mean, you mentioned that's taking about 10% out of the digital demand. So I'm putting that back in, it does seem like maybe digital was a bit stronger than the numbers suggest. Right now, in the US, we're basically in every store where we want to be. And in many cases, our store associates are able to convert them to buy even more goods when they come into the store. So, we think that BOPIS, not only is it a great omni initiative for our customer, we think it's also great for us because we're able to get them to experience the store and our associates are fantastic at converting them to buy even more stuff. In terms of where that's going to settle out, we'll see. We just rolled 1,200 stores this we know it's right for our brand and over time, we will see where that shakes out in terms of percentages."
}