{
    "symbol": "BBWI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 13:10:09",
    "content": " At this time, I would like to welcome everyone to the Bath & Body Works Third Quarter 2022 Earnings Conference Call. I will now turn the call over to Ms. Wendy Arlin, Chief Financial Officer at Bath & Body Works. Good morning and welcome to Bath & Body Works third quarter earnings conference call for the period ended October 29, 2022. As a matter of formality, any forward-looking statements we may make today are subject to our Safe Harbor statement found in our SEC filings and in our press releases. Joining me on the call today are Executive Chair of the Board and Interim CEO, Sarah Nash; and Brand President, Julie Rosen. Additionally, the results represent results from continuing operations and exclude the discontinued operations related to Victoriaâ\u0080\u0099s Secret. Thanks, Wendy and thank you everyone for joining the call today. We are pleased to have delivered EPS of $0.40, double the high-end of our guidance range. Given the strong bottom line results, we are raising our full year EPS guidance to $3 to $3.20 from our prior guidance range of $2.70 to $3. Our sales for the quarter were at the high-end of our expectations and reflected our teamâ\u0080\u0099s closeness to our customer, our focus on innovation and newness, and our success in leveraging our vertically integrated supply chain to chase key winners. We are excited about the potential of this program as our loyalty customers spend more, visit us more and have significantly higher retention rates than those not in the program. We continue to take rigorous actions to improve profitability, including proactively revisiting our promotions and pricing plans as well as product costing to improve merchandise margins. Additionally, we are actively working with our vendor base to streamline operations to combat inflationary pressures and improve product cost without compromising our focus on quality. We have also implemented several expense reduction actions during the quarter, including optimization of corporate overhead and store selling expenses. Before I turn it back to Wendy, Iâ\u0080\u0099d like to share my perspective on our recent CEO announcement and the companyâ\u0080\u0099s overall positioning. Gina brings more than 30 years of experience, including leadership roles at global companies such as Unilever, Alberto Culver Company and The Estee Lauder Companies. She has deep expertise in sales, marketing, brand building and business development and strategy, along with strong operational experience and a demonstrated track record of delivering successful business outcomes. During my time as Interim CEO, I have been impressed by the talent and dedication of the Bath & Body Works team. For the third quarter, as Sarah said, we reported EPS of $0.40. These better-than-expected results compared to our guidance of $0.10 to $0.20 per share were driven primarily by a better margin rate due principally to category mix and transportation expense favorability, together with SG&A expense favorability. In U.S. and Canada stores, third quarter sales were $1.18 billion, a decrease of $60 million or 5% compared to last year. Third quarter direct sales were $345 million, a decrease of $24 million or 6% compared to 2021. Customers continue to choose our omni-focused option of buy online, pickup in store or BOPIS. We ended the third quarter with BOPIS availability in more than 1,280 stores. For the fourth quarter of 2022, we expect sales to decrease between mid single-digits to low double-digits carried to 2021 sales of $3.027 billion. For the full year, we are forecasting sales to be down mid single-digits compared to $7.9 billion in 2021. Our full year guidance contemplates inflationary costs, totaling $220 million to $230 million and the estimated revenue deferral impact from the loyalty program rollout of approximately $40 million. Total inventories ended the quarter, up 10% compared to last year, better than expectations. The finished good unit increase relates to categories that were very lean last year, particularly soaps and body care. At the same time, we continue to be strategic about the investments we make to support the growth of the business, including investments in products, technology and omni capabilities. For the third quarter, we saw customers responding well to our iconic fall sense in multiple forms, fragrances and packaging. Our top fragrances such as Weave, Pumpkin Pecan Waffles and Sweater Weather in multiple categories and forms, continues to be a unique point of differentiation for the brand. Our menâ\u0080\u0099s business continued to significantly outpace the shop as we test new forms and merchandising ideas to further fuel this growing business, including through the launch of Leather & Brandy and Coffee & Whiskey. In the fourth quarter, we launched After Dark, a new single fragrance for the menâ\u0080\u0099s business. Soaps also continued to perform well, outpacing the shop as we continue to expand our new formulation that is made without parabens, sulfates or dyes. As expected, we continue to see a shift out of our sanitizer business, which accelerated during the pandemic. As part of our effort to focus on customer and deliver on innovation and newness, we launched our aluminum vessels and soaps this past quarter and expect to begin testing cartons that will enable our customers to refill their soap containers in 2023. In menâ\u0080\u0099s, we introduced antiperspirant deodorant, which is already in 650 stores and will roll to the balance of chain in the spring of 2023. We also recently launched a test of MOXY, our new line of face and hair care products and dietary supplements, online and in 11 stores. As we further expand our loyalty program and introduced compelling new product assortment, we are confident that we will continue to deepen our relationships with our existing customers and attract new customers to our brand. At this time, we would be happy to take any questions you may have. As a reminder, in the interest of time and as a courtesy, please limit yourself to one question. Your line is now open. Thank you so much. So as we look back on Q3, what we saw during the course of the quarter was that the customer really did respond to promotion. On the days that we were incrementally promotional year-over-year where we had sharp price points or compelling deals, those days outperformed. And on the days that we were flat to last year or less promotional, those days underperformed. So for us, the story of the quarter was really promotion and meeting the customer where their mindset is. Clearly, the customer is very price sensitive. So in terms of November, our guidance is â\u0080\u0093 incorporates what we are seeing month to date and we are prepared to be very sharp and have deals that resonate with our customers during the all-important fourth quarter. Your line is now open. I mean thatâ\u0080\u0099s been a pretty hot topic this quarter for a lot of players, especially within the fragrance category. As we have talked about in the last several calls, input costs, in particular, in raw materials for us continue to be a challenge. And so it continues to be a pressure point for us, almost just over 50% of our inflation pressures that we have quantified our raw materials. We have seen a little bit of green shoots in candle wax, but I would describe it as modest and our other input costs continue to be challenged. Now that being said, weâ\u0080\u0099re working with our suppliers to mitigate those price increases. Weâ\u0080\u0099re looking at opportunities to be smart and how the product cost out, and weâ\u0080\u0099re looking for value engineering opportunities as well to mitigate those prices, but the raw materials do continue to be a pressure point for us in our business. Your line is now open. It looks like if they are a third of your member base in two-third of sales, itâ\u0080\u0099s obviously quite a big differential between their purchasing levels versus the other two-thirds. And then I just had â\u0080\u0093 if I could sneak one more in, just around SG&A performance this quarter and how that influences your thoughts on the pace of improvement into fiscal â\u0080\u009823. Thank you so much. So for our loyalty program, we are absolutely thrilled with the program. Weâ\u0080\u0099re pleased with enrollment and engagement, evidenced by our 65% local company sales. I think itâ\u0080\u0099s important to remember, as Sarah mentioned, that our loyalty customer has a higher retention rate, higher spend, makes more ships and shop more cross-category and more than non-loyalty members. On the SG&A, so a couple of comments on SG&A, our SG&A rate has increased compared to last year, which, of course, I know you saw in the numbers. And as we talked about in prior calls, I break down the rate increase compared to LY. And maybe to start with stores, we made a very planned and thoughtful investment in our store associates as we went into this time period. So weâ\u0080\u0099re very confident that, that investment will pay off as we go into Q4 because we have great store associates hired and we are ready to go. In terms of the other increase year-over-year, it is home office. As Iâ\u0080\u0099ve talked about, we continue to make investments there as well. In terms of the favorability to beginning of quarter, I would say two things are driving it. Number one, as we emphasized in our prepared remarks, we continue to try to manage expenses thoughtfully and frugally during this quarter, we are being very thoughtful about where we spend our money, just given the macro environment out there. Weâ\u0080\u0099re just seeing a little bit of ramp-up, the ramp-up in terms of the work on separation occurred a little bit slower than what we expected, but thatâ\u0080\u0099s going well, but it did result in some expense favorability compared to beginning of quarter expectations. Your line is now open. In terms of things that weâ\u0080\u0099re focused on that will impact how we think about our long-range planning, two major things come to mind, actually three. Number one, as I answered earlier, inflation and cost pressures still do exist in our business. Weâ\u0080\u0099re working to mitigate those, but those still exist as we turn the calendar into 2023. Number two is we do want to be thoughtful on our promotional approach, as we go into 2023. As we said, the customer is extremely price sensitive right now, and we want to be mindful of that and thoughtful with how we price our products in this tough environment. Right now, weâ\u0080\u0099re focused on separation. But as we look beyond separation, we see a lot of ways that we can improve our customer experience, and weâ\u0080\u0099re thinking about how do we want to do that and what investments we make there. And we â\u0080\u0093 right now, we are focused on winning at Christmas. Your line is now open. So what we see â\u0080\u0093 so as a reminder, weâ\u0080\u0099ve just launched in the U.S. â\u0080\u0093 nationwide in August. And what our test showed was that on a decile-adjusted basis, loyalty customers spend more and visit us more often. So in other words, it wasnâ\u0080\u0099t just looking at the customers that love us and come all the time. I mean if you decile adjust it and look at levels of spend, the program was effective in test in terms of getting customers to spend more money and visit us more often. So weâ\u0080\u0099re very early in the nationwide rollout, but we are very optimistic about the future benefits of this program. So more to come, but we have seen positive results from the program. Your line is now open. Just wanted to get a little bit more color around your new categories, it seems like the menâ\u0080\u0099s category is doing well and you launched MOXY which is focused on skin care and hair care. So as far as the menâ\u0080\u0099s business goes, I know we have said before on these calls that we believe that we can more than double our Menâ\u0080\u0099s business. Based on our market data, we continue to increase market share at an accelerated rate, and we are absolutely thrilled with those results. We launched leather and brandy, and coffee and whiskey this quarter. So for instance, as we mentioned, we have been testing antiperspirant deodorant in about 650 stores and we are thrilled to be rolling this out to all stores in spring. Just as on aside, antiperspirant deodorant is the number one form in the menâ\u0080\u0099s market. And we know in order to double this business to grow market share, weâ\u0080\u0099re going to have to own this form. As far as MOXY goes, I would say that the assortment is still flowing on site. And again, as we mentioned, itâ\u0080\u0099s only in 11 stores. So we are right now at a just learning and listening, so more to come on that. She asked us about marketing initiatives holiday, anything on holiday approach. Yes, you will see marketing initiatives around menâ\u0080\u0099s. Itâ\u0080\u0099s incredibly important business for us, particularly in the fourth quarter because we sell a lot of gifts. And we also launched for the first time this Q4, our first single fragrance launch in menâ\u0080\u0099s After Dark. And Jonna, the only other thing I would add as we go into Q4 is we are really excited about our gifting rent. So we know gifting is a huge part of Q4, and we have really been thoughtful about our price points on gifting and showing a guess everybody at every price point. And just to say, keeping to adding on, but gifting did outperform the shop in Q3 as well. And we offer gifts at a range of price points and quite frankly, we believe â\u0080\u0093 all of our products are gifts here at BBW. Your line is now open. From the other end, the cost side, I know there was a margin impact this quarter as you deferred some revenue and profits. So the program design has a reward aspect to it, where when a customer hits $100 threshold, they earn a reward. So those elements of the program do at cost, it is under a point which is good, and we think itâ\u0080\u0099s margin accretive in terms of dollars because we â\u0080\u0093 as I said earlier, we know those customers spend more and visit us more often. We do see future opportunity in addition, though, to reduce CRM and direct mail in the future to partially offset the cost of this program. So at the end of the day, we feel that although there is a cost, this program is definitely accretive to the business. As Julie mentioned earlier, we full match on this data, and we know that once we have the data, we will be able to deliver better personalized and individual marketing, which we believe will be much more effective as we really learn to use that data effectively. Your line is now open. We will start with inventory, and then I will mention a few things on pricing and then hand it over to Julie to talk additionally about pricing. As we mentioned in the last call, we entered the season clean, which is extremely important for us. What our inventory consists of, and you saw it in our remarks a little bit, is we have finished goods, of course, that are available for sale. In addition, we also own componentry that is not yet made, things like pumps or soap, etcetera, etcetera. The biggest driver in terms of Q â\u0080\u0093 that benefited the Q3 dollar number is that our components were down substantially, mostly because we had in-transit inventory that we were lapping. So, if you think about the supply chain challenges a year ago, we had a lot of our componentry that was in transit. So, when we reported the dollars this third quarter, we were lapping an elevated in-transit number, which drove the percentage down to the 10%. The guide for Q4 is more normalized assumption on componentry, which is taking our guide up to the mid-teens. We have a goal, as you saw in our prepared remarks to end with the units flat year-over-year. And then of course, we have our semi-annual sale that we will use to end the season clean. So, we are definitely focused on prioritizing clean inventories. We know that if we end the season clean, it will enable us to start 2023 on a very solid footing. In terms of pricing, as you saw in our remarks, we were more promotional in Q3 year-over-year, and we are planning to be similarly more promotional in Q4 as we look forward. We saw â\u0080\u0093 as I said earlier, we saw that the customer is extremely price sensitive right now. And we have made our plans to meet the customer where their mindset is in both â\u0080\u0093 we did that in Q3, and we are planning that in Q4. So, from a pricing and promo related question, as we enter this holiday season, we are absolutely confident in our strategy to read and react with agility and speed. Currently, as we have all been saying, the customer is very price sensitive to higher prices. So, we are slowly and methodically raising prices in a way that donâ\u0080\u0099t impact our customers very dramatically. So, we continue to use really our robust testing agenda to see where we can raise prices and help to build the basket. Your line is now open. So, if I run the 4Q sales guidance through my model, itâ\u0080\u0099s a slight decel on a 1-year trend, but itâ\u0080\u0099s a pretty significant decel if I look at it on a 3-year stack and assume that 2018 and 2019 are more representative of normal seasonality. And over the last 2 years, did vary dramatically as stores during certain periods were reopened, and we were lapping restrictions, etcetera, etcetera. So, I think if you go back and look at our business pre-pandemic versus now, the seasonality is generally consistent. Your line is now open. So, Wendy, a number of moving parts in this yearâ\u0080\u0099s P&L. If we think about CEO transition, separation costs versus maybe the IT investments in SG&A, and we have the elevated transportation and the loyalty deferral. Well, I wish I had perfect visibility to the next year, but I will try and help you out as much as I can. Raw materials, like I said, they continue to be challenging, and itâ\u0080\u0099s a volatile market. And as I have said, we will continue to try and mitigate those costs as best we can. I am optimistic that, that will continue into 2023. But TBD on that, but we are seeing some signs that transportation is peaking and potentially will abate in 2023. That work will continue this year into next, with the goal of being separated from Victoriaâ\u0080\u0099s in 2023. So, right now, we are spending money on separation. And so when we get to February, we will give a little bit more color on how we are thinking about spending money and technology. But that will be an area we want to continue to invest because at the end of the day, we want to continue to grow this company. I would say itâ\u0080\u0099s a loyalty, as we â\u0080\u0093 essentially, it will peak the impact, peaks essentially in Q4 in terms of that deferred revenue impact that we have talked about. And then once we lap the program in the summer of next year, you wonâ\u0080\u0099t see that impact. So, in SG&A, about two-thirds of our SG&A expenses are stores. And thatâ\u0080\u0099s been a dynamic space, and we continue to think about what wage rates are appropriate. Thatâ\u0080\u0099s true, actually, not just for stores. Thatâ\u0080\u0099s true for home office as well, just given the current environment we are in. So, we will continue to make the investments in our people as appropriate in the current environment. We have quantified on past calls, as you know that we do have some retention that will â\u0080\u0093 that is one-time that will come off starting next year. And then we do have some CEO transition costs, which will go away in 2023. Your line is now open. Last year in the fourth quarter, the semi-annual sale, I believe did not meet your expectations. Perhaps you could talk about whatâ\u0080\u0099s embedded in guidance this year and what some of the opportunities might be year-over-year in terms of promotions and content, etcetera. And just on the menâ\u0080\u0099s business, nice rollout. Yes As far as the sale goes this year, it will not be quite as long as last year. So, we have a different flow strategy this year to throughout January, be dropping in small drops of newness to offset sales. So, we are highly cognizant of what we bought for sale and using our agile supply chain to ensure that we are not overbought and that we end clean. So, I think we are very confident that our sale will be short, sweet and get us to clean inventory. And I would say that both of those forms have been performing incredibly well for us, and we do not promote them. But our single-fragrance launches have just been such a great success for us over the last few quarters, which is why we launched After Dark for men in Q4...\n Packaging is beautiful, really beautiful, Julie. Daniel, I think we have time for one more question. Your line is now open. I will take the question on the finances, and then I will turn it over to Julie on the MOXY launch and rollout. So, Marni, this company has a long history of innovation and product development, not just in MOXY, but you have seen it in our ongoing assortment. We spend money on it every quarter, not just in MOXY, but in the balance of the assortment as well. So, we know that the key to success is not just newness in something like MOXY, but you will continue even in 2023 to see new and exciting things coming out of our core business. So, Bath & Body Works has always been below the neck. So right now, the strategy is to focus on our channels, stores and website. I know I have said it three times now, but we really do want to be in a listening and learning mode, so that we do this in a very thoughtful way. One other thing to say is we have our own Instagram account for MOXY, and so we are trying some different things there. So, there are so many opportunities for these brands and ways to go out and attract new customers. Thank you, Marni and thank you everybody for your continuing interest in Bath & Body Works."
}