{
    "symbol": "MRSN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 22:36:10",
    "content": "  Operator: Good afternoon, and welcome to Mersana Therapeutics Second Quarter 2022 Conference Call and webcast. These statements may include, but are not limited to, those related to the company's business strategy, platform potential, clinical trial or preclinical study execution and data releases, regulatory plans and objectives, commercial opportunities, collaborations and potential associated payments, operating expenses and cash runway. These risks and uncertainties are discussed in the company's quarterly report on Form 10-Q filed with the Securities and Exchange Commission on May 9, 2022 and in subsequent SEC filings. As we approached enrollment completion in UPLIFT, our potential registration trial, initiated patient screening in UP-NEXT, our potential confirmatory trial cleared their IND with the FDA for XMT-1660. Cleared their IND for XMT-2056, and announced that the FDA has granted orphan drug designation for this candidate in gastric cancer. And finally, as we just announced, we entered into yet another exciting strategic partnership that provides significant non dilutive capital to extend our cash runway, while also allowing us to retain longer term strategic and financial upside potential. We are excited to share the news after market today that we have entered into a global collaboration, providing GSK with an exclusive option to co-develop and commercialize XMT-2056, which is our first Immunosynthen ADC. First and foremost, from a financial perspective, this is a very meaningful deal for an early stage ADC asset . So it is recognition of our differentiated Immunosynthen platform, the strength of our preclinical data, and the transformational potential of XMT-2056. Secondly, the upfront option purchase fee of $100 million extends are runway into the first half of 2024, well beyond important inflection points. Thirdly, assuming GSK option, they will fund a majority of the development costs for 2056, and the deal is structured, so that our cash contribution will generally be offset by development, milestones and other features, all while retaining participation in the potential longer term value of this exciting program. We believe GSK would be an ideal partner for XMT-2056, given our shared vision for the potential of this program, their wealth of global development and commercial capabilities, and their deep experience in ADC, the IO space and the STING pathway. And finally, from a strategic perspective, we view this agreement is a strong endorsement of the potential of our Immunosynthen platform and XMT-2056. When coupled with the recent collaboration that we formed with Janssen earlier this year, leveraging a Dolasynthen platform, we believe it also reaffirms that Mersana is increasingly being viewed as a partner of choice during this momentous period in the broader ADC space. Now, let's touch on the progress we have made recently in executing against our plan to position UpRi as a foundational medicine in ovarian cancer, which remains our top priority. We continue to be pleased by the pace of enrollment in UPLIFT, our single arm registration trial in platinum-resistant ovarian cancer and are on track to announce enrollment completion around the end of the third quarter. Dose escalation is underway in the first arm of the trial, which is looking at the combination of UpRi with carboplatin. These three ongoing clinical trials have the potential to demonstrate UpRi's efficacy and confirm its safety and tolerability, while also generating data across a broad range of ovarian cancer settings. And beyond UpRi, we're actively diversifying our clinical pipeline in a thoughtful and strategic manner with XMT-1660 And XMT-2056, both of which recently cleared INDs. We are advancing to exciting and highly differentiated molecules with XMT-1660 and XMT-2056, and we are substantially strengthening our balance sheet through the partnership with GSK. With that, I will ask our Chief Medical Officer, Arvin Yang to delve more deeply into our clinical progress and plans. As Anna mentioned, enrollment in this registrational trial has been robust, and we remain on track to complete enrollment around the end of the third quarter. Turning to our Phase 3 UP-NEXT trial, we're excited by its potential to serve as a post approval confirmatory trial in the U.S. to support global registrations, and to expand UpRi's earlier lines of therapy. Despite the relatively recent approval of PARP inhibitors and Bevacizumab, there remains a high unmet medical needs in the maintenance setting following platinum therapy. The first are patients who have progressed on PARP inhibitors and Bevacizumab, whether taken in combination or in sequence. Second, are patients who are poorly served by today's maintenance agents, and are resorting to watch and wait as their best option. Ultimately, we are targeting the enrollment of approximately 350 patients worldwide in this trial. In addition to UPLIFT and UP-NEXT, we are seeking to bring UpRi into earlier lines of therapy through UPGRADE. As Anna mentioned, the first portion of this trial is investigating UpRi in combination with carbo platinum. Now, let's move on to our earlier stage candidates, XMT-1660 and XMT-2056. As a reminder, 1660 is our B7-H4 directed Dolasynthen ADC with a precise target-optimized drug to antibody ratio of six and Mersanaâ\u0080\u0099s clinically validated DolaLock microtubule inhibitor payload with a controlled bystander effect. DolaLock of course, already has shown its potential to drive efficacy and heavily pretreated ovarian cancer patients without severe neutropenia, peripheral neuropathy or ocular toxicity. And we see B7-H4 as a compelling target, given its limited expression and healthy tissue, and its high expression in a range of cancers including breast cancer, endometrial and ovarian cancer. In triple-negative breast cancer, where PD-1 agent is approved, may be an even greater unmet need, as there appears to be an apparent lack of overlap between B7-H4 expression and PD-L1 expression. This Phase 1 trial will investigate 1660 in solid tumors including breast, endometrial and ovarian cancer. And then, there's XMP-2056, which we will expect will enter the clinic in the second half of this year. 2056 is directed at HER2, which of course is a very well established target and it's over expressed in breast, non small cell lung cancer, gastric cancer, among others. It's also shown synergistic activity when used in combination with checkpoint inhibitors, and with other HER2 standard of care agents in breast cancer, such as in HER2. And notably, 2056 has demonstrated the potential for a very wide therapeutic index in preclinical models. And so, we're excited to have these three programs in motion, and we're looking forward to generating clinical data from all three of our ADC platforms. With that, let's turn the call over to our Chief Financial Officer, Brian DeSchuytner. Let's begin by sharing some additional context about our collaboration with GSK, which we view is a significant achievement for Mersana. For GSK choose to exercise its option, we will be entitled to receive an additional $90 million payment and up to approximately $1.3 billion in development, regulatory and commercial milestone payments. As Anna indicated, if GSK opts in, they will fund a majority of the development costs for XMT-2056, and our cash contribution would be generally offset by development milestone and other features. For instance, the deal structure allows us to retain options for profit share, and to co promote XMT-2056 in the U.S. This agreement follows our research collaboration with Janssen earlier this year, and demonstrates once again how we can leverage our platforms and product candidates as tools within our financing arsenal. We ended the quarter with approximately $225 million in cash, cash equivalents and marketable security. Additionally, our line of credit with Oxford and SVB provides us with the opportunity to draw down an additional $35 million in low cost capital at our option. When combined with the $100 million upfront payment from GSK, we believe we have the financing required to fund our operating plan commitments into the first half of 2024. Collaboration revenue for the second quarter of 2022 was $4.3 million, compared to an immaterial amount in the same period in 2021. Research and development expenses for the second quarter of 2022 were $41.2 million, compared to $32 million for the same period of 2021. The year-over-year increase in R&D was primarily driven by clinical and manufacturing costs for XMT-1660 and Dolasynthen platform, higher UpRi manufacturing and clinical costs and an increase in headcount. As we previously described, we expect to incur non-recurring costs in the near term related to antibody manufacturing runs for UpRi and anticipation of a potential BLA filing, and our efforts to ensure long term supply of Dolasynthen and conjugation components for both XMT-1660 and our Janssen collaboration. General and administrative expenses for the second quarter of 2022 were $14.8 million, compared to $8.9 million in the same period in 2021. Mersanaâ\u0080\u0099s net loss for the second quarter of 2022 was $52.2 million, or $0.55 per share, compared to a net loss of $40.9 million, or $0.59 per share for the same period in 2021.Finally, net cash used in operating activities was $44.7 million for the second quarter of 2022. From working to build UpRi, the foundational medicine in ovarian cancer, with UPLIFT, UP-NEXT and UPGRADE, our progress with 1660 and 2056 and the meaningful new strategic partnerships with Janssen and GSK. With that, let's open the call to your questions. We continue to run the Phase 1 study, in fact, XMT-2056, remains wholly owned by Mersana. And itâ\u0080\u0099s thus, the completion of gut  where GSK has an option to obtain, Jonathan. Well, we're in a very fortunate position, as you know, to have three platforms, all of which are supported by substantial data. And frankly, there's more than here in potential that we could take for any one company can take advantage and harness. So partnerships remain a very important part of our strategy, whether they be platform deals like the one we did with Janssen, or whether they are asset deals like the one we've done with GSK. So, as you can imagine, the diligence was very, very comprehensive involved, not only the data we have shared publicly, but a lot of the other data we have been generated to support the potential of 2056 and Immunosynthen platform, very comprehensive, including a review of the IND that we have recently cleared with the FDA. As for the development program, I think GSK shares our vision that 2056 has very broad potential in HER2 expressing tumors, which include lung, but also includes other indications, include gastric -- include breast and other indications. So we want to make sure that our dose escalation includes sufficient number of breast cancer patients, but our interests are very broad. And so, this would be an eye toward that safety and tolerability knowing that the efficacy is intended to be characterized further when we have the expansion data."
}