{
    "symbol": "MRSN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 11:19:05",
    "content": "  Operator: Good morning, and welcome to Mersana Therapeutics First Quarter 2022 Conference Call and webcast. I would now like to turn the call over to Jason Fredette, Senior Vice President, Investor Relations and Corporate Communications. Before we begin, I'd like to mention that our call will contain forward-looking statements within the meaning of the federal securities laws. These statements include, but are not limited to, those related to the company's business strategy, platform potential, clinical trial or preclinical study execution and data releases, regulatory plans and objectives, commercial opportunities and cash runway. These risks and uncertainties are discussed in the company's annual report on Form 10-K filed with the Securities and Exchange Commission or SEC on February 28, 2022, and in subsequent SEC filings. With that, let me turn the call over to Anna Protopapas, Mersana's President and Chief Executive Officer. Good morning, everyone, and welcome to our first quarter 2022 conference call. Before I start, I would like to officially welcome to Mersana our new Senior VP of Investor Relations and Corporate Communications, Jason Fredette. 2022 is shaping up to be an incredibly exciting year as we continue to advance UpRi, prepared to bring two exciting new candidates into the clinic to execute on our partnering strategy as we position Mersana for multiple imported data readouts in 2022. We believe the clinical data we've shared in the past has demonstrated UpRi's efficacy and important tolerability advantages, namely the lap of severe neutropenia, neuropathy and ocular toxicity that has been reported with other ADCs. Our current slate of trials, UPLIFT, UP-NEXT and UPGRADE, have the potential to further validate this profile while also generating data across a broad range of ovarian cancer settings in an expeditious and capital-efficient manner. UPLIFT, our single-arm registration trial in platinum-resistant ovarian cancer, is on track to complete enrollment in the third quarter of this year, positioning us for a 2023 readout and potential BLA filing. As Arvin will discuss in further detail, we are pleased to have been selected for an oral presentation at the Society of Gynecological Oncology, or SGO, to share additional analysis supporting our dose selection for UPLIFT. UP-NEXT is our Phase III trial of UpRi monotherapy maintenance in NaPi2b high recurrent platinum-sensitive ovarian cancer, which is an even larger patient population with significant unmet need. Next has the potential to service a post-approval confirmatory trial in the U.S., support global registration and position UpRi as the first ADC in the platinum-sensitive space. Initially, we're evaluating the combination of UpRi with carboplatin, followed by continuation of UpRi monotherapy. We believe the preliminary dose escalation data planned for late this year will provide valuable insights into UpRi's safety and tolerability in a combination setting, which could support our plans to expand into earlier lines of therapy. Beyond UpRi, we are advancing a pipeline in a thoughtful and capital-efficient manner with 1660 and 2056 being our primary focus. Preclinically, we have generated compelling efficacy data, demonstrating 1660's potential B7-H4 expressing tumors of high unmet need including breast, endometrial and ovarian cancer. It targets HER2, a validated target broadly expressed in a range of solid tumors, including breast, gastric and non-small cell lung cancer. We have generated a robust preclinical data set, demonstrating 2056's potential to create a pipeline in a product with a single agent activity in both high and low HER2 expressing models. Given that 2056 targets and novel epitope of HER2, we believe it has the potential to be synergistic with other HER2 agents, including those that have become standard of care in breast cancer in newer agents like in HER2. Additionally, we have seen its potential to work in combination with checkpoint inhibitors in preclinical models. Now as many of you know, we also have been evaluating another NaPi2b-targeted ADC, XMT-1592, as a second short-term goal in non-small cell lung cancer. Given the lower prevalence of the NaPi2b biomarker in lung, the increasingly competitive nature of this indication, our commitment to remain financially disciplined and the substantial opportunities we see ahead for UpRi XMT-1660 and XMT-2056, we have decided to discontinue development of XMT-1592. In addition, we are deferring certain investments in our preclinical pipeline, including two of our earlier stage candidates, XMT-2068 and 2175, to focus our resources on Mersana's clinical pipeline. Our success with UpRi, XMT-1660 and 2056 has positioned us to have three candidates enabled by all three of our platforms, Dolaflexin, Dolasynthen and Immunosynthen in active clinical development this year. This, in turn, provides the opportunity to expand Mersana's reach and its ability to address patient needs while also bringing us nondilutive capital that can be redeployed in the business. And so we are off to a strong start in 2022 as we lay the foundation for what we hope will be a BLA filing and approval of UpRi in the not-to-distant future, important initial clinical data for 1660 and 2056 and additional potential value-creating partnerships. With that, I would like to turn the call over to Arvin to delve deeper into UpRi and discuss our recent data at SGO. With strong support from both the GOG and ENGOT, the premier gynecologic oncology clinical trial networks in the U.S. and EU. If positive, we believe this data will support a BLA submission for UpRi in platinum-resistant disease. At SGO, we were pleased to present details of an analysis from our Phase I trial that bifurcated patients by dose groups, dose group 36 and dose group 43. Given its high efficacy, fewer Grade 3 or higher adverse events, and fewer adverse events in general, longer durations of treatment as well as fewer discontinuations to treatment-related adverse events, including discontinuation before first scan. The SGO presentation also helped to clarify that in dose group 36, only two patients were nonevaluable in the NaPi2b high population and four patients were nonevaluable in the overall population. Including these patients in an Intent To Treat or ITT analysis of the dose group 36, the overall response rate or ORR was 39% among patients with NaP2b high status and 31% among all patients. Despite the approval of PARP inhibitors and bevacizumab, the unmet medical need remains high for patients who have been previously treated with a platinum doublet. Through constructive FDA and CHP interactions, we've designed UP-NEXT to enroll three important patient populations who are underserved by today's options. The first are patients who progress on a PARP inhibitor and bevacizumab, whether taken in combination or in sequence. We have optimized the study design to address the unmet need in the maintenance setting, including selecting for NaPi2b high patients and selecting a 30 mg per meter square dose And. We are pleased to share that we submitted our UP-NEXT protocol to site institutional review boards or IRBs, putting us on track to initiate patient screening for this trial by the end of Q2. In addition to our near-term plans to complete enrollment for UPLIFT and initiate UP-NEXT, we are planning to share interim combination data from our UPGRADE combination Phase I/II trial with carboplatinum in the fourth quarter of this year. Ultimately, we believe the combination therapy will be key to moving into earlier lines of ovarian cancer treatment. As you know, ADC innovation is at the very core of Mersana's strategy, and we have made significant progress in building out an innovative pipeline of potential cancer medicines. In fact, I've been here since Mersana's inception as an ADC company, and I can honestly say that I have never been more excited about where we are from both a technology and pipeline perspective. This is due both to UpRi's rapid progress and to the promise of our next clinical candidate, XMT-1660 and 2056. The preclinical data packages on these new molecules are very compelling, and we recently had the opportunity to share additional data on both of them at AACR. Also, similar to UpRi, it leverages our clinically validated DolaLock microtubular inhibitor payload to provide a controlled bystander effect and what we believe will be a similar tolerability profile. At AACR, we showed in multiple patient-derived xenograft models that a single dose of 1660 has robust antitumor activity in both triple-negative breast cancer and estrogen receptor positive breast cancer. Further, the data demonstrate that B7-H4 expression is correlated with antitumor activity consistent with our desired target effect. As Anna mentioned, XMT-2056 is our first Immunosynthen STING-agonist ADC targeting HER2-expressing tumors. We also shared data demonstrating how 2056 may combine and provide even greater efficacy with established agents like trastuzumab, pertuzumab, anti-PD-1 or trastuzumab deruxtecan. Additionally, we presented preclinical data at AACR elucidating how antitumor activity of Immunosynthen STING-agonist ADCs involve the targeted activation of the STING pathway in both tumor-resident immune cells and in tumor cells in an antigen binding dependent manner. This one-two punch is a strong differentiator for Immunosynthen versus other ADC-IO approaches, including those based on toll-like receptor or TLR agonists or those that directly target antigens on immune cells. To further investigate this approach, we conducted studies on patient tumor samples revealing that when combined with 2056 Ex vivo, myeloid cells present in the tumor activate the STING pathway and induce cancer cell death. We summarized our first quarter financial results in this morning's press release, so let me focus in on just a few key items. As you all know, Mersana, like a majority of similarly situated biotechnology company, has now been operating amid challenging market conditions for a prolonged period of time. This has caused us to evaluate our expenses even more carefully, contributing to decisions like the one Anna described earlier related to XMT-1592 and the deferment of certain investments in XMT-2068 and XMT-2175. At the same time, we've been proactive in ensuring that Mersana has access to the capital that we require to continue advancing UpRi rapidly toward potential approval and to clinically demonstrate the strength of our Dolasynthen and Immunosynthen platforms. Our debt refinancing in late 2021, recent business development accomplishments and strategic use of the ATM are primary examples of the tools that have enabled us to keep Mersana on sound financial footing. It should be noted that in April, we raised an additional $40 million in net proceeds from our ATM, primarily from investors with whom we have had long-term relationships who believe strongly in Mersana's prospects and who tend to have a long-term focus. Also, our line of credit with Oxford and SVB provides us with the opportunity to draw down an additional $35 million in low-cost capital at our option. Factoring all of this in, we believe we have the financing required to fund our operating plan commitments well into the second half of 2023. Additionally, we continue to view collaborations as an important tool within our financing arsenal and believe that the potential exists for further business development transactions in the quarters to come. With a bolstered balance sheet and the progress we have made across our platforms and pipeline, we believe we're well positioned to execute upon our commitment of building a leading ADC company with a focus on benefit, both patients and shareholders. The role of NaPi2b lung cancer, as we learned from our UpRi lung cancer expansion cohort, the very competitive nature of this indication and the fact that we're pretty excited about not just UpRi but the potential of XMT-1660 and 2056. Focusing on UpRi 1660 and 2056 gives us a very diversified portfolio, both in terms of targets, platforms and indications. Obviously, with every study we do, there are learnings and there are learnings we take from one study -- from one program to the next. And as we wind down the study and clean and lock the database, we'll have an opportunity to find the appropriate forum to disclose that data. So the Janssen transaction, I think, really highlights what we can do with both our platforms and our products. And so we think about our BD strategy in three pillars: the platforms that are the -- cytotoxic platforms, whether it's Dolaflexin or Dolasynthen, where we can think about transactions that look similar to the Janssen transaction. The Immunosynthen platform where we -- for every company that is interested in ADCs as a modality, there's another company that has targeted an immune stimulation in their sweet spot, and that's a substrate for partnering as well. And obviously, there are six Immunosynthen assets that we've advanced to various stages, 2056 being the most advanced. My first question is, from the timing and regulatory perspective, I believe the FDA wants to make sure that the confirmatory trial is well underway prior to approving accelerated application. No, thanks for the question. And so first off, just to start off, as we've indicated in our press release, we remain on track in relationship initiation of the study in the Q2 front that we referenced. In regards to the enrollment, we've been in ongoing discussions, as would be typical in relationship to discussing with FDA in relationship to the start-up as well as the enrollment. One thing to keep in mind, however, is that we're doing our confirmatory study in a different population relative to the UPLIFT, the platinum-resistant ovarian cancer space. And this is advantageous from the standpoint of -- remember, this has not been a competing population in relationship to when the UPLIFT data becomes available, the confirmatory study, obviously, still serves and addresses an unmet need in relationship to interest in the study. As for data disclosures beyond that, I think it's a little early for us to be providing that guidance. No, thanks for the question. And so keep in mind that in -- first off, starting in relationship to the data that we've seen from the expansion cohort. We do see that there's activity across the board, but there is enrichment in relationship to the high NaPi2b. And so in UPGRADE, as we're starting to combine with chemotherapy -- and keep in mind, the initial steps are here to evaluate, again, our differentiated profile and that potential for the nonoverlapping toxicities recognizing that we don't have what we've seen with the UpRi agent, the severe neutropenias, the peripheral neuropathies or with the ocular toxicities. So here in combination with carboplatin, which is a standard of care in the earlier line, the idea here is we'd like to see the activity in that broad population and then determine, obviously, ultimately, whether or not a biomarker on NaPi2b status would be useful in relationship to patient selection. And then regarding the recently announced project OPTIMIST from the FDA, it seems that the FDA is focused on ensuring companies advance the right dose. And remember, one of the core tenements of project OPTIMIST have been that it's not always necessarily the maximum tolerated dose, which is the optimal dose to move forward. And here, you can see that with the over almost 200 patients that have been evaluated in dose ranging, we've been able to robustly analyze the dose regimen that we believe can be optimal in relationship to bringing forward for patients. And just to remind the audience in relationship to the UP-NEXT study or confirmatory study, this is in the recurrent platinum-sensitive space and we are selecting for high NaPi2b patients. And so in regards to the stratification, we've essentially, based upon the sample size, determined the most important prognostic stratifiers in relationship to those patients in order to then ensure the balance. Because to your point, we are looking at multiple different populations, but where these populations all have standard of care as essentially vigilant observation as an acceptable standard of care for those patients. And so keep in mind that, that recurrent space, given the PARP inhibitor utilization and the bad utilization in the earlier line space, that period is actually relatively short in relationship to progression-free survival. So we are using an approved dose of the carboplatinum and it's consistent with dose escalation studies in the Phase I setting where, obviously, the goal here is to ensure the safety tolerability initially and then at a defined dose, start to evaluate the efficacy. And so as you get into Q4, to level set upon the expectations in that time frame, this will be our initial or interim of the dose escalation period. And so what we've seen from not only our expansion dose cohorts but an expansion cohorts, but as well as additional tumor banks, is that NaPi2b is a lineage marker. And the expression level appears to be consistent through time, which also means that through intervening therapies, including platinum therapies. And thus, the expectations would be that the NaPi2b expression would remain consistently high, which represents about two-thirds of the population as we described in our expansion cohort of whether it be in the late line setting or in the earlier line setting, including the platinum sensitive space. Most of mine have been asked, but I was curious on developing 2056 HER2 Immunosynthen. I know it's differentiated from other HER2-targeting agents in its mechanism, but HER2 is also a crowded development space. I mean as we remarked before, when we think about our Immunosynthen assets, there are potential partnerships around both the platform, platform access similar to the Janssen, or there could be partnerships around the Immunosynthen products. For that molecule, we're really excited about it because, one, I think we've been -- Tim and the team have generated really tremendous preclinical data demonstrating a third-party therapeutic index. I mean, the three that I would flag right now include breast cancer, gastric as well as non-small cell. But we also will be evaluating additional tumor types, including the bladder cancers and other tumor types that may express HER2. And back to Brian's point, just in relationship to keeping in mind that this is really a docking station. And because of such, the expression levels may matter less relative to other HER2-targeted therapies where inhibiting the biologic pathway has been the primary modality of action. I think the success in HER2 -- in the HER2 low is probably the best prime example in relationship to when using it as a docking station, you potentially can address a HER2-low population. Regarding the UPLIFT trial, I believe the trial was started with patient enrollment in the 43 mg per meter square dose cohort. And just to clarify, we had initially started with a 43 mg per meter squared dose regimen. And then based upon the 200 patients evaluation and so forth, we had shifted to the 36 mg per meter square, what we consider to be the optimal dose regimen to move forward. Now obviously, the totality of data will always be utilized in order to characterize the safety profile. I think it starts actually from the standpoint of the learnings we've had from our expansion cohorts in relationship to, a, ensuring the inclusion criteria are set up in such a way that minimizes the potential that you have patients with less pulmonary reserve or the ability to essentially, if they were to develop the rare frequencies of pneumonitis, overcome it per se or have that runway. So identification and then ultimately, management, whether that be through dose reductions, dose delays, discontinuations or as well as additional interventions such as steroids."
}