{
    "symbol": "AGIO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 08:20:06",
    "content": " Our exceptional clinical team initiated two pediatric PK deficiency pivotal studies, as well as an sickle cell disease cohort of the AG-946 Phase 1 trial, all while operationalizing the AG-946 MDS study and continuing to advance site activation and patient enrollment across three pivotal studies of PYRUKYND in thalassemia and sickle cell disease. As shown on slide 16, we are exploring PYRUKYND in an operationally seamless Phase 2/3 study known as RISE UP in adults with sickle cell disease, with the goal of being the first potential oral agents to improve anemia, reduce VOCs and improve quality of life by increasing methemoglobin resulting in reduced pain and fatigue. Our focus is on ensuring, first, that the approximately 1,500 to 4,000 PK deficiency patients in the U.S. are accurately diagnosed through efforts like Anemia ID; second, physicians understand the urgency to prescribe an eligible patients advocate for treatment; and finally, patients connect to myAgios support services to optimize disease understanding, ensure access and drive long-term medication adherence. Importantly, what we are seeing from this launch is that our commercial strategy, our knowledge base and the connections we are making are setting us up for success as we continue to expand the applicability of PYRUKYND to all eligible PK deficiency patients, as well as longer term other genetically defined diseases. The year-over-year increase in R&D was driven primarily by increased headcount and workforce related expenses, planned increased activity associated with the PAH preclinical program, start-up costs for the AG-946 Phase 2a MDS study, increased spend for the AG-946 Phase 1 trial and start-up costs for the PYRUKYND pivotal studies in sickle cell disease and pediatric PK deficiency. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. And then for the Phase 3, it's set up with two primary endpoints, the hemoglobin response and analyzed sickle cell pain crisis endpoint, which if one, both that allowed us to move on to secondary endpoint testing, which gives us the totality of the data that we would need to make a meaningful story for patients and physicians and regulators. And the one thing I would add to everything that Sarah just said, right, we've designed the clinical studies and are thinking about how we differentiate based on input from what the community has told us, the broader sickle cell community physicians and patients to understand what the needs are and then design the study accordingly. Your line is open. Your line is open."
}