{
    "symbol": "DHI",
    "quarter": 1,
    "year": 2023,
    "date": "2023-01-24 10:18:02",
    "content": " Our net sales orders in the first quarter decreased 38% to 13,382 homes, and our order value decreased 40% from the prior year to $4.9 million. Our second quarter sales volume will depend on the strength of its spring selling season, and we currently expect significantly higher levels of net sales orders in the second quarter as compared to the first quarter based on historical seasonal trends, current market conditions and our inventory of completed homes available for sale. Our first quarter home building investments in lots, land, and development totaled $1.7 billion, down 21% from the prior year quarter and up 16% sequentially. We currently expect to generate consolidated revenues in our March quarter of $6.3 billion to $6.7 billion and homes closed by our homebuilding operations to be in the range of 16,000 to 17,000 homes. It is still too early to ultimately say what's going to happen this spring, but it gave us the confidence to say that we could see normal seasonality, which typically would be about 50% up from Q1 to Q2 in terms of net sales orders. And we're taking probably a conservative stance in looking at the fact that seasonally in a normal seasonal environment, we do see lumber cost increase through the spring -- and if we do -- are seeing some normalized demand coming back with the spring selling season, seasonality, would expect that to drive lumber prices higher, which would offset some of the efforts we've made on like-for-like cost reductions. So, we generally don't extrapolate anything that happens in October, November, and December, and we don't generally give a whole lot of monthly color, but we felt like based on current market conditions that warranted talking about the first few weeks of January, and that's what we're pleased with is we've seen what we would typically expect to see as we move through these first few weeks. I think we saw the starts kind of align with our sales pace in the quarter, and I think we're going to look to try to maintain that relationship through this time of the year as we're seeing good sales demand in the early spring selling season, we'll be replacing those homes with new starts to continue having inventory in the shelf available to sell. As we see marginal improvement in our inventory turns and home construction times, you're starting to see and you see that in our numbers, a larger percentage of our inventory homes on the completed side, which allows us to meet the market, which quite frankly is available to us today, which is shorter-term close. I think the pricing and the margins we realized on our early project sales benefited from construction and lower construction cost environments coupled with a very attractive rate environment when we sold those and that continued to some degree into our first quarter deliveries, we would expect to see some kind of a more normalized reversion to demand to a mean. Specific to Horton, our inventory position puts us in a more confident place to be able to say we're going to see that pick up with the level of completed homes we have and the stage of construction, the homes behind those are at, because what we're seeing the most success in today is buyers who do want a home quickly because they can get that certainty of not only close date, but most importantly, interest rate."
}