{
    "symbol": "SWX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 16:36:13",
    "content": " Specifically, adjustments to second quarter earnings include $28.8 million of collective non-recurring shareholder activism, settlement, stockholder litigation and strategic review expenses, as well as certain MountainWest costs expected to be non-recurring over the longer term. The Southwest Gas Utility delivered a record 12-month operating margin of $1.1 billion added 39,000 new utility customers in same period and maintained a high customer satisfaction score of 95% in the second quarter of 2022. MountainWest with its unique structurally advantage critical infrastructure delivered $62 million of revenue in the second quarter, achieved an adjusted EBITDA in line with expectations and remained on schedule with transition integration work. Corporate and administrative expense net of tax increased $22.7 million between quarters, primarily due to $17.1 million associated with the overall strategic review process, proxy contest and related litigation and settlement costs. Normalizing for O&M per customer growth of 1% per year, a more comparable starting point for Q2 2021 O& M would be about $52 per customer or $111 million for the quarter. Other than the transitory costs, the remaining $2 million increase in O&M between quarters is due to inflation and other items and is consistent with our target of O&M per customer growth of about 1%. MountainWest $15 million net income in the second quarter and $19 million of adjusted net income after accounting for non-recurring expenses associated with consultant fees, integration costs and one-time employee benefits. While most of the strategic review costs were incurred at the holding company level, approximately $2 million of these costs were reflected in Centuri's operations. While we continue to advance the Centuri and MountainWest processes, we will remain focused on the performance of these business units and prioritize delivering growth across our rate base, ROE improvement, earnings and dividends growth followed while continuing to meet or exceed our customers' expectations."
}