{
    "symbol": "SWX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 18:41:02",
    "content": " Centuri, this quarter generated $750 million in revenues, which was a 20% increase compared to last year's quarter, driven principally by the inclusion of Riggs Distler, but it was also a 6% organic increase from our legacy gas and electric infrastructure businesses. Centuriâ\u0080\u0099s financial performance was also impacted this quarter by increased amortization expense, about $3 million, an increased interest expense, $10 million primarily related to the acquisition of Riggs Distler has interest expenses more than doubled due to higher rates on the acquisition debt. In addition, with over $20 plus million in that incremental revenue assistance from our customers that I previously mentioned, we expect to drive growth and perform significantly better going forward than we have been able to during 2022. MountainWest delivered a $12.3 million of net income in the third quarter, while results were impacted by $5.7 million of pre-tax non-recurring expenses primarily associated with post acquisition integration costs. With the acquisition of MountainWest a year in 2021, which was financed with holdco debt at a Fed fund rate increases, the interest component at holdco was $13.8 million for the third quarter of 2022. The corporate and administrative line also included $6.8 million pre-tax of strategic review and related costs for the third quarter of 2022, which are components in that adjustments line. On a GAAP basis, utility results improve from a loss of $27.5 million in last year's third quarters to a loss of $22.2 million in the third quarter of this year. The $6 million increase in other income includes $3 million of higher interest income, primarily on deferred purchase gas adjustment receivable balances, and a $3.3 million reduction in non-service pension costs offsetting these items with a temporary $1.5 million decline in returns on COLI policies. MountainWest earned $12 million of net income in the third quarter and $17 million of adjusted net income after accounting for non-recurring expenses associated with standup integration costs, consultant fees and one-time employee benefits. At Centuri, we modified and tightened our 2022 revenue guide to $2.6 billion to $2.7 billion from the previous $2.65 billion to $2.8 billion due to reduction in expected storm restoration work and continued customer supply chain issues that have temporarily delayed certain projects. So that in addition to the $20 plus million that we have from the customers and then as Greg mentioned, we took â\u0080\u0093 the integration with rates we took over $20 million out of business and it's non-recurring expense that's gone away."
}