{
    "symbol": "PKI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 11:50:22",
    "content": " While Max will share more details with you in a bit, it was encouraging to see our Life Science and Diagnostics business finish off the year on a strong note resulting in 9% non-COVID organic growth for the full year. At this point, we have continued to see an impact from the change in COVID policy in China and assume that we will not see our immunodiagnostics business there return to normal until the second half of 2023, which will have a big tough end impact on our overall expected growth for the year, particularly in the first half. Our Life Science and Diagnostics business generated 8% non-COVID organic growth in the quarter, which was in line with our expectations. For the full year, our Life Sciences and Diagnostics business grew 9% organically, excluding COVID, which includes a 300 basis point headwind from the China lockdowns. From a product perspective, our Life Science research reagents, assays and pharma services represented approximately 54% of our total life science business in 2022, including acquisitions and grew in the low double-digits organically in the quarter and for the full year. Our instrument and related services, which represented approximately 31% of our Life Science revenue in 2022 also grew in the low double-digits in the quarter, which finished off an exceptional year with approximately 20% organic growth. Finally, our informatics business, which represented the remaining 15% of our Life Science revenue in 2022, grew in the mid-teens organically in the fourth quarter, also finishing off an outstanding year of approximately 20% organic growth. Excluding China, our immunodiagnostics business continued to perform very well and grew in the high-teens organically year-over-year in the quarter excluding COVID and was up mid-teens organically ex-COVID outside of China for the full year. So to look at it another way, when including the impact from lockdowns, our immunodiagnostics business was still up approximately 10% in the fourth quarter ex-COVID and grew low to mid-single-digits for the full year overall. On a non-COVID organic basis, our reproductive health business declined slightly year-over-year in the fourth quarter, but we're still able to deliver mid single-digit growth for the full year. To give you some perspective on the financial power of our life science and diagnostics business, this guidance implies at least the mid-teens underlying year-over-year EPS growth when excluding COVID completely in both years. Dan, your line is now open. Dan, your line is now open."
}