{
    "symbol": "CLLS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 11:08:04",
    "content": " In December 2022, Cellectis presented positive preliminary clinical data from 5 additional patients from our BALLI-01 trial evaluating UCART22 in patients with relapsed or refractory B-cell acute lymphoblastic leukemia or ALL. In December 2022, Cellectis signed a $40 million credit facility with the European Investment Bank and in the same month, received a milestone payment from our licensed partner, Servier in connection with the Phase 2 trial of ALLO-501A for patients with relapsed or refractory large B-cell lymphoma. As Andre mentioned, 2022 has been a productive year for Cellectis with our proprietary clinical programs making progress and we were specifically excited to share additional preliminary clinical data from our BALLI-01 trial evaluating UCART22 in a live webcast last December. BALLI-01 is a Phase 1/2a open-label, dose escalation trial currently evaluating the safety and clinical activity of UCART22 given an escalating dose levels after lymphodepletion with fludarabine, cyclophosphamide and alemtuzumab or FCA regimen in patients with relapsed or refractory B-cell acute lymphoblastic leukemia. Compared to the last clinical update on BALI at ASH 2021, the webcast presented after the ASH meeting in December revealed data from 5 additional patients who received UCART22 at dose level 3, 5 million cells per kilogram after lymphodepletion with FCA. As Andre mentioned, these preliminary data support the continued administration of UCART22 after FCA lymphodepletion in patients with relapsed/refractory B-cell ALL and are very encouraging for patients who have limited, if any, treatment options, especially for those who have failed prior CD19-directed CAR-T cell therapy and allogeneic stem cell transplant. The BALLI-01 study is now enrolling patients with product candidate manufactured in-house at dose level 2, 1 million cells per kilogram after FCA lymphodepletion. Last December, Cellectis presented clinical data in an oral presentation at ASH 2022 on its AMELI-01 clinical trial evaluating UCART123, a Phase 1 open-label, dose escalation study in patients with relapsed or refractory acute myeloid leukemia. I would like to highlight that our financials, the cash, cash equivalent, current financial assets and restricted cash position of Cellectis, excluding Calyxt as of December 31, 2022, was $95 million compared to $177 million as of December 31, 2021. The adjusted net loss attributable to shareholders of Cellectis, including Calyxt, which excludes non-cash stock-based compensation expenses, was $98 million or $2.15 per share in the 12 months of 2022 compared to a loss of $102 million or $2.27 per share in 2021."
}