{
    "symbol": "CLLS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 14:36:09",
    "content": " The BALLI-01 study evaluating UCART22 in patients with relapsed or refractory B-cell acute lymphoblastic leukemia is currently enrolling patients at dose level 3, 5 million cells per kg with fludarabine, cyclophosphamide and alemtuzumab preconditioning regimen. The consolidated adjusted net loss attributable to shareholders of Cellectis, excluding Calyxt, excluding noncash stock-based compensation expenses, was $43 million or $0.95 per share in the first six months of 2022, compared to a loss of $38 million or $0.86 per share in 2021. Please proceed with your question. Please proceed with your question. Please proceed with your question. And these total approximately $410 million in total, but the details have not been disclosed and part of the - the confidentiality we have between us and them, I think and also we expect potentially next year to have also the BCMA trial from Allogene to start pivotal trial and also to receive milestones, there are like $185 million in total to the BLA and post-commercial milestones and about the detail also are not disclosed and are part of the confidential that the company has with Allogene. But we're very excited by the data that they have a pain with both CAR-T, we think that ALLO-501A is not only first allogeneic CAR T, but is also part of the first implant, autologous and allogeneic of the CD19 CAR-T - and we think that this is going to totally ride out to the pace and weâ\u0080\u0099re very excited to  trial seeing the data. Please proceed with your question. But just a quick question, Andre, and team on the data at the end of the year from one of the projects and then maybe looking to next year, the trials 104, 123, CS1 and CART22 have been designed with like a dose expansion with - if you've seen a really good signal in some tumor type to maybe go to a pivotal trial. We think, for example, that UCART22 because there is a high unmet need and the scarcity of options beyond CD19 autologous, there is definitely room for the dose expansion phase of the trial once we found the recommended Phase II dose with our Raleigh internal manufactured product for the - those expansion to be potentially registrational. The thing is that - we've been developing a series of CART from allogeneic CAR, n numbers of years from now, like UCART19 that has been renamed ALLO-501,we started dosing the first patients six years ago, like in 2015, like seven years ago, by the way, more then seven years ago and then since then, there was like the BCMA CAR-T, so 19 was license to survey, we  Pfizer, then became Allogene and Allergen is very brilliantly developing these 2 CAR-T then we went for 1 to 3 then CS1 then 22. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}