{
    "symbol": "ELY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 23:49:10",
    "content": " Total net revenue was just over $1 billion, up 60% year-over-year on a reported basis or up 31% on a pro forma basis, which includes Topgolf revenue for the full quarter of last year. Looking at our segment performance, Golf Equipment had another excellent year, generating $468 million dollars in revenue, driven by continued high demand and improved supply in our golf clubs and balls business. Including January and February for Topgolf, proforma non-GAAP operating income would have increased $27.6 million or 35% year-over-year and operating margins would have increased slightly to 10.2% compared to 9.9% for the first quarter of 2021, despite the negative impact of foreign currency, freight expense and other inflationary pressures previously mentioned. Moving back down the income statement, non-GAAP other expense was $22 million in the first quarter, compared to $6 million in Q1, 2021, primarily due to a $16 million dollar increase in interest expense related to Topgolf. Lastly, Q1 Adjusted EBITDA was $170 million, up $42 million or 33% over Q1, 2021 on an as reported basis or up $40 million or 31% on a pro forma basis when including Topgolf results for the full three-month period. For the full year we expect total CapEx of approximately $315 million, net of REIT reimbursements, including approximately $230 million for Topgolf and $85 million for the non-Topgolf business. This estimate assumes approximately $1.56 billion in revenue for Topgolf for the year, approximately $1 billion in revenue from the Apparel, Gear & Other segment, and an increase of approximately 10% in our Golf Equipment segment revenue as compared to full year 2021. Our full year adjusted EBITDA also increased and is now projected to be $535 million to $555 million, which assumes approximately $225 million to $240 million from Topgolf. Given the strong results this evening, and again that rise or the rate EBITDA outlook or guidance for the year, you know you're well on your way to that $800 million at least number for I believe 2025. So we expected it to be over $300 million in revenue this year, over $50 million in EBITDA and absolutely, you know we would expect operating leverage as it continues to scale from there and every indication is that it's going to continue to do that. And then just finally, just in terms of the promotional environment, with your confidence in a sustained demand for both golf equipment and the soft good side of your business along with Topgolf, just curious to know what you are seeing really in any terms of promotional environment across your channels and kind of what’s embedded in your expectations for the back half along these lines."
}