{
    "symbol": "COIN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 20:50:03",
    "content": " We also have shared with you in the shareholder letter a way to look at our subscription and services revenue price adjusted, i.e., if you freeze price as of Q2 and look at that historic trend line, we're pleased to see pretty linear growth quarter-over-quarter as we continue to roll out breadth and depth of different product experiences on our platform. Third, and Brian touched a lot on this, but there's a global wave towards regulation, and we're committed to working alongside policymakers to build workable regulatory framework for the crypto economy that addresses risk but also enables the development of adoption of digital innovation. And going back to our S-1 from last April, we shared with you in our opening founders letter that we're really looking to breakeven across the cycle as we think it's important in these early days in the nascent days of crypto that we're building for growth, we're expanding the breadth and depth of products on our platform, and we're bringing new users into this ecosystem. And then finally, we should note that there is a larger amount of trading volume moving offshore as high-volume traders and market makers seek diversification overseas with derivatives and other products that aren't currently available in the U.S. Now Coin is live in 100-plus countries, but we are overweight the U.S. And that's actually the reason we're so focused on compliance and moving the innovation conversation forward in the U.S. That's why Brian was talking about the trip we made to D.C. and the cycles we're spending on that. They trust our products because they're safe, easy to use, and we give them an integrated platform to grade with a range of Coinbase assets and in crypto activities like staking and spending on your card and access to the DApp wallet, NFTs, increasing breadth of things you can do on our platform. But over the long term, we continue to believe that there will be fee compression, and we started to build a diversified set of products that monetize in other ways, which is why we're so happy to see subscription and services become an increasing percentage of our net revenue, 18% in Q2. So if you look at our product areas that we outlined in our shareholder letter, what you see in terms of the developer products with Coinbase Cloud or some of the actions that we're making within Web3, we think we'll continue to add diversified revenue streams over time. And it also allows our customers to access the latest development in crypto, whether that's interacting with DeFi or smart contracts or people want to use NFTs or accessing what's broadly being called now Web3, which is a really exciting area of development, we think will be a big area of growth. So we are not looking to take advantage of the price dislocation and just buy that back because we think that's a financial engineering activity and not really in the best interest of building a long sustainable operating business, which is what we're focused on doing. And then on the venture side, we typically like seed stage investments during this time because, again, it's a builder's market, you tend to see a lot of innovation happening at the ground level such as OpenSea during 2018 when we invested in that seed OpenSea during 2018 when we invested to be prudent about capital allocation, but we think we have a very unique lens on development across the crypto space, and we're going to take advantage of it."
}