{
    "symbol": "COIN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 22:16:09",
    "content": " And I'm really excited to see what the leaders of each of those product groups can do and we have some really incredible talents and rising stars in the company and we're giving them more, more ownerships here, which I think will drive our efficiency at scale, which is a â\u0080\u0093 by the way I put out a blog post earlier this year and how we're going to operate efficiently at scale, it's probably good to go back and look at that too. As weâ\u0080\u0099re working on all these policy efforts, weâ\u0080\u0099re also not just sitting back idly, weâ\u0080\u0099re going to continue to build and innovate across all of our product suites, and itâ\u0080\u0099s going to continue to make us think about how weâ\u0080\u0099re making investments internationally, because of course our mission has increased economic freedom for the world. So as we look at product and geographic expansion opportunities to grow revenue in a larger TAM market, that includes things like derivatives in the U.S. and globally, we think there's a lot of ways to expand that TAM. And I donâ\u0080\u0099t want to share anything too much beyond that at this point, but itâ\u0080\u0099s important for us to make sure we have global coverage and we are serving customers from the best jurisdictions that we can globally and we need to see the regulatory environment evolve and get to that clarity both in the U.S. and in other markets where weâ\u0080\u0099ll continue to invest. So we think continuing to make USDC, frankly a better dollar, meaning itâ\u0080\u0099s faster, itâ\u0080\u0099s 24/7/365, and now it pays an attractive reward rate, will help with adoption not only for us, for folks who are looking to have a stable crypto as they think about trading and moving to other assets, but getting access to a U.S. dollar exposure and non â\u0080\u0093 in countries that donâ\u0080\u0099t have easy access. But I made the decision back then to actually build the company in the U.S. and I felt like, look, it may be a bit difficult, it might be a bit more difficult because the U.S. doesnâ\u0080\u0099t always act as quickly or nimbly as some kind of like a special economic zone as like Hong Kong or Singapore, but I think itâ\u0080\u0099s the right bet long term, right? And Brian, I would just also add to reiterate this is, I think when you see the data so starkly that the volumes are moving offshore, weâ\u0080\u0099re optimistic that us lawmakers, legislators and regulators understand that now is the time to act on very sensible regulation so that innovation and technology and tax sellers can actually happen in the U.S."
}