{
    "symbol": "COIN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 21:02:10",
    "content": " I think that something like that, that would allow us to wrap traditional securities, could -- and I also just make it really simple for people to go and register cryptosecurities, that could be pretty interesting and something we'd like pursue in the future. But I think what's even more important than that actually is that we can go and activate the roughly 50 million people or so who have used crypto in the United States and asking them to -- as they're very passionate about crypto, many of them. Securities laws doesn't exist in order to turn everything of value in our economy, whether it's baseball cards or sneakers or digital assets like crypto, into a security that only a small number of people or the elite are able to buy or trade. I would say that -- in general, we don't currently have today an entity in Hong Kong, but I've been really pleasantly surprised to see that there is clarity like this -- this is a great example of what you just mentioned of the financial hubs around the world, of which Hong Kong is one of those, are making really good progress towards regulatory clarity. And I think there's generally a pretty broad consensus amongst Congress, the folks that I've spoken with, that we do want to bring that into the regulatory perimeter and to new legislation that just had some good best practices around making sure that funds were audited, things were back to one to one. I think the other one is really around how to carve up the territory between CFTC and SEC, what's the crypto commodity, what's the crypto security, what is something else entirely like a stablecoin or artwork likes NFTs. And there's a number of other rules there that I think just, again, apply the best practices from traditional financial services around let's have a great anti-money laundering program and get rid of any kind of wash trading and reasonable kind of KYC procedures and things like that. The only thing I would add, Brian, is that back in July of last year, as mentioned earlier, we did file a petition for rule-making with the SEC that outlined dozens and dozens, some things like more than 50 questions that we believe need to be answered in order to bring regulatory clarity to the digital asset space."
}