{
    "symbol": "COIN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 21:05:27",
    "content": " If you have crypto that you buy with us and you start it with us and then it's easy to use things like Coinbase NFT and -- so our suite of products, I think, makes us a little bit unique out there in the sense that you'll see some of those will be in later stages, maturing revenue-wise, other ones will just be starting. Coinbase has spent a lot of time and energy over the last 10 years building a lot of these core technologies, like how to store crypto securely, and how to connect into all the blockchain to make sure they're staying in sync, how to do blockchain analytics to make sure it's done in a compliant way and how to trade crypto and stake and mints NFTs and index all of the metadata that's out there. And so I think for many of these companies, they're not going to want to -- in the same way, they don't want to run their own data center, unless that's their core competency, they're going to use a cloud product. And my hope is that basically, Coinbase is going through a transition where many of these services that we've had to use internally for our products over the years, we're now in the process of externalizing them through our Coinbase Cloud product and building that in a way it's robust. We think about our cash for funding our operating needs, we use it for self-insurance, the potential risks on our platform, we're using a portion of it for lending off of our balance sheet to facilitate bootstrapping, essentially the borrow lens market for crypto and allowing institutions to trade on margin, eventually providing loans to our retail users backed by crypto. And then as you pointed out, there's also -- I'm not sure if it would be a network effect, but you could call it that, which is basically -- I would call it vertical integration, really, which is that Coinbase already has many, many customers where that's where they store their crypto and that's where they bought it. If we can just natively integrate the NFT app into our existing products your crypto was already on Coinbase, then it's just one more click to buy it, I think that will be really powerful. And if we look at MTUs, monthly transacting users, we look at the amount of crypto that's custodied in Coinbase Wallet, we look at revenues, things like that. And so people don't accidentally lose their funds or forget their password or anything like that, I firstly think Coinbase Wallet is one of the most important things we're working on because it's going to allow us to offer the same functionality and services that we do with our retail app in a lot of emerging markets, where the regulatory environment is less clear. It's going to allow people to use the very latest stuff happening in crypto in a more decentralized way, things like decentralized exchanges and DeFi and Dow's and NFTs, like a lot of the stuff is coming first to Coinbase Wallet, self custodial wallets out there."
}