{
    "symbol": "GIFI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 10:57:04",
    "content": " During the quarter, we continued to successfully execute on our strategic transformation, highlighted by another quarter of solid results for our Services Division and small-scale fabrication business, the award of a large offshore fabrication contract and the continued wind down of our shipyard business. First, looking at our Services Division, it was another strong quarter, and the outlook for the business remains encouraging, given the favorable trends in the offshore market in the Gulf of Mexico and the continued tight labor availability. Our third quarter Services revenue grew over 140%, and EBITDA was up nearly 170% compared to the same period in 2021, driven by continued solid results from the acquisition and integration of DSS, strong activity in the offshore services market, which benefited our legacy Services business, and a more favorable business mix. This was the key driver behind our strong growth in new project awards during the quarter, with third quarter fabrication bookings growing to $117 million, up from $12 million in the second quarter of 2022 and $6 million in the year ago period. In addition to our success in the large fabrication market, we continue to see robust activity in our small-scale fabrication business, which was the key driver behind our third quarter Fabrication segment revenues nearly doubling from the year ago period. The strong growth in the quarter was a function of the favorable end market trends, including subsea structures and pull-through fabrication work from our services customers, and we expect continued growth in our small-scale fabrication business for the foreseeable future. Consolidated revenue for the third quarter 2022 was $39.6 million, an increase of 102% from the third quarter 2021, with the year-over-year increase attributable to strong growth in both our Services and Fabrication Division. Specifically for the Services Division, revenue for the third quarter of 2022 was $22.6 million, an increase of $13.3 million or 143% compared to the third quarter 2021. Services EBITDA for the third quarter was $2.8 million or 12.3% of revenue, up from $1 million or 11.2% of revenue for the prior year period. For our Fabrication Division, revenue for the third quarter of 2022 was $15.4 million, an increase of $7.3 million or 90% compared to the third quarter 2021."
}