{
    "symbol": "TYL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 14:09:03",
    "content": " Subscriptions revenue was just slightly above Q3 of last year due to the expected $37 million decline in COVID-related subscription revenue, but organically rose 14.5%. Second, COVID-related revenues and bookings were approximately $43 million in Q3 last year, versus $11 million in the current quarter. Please go ahead, your line is open. Your line is open. What we're starting to see now also in the market and as we look into next year, is our two divisions, which have had really more dependency on licenses, particularly in the last couple of years has obviously been public safety and Tyler Federal, Tyler Federal has been moving, I think, a little bit faster to SaaS. Please go ahead, your line is open. Your line is open. I think the -- for NIC, there are state enterprise transactions, which is a growing revenue line, and it's something that we're looking to grow, while it was up in Q3 year-over-year, it was down a little bit from Q2. Your line is open. Your line is open. Your line is open. And I'd say the overall mix on revenues and margins for next year, probably -- net-net, we probably come out pretty similar to this year's cash flow with maybe our increase is a bit less than we previously expected, but we still expect cash flow to grow. Your line is open. Your line is open. Your line is open. But I think the big growth there, we've talked about, we expect to continue to see our payments business grow meaningfully through things like with the Rapid acquisition, getting more into the dispersing side and driving the NIC payments platform that's currently primarily at the state level down into our local government customers, and we expect to start to see fruits of that next year. Your line is open. We've seen it in -- I think we've had a similar thing with e-filing contracts if they weren't -- we would have a multiyear contract, but if they weren't a fixed fee, there were times we couldn't put the whole contract in value in there, are occasionally, but I'd say it's a handful of times within a year and generally not on contracts of this size, but we fully expect that the Department of State will fully utilize this contract. Your line is open."
}