{
    "symbol": "QIPT",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-14 15:59:08",
    "content": " As of fiscal Q2, Quipt currently has a $220 million run rate revenue and a $49 million run rate adjusted EBITDA, giving us a significant growth platform to continue driving economies of scale. We saw a rise in revenue of 38% Q1 2022 to fiscal Q1 2023, bringing the total to $40.8 million and a 50% increase in adjusted EBITDA, bringing the total to $9 million. Through the company's continued use of technology and centralized intake processes, respiratory resupply setups and/or deliveries increased to 69,482 for the quarter ended December 31, 2022 compared to 51,137 for the quarter ended December 31, 2021, an increase of 36%. The company's customer base increased 32% year-over-year to 99,420 unique patients, served in fiscal Q1 2023 from 75,309, unique patients in fiscal Q1 2022. Compared to 118,100 unique setups and deliveries in fiscal Q1 2022, the company completed 146,350 unique setups and deliveries in fiscal Q1 2023, an increase of 24%. Adjusted EBITDA for fiscal Q1 2023 was $9 million at 22% margin compared to adjusted EBITDA for fiscal Q1 2022 of $6 million at 20.3% margin, representing a 50% increase year-over-year. Net income for fiscal Q1 2023 was $325,000 or $0.01 per fully diluted share compared to net income for fiscal Q1 2022 of a loss of $2.1 million or $0.06 per fully diluted share. The company reported $3.5 million of cash on hand and total credit availability of $101.9 million as of December 31, 2022 with $16.9 million available towards line of credit and $85 million available on DDTL. Including the acquisition, Quipt has a combined annualized run rate revenue and annualized run rate adjusted EBITDA of $220 million and $49 million respectively, including the $2 million of cost savings and synergies based on Quipt's reported audited financial results for the first quarter ended September 30, 2022. Post-acquisition Quipt's recurring revenue will increase from 77% for the quarter end December 31, 2022 to 82% on a pro forma business. We believe that 8% to 10% in that is probably on the lighter side in that especially when we get into the back half of calendar 2023 between the expansion of the sales force that we're starting to see some impact from and then the full integration in that Great Elm and then supply chain, like we've mentioned, we think at a minimum we can get back to where we were historically prior to supply chain constraints."
}