{
    "symbol": "X",
    "quarter": 3,
    "year": 2021,
    "date": "2021-10-29 12:47:05",
    "content": " And that's important, we continue to create longer-term value with customers by prioritizing innovation, differentiation, and strategic goals; and look forward to building deeper relationships that unlock the value of U.S. Steel for our customers, and provide them the certainty of a regional supply chain. Secondly, as Dave touched upon in his opening remarks, the value-added mix of the downstream finishing assets certainly helps drive EBITDA, EBITDA margins of the second mini mill contribute to the $650 million of run rate EBITDA when do you think about being able to serve advanced high strength steel automotive markets, value-added construction, and appliance markets, the underlying mix of the facility is going to be quite rich. Thank you very much. So Alex, in the near term, we provided some incremental guidance in 2022 on the capital spending front, about $2.3 billion in total, primarily made up of the strategic investments that we've just discussed here this morning, mini mill number two, the non-grain oriented electrical steel line at Big River, as well as the new coating line at Big River. Thank you very much. So we will -- we very much look forward to 2024 and beyond, when these projects begin to hit Run Rate EBITDA contribution, there's a significant opportunity to generate incremental earnings, incremental free cash flow, and further expand our through-cycle margin profile; in our mind, those are all key financial outcomes that lead to higher valuation and the business model that we're seeking. Thank you very much. Thank you very much. Thank you very much. I think one of the things that's opted over -- underappreciated is that U.S. Steel really is uniquely positioned with high-quality, low-cost iron ore and highly capable electric arc furnace in mini mill production. Thank you very much. So it again  from the passion , I'm not just bullish, I am over-the-top super-cycle on this because I am a strong believer, this is stronger for longer and it's -- you always get the existential threat to the unknown geopolitical stupidity, or wherever props up, but the bottom line is this, -- the economic circumstance for macro-environment and from a steel industry environment, and then of course, with U.S. Steel, we think our strategy is positioned just right to make the progress. Thank you very much."
}