{
    "symbol": "X",
    "quarter": 1,
    "year": 2021,
    "date": "2021-04-30 14:50:14",
    "content": " Second on optionality, Big River Steel's first quarter performance and early successes of our best of both footprint confirm the inherent optionality of our strategy. Please go right ahead. I think you've heard us talk though, about in the medium to longer term transitioning some of those previously integrated only grades of steel to Big River where it makes sense to leverage their lower carbon footprint and to leverage our proprietary steel lines as we think about coming to market with our verdeX line of steel. But if you get back to the best for both and then - best of both and then best for all, to Rich's point with this D-Gasser we're able to take the background, the experience the knowledge from US Steel and help work on that D-Gasser and at the same time, the nimbleness that Big River Steel is able to operate the entrepreneurial spirit, we're touching that virus with the integrated mills. Thank you very much. Please go right ahead. Yeah, well, I think is the way to think of this first off David as you get to the Mon Valley, and you think about that again, the capital allocation in terms of what we're - where we're putting the money, you can pretty much go pencils down on the 1.3 billion that remains at Mon Valley that is not going to be spent, we have the endless caster that's the largest portion of that has been built and so we have optionality with where that might go. Well, I - what we've said I think is our preference is for organic growth, use our existing footprint and look for those advantaged assets whether either have a cost advantage or a capability advantage and spend the money there, expand the money there, grow the opportunity at Big River Steel for example, and see what's possible. Thank you very much. Please go right ahead. Thank you very much. Thank you very much. Please go right ahead. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Please go right ahead. Yeah, Matt, I think that Christie's remark sized 500 million is kind of the minimum opportunity in our mind that we plan to execute against in the near term, but we'll continue to evaluate the acceleration, the cash flow generation of the business to the extent that we think the time is right, and conditions are supportive, I think that there's likely an opportunity for us to increase that amount of de-leveraging. Thank you very much. Thank you very much."
}