{
    "symbol": "CI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 12:00:26",
    "content": " Cigna Healthcare, our health benefits platform also had a strong year, delivering customer growth along with differentiated medical cost performance for the benefit of our customers and clients. We're very pleased with our strong performance in 2022, reflecting focused execution and growth across both Evernorth and Cigna Healthcare, with each segment achieving pre-tax adjusted earnings growth in line or above our long-term targets. Looking at full year 2022 specifically, key consolidated financial highlights include total revenues of approximately $181 billion, and adjusted earnings of $7.3 billion after tax or $23.27 per share, reflecting 14% growth from 2021. Similar to the first three quarters of 2022, Evernorth's strong results in the fourth quarter were driven by continued expansion of our accelerated growth businesses, led by our specialty pharmacy as well as our focus on affordability and delivering lowest net cost solutions for our clients and customers. Overall, Evernorth delivered another strong year, focusing on driving value for clients and customers and expanding our partnerships and relationships, all while achieving strong revenue and pre-tax adjusted earnings growth in line with our long-term growth targets. Fourth quarter 2022 performance contributed to full year results with adjusted revenues of $11.1 billion, pre-tax adjusted earnings of $500 million and a medical care ratio of 84%. Overall, Cigna Healthcare delivered for our customers, clients and partners, all while driving a strong year of customer growth and margin expansion with full year pre-tax adjusted earnings growth of 13%, which is above the high end of our long-term target range of 8% to 10%. For Cigna Healthcare, we expect full year 2023 adjusted earnings of at least $4.4 billion, representing growth of at least 8% year-over-year. Key assumptions reflected in our Cigna Healthcare earnings outlook for 2023 include the following: regarding total medical customers, we expect 2023 growth of at least 1.2 million customers, with growth across each of our U.S. Commercial, Medicare Advantage and individual businesses. Two, you think about the work taking place collaboratively in phases, with the first phase of well underway working through and successfully securing approvals and contracts with building momentum, whereby we will put in place with Village, capabilities such that we could enable more targeted access to preferred or higher-performing specialists within the Cigna Healthcare Life portfolio and the direct serve portfolio of our relationships as Phase 1 and expand some of the capabilities to coordinate care, whether it's expansion of virtual capabilities, expansion of behavioral capabilities or otherwise. So first off, I'd be remiss if I didn't say we're really pleased with another year of strong growth that we expect here in 2023 and following growing almost 1 million net customers or 5% in 2022. But before I comment on that, just stepping back for a moment, it's clear that Medicare Advantage has represented and continues to represent a significant both market opportunity as well as a growth opportunity for the U.S. today serving about 30 million seniors continued growth and seniors reinforce the value, the clinical quality and the service quality they receive by continuing to renew and/or expand relationships in MA. So when you consider all of this and our continued investments in our accelerated growth platforms such as MA, we'd expect our 2023 Cigna Healthcare margins to land within our target 9% to 10% range, but at the low end. With Evernorth and Cigna Healthcare, we demonstrated that we are serving the current needs of our customers, clients and partners, and we expect to deliver another year of customer and earnings growth in 2023."
}