{
    "symbol": "DSP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 21:36:06",
    "content": " Our first quarter results were highlighted by accelerating growth and active customers, which increased 23% year-over-year, as we continue to gain share across the programmatic advertising market. The spending trends we are seeing across our business, coupled with the strong new customer growth we are experiencing and the increasingly strategic conversations we are having with large customers are all highly encouraging trends that reinforce this confidence. It also means that we are becoming a go to platform for not only CTV, but across all channels as evidenced by the broad base spending growth we're seeing in desktop and mobile which is up 67%, audio up 60% and digital out of home up 346%. Our client's needs are only increasing as we introduce new capabilities into our software, updates in our data marketplace, identity resolution, advanced measurement and our updated household ID offering are resulting in heavy momentum with clients that we believe will further improve our revenue growth rates in the second half of the year. Advertisers spend on the platform increased 44% over the prior year period, which represented in our second highest quarterly growth rates since 2019. In terms of top-line metrics for the first quarter, as I said advertisers spent across our platform increased 44% over the prior year period, accelerating from 26% growth in Q4. For the second quarter of 2022, we expect advertiser spend across our platform to continue to outpace expected market growth rates, with expected growth of at least 35%. For the full year, we are reaffirming our previously issued guidance and expect advertiser spend across our platform to grow at least 35%, we expect revenue in the range of $260 million to $270 million, which represents year-over-year growth of approximately 16% to 20% and adjusted EBITDA in the range of $25 million to $35 million. But one of the factors in terms of the growth rates and revenue and ex TAC that we are expecting that to improve in the second half is, if you look back at the first half of 2021, we had a significant amount of testing on the platform on fixed price that now is on percentage of spend. But because we had a higher mix of fixed price testing last year, and now so many of those have moved over percentage of spend, and so many of our new customers are on percentage of spend, we expect that back half really the growth rates and revenue to really increase to where our full year guide will end up at. And I would add over time post 2022 because we believe percentage of spend will continue to be the driver, you will see the growth rates and revenue in ex TAC get closer and closer to the growth rates in percentage of spent -- in terms of advertisers spend as fixed price component becomes a smaller and smaller piece of the total spent. What we're seeing is that we had great success last year with those customers and tests on our platform, they have shifted to percentage of spend, they're spending even more. I think what we don't -- I know our retention rates increase in the percentage of spend and they're spending even more so really, it's fast forwarding our progress and our sales cycle with these customers. And when we think about how much customers are spending with us, I think fast forwarded us in our long-term kind of projections and it's actually really great to see, does have a drag on the short-term on the revenue growth."
}