{
    "symbol": "DSP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 22:23:02",
    "content": " CTV represents more than one third of total spend on our platform, and according to E-marketer, the U.S CTV ad spend market will grow by 27% in 2023, and it's expected to continue to grow at double digit rates over the next few years. Viantâ\u0080\u0099s Scaled Household ID is just one of the many differentiating factors driving our customers to consolidate their ad spend on our platform, and it distinguishes us from our peers that are reliant on cookie-based tech that does not scale in the new emerging technology channels such as CTV  Looking to the future, we believe that the shift from linear TV to CTV is still in its early stages. We had a strong end of the year with active customers increasing 6% year-over-year to 326 in Q4, driven by growth in mid-market ad agencies and client direct customer segments which help drive advertiser spend per active customer by 9% year-over-year. Our mid-market advertisers are another segment of growth and our responsible for emerging vertical growth areas like sports betting, direct to consumer and retail media, just to name a few, these businesses are rooted in first party data efficient programmatic buying and driving, customer acquisition growth, all common traits in what we look for in bringing on the right types of mid-market customers. As Tim mentioned, we are pleased to report that our Q4 performance was within our previously issued guidance for advertiser spend, growth, revenue, and contribution ex-TAC, and for the quarter we exceeded the high end of our previously issued adjusted EBITDA guidance by 160%. Advertisers spend per active customer also increased 9% on year-over-year basis, and percent of spent customers spent on average nearly three times more than fixed price customers in 2022. Definitely de-sell and instability in the outlook, but I think what's different, what we're seeing right now is stability in the outlook, although it's a slow start to the year management teams were slow to get budget set and, and therefore delayed ad spending that's just across the board. And I would say data platform, data platform is really going to be meant the, the why, so the, the change of the name one and then two of the feature sets that we're, we're really adding on is really going to drive, it's going to allow customers, all of these customers of ours that have signed up to companies like Snowflake and you know, all these other clean rooms, they've all done it and the data's there, but they have no idea how to get it out of there and put it to use in advertising. I wouldn't read into any one quarter or the other, but we're, we're very focused on getting those customers into the percenta spend model because that's when they enter our cohort and we have more predictability into the future."
}