{
    "symbol": "DSP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 09:50:13",
    "content": " Total advertiser spend on our platform grew 19% year-over-year, ahead of market ad spend growth rates as we continue to gain share in the digital advertising market. We continue to see marketers and our agencies seeking independent omnichannel DSP that is fully self-service has industry-leading integrations across all channels and a strong measurement offering that accurately calculate return on ad spend, again, reinforcing our leadership position as a DSP with the strongest measurement capabilities, a point of differentiation that brings strong tailwinds of untapped spending behind it. Connected TV growth accelerated from 2% in Q2 to 13% in Q3 and audio grew 51%, audio now represents 6% of total advertiser spend and is now on a growth trajectory to what we saw similar to a few years ago with Connected TV. Although we had a strong year -- although we had a strong year-over-year growth in spend of 19% in the quarter, we did experience a slowdown in certain verticals. Advertisers spend across our platform increased 19% in the quarter over the prior year period, reflecting continued market share gains and both revenue and EBITDA were within our guidance for the quarter. In terms of topline metrics for the third quarter, as I said, advertiser spend across our platform increased 19% over the prior year period and 1% over the prior quarter. Therefore, as the percent of spend, pricing option continues to make up a larger part of our advertiser spend mix relative to the prior year period, we will have a near-term drag on our revenue and contribution ex-TAC growth rates. While the impact of this mix shift has negatively impacted revenue and contribution ex-TAC growth rates in 2022 relative to advertiser spend growth rates, we have seen such growth rates begin to converge over the last two quarters and we expect that trend to continue to improve as we move forward and the impact of the mix shift becomes less significant. Since June, we have seen year-over-year growth rates in advertiser spend decelerate each month with spend across our fixed price pricing option actually declining over that period. On a quarter-over-quarter basis, we expect advertiser spend to increase between 1% and 11% over Q3 levels, which is well below the normal seasonal uptick we typically see in Q4. The pronounced decline in revenues due to expected declines across our fixed price pricing option due to the factors discussed, partially offset by continued growth across our percent of spend pricing opportunity. In Q4, we also expect advertiser spend growth rates and contribution of TAC growth rates to further converge as fixed price continues to represent a smaller share of the total metrics, another trend we expect to continue as we move into 2023. In terms of non-GAAP operating expenses for Q4, we now expect a range of $33.5 million to $34.5 million, which represents a year-over-year increase of 8% to 11% and a quarter-over-quarter change of negative 1% to positive 2%."
}