{
    "symbol": "OMER",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-13 23:17:04",
    "content": " To provide some background, in December 2021, we completed the strategic sale of the cataract surgery product that we developed and commercialize, OMIDRIA to Rayner Surgical for an upfront payment of $125 million, $31 million of retained receivables, substantial ongoing royalties on Raynerâ\u0080\u0099s net sales of OMIDRIA and the potential to receive a $200 million milestone payment by securing for OMIDRIA continuous separate payment of at least four years. Since OMIDRIAâ\u0080\u0099s market launch in the second quarter of 2015 through multiple CMS awarded and congressionally mandated pass-through periods, and then qualifying under the non-opioid pain management exclusion from packaging, OMIDRIA has received continuous separate payment from CMS interrupted over those eight years for a total of only 11 months, nine months in 2018, following successful legislation extending pass-through and two months in 2020 after qualifying for CMSâ\u0080\u0099 non-opioid packaging exclusion. Omeros received $17.9 million in royalties from Raynerâ\u0080\u0099s OMIDRIA fourth quarter net sales of $35.8 million, a new quarterly record. The potential advantages of OMS906 over other alternative pathway inhibitors on the market or in development include safety, through a meaningfully decreased infection risk by not blocking the adaptive immune response, compliance and convenience with significantly better dosing profile and once quarterly intravenous or subcutaneous administration and efficacy through greatly decreased risk and breakthrough of the underlying disease given that MASP-3 first is not an acute phase reactant and that OMS906 has a long half life, allowing MASP-3 to be blocked consistently and effectively. Our net income for the fourth quarter was $128.7 million or net income of $2.05 per share, compared to a loss of $17.5 million or $0.28 per share in the third quarter of 2022. The fourth quarter includes the $200 million milestone we earned from Rayner in December, which is included in discontinued operations. The $213 million year end receivable balance includes the $200 million in payment, as well as the OMIDRIA royalties for November and December, which are due 60 days after respective month ends. Upon the achievement of the $200 million milestone on December 29, 2022, OMIDRIA royalties decreased to 30% of U.S. net sales. Income from discontinued operations in the fourth quarter includes four key components, the $200 million milestone payment, $4.9 million of interest earned on the OMIDRIA contract royalty asset, $26.2 million of expense due to the re-measurement adjustments to the OMIDRIA contract royalty asset and state income tax expense of $4 million. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open. And one moment for our next question. Your line is now open."
}