{
    "symbol": "LWAY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 12:07:03",
    "content": " If you've not received the release, it is available on the Investor Relations portion of Lifeway's website at, www.lifewaykefir.com. Before discussing the results, I'd like to thank the whole Lifeway team for their impressive efforts and commitment, which have enabled us to seamlessly navigate the challenging operating environment our industry has faced this year and deliver for our valued partners and customers. The strategy we've put in place to build awareness for our flagship product has yielded our twelfth consecutive quarter of year-over-year growth at Lifeway, and we are grateful to our customers who have made this milestone possible. Net sales were $38.1 for the period ended September 30, 2022, an increase of $8.6 million, or 29.1% compared to the third quarter in 2021. It's important to note that even though we implemented price increases this year, branded Lifeway unit sales also increased by double-digits during the third quarter. Moving on to expenses; selling, general and administrative expenses increased $0.4 million to $6.3 million for the period ended September 30, 2022, from $5.9 million during the same period in 2021. Our net income during the period and September 30, 2022 was $1 million, reflecting EPS of $0.06 per basic and diluted share compared to a net income of $5 million or $0.03 per diluted common share during the prior year period. Capital spending increased approximately $0.9 million to $2.6 million during the same nine-month period ended September 30, 2022. In addition to the results, we continue to enhance our relationship with our retail partners and customers, increase our investment in sales and marketing to promote retention and attract new eyes to the brand and have put pen to paper on multiple new distribution deals, which I'll discuss shortly and I'm quite excited about. Despite that, demand for Lifeway products has increased meaningfully and we have expanded distribution and seen accelerating velocities with certain key retail partners. Our strong results throughout this quarter and this year to date, illustrate that our target consumers remain very focused on gut health and nutrition, which is a strong tailwind to Lifeway's addressable markets. For a September report from Brainy Insights, the global Kefir market is expected to grow from $1.46 billion in 2021 to $2.45 billion by 2030 at a CAGR of 5.9% during the forecast period 2022 to 2030. The global Kefir market is expected to grow at a CAGR of 6.4% during the forecast period of 2022 to 2027 up from their previous report this year, which cited a 5.6 % CAGR. As the dominant market leaders in the US Kefir industry, Lifeway is extremely well positioned to capitalize on this growing market and consumer interest. After very strong years in both 2020 and 2021, our drinkable Kefir net sales were up 27.1% and 14.6% for the third quarter and nine months ended September 30, 2022 respectively, when compared to the same periods in 2021. As we aim ahead to Lifeway's continued expansion within the growing market, we are focused on doing what we do well over and over again and that is selling our Kefir. To continue delivering Lifeway to more and more consumers, we plan to consistently deliver on our customer acquisition strategy through advertising and marketing program and to focus on our distribution network to increase access. In the middle of 2021, We initiated a large marketing program with the immersive Van Gogh experience, a national exhibition showcases Van Gogh's artwork through light, music and movement and imagination in 22 major US cities. To date, Van Gogh experience has netted over 275 million impression and leave distributed over 250,000 Lifeway Kefir samples to attendees. In Q3 of 2022, Lifeway received 60 media placements and target outlets, resulting in a potential reach of more than 875 million impressions, including prominent features with Fox business, Forbes, Good Housekeeping, Mindbodygreen, Women's Health, and much more. To demonstrate the versatility of Lifeway Kefir and expand reach, we've continued our work with notable influencers, chefs and nutrition experts to suggest healthy ingredients, flaps, recipes and snack ideas incorporating our products. Moving forward, we'll continue to evaluate all potential marketing and promotional opportunities to onboard new customers and increase the velocities of our brand. First, we received authorization with Plaid Pantry, an Oregon based chain, which represents Lifeway's expansion into the Pacific Northwest, a region we see as a potential growth area. Lifeway's Kefir product provide customers with probiotics, vitamin D and protein that helps to support their gut health, immunity and mental wellbeing. As today's consumers learns and focuses on their health, they will carry even more about those facts and the probiotic culture in their gut, which should be of great benefit to Lifeway's product portfolio. Lifeway's performance in 2022, so far highlighted by this record-breaking third quarter has our team very encouraged and we believe we're currently on the right path achieving our primary targets, delivering profitable and strategic growth to our investors while furthering our mission to provide best-in-class probiotic and nutritious food to improving the health and well-being of our customers."
}