{
    "symbol": "HPP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 21:44:02",
    "content": " Over the last ten quarters alone, two projects like Epic Harlow, One Westside, we’ve demonstrated our ability to identify and invest capital in unique office and studio related opportunities that generate returns in line with or well in excess of those yields. And over the last four years, we’ve repurchased $380 million of our common stock which will reach $580 million or approximately 15% of our market cap with the conclusion of our accelerated share repurchase in the third quarter of this year. Your line is open. In terms of how it’s impacting our guidance and projections, even though cash same-store NOI down a little bit, it’s not impacting the total FFO NOI dramatically, primarily because it’s just a – well, let me back track, first the reason for the decrease from – still we have some leases that we were – we have some tenants that we were in leasing with that ended up not closing and we deferred the lease up of that. I mean, we picked up 40 basis points on $5.7 million square feet just in the quarter and we’ve got another – of that kind of 280,000 square feet, 200,000 was attributable to the valley and the Peninsula. Your line is open. Can you give any figures as far as dollar amounts of CapEx for the …\n I didn’t mentioned half of our developments, because what I mentioned in my prepared remarks is that, two of our developments which is what Mark just walked through, which is Washington 1000, which we will commence because of entitlement processes and what I mentioned was – is that we should have Burrard Exchange, which is our Vancouver development for approximately $0.5 million and our Sunset Waltham Cross is our million square foot, billion dollar development. Your line is open. If there are opportunities as I mentioned in my prepared remarks on stabilized assets that we are looking to buy whether it’s value-add or core plus, the numbers are going to be in the 6 to 8 range on the value-add and the 5 to 6 range on the core plus and the development as you pointed out taking a look at the supplemental on March to March, I mean, the ones we are talking about right now are specifically Washington 1000 and then next will be Waltham Cross and Burrard Exchange. Your line is open. I’d like to say, if you look at the floating rate debt running – our company share running through the supplemental that 24.6%, it grew just correct that the majority of it is such as with JVs, but to put a finer point on it, 35% of the floating rate debt relates to two JV assets that we obviously are going to have to work with our JV partner on whatever the longer term goals would be with respect to that floating rate debt, but in total, that amount of debt, that will be 8.6% of our total indebtedness. Your line is open. Your line is open. No one see Netflix stock down 68%, but isn’t the silver lining or perhaps the silver lining for you as you expand your diversification in that world and that ultimately would be a good thing in my mind and my – like I think of Amazon is scaling back in industrial, that’s actually a good thing for the industrial REITs because it allows them to expand and diversify their exposure in ecommerce. Your line is open."
}