{
    "symbol": "HPP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 19:19:04",
    "content": " As of the fourth quarter, top studios, including Apple TV, Netflix, Disney, Amazon and others, we're still projecting to spend a total of $140 billion on content this year, up 11% from last year to a new high. Looking ahead to '23, our priorities are as follows: to continue to successfully address our 2023 office lease expirations with the goal of preserving rent and occupancy, to execute on our near-term value creation office and studio development opportunities, specifically Sunset Glenoaks and Washington 1000 to further strengthen our balance sheet, by delevering through asset sales and reducing interest rate risk through hedges, and finally, to continue our ESG and sustainability leadership which has become a hallmark of our businesses and how do we create long-term value for our shareholders. Apart from our 2 under construction projects, we continue to progress entitlements and designs for the balance of our 3.6 million square foot pipeline of potential development opportunities, which contains unique projects like Burrard Exchange, which will be one of North America's tallest mass timber office towers and Sunset Waltham Cross, which will be one of the largest studio facilities in the U.K. We're taking this time to ready our pipeline to ensure we can commence construction and create value, but only when the timing is right. Our fourth quarter 2022 revenue increased 12.2% to $269.9 million compared to fourth quarter 2021, primarily driven by income generated from our Quixote acquisition in August 2022 and the commencement of Google's lease at One Westside in December 2021, partially offset by Qualcomm's vacancy at Skyport Plaza in July 2022. Our fourth quarter same-store property cash NOI increased 2.7% to $126.9 million compared to fourth quarter 2021, primarily driven by increases in revenue at 1998, 11601 Wilshire, 45 market and Sunset Gower Studios, partially offset by Qualcomm's vacancy at Skyport Plaza in July 2022. So we expect the full year leasing activity to be healthy on -- but our view is trying to pinpoint some ending year lease percentage, a bit of flow therein, because it's so tied to our success of either backfilling one or, let's say, the block space, for example, can fairly materially move the needle as of any moment in time. I don't know if we ever got that granular on our same-store disclosure I think I illustrated earlier where if you back out the big movers, which is Qualcomm, Google and I guess, NFL, we were still having a 5% increase of our same store, and I think that's just a product of either good leasing and/or ramp-ups and free rent burning off. We are looking at sort of what it entails to convert on assets that may be physically are well situated for conversion or maybe happen to be in markets that have nearby residential so that we're at least informed about what the opportunity for conversion looks like, but I don't -- I mean, I think we -- Victor has said on past calls, I don't think we think there's much of our existing portfolio that's a real candidate for conversion given the quality of the assets. And I think it's whether we're following the herd of our we're creating our own, the reality of the situation is the amount of differential here for access to capital, given our liquidity position right now is not materially -- there won't be a material change if we lowered our dividend. And we just think that given this is hopefully an indication of the strength of the company, one and two, the position by which we're going to take going forward, which has been consistent throughout I mean at one point, last year, we were having conversations about increasing our dividend because of our AFFO where it's going to. I think we'll -- I know at Hillview, they're almost 100% because it's 2 different groups. Yes, so I would say rather than attempt to quantify this now if the strike materializes because again, we don't -- we're not like 100% certain that it's actually going to materialize. I would say maybe to give you a sense as we look at the model between Google and Company 3 cash rents commencing this year on -- those significantly mitigate the impact of vacancy like Qualcomm, NFL block and should help us maintain an AFFO level pretty close to 2022, and that -- we have to normalize TI and LC spend in order to kind of get to that level, which is totally reasonable."
}