{
    "symbol": "EIGR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 09:21:51",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the Eiger BioPharmaceuticals First Quarter 2022 Financial Results and Business Update Conference Call. We issued a press release earlier this afternoon with our Q1 financial results, which is also available on our website at eigerbio.com. For today's call, we will have prepared remarks from the management team followed by Q&A. Joining me on the call with prepared remarks are David Cory, President and CEO; Sri Ryali, Chief Financial Officer; Eldon Mayer, Chief Commercial Officer; and Dr. Ingrid Choong Senior Vice President of Clinical Development. Before we begin, I would like to remind investors that this call will include forward-looking statements, including expectations concerning financial performance, commercial products and potential future products in different therapeutic areas and stages of development. The forward-looking statements rely on certain assumptions and involve risks and uncertainties beyond Eiger's control, which could cause our actual results to differ materially. We're making significant advances across our pipeline, while strengthening the foundation of our business and expanding our leadership to support future growth as we believe that 2022 will be a transformational year for the company. Since we announced positive top-line results from the Phase 3 TOGETHER study in March, our team has been focused on preparing our emergency use authorization application. We are excited by the progress and advancement of Lambda for COVID-19, which essentially has been a program driven by investigators in both Phase 2 and Phase 3 as we focused our internal efforts on Lambda for hepatitis delta virus infection. But based on our current discussions and our state of preparedness, we believe it is appropriate to expect the filing by the end of this quarter. As a reminder, this is the second largest clinical study of a COVID-19 therapeutic with data from over 1,900 patients predominantly vaccinated and across a range of SARS-CoV-2 variants. The final review of this extensive and robust data set is nearing completion, and we intend to communicate the full analysis at the time of our EUA submission. In terms of commercial readiness, we have large quantities to support the introduction of Lambda should the FDA grant emergency use authorization, and we are actively planning for expanded production capacity. As we continue to see new variants across the globe, it is clear that COVID-19 is far from over, especially, for vulnerable patient populations. The recent surges of COVID-19 infections in China, Hong Kong and Europe highlight the ongoing and global threat of this pandemic and the need for an effective convenient therapeutic. In addition to the exciting news from our COVID-19 program, we continue to execute on our HDV platform, lonafarnib and lambda both in Phase 3. As first-in-class therapies to treat and potentially cure this devastating disease, we believe both our product candidates offer opportunities for significant long-term value creation. As we announced last week, we are advancing Avexitide into a Phase 3 registrational program for congenital hyperinsulinism by the end of this year. Recently published Phase 2 results from our partners at Children's Hospital of Philadelphia provide important foundational data that support proof-of-concept in this patient population, which gives us great confidence moving forward. FDA approval of Zokinvy, the first treatment for Progeria is the result of our partnership with the Progeria Research Foundation. And of course, our pending EUA submission of Lambda for COVID-19 reflects our strong collaboration with Dr. Jordan Feld in Phase 2 and the TOGETHER study team in Phase 3. I'm proud of our continued progress here, which is a testament to our team's focus and commitment to this mission. In summary, we entered this year with a clear operational plan for growth advancing our pipeline, expanding commercial reach for Zokinvy and strengthening the foundation of our business to prepare for the future. Starting with our COVID-19 clinical development program, we reported in March that the TOGETHER study met its primary endpoint with a 50% reduction in risk of the COVID-19-related hospitalization or emergency room visits. Importantly, this primary endpoint was achieved in a patient population that included multiple variants and was predominantly vaccinated. With the ever-changing COVID-19 landscape, we believe these data reflect generalizable effects of Lambda in a real-world population. As stated, the risk reduction in hospitalizations or ER visits was 50% in patients treated within seven days of symptom onset. Perhaps more importantly in this high-risk population, Lambda reduced the risk of hospitalization or death by 60% among those receiving treatment within three days of symptoms. Concurrent with our top line data announcement in March, we submitted a pre-EUA request to FDA our first opportunity to socialize the study and top line data with the Agency. TOGETHER is a large study of almost 2,000 patients, which provides many opportunities for sub-analysis of the patient population. The TOGETHER study team is completing a comprehensive analysis of the full data set, which will include sub-analyses for variants and vaccination status. This will be important not only to assess the correlation of viral clearance and clinical outcomes, but also to determine effects of Lambda on viral clearance an important indicator of curbing community spread. As David said, we plan to share the full data analysis and host an investor call at the time of our EUA submission. It will generate the single largest source of HDV patient data from a well-controlled clinical trial to better understand and characterize this devastating disease, and if positive, these data will support global regulatory filings. During our March call, we provided an update on the impact of Russia-Ukraine conflict on D-LIVR. As we previously communicated, D-LIVR remains more than adequately powered to demonstrate superiority on the primary end point, even if patients from Ukraine discontinue from study. The primary endpoint of LIMT-2 is a durable virologic response, which was previously demonstrated in Phase 2. This post-treatment endpoint is most meaningful for regulatory agencies and physicians, as it demonstrates durability of response to a finite therapy and potential for an HDV cure. We will quickly follow with data from LIMT-2, which if positive could lead to approval of Lambda for HDV. In parallel, we're generating data through the LIFT-2 study which we believe will support the future use of our proprietary combinations of Lonafarnib and Lambda for hepatitis delta infection. Importantly, we're pleased to have converted 80% of the identified US patients to commercially reimburse supply with 100% payer reimbursement coverage. With the CHMP opinion expected this quarter, we are actively preparing for launch in Europe where there are approximately 20 identified patients. In preparation for launch, we've established the appropriate infrastructure for successful commercialization across the EU including distribution and patient support services. As Eldon noted, first quarter Zokinvy net sales were $2.7 million. As a reminder, we launched Zokinvy in the US in January 2021 and first quarter 2021 sales included the initial inventory build at the specialty pharmacy. R&D expenses were $17.6 million and reflect an accrual of a $5 million milestone expense to BMS, related to our Phase 3 LIMT-2 study of Lambda for HDV. As David noted, a key part of our growth strategy is to advance innovative clinical programs for underserved patients in a capital and resource-efficient manner, to continue to practice disciplined expense management and maintain a strong balance sheet that provides operating flexibility. Importantly, this provides Eiger with a very strong balance sheet ahead of delivered top line data expected by end of this year. This is proving to be a pivotal year for Eiger, as we execute on clinical milestones to propel our pipeline forward leverage our commercial capabilities, to expand our reach for Zokinvy and strengthen our business for the future. We have strong momentum in our HDV platform with Phase 3 D-LIVR top line data planned by end of the year, the Phase 3 LIMT-2 study of Lambda enrolling patients and the Phase 2 LIFT-2 study of Lonafarnib and Lambda combination initiating soon. As we prepare for significant milestones this year and position ourselves for sustained growth, we are expanding and strengthening our infrastructure and team, including at the leadership level. At this point, I'd like to thank our dedicated Eiger team for their relentless efforts across our programs and thank all of you for joining us today on this call. Your line is open. Yes, we are actively engaged with the agency on our EUA application and we've been very pleased with our interactions to date and are confident that we can submit this quarter. In addition to the Brazil sites we also have included data from a site in Toronto, Canada that follow the same protocol as the TOGETHER study. Your line is open. Importantly, we believe that the TOGETHER data sets are robust and compelling and represent a real-world patient population that's highly generalizable to the US. As you know this is a very large data set of almost 2,000 patients. So as mentioned earlier, we plan to conduct primary endpoint looking at it across variants, as well as different vaccination status. Regarding viral kinetics, because we are running SARS COVID quantification at days zero, three and seven, we will be able to look at viral load decline and viral load clearance and be able to look at correlations to clinical outcomes. Yes, on the cash question, we're very pleased to have a strong cash position that we reported and that runway that we guided to including cash sufficient to fund planned operations into Q4 2024, does contemplate the Avexitide Phase 3 congenital hyperinsulinism program. And then your second part was related to study design, and I'll let Colleen Craig comment as much as we're able at this point, Colleen. However, what I can say at this point is that through the breakthrough therapy pathway, we've had the benefit of working closely and collaboratively with FDA, on study designs and endpoints and we're aligned on an efficient program that we look forward to initiating this year. Your line is open. And then as you think about SG&A, would you expect them -- would you expect to increase SG&A materially based on maybe a sales force increase, with regard to advancement either with the EUA or with the EU with regard to Zokinvy. With regard to the BMS milestone the $5 million that we included this quarter, was related to the Phase 3 LIMT-2 study of Lambda for HDV. With -- as we get closer to that next milestone for Lambda, we will provide more specific details. What we have communicated is that, an EUA would set the stage for either to supply purchases to agencies like BARDA, which is how we initially see the EUA progressing, which is what other therapeutics that have received EUAs have done as well. David to begin your comments at the outset, you actually mentioned actively planning for more production I think. The value of developing Lambda for hepatitis delta virus infection, is separate and distinct. And in parallel, also had opportunities to consider the pandemic and how Lambda might be made available on a global basis. And based on that, we are making plans and considering different pathways certainly to ensure that the numbers of Lambda manufacturing meet a global demand in the future. But that said, it's important to note, our priority right now is focused on getting the EUA application filed and getting that authorization. And then look forward to obviously, providing additional updates thereafter on next steps. Your line is open. So first of all, you haven't disclosed total granularity on the Phase 3 design. We have communicated that we're very excited now to have concurrence with FDA, on a Phase 3 program for Avexitide in congenital hyperinsulinism. And obviously, the fact that Avexitide is the only therapeutic in this space that has been granted Breakthrough Therapy Designation as well as Rare Pediatric Disease Designation. It's given us an opportunity we believe to accelerate and finalize discussions, on our Phase 3 program. The reason that we advanced Avexitide in congenital hyperinsulinism is, because we clearly believe there is a mechanistic differentiation versus anything else in the field. And you mentioned the first, really, first -- as a first-in-class GLP-1 receptor antagonist, Avexitide represents a uniquely targeted therapeutic approach. The other thing that I'd just like to take a moment to touch on is that, Avexitide -- the route of delivery as a subcutaneous injection in this patient population is something worth highlighting. This is a very practical way of delivering to particular -- in pediatric patients that does not require a wearable device, such as a continuous pump and does not require oral intake, which in this patient population, in particular, neonates and infants, but also in patients receiving intolerant may raise challenges. And the last thing that I'll just point out is that, Avexitide is to-date the only program in development for HI that has been granted breakthrough therapy designation. Your line is open. Just a follow-up on Bert's earlier, regarding manufacturing post emergency use authorization. Pretty tough question to answer without having the -- those approvals and those requests coming in from ex-US, but just trying to get a sense for how much you're able to put out in the market, possibly later this year and then into next year. What we have communicated is that, we will have 300,000 doses of Lambda available for initial launch quantities, to make it available for health care practitioners and patients. And while we haven't provided specific numbers on what we could do in subsequent years, within our existing manufacturing capacity for HDV, as David indicated, we are looking at opportunities to expand production. But clearly, our thinking about post-bariatric hypoglycemia as a commercial opportunity and importantly an unmet medical need for underserved population in this case PBH and look forward to providing additional updates in the future. Not for PBH, only that we plan to begin Phase three for congenital hyperinsulinism this year. And that while we clearly value Avexitide for both congenital hyperinsulinism and post bariatric hypoglycemia, we believe that a disciplined approach is to begin with congenital hyperinsulinism, which again, just to remind you, we believe we'll likely be potentially an opportunity for another priority review voucher upon approval. Specifically, it did decline by about 20 bottles going from 99 at the end of Q4 to 79 bottles to be precise at the end of Q1. Thank you, very much and thanks to everyone for joining us today on this earnings call. As you've heard, we have a very busy year ahead with many value-creating milestones and we have the team, we have the resources and the focus to deliver against all of these."
}