{
    "symbol": "TRST",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-22 13:46:03",
    "content": " As we noted in the press release, the company saw net income of $17.1 million in the first quarter of 2022, an increase of 21.3% over the prior year quarter which yielded a return on average assets and average equity of 1.12% and 11.6%, respectively. As expected, the growth continues to be concentrated within our primary lending focus, the residential real estate portfolio which increased by $218.6 million or 5.8% in the first quarter of '22 over the same period in '21. Total average investment securities which include the AFS and HTM portfolios, decreased $12.3 million or 2.9% during the first quarter of '22 over the fourth quarter of '21. The opening adjustment was a $2.4 million increase in the allowance for credit losses on loans and increase in unfunded commitments of $2.3 million and a corresponding decrease in deferred tax assets of $1.2 million, resulting in a net decrease to shareholders' equity of $3.5 million. As a result, we held an average of $1.2 billion in overnight investments during the first quarter of '22, an increase of $157.6 million compared to the same period in '21. On the funding side of the balance sheet, total average deposits increased $223.4 million or 4.4% for the first quarter of '22 over the same period a year earlier. The increase in deposits was a result of $66.1 million or a 9.1% increase in average money market costs, a $212.9 million or 16.2% increase in average savings deposits, a $106.9 million or 9.9% increase in interest-bearing checking account averages and $135.3 million or a 20.1% increase in average noninterest-bearing checking balances. As we navigate through 2022, the bank has approximately $264 million in CDs that were maturing at an average rate of 21 basis points in the second quarter of '22. In the third quarter of '22, approximately $165 million of CDs will mature at an average rate of 13 basis points. Total noninterest expense, net of ORE expense, came in at $22.8 million, down $3.5 million compared to the fourth quarter of '21 and below our estimated range of $24.9 million to $25.5 million. We would expect 2022's total recurring noninterest expense, net of ORE expense, to be in the range of $24.9 million to $25.5 million per quarter. Nonperforming loans stood at $19.4 million at quarter end, up approximately $650,000 in the quarter and down from $21.6 million a year ago."
}