{
    "symbol": "AGTI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 12:56:11",
    "content": " Our assumption accompanying our full year financial guidance was that revenue from the rescoped HHS agreement, which show a year-over-year decline of $40 million to $50 million with the difference primarily reported within our on-site business. Meaning, utilization for these peak need devices, which primarily include infusion pumps, ventilators and patient monitoring devices and which represent a subset of our overall rental fleet, has recently stabilized at a level that would suggest $20 million to $30 million less revenue and corresponding margin in 2022 and implied by our initial guidance. While a COVID-driven focus negatively impacted hospital procedure volumes and limited customers focus in this area over much of the last 2 years, we are seeing new contract wins accelerating for our surgical equipment repair solutions. Adjusted earnings per share of $0.19 in the quarter compares to $0.23 in the year ago period, driven by both a slight decline in adjusted net income and an increase of 8 million fully diluted shares outstanding, primarily associated with the company's April 2021 IPO. As we have shared in our prior earnings calls, throughout much of 2022, our financial guidance assumed that our results would comp against the $30 million to $40 million in high-margin COVID-driven revenue tailwinds from 2021. Let's just assume that where we are today is the new normal, and that would tie to the $20 million to $30 million top line, bottom line impact that we described and it's implied then by our revised guidance for the full year. And it's why we haven't provided guidance beyond this year, what we have historically done is appointed folks to 2015 to 2019 and the historical organic performance of that business has a good starting point for modeling that business as we get through this transition out of the COVID and into signing this business with our customers now that they're turning their attention there and implementing it, I think you'll see it comes along much as we've described."
}