{
    "symbol": "PIRS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 17:14:03",
    "content": " Before we begin, I'd like to caution that comments made during this conference call may contain forward-looking statements involving risks and uncertainties regarding the operations and future results of operations of Pieris, including statements related to the timing and progress of our clinical trials and preclinical programs, including the anticipated timing for reporting of data, our partnerships and our financial position, and actual results or events may differ materially from those expressed or implied by such forward-looking statements. We are now guiding that following a time line reforecast by AstraZeneca, accounting for the challenges of recruiting for respiratory clinical trials caused by the continued impact of COVID-19, the top line results for the Phase IIa study are now expected to be reported by the third quarter of 2023. I would now like to give a brief update on our IO pipeline, beginning with what has been our flagship 4-1BB bispecific program for several years, which is our 4-1BB/HER2 bispecific PRS-343 cinrebafusp alfa or CINRA for short, which has been in a Phase II study for both HER2 high and separately HER2-low gastric cancer. As we stay focused on PRS-060, partnered with AstraZeneca, PRS-344, partnered with Servier, and PRS 220, which will soon enter a Phase I study in healthy volunteers, we're fortunate to have a great stable of partners to complement a solid talent base at Pieris to advance several programs through multiple clinical readouts within the next 12 months. So starting with the ongoing Phase II study, the data we're seeing is, we think, very consistent with what we observed and published in the Phase I study, which included a number of gastric cancer patients, including patients that had progressed after receiving immunotherapy, checkpoint therapy, the KEYNOTE-11 regimen and then had a meaningful and durable benefit even on monotherapy when receiving CINRA."
}