{
    "symbol": "NLOK",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-04 20:48:06",
    "content": " At this time for opening remarks, I would like to pass the call over to Ms. Mary Lai, Head of Investor Relations. I'd like to remind everyone that during this call, all references to the financial metrics are non-GAAP and all growth rates are year-over-year, unless otherwise stated. Today's call contains statements regarding our business, financial performance and operations, including the impact on our business, industry, that may be considered forward-looking statements and such statements involve risks and uncertainties that may cause actual results to differ materially from our current expectations. As soon as we can bring us together, we will get started on delivering all the benefits of our new company to consumers, shareholders and other stakeholders. Together, we will serve about 500 million users globally, sell premium products to consumers for more than $3.5 billion in revenue and have around 4,000 employees dedicated to the mission of protecting and empowering people to live their digital life safely. Advanced strength in privacy and NortonLifeLock's strength in identity, supported by our combined AI capabilities, creates a broad and complementary product portfolio beyond core security and towards adjacent trust-based solutions. On top of that, the merger will broaden our geographic diversification, increase our presence in multiple channels and also serve very small businesses. We will have the opportunity to empower millions of consumers around the world, with our complementary product portfolio and culture of innovation. And while the world is in a different place than when we started this journey over a year ago, one thing is for sure people want to continue to enjoy the advantages of a digital world without compromising their security, privacy and identity and our sole mission is to bring that and more to everyone. Our combined financial profile is substantially enhanced through increased scale, long-term growth potential, synergies, strong free cash flow generation, supported by a resilient balance sheet. As I mentioned, based on our last reported financials for both companies, we will scale our combined revenue to over $3.5 billion. And the combinations will unlock significant value creation to approximately $280 million of annual gross cost synergies and will give us the capacity to reinvest for innovation, partnerships and marketing to further accelerate our transformation. We will have created operating leverage of approximately 52% in blended operating margin that is pre-synergies, delivering approximately $1.5 billion of annual free cash flow, also pre-synergies. The combination is another value creation enabler, as we march towards our long-term objective of $3 in EPS. Once the transaction is closed, we will be able to share more details on the combined business and its financial model. So in terms of what's next, we will continue to work closely as quickly as possible after the CMA publishes its final approval, which is currently expected to be in early September subject to change. Based on what we know today, we anticipate the closing date of the merger, is expected to be between mid-September and sometimes in early October. While we observed weaker consumer sentiment, and inflationary pressure impacting the consumer discretionary spend, we are proud to deliver our 12th consecutive quarter of bookings growth, with Q1 bookings up 5% in constant currency and revenue up 6%. The quarter's performance tracked in line with our mid-single-digit bookings growth projection, for fiscal year 2023, which I view as a demonstration of the stability that our business operating levers, provide in a challenging environment. Our direct revenue grew 5% in constant currency, on top of another strong COVID-led double-digit growth quarter a year ago. In this new environment, our focus has been on balanced performance across a set of very healthy customer metrics. Total customer count was stable at over 23.3 million, up 200,000 year-over-year but down 200,000 sequentially. Throughout the quarter, we saw the impact of the macro level headwinds in our direct-to-consumer website global traffic, slightly offset by solid conversion rates. While these headwinds have limited our ability to grow customer count this quarter at the pace we aspire to, it's important to highlight that our overall customer base is healthy, with stable retention rates, stable ARPU and opportunity to continue to drive cross-sell upsell, as we launch new products. Customer cohorts who joined during the so-called COVID period, have retention rates at par with prior years. And through our operational initiatives, we continue to make progress in first year renewal rates. Our efforts have led to happier customers supported by products, that are easier to download and easier to use. Since we became a dedicated consumer cyber safety company, we have grown our direct customer base by approximately three million to reach over 23 million customers, and at the same time improved our retention rate, by almost a point during the period. Another set of activities we are focused on, is delivering more value to more customers in our partner business. In this set of indirect channels, we delivered double-digit revenue growth for the seventh straight quarter up 16% in constant currency, in this first quarter of fiscal year 2023. We had very healthy bookings in Q1, including double-digit bookings growth in both mobile and employee benefit channels, channels in which we added approximately 200,000 customers year-over-year and stayed flat sequentially. As we continue to build a more global and more diversified go-to-market model, we look forward to combining with Avast, which will allow us to accelerate our strategy of expanding identity and privacy solutions across the globe. A year ago, we stated that we would transform our company by building a richer product portfolio, and we have continued to work towards that. We are off to a good start in fiscal year Q1, for the -- on the product side. In Q1, we have made good inroads from our recent launch of the Norton Identity Advisor Plus, for the UK market and we've expanded the product's availability to Australia, New Zealand and Germany. Just last month, we were awarded PC Magazine number one Identity Theft Protection software, for 2022. Specifically this was Norton 360 with LifeLock product, awarded to provide the best overall identity protection in the industry. This is just one of the many times, we have been recognized for our overall product innovation and development efforts. We continuously assess and prioritize our product road map, and we know we still have big opportunity to expand our product portfolio especially in areas beyond core security. But above all, what guides us is our focus on providing quality and value in our products. It is about a seamless end-to-end customer experience, and comprehensive protection while making it simpler for consumers to engage with us and stay safe. Cyber safety will continue to be an evolving and growing market, fueled by the increase in activities online, which brings more risk and challenges to consumers' digital lives. With the merger with Avast together, we are well positioned to drive the transformation of consumer cyber safety and pursue our long-term objective, while being financially resilient in any environment that comes ahead of us. I will focus on non-GAAP financials and year-over-year growth rates, unless otherwise stated. While the interest rate environment has changed since we first announced the merger last year, we still feel good about the rates we were able to lock in. Our Q1 revenue was $708 million, up 6% in constant currency and up 2% in USD including a 4-point currency headwind translating to a revenue headwind of $27 million year-over-year. Despite these macro headwinds, we remain focused on execution against our business opportunities in driving towards our long-term objectives. Q1 direct customer count grew by approximately 200000 year-over-year, but declined by approximately 200,000 quarter-over-quarter as we saw headwinds in select markets. However, adjusted for FX, ARPU expanded nearly $0.30 year-over-year and expanded $0.07 sequentially, an indication of our successful cross-sell efforts. We have a very healthy resilient customer base and we remain focused on driving new customer acquisitions retaining our existing customers, as well as increasing engagement with new products and services. Turning to profitability, in Q1 we achieved gross margin of 86% roughly flat year-on-year, while at the same time expanding and adding more features to our product offerings. As you've heard me say before, we are intentional with our investments and how we fund our business to drive future growth. With intentional customer acquisition targeting while, focusing on long-term sustainable growth. Diluted EPS was $0.45 for the quarter up 7% year-over-year, including $0.03 of currency headwinds and above based high-end of our guidance range. Turning to our cash flow and balance sheet, Q1 operating cash flow was $215 million and free cash flow was $213 million. We repurchased $300 million or 12 million shares in buybacks in the quarter, and now have approximately $1.5 billion remaining in the current share buyback program. For Q2 the Board of Directors has approved a regular quarterly cash dividend of $0.125 per common share to be paid on September 14th 2022 for all shareholders of record as of the close of business on August 22nd 2022, as described in the press release. Your line is now open. Vincent maybe before we talk about Avast, I was wondering if you could just touch on some of the dynamics between your partner business and the direct business. It basically goes through app stores, and it's not in our direct business today because of the billing definition, doesn't go to us directly. But to be honest with you, the consumers gets on our platform and we have direct access to them and communicate and provide value. A few quarters ago, we crossed the Norton 360 platform to be the majority of the product sold on mobile, which is a very good sign. It goes through employers that offer to their employee full protection in the cyber world, identity protection privacy and device security. There too, we have the direct engagement with the customers on our LifeLock platform but the payment goes to the payroll of the company that supports that. So, those are the direct engaged customers in our partner business then we have another set of channels that go and combine with other provider of other solutions to provide a full package. So, here like for example, the partnership with TELUS in Canada to bring cyber safety along with the TELUS solutions to Canadians has a very strong momentum. Travis Witteveen, who was the CEO of Avira, ton of experience in the environment, has become our customer acquisition chief, if you want, a few quarters ago and he's developing his team. So, you'll see us continue to invest in that. We said a year ago, we would improve the first year retention rate and we have by a few points. Over the last 24 months, we've increased overall retention by a little more than 70 basis points. And so you see continued operational initiatives, whether it's on how the product is being downloaded, how it's being used, how the value is demonstrated to the customers, that improve customer satisfaction and then overall retention. The gap or disappointment, if you want for the quarter, is really related to the macro level headwinds that we saw with lower traffic or global traffic on that cyber safety website, if you want. Conversion rates still holding well, but it's about the traffic. There were pockets of weaknesses, other pocket of areas where we continue to invest, because we're here for the long-term. And as we navigate through the volatile environment, we know we provide a product that will be needed in an area that has structural growth. Yes, operating margin of 54% now for two quarters and up 250 basis points year-over-year. And honestly, we recognize what a competitive industry we operate in and that consumers have choice and we need to work really, really hard to win that choice. And I think from that combination of investment that's where that ARPU growth is really coming from both year-over-year and quarter-over-quarter and it allows us to sustain and scale our unit retention of 85%-plus both proof points of healthy acquisition that we've seen over the last 10 months -- 10 quarters excuse me. And above and beyond all that we're just very, very excited about the additional opportunities we have as we combine with Avast. We discussed that a few quarters ago, but when we made the acquisition model or the transaction model we based the merit of this transaction on cost synergies overlapping activities to the tune of $280 million that I've talked about. We did not include in our acquisition model revenue synergies for many reasons, but certainly not the reason that it will be our priority number one as soon as we close. And we know Avast has been developing the entire business model on that, offering a basic product for free. And then delivering, showing demonstrating more value to the consumers to a point where the customer is ready to pay for that value and then growing that value offered to the consumers. We look forward for Avast to bring those operational skill sets if you want into our overall combined company, while we bolster a richer portfolio. So Identity, a Lifelock equivalent services that we started to expand internationally will be offered to Avast customers as an example. And then the third one is across the complementarity of the geographical footprint whether it's US versus international from our standpoint, for their standpoint Europe versus the rest of the world. Locally, we can accelerate our penetration including in the VSB or very small and small business area where Avast has already a small channel. And then as soon as we're ready and the deal is closed, we'll share more with investors what our long-term plan is in this area. Thank you for your question. Your line is now open. And when we talk about security we really talk about for us cyber safety, which is not only your device security but it's also the protection of your digital identities all the way to the restoration and insurance you could have when something is breached from your device or from any transaction that can be processed into the cloud. Now it does not mean, of course, that in the short-term, you still have volatility, you have inflationary pressures, you have consumer sentiment and people will look at some of those costs and may see this as a discretionary spend. But frankly also as I studied the business when I came in two years ago, it was similar behavior in 2008 or 2009. Well, the good news once a customer is in and has a basic protection is that we can also make them aware of the moment of truth that we call insight, which is a moment at which you connect to the Internet when you are at a coffee shop or a moment you transfer data on the web and ensuring and monitor that you fully protect it. At which point in time, we can then raise the value to you of being fully protected versus partially protected. Thank you for your question. Your line is now open. So we'll talk about cross-sell, upsell revenue synergies when the deal is closed. We know that the entire identity protection or theft protection restorations and insurance is something Avast does not have and we can really offer, as we combine that with security. And so combining the product portfolio working on the integrated platform they have Avast One we have Norton 360, we'll have to figure that out. And then leaving product value that customer can step in once they have basic -- as I mentioned, most of our customers are in the basic platform have basic benefit to see how they move to the next one. At the end of the day as the product portfolio become richer it's all about the ease of use, ease of downloading how you use that. Obviously, we see there's some headwinds in the customer acquisition this quarter. No, definitely, we historically had a Q3 quarter, which is fiscal Q3 for us which is a December quarter being stronger more on the security side and April quarter our Q4 quarter being strong on the identity side linked to some events such as tax and other things. To be honest with you, over the last two years, whether it's because of COVID or other macro level as well as the fact that we more and more provide one combined value of full total protection we've seen less seasonality. But you're right that in the moderate seasonal effect, if you want the June quarter, would be a low quarter. With that said we did see some headwinds what we call pocket of weaknesses, where we continue to invest at the same rate, because we know we're here for the long term and it's a portion of our investment that goes towards education, but we saw lower traffic. Yeah I just think â\u0080\u0093 we think about â\u0080\u0093 even as a consumer you feel the macroeconomic environment you feel inflation, you feel pricing pressures. I would combine that, with some of the other markers that we see across the industry with PC shipments down now double digit not that we're entirely connected to that, but it's just another marker that shows us what's happening in our industry. We've got to be much, much more competitive in order to win over the customer choice that's available. And then we do through a disciplined approach, we spend so much time and effort making sure that those customers are â\u0080\u0093 is highly engaged as possible. We provide great customer service, and we want to be fulfilling as much of that cyber safety need, as we possibly can. Before I close the call, I would like to take a moment to thank our NortonLifeLock team for contributing to our success each and every day. As you've heard me say before, we truly have an ambitious team dedicated to the mission of the business we're building. On behalf of the Board and the leadership team, I want to thank Ken Hao for his contributions to the company over the last six years, helping NortonLifeLock through the successful transition to a stand-alone consumer cyber safety company, and unlocking tremendous shareholder value. I talked to Andre yesterday, as I mentioned, and I know that the Avast team feels exactly the same way."
}