{
    "symbol": "KYMR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 02:11:12",
    "content": " This is just the start of our journey towards treating patients in many disease areas such as hidradenitis suppurativa or atopic dermatitis through degradation of IRAK4 with KT-474, hematological malignancies and solid tumors with KT-333 or STAT -- our selective STAT3 degraders, MYD88-mutant B cell lymphomas with our IRAKIMiD degrader KT-413, which has the potential to be the first precision medicine for this condition. At the SID Annual Meeting in May, we disclosed that KT-474 degrades IRAK4 and inhibits cytokine production in different immune and skin cell types, highlighting the broad impact of KT-474 across multiple disease relevant cell types and supporting the continued development of IRAK4 degraders in patients with HS, AD and other IL-1R/TLR driven autoimmune diseases of the skin, the IRAK4 plays a central role in the pathogenesis of inflammation. It is important to highlight that in order to expedite dose escalation, we have been recruiting broadly in Phase 1a across solid and liquid tumors in order to reach pharmacologically active doses as soon as possible, before then focusing on patient populations where we expect to see clinical activity, either the monotherapy or in combination with other agents. This escalation is expected to proceed throughout 2022 and we look forward to sharing preliminary safety and proof of mechanism data before year end, with the goal based on the broad population of liquid and solid tumors in Phase 1a of showing that we can attain levels of target degradation associated with anti-tumor activity in the disease relevant animal models at doses that are safe and well tolerated. The first stage is exploring escalating doses of single agent KT-413 using a similar strategy as I just described for the KT-333 Phase 1, we are expediting dose escalation of Phase 1a by enrolling a broad population a B-cell lymphoma patients before them focusing on patients and when we expect to see the most substantial clinical activity. With the goal based on the broad population of B-cell lymphoma patients in Phase 1a, I'm showing we can attain levels of target degradation associated with antitumor activity disease relevant animal models at doses that are safe and well tolerated. The second half of the year's impact as you've already heard, we look forward to generating for the first time key patients data in HS and AD from our KT-474 IRAK4 degrader program, as well as key proof of mechanism data in the two oncology clinical programs, KT-413 IRAKIMiD degrader and KT-333 as STAT3 degrader. And then secondly, with the two types of patients, HS and AD, will -- should be it differential in terms of the kinds of exploratory responses that you might see from this Part C group based upon your understanding of the kinetics of degradation as well as kind of the kinetics of the pathophysiology of the different disease states. And we found out from that cohort that that dose is 75 milligrams, and that's the dose that we we're therefore bringing into Part C. With regard to your question around AD versus HS and the ability to detect a clinical signal, we note that in studies using active agents where these subjects are treated for a long period of time, 12 weeks to 16 weeks, you can see signs of clinical response as early as 28 days in either AD or HS. And the other maybe key point here is that the one reason why we are not sort of fixing our focus so much on the clinical endpoint or on the PDM points is what's most important in either AD or HS and Part C is that we are able to observe with IRAK4 knockdown in the skin, which we want to achieve at least 85% or greater knockdown, we can see an impact on the expression of pro-inflammatory gene transcripts. If we see that in AD as well as in HS, regardless of what we see in terms of clinical endpoints, they're four weeks, that will give us confidence moving forward that we should be able to impact the natural history of the disease for either of those diseases with studies of longer duration that we would be able to test in Phase 2. So I think as Jared mentioned earlier, there is a very, very strong case for degrading MDM2 in AML, given existing data, given cancer genetics and given some preclinical data that we've generated that it very, very elegantly demonstrates that MDM2 degradation is up there in AML as the mechanism to go after, especially in refractory resistance to Venetoclax patients, which is an area that we're trying to expand. And I think the comments that were made by other companies, including our partner, has been -- there is different expectations if you have an oral drug with a good safety profile, where you're going to be driving your penetration on different expectations than a biologics where really the only case for biologics for high penetration has to be exceptional activity given the modality barrier that has with patients compliance. And also, again, there -- within solid tumors, our data source suggests that a combination of our drug with anti-PD-1 agents, maybe the most effective way to use the drug in solid tumors, whereas in liquid tumors like T and NK cell malignancies that is STAT3 dependent, we're expecting significant activity with our degraders the monotherapy."
}