{
    "symbol": "KYMR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 01:27:04",
    "content": " KT-413 is on a similar timeline as STAT3 and is currently in the dose escalation stage of the Phase I trial evaluating the safety, tolerability, PK/PD and clinical activity of KT-413 in patients with relapsed and/or refractory B cell non-Hodgkin's lymphomas. And so that means that our key goal is to actually collect data to demonstrate that there is a -- continues to be a strong relationship between exposure and PD that can inform our Phase II dose selection, that the PD has now defined, let's say, a direct  degradation in blood and skin that PD results into impact on disease-relevant, pathway-relevant chemokines or cytokines that we believe will create that new now correlation, given that in healthy volunteers we weren't able to do that. And then, as we said, just so that I obviously don't dismiss it completely, we've also said that we will be collecting clinical endpoints with the goal of trying to establish a potential correlation again with some PD, some biomarkers or anything that can be tied to clinical endpoints that obviously would be highly exploratory given the size and the design of the study. So the goal of this year is really to see if the translation of the PK/PDs, let's say, as good as we've seen with KT-474, where we degrade the protein in a reliable, predictable and dose-responsive way and the safety that goes with the degradation profile is in line with what we've seen preclinically. I think what we've described previously, right, based on our in vitro data, is that with iPSC cardiomyocytes we have been able to see an effect on current that's consistent with a mild herd effect of high concentrations that is somewhat delayed and that is sort of consistent with the sort of effect that we saw in the clinic, where we have a delayed effect that's not, in the clinic anyway, dose- or exposure-dependent and appears to plateau after Day 7 and then remain steady until the end of the dosing period at 14 days. As we've shared already, we have characterized for KT-474 this weak  that we believe is compounded by a higher-than-expected exposure in the cardiac tissues in humans that leads to this very, again, as we said, very atypical non-dose-responsive,  QT prolongation that, again, we believe has no impact, in our view, no impact on clinical development of this drug, assuming it stays within the range that we've seen in healthy volunteers."
}