{
    "symbol": "ADNT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-05 15:29:01",
    "content": " 02:06 Turning to slide four, let me begin with a few comments related to the quarter, continuing the trend established during the second half of fiscal 2021, numerous external factors including supply chain disruptions and resulting operating inefficiencies elevated commodity prices and increased freight to name a few continue to influence the industry and Adient's near term results. This is evident when looking at Adient's second quarter EBITDA result which contains approximately $160 million of lost volume, temporary operating inefficiencies and elevated commodity prices. Revenue for the quarter, which totaled $3.5 billion was about $440 million compared to last year's second quarter adjusted for portfolio actions executed in 2021. Continued progress on transforming the company's balance sheet, as called out on the slide, Adient completed its tender offer during the quarter for over $700 million of voluntary principal on debt repayment. 06:29 Q2 fiscal 2022 we estimated that supply chain disruptions resulting loss production, operating inefficiencies, premium freight, et cetera had a net impact on the top line of about $790 million and adjusted EBITDA by approximately $140 million. 19:36 Adjusted EBITDA for the quarter was $159 million, down $144 million year-on-year as reported or down $131 million compared to last year's pro forma results. 22:39 Big picture, adjusted EBITDA was $159 million in the current quarter versus 330 -- excuse me, $303 million reported a year ago or $290 million pro forma adjusted for the portfolio actions executed in fiscal '21. The year-over-year comparison was impacted by certain non-repeating factors, namely approximately $17 million of cost related to the Texas freeze storm that impacted last year's second quarter, and thankfully did not repeat this year. As noted on the right hand side of the slide, we ended the quarter with about $1.9 billion of total liquidity, comprised of cash on hand of about $1.1 billion and just under $820 million of undrawn capacity under Adient's revolving line of credit. For adjusted EBITDA, given our revised expectations for revenue, we now expect fiscal '22 will be significantly lower, call it, greater than $100 million lower versus our fiscal 2021 pro forma results of about $810 million. For example, on the positive side, we're seeing continued improvement in Adient's core operations, including the launch execution, ops waste and a lower than expected material economics headwind, which Doug mentioned, is now expected to land $15 million or less for the year. In 2019 Adient's operations were experiencing many inefficiencies, in total, ops waste was an approximate $220 million headwind, significant progress was made in 2020-2021 despite the challenging operating environment. 36:57 Altogether, these headwinds are forecasted to place approximately $470 million of downward pressure on Adient's results in fiscal 2022."
}