{
    "symbol": "ADNT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-04 12:54:12",
    "content": " For the quarter, Adient's EBITDA results contained approximately $65 million of loss volume and temporary operating inefficiencies and including less than $10 million of temporary savings. Adient's key financial metrics for the quarter can be seen on the right-hand side of the slide, revenue for the quarter, which totaled $3.7 billion was up about $700 million compared to last year's fourth quarter adjusted for portfolio actions executed in 2021. For full disclosure and as called out on the slide, we estimate that external headwinds such as lost volume, temporary operating inefficiencies and rising input costs negatively impacted Adient's fiscal year 2022 revenue and adjusted EBITDA by $2.2 billion and approximately $600 million, respectively. Lastly, but certainly not least, and as highlighted at the bottom of the slide, Adient's strong operational performance, significantly transformed balance sheet and confidence in achieving our mid- and long-term plan led the Board of Directors to approve a $600 million share repurchase program. We're just under $1 billion of debt repayment, our continued focus on reducing costs, which has enabled Adient to lower its breakeven free cash flow to about 80 million units and our increased commitments to ESG initiatives in 2022. Adjusted EBITDA for the quarter was $227 million, up $109 million on year-on-year reported or $157 million compared to last year's pro forma results. Adjusted EBITDA was $675 million, down $242 million year-on-year as reported or down about $135 million compared to last year's pro forma results. As Doug pointed out earlier, we estimate that external headwinds such as lost volume, temporary operating inefficiencies and rising input costs negatively impacted Adient's fiscal '22 revenue and adjusted EBITDA by $2.2 billion and $600 million, respectively. As noted on the right-hand side of the slide, we ended the year with about $1.8 billion of total liquidity, comprised of cash on hand of $947 million and about $900 million of undrawn capacity under Adient's revolving line of credit. In fact, based on our current assumptions, we estimate the year-on-year impact '22 versus '23 for Adient's top line and EBITDA is about $750 million and $45 million, respectively. Excluding equity income, which is forecast at $90 million and included in adjusted EBITDA, Adient's margin would be about 5.2% or 100 basis points higher versus the current -- versus the year just completed. With regard to Q1, as a result of rising input costs that we're experiencing today, such as energy, freight, labor and certain commodities such as steel in Europe, we expect our Q1 EBITDA to land at or slightly below $200 million, even though sales should settle in around the same level of the quarter just completed, call it, $3.7 billion."
}