{
    "symbol": "ADNT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-05 12:48:05",
    "content": " The adjusted EBITDA for the quarter totaled $143 million, as pointed out on the slide, including $175 million in lost volume, temporary operating inefficiencies and premiums, again, primarily driven by unplanned production stoppages at our customers. The most significant influences include the widespread COVID lockdowns in China, which had a significant impact during the COVID, especially in April and May, ongoing supply chain disruptions that continue to impact at our customers, similar to what we experienced last quarter, these disruptions were the result of semiconductor and other components availability, unplanned production stoppages continued to lead to premiums and operating inefficiencies across our network. For Q3 fiscal 2022 we estimate supply chain disruptions and lockdowns in China resulting in loss production, operating inefficiencies and other inflationary pressures, such as freight and utilities had a net impact on the topline of about $600 million and adjusted EBITDA of approximately $175 million. For fiscal 2022 year-to-date through June, we estimate significantly lower production, temporary operating inefficiencies and inflationary pressures have impacted our topline and adjusted EBITDA by $2.1 billion and $530 million, respectively. Business performance also improved year-on-year, driven by improved net material margin of about $32 million, as well as benefits related to improve launch, ops, waste and tooling, call it, another $8 million. Unfortunately, but itâ\u0080\u0099s expected, certain negative factors muted the positive impact to the business performance, specifically $21 million of increased freight costs and $9 million of higher input costs, such as off cycle wages, retention bonuses and increased utilities. High level for the Americas, several positive factors drove a year-on-year increase, included improved volume resulting from modestly improving customer production schedules, improved business performance, driven by improved launch, ops, waste and net material margin, but partially offset by increased freight. In EMEA the modest year-on -- year-over-year improvement was driven by several factors such as commodity recoveries, which were strong and provided approximately $10 million of favorability, improved SG&A which similar to the Americas is largely driven by certain one-time non-repeating benefits to help offset the business environment and a slight improvement in equity income. Almost completely offsetting these benefits were headwinds related to business performance, specifically increased utilities, labor and overhead cost and rising freight costs, partially offset by improved net material margin and improved launch performance, and lower volume and mix, primarily driven by continued supply chain disruptions. Important to note, we forecast to significantly lower industry production volumes, primarily driven by the persistent supply chain disruptions will pressure Adientâ\u0080\u0099s topline by about $2.3 billion for the whole year. Included in the full year EBITDA guide is the significant impact of lower volumes, temporary operating inefficiencies and inflationary pressures, call it, about $610 million, which is consistent with our earlier expectations."
}