{
    "symbol": "ADNT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-04 13:04:03",
    "content": " Adient's key financial metrics for the quarter can be seen on the right hand side of the slide, revenue for the quarter totaled $3.5 billion was about $500 million compared to last year's first quarter adjusted for portfolio actions executed in 2021, As a reminder, the supply chain disruptions that have resulted in significant downtime at our customers began in late Q2 of 2021 and did not impact last year's Q1 results. Adjusted EBITDA for the quarter totaled $146 million and as pointed out on the slide included approximately $185 million in lost volume temporary operating inefficiencies and premiums, again primarily driven by chip shortages and unplanned production stoppages. Adient's December 31, cash balance totaled just under $2.1 billion and included approximately $625 million in net proceeds collected as the final payment associated with Adient's strategic transaction in China, which closed at the end of our 2021 fiscal year. Continued progress on transforming the company's balance sheet, as called out on this slide, Adient's recently launched $800 million in debt tender offers targeting any and all of the companies 9% U.S. dollar secured notes was $600 million outstanding and up to €177 million, about $200 million U.S. dollars of our 3.5% Euro unsecured notes. For Q1 fiscal 2022, we estimate that supply chain disruptions resulting in loss production, operating inefficiencies, premium freight, et cetera, had a net impact on the top line of $680 million and adjusted EBITDA by approximately $185 million. For the full year we continue to expect production stoppages resulting from supply chain disruptions and temporary operating inefficiencies will look very similar to fiscal 2021, specifically impacting Adient's top line by just under $2 billion and adjusted EBITDA by approximately $400 million. Adjusted EBITDA for the quarter was $146 million, down $232 million year-on-year as reported, or down $179 million compared to last year's pro forma results. Adverse business performance, driven by temporary operating inefficiencies resulting from the unplanned production stoppages at our customers and customers not running at rate, increased freight and lower year-over-year commercial settlements impacted the quarter by about $60 million. Also noted, the December 31 cash balance includes approximately $625 million of net proceeds collected as final payment associated with Adient's strategic transaction in China, which closed in September 2021. As Doug mentioned earlier, and noted on the slide, subsequent to the quarter, the company launched an $800 million tender offer targeting any and all of Adient's 9% U.S. secured notes, which as you can see totaled $600 million at quarter end, and up to €177 million of the 3.5% Euro unsecured notes, which is about $200 million. As such, we will continue to prioritize debt pay down with approximately $1 billion of voluntary debt pay down expected in fiscal 2022 and as we progress through the year and hopefully gain better visibility on the operating environment, and its impact on Adient's free cash flow, Management and the Board will continue to assess enhancements to the company's capital allocation plan."
}