{
    "symbol": "HRB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-10 20:20:07",
    "content": " Driven by strong marketing and more advanced tax grow training, our small business assisted tax clients grew 5% on top of the 4% growth reported last year. As we've shared, we've had a few unique tax seasons in a row, including last year's unprecedented growth. We prepared 11.3 million returns through April 30, which compares to $11.6 million through last year's May 17 deadline. The key takeaway is that over the last two years, we have grown market share grown clients by nearly $300,000 and increased our net average charge by 5%, resulting in overall revenue growth of 10%. And over the last two years, we've driven a material increase in online revenue of $37 million or 18%. In summary, we feel very good about this year's tax season as well as the progress and value we've driven over the last several years especially in light of the macro backdrop. In the third quarter of fiscal '22, we delivered approximately $2.1 billion of revenue, which increased 4% or $78 million over the prior year. The increase was primarily driven by positive mix from a higher net average charge in the assisted channel, partially offset by lower Emerald Card revenue due to last year's stimulus payments. Interest expense was approximately $24 million, an increase of about $1 million or 6%, driven by the $500 million of notes we issued last June, partially offset by lower draws this year on our line of credit. Earnings per share from continuing operations decreased from $4.09 to $4.06 due to the higher tax rate, while adjusted earnings per share from continuing operations was $4.11, flat to last year. Jeff, you mentioned in prepared remarks the $134.7 million e-filed through the end of the season, compared that to mid-May last year of $138.6. But if you go back and look to tax season '19, for example, which is the last time the tax season ended at a comparable time period around mid-April, extensions look like they're probably up north of $4 million right now."
}