{
    "symbol": "TRNS",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-01 14:09:11",
    "content": " Consolidated revenue for the quarter was up 12% to $56 million, service revenue grew 19% with organic service revenue growth of 9.3%, consolidated gross margin expanded 70 basis points to 29.7%, driven by expansion in our distribution and rental business margin. Please proceed with your question. And I'm not sure if there's any like efficiency metrics that you can give us, either what the margin profile is, how different it is, revenues by employees, but my guess is, they're probably able to become a much more efficient organization when you incorporate that kind of technology into the business. Please proceed with your question. It continues to be strong, it continues to do well in a variety of economic conditions and so we're going to continue to fund that business and it's an important part of our value proposition and it also makes us unique, itâ\u0080\u0099s a differentiator as well. Please proceed with your question. I mean, weâ\u0080\u0099re able to -- as I mentioned in my commentary, we're able to do some strategic buys over the past six to nine months that allowed us to kind of get ahead of some of the vendor price increases, which is giving us a little bit of boost to margin as well, but that's going to kind of dry up a little bit over time as things moderate and we'll be able to continue to leverage the growth in the rental, but I think you should think of where we are now kind of is the ceiling. In the meantime, our drivers are as they have been in the past, we're looking to increase our capabilities, our geographic footprints -- footprint and expand our addressable markets where we can like we did with the NEXA business and we think there's opportunities to do that, opportunities to pick up services that are adjacent to our core calibration, we will be looking for those, so three main drivers and mostly in the US and I would say a really strong pipeline of acquisition opportunities. Please proceed with your question. Please proceed with your question. We see the same headwinds that everybody else sees, but I've been in this business for 35 years and through a lot of economic cycles and I -- just the calibration business and to the degree that you spend your time and your efforts in regulated markets, we're well positioned for an economic slowdown."
}