{
    "symbol": "NWPX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 16:44:05",
    "content": " In general, the steel pressure pipe project bidding environment has been very robust, which should bode well for the remainder of the year, in part due to orders from 2021 moving and sticking in 2022 and since steel supply and delivery-related issues have largely abated for our business since the beginning of the year. Steel pressure pipe segment sales increased 24.4% to $74.7 million compared to $60.1 million in 2021 due to an 85% increase in selling price per ton, resulting from increased steel costs along with changes in product mix, which was partially offset by a 33% decrease in tons produced, resulting from changes in project timing. Precast segment sales increased 182.5% to $34.6 million compared to $12.3 million in the first quarter of 2021, primarily due to $19.7 million contribution from the recently acquired ParkUSA operations which Scott discussed earlier. Precast gross profit increased 368.7% to $7.6 million or 21.9% of precast sales from $1.6 million or 13.2% of segment sales in the first quarter of 2021, primarily due to the contribution from ParkUSA as well as higher prices at our pre-existing precast operations. I think that the -- obviously, there's variability in the steel pressure pipe business, and we're conscious of variability just like when we talked about 2021, we thought the back half of 2021 was going to be a really large bidding back half of the year. So -- and it's really -- that's the focus on, all right, well, we've got to continue to grow the precast business to continue to balance off the variability that we see in steel pressure pipe. But the -- we're still -- the base of the company is still the steel pressure pipe water transmission business, and we've got to pay attention to the variables that we see in that based on how jobs line up because you start the beginning of a year and you think you're going to have a certain amount of jobs bidding throughout the year and you build your plan based on those number of jobs."
}