{
    "symbol": "NWPX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 21:34:05",
    "content": " As of June 30th, our backlog including confirmed orders for the Steel Pressure Pipe segment was $338 million, which was down only slightly from our all-time record of $341 million as of March 31st, 2022, and compared to $234 million as of June 30th, 2021. As noted on our last call, we projected the first quarter would be the high watermark for our Steel Pressure Pipe backlog in 2022, given the robust bidding activity that we experienced at the onset of the year. Sales from our Precast segment increased 175.2% year-over-year to $41.4 million, driven primarily by aforementioned $24.2 million contribution from ParkUSA, which we acquired on October 5th, 2021, along with an extremely strong $17.2 million revenue quarter from our preexisting Precast operations at the Geneva locations, which we acquired on January 31st, 2020. Our consolidated gross profit increased 152.5% year-over-year to $24.1 million, which resulted in a gross margin of 20.3%, up approximately 740 basis points from the second quarter of 2021, which as a reminder, was negatively impacted by COVID-related production delays and associated bidding pressure. In summary, we are very pleased with our second quarter performance resulting from outstanding execution in our precast business that led to a record precast quarter, along with ongoing strength in steel pressure pipe bidding activity that led to improving results for the steel pressure pipe business. While our third quarter steel pressure pipe revenue is expected to be down slightly as a result of Adelanto and St. Louis plant flood related shutdowns, we expect our margins to be flat to up modestly as the underlying business remains fundamentally solid, supported by strength in our SPP backlog, as well as our precast order book, both of which are expected to continue for the near-term. Steel Pressure Pipe segment sales increased 31.2% to $77.1 million compared to $58.7 million in 2021, driven by a 35% increase in selling price per ton, resulting in increased steel costs along with changes in product mix, which were partially offset by a 3% decrease in tons produced resulting from changes in project timing. Precast segment sales increased 175.2% to $41.4 million compared to $15.1 million in the second quarter of 2021, primarily due to a $24.2 million contribution from the recently acquired ParkUSA operations. Precast gross profit increased 343.9% to $13 million or 31.3% of Precast sales from $2.9 million or 19.4% of segment sales in the second quarter of 2021, primarily due to the contribution from ParkUSA, as well as higher prices at our preexisting Precast operations. But also, when you get into the fourth quarter of the year for Precast, that's the slower time of the year, but I would say in both cases on Steel Pressure Pipe and on the Precast side with the strength of the backlog, things look pretty solid in the second half of the year. Mr. Ramirez, your line is open. Mr. Ramirez, your line is open."
}