{
    "symbol": "LADR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 20:46:08",
    "content": " In the first quarter, we originated $732 million of loans, including 19 balance sheet loans, totaling $677 million, with more than 25% of those originations made to repeat Ladder borrows. As of quarter end, we have total liquidity of approximately $700 million and are adjusted leverage stood at 1.6x net of cash, 38% of our total debt is comprised of fixed rate unsecured bonds and 79% of our total debt is comprised of unsecured bonds and non-recourse financings. Second, after demonstrating our strong credit skills and asset management skills through robust payoffs, over 75% of our $3.9 billion balance sheet loan portfolio is now comprised of new loans originated in the last 12 months, with fresh valuations and business plans. Our three segments continue to perform well during the quarter, a $3.9 billion balance sheet loan portfolio is 93% floating rate diverse in terms of collateral and geography with less than a two year weighted average remaining maturity. As Pamela discussed, the sale of two net lease properties during the first quarter produced a net gain of $15 million and generated a combined IRRs over 16% during the respective hold periods. Moving on to our products, we feel particularly confident in our inventory having essentially recalibrated our asset base over the last 2.5 years, because we had shorter maturities going into 2020, we received $2.5 billion in bridge loan payoff since the first quarter of 2020, this figure speaks volumes as to how strong our credit skills are. If rates do rise as expected, we think our sales of real estate may slow down after the second quarter ends, but our net interest income from our increased loan portfolio is ready to step in as the workforce of our earnings engine. And we haven't done a full-on sale to show the market that, but I think for several quarters in a row here, I think last year we made $26 million, $27 million in real estate sales."
}