{
    "symbol": "LADR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 21:26:02",
    "content": " I think in the short term one of the easiest places to add will be in the flat â\u0080\u0093 the static CLO portfolios of A Class bonds, because they, you know what the collateral is, itâ\u0080\u0099s not going to change, and I think we saw them last week where a complete multifamily deal traded the AAA's price with at 275 over LIBOR, with a DM of 275. So itâ\u0080\u0099s a little wonkie, but there are plenty of opportunities out there and I think â\u0080\u0093 unfortunately I think the least attractive one is the actual loan origination process, but I think that's going to correct itself very quickly, because I do think these â\u0080\u0093 I don't think you're going to see A Classes on static or A Classes on CLO deals; thatâ\u0080\u0099s 275 and I think it's going to snap in pretty hard. I would like it in a $100 million or $200 million, but I donâ\u0080\u0099t think weâ\u0080\u0099re going to be able to buy you know a large amount of AAA bonds that are yielding 21%. So I think we will be adding, because basically â\u0080\u0093 because I think cap rates are just a point higher and a lot of that has to do, I donâ\u0080\u0099t know by â\u0080\u0093 if the stretch seen here is, a lot of people a writing 65% loans and we will too. We would see less premises, because the rates are higher and â\u0080\u0093 but weâ\u0080\u0099re very comfortable and as Pamela mentioned, we had three payoffs in the end of the quarter and in the first week of July where we had a modified hotel loan for $57 million and that paid off a year early, it was not levered. So as LIBOR goes higher and weâ\u0080\u0099re now adding loans at 6.5% and 7% at the bottom line, because we're still paying here â\u0080\u009c4.5%â\u0080\u009d on that $1.3 billion of corporate bonds and thatâ\u0080\u0099s really the operating leverage we keep talking about and it's showing up. And so as a result of that, I think the for sale sign will go up on the property or else as I mentioned earlier, that stretched in your concept whereas the guy is going to say I can't really refinance the loan I had, even though I didn't do anything wrong, that rents are doing what they are supposed to be doing, but interest rates have just eclipsed, all of the income weâ\u0080\u0099ve gained."
}