{
    "symbol": "MLR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 13:17:08",
    "content": " Gross profit for the third quarter was $23.2 million, an increase of 30% compared to the prior year quarter, resulting in a gross margin of 11.3%. Net sales for the third quarter 2022 were $205.6 million versus $164.7 million for the third quarter of 2021, a 24.8% year-over-year increase, driven largely by the continued strong demand for our products, our pricing actions and an ability to ship more finished goods. Gross profit was $23.2 million or 11.3% of net sales for the third quarter, 2022 compared to $17.8 million or 10.8% of net sales for the prior year period. Net interest expense for the third quarter 2022 was $1 million up from $286,000 for the third period, 2021, primarily related to increases in distributor floor plan financing cost, which flex up and down with revenue, as well as the increase in our outstanding debt and rising interest rates. Other expense for the third quarter 2022 was $666,000 compared to $206,000 for the third quarter 2021, attributed largely to currency exchange rate fluctuations and the relative strength of the U.S. dollar. Net income for the third quarter 2022 was $5.2 million or $0.46 per diluted share compared to net income of $3.8 million or $0.34 per diluted share in the third quarter of 2021, increases of 36% and 35.3% respectively. Net sales for the first nine months of 2022 were $622.6 million compared to $515.8 million in the prior year period, an increase of 20.7%. Gross profit for the nine months ended in September 30, 2022 was $56.9 million or 9.1% of sales compared to $54.3 million or 10.5% of sales compared to the same period last year. Net income for the first nine months of 2022 was $11.1 million or $0.97 per share compared to net income for the first nine months of 2021 of $13.5 million or $1.19 per share, representing decreases of 18.4% and 18.5% respectively. Turning to the balance sheet, cash and cash equivalence as of September 30, 2022 was $33.2 million compared to $31.1 million as of June 30, 2022 and $50.4 million as of September 30, 2021. Accounts receivable as of September 30, 2022 was $167.9 million compared to $191.2 million as of June 30, 2022 and $131.1 million as of September 30, 2021. Inventories were $144.4 million as of September 30, 2022 compared to $141.2 million as of June 30, 2022 and $108.8 million as of September 30, 2021. Accounts payable as of September 30, 2022 was $107.5 million compared to $137.7 million as of June 30, 2022 and $87.8 million as of September 30, 2021. Lastly, the Board of Directors approved our quarterly cash dividend of $0.18 per share payable December 12, 2022 to shareholders of record at the close of business on December 5, 2022, marking the 48th consecutive quarter that the company has paid the dividend. If I assume Q4 revenues are lower than Q3 for seasonal and other reasons and building something in the mid- to high teens, almost entirely based on price for next year, if I assume your gross margin returns another 50 or 60, 80 basis points to what has been your historic going back to 2016, if you can control your operating expenses in the mid-5s, which, again, you should be getting leverage â\u0080\u0093 you spent $82 million on an expansion and other factors that are productivity-enhancing."
}