{
    "symbol": "IONQ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 21:07:16",
    "content": "  Operator: Greeting, and welcome to the IonQ Second Quarter 2022 Earnings Call. Good afternoon, everyone and welcome to IonQ's second quarter 2022 earnings call. I am pleased to be joined on today's call by Peter Chapman, IonQ's President and Chief Executive Officer; Thomas Kramer, our Chief Financial Officer; Dr. Chris Monroe, our Co-Founder and Chief Scientist; and Dr. Jungsang Kim, our Co-Founder and Chief Technology Officer. By now, everyone should have access to the company's second quarter 2022 earnings press release issued this afternoon, which is available on the Investor Relation's section of our website at investors.ionq.com. Please note that on today's call, management will refer to adjusted EBITDA, which is a non-GAAP financial measure. While the company believes this non-GAAP financial measure provides useful information for investors, the presentation of this information is not intended to be considered in isolation, or as a substitute for the financial information presented in accordance with GAAP. Therefore, please refer to the cautionary statement in today's press release for additional details about these remarks. Please refer to today's press release and to the company's quarterly report on Form 10-Q for the fiscal quarter ended June 30th, 2022, which was filed with the SEC and other filings with the SEC for detailed discussion of the risks that could cause actual results to differ materially from those expressed or implied in any forward-looking statements made today. With respect to our technical progress, we had previously reported six months ago that our Aria class of quantum computers had achieved a record 20 algorithmic qubits. As you'll remember, algorithmic qubits is a benchmark consisting of common quantum algorithms that represent the kind of jobs customers want to run. The algorithms used in the benchmark were defined by the quantum industry group, QEDC with input from various hardware companies and users. Specifically, we've been hard at work to dramatically improve Aria's performance. Moving from 20 to 23 is therefore an eight-X increase in Aria's computational power, all in just six months since February of this year. This further cements Aria's lead as the most powerful known quantum computer in the world, in terms of its ability to run useful quantum algorithms. In other words, we're well on our way towards meeting our 2022 technical goal of 25 algorithmic qubits and are confident of hitting that target. And as you may remember, we plan to offer Forte to initial customers later this year, for those who are interested in using IonQ's latest and greatest. Moreover, with the progress we are making on our barium systems, we expect even better performance and have a high degree of confidence in meeting our technical milestones in the coming years. Meanwhile, we are thrilled to announce that IonQ Aria, which we believe to be the most powerful commercial quantum computer in the world with 23 algorithm qubits, will be available tomorrow to all users of Microsoft Azure Quantum. Existing customers are expanding their engagements with IonQ and we've recently added new customers, including Airbus and Dow. Airbus is leveraging IonQ to use Aria to explore optimization problems that are at the core of their aerospace business, such as how do efficiently load cargo on aircraft. Dow, a global leader in chemistry and material science, is using Aria to explore the boundaries of quantum computing applications in materials discovery research. They join other IonQ customers who are partnering with us to explore the intersection of quantum machine learning, material science and chemistry. We continue to see compelling results on the projects we have initiated to apply our systems to real business problems, both internally and with customers. In June, we announced the results of our partnership with GE Research to develop a quantum algorithm that manages financial risk exposure. For this, IonQ will build and host a quantum router as part of a new quantum network, the Mid-Atlantic region quantum internet spanning UMD's campus and the surrounding area. The work is not only important for quantum communications, but also continues our work towards connecting multiple quantum computers together to form even more powerful systems. Internally, we're investing in cutting edge research for problems that we think will benefit the most from quantum computing and deliver near-term business value. For example, we recently published a series of quantum methods for natural language processing, or NLP, a technology that is increasingly ubiquitous in voice interfaces like Amazon's Alexa in email applications like Gmail and in chatbot functionalities like those who may have experienced in customer support. Our team created NLP algorithms to represent linguistic qualities like ambiguity, vagueness, and novelty on a quantum computer. We think quantum techniques of this nature could eventually be embedded in these NLP applications, delivering a smoother and more powerful user experience. And each time we achieve remarkable results with our customers, they become advocates and case studies for the value of IonQ quantum computing. Dr. Mehuys joins us after leading Systems Engineering at PsiQuantum, where he oversaw teams throughout systems, R&D and operations, and brings a robust understanding of quantum hardware with him. Additionally, we are expanding our sales reach internationally with the creation of IonQ's first international entities in Germany and Israel. As more and more organizations are starting to explore quantum, we are getting ready to capture this demand on a worldwide stage. As a local example, U.S. government investment in quantum information science R&D nearly double from 2019 to 2022, going from a reported $449 million to a requested $877 million. Now, let's walk through the second quarter results in more detail. This compares to $93,000 in a prior year period and is above the high-end of our previously provided range. Moving down the income statement, for Q2 2022, our total operating cost and expenses for the second quarter were $21.5 million, up 114% from $10.1 million in the comparable prior year period. To break this down further, our research and development cost for the second quarter were $9.7 million, up 76% from $5.5 million in the year prior period. Our sales and marketing costs in the second quarter were $2.1 million, up 145% from $871,000 in their year prior period. Our general and administrative cost in the second quarter was $7.6 million, up 160% from $2.9 million in the comparable prior year period. This change is largely attributable to an increase in stock based compensation expense, which was $2.8 million for the second quarter compared to $1.7 million in the comparable prior year period. Additionally, we saw an adjusted EBITDA loss for the second quarter of $11.6 million compared to a $7 million adjusted EBITDA loss in the prior year period. Cash, cash equivalents and investments as of June 30th, 2022, were $571.3 million. We continue to believe this gives us sufficient cash reserve to get to profitability without needing to raise additional funds, given our current roadmap. Focusing on our full fiscal 2022 outlook, we continue to have confidence in our full year 2022 revenue range of $10.2 million to $10.7 million. We achieved $600,000 in bookings for the quarter compared to $57,000 in the Q2, 2021 period. As for full fiscal 2022, we are maintaining our expected range of $23 million to $27 million. While we believe we will achieve our booking forecast, we also feel it is prudent to acknowledge the risk associated with the present market conditions, which is leading to contracting delays across the technology sector. We have identified $12 million of late stage opportunity in our booking forecast that we believe is likely to close, but precise timing is unclear, which may lead us to miss some or all of this value in 2022. Please proceed with your question. I guess, wanted to start with the comment that you'll be bringing Aria to Azure quantum beginning tomorrow. Just on the technical -- I'll answer the technical part first, which is all the machines support the same API, whether it's an old machine or an latest generation. So, largely there's kind of not much work on the cloud provider's part to get to the latest machine. It's mostly configuration work that they have to do just to inside their system and administratively to say, hey, there's a new system and those kinds of things. Actually, to be honest, probably setting up new rates and those kinds of things are more difficult than it is actually integrating one of our new systems, so that part's relatively easy. The -- we look forward to make -- to explore other avenues for Aria on other systems, but we're not making any comments on that today. And then for Thomas, I know there've been some delays in government contracting this year, just with COVID and work from home, et cetera, but wondering on the $12 million of late stage bookings you identified that, could be subject to delays, and slip out of 2022 into 2023. Please proceed with your question. I wanted to follow up on the bookings and maybe ask a different way, but I know you're not changing your revenue guidance for fiscal 2022, which is consistent with how you talked about those bookings on the last call. But curious if you're seeing any impact to potentially your fiscal 2023 revenue outlook from some of these bookings push outs, or just from the general market environment out there and broadly technology pushing out some of those contracts. Not asking for a number, obviously you haven't guided to that, but just curious, qualitatively how you guys are thinking about whether that might impact your fiscal 2023 revenue. But what we're seeing here is that there is interest in our technology and so far, we continue to have a great confidence in what we think is going to happen in 2023. And then if those improvements are kind of -- if those improvements will translate to other systems like Forte, for example. So, it's really a combination of all the technology developments of many fronts, that have made this possible. And I'll just jump in on this, which is everything -- which I think was part of your question -- everything that we're learning on Aria, I think is some of it very directly like the compiler work that Jungsang thing mentioned is applicable across everything we're doing. Please proceed with your question. Just wanting to clarify is this sort of macro driven where your customers, whether it be private companies or governments becoming a little bit more prudent and careful with their investments, or if it's something more tech related, quantum related, any color there would be helpful. And then as my second question on profitability, you guys talked about building more systems this year and that driving, I think, it was R&D spend a little bit higher. So, I guess, the question is, should we be thinking about the timing of profitability being pulling -- being pulled in or pushed out relative to prior expectations or no change to how you're thinking about converting to profitability. But what it does do is it allows us to have more capacity come online in the near to medium future, actually make that medium future because we're not planning to double our capacity overnight, but we do want to be able to satisfy all the demand that's out there. And right now, with the record break performance that we have, it's just prudent of us to make more machines. I think some of it's macro related, but some of it's also just that these are really large purchases, and they are purchases in a technology that world essentially has not seen before. And so, there's just a lot of back and forth and everybody needs to understand it. And a lot of the time there are people like me on both sides and we're like, we know the price of everything and the value of nothing. Please proceed with your question. One, what I wanted to ask maybe quickly and you kind of talked about the build out of the hardware sales and the manufacturing there. And just kind of curious, if you are thinking that maybe the Aria platform could be introduced in these machines or if that's for the next-generation, and then maybe if there's any component of this, this related to the networking side versus the computing side. In the Seattle office, they'll be working on manufacturing of quantum computers and kind of bringing the Henry Ford effect, if you will, to that. So that team is very much focused on building rack mounted, quantum computers that can be easily manufactured. If you want to do networking, you have to have more than one quantum computer to do it. So one of the reasons that we are building, gearing up manufacturing is to have enough free machines, so that R&D can do experiments for quantum networking. As you might know, we're going to scale our quantum computers by networking many chips together. I would say, in our current systems, we don't need that yet, but this is what -- when we -- when our systems get more powerful, that's how we will do it. And that said also we're just now kicking off a big program with the University of Maryland on developing protocols for networking, optically networking ion trapped quantum computer systems. And then, I know this question was asked earlier, but we're just going to dig in a bit. And maybe just digging in, is this -- it doesn't sound like it's chip specific. So, I think this is one of the areas where as we focus on kind performance metric tied to a realistic and practical algorithms, we're finding compounding opportunities to continue to improve the performance, so that we can actually run bigger and more challenging problems on the same -- on improving hardware. And again adding to that a little color, is that the type of errors that our machines experience, without getting two technical they're sort of miscalibration. And the types of areas we have, and that's not true of all quantum computing systems. We're going to do that too, but we're going to have the whole kind of spectrum of air mitigation and then full-blooded error correction as our systems grow. We continue to make progress and make an increasing effort in improving, validating Aria systems."
}