{
    "symbol": "VTEX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 21:51:04",
    "content": " Lipase, everyone, and welcome to the VTEX Earnings Conference Call for the quarter ended December 31, 2022; I'm Julia Fernandez, Investor Relations Director for Vtex. Certain risks and uncertainties are described in the risk factors and forward-looking statement sections of the Bite Form 20-F of the year ended December 31, 2022, and other Vtex filings within the U.S. Securities and Exchange Commission, which are available on our Investor Relations website. In 2022, e-commerce in Latin America grew single digits while our GMV growth reached 31%, exceeding the market performance by more than 20%. VTEX same-store sales increased to 17% on an FX-neutral basis indicating that in addition to new customer adds, existing customers performed above the curve and contributed significantly to our outperformance versus the overall market. Our goal is to provide a reliable solution to our customers so they can solely focus on expanding their business while at the same time, we continue to strengthen our comprehensive range of a site sales products to enable our customers to grow their GMV. Reflecting on the performance of the last quarter of 2022, we're delighted to report that our business has seen resilient growth, although GMV and revenue were below our expectations, we have solidified our position as a regional leader and expanded our reach beyond Latin America. Specifically, in Q4, our GMV increased by 34 percentage year-over-year in U.S. dollars and 29% on an FX-neutral basis, reaching almost the $4 billion mark in the quarter. Despite being impacted by this trend, our business maintained strong performance with Q4 same-store sales improving quarter-over-quarter. Throughout our company's history, we have established solid and long-term relationship with our customers, as evidenced by the growing number of stores and countries per customer. In 2022, we were honored to have the trust of over 2,600 customers with a total of 3,400 stores across 38 countries. Our top 100 customers in 2022 averaged 5.9 stores per customer with operations in 34 countries, an improvement from 4.8 stores per customer in 2021. In first quarter of 2022, we added several new customers who previously did not have an online presence in the countries they started operating with us. In addition to attracting new customers, we also focused on strengthening our relationship with existing customers by supporting their expansion efforts. During the fourth quarter, Tavera premier brands and retailers chose to expand their operation with us by opening new stores and further integrating with us. This includes Belcorp, who added stores in Mexico and Peru currently operating in 4 countries in Latin America. Samsung, who added B2B in Brazil currently operating both B2C and B2B with us; and Carrefour, who integrated more than 150 physical stores into the omnichannel operations in Brazil. This brand's decision to expand their operations with us is a testament of our platform strength, relevant value proposition and the trust we provide to our customers. The dependability of our network, which provides scalability, reliability and security while giving our customers piece of mind with 100% of time during Black Friday and Cyber Monday week. And the growth in volumes in countries such as Mexico and the United States, both of which joined the top 5 countries with the highest year-over-year GMV dollar increase among all detected countries demonstrating international expansion tangible results."
}