{
    "symbol": "WVE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 11:55:23",
    "content": "  Operator: Good morning, and welcome to the Wave Life Sciences Fourth Quarter and Full Year 2022 Financial Results Conference Call. I'll now turn the call over to  (ph), Wave's IR Consultant. Good morning, and thank you for joining us today to discuss our recent business progress and review Wave's fourth quarter and full year 2022 financial results. Before we begin, I would like to remind you that discussions during this conference call will include forward-looking statements. At Wave, we believe the power of our PRISM platform and the potential of our current and future pipeline has positioned us to become the leading RNA medicines company. It offers three distinct RNA targeting modalities: editing, slicing and silencing, so that we can design built for purpose molecules that optimally address disease biology. Importantly, every data point generated by Wave is incorporated into PRISM to accelerate learnings about oligonucleotide structure and optimization, and improve our probability of success with each new target. Today, we have all the pieces in place to achieve our vision of delivering life changing RNA medicines so that patients and families can realize a brighter future. 2022 was a transformational year for Wave, resulting from focused and deliberate execution. Entering 2023, we have clinical validation of our PRISM platform, a leading position in RNA editing, growing momentum in building a robust pipeline and a strong financial position. Last year, we delivered three positive clinical data sets for our HD, ALS/FTD and DMD programs. Collectively, these data sets highlighted our ability to achieve robust and durable target engagement with our oligonucleotide. Most recently, we announced positive proof-of-concept results from our clinical study of WVE-N531for DMD including the highest level of exon skipping observed in any DMD clinical trial to date after only six weeks. We expect to make history this year when we initiate clinical development of WVE-006 for AATD: Alpha-1 antitrypsin deficiency, which is positioned to be the first RNA editing therapeutic to be evaluated in human. Additionally, in 2022, we demonstrated proof-of-concept in vivo for new applications of AIMers beyond correction, including modulation of protein-protein interaction and upregulation. Beyond our current clinical programs, we are deepening our pipeline with high value programs across our modalities. One way that we will do this is with our collaboration with GSK, which will provide us with access to unique insights on genetically validated targets with first-in-class potential. We expect that this collaboration, as well as our own target research will help unlock the broad potential of RNA editing as well as our growing RNAi capability and we expect to add several new pipeline programs this year and beyond. With our positive data for WVE-N531, it has been a joy to reconnect with the DMD community over the past few months and discuss the future of this program and our potential to expand beyond Exon 53. The high muscle concentrations seen in the initial data set and the favorable safety profile, especially since N531 does not require the use of peptide or antibody conjugate and avoid the limitations of other approaches. With these results early in the course of treatment, we believe that N531 has the potential to restore meaningful levels of functional dystrophin. If we're successful, then N531 has the potential to meaningfully impact patients, while becoming a significant commercial opportunity for Wave. Which one should think of as our approach to endogenous mRNA delivery, rather than giving endogenous mRNA therapies, we can increase the expression of mRNA inside the cell using our AIMers. This means that rather than correcting each of the mutations associated with the genetic disease one-by-one, we see opportunities that significantly increase the total addressable market by restoring healthy levels of protein independent of mutation. Our AIMer candidate, WVE-006, is on track to be the first RNA editing molecule to enter the clinic. Our AIMers are very effective at recruiting ADAR enzymes, are highly stable and demonstrate remarkably durable and highly specific editing in preclinical models. And as we've shown preclinically, AIMers can also be delivered with free uptake to a variety of cells throughout the body. Our knowledge and experience in silencing, GalNAc conjugation and advancements in PRISM chemistry have enabled the expansion of our platform to the field of RNAi. In 2022, we highlighted our preclinical in vivo data demonstrating that Wave PRISM chemistry leads to enhanced Ago2 loading, resulting in improvements to potency and durability compared with others RNAi capability. Additionally, we shared data using GalNAc conjugated small interferring RNAs in the liver of mice. These data demonstrated unprecedented potency and durability against mouse TTR and human HSD17 Beta 13, and they were among the data that reinforced the broader possibility of our platform to GSK and other potential partners. Following our compelling data with GalNAc conjugated siRNAs, we next turn to unconjugated siRNAs in the CNS. On the right of the slide, you'll see our initial preclinical in vivo siRNA data in CNS. These unconjugated siRNA demonstrated 70% to 90% reduction in APP, a target that we use to validate this platform capability. These reductions were seen across each of six brain regions in mouse CNS at eight weeks following a single ICV dose of 100 microgram, demonstrating broad distribution in addition to potent silencing. In January 2023, we closed our deal with GSK and we are now underway with the collaboration, which we expect will yield substantial value to Wave in the coming years. As we consider the evolving treatment landscape, it became clear to us that an important aspect of succeeding in AATD would be to prioritize a partner such as GSK with expertise in global clinical development and commercialization, as well as global and local leadership in respiratory outcome study. Additionally, we have the potential to receive meaningful milestone payments throughout the development process including near term clinical milestone payments, as well as double digit royalties on net sales into the high teens. We and GSK are excited about opportunities in the liver with GalNAc and outside the liver, given our data showing Wave oligonucleotides can distribute to a variety of cells. With our broad capabilities, the universe of addressable targets is vast and we are relying on a set of guiding principles for Wave programs across clinical, technical and commercial dimensions to narrow down prospective targets. These include indications of significant unmet medical needs, strong biological rationale supporting clinical validation of genetic targets, efficient path to clinical proof-of-concept and to these relevant clinical biomarkers that could potentially support accelerated registration pathways. Like HD and AATD, DMD is a therapeutic area that is well aligned with our guiding principles of surrogate biomarkers and efficient path to clinical proof-of-concept. GalNAc based RNA editing and RNAi therapeutics are also well suited for cardiometabolic targets, including those in the hepatic kind family of diseases. In the second half of this year, we expect to provide additional updates and data on our initial with the new program with others to follow in 2024 and beyond. Outside of the liver and muscle, we see a wholly owned pipeline opportunities in a variety of tissues such as CNS, as well as applications for all of our modalities. Our pipeline is differentiated and diversified spending multiple modalities, including RNA editing, slicing and silencing. We also have executed strategic partnerships to unlock further value from our platform and program, including our groundbreaking work on AATD. With that, I will now turn the call over to Anne-Marie, who will provide updates related to our clinical programs. In 2022, we delivered key data sets for each of our lead programs, including positive clinical data from our DMD, HD, and ALS/FTD trials. Finally, we continue to advance our CNS silencing program shown on the right of this slide in dark blue under our Takeda collaboration. In 2022, we demonstrated target engagement in the CNS for both programs after patients receive a single dose of 003 or 004 and we're working towards the next stage . Starting with WVE-N531, in December 2022, we achieved proof-of-concept for N531 with DMD amenable to exon 53 skipping. This study was designed to rapidly evaluate whether N531 as a pharmacological profile, but also comes the limitations of our first generation DMD candidate dystrophin with muscle concentration and safety and tolerability as primary endpoint. Three ambulatory boys participated in this open-label, intra-patient dose escalation clinical trial. The boys received single escalating doses of one, three, six and 10 mg/kg of N531. We were excited to observe the high muscle concentration of N531, which exceeded our expectations and even more excited to see 53 exon skipping at this time point. Additionally, you may recall that our non-human primate date showed muscle concentrations of N531 in the heart and diaphragm that were higher than those in the skeletal muscle, suggesting these results from the deltoid and bicep may be underrepresenting what is happening in other critical muscle tissues impacted by DMD. These data are consistent with our preclinical observations, thus our next generation PN chemistry is increasing muscle exposure and target engagement without needing peptide or antibody conjugate. It's exciting to see this level of exon skipping after just three doses, especially since skipping may increase with longer dosing. Later today at the MDA Clinical and Scientific Conference, Wave's Dr. Mike Panzara will be sharing these data with clinicians, as well as the next steps for N531, but I'll also review here in a moment. Since the data in December, we have been discussing potential next steps for N531 with researchers and key opinion leaders. Each of these discussions was the right time point to assess dystrophin, given its unique biology and the fact that meaningful dystrophin production does take time. In boys with DMD, nonsense-mediated decay associated with the mutation and the general lack of healthy cellular environment destabilizes the dystrophin transcripts, limiting their low numbers to nearly undetectable levels. Then as the number of transcripts rise, dystrophin protein should also start to accumulate at more meaningful levels. Over time and with consistent exposure to high levels of exon skipping produced by N531, we expect this feedback loop to support cumulative increases in the expression of dystrophin protein. However, with this level of exon skipping, we expect to see more dystrophin with longer treatment. The primary endpoint will be dystrophin protein restoration and we will also assess pharmacokinetics functional endpoints such as NSAA and others, as well as safety and tolerability. If the data were supportive, we will discuss regulatory pathways for approval with regulators. Our preclinical data has demonstrated a significant seven fold change in AAT protein, which is well over 11 micromolar. Importantly, we also demonstrated that restored AAT protein is wild type and that it is functional as demonstrated by the neutrophil elastase inhibition. Additionally, while 006 uses a new therapeutic modality, we have the benefit of following a well understood path laid out by regulators. And additionally, regulators are well versed in the use of oligonucleotides to recruit endogenous cellular machinery, like slicing machinery in DMD and Ago2 for RNAi. I'll touch briefly on the current status of WVE-003, the first allele-selective candidate for HD and WVE-004, our variant selective candidate for C9orf72 associated ALS/FTD. In September 2022, Wave became the first company to demonstrate the feasibility of selectively silencing a mutant allele with our single dose data for 003. Based on these data, we adopted to select HD trial to expand the single dose cohort to better define the treatment effect and decide on optimal doses, the multidose phase of the study. In April 2022, our FOCUS-C9 study of WVE-004 became our first to show successful translation of our preclinical data in the clinic. For the remainder of 2022, we have completed the single dose cohort, made progress on the multidose cohort and initiated the open label extension trial, also in consultation with the independent data safety monitoring committee. We completed enrollment of the multidose cohort shown here on the slide, which keeps us on track for data in the first half of 2023. This will be a substantial data set consisting of several single and multidose cohorts, which will inform our next step, including discussions with Takeda. These programs all underscores the promising breadth of our best-in-class multimodal RNA medicines platform, as well as our commitment to advance first or best-in-class therapies for patients. The increase in net loss year-over-year was primarily driven by increased spend on our clinical program, as well as increased compensation-related expenses. This increase was primarily due to increased external expenses related to our AATD, C9 and DMD program and compensation related expenses, partially offset by a decrease in spending in our HD program. General and administrative expenses increased $1.6 million to $13.7 million for the fourth quarter of 2022 as compared to $12.1 million last year, primarily due to increases in professional and service fee expenses. Additionally, in Q1 2023 where strategic collaboration with GSK became effective and provided upfront cash of $170 million to Wave. I am proud of how the team continues to execute with resolute focus on unlocking program value through our ability to align the right target with the best oligonucleotide approach, be that editing, slicing or silencing with antisense or RNAi. In the year ahead, we expect to deliver on multiple pipeline and platform candidates. With our clinical silencing programs, we're advancing two candidates for which we expect additional data in the first half of this year. WVE-003 and HD is the only clinical stage mutant Huntington lowering wild Huntington sparing approach, while WVE-004 offers a variant selective approach to C9orf72 associated ALS/FTD. With slicing, WVE-N531 is demonstrating the potential to be a best-in-class approach in the DMD space. If successful, these data would unlock high value DMD franchise. In addition to DMD, we see future expansion opportunities for slicing in other muscle diseases as well as CNS. With editing, WVE-006 is the most advanced candidate and potentially a best-in-class approach for AATD. We expect transition of this program to the clinic in the second half of this year, if successful, WVE-006will unlock the broad potential of AIMers. With RNAi, our preclinical data suggests that we have best-in-class potential with this modality and is shaping up to be a powerful silencing component our RNA medicines platform with applicability in the liver, CNS and beyond. Finally, we are already advancing collaboration activities with GSK with potential for additional cash inflows over the course of this year and beyond. Your line is now open. Thanks so much for taking our question. With regards to regulatory pathways, as you're alluding to, there are well trodden regulatory paths for accelerated approval on the basis of dystrophin. And obviously, when we have our data, we will be assessing and discussing with the regulators what the best pathway is for us. Please stand by for our next question. Our next question comes from Joon Lee with Truist. Your line is now open. And I can't of course state what the outcome will be, but I would say that any indications that the FDA is still supporting the use of biomarkers to aid the approval of new therapies, the rare diseases is highly encouraging and supported, of course, by us. I mean, I think it will be an interesting discussion, one on the continued support of dystrophin as a regulatory endpoint potentially for accelerated approval. But I think what we think consistently in the exon skipping field is, approvals based on dystrophin level. So I think, again, it's encouraging to see the agency continue to leverage these clinical biomarkers as potential registration info. Please stand by for our next question. Your line is now open. Thanks so much for taking our question. And I think stepping back, I mean, this is an important reason of our unique approach of using oligonucleotide to engage with endogenous RNA editing. So again, I think the question obviously refers to a whole bunch of other approaches predominantly based on the DNA editing space, the base editing space. Please stand by for our next question. Your line is now open. And look, I appreciate the question, because a lot of this is building on work that we began last year and, obviously, we're continuing to build on. So I think to your question, starting with the first on mouse data and ICV delivery, that's pretty standard for mice. But obviously, we have a long history of looking at CNS translation from IVB data in mice to  nonhuman primates and ultimately into patient. I think what was impressive to us is, it doses better our own par, if not, more effective potentially than others have shown. And most importantly, I think relative to what we've seen with others, it's durable. We know that's an important function even when we think about ICV â\u0080\u0093 sorry, IC injection is that the durability effect is critical because, obviously, it means reduce dosing administration frequency. So we're encouraged by again the initial data, exciting to continue to see more work and it's obviously something that weâ\u0080\u0099ve has interest in from a number of parties. Additionally, to that, you asked a question about chemistry and I think that was the piece that was, I think, unique to what we've been developing all along around PN chemistry distribution. So again, utilizing our unique chemistry, that's where we've been able to see that potency durability and distribution with RNAi. And so I think with the ability to have that potency durability, that lets us end distribution, lets us think about differentiation in the target space within CNS and have an alternative approach to be able to look at both conjugated with GalNAc in the liver and beyond to think about the expanded target universe. It's one of the pieces, as we said, again, in addition to our focus that we've been building in AIMers for RNA editing of really unlocking the power of potential genetic target validation. So again, early days were last year showing that PN chemistry and our unique chemistry would be applicable to RNAi with the extension of that this year to see it have the opportunity to open up more broadly and to be able to think about this as a powerful tool to use for silencing. Your line is now open. So, yes, as you know, the first in human study we announced this year will begin with that translation to the clinic. There's a research period where as we said we announced the deal, we could be working on more, what are called, target validation, more programs than they have the ability to select and nominate. And so, I think what's exciting for us is, we are working together, we are initiating some of these programs to begin to start working together to understand the target. Both on the targets that GSK is working on, although we may not be able to disclose the targets per se, but at least the momentum on that side of the collaboration. But importantly, on the other side of the collaboration where our access to unique genetic insights enable Wave distillate programs. And obviously, all of that gets driven on the productive translation of the first potential clinical program,  excited about our progress. So I think that's something that we and importantly GSKs are interested in exploring, obviously, off of the biomarker. Again, it's an important factor of how we think about -- thinking about programs that we select as we're developing our programs within our pipeline, which is, if you have a clinically validated biomarker and that biomarker is actually the treatment for disease on the case of Alpha-1 antitrypsin deficiency, it's the deficiency of Alpha-1 antitrypsin deficiency protein. So I think both we and GSK are interested in utilizing that biomarker as a potential strategy, but thinking then more broadly about how to continue to build that to optimize the commercial. Our next question comes from Joon Lee with Truist. Your line is now open. Regarding the sRNA program, angiotensolivos can just about do many of the same things that sRNA's can do. I think to your first question, I think what this technology capability inside Wave does by having what we believe through the best in class RNAi approach, is really do what we set up from the beginning to do, which is not to be restricted by a particular modality. I think this establishes for silencing the ability for us to think creatively really about what is the best opportunity for different indications and separate tissues, not because that's the technology we have, but we have the optionality of thinking about qualitative. Where we're unrestricted on RNA medicines and can really think about the flexibility of again, right target right indication. Again, a great example is, we could have used RNAi to silence AATD as others are doing. We thought for the biology, the best approach was to correct it, fix it and restore the protein function, not just by giving it like protein ingredient, but actually fixing it and generating more of it and that comes through RNA editing. And so, I think having these tools on our hand, to really say best approach to deal with really important meaningful diseases, I think does set us up for future success. As we said, I think we're going to give a broader update, historically, as you know, we have done R&D days with big updates both on platform. And then importantly, programs as we shared earlier, when we typically share updates on programs, it's not just a list of target that usually is substantiated by data."
}