{
    "symbol": "WVE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 14:52:07",
    "content": " We observed robust target engagement as shown on the figure on the right of slide 12, which prompted us to adapt the FOCUS-C9 study, specifically single low 10 and 30 milligram doses of 004 significantly reduced CSF poly(GP) versus placebo at several time points. And I think in this field, we're so used to looking at loading doses and other features at high doses in order to achieve target engagement that we've really reframed hence, why we established the adaptive design principles here that low single doses are engaging. And so, one of the things, as Mike alluded to, is looking at repeat dose at 10 moving them to other repeat doses and the single doses at intermediate levels, to the earlier question, are all going to give us the data that we need to determine what that next study looks like in terms of dose design. When we thing about C9orf, you pointed out that your -- the competitor program, for which we don't have full data, but we do have a little bit of understanding of their dosing schedule and discontinuation, they dosed aggressively, including a loading dose approach and yet did not see a compelling profile, but you think that your single dose less aggressive approach will show success. So, I think what we're seeing is -- what we designed is a potent molecule, therefore, achieving greater knockdown at lower doses, which is advantageous in, we think, treating CNS diseases as you've kind of followed the history of what's been done in the therapeutic area. I think, it frames a different way, because that we -- when we evaluated preclinical data, if we go back to SNP1 and 2 and the CNS, we didn't have predictive models to assess that starting dose and where we were. So, we'll be able to do that same assessment as part of the study to really answer the question fundamentally as N531 different than , is preclinical -- the previous question is preclinical data translating and we'll also obviously be looking CNS as well."
}