{
    "symbol": "KAMN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 21:26:05",
    "content": " Both the quarter and the full year results benefited from strength in our Engineered Products segment that grew organically at 12% year-over-year, and contributions from Aircraft Wheel & Brake acquisition, offset by the planned reduction in volume on our JPF program. Our 2023 outlook, which sets forth our expectations for the year is based on the following assumptions: number one, it includes only the small amount of firm JPF orders we have on hand; number two, no contribution from K-MAX aircraft sales; and number three, no margin contribution from our structures business. In our Precision Products segment, sales declined 17.7% and 27.8% for the fourth quarter and full year, respectively, as we transition these businesses to new growth products and markets. These savings are comprised of the following: $12 million to $15 million associated with the closure of the Orlando facility, we will begin to see savings between $3 million to $4 million immediately as we reduce operating activity with full savings achieved by the end of 2024; at least $7 million related to corporate restructuring, primarily focused on the rightsizing of our corporate structure to current sales levels and the elimination of redundant functions between business units. Full year adjusted EBITDA is expected to be in the range of $95 million to $105 million, and operating cash flow for 2023 of $60 million to $70 million, leading to free cash flow expectations in the range of $35 million to $45 million. When combined with the lower JPF volume, these factors together account for $1.60 per share of degradation year-over-year, which was partially offset by the anticipated organic growth and the contribution of Aircraft Wheel & Brake. Hey, good morning, Steve. Hey, good morning, Steve. We do expect gross margin to be higher than what we anticipated last year, probably somewhere in the range of maybe 200 to 300 basis points higher overall as we look to 2023, just given the incremental addition of Aircraft Wheel & Brake into the portfolio and the absence of the K-MAX sales. So where the growth is coming in, absent Aircraft Wheel & Brake, absent JPF, absent K-MAX, is really coming from Engineered Products, a significant portion of organic growth there, as we talked about, probably low to mid-teens rate of growth there, structures on year-over-year is expected to grow."
}