{
    "symbol": "NTES",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 12:10:24",
    "content": " A general discussion of the risk factors that could affect NetEase's business and the financial results is included in certain filings of the company with the Securities and Exchange Commission, including its annual report on Form 20-F and the announcement of the filings on the website of the Hong Kong Stock Exchange. During today's call, management will also discuss certain non-GAAP financial measures for comparison purposes only. For a definition of non-GAAP financial measures and a reconciliation of GAAP to non-GAAP financial results, please see the 2022 third quarter earnings news release issued earlier today. Joining us today on the call from NetEase senior management team is Mr. William Ding, Chief Executive Officer; and Mr. Charles Yang, Chief Financial Officer. Our total net revenues for the period were RMB24.4 billion, an increase of over 10% year-over-year despite a high base effect in the third quarter of last year. Our online games continues to be our primary growth driver with net revenues from our games and related value-added services coming in at RMB18.7 billion for the third quarter, up 9% year-over-year. In the third quarter, with new expansion packs launched for the summer holidays, our legacy PC side , including Fantasy Westward Journey Online and New Westward Journey Online 2 continues to attract players. Even with 2 decades of operations, we are constantly exploring, creating and introducing innovative new elements to our games, keeping our content fresh, boost engagement levels and naturally spirits players continuous willingness to spend. This further proves our long-term operational know-how on franchise titles, a unique strength of NetEase games that we are hoping to replicate to our other self-developed proprietary titles. For our new titles, Diablo Immortal was launched in China in July, topping China's iOS download chart shortly after its release. As with all of our other games, our team works very hard to regularly and rapidly introduce exciting new game content to invigorate our players and ensure the longevity of our games. In September, we issued our first major update Forgotten Nightmares after Diablo Immortal's official launch, introducing a new Dungen , an exploration system and battle pass and players love it. Naraka: Bladepoint maintained strong popularity in the third quarter, amassing a community of fans that are extremely passionate about this title. With the game's 1-year anniversary in August, we released our February 1 major new map, Holo Rock with a wealth of new features such as weather systems, interactive objects and new areas to explore, bringing in both new and returning players in a large scale. To keep this game fresh and engaging, we will follow a continuous rollout schedule, adding new content updates such as more heroes, weapons and new game play to this exciting game. Naraka: Bladepoint introduces a unique mild combat-style gameplay, easy to learn but hard to master to bring more players into the mix we have been introducing more beginner-friendly mechanisms such as a new bigness guide and shortcut keys for combat by helping new players quickly learn the skills to fully enjoy the fund of combat. On the console side, we released Naraka: Bladepoint on Xbox Series X|S and joined Xbox Game Pass in June. We are very pleased to have smoothly transitioned Naraka: Bladepoint into the console arena, bringing our users a satisfying game experience. In addition to Naraka: Bladepoint mobile game, we have a number of other exciting upcoming games in our pipeline. We conducted the first round of testing in October for Justice mobile game and saw very encouraging results with over 10 million players pre-registered, with lots of exciting new technological innovations and the state-of-the-art game design. Since its launch last September, we are putting great efforts into the global version, leveraging all the lessons we have learned along the way from game development to a year-long operation, we are working intensely to optimize the game's mechanics. Simultaneously, we are preparing expansion packs ahead of the launch to enable timely, frequent new content updates after the game . In the third quarter, we continued to make great progress with our global operations. Since our initial investment in the studio 3 years ago, we have been working very closely together and we just realized how like-minded and complementary we are to each other. Also during the quarter, we are very pleased to have announced that Jonathan Morin came on board as a new Creative Director in Montreal. With more than 24 years of experience making AAA games, Jonathan played a key role in shaping the critically acclaimed Watch Dogs franchise at Ubisoft and was one of the main contributors to the Far Cry Series and many other  brands. After years of strategic planning, our self-owned overseas studios now stand in multiple regions: Japan, North America, Europe and more to come. Through investments and partnerships, we've welcomed in a great number of best-in-class game developers worldwide who will be pivotal to attracting more talent in their local developers and gamers community. Total net revenues of Youdao continues to improve in the third quarter and reached a record high of RMB1.4 billion, led by increased sales of new services and smart devices. Net revenues of Youdao smart devices reached RMB356 million in the third quarter, up 40% year-over-year, with robust contribution from its flagship products, Youdao Dictionary Pen and Youdao Listening Pod. Meanwhile, we continue to expand Youdao's portfolio with more AI-empowered educational tools in August, we launched the Youdao Dictionary Pen X5, featuring a self-developed operating system that accommodates a variety of external applications such as NetEase Cloud Music and Ximalaya FM, to further enhance our user experience on these products. In addition, Youdao Smart Learning Pad X10 which is released in October also showcases several user-oriented and customized AI functions to better serve the learning needs of different age groups and we expect more growth opportunities for this product. In addition to further content upgrade to Youdao gold courses, we have also coordinated with local board game associations to hold open tournaments for students which have been advocated by the General Administration of Sport of China for their positive contribution in expanding the popularity of broad game amongst students. Looking ahead, we will continue to serve more learning needs of our users by leveraging our leading technological capabilities while diversifying our content and product offerings. During the quarter, we further improved our music-oriented community and content ecosystem as well as continued to advance our monetization efforts and gain meaningful operating leverage. Amid a challenging macro environment, total revenues of Cloud Music grew by 22% year-over-year as we continued to expand our paying user base and optimize our pricing strategy. We also witnessed the gradual recovery of our advertising business, aided by rapid performance-based ad growth, along with solid momentum in social entertainment services. Our strong top line growth and better operational efficiency drove solid margin gains with gross margin expanding from the fourth quarter in a row, reaching 14.2% in the third quarter. Additionally, Cloud Music's net loss further narrowed in the third quarter, both year-over-year and quarter-over-quarter. Since the regulator's antitrust ruling last July, NetEase Cloud Music has been actively in discussion with label companies to secure best content for our music lovers. Our in-house music production capabilities are showcased by another hip song,  which recorded over 200 million streams within a weak and topped multiple music charts, enhancing our music-inspired ecosystem and user connections with our innovative new product continues to attract users to our community. In the third quarter, we further boosted our community atmosphere through innovative offerings, including Star-rated Comment Section to display high-quality user comments and Fans Space to strengthen bonding between artists and their fans, while encouraging user interaction. We also added new offerings such as style recommendation that brings users more personalized options in the daily recommendation function to better reflect their taste as well as a Dolby Atmos feature, allowing users more authentic and immersive ways to listen to music. The portfolio we have curated of diverse and long-lasting games in China provide a steady base for us to build further upon coupled with our globalization strategy, our prospects are exciting and we believe we are well positioned for continued growth. As we advance each of our businesses with innovative products and services, we will continue to use our strong cash position to buy back shares and pay dividends that directly reward our shareholders. Net revenue totalled for RMB24.4 billion in the third quarter or US$3.4 billion, representing a 10% increase year-over-year. Total net revenues from our games and related VAS services were RMB18.7 billion, up 9% year-over-year. The growth was primarily due to increased revenue contribution from both mobile and PC games, including our existing games such as Fantasy Westward Journey Online series and , as well as newly launched Diablo Immortal. Youdao's net revenues were RMB1.4 billion, a moderate increase from last year. Net revenues of Cloud Music were RMB2.4 billion, up nearly 22% year-over-year. Net revenues for innovative businesses and others were nearly RMB2 billion, up 14% year-over-year, mainly due to increased contribution from Yanxuan in the third quarter. GP margin for Cloud Music continues to improve in the third quarter, climbing to 14.2% versus 2.2% 1 year ago. For our innovative businesses and others, GP margin was 25.5% compared with 27.2% last year. If we look at our cost composition, our selling and marketing expenses as a percentage of total net revenues was 15.4% compared with 14.1% for the same period last year. Additionally, the exchange rate of the U.S. dollar against RMB fluctuating over the last couple of periods also contributed to the accounting gain in other income line. Our non-GAAP net income from continuing operations attributable to shareholders for the third quarter totalled RMB7.5 billion, or US$1.1 billion. As of the quarter end, our net cash position was about RMB95 billion compared with RMB86 billion as of the year-end of last year. Lastly, we continued to buy back shares during the volatile period under our current share repurchase program for up to US$3 billion which expires in March of next year. And today, our Board announced the approval of a new share repurchase program of additionally up to US$5.0 billion of the company's ADS and ordinary shares in open market transactions for a period not to exceed 36 months. In addition, NetEase purchased 0.7 million ordinary shares of NetEase Cloud Music for a total cost of about US$6.9 million during the third quarter. On today's announcement about not renewing certain license related in China, that is still to expire next year. In the third quarter, Infinity obtained approval of multi-devices version, we also know that a car also post multiterminal. NetEase has created some overseas IP games such as Harry Potter, Lord of the Rings and -- so what's the progress of -- approval for the domestic version, except Harry Potter local IPs such as . At the same time, we noticed that in certain regions, many of our users actually own PC and mobile and console all at the same time and they play games on all 3 platforms. But for these players, they would also -- they would like to be able to switch seamlessly between these platforms which is why we are also looking into developing games -- developing cross-platform games. For us, there's no real technical barrier for developing an operating cross-platform games. Therefore, we take into consideration of users' needs, product features, market feedback and other factors before deciding whether we should do a multi-platform version for each of our games. So for these following IPs and our self-developed IP, the ultimate difference is that in a virtual world, we can -- the virtual world we can bring to gamers are different. In the past, we sold a lot of games based on our rental culture, such as FWJ, WJ, Justice and Naraka. But by introducing IPs like Harry Potter, Lord of the Rings, , we can actually diversify and enrich the different world that we can create for our users, allowing them to experience different things. So therefore, the reason for having all those IPs is to further enrich our game pipeline and create different gaming experience for our gamers. So we can find that NetEase has been investing in the overseas markets since the beginning of the year, especially including investing or acquiring a studios. So in the past few years, you've actually seen a number of very successful titles from -- that we've self-developed in innovative regions, such as Identity 5, Knives Out in Japan. And also, we've seen some very successful PC titles in the global market as well, like Naraka: Bladepoint that we launched last year. So over the long term, we would hope to work very closely together with its global studies to create global blockbusters for our worldwide game players. So whether in particular time whether the market is driving, it depends on whether the -- it depends on the game quality themselves. In a certain time, we will have a number of high-quality games available for games to play that will be the market driving. At the same time, if the gaming content available, it's not interesting, is mediocre, is a duplication of previous games then the market is slow. So in our view, is right now, we not about mortgage situation but rather that's been black high-quality games. In the last 1 to 2 years, we have launched many new games overseas. And secondly, about the developments, we're developing more cash flow genres to fit the ties of overseas games about our cost structure. Since we launched Naraka last year and to Xbox in June this year, we've been very closely monitoring the reactions and feedback from the game of community. So from what we've seen, we think the players overall is very satisfied with this -- with our game with this -- itâ\u0080\u0099s very unique mainly combat user experience. So every day, we are having discussions on how to make our users happier within the game. And Alex, for your second question about the overall trend of head count and operating expenses over the last 5, 6 quarters, our overall total head count stays relatively steady at above 30,000 overall head count. More specifically in the last quarter, by the quarter end, we have north of 31,000  overall head count, representing quarter-over-quarter about incremental 1,000 head count which is consistent with our summer recruiting season of campus recruiting. Oftentimes, when you see an increase in R&D, in selling and marketing, that is actually an indication that we are developing a strong pipeline or we are about to launch an exciting new games -- and if we are patient enough, you will see the huge reward that we are planting the seeds today. And currently, we will for -- we actually have a pretty -- plentiful of games to be launched over this market. We have our 3 games in Japan market that include  like PCG, racing and  And we have a cool games in Europe and North American market, in PPS, PCG and combat -- competitive games. I noticed that the Chinese users, a lot of them are people in their 30s or 40s, it's mostly  and tier cities. Going forward, we're going to explore -- discover more game users and promote game to a greater range of audience."
}