{
    "symbol": "CWK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 22:28:13",
    "content": " In the fourth quarter of 2022, our PM and FM businesses grew strongly up 8% versus prior year with solid growth across all segments of that business. Turning to our segment results for the quarter, Americas fee revenue declined 18% year-over-year with strong 6% growth in PM/FM, more than offset by a 9% decline in Leasing and a 54% decline in Capital Markets. In Asia Pacific, fee revenue growth of 2% was driven by the performance of our PM/FM service line, which grew 19% for the quarter, partially offsetting this growth were declines in Leasing and Capital Markets, which declined 16% and 38% versus prior year, respectively. So therefore, I guide, you think about that business more of a over a period of two to three years driving that type of average growth as opposed to say last year being a blowout year followed by a more muted one, that's not how we see that business because contracts come on, they get integrated and then we go through the sales cycle again. It was just before the Millennium 2000, financial services, particularly investment banking was driving very large proportion of high quality office uptake globally, professional services through and just after the GFC became the big driving engine of office growth and then we've seen technology, of course, over the last 10 years being that driver. And our strong fast growth markets, if you can take our revenues from life sciences this year with a 60% increase in revenue year-over-year, you get an idea of the rate of growth in these markets and they're going to be taking the place as the engine of growth of same technology. So the fundamental of the global capital markets remaining a very large opportunity for us remains extremely strong, it's really doesn't matter of when, which point whether that is the back half of this year, potentially later -- even later depending on the outcomes that Kevin mentioned."
}