{
    "symbol": "NXGN",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-28 22:51:09",
    "content": " Hosting the call today from NextGen is David Sides, President and Chief Executive Officer, Jamie Arnold, Executive Vice President and Chief Financial Officer and Matt Scalo, Vice President of Investor Relations. And before we start, I’d like to remind everybody that comments made on this call may include statements that are forward-looking within the meaning of the federal securities laws, including and without limitations, statements related to anticipated industry trends, the company’s plans, future performance, products, perspectives and strategies. Risks and uncertainties exist that may cause results to differ materially from those expressed in forward-looking statements, including, among others, those risks set forth in the company’s public filings with the U.S. Securities and Exchange Commission, including the discussion under the heading Risk Factors in the company’s most recent annual report on the Form 10-K and any other subsequent quarterly report on Form 10-Q. Our remarks on today’s call include both our earnings results and guidance, which contain certain non-GAAP financial measures. For our earnings results, the GAAP financial measures most directly comparable to each non-GAAP financial measure used or discussed and a reconciliation of the differences between each non-GAAP financial measure and the comparable GAAP financial measure can be found within our latest quarterly earnings release that was filed with the SEC and is posted to the Investor Relations section of our website. At this time, I would like to turn the call over to our new President and CEO, David Sides. In the month or so since I joined NextGen, I've spoken with many of you. But for those who I haven't already talked with, I want to share how excited I am to join a company with great products, low customers and a team focused on client success. I've watched NextGen's progress with interest from a distance and I've found the company's rapid rise in product quality and reputation has reflected in improving class research scores was quite impressive, as it is difficult to turn around customer perception. Once I engaged in the CEO Search Process, I learned that this rapid turnaround was proven largely by insightful long-term investments made by the current leadership team. And finally, with a constant focus on enabling and improving the interaction between the healthcare provider and consumers, the company has a solid foundation to support accelerating growth. I've met with every member of the board and the leadership team, as well as many of our team members at all levels of the organization. First, the NextGen team from the board to the front line is first class. I'm encouraged by the depth of the experience and capabilities of the executive leadership team as well, as their attitude and focus on doing what is best for our clients, employees and shareholders. We have a great culture throughout the organization, and I look forward to promoting the same high level of dedication and focus in everything we do. Second, our clients are unique in so many ways, whether in terms of size, specialty or mission, but what they have in common is that they're putting their trust in NextGen. For my ongoing client discussions I can't emphasize how strongly these providers want NextGen Healthcare to succeed, which includes winning in the market. And in the quarter just ended, we continued to win business against all competitors, big and small. And our clients share their insights into where this industry is headed, which in turn helps shape our long-term strategy and future offerings. At our recent Annual Shareholder Meeting, investors sent a vote of confidence in the board, this leadership team and our growth strategy. Shareholders approved the plan to reincorporate NextGen Healthcare in Delaware, an important step for the company's future particularly considering how much the company has paid out in litigation costs in fiscal second quarter alone. On corporate governance and aligning pay for performance, the board is taking action to eliminate certain roles like the chairman emeritus board seat and the associated fees, as well as eliminating meeting fees. As for fiscal year 2022 executive equity grant, the comp committee approved performance shares with vesting tied solely to increase shareholder value. We want to do so in a tax-efficient way, so the board approved the share repurchase program. And with the goal of applying shareholder value and appreciating shareholder value in mind, I'm already applying my experience in a fresh set of eyes to the entire company. As I review the company's product offerings and pipeline, I see considerable assets that with focus investment and execution can unlock the full potential of NextGen Healthcare. I also see potential opportunities to further unlock value by more effectively pointing certain of our assets toward attractive high-growth markets, which potentially offer significant return on investment. While it's a bit too early to provide details today, the gross potential is exciting. Before I turn the call over to Jamie, I want to provide an update on Spring '21. At the Investor Day in March, the company spent considerable time reviewing the benefits of the enterprise Spring '21 upgrade. Plus NextGen is approaching this program in a new way, adding significant resources and working closer with our clients than ever before. We've established an upgrade Center of Excellence, which provides our clients with both resources and best practices in order to accelerate the upgrade process and ensure an excellent experience for Spring '21 and all future upgrades. As you may recall, PXP will help the client simplify and streamline the process of adding incremental surround products as needed. Spring '21 is a multi-year program and we plan to provide future progress updates, but at a less regular cadence in quarterly. Instead, I would point our investors to our quarterly revenue lines such as the positive trends in our high margin, recurring revenue and subscription revenue growth. Bookings came in at $39.1 million in the quarter, up 25% on a year-over-year basis and 14% quarter-over-quarter. Additionally, I'm pleased to report we closed a handful of seven-figure deals in the quarter spanning both existing and new clients. One example is a California-based multi-specialty group with over one 1,200 providers serving over a 120,000 patients across many centers. Now, on to the fiscal second quarter financial results, starting with total revenue. The company generated $149.3 million, an increase of 7% year-over-year. Of this total, recurring revenue accounted for $135.6 million or 91% of the total and was driven by strong performances across all lines. Software subscription services at $41.1 million in the fiscal second quarter is now clearly our largest revenue category delivering growth at 12% year-over-year. EDI and data generated $26 million in revenue this fiscal second quarter, up 6% over the year ago period as transaction volumes continue to improve. Software maintenance and support revenue of $39 million was slightly up over the year -- prior year period, due largely to a one-time benefit recognized in the quarter. An non-recurring revenue of $13.7 million decreased 4%t over the same quarter last year with software revenue coming in strong based on a couple of large transactions offset by slight decline in services. On a non-GAAP basis, fully diluted earnings per share for the fiscal second quarter of 2022 was $0.29 compared to $0.30 in the year ago quarter. Free cash flow this quarter was $13.3 million, impressive considering that we paid $11.4 million associated with the Hussein Lawsuit. In addition to this afternoon's earnings release, we also announced board approval to purchase up to $60 million of our stock. This new program represents a strategic use of the company's cash, while retaining sufficient flexibility to fund ongoing and future investments in the business. As noted in the press release, we are raising our fiscal 2022 revenue guidance to a range of $584 million and $590 million. However, as we discussed last quarter there are approximately five fewer business days in the back half of the fiscal year compared to the front half. And patient visit volumes are historically lower in the fiscal fourth quarter due to deductibles resets, which will have an impact on our managed services and EDI. And those of you that have followed the story for some time know that the potential timing of a few large software transactions can impact any single quarters performance, but over the time the trend typically smooths out. In closing, I am pleased with the overall momentum and diversified growth we generated in the quarter. And again, an excellent performance this quarter driven by the entire organization. With a focus on commercial execution, NextGen will drive accelerating and profitable revenue growth. The right strategy that has the company addressing attractive market opportunities, a reinvigorated and growing commercial team, differentiated solutions that add real value to our clients and we've made investments that position the company to win. Congrats on the quarter and congrats on your first call here as CEO, David. Thanks for taking the question. So for Spring '21, I think the 40% that are signed up is to our expectation, we're ramping up. And so now we're scaling up and we're playing a more active role than we have in the past where we're really instead of saying, here's a some new software upgrade when you want. We're helping really guide our clients through the upgrade process and make it very repeatable kind of standardized so that we and they benefit when we have all of our clients on a single platform, so that for our engineering and our product organization you can assume a more homogeneous environment. I think kind of tracking where we are in that progress will give updates, but not something we need to do necessarily quarterly. Your line is open. So when you think about the new clients, 25% of the bookings. So, I think that we focused somewhat on which specialties do we really have deep content, really good outcomes where we can drive for those specialties outsized result compared to our competitors. So think of any of our competitors no matter how big or small, we're winning market share in the market. And I think it's because our product is really good, really strong. Let me add on to that is that as you've heard us discuss previously, a couple of years ago we established or we separated our sales organization between sales that focus outside the base versus the sales organization that works with existing clients. And then on the share repurchase, I think it's a great way to deploy capital, but at the same time what do you think those sources of the funds are to use that to affect that share repurchase. Let me just -- I wanted to further even though Steve didn't ask the question directly is that, as we were considering or discussing with the board the share buyback, we did discuss how to balance the share buyback with our growth. And that was something I suspect, Steve, it is embedded in your question that you were asking me, which is we feel like that we can handle the share buyback and continue our investment in growth. Your line is open. Thanks for taking the question. Obviously in R&D, research and development new solutions, bringing new products to market to capture additional market share. We also have opportunities to invest in services, whether it's services to speed the rollout of Spring '21 or traditional services like our revenue cycle management services, our managed cloud services. And as Jamie mentioned, we're generating free cash flows, so we can be thoughtful on how we use that cash to further those investments. So we'll -- all three of those will think about build by a partner, what's the best way to market and what's the best return as we think about those investments. Ann, it's a good question and I think it ties into your first question, because the investments that David was talking about really are continuation of some of what we have -- we did in Q2. So you should expect to see the cost continuing to increase, the operating cost in Q3 and Q4, as well as there will be a small increment up in our cost of sales, because we've added services people to help with the upgrade to Spring '21. Your line is open. But I did want to dig in a little bit more on your decision to move to NextGen, just because there's been enormous amount of health tech CEO seat availability not just in EHR, but really across the board. And it mainly if you think about the moves out of the hospital to ambulatory surgery centers, if you think about a consumer's health journey, they're almost always working with their own physician, they're spending very little time on the inpatient side. And as you think about the ways we can empower our doctors, the clients we serve to do telehealth, to do remote patient monitoring, so that you can get these services from the doctor with which you already have a relationship. I think that is a trend that continues going forward and accelerate as a way to both improve access to care and reduce health and equity and drive down the cost of care, because we can enable those doctors kind of operate as doctors and think about ways to improve their clinical outcomes, financial outcomes and operational outcomes. It's such a great software system that there's so much we can do with that to help with interoperability, join up records so that people have a complete health record and then think through how do you do some level of maybe even care coordination across that platform so that we defragment healthcare. Digging in one level deeper just talking about improving outcomes, improving cost and the read proofs in the broader market. Your line is open. So those got caught up in the quarter, but it did skew the number up for the quarter and it was by several hundred thousand dollars, enough to change the trend that we've been seeing and that's why I highlighted it."
}