{
    "symbol": "CRWD",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-02 20:16:03",
    "content": "  Thank you for standing by, and welcome to the CrowdStrike Fiscal First Quarter 2023 Results Conference Call. After the speakers’ presentation, there will be a question-and-answer session. As a reminder, today’s call is being recorded. Please go ahead, ma’am. Before we get started, I would like to note that certain statements made during this conference call that are not historical facts, including those regarding our future plans, objectives, growth and expected performance, including our outlook for the second quarter and fiscal year 2023, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. While we believe any forward-looking statements we make are reasonable, actual results could differ materially because the statements are based on current expectations and are subject to risks and uncertainties. We do not undertake and expressly disclaim any obligation to update or alter our forward-looking statements, whether as a result of new information, future events or otherwise. Further information on these and other factors that could affect the Company’s financial results is included in the filings we make with the SEC from time to time, including the section titled Risk Factors in the Company’s quarterly and annual reports. A discussion of why we use non-GAAP financial measures and a reconciliation schedule showing GAAP versus non-GAAP results is currently available in our press release, which may be found on our Investor Relations website at ir.crowdstrike.com or on our Form 8-K filed with the SEC today. We believe our Q1 results exemplify that we have a winning formula that includes scale, growth, profitability and free cash flow. Second, we saw strength across the platform, including a record quarter for modules deployed in the public cloud and over 100% year-over-year ending ARR growth for our emerging product group, which includes our Discover, Spotlight, Identity Protection and Log Management modules. And third, we are seeing more and more customers standardize on the Falcon platform. The number of customers adopting 6 or more and 7 or more modules, both grew more than 100% year-over-year. We believe this underscores our wide competitive moat and our opportunity to drive long-term sustainable growth in both, our core and expansion markets. Now, let’s discuss our results in more detail. Building on our historic Q4, this quarter, we delivered net new ARR of $190 million, topping our expectations. We delivered ending ARR growth of 61% year-over-year to exceed $1.9 billion, record non-GAAP operating profit of $83 million and free cash flow margin of 32%. In 8 out of the last 10 quarters, we have delivered 30% or greater free cash flow margin. Our powerful combination of growth, profitability and cash flow is reflected in our continued performance well in excess of the SaaS industry’s Rule of 40 benchmark. In Q1, we achieved a Rule of 78 on a non-GAAP operating income basis and when calculated on a free cash flow basis, a Rule of 93. Given our market opportunity, platform, subscription business model and high unit economics, we believe we have the ability to continue to grow at scale, generate cash and invest in initiatives that will further widen the gap between CrowdStrike and the competition, especially at a time when companies are forced to reduce their spending and hiring plans. I’d like to thank those of you who joined our investor briefing in April, where we showcased the simplicity and the power of the Falcon platform. We believe this is unique to CrowdStrike and translates to increased module adoption, deal sizes, ARR growth and sales efficiency. In Q1, we executed well across all market segments with over 1,600 subscription customers of all sizes choosing CrowdStrike for the fourth consecutive quarter. This brings the total number of customers that rely on Falcon to protect their business to 17,945, a 57% increase year-over-year. Late in Q4, we significantly expanded our trial program, increasing the number of modules available for trial to 12, up from just 4 modules in the prior quarter. The expanded trial program provides an even larger foundation to drive velocity through our e-commerce engine and makes it even easier for companies to trial and purchase more modules on the Falcon platform, and we are very pleased with the record performance in Q1. Our ability to rapidly innovate on the Falcon platform and solve a growing number of security imperatives for our customers with a single-agent platform provides CrowdStrike strong differentiation, wide competitive moat and multiple growth engines in both our core and expansion markets. Our frictionless adoption motion drives larger deal sizes among both, large and small customers over time and has translated to increasing module adoption metrics quarter-after-quarter. In Q1, subscription customers with 4 or more, 5 or more and 6 or more modules increased to 71%, 59% and 35%, respectively. Given subscription customers with 4 or more modules surpassed the 70% milestone and is now commonplace, we are retiring this disclosure and raising the bar by introducing a new metric, customers with 7 or more modules, which reached 19% at the end of Q1. We are pleased with our strong module performance across the Falcon platform in both, our core and expansion markets. First is Falcon Complete, our industry-leading full turnkey managed detection and response offering that uniquely blends technology and services to stop breaches for customers of all sizes. By leveraging the advanced automation in the platform, Falcon Complete offers customers and partners a way to quickly and cost effectively scale, fortify their cyber defenses with gold standard expertise and technology. As one of our largest customers recently posted on LinkedIn, “CrowdStrike’s Complete team allows our team to focus on the bigger picture without sacrificing the quality and detail of Tier 1 response.” Our growing leadership in the MDR market is also recognized by market research firms. In Gartner’s recent Market Share Managed Security Services worldwide 2021 report, CrowdStrike was ranked number one by market share. As we have added modules to the Falcon platform, we have introduced new complete offerings that extend beyond core endpoint, including Complete for Cloud Workload Protection and Complete for Identity Protection. Building on top of a strong Q4, the first quarter was a record quarter with ending ARR growth for public cloud deployments accelerating quarter-over-quarter. In this cloud win, CrowdStrike was chosen over the competition given Falcon’s unified interface across public, hybrid and multi-cloud assets, ease-of-use, superior performance and speed of detection. In the quarter, we introduced new Cloud Native Application Protection Platform or CNAPP capabilities to accelerate threat hunting for cloud environments and workloads and reduce the meantime to respond. The new capabilities we announced provide the visibility, automation and cloud hygiene necessary to defend against today’s adversaries. This was demonstrated in the recent MITRE prevention evaluation in which Falcon achieved 100% prevention and our identity protection module stopped the would-be attacker before it could even gain access to the target environment, redefining what it means to stop the breach. In terms of opportunity, we see many similarities between this, new emerging market and the EDR market at its inception, with customers not knowing how much they need it until they saw it in action. To demonstrate this point, I’d like to share feedback I personally received via text from a long-standing Falcon customer. Thanks to you and the team for building these amazing tools for us.” And on the Humio front, we are seeing increasing momentum in the log management space with customers. With the recent sales enablement and quota assignment for the global CrowdStrike sales team, our pipeline of log management opportunity rapidly growing. Specifically in Q1, we secured wins with new and existing CrowdStrike customers, including a Fortune 100 industrial company, a Fortune 500 materials manufacturer and a large health services provider. These tailwinds include a rapidly expanding attack surface and digital supply chains as organizations embrace digital transformation and move more workloads to the cloud, the cybersecurity skills gap in a heightened threat environment. Over the past few months, I spent significant time traveling to meet with customers, prospects, partners and fellow CrowdStrikers. First, cybersecurity is an essential technology that underpins modern business, and we see this growing as regulators sharpen their lens on cybersecurity requirements. As a result, cybersecurity is a growing priority, words of directors and initiatives to fortify an organization security posture and reduce enterprise risk are being discussed, evaluated and funded at the highest levels. Even though this new customer is a Microsoft-first shop, we were told that the buying decision, which the Board of Directors was actively involved in, ultimately came down to who they trusted to protect them from their worst day. Before I hand it over to Burt, I will share one more recent new subscription customer win where the incumbent vendor fell short of expectations. During the remediation process, this customer was able to experience firsthand the value of trusted expertise and the ease and speed of deploying Falcon across their environment. Falcon Complete is highly differentiated in the market as competing offerings only notify the customer of a problem, whereas Falcon Complete with Fusion no-code security automation will proactively remediate any issues. In closing, I would like to thank each and every CrowdStriker for your passionate focus on making CrowdStrike the trusted cybersecurity company. We delivered another outstanding quarter with strength in multiple areas of the business and superb execution by the CrowdStrike team, translating to rapid growth at an increased scale, record non-GAAP profitability and record cash generation. In the first quarter, we continued to maintain very high unit economics, drive leverage and remain very capital efficient, even as we aggressively invest in the business, innovate on the Falcon platform, expand into new markets and grow the CrowdStrike team. These included continued strong customer adoption of our core products, growing success with our emerging product category and cloud modules, strong retention and expansion within our customer base and continued rapid new customer acquisition. Our exceptional Q1 net new ARR performance was ahead of our expectations and follows our unprecedented Q4, highlighting our continued strong momentum in the market. Additionally, the composition of net new ARR in Q1 was very well balanced across deal size with no outsized contribution from any one deal. Our consistently high gross retention rate reflects our strong commitment to stopping the breach, delivering value to customers and restoring trust to the security posture of companies worldwide. As George mentioned, we are also seeing more customers standardizing on the Falcon platform and adopting more modules. Professional services revenue was $28.0 million, setting a new record for the seventh consecutive quarter and representing 30% year-over-year growth. In terms of our geographic performance in Q1, we continue to see strong growth in the U.S. at 57%, and international revenue growth accelerated to 71% year-over-year. First quarter total and subscription non-GAAP gross margins remained relatively consistent at 77% and 79%, respectively. As we continue to invest for growing demand, we are pleased with our strong subscription gross margin performance, which remains within our target model range. As planned, we invested aggressively in our business during the quarter, including increasing investments in new technologies, international geographies and marketing programs. Given our strong top line, disciplined approach to investing and efficient sales motion, we were able to make these investments  also driving increased leverage and profit. In Q1, our magic number increased to 1.4, reflecting the efficiency of our go-to-market engine and our ability to rapidly onboard and support customers of all sizes. We have put as much thought into our go-to-market as we have into our technology, creating a new paradigm for enterprise cybersecurity sales. And on top of that, we built an e-commerce engine that would not have been possible to achieve without the architectural choices made in CrowdStrike’s early days. First quarter non-GAAP operating income more than doubled, growing 179% year-over-year to reach a record $83.0 million, and operating margin improved by over 7 percentage points year-over-year to reach 17%. Non-GAAP net income attributable to CrowdStrike in Q1 also more than tripled, growing to a record $74.8 million or $0.31 on a diluted per share basis. Free cash flow grew 34% year-over-year to a new record of $157.5 million or 32% of revenue and reflects our planned increased capital investments, which more than doubled year-over-year. Given the current geopolitical environment and growing regulatory requirements, such as GDPR, CISA reporting mandates and the forthcoming SEC cybersecurity disclosure requirements, we believe the essential nature of our offerings is increasing. This, along with our corporate customer base, our efficient sales motion, our high gross retention rates, and our SaaS model that includes subscription contracts and multiyear customer relationships will provide consistent cash flow performance. While we do not specifically guide to net new ARR, we would like to provide a framework for how we view recent and seasonality trends. Similar to last year, we delivered an exceptional Q1 with significantly muted Q4 to Q1 net new ARR seasonality when normalizing for the two accounts that contributed approximately 8 figures each to our unprecedented Q4 results. As a result, looking to Q2, we expect to see seasonality off of Q1 to be similar to last fiscal year. Given our strong Q1 performance and as reflected in our increased guidance, which reflects 56% to 62% year-over-year growth in operating income, we expect to see the year-over-year operating margin leverage for the year materialize in the first half of fiscal 2023. This is primarily driven by our commitment to continue investing aggressively in our massive opportunity and leverage our unique leadership position in the market, current demand  and increased unit economics. As a reminder, given the timing of expenses, seasonality of new hires and the midyear ESPP purchase, the second quarter is generally our lowest cash flow generation quarter of the year. We continue to remain optimistic about the demand for our offerings, record pipeline and our ability to execute on the powerful secular trends fueling our markets, and as a result, we are raising our guidance for fiscal 2023. For the second quarter of FY23, we expect total revenue to be in the range of $512.7 million to $516.8 million, reflecting a year-over-year growth rate of 52% to 53% with subscription revenue being the dominant driver of growth. We expect non-GAAP income from operations to be in the range of $70.4 million to $73.3 million, and non-GAAP net income attributable to CrowdStrike to be in the range of $64.9 million to $67.9 million. We expect diluted non-GAAP net income per share attributable to CrowdStrike to be in the range of $0.27 to $0.28, utilizing a weighted average share count of 240 million shares on a diluted basis. For the full fiscal year 2023, we currently expect total revenue to be in the range of $2,190.5 million to $2,205.8 million, reflecting a growth rate of 51% to 52% over the prior fiscal year. Utilizing 241 million weighted average shares on a diluted basis, we expect non-GAAP net income per share attributable to CrowdStrike to be in the range of $1.18 to $1.22. George, maybe I’ll direct this one to you. Hey Saket, it’s a great question. When we talk to customers, particularly legacy SIEM customers, there’s absolutely an appetite to explore something that’s different, modern, more scalable and more cost effective. And again, we’ve been big fans of Humio. So, it’s still in the early days, but we’re excited about the customer interest, what they want, the expansions that we’ve done in the quarter, the ability to actually consume, not only security data but observability data. And so, we’re excited about those. Hey Brian, it’s George. When we look at our capabilities outside North America, again, we spend a lot of time building out the sales channels, building out the partner network. So, when you look at where we’d like to be in terms of increasing that revenue and the split between North America and rest of world, it was a great quarter for us. So I think Burt will probably add some other comments to it, but I think it’s reflective of the fact that we’ve got a great offering and the strong demand in all geographies. It’s a great question, and we’re continually focused on investing in territories outside of the U.S. We also think about, ultimately, we’d love to see 50-50 in terms of the split at some point. And so, when you can keep pace with America, you’re doing really well. So, we’re excited about where we’re headed. George and/or Burt, you had a great new subscription customer growth this quarter. So, our bigger customers, those over $1 million, as we talked about on the webinar in April, each of those customers has about 7 on average, just over 7 modules. In terms of landing new, we talked about in FY22, it’s 4.7. A key part of our strategy is because there’s many agencies that can procure the product through the CISA contract, if you will. And like any category, you want to have your reference accounts, and that’s what we’ve been focused on. So, it’s tremendous interest. We think it’s going to be a long runway in federal, and not only federal, but state, local, and then you have federal type organizations that are around the world. So, we think we’re in a great spot there. I was wondering if you could address some of the competitive dynamics around cloud and when it represents a tip of the spear versus selling into the installed base, if we were looking at that net new ARR that cloud touches. So, when you think about our cloud offerings, a couple of points that I highlighted in the call is that we have both, agent and agentless. And that is the ability to actually gather cloud information at scale without an agent, understand the posture of what’s happening, understand misconfigurations and go beyond what our competitors do is we actually look for active attacks with our Indicator of Attack technology applied to it. And as we pointed out in the April investor call, we’ve had many lands in just cloud organizations, particularly in big financial services companies, land in the cloud and then actually be able to cross-sell it into the internal network. So overall, we continue to iterate very rapidly, got great capabilities there, and it’s been really well received by our customers. And I think, again, when you look at the shared donor that Symantec has imparted on us, we were happy to see Carbon Black and VMware to be acquired. And after the acquisition, we certainly had a lot of customer interest in what that means for Carbon Black customers, in particular, how CrowdStrike can help them in a long-term relationship. So, we’ll see how it all plays out. But given what we’ve seen in the past with Symantec, we’re pretty positive. Just on e-commerce, you noted a record e-commerce quarter as you added a bunch of new triable solutions. So, as we’ve talked about in the April update to investors, we spent many, many years working on our e-commerce platform, and we’re starting to really see the fruits of our labor there with a magic number of 1.4 with the increase in the number of trials that we can actually run through the e-commerce platform. It’s incredibly efficient, not only to gain new customers, but also to continue to cross-sell into the customer base. And with 22 modules, it’s important to be able to prioritize what customers are looking for, for our channel partners as well as our sales team. No, it’s definitely part of the equation when we think about our long-term operating margin target model. I think, we spend as much time on go-to-market execution and flighting how that is all going to work just as much as we do on the tech. And for us, that’s a bet that I think where we think is very, very derisked. And I think that we’ve got lots of examples where we’ve seen success of companies that are able to fight it well, not in security. And so, we believe that we’ve got a great opportunity. Typically, this has been a segment where customers have really gone with the good-enough approach in the past. So customers leveraging our trial, converting them into our e-commerce platform, upselling our modules, even upselling them into Falcon Complete customers, we can take a few thousand dollar deal and turn it into a $50,000 deal, leveraging the full suite of e-commerce technology as well as our inside sales team. Yes, I’ll try the first part. No, we haven’t seen any slowdown in terms of the willingness to buy security. It’s -- in the hierarchy of corporate needs, it’s probably shelter. And to add, I really don’t see any additional discounting coming my way. And when there is an opportunity on the table and there is discounting involved that is -- at a high level, it comes to me, and I really haven’t seen any change from the past. I know you don’t provide, like, the actual numbers. It’s a question I often get and I love, because at this point, we’re still seeing net new ARR coming from both, new logo and cross-sell and upsell. We’ve had just number -- we have just under 18,000. You look at one of our competitors like Symantec that had over 300,000 at one point, and we’ve got a long way to go. So, we’re getting it from both sides. If you have advanced endpoint protection using AI, if you add EDR and now you add identity, that’s a winning formula. So, we see a great opportunity to continue to sell into the installed base identity, and we talked about 30% quarter-over-quarter increase in identity. And so, I’m curious if you can share some data points or anecdotes to help assuage some of the concerns around that front with respect to corporate endpoint volumes sort of moderating from here. And I think on the back side, two years plus in the pandemic and coming out of it, I think if you look across the growth quarter-over-quarter, again, it’s reflective in a strong demand environment and not related to anything that’s pandemic. And after pretty much the first quarter or so of the pandemic, there’s not much to talk about in terms of corporate endpoints. I think from an M&A perspective, we are always looking at companies, and we will buy good companies with good people irrespective of the current environment. Obviously, as we think about what’s coming up, multiples compressing in various areas, including the private markets, we certainly will be disciplined as we look at those. And then, when we think about headcount, we are in a great position to be getting talent as some of these organizations are just forced to cut good people. But, when we think about where we are today and the success we’ve had, I think it’s one of the areas where security is not going to go away. The threats are going to continue to get worse, and we’re going to continue to invest. And that means getting the people that we need, that means looking at module expansion, and that means looking at other opportunities, as we just talked about in the last question, potential M&A opportunities. So, for us, it’s really about continuing to hit the gas, and we’ve been successful. We’ve seen a lot of our competitors fall by the wayside over the years by being diligent by being innovative and continuing to invest and getting stronger and stronger, irrespective of the current climate. And certainly, if it gets worse, we think we’re in a great position, enterprise software, SaaS, security, long-term contracts, great cash flow. So it goes back to -- I think it starts with security right now is, let’s call it, recession-resilient. It means to enhance and gain in market share, in 2019, we had a market share of around 6.3% in endpoint. And today, we’re in that 12.6% range from -- this is all IDC. We think by investing in the channel, in people, in go-to-market, we think we have an advantage over everybody else because we’re such a well-run company and we’ve got a lot of opportunity to invest. Again, what customers are looking for are solutions that solve problems, stopping breaches, deals with some of the headcount problems that they have. They just can’t find enough good people, and ultimately saves them a lot of time and money by harmonizing their security stack in one platform, which is CrowdStrike. So, it’s still a big market. We’re looking to aggressively grow that, and there’s opportunities for others out there. Well, I’d like to thank everyone for their time today."
}