{
    "symbol": "CRWD",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-07 20:57:05",
    "content": " We believe this is best showcased by the fourth quarterâ\u0080\u0099s record net new ARR of $222 million, record net new customers of 1,873, strong retention rates, record operating income, record free cash flow of $209 million and a rule of 81 on a free cash flow basis. This included a standout year for our Identity Protection modules, which contributed over $100 million in ending ARR and over 1,000 net new identity customers. And we added a record 6,694 net new customers for the fiscal year to bring us to 23,019 subscription customers, a 41% increase. We delivered an exceptional fourth quarter and a strong finish to the year with $221.7 million in net new ARR, bringing ending ARR to $2.56 billion, up 48% over last year. Professional services revenue was $39.1 million, setting a new record for the 10th consecutive quarter and representing 53% year-over-year growth. Fourth quarter non-GAAP operating income grew 19% year-over-year to reach a record $95.6 million, and we reported operating margin of 15%. Looking at fiscal year 2023, non-GAAP operating income growth outpaced revenue growth, increasing 81% year-over-year to reach $355.6 million and 16% of revenue, picking up 235 basis points of operating margin for the year. However, given continued increased budget scrutiny and elongated sales cycles, we believe it is prudent to maintain the FY24 ARR assumptions we discussed on our last earnings call that normalized the first half of the year for the current macro environment with a full year net new ARR assumption of roughly flat to very modestly up year-over-year, albeit on a higher base than expected three months ago. For the first quarter of FY24, we expect total revenue to be in the range of $674.9 million to $678.2 million, reflecting a year-over-year growth rate of 38% to 39% and with subscription revenue being the dominant driver of growth. For the full fiscal year 2024, we currently expect total revenue to be in the range of $2,955.1 million to $3,014.8 million, reflecting a growth rate of 32% to 35% over the prior fiscal year."
}