{
    "symbol": "RCM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 12:37:02",
    "content": " In the first quarter, in addition to our normal physician flow business, we signed $750 million in end-to-end operating partner NPR, across three large independent physician groups: Keplr Vision, Sansum Clinic and Emergency Physicians Professional Association. With over $2.7 billion in operating partner NPR already signed in Q1 and $500 million in the contracting stage, in addition to the expected $10 billion NPR contract, we are reevaluating our investment and deployment capacity which I'll discuss later. Providers are increasingly recognizing the strength of our value proposition and this has resulted in a doubling of our end-to-end pipeline over the past two years, even after converting more than $13 billion of NPR across LifePoint Scion, Penn State, Rush Pediatrics, Quorum and American Physician Partners. We're pleased to report solid first quarter results, with revenue up 12.6% year-over-year to $385.7 million and adjusted EBITDA up 11.1% to $89.3 million. Net operating fees of $322.8 million grew $36.7 million year-over-year, primarily driven by the onboarding of new end-to-end customers such as LifePoint and Pediatrics signed over the past 12 months, as well as improved patient volumes across our customer base. On a quarterly sequential basis, adjusted EBITDA declined by $5.8 million, primarily due to contracting costs associated with the $10 billion pending contract. As Joe mentioned, we continue to expect Cloudmed to generate at least $191 million in adjusted EBITDA for the full year and we currently expect approximately a prorated contribution depending on the timing of the close, net of the start-up cost synergies and expected investments to harmonize our compliance and cybersecurity infrastructure. Your line is open. Your line is open. When we look at the year right now, with the $2.7 billion contracted another $500 million in contracting and what we would expect is $5 billion of deployment starts in the year, associated with the large contract that puts us somewhere in the $7 billion to $8 billion range of new contracts that we're starting. Your line is open. Your line is open. Your line is open. Your line is open. And so just to sort of follow on this the incremental capacity that you're contemplating on within this year is you say equally related to the new deal pipeline you've had this year plus the rolling of the large contract into next year as well as say conversations you've had with -- or let's say, a dive into the client portfolio at Cloudmed into basically thinking okay there's more potential revenue synergies here so let's staff up to go get it. Your line is open. If you look at 2023, I would still say that $10 billion mark on 2023, because you've still got $5 billion of starts from these new contracts that we expect to be consuming capacity in 2023 that the overarching $10 billion nominally in 2023, is primarily related to us. But when we look to 2024, where you've got a clean $10 billion and you've got a little bit of filling in that large contract that's already been deployed or substantively deployed, that's where we would expect to see meaningful contribution from Cloudmed joint commercial activities in their installed base et cetera."
}