{
    "symbol": "AVAV",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-06 22:12:10",
    "content": " First, third quarter results were in line with or slightly ahead of our expectations as we continue to successfully execute against our plan with solid enduring demand across our portfolio, as evidenced by our record funded backlog at the end of Q3 of more than $400 million. We delivered third quarter revenue of $134.4 million compared to $90.1 million in fiscal year 2022, representing an increase of nearly 50% year-over-year. Gross margin for the quarter was $45.5 million more than double last year's $21.4 million, and our gross margin percentage rose to 34% from 24% last year. We ended the third quarter with a record backlog of $414 million and 83% increase year-over-year, reflecting the increasing robust demand for our solutions. Total TMS revenue is up roughly 30% year-over-year, which reflects the continued orders of our Switchblade 300 and 600 systems to support Ukraine, including the latest $2 billion security assistance package announced on February 24th, and Backwell  depleted U.S. DoD stockpiles. Our latest -- our largest segment during the quarter was our small UAS business, which finished a quarter with $69.4 million of revenue up from last year's $24.4 million. Even with the accelerated depreciation of medium UAS COCO assets in the last two quarters and in the fourth quarter, our overall adjusted gross margins for the year will be in line with our FY 2022 overall adjusted gross margins as the favorable product mixes offset the negative impact from the accelerated depreciation. Adjusted product gross margins for the quarter were 41% versus 38% in the third quarter of -- versus 38% in the third quarter of last fiscal year, primarily due to the higher SUAS product mix. In the third quarter of fiscal 2023, adjusted EBITDA was $23 million, representing a significant increase of $17 million from last year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}