{
    "symbol": "AVAV",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-07 19:24:02",
    "content": " And third, AeroVironment continues to successfully manage through ongoing supply chain challenges and is very well positioned for continued value creation even beyond this fiscal year, primarily due to strong demand across nearly all our product lines. We delivered first quarter revenue of $108.5 million compared to $101 million in fiscal year 2022, an organic increase of 7% year-over-year. We reported a non-GAAP adjusted net loss of $2.5 million or $0.10 per diluted share as compared to a loss of $4.2 million, or $0.17 per diluted share, for the first quarter of fiscal year 2022. In the near-term, the U.S. Army's proposed funding for FTUAS is approximately $100 million for government fiscal year 2023. Our largest segment during the quarter was Small UAS with $43.3 million of revenue, up from last yearâ\u0080\u0099s $40 million, approximately 70% of Small UAS revenue in the quarter was from international customers and we expect this trend to continue throughout the year. Our Medium UAS segment finished the quarter with revenue of $19.3 million, a $3.1 million decrease compared to the first quarter of fiscal 2022 of $22.4 million. Revenue from the other segment, which includes our Telerob and MacCready Works businesses increased year-over-year to $12.8 million versus $9.2 million in the fiscal 2022 first quarter. The adjusted EBITDA for the first quarter of fiscal 2023 was $13.1 million, an increase of over 90% over the prior year. We anticipate revenue of between $490 million and $520 million for fiscal year 2023, representing double-digit organic growth and net income of $11 million to $18 million or $0.42 to $0.72 per diluted share. And third, AeroVironment continues to successfully manage through ongoing supply chain challenges and is very well positioned for continued value creation even beyond this fiscal year, primarily due to strong demand across nearly all our product lines."
}