{
    "symbol": "AVAV",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-06 21:42:06",
    "content": " We delivered second quarter revenue of $111.6 million compared to $122.0 million last year, a decline of approximately 9% year-over-year. Revenue for the second quarter of fiscal 2023 was $111.6 million, a decrease of 9% compared to the second quarter of fiscal 2022 revenue of $122 million. Adjusted product gross margin for the quarter were 38% versus 48% in the second quarter of last fiscal year, primarily due to lower SUAS product mix. In terms of adjusted service gross margins, the second quarter was at 12% versus 27% during the same quarter last year, primarily as a result of lower MUAS margins following the accelerated depreciation charges of $4.5 million due to the anticipated site reductions mentioned earlier. I want to reiterate, we expect annual gross margins to be in line with FY '22 and additional depreciation expense will be more than offset by higher product sales as a percentage of total revenue in the second half of the year, driven by higher small UAS product sales. The $9.2 million year-over-year decrease in net income was due to $16.6 million in lower gross margin due to lower sales volume, unfavorable product mix and MUAS accelerated depreciation. In addition, R&D investments increased $2.3 million in the second quarter of fiscal 2023 versus the same period last year. The adjusted EBITDA for the second quarter of fiscal 2023 was $6.8 million, a decrease of $14.1 million, primarily due to the $13.8 million lower adjusted gross margins from decreased revenue and unfavorable product mix. Our new outlook for fiscal year 2023 is shown on Slide number 7 and is as follows: we anticipate revenue of between $505 million and $525 million, which is higher than our prior guidance; net income of $8 million to $17 million, or $0.33 to $0.65 per diluted share; non-GAAP adjusted EBITDA of between $84 million and $92 million; and non-GAAP earnings per diluted share, excluding acquisition-related costs, amortization of intangible assets and other one-time expenses of between $1.26 and $1.58."
}