{
    "symbol": "CNHI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 15:10:21",
    "content": " The third quarter probably won't make any progress with inventories, I don't think but the fourth quarter, I mean, as we continue to make more progress, and we see a little bit of easing in the supply chain, we should be able to start towards the end of the year, improving the dealer stocks a little bit and then we'll see what happens in 2023, but that still remains, getting product availability and even allocation where we are constraining it. That's helpful and maybe just a longer term question, in November you guys are going to have Raven under your belt for about a year I think, just in terms of how you've been integrating that in terms of like, what you're rolling in the new model year kind of product portfolio just curious, you can kind of provide an update around what levels of uptake are around on some of the major technologies. But the Raven, the demand we're seeing for the core Raven product and one of the benefits of the integration is how much we can help them with supply chain to accelerate the output when demand for their core products, but really as we've tried to communicate, it's about getting the tech stack, right and I just can't say enough about how important the Raven team, and their ability to solve great challenges is to us helping us do that as quickly as we possibly can. The acquisition that Titan made of Heartland Ag was a good example of how things are going to be cleaned up, that was a different distributor model than the rest of our network and now I think Titan can make that -- working closely with us, but they can make it -- our sprayer business more consistent for all of our customers and I think that's better for everyone. We still have to manage it but I would say it's not dramatically better, but we're seeing a little bit of improvement and I am not saying it's tipping it's going to revert back to the mean anytime soon, but it's slightly better than it was."
}