{
    "symbol": "FTCI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:56:06",
    "content": " As we shared with you at the time of our Q2 earnings announcement, we believe we are untracked to deliver gross margins between 12% and 18% as revenue gets to the $150 million quarterly revenue run rate that is enabled by one, our design to value initiative, which we had previously discussed with you at length, and has allowed us to take more than 20% of the costs out of our tracker systems, providing a product cost structure to enable double digit gross margins on future projects. We have roughly $165 million of backlog that includes these products, the U.S. thin-film projects, international project, and U.S. projects with crystalline modules that are not expected to be impacted by UFLPA, because theyâ\u0080\u0099re already in hand, which gives us confidence that we have seen the lows. Yes, and I would add to that as well, Phil, that while weâ\u0080\u0099re not, weâ\u0080\u0099re certainly not guiding Q1, Q2, but weâ\u0080\u0099ve really this quarter with the work on 1P and internationally, and then the First Solar solution, weâ\u0080\u0099ve really done a good job to make the company resilient to UFLPA for future business. But what weâ\u0080\u0099re excited about is, weâ\u0080\u0099ve really worked on the system through the DTV initiatives and now can accommodate the six and six plus modules from First Solar and really feel good about the way itâ\u0080\u0099s come together in terms of the still being able to see the advantages of the Voyager system in terms of putting panels onto the system with the lowest amount of man hours. Yes, weâ\u0080\u0099re hopeful that, Jeff, that we will see relief, but weâ\u0080\u0099ve really put our emphasis here on the last quarter on making ourselves much more robust to a lingering UFLPA situation by having the 1P tracker available, which allows us to participate in a much larger swath of the market, and then also the news that we shared yesterday in terms of our First Solar solution. And especially as you roll forward here into the first quarter, given the revolving credit facility here that extends through March 31st, just talk a little bit about the cash gen and then maybe from there, as you think about cash gen, you talk about gross margins getting to this mid-teens range with $150 million run rate."
}