{
    "symbol": "GRWG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 22:43:04",
    "content": " In the second half of the year, we're projecting a decrease of an additional $1 million in quarter sequentially, primarily through store closures and expense control. For the second quarter GrowGeneration generating revenue of $71.1 million versus $125.9 million in the second quarter of 2021, representing a decline of approximately 44%. Our same-store sales for the second quarter 2022 were $44.8 million, compared to prior year sales of $104.1 million, representing a 57% decline against the comparable year ago quarter. Gross profit dollar generation in the second quarter decreased 43% from the prior year, including the impact of additions of acquisitions and new stores in our retail stores, ecommerce and our non-retail segment. Our retail gross margins in the quarter were flat to last year, but aggregate gross margins benefited from the decline in ecommerce volume as a percentage of total sales from 10% revenue to 5% of revenue, as well as an increase in mix of distribution and other segment revenue from 4% of revenue to 17% revenue. Compared to the same period last year, SG&A expenses increased $100,000 in the second quarter 2022 with overall savings offset by the addition of HRG and MMI and the previously mentioned increase in bad debt. Net loss for the second quarter was $136.4 million, or $2.24 per diluted share, compared to net income of $6.7 million or $0.11 per diluted share from the comparable year ago quarter. Adjusted EBITDA which excludes the expenses associated with interest, taxes, depreciation, amortization impairment and share based compensation expense was a loss of $2.9 million for the second quarter of 2022, compared to income of $14.5 million in the second quarter of 2021. We estimate this quarter's adjusted EBITDA loss includes roughly $1.3 million of unusual items that we expect should either become less impactful or will not repeat going forward, including bad debt expense and cost to labor reductions. We expect adjusted EBITDA in the third quarter of 2022 to be a loss in the range of $3 million to $5 million weighed down by elevated gross margin pressures, additional employee separation and store closure costs and other expenses. As far as the specific inventory actions that we've taken and progress we've made on the inventory side, we ended the year with $106 million of inventory, $105.6 million that included the legacy business from 2021 as well as the acquired inventory when we acquired MMI."
}