{
    "symbol": "GRWG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 22:08:04",
    "content": " We are pleased to report that our sales in the third quarter came in ahead of our internal plan at $71 million, bolstered primarily by stronger-than-expected demand within our distribution and private label business unit. As I think it's worth repeating, in the third quarter of 2022, we generated $6 million of cash, ending the quarter with more than $71 million on the balance sheet. We reduced inventory quarter-over-quarter by $10 million compared to the end of the second quarter 2022, which amounts to an aggregate reduction in our retail business of more than $24.1 million in inventory year-to-date since December 31, 2021. Private label accounted for $7.1 million of retail and e-commerce sales in the third quarter, which is around 14% of our overall retail and e-commerce sales growing 8% year-over-year as a percent of sales. For the third quarter, GrowGen generated revenue of $71 million versus $116 million in the third quarter of '21, representing a decline of approximately 38.9%. Our same-store sales for the third quarter 2022 were $39.9 million compared to prior year sales of $95.4 million, representing a 58% decline against the comparable year ago quarter. Adjusted EBITDA, which excludes the expenses associated with interest, taxes, depreciation, amortization and share-based compensation, was a loss of $2.6 million for the third quarter of 2022 compared to income of $10.8 million in the third quarter of 2021. Onetime store closure expenses cost the company approximately $800,000 in the third quarter, which does not include the forward-looking expense savings from discontinued store operating costs, increases to the company's inventory allowances of $720,000 for obsolete  in the quarter, $400,000 in excess supply chain and storage costs for 3PLs. In the third quarter, we observed relative flatness in retail same-store sales on a percentage basis from the second quarter of 2022 and an actualized sales revenue decline of $8 million."
}