{
    "symbol": "GRWG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 20:10:12",
    "content": " Private label accounted for $26 million for retail and e-commerce sales in the full year 2022, which is around 12% of our overall retail and e-commerce sales, growing 6% year-over-year as a percent of sales. We ended the 2022 fiscal year with $72 million of cash and cash equivalents and marketable securities and no debt on our balance sheet, representing a sequential increase of $1 million in our net cash position since the end of the third quarter of 2022. In 2022, we reduced inventory by $28 million compared to the end of 2021, including a sequential $12 million reduction in the fourth quarter from the end of the third quarter. Turning to guidance for full year 2023, we expect net revenue in the range of $250 million to $270 million, translating into adjusted EBITDA in the range of a $4 million loss to a $1 million profit. Starting with our fourth quarter results, GrowGeneration generated revenue of $54.5 million versus $90.6 million in the fourth quarter of 2021, representing a decline of approximately 40%. Our same-store sales for the fourth quarter 2022 were $34.3 million compared to prior year sales of $71.4 million, representing a 51.9% decline against the comparable year-ago quarter. Adjusted EBITDA, which excludes interest, taxes, depreciation, amortization, and share-based compensation was a loss of $10.2 million for the fourth quarter of 2022 compared to a loss of $1.7 million in the fourth quarter of 2021. We estimate this quarterâ\u0080\u0099s adjusted EBITDA loss includes roughly $1 million in expense associated with the closure and consolidation of our Las Vegas, Compton and Cotati locations, and nearly $4 million associated with the inventory clean-up measures taken in the fourth quarter. Gross profit for the full year 2022 decreased by $48 million to $70.2 million, and gross profit margin was 25.3% in 2022 compared to 28% in the full year 2021. And if you look at our forecast for 2023, weâ\u0080\u0099re forecasting increased sales going into the second and third quarter coming off guidance, which youâ\u0080\u0099re seeing at that $55 million to $57 million mark in the first quarter."
}