{
    "symbol": "CVCO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-27 14:49:07",
    "content": " During the call, you’ll be hearing from Bill Boor, President and Chief Executive Officer; Allison Aden, Executive Vice President and Chief Financial Officer; and Paul Bigbee, Chief Accounting Officer. Before we begin, we’d like to remind you that the comments made during this conference call by management may contain forward-looking statements under the provisions of the Private Securities Litigation Reform Act of 1995, including statements of expectations or assumptions about Cavco’s financial and operational performance, revenues, earnings per share, cash flow or use, cost savings, operational efficiencies, current or future volatility in the credit markets or future market conditions. All forward-looking statements involve risks and uncertainties, which could affect Cavco’s actual results and could cause its actual results to differ materially from those expressed in any forward-looking statements made by or on behalf of Cavco. I encourage you to review Cavco’s filings with the Securities and Exchange Commission, including without limitation, the Company’s most recent Forms 10-K and 10-Q, which identify specific factors that may cause actual results or events to differ materially from those described in the forward-looking statements. Each of the last several years as we’ve turned the corner, we’ve been facing a different set of challenges, which makes it particularly gratifying to be able to report record results. The year before last fiscal ‘21, our revenue and earnings gains were both in the 4% to 5% range. The acquisition of Commodore had a significant impact, but even without that edition, we would’ve grown the top line by about 15% and profit by well over a 100%. It’s tempting to attribute these results solely to market forces, given the strong demand and significant price increases, but underpinning our financial performance was an improvement in capacity utilization from approximately 75% in the fourth quarter a year ago to over 80% this past quarter, which is above pre-pandemic levels. Despite continuing labor and supply issues, we’re making about 11% or 1,600 more homes than we were before the pandemic. And the work they’ve been doing to reduce product complexity has been paying off with more homes, which is what our customers have needed the most. On a same plant basis, production was up 14% compared to last year’s fourth quarter. Over the past few years, it was clearly a question of COVID’s impact on economic activity. And stating the obvious, the rate increases we’ve already seen dramatically increase monthly payments, thereby decreasing affordability. We know that over the past couple of years, the price increases have left many hopeful buyers without the ability to own a new home in the near-term. While we aren’t able to specifically quantify it, the movement of buyers from site build into the manufactured housing is real. And of course, we’ll be watching closely. I’m very confident, the increasing role manufactured housing will play in solving the deficit of housing over any strategic planning timeframe. So, we remain optimistic and I have extreme confidence in this organization’s ability to successfully monitor and adjust to any shift in market dynamics as I’ve seen our people do time and again. With that, I’ll turn it over to Allison to discuss the quarterly results in more detail. Net revenue for the period was $505.5 million, up 64.9%, compared to $306.5 million during the prior fiscal year’s fourth quarter. Sequentially, from the third quarter of fiscal 2022, net revenue increased 17.1%, mostly driven by an increase in units shipped, resulting from higher factory utilization. Within the factory built housing market, net revenue increased 69.5% to $488.3 million from $288 million in the prior year quarter. We’re pleased to report that factory utilization exceeded 80% during the quarter, slightly higher than pre-pandemic levels. Financial services segment net revenue decreased 7.2% to $17.2 million from $18.5 million due to lower interest income earned on the acquired consumer loan portfolio, lower unrealized gain on marketable equity securities and lower home loan sales income. Consolidated gross profit in the fourth fiscal quarter as a percentage of net revenue was 25.6%, up from 23.1% in the same period last year. The increase is mainly the results of the factory built housing segment, increasing to 24.5% in Q4 2022 versus 20.6% in Q4 of 2021. Material costs increased from third quarter levels, resulting in a lower gross margin sequentially from 25.2% in Q3 of 2022. During the process of working our way through the price protected backlog, we expect the legacy Commodore gross margins to continue to negatively impact our consolidated margins for the next couple of quarters, but improve after that. Gross margin as a percentage of revenue in financial services decreased to 58.5% in Q4 2022, from 61.9% in Q4 of 2021 from greater weather-related events, and lower realized and unrealized gain on marketable equity securities. Selling, general and administrative expenses in the fourth quarter of fiscal 2022 were $59.7 million, or 11.8% of net revenue, compared to $44 million or 14.3% of net revenue during the same quarter last year. This decrease is primarily driven by unrealized losses on marketable equity securities, partially offset by higher interest income earned on our commercial loan balances, which increased as a result of the Commodore Homes acquisition. The effective interest tax rate was 22.1% for the fourth fiscal quarter, compared to 15.2% in the same period last year. This increased tax rate is due to a lower level of tax benefit from exercise stock options in the current year, compared to the same quarter last year. Now, I’ll turn it over to Paul to discuss the balance sheet. So, I’ll be covering changes in the April 2, 2022 balance sheet compared to the April 3, 2021 amounts. The cash balance was $244.2 million, down 24.2% from $322.3 million a year ago. Uses of cash during the year include the acquisition of Commodore and Craftsman  Homes, repurchases of common stock, higher inventory balances and purchases of property, plant and equipment. The acquisition of Commodore and Craftsman Homes resulted in increases in primarily all assets and liabilities, including accounts receivable, commercial loans receivable, inventories, property, plant and equipment, goodwill and intangibles, accounts payable and accrued expenses. Lastly, stockholders’ equity was approximately $830.5 million as of April 2, 2022, up $146.9 million from $683.6 million as of April 3, 2021. With that, I’ll turn it back to Mark. We don’t have any specific targets, but we’ve got some real momentum with us on productivity. And if you think about it, we’ve had long backlogs. So, even when you decide and you kind of simplify your product mix at a plant, you’ve got to work through a lot of orders that you’re committed to delivering to get to that simpler product mix. So, I really do think there’s upside from there. I don’t have the ability right now to try to quantify it for you there, Dan. But every time a different material becomes a challenge, it’s a new -- it is a new thing to solve. And as I think folks know, I’d say that -- well, generally the supply problem has been very persistent, it’s transitioned to a lot more driven by logistics and trucking more recently. I’ve not talked to anyone that has been able to give me any insight into when it’ll light up, but we’re expecting it to be persistent going forward for a while. But I’ll tell you, to really back up and look at what we’ve been seeing. And again, I hope this isn’t a complex answer. The last several months, we’ve seen pricing, particularly the end of the calendar year, early this year, as much as it was going up before, it almost accelerated. And so, I’ve almost described it as like a swirling or a shifting going on. The dynamic has largely been though that if a deal falls through for a retailer on a retail sold unit, there’s very likely another buyer there that can pick up that unit. So, there’s been a lot of shifting, but it’s not necessarily an indication of underlying demand. Traffic is still high and we’re still getting deposits, seeing in our retail as well as our independence. So, we really haven’t seen a tail off of demand, but we’ve definitely seen a bit more chaos, because of the really rapidly accelerating monthly payments that people are facing. I really don’t think we’ve seen indications of a drop-off at this point, but we’ve seen a lot of disturbance in the market, as I described. So what’s going in our favor is we face, this is the flow down from site build into manufacturing that I alluded to. So, not trying to paint either a rosy or pessimistic picture, but I think we’re looking for indications of demand at a time when really what’s going on is a bit of a reaction to that pricing and interest rate shock. Now, rather than confusing, that’s actually extremely helpful. I’m just curious if you can talk about whether it’s pretty consistent across the board from all channels, i.e. both retail and community, and whether you’re seeing any differences in terms of, pockets of geographies where maybe quarter-to-date demand, whether that’s measured by traffic orders, quotes, whether it’s significantly different across various geographies. And the community, the interest of community operators, particularly the larger REIT type community operators, their growth plans and their demand, they’re still talking to us about can we get as many houses as you can make. And that doesn’t mean -- again, I don’t know that I’m predicting a big retail drop-off. I’m just seeing communities, which some of us will remember several years ago, they were driving the growth of this industry. So, it does feel like that’s a little stronger to me right now. If there is any area that I think we’re queued in a little bit more, it’s probably the southeast. But I wouldn’t describe that in a way that we’re seeing markedly different dynamics, it just seems like there’s a little more of that swirl going on in the southeast, potentially. I mean, we’ve been seeing for quite a while and the product mix, just a little bit of a steady shift toward multi-section. And I think there’s logic behind that and all the dynamics we’ve talked about, because -- and this is a little bit feel, I guess, Greg. So, there’s some logic behind this kind of continual shift toward multi-section. But I don’t think in recent quarters, we’ve really noted any dramatic change, and what’s in the backlog. And as far as options, that’s a little bit of a tough question, too, because our product simplification includes reducing options. So, if we really dissected the backlog, we’d probably be seeing more driven by our offering than by any indication of what people are interested in buying. I’m just trying to get a sense of whether this is a longer term journey that maybe suggests that these production efficiencies, as you talk about, can continue to increase for a while. My comment earlier was that with the backlogs that we have, if you decide today on new offerings, you’re not going to have as many floor plans or as many options, you’re still going to have to make what’s in your backlog for a while. But I think, we’re well into that. But, it’s a major factor and I think our plants have been pretty aggressive about it, but they’ve done it in a way that we believe that working with our dealer customers, for example, we’re still providing products that are really matched to the market. So, I think there’s more to go, as I answered the earlier question. And no, it’s not only us increasing our utilization is not only going to come from simplification, it’s going to come from continuing to get our staffing up and our retention up and building the skills of the team, kind of in the middle of all that. So, I think that’s been a bit of a governor. Last couple of years, it’s been more about inputs. So, I think that’s created a governor, but obviously, we’re adding a couple and I know of others that are adding here and there as well. First part, I don’t think we’ve seen really any pickup in delinquencies, people -- or buyers throughout, while some of them have gotten priced out by the time they get to the time they would have gotten their homes, the people that are qualified for getting those homes. So, I haven’t seen any issue there. We’ve been saying for a while that at the beginning -- I always relate everything to the pandemic, because that’s when seems like everything got a little crazy. But the interesting thing at the beginning that we’ve talked about in the past is that home only rates that were in maybe the 7.5% range actually dropped down to the in some cases below 5%, let’s say, 5% to 5.5% range. And now, they’ve really started to move up. I’d like to turn the call back over to Bill Boor, President and CEO for any closing remarks. Cavco is recognized with our industry association’s Community Impact Award this year, due to the Martinsville plant’s outstanding work on the project. And I bring it up partly because I think they deserve some recognition, but it’s also, everything we’re talking about, about affordability and the impact of pricing and rate shifts. So, it’s important work. I think, the business results have been outstanding, but we’re still really connected to this cause of trying to have an impact, like the Martinsville plant has had recently. Ladies and gentlemen, this conclude today’s presentation."
}