{
    "symbol": "CVCO",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-08 12:15:29",
    "content": " Before we begin, we'd like to remind you that the comments made during this conference call by management may contain forward-looking statements under the provisions of the Private Securities Litigation Reform Act of 1995 including statements of expectations or assumptions about Cavco's financial and operational performance, revenues, earnings per share, cash flow or use, cost savings, operational efficiencies, current or future volatility in the credit markets or future market conditions. Net revenue for the first quarter of 2022 hit another record at $330.4 million, up almost 30% compared to $254.8 million during the prior year's first quarter and up 7.8% over the fourth quarter of 2021, previously the highest quarterly net revenue in the company's history, which included an extra week of production due to the reporting calendar. Within the factory-built housing segment, net revenue increased 31.2% and to $312.3 million from $238.1 million in the prior year quarter. On a sequential basis, if you adjust for the 14-week period in the fourth quarter of fiscal year 2021, factory-built housing net revenue increased 16.8% and homes sold increased 3.9%. Selling, general and administrative expenses in the fiscal 2022 first quarter were $40.8 million or 12.4% of net revenue compared to $35.3 million or 13.9% of net revenue during the same quarter last year. And finally, net income was up 61.7%, $27 million compared to $16.7 million in the same quarter last year, with net income per diluted share coming at $2.92 versus $1.80 in the first quarter of 2021. Well, what we've said is that we expect to close in the fiscal quarter last calendar quarter, and I think that's we're right at this point. No, I'm trying to understand if there's a potential for really abnormally high margins for the next 2 quarters as it relates to the function of the pricing because we're looking at - I was talking out loud at this point. And then as it relates to what's happening in the spot market, if it comes in way lower, it doesn't sound like we're giving that back to the dealer or the customer and this potential - and you just said it, COGS are meaningfully influenced by the price of lumber, and we've had a historic drop in pricing."
}