{
    "symbol": "OLPX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 15:01:04",
    "content": " Our second quarter results were highlighted by robust sales and profit growth that continued to outpace the overall strength of the U.S. prestige hair care category and beauty industry, capping off a strong first half for OLAPLEX. According to the NPD Group retail tracking data, which excludes salon, OLAPLEX's U.S. NPD truck sales were up 54% in Q2 2022 versus Q2 of 2021, as compared to total U.S. prestige hair care category sales up 24% during the same period. Based on our June Ipsos brand health survey of U.S. premium hair care consumers, we found that of those respondents who have purchased OLAPLEX in the last 12 months, 55% anticipate greater spend in premium hair care in the next six months versus the last six months as compared to only 8% who said they would spend less. In Q2 2022, net sales increased 38.6% to $210.9 million, driven once again by broad-based growth across channels, geographies and products. Specialty retail sales increased 68.5% to $64.2 million, aided by incremental distribution since the year ago quarter, particularly in Ulta as well as from Sephora at Kohl's and Sephora Europe. The $7.2 million increase in adjusted SG&A from prior year reflects investments made to support the long-term growth of our business, including a $2.4 million increase in sales and marketing expense, a $2.4 million increase in workforce expansion, a $1.9 million increase in public company costs and a $0.5 million increase in distribution and fulfillment costs related to the increase in product sales volume. So all this just means that we want to continue to be bigger, fewer and better in terms of how we approach our distribution and how we partner up because if you are the number one hair care brand and then move on to the top 5 and 10 beauty brands, we do believe that this will continue to bode well for us in terms of partnership, and we are confident that as we continue to do this we will see material growth to our omnichannel regardless of how the consumers decide to shift or move from one channel to the next."
}