{
    "symbol": "OLPX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:49:14",
    "content": " Net sales were $176.5 million, up 9.2% versus a year ago, and adjusted EBITDA of $102 million, declined 4.5% year-over-year versus up 63% last year, with an adjusted EBITDA margin of 57.8% for the third quarter this year compared to an adjusted EBITDA margin of 66.1% for the third quarter of 2021. In the third quarter of 2022, net sales increased 9.2% to $176.5 million versus $161.6 million last year. Professional channel sales declined 16% to $63 million versus a 58% increase last year, as our U.S. distributor partners reduced purchases to adjust inventory levels given softer demand from stylists, which we believe is partially driven by macroeconomic concerns. And our direct-to-consumer channel sales were down 2.6% to $39.3 million, following an 87% increase last year, due to slower sell-through related to weakening market growth and increased competitive activity, including discounting. Adjusted gross profit margin was 75.1%, declining 480 basis points from 79.9% in Q3 2021, approximately 210 basis points of this contraction reflects deleverage and inflation in our warehousing and distribution costs, 150 basis points from inflation on product costs, 160 basis points of unfavorable mix from the higher sales of holiday kits, with the balance related to unfavorable product and customer mix that is offset by the benefit of the price increase we took from July 1, 2022. The $6.2 million increase in adjusted SG&A from prior year reflects investments made to support the long-term growth of our business, including a $4.3 million increase in sales and marketing expense, a $2.5 million increase in public company costs and other related expenses, a $2.2 million increase in workforce expansion and a $2.1 million increase related to professional fees. As a reminder, our guidance for Q4 also reflects that we will not be able to lap the robust sales lift that we experienced during the fourth quarter holiday period last year when we grew 78%, benefiting from significant replenishment orders across our specialty retail and DTC channels at a time when we believe consumer demand was stronger and some of our competitors struggled with consistent supply. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}