{
    "symbol": "CLSK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-09 20:32:02",
    "content": " At this time, Iâ\u0080\u0099d like to welcome everyone to the CleanSpark Fiscal Year 2022 Q3 Earnings Call. The CleanSpark team spent our third quarter executing on the vision we set out at the beginning of this calendar year, to be a top five Bitcoin miner. I am pleased to report that when compared to all public Bitcoin mining companies that we track, CleanSpark finished the quarter by mining the fourth highest amount of Bitcoin of any public miner in the month of June. In fact, we had our most productive quarter ever in terms of Bitcoin mined, minting 964 Bitcoin, which is a 7% increase over the previous quarter and a 400% increase over the same prior year quarter. In terms of hash rate, we started the quarter with 2.3 exahash, and as of this call, our hash rate is 2.9 exahash, representing a 26% increase in our hash rate. Last year at this time, we were just under 1 exahash. With the significant operational progress we are seeing in our state-of-the-art emerging pool facility in Norcross, Georgia, and the newest site we announced this morning, we expect our growth to continue, and with that growth, the amount of Bitcoin we mine. While we have mined more Bitcoin than ever before, our reported revenues were lower, because the price of Bitcoin was lower. All companies building the new economy faced serious headwinds last quarter, as macro conditions and irresponsible financial decisions of a few bad actors reverberated through our ecosystem. We believe that Bitcoin is extremely undervalued at current prices and we continue to see it as one of the most valuable and sustainable assets in the world, both in terms of its social utility and the economic rewards it promises. Markets rise and fall, but block creation continues like clockwork, releasing into the world every 10 minutes another batch of Bitcoin, themselves the result of hundreds of thousands of miners, securing transactions on the most important network to emerge since the Internetâ\u0080\u0099s first notes came online in the second half of the last century. While this summer, the industry was rocked by headlines of public miners liquidating their Bitcoin holdings, we were able to stay true to our long-held course of selling a portion of our Bitcoin to fund our growth in operations, which we have done since the early days of 2021. We have taken impressive steps to grow in this fair market, both during our third quarter and subsequent to the quarterâ\u0080\u0099s end. We took over an existing contract for 1,800 Antminer S19 XP, the leading edge of digital infrastructure, which will add an additional 252 petahash to our hash rate. We were able to secure the contract at an exceptional price, because of our strategic relationships and the unique circumstances that current market conditions have created. We simultaneously announced in June a new partnership with TMGcore to acquire 257 units of their proprietary immersion cool tanks that are designed to improve the performance of mining machines, while substantially decreasing their failure rates over long-term use. The partnership also provided us with 2 megawatts of colocation capacity at TMGcore state-of-the-art immersion cooled mining facility in Plano, Texas. Then in July, we acquired more machines, an additional 1,061 Whatsminer M30S units that were already mining at Coinmintâ\u0080\u0099s renewable-powered co-location facility. The move continued our tried and true hybrid approach of co-locating our machine, while expanding our own mining facilities, which we believe puts us in an excellent position to sustainably grow our Bitcoin mining capacity and what is shaping up to be an incredible market for builders. Speaking of expanding our mining facilities, I am pleased to reiterate this morningâ\u0080\u0099s bigness that we have entered into an agreement to acquire an existing mining facility in the beautiful city of Washington, Georgia, a small community, about 1.5 hours outside of the Atlanta Metro region. The City Council met last night, unanimously approved in a public meeting, the transfer of the power purchase agreement and this morning before market open. We met with the City of -- City Council, City Manager and other civic leaders last week, and Iâ\u0080\u0099d like to take a moment to thank them for their trust in us, our industry and the future of the new economy. This active mining facility is located on a 27-acre site, with 36 megawatts of low-carbon plug-in ready infrastructure. That 36 megawatts in total will add about 1.1 exahash to our processing power, increasing our overall hash rate to about 4 exahash, further securing our position as a top five publicly traded miner. The total purchase was $25.1 million for land, infrastructure and machines, making this our third wholly-owned facility. As Gary and I have discussed on our previous calls, our capital strategy draws three levers, selling Bitcoin, obtaining debt and deploying equity. The Washington, Georgia site continues our infrastructure first approach to mining where we seek to own and operate the majority of our facility. That 50-megawatt expansion will add an additional 1.55 exahash, providing for a total of 2.65 exahash at the facility once completed. All in, we expect the facility to have a substantial impact on how much Bitcoin we mine. We estimate right now that the initial 36 megawatts will increase our daily production by about 5 Bitcoin points, increasing our overall daily production to about 18 Bitcoin at current difficulty rates. While we are in the initial stage of the planning how to most effectively deploy the additional 50 megawatts of power, we envision adding state-of-the-art infrastructure to continue our operational strategy, focused on efficiency, uptime and execution. We recently traveled to Fort Stockton, Texas to inspect one of their existing facilities, which features a well-run immersion cooled Bitcoin mining operations. Since then, Lancium has alerted us, but they are a little behind schedule on the deployment of the first 50 megawatts we contracted with them. We are not concerned by the delays Lancium is experiencing, because we have had more than enough near-term opportunities to capture additional hash rates. CleanSpark has long been focused on the vision of abundant, clean, affordable energy and mining Bitcoin gets us closer to that vision. You could say that, if we were previously in the micro grid business, we have since transitioned to the macro grid business. And the macro grid business, that is Bitcoin mining, is absolutely the right decision for our shareholders. As we have mentioned before, over 90% of our revenues now come from mining, yet the company was still spending a disproportionate amount of time and working capital focused on a segment that provided 10% of our revenue and resulted in negative cash flows. But before I transition to Gary, Iâ\u0080\u0099d like to take a moment to thank all of the CleanSparkâ\u0080\u0099s employees for the work they have done over the quarter. In all the discussion about hash rate, ASICs, megawatts, efficiency and production, itâ\u0080\u0099s easy to lose sight that the point of Bitcoin is the people behind us and the people that use it. Before I get into the financial results for the third quarter, I want to briefly discuss the companyâ\u0080\u0099s decision to divest its Energy business assets. As you are aware, it is our goal to become and maintain our status, the top five publicly traded Bitcoin miner. While the decision to exit the Energy business was not taken lightly, we are excited to move on to the next chapter in the evolution of CleanSpark and solely focus on the business of Bitcoin mining. With the decision to divest the Energy business, we have reclassified our Energy business assets, liabilities, revenues and expenses as discontinued operations, and in line with accounting guidance ASC 205. As required under the accounting rules, upon reclassification of its assets and liabilities, the company must adjust the reclassified items to fair market value. Actual proceeds from the sale of the assets may vary from this estimate, but we feel the write-down is reasonable given the macro environment and low valuations for similar businesses in the current market conditions. Intangible assets, such as goodwill, have been written down in some cases to zero, primarily because the company has reduced its expenses in the Energy business to only essential items and is not directing further working capital to the Energy business. This write-down is due to the expectation that cash flows from the Energy business are expected to decrease going forward, which does not support the carrying value of their respective intangible assets. I called this out specifically, because the reclassification to discontinued operations has a material impact on our financial statements. That being said, our financial statements and reported metrics are now presented on a continuing operations basis and primarily represents the sole focus of our business Bitcoin mining. As you see on this slide, our revenues have increased 2.5x to almost $31 million from $9 million in the same quarter last year. Looking at the bottom-left corner of this slide, you will note that despite mining more Bitcoin in the third quarter, our revenues decreased 17%. As you are aware, Bitcoin prices have decreased in Q3 and that had a direct effect on our topline. In Q3, our gross profit increased almost three-fold to approximately $21 million compared to the same quarter last year. While we had substantial increases in our gross profits, we did see a decline in our margin percentage by 20 points, directly attributable to the decrease in Bitcoin prices. In the final quadrant of this slide, you can see how the decrease in Bitcoin prices affected our margins and gross profits compared to the immediately preceding quarter. Again, despite mining more Bitcoin, we saw compressed margins by about 10% and approximately $8 million less in gross profit. Since the accounting rules do not allow companies to mark-to-market their Bitcoin, we had to impair our Bitcoin on a first-in, first-out basis, where the price of Bitcoin on any given day is less than the price when we minted it. While we continue to mine Bitcoin profitably, these losses represent the effect of the accounting rules, which, again, is a non-cash impact. When looking at our net loss in Q3 versus last quarter, you will see we were slightly in the red in Q2 and our current quarter noncash adjustments took us to a $29 million loss. On the right side of the slide, you will see our adjusted EBITDA, which is a non-GAAP metric, management uses to assess its cash flow from operations. Our adjusted EBITDA for the third quarter was approximately $15 million, which represents margins on revenue of 49%. With respect to our performance in the third quarter compared to the preceding second quarter, you will note that the lower Bitcoin prices translated to lower adjusted EBITDA amounts and corresponding adjusted EBITDA margin. However, our adjusted EBITDA margins are still very healthy and represent the resiliency of our business model, especially considering we currently have very little debt service requirements. As you have heard me say several times that the recent decrease in Bitcoin prices have led to lower revenues and contracted margins, I want to take some time discussing our operating expenses. Foremost, while we believe Bitcoin is worth significantly greater than todayâ\u0080\u0099s price reflects, we feel very comfortable in our cost structure to survive any bear market or crypto winter. We expect to focus on what we can control in this market and what we can control is our costs, especially our power costs. We control our costs through favorable long-term power purchase agreements and where we are subject to market rates, we optimize our run time. Over the last quarter, we have kept our power costs under $0.04 per kilowatt hour on a blended average basis. While our wholly-owned operations in Norcross are not immune to periods of peak market demand and surges in energy prices, we have not seen the need to curtail our mining activities for more than a few hours in time. We anticipate that we are at a turning point where we have built scale and anticipate increased adjusted EBITDA margins when adding new wholly-owned locations, such as Washington, Georgia. When looking at the balance sheet, our total liquidity at June 30th was over $13 million, comprised of cash and Bitcoin. The third quarter was also when we closed on the Trinity facility and have drawn down $20 million on the $35 million facility to-date, of which we had $18 million of debt outstanding as of June 30th. The transaction announced this morning includes a little over $5 million of debt, part of which is seller based financing and part of which is assumption of a mortgage. With the miners on hand ready for deployment and 5,100 miners expected to be delivered, we will have over 13,000 miners we can put to work in the new Washington location and the expansion in Norcross. The remaining commitments related to miners are very small, less than $2 million in total. I also want to note that the contract for 1,800 XPs signed in June, were not only purchased at a discount, but had price protection, which further decreased the average price per terahash. As was discussed on our previous calls, we made a decision not to tie up capital in long-term miner purchase contracts with the expectation that miner prices would decrease. And with miner prices either hitting the bottom or near the bottom, we anticipate purchasing more miners on the spot market in the near-term. We anticipate remaining Norcross commitments to be around $3 million, putting our current total CapEx commitments to less than $5 million over the next few months. But since the location is relatively turnkey we expect any improvements on the first 36 megawatts to be minimal, primarily to make the location more energy efficient. The acquisition will come with 12 megawatts of miners and we already have miners in hand to fill the remaining 24 megawatts, which means the facility will be at capacity and producing at least five Bitcoin per month based on current difficulty levels. Also, the Washington location has an additional 50 megawatts of capacity that is expected to be available in 2023. It is worth noting that since the substation is adjacent to the property, it is expected that any CapEx deployed for this expansion will be in the form of switchgear, transformers, racks and cooling that will be on-premises and there is virtually no cost to us to have the power delivered to the property. On the topic of capital strategy, I want to provide additional color on the comments Zach made early on the call. Our capital strategy has allowed us to play offense, even in down markets such as now. This strategy remains very much in place and we still consider using all three levers, Bitcoin, debt and equity on a frequent basis. In July, we used our self-filing to raise approximately $25 million, 100% of which will be used for growth capital. In recent months, debt markets have tightened up and lenders are only entering into transactions with quality names like CleanSpark. However, regardless of how active the debt markets are, a debt transaction takes time, time we didnâ\u0080\u0099t have to capture this accretive opportunity. As Bitcoin prices recover, we believe the value of our assets, including the Washington acquisition will also increase in value. Given the fact asset values tend to follow a Bitcoin pricing, we will -- we value being nimble and striking quickly in this market versus acquiring debt at low-to-loan -- at low loan-to-value ratios and running a process which could take weeks or months. I want to stress how important this really is, being nimble in the current market allows us to make acquisitions, which not only immediately contribute to higher hash rate and more Bitcoin mined, but also give us a source of potential refinancing as Bitcoin and asset prices rise. Furthermore, regardless of what number we pull, we expect to minimize the time between the deployment of our capital and when the capital starts producing cash flow. Previously, our guidance was 3.4 exahash by September 30th and four exahash by the end of this calendar year. We feel comfortable saying we will surpass 3.4 exahash earlier than expected, and with the Washington acquisition and the planned expansion at that site and other opportunities in our pipeline, we are increasing our guidance for the calendar year-end to five exahash. Furthermore, we are issuing new guidance for the end of calendar year 2023 of 22.4 exahash. Given our history of strong execution, we feel confident in meeting the guidance of 22.4 exahash, which will help secure our position as one of the top miners in the world. Congratulations on the sale of the legacy business and the acquisition of our third site there in Georgia, very exciting times for you. My next question is on your year-end 2023 hash rate guide, obviously, a big number. So thereâ\u0080\u0099s 300 megawatts worth of capacity that are optionality for us to either do at our own site or through co-location, but we feel extremely confident that we have all the capacity under contract in place to get to that goal by the end of next year. If you could just update us there in terms of whatâ\u0080\u0099s contracted on that side and the potential cadence we could expect to see that come online, at least through the end of this calendar year in 2022. A few reasons that we can point to, obviously, thereâ\u0080\u0099s more machines right now available on the market than ever before. But also with supply chains improving, spot market is even available from the manufacturers currently. But we are also, and again, we have made this a big part of our strategy, we are incredibly focused on the length of time between deploying capital and plugging a machine in. We believe that minimizing that is important for a variety of reasons, but not least of which is from a cost of capital point of view, if we deploy $100 million now for miners that are going to arrive next year, we frankly think that, thatâ\u0080\u0099s a poor use of capital. As opposed to, even if it cost us $105 million to pull that down 60 days out, that limits the length of time between the capital and the machine actually being plugged in. Most of those lead times are currently readily available, because from our side, itâ\u0080\u0099s a MEAG substation thatâ\u0080\u0099s being built. Realizing, as we kind of continue to acquire rigs in the secondhand market, thereâ\u0080\u0099s -- you guys -- we expect you to be busy, and obviously, based on that forward guidance, you are going to be busy. We are not -- are we still rig agnostic, i.e., if we can pick up S19J Pros at, I donâ\u0080\u0099t know, in the $15 per terahash to $20 per terahash range, we are interested in doing that or are we at this point, pivoting more to XPs, I think, you mentioned in June, you bought maybe 1,800 or 1,900 XPs or are we still really just knowing that thereâ\u0080\u0099s a lot out there, any way to think about that? We actually purchased those at $18 a terahash, which is, I think, that we probably nailed the bottom on that one. For comparison, the XPs being delivered from Bitmain pricing, which I will say, our pricing is lower than this, but its $50 a terahash for their August delivery. But realistically, because we do expect, because the XPs are new, thereâ\u0080\u0099s going to continue to be a gap for some period of time, we are going to probably take a blended approach between the S19s and the XPs, and again, this is driven by ROI."
}