{
    "symbol": "PKI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 10:44:06",
    "content": " As it pertains to our third quarter results, I'm pleased to see the company again exceeded our initial expectations by generating 9% pro forma non-COVID organic revenue growth in the quarter, ahead of our 6% to 8% guidance. These pressures were offset by continued strong double-digit non-COVID growth in our Diagnostics business outside of China, immunodiagnostics and continued double-digit organic growth in our DAS segment on a pro forma basis. So far in the fourth quarter we have opportunistically retired an additional $45 million of our $1.3 billion of shorter duration debt, upon complete retirement of the shorter term debt over the next two years, we will have approximately $3.2 billion of debt outstanding at an average fixed interest rate of 2.6% with a seven year average duration. The applied analytical and enterprise services business that we intended to bet grew in the low double-digits, while our remaining Life Science business grew 14% organically overall in the quarter, and is on pace for strong double-digit growth for the full-year. However, on a non-COVID basis, the business was up 5%, which included an approximate 500 basis point headwind impact from the China lockdown pressures that we faced in the quarter, primarily in our immunodiagnostics business. In total, the Life Sciences and Diagnostics business that will become the new company once the divestiture is finalized, grew 8% organically excluding COVID, which also included a 300 basis points headwind from lockdown-related pressures on our immunodiagnostics business in China. We are expecting 8% to 9% non-COVID pro forma organic growth in the fourth quarter, which includes our assumption that we will continue to encounter material year-over-year declines in our immunodiagnostics business in China, due to lockdown-related impacts. For just the Life Sciences and Diagnostics business, which will remain once we complete our planned divestiture, we are expecting approximately 8% non-COVID organic growth in the fourth quarter, which includes an expected 200 basis point headwind from lockdown-related pressures in China. Good morning, again, I think on both of them, as we've talked about the immunodiagnostics business, it is performing well out outside the lockdowns ex-China, but even in China, it is pretty much -- it was in line to the expectations that we had in third quarter as to what it would do. I think overall for 2022 for the base business, our guidance implies 9% organic growth and that is with a 300 basis point headwind from our IDX China business."
}