{
    "symbol": "PKI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 22:07:12",
    "content": " Our performance during the first quarter was a testament to this, as we grew our non-COVID revenues organically by 11% year-over-year and generated $2.41 in adjusted EPS, both of which are solidly ahead of our expectations. 14:36 During the first quarter, adjusted revenue declined 4%, compared to last year to $1.26 billion, which included a 2% headwind from foreign exchange and a 10% contribution from recent acquisitions. Starting with our Discovery & Analytical Solutions segment, which generated $602 million of revenue in the quarter, this was up 33% year-over-year and represented 48% of our total revenue. The segment generated $657 million of revenue in the quarter, which was down 23% year-over-year and represented 52% of our total revenue. 17:40 Our Applied Genomics business, which consists of various instruments, kits and other consumables for NGS sample prep, continues to post excellent performance, growing more than 20% organically year-over-year on a non-COVID basis in the quarter. 20:27 Along with the associated cost of closing the lab and a 1% higher effective tax rate for the year as a result of greater COVID revenue and income, we estimate the net impact to contribute approximately $0.35 of earnings per share in the second quarter, which will be included in our updated revenue and earnings guidance I will share with you shortly. And for the second quarter, we are projecting total revenue to be in the range of $1.20 billion to $1.22 billion, which consists of non-COVID organic growth of 4% to 6%, an M&A contribution of 10%, a 3% headwind from foreign exchange and approximately $210 million of total COVID revenues inclusive of the deferred revenue being fully recognized. There are other costs associated with decommissioning the overall lab and taking out the equipment and that kind of thing, but including the extra COVID revenue that we have that increases our overall tax rate for the year, when you put that all together, that's $0.35 to the second quarter and the overall year. So even though life sciences has always grown very well there for us, and this past quarter it grew over 20%, it's now a much bigger piece of the pie, which I think then changes the trajectory of the growth rate for us in China."
}