{
    "symbol": "CNQ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 14:49:26",
    "content": " Canadian Natural has had a strong execution with its drilling program so far in 2022, resulting in the company drilling 22 net operated wells ahead of forecasts, consisting of 11 net thermal in situ and 11 conventional E&P wells with drilling costs on a per well basis, comparable to budget with improved  mitigating some of the inflationary cost pressures. As a result, the 2022 capital expenditures will be adjusted with the base capital has increased by approximately 5% or $200 million over the original 2022 levels, and will now be targeted for approximately $3.845 billion, primarily due to the forecasted inflationary pressures in all operating areas for items such as steel, manufactured goods, services, and labor. Overall, Q2 2022 natural gas production was 2.1 Bcf which was a record for the company a 5% increase over Q1 2022 with North American operations Q2 natural gas production was 2.05 Bcf versus the 1.99 Bcf in Q1, up primarily a result of the company's strategic decision to invest in our drilling field strategy, adding low cost high value liquid rich natural gas production volumes, as well as opportunistic acquisitions. A couple area highlights are at Townsend six well  production in Q2 2022 with a strong capital efficiency of approximately $4,500 per BUED with July monthly production of approximately 54 million cubic feet per day. At essence, three wells came on late in Q1 of 2022, at about $2,800 per BUED with total July production of approximately 32 million cubic feet per day and 560 barrels a day of liquids. Canadian Natural diversified sales for natural gas realized natural gas pricing of 793 per Mcf in Q2, a 51% increase about Q1 2022 levels and approximately 30% higher than the acre benchmark price in Q2, further improving the economics of our low cost drill to field liquids rich natural gas projects. At Wembley nine liquid rich Montney wells are on production with July production approximately 8.200 barrels a day of liquids and 27 million cubic feet of natural gas exceeding budget and maximizing the existing facility capacity with a capital efficiency of approximately $3,400 per BUED. As part of our original thermal in situ strategic growth plan, released in January, and as a result to efficiencies realized today, we're now targeting an additional 15 net in situ wells originally targeted for 2023, totaling approximately $45 million in capital spent, which includes pipelines and facilities. In the company's oil sense in the company's world class Oil Sands Mining and Upgrading assets, we had Q2 production averaging 356,953 barrels a day of SCO down from Q1 of 2022 levels primarily as a result of the Scotford and horizon plan major turnarounds in the quarter. This includes incremental strategic capital to growth opportunities that provide incremental production, and to increasing returns to shareholders, where the Board of Directors approved a special dividend of $1.50 per share, payable on August 31, 2022 to shareholders of record on August 23, 2022, which is an addition to our regular quarterly dividend."
}