{
    "symbol": "CNQ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 12:54:12",
    "content": " Our focus on cost control, our culture of continuous improvement combined with our disciplined and balanced approach to capital allocation, continues to drive strong operational and financial results as our 2022 capital program remains unchanged at $4.9 billion, excluding acquisitions. In the third quarter, we achieved record total quarterly production of approximately 1.34 million BOEs per day, which included record natural gas production at approximately 2.13 Bcf per day, all of which received strong realized pricing in the quarter, averaging $6.57 per Mcf as a result of our diversified sales strategy. We also had liquids production at approximately 983,700 barrels per day, reflecting strong operational performance across all our assets, including our long-life, zero-decline oil sands mining and upgrading assets, which was 487,553 barrels per day of SCO comprising approximately 50% of the company's total liquid production in the quarter. For North American operations, Q3 2022 natural gas production was approximately 2.12 Bcf versus the 2.09 Bcf for Q2 2022, up primarily as a result of the company's strategic decision to invest in our drill to fill strategy, adding low-cost, high value liquid-rich natural gas production volumes, as well as opportunistic acquisitions. Our Q3 2022 North American natural gas operating cost was $1.13 per Mcf, which was down 2% when compared to Q2 2022 of $15, reflecting good operating performance as our teams continue to focus on operational excellence. October 2022 monthly production from this pad averaged approximately 55 million cubic feet per day of natural gas and 3,200 barrels of liquids, exceeding budgeted rates and maximizing existing facility capacity. Q3 2022 operating costs were $16.68 a barrel, up 10% from Q2 operating costs of $15.19, primarily due to increased power costs in the quarter. At Gold Creek, the two-well pad came on production in September had a strong capital efficiency of approximately $4,300 per BOED with a strong October 2022 monthly average production of approximately 2,100 barrels a day of liquid and 16 million cubic feet of natural gas. Canadian Natural has one of the largest land basis of Clearwater rates at approximately 940,000 net acres, of which the company has drilled 14 net port multilateral Clearwater wells in the Smith area in Q3, bringing the total Clearwater wells drilled and on production year-to-date to 33 net wells and the company's total Clearwater production in September averaged approximately 12,300 barrels a day, an increase of 8,400 barrels a day from the beginning of 2022. The team continues to focus on mitigating cost pressures, and we had good Q3 2022 operating costs of $8.89 per barrel, an increase from our Q2 operating cost of $7.99, primarily due to the higher pilot costs in the quarter. Q3 operating costs were $15.63 per barrel, down compared to Q2 operating costs of $18.93 per barrel, primarily a result of lower natural gas costs, offset by higher power costs in the quarter. The company's world-class oil sands mining and upgrading assets, we had a strong Q3 2022 production, averaging 487,553 barrels of SEO, with Q3 operating costs that were strong at $22.35 a barrel. Subsequent to Q3 2022, the company's oil sands mining and upgrading assets experienced unplanned outages at both Horizon and at the Scotford upgrader in the month of October, resulting in the Q4 targeted production range of 450,000 to 460,000 barrels of SCO. Our third quarter financial results were very strong with effective and efficient operations, driving adjusted funds flow of $5.2 billion and adjusted net earnings from operations of $3.5 billion, while our capital program for 2022 remains on track."
}