{
    "symbol": "VRTS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 12:43:14",
    "content": " We did have a meaningful increase in sales across products and asset classes, positive institutional net flows, a higher average fee rate which has been resilient despite industry trends, continued solid investment performance, and significant balance sheet flexibility and a net cash position at December 31. Total assets under management increased 3% to $149 billion, primarily due to market appreciation partially offset by net outflows. By product, institutional net flows were positive $0.8 billion, reflecting the meaningful increase to a domestic large cap growth equity mandate, and $300 million from the issuance of the CLO. Operating income as adjusted was $56 million, down from $65 million sequentially, and the related margin of 31.8%, declined from 35% due to lower revenues and relatively stable operating expenses. We ended the quarter in net cash position of $77 million and continue to have significant flexibility in managing our capital needs, with total cash on hand at year end of $338 million, a $175 million undrawn revolver, and $128 million in investments, providing ongoing flexibility to invest in the business and continue to return capital to shareholders. Average assets under management in the quarter were $148.6 billion, down 5% due to market performance and net outflows. By product, institutional sales were $3 billion, up from $1.5 billion in the third quarter, due to a significant additional funding into a domestic large cap growth equity mandate, in addition to the $300 million CLO issuance. For open end funds, net outflows were $3.8 million, up from $2.8 billion in the third quarter due to elevated redemptions and consistent with negative retail trends. In retail separate accounts, net outflows of $0.4 billion, compared with $0.2 billion in the third quarter, with investment grade generating positive net flows. Excluding these transaction costs, from the prior period, other operating expenses as adjusted increased by $0.7 million or 2.3%, largely due to higher sales and marketing activity, which continues to normalize as well as efficiency and distribution initiatives. Regarding GAAP results, net income per share of $4.77, increased from $4.25 per share in the third quarter, and included $1.53 benefit from the fair value adjustments to affiliate non-controlling interests and $0.78 of net realized and unrealized gains on investments partially offset by $1.03 of CLO issuance expense, $0.50 of negative fair value adjustments to contingent consideration and $0.41 of discrete tax adjustments."
}