{
    "symbol": "VRTS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 22:54:05",
    "content": " Turning now to a review of the results, total assets under management decreased 7% to $145 billion, primarily due to negative market performance in addition to the net outflows. Sales of $5.7 billion declined from $7.9 billion in the second quarter due primarily to two large institutional client fundings in the prior quarter, as well as a generally unfavorable retail investor sentiment. We ended the quarter in a net cash position of $47 million and continue to have significant flexibility in managing our capital needs, with total cash on hand at September 30 of $309 million, a significant undrawn revolver and $120 million in investments. Average assets under management in the quarter were $157.1 billion, down 8% largely due to market performance. Total sales of $5.7 billion compared with $7.9 billion in the prior quarter, reflecting $1.8 billion from 2 significant institutional mandates in the prior quarter and continued negative investor sentiment. Reviewing by product, for open-end funds, net outflows were $2.8 billion, an improvement from $4.5 billion in the prior quarter, primarily due to lower redemptions across all asset classes. Institutional net outflows of $0.4 billion compared with net inflows last quarter, which included the two large client fundings. Adjusting for the transaction costs as well as the $0.8 million of annual director grants in the prior quarter, other operating expenses as adjusted were essentially flat with the prior period and within the $27 million to $31 million per quarter range we previously provided, which we believe is an appropriate level going forward. Regarding GAAP results, net income per share of $4.25 increased from $2.29 per share in the second quarter and included $1.12 of realized and unrealized losses on investments, primarily consolidated investment products, and $0.54 of restructuring charges related to the consolidation of office space, partially offset by $0.73 of fair value adjustments to affiliate non-controlling interests. The firmâ\u0080\u0099s 5-star $3.5 billion AlphaSimplex Managed Future Strategy Fund is the third largest U.S. fund in this category, has a strong 1-year investment return and positive flows through September 30 and is in the top decile of the peer group for each of the 3, 5 and 10-year periods."
}