{
    "symbol": "SBRA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 17:00:21",
    "content": " And compared to the first quarter of 2022, normalized FFO per share increased $0.01, primarily due to higher NOI from our consolidated senior housing managed portfolio, higher normalized FFO from the Enlivant joint venture, primarily related to $3.4 million of government grant income received during the quarter and a decrease in stock compensation expense as a result of adjusting payout estimates on performance-based awards that were set pre pandemic. As of June 30, 2022, our annualized cash NOI was $450.3 million and our SNF exposure represented 60.7% of our annualized cash NOI, down 100 basis points from the first quarter and down 640 basis points from a year ago. Second, while we can't comment on the specifics of the sales until they close, we feel it is important to point out that through a combination of recently completed investments, like our joint venture with Sienna, which has a 6.5% stabilized yield and future investments in our senior housing managed and behavioral health portfolios, we expect to be able to replace the NOI from these sold assets, while meaningfully increasing the quality of our portfolio and durability of our earnings. Your line is now open. Your line is now open. Your line is now open. And as we've been talking about the last several quarters, even though we've had a pretty steady portfolio there's always a chance that if this thing drags on, people may need some assistance, but we use at assistance as not material to the company overall and shouldn't affect our underwriting. Your line is now open. Your line is now open. Your line is open. Your line is open. Your line is open. Your line is open. I don't have that right in front of me, but I'll reiterate what I answered earlier is once these are transitioned and once we have an operator who can stabilize at those operations, we would expect, I think you should expect as well to see better performance under those assets in the form of NOI that we're recording than they have been producing over the last several quarters. Well, I would say this, with what we closed in the first quarter and second quarter, combined with what we have left to complete in the year, yes, you're going to be somewhere towards the higher end of that $100 million to $300 million range that we gave last quarter. Your line is now open. Your line is now open."
}