{
    "symbol": "SSSS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 21:55:29",
    "content": " At the end of the second quarter, SuRo Capital had a net asset value of approximately $280 million or $9.24 per share, down from $381 million or $12.22 per share at March 31, 2022. Accordingly on August 1, 2022, our Board of Directors authorized a modified Dutch tender offer to purchase up to 2 million shares of our common stock at a price per share between $6 and $7. As of June 30 we have exited 15% of our rent position and we pulled 431,591 common shares of Rover for approximately $2.4 million of net proceeds, resulting in a net realized gain of approximately $1.1 million. July 1st to-date we sold 626,955 common shares for approximately $235,000 of net proceeds, resulting in a net realized loss of approximately $3 million. Under this expanded share repurchase program, during the second quarter we repurchased 855,159 shares of our common stock for approximately $6.9 million. Since the expansion on March 13, we have repurchased a total of 1,008,076 shares of our common stock for approximately $8.3 million. Since the inception of the share repurchase program in August 2017, we have repurchased a total of 5,832,008 shares of our common stock, for a total deployment of approximately $38.6 million of the $55 million authorized by the board. As Mark previewed earlier, on August 1st the company's Board of Directors authorized a modified Dutch Auction Tender Offer to purchase up to 2 million shares of our common stock at a price per share not less than $6 and not greater than $7 in $0.10 increments, using available cash. The decrease in NAVs per share from $12.22 at the end of the first quarter to $9.24 per share as of June 30 was largely driven by a $2.92 per share decrease attributable to unrealized depreciation of our portfolio of investments during the quarter, most notably a result of the broader market decline on both our public positions and those private positions valued with public company multiple. During the quarter ended June 30, 2022 the company repurchased 855,159 shares of SuRo Capital common stock for approximately $6.9 million in cash under its Share Repurchase Program. The approximately $16.5 million of unrestricted public securities held as of quarter end represent our shares in Enjoy Technology, Nextdoor, NewLake Capital Partners, Rent the Runway, Rover Group and Skillsoft, valued at the June 30, 2022 closing prices."
}