{
    "symbol": "APDN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-10 18:58:04",
    "content": "  Operator: Good afternoon, and welcome to Applied DNA Sciences Incorporated First Quarter Fiscal 2022 Financial Results Conference Call. After today’s presentation, there will be an opportunity to ask questions. Good afternoon, everyone, and welcome to Applied DNA’s conference call to discuss our first quarter fiscal year 2022 financial results. Speaking on the call today are Dr. James Hayward, our Chairman, President and CEO; and Beth Jantzen, our CFO; Judy Murrah, our COO; and Clay Shorrock, our Chief Legal Officer and Head of Business Development, will also be available to answer questions on the Q&A portion of the call. Now it’s my pleasure to introduce our first speaker in today’s call, Beth Jantzen. I’ll begin today with a review of our consolidated financial results for the first quarter of fiscal 2022, which ended on December 31, 2021. I will then turn the call over to Dr. James Hayward, our President and CEO, who will summarize our operational performance for the quarter and outline key initiatives for the balance of fiscal 2022. As a reminder, we now present the revenue and the cost of providing testing services performed by our clinical laboratory Applied DNA Clinical Labs or ADCL has separate line items in the statement of operations. Following our record high revenue performance in fiscal 2021, we are pleased to start fiscal 2022 with a record revenue quarter. We are seeing continued momentum in COVID-19 testing, which provides population scale, integrated testing solutions and services to enterprises and institutions, such as the City University of New York school systems or CUNY, and other institutes of higher and lower education as well as commercial businesses. This year-over-year increase in quarterly revenue is primarily attributable to increased clinical laboratory service revenue, comprising testing and related services. To offer context on the strength we are seeing in testing, our record revenue performance was achieved despite schools winter recess during which testing demand soften. Product revenues were $826,000 in Q1 compared to $550,000 in the year ago period. The year-over-year increase of $267,000 was due to increased sales of $308,000 for the final shipment of DNA molecular taggant for a textile application. This increase was offset by a decrease of $52,000 in sales of our Linea 1.0 Assay. Service revenues were $139,000 compared to $290,000 in the year ago period. Clinical laboratory service revenues increased to $3.2 million compared to $773,000 in the year ago period. On a sequential basis, clinical laboratory service revenues almost doubled from $1.6 million in Q4. The increase was driven by higher COVID-19 testing, within which our testing contract with CUNY was the primary contributor. The decline in gross profit percentage resulted from a substantial portion of clinical laboratory service revenues coming from testing contracts, where we also provide the staff and testing centers. These contracts have higher costs associated with them compared with our testing contracts, where we do not staff testing centers. Our sales during the year ago period included a higher volume of sales of our Linea COVID-19 1.0 Assay Kit, which had a higher gross margin. Total operating expenses in Q1 increased 41% or $1.6 million to $5.7 million, compared to $4.1 million in the year ago period. The year-over-year increase is attributable to an increase in stock-based compensation expense of $1.1 million, primarily relating to officer stock option grants that vested immediately, as well as to the annual non-employee Board of Directors grants. To a lesser extent, the increase reflects higher research and development costs associated with outsourced service contracts and increased payroll associated with our ongoing animal vaccines study, a next-generation sequencing project. Excluding non-cash expenses, consolidated adjusted EBITDA was for Q1 was negative $2.7 million compared to negative $2.4 million in the year ago period, and narrowed compared to a negative $3.3 million in Q4. Our accounts receivable balance stood at $3.9 million on December 31 compared to $2.8 million on September 30, and inventories were flat at $1.3 million for both periods. Our ability to continue as a going concern is dependent on our ability to further implement our business plan, raise capital and generate revenues. Our top line performance continues to be driven primarily by our diagnostics business, Applied DNA Clinical Labs or ADCL, which is presently centered on COVID-19 testing. Our Q1 gross margin performance was less impressive, a function of the hype positivity rates fueled by Omicron, and as Beth noted, costs associated with our COVID-19 collection sites. In addition, if sample numbers remain at the higher levels recorded by safeCircle through January 22, we would expect enhanced absorption of fixed costs for the collection centers in New York City. The takeaway is that the pandemic is evolving rapidly, as are our services and testing capability. Now, my remarks this afternoon will initially focus on the business development path forward for COVID-19 testing to continue our revenue momentum. As part of our first quarter results, we announced that we have followed them up with a record testing revenue month, with more than $2 million generated in January. We expect it to begin to temper our use of cash, thereby freeing up resources to advance the development of our biotherapeutic growth vehicle, which is our LinearDNA platform. The second half of my comments will center on the LinearDNA platform, the recent progress made and some compelling market opportunities that are well suited to the platform. Revenue momentum from COVID-19 testing is validating the investments we made to establish a CLEP-CLIA certified clinical lab, a high-volume COVID-19 testing practice and a diagnostics development plan under the FDA’s EUA guidance. The first quarter of this fiscal year benefited from our first full quarter with our largest testing customer, the City University of New York, and the acquisition of new clients seeking to deploy safeCircle in an environment where fully 64% of the population is vaccinated and the federal government is distributing free rapid antigen tests. While antigen-based tests have grown in prevalence, in our opinion, they cannot supplant the gold standard PCR testing, and especially for large-scale population testing. They’re also ill suited for large-scale enterprise population monitoring and management, which requires the rapid and seamless flow of data obtained from automated high throughput testing lines. In addition, by design, antigen tests are best at testing high viral loads, and are not suited for providing early detection for efficient and rapid management of large populations. Thus, while antigen test plays an important role in the continued fight against the pandemic, we believe they cannot replace high throughput PCR testing for large populations. Our safeCircle platform is further and considerably differentiated in the marketplace as an integrated full service offering that combines our testing services with the cleared four platform for data management, access control, and vaccination management. This positions ADCL as a one-stop shop, thereby enhancing our pricing and margins relative to standalone testing services. This integrated approach we feel has significant utility beyond testing and beyond COVID-19, as the pandemic evolves, so does safeCircle. In the first quarter, we requested and secured LDT authorization for our Linea 2 COVID-19 Assay from New York State, meaning that we can continue to serve as all clients in the state, while retaining the favorable economics of our self-manufactured test. This collection kit, once authorized, will provide for the unsupervised collection and direct shipment of COVID-19 samples to our clinical lab. We have several testing customers interested in using our collection kit, and we believe the collection kit may drive increased testing volumes from our customers. In the near-term, CUNY anticipates increased demand for weekly testing and a robust random testing program to ensure a safe start to the spring semester for a larger on-campus population. Concurrently, we are progressing strategies to penetrate more durable market segments, such as skilled nursing facilities, where residents are more susceptible to COVID-19 infection and the detrimental impact of the virus is greater than in the general population. In addition, we have validated a high sensitivity PCR-based assay that simultaneously tests for COVID-19 and flu. Given the similar symptoms of both diseases, we believe the combination of COVID-19 and flu testing will be in demand beyond the immediate pandemic. Now while we believe COVID-19 testing will continue to drive revenue over the near-term, we are preparing for an eventual diminution in COVID-19 testing demand, that is likely when the pandemic shifts to an endemic stage. In the short-term, we plan to validate and bring to market several new molecular and genetic tests over this fiscal year that will supplement our COVID-19 testing. Over the longer-term, we will evolve its diagnostic offerings to parallel the vial therapeutic LinearDNA products we bring to the clinic for our LinearDNA customers in our own pipeline. To ensure that we are targeting tests for which there is strong commercial demand, we are presently engaged with hospital systems and provider networks in the tri state area to capitalize on the unmet testing needs of the local medical community. We also have established key institutional relationships via our COVID-19 testing, which will provide a strong foundation of non-COVID clinical testing grant. In the future, we see ADCL as a profit center for Applied DNA that will help empower the development of our LinearDNA platform. Before I delve into the LinearDNA platform, I’ll offer a short background there to provide context on the market opportunity we seek to penetrate more fully. And you will hear much more about our LinearDNA platform in the coming quarters as we amplify developments and successes to partners, customers and the industry. Like plasmid DNA, LinearDNA is agnostic to any particular nucleic acid therapy, meaning both forms may be used in a wide range of treatments, including messenger RNA vaccines, redirected cells and gene therapy. But unlike LinearDNA, which only contains the desire DNA sequence, plasmid DNA, which is circular and derived from bacteria, is typically comprised of about 50% unwanted DNA in the form of non-therapeutic and sometimes dangerous bacterial DNA sequences. As such, plasmid DNA was the first to market and it is the basis of nearly all nucleic acid-based therapies and vaccines on the market today or in clinical development. Plasmid DNA uses fermentation methods, a process that is inherently complex, slow and expensive with limited capacity. The global demand for plasmid DNA as a manufacturing platform has exploded over the past several years, driven principally by the emergency of the mRNA vaccines, as well as cell and gene therapies. Today, with the regulatory approval of two Messenger RNA vaccines, the proverbial gloves have come off and the demand for DNA has increased exponentially. In addition to mRNA therapeutics, currently, there are only about 20 FDA or EMA approved or authorized DNA-based therapies that are available. And as these therapies move through late-stage clinical phases, these demands drivers are exacerbating plasmid DNA capacity constraints and highlighting the clinical chinks in their armor. In comparison with plasmid DNA, LinearDNA is a much simpler process that utilizes four ingredients, none of which are bacterial in nature, and therefore, there is no risk of bacterial contamination and antibiotic resistance. Batch-to-batch consistency is excellent, which is critical for any regulatory body reviewing a therapeutic that could make it into hundreds of thousands or even millions or billions of doses. In addition, unlike plasmid DNA, LinearDNA exists without a plasmid backbone, meaning it only consists of the therapeutic relevant DNA sequence. In fact, our early studies have shown that LinearDNA requires only between one-third and one half the amount of plasmid DNA to effect a similar degree of trans gene expression. And for preclinical nucleic acid-based therapeutic developments in the fields of CAR T, a form of redirected cells; DNA vaccines, both antiviral and anti-cancer; messenger RNA therapies; CRISPR-based therapies; and gene therapies. To date, these are contract research orders that are principally for use as a research development tool for therapeutics, or in the case of diagnostics, fully commercial applications that require minute amounts of LinearDNA. Given the window, our development priorities are focused on further validation of our platform and initiatives that support the fastest paths to the market. Our end goal is to advance the platform, so that we can incentivize contract research customers to take our LinearDNA into the clinic with us as the manufacturer of record for their therapeutic and to support our own therapeutic development pipeline. Firstly, LinearDNA is a direct replacement for plasmid DNA in existing therapeutic manufacturing workflows; and two, LinearDNA has a direct therapeutics such as a DNA vaccine. Currently, we are evaluating LinearDNA for use in mRNA CAR T and AAV or gene therapy workflows. And given the growing supply chain constraints and drawbacks of plasmid DNA, we believe this is to be a very large market, in which we can be very competitive. We believe that LinearDNA, which by its very nature, is already linear, is an excellent alternative to plasmid DNA in mRNA manufacturing workflows. Farther afield, LinearDNA has already been shown to be an effective direct therapeutic, such as in a DNA vaccine. We have proven in multiple animal models that our LinearDNA COVID-19 vaccine candidates, elicit strong antibody and cellular immune responses. We believe that the LinearDNA vaccines carry great promise in the vaccine field, particularly in the areas of rapid pandemic response, personalized medicine, and cancer immunotherapy. While the past to commercialization for LinearDNA vaccines is more complex than existing therapeutic pathways, we believe that the sizeable potential upside justifies our continued development. To these ends, during fiscal 2021, we built out and staffed a cell biology facility to enhance our capability to optimize the design transfection and functional quantification of LinearDNA. And last quarter, I spoke of a publication by the Institute of Hematology and Blood Transfusion in Prague, on their use of LinearDNA as a suitable and cost-effective replacement to plasmid DNA in the production of CAR T cells with similar efficacy to the CAR cells manufactured with plasma. Their paper highlights the use of LinearDNA with a non-viral transfection system, in their case, a transpose on transposes system. And as the next step with the University of Prague, we expect the program will engage in human clinical trials using our Linear GLP grade DNA amplified from their CAR construct. The European Medicines Agency or EMA provides a regulatory path to the clinic using GLP grade Linear DNA and with our collaborators finishing the drug product, yielding a cGMP therapy. The trial would be a milestone for Applied DNA, the first-in-humans trial for LinearDNA. This is a fluorescent image of cells transfected by our cell biology scientist, using a LinearDNA construct of the genes necessary to obtain CAR T cells that are redirected to attack cancer cells in the blood. And you can see clearly, the expression in green of the protein encoded by our LinearDNA. Now separately and in parallel, our LNP capacity has peaked our customers’ interest. In the coming quarters, we expect our LinearDNA CRO customers will be requesting us to encapsulate the LinearDNA into LNPs for their side-by-side transfection studies. We, in turn, will be optimizing the LNP workflow for LinearDNA. In addition, in conjunction with our partners of Evvivax/Takis in Italy, we’ve completed a manuscript detailing our data validating the use of LinearDNA as an immunotherapy pan cancer vaccine in mouse models. The data show that a LinearDNA vaccine in a mouse model can elicit strong antigen specific immune responses, and significantly reduced tumor growth when administered with immune checkpoint inhibitors. Finally, we recently completed the first phase of our LinearDNA COVID-19 vaccine trial in ferrets in conjunction with Cornell University. While the data produced by the clinical style – trial are still being analyzed, initial findings show that a prime and booster dose regiment of the vaccine was protective against SARS-CoV-2 infection in the challenge trial. We plan to publish the data from the clinical trial in the coming months, which we believe will serve as an important validation of our platform for DNA vaccines. More recently, new governmental regulations in the U.S. and those proposed in the EU, related to forced labor should spotlight our certainty platform to validate a brand’s cotton source forensically. Overall, we are excited by our Q1 results, both from a record revenue standpoint and the successful continued development of the LinearDNA platform. We have our most significant customer, who is that’s CUNY, City University of New York, who is dramatically increasing the amount of people on their campus by a very significant percentage of the total. Can you help us understand the types of genetic and molecular tests that you will initially commercialize you were saying over the next year, or perhaps over the next – the rest of the calendar year or your fiscal year, I wasn’t sure about that. Thereafter, we’re looking at surveillance and diagnostic assays that would apply, for example, to skilled nursing facilities, where the issue of pathogen contagion is important, and you want to be able to catch infection in the early stage. And then as for COGS…\n So not dropping back to fiscal 2021 fourth quarter like $2.5 million, it’ll stay around for something. We had two things happening – the colleges, specifically CUNY and some of the others where we have the testing collection sites, those are at a lower gross margin. However, that is offset by now the increase in testing volume at those helps a better absorption of some of the fixed fees for staffing the sites and things like that. And also, with the positivity rate going down, we can go back to our pooling, which helps our gross profit in that our consumables and things are used at a lot lower upper rate. So just on Beth’s last point, the impact of pooling at low positivity is we effectively contest five samples at a time. And if those five samples are negative for that, well, we’re seeing an 80% increase in – up in productivity. So the increase in clinical lab service revenues of $2.4 million during the fiscal, is that completely related to COVID? Yeah, that’s all COVID testing. So, for example, we have already validated the – what’s called the ABC Assay that is for Flu A, Flu B, and COVID. And other assays, the home collection, which is essentially the same collection of essays, but now on a much broader sampling population that will begin as soon as we’re granted the EUA, which we’re expecting in short course. And I know you briefly touched upon the pan cancer, LinearDNA vaccine. And remember, with LinearDNA, we have an extraordinarily stable nucleic acid product. But by comparison, LinearDNA vaccines, you can ship across the Sahara without a serious worry. We’re seeing these more restrictive states, even New York, kind of go against CDC guidelines and even though lighthouse, and as soon as Hoko  teams is going to take all the restrictions off, we would think that testing below and volumes would kind of go with it. So in testing, for example, large institutions, the rapid antigen tests are not an adequate substitute for screening, for asymptomatic infection. So then where – do you see a – because of the pandemic, even if it becomes endemic, there’s got to be some level of testing that’s going to have to remain. It’s just – I think, I don’t know if I heard it correctly, it was a comment you made about the clinical path for linear vaccines may be more complex than traditional vaccines. But I do think that the degree of comfort with nucleic acid therapies in general, has increased so much that the top has really been blown off the opportunities. While there were only 20 approved nucleic acid drugs right now, two years ago, FDA projected 200 BLAs for this current calendar year. So I think that the demand is there, the markets are there, and the marketplace needs diversity beyond messenger RNA, and it can’t be met by plasmid DNA. If you do get this emergency use authorization for the At-Home Collection Kit, I was hoping you might be able to talk a little bit more about the revenue opportunity there and maybe the margin profile. And then if you could just touch on what you’re seeing in terms of tagging demand, I think, last quarter, you mentioned some potential textile projects with the apparel brands in the pipeline. If you could give us an update, that’d be great. In particular, the situation in China right now, with the Uighur  facing, what they’re facing, and no means of identifying cottons that are forbidden from entry into the United States. And we are attacking a window of opportunity, as I put it earlier, opened by COVID 19 while being supported by our team’s excellent execution on our diagnostic strategy. And we look forward to updating you all our progress made across all aspects of the company via our press releases and on our next investor call in May, and we’re grateful to all of you for participating today."
}