{
    "symbol": "APDN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-16 19:57:05",
    "content": " Before my review, I would like to note that effective with the filing of our 2022 Form 10-K today, we are reporting segment data that reflects the results of operations for our three reportable segments which are comprised of: therapeutic DNA production, which is identified as LineaRx, our majority-owned biotherapeutic subsidiary; MDx or molecular diagnostic testing services and products, which is our ADCL Clinical Laboratory; and DNA tagging and security products, which is our supply chain traceability segment. Given the recent substantial growth in our clinical laboratory business as well as the evolution of our LineaRx subsidiary, the tools and processes put in place over the course of the fiscal year will enable the executive management team to manage the company's performance on a segment basis, assess expected future cash flows and make more informed decisions about each of our three business segments going forward. Total revenue was $3.6 million, an increase of 17% from $3 million in the prior fiscal period, reflecting a $1.3 million increase in ADCL COVID-19 testing revenues associated with our key clients that offset a decline in product and service revenues from other businesses totaling $782,000. Capital expenditures are projected to be less than $3 million, the bulk of which will be focused on development activities to support our two near-term go-to-market application for LineaRx's linear DNA platform, that Jim will address in his remarks. In fiscal 2022, our strategic priorities were: first, to maintain momentum and revenue after a record fiscal 2021; second, to advance our pivot to biotherapeutics, which we recognize as having the greatest opportunity to build long-term value for our shareholders; and third, to evolve our DNA tagging and clinical lab segments toward positive cash flows to support the value-creating potential of LineaRx, our biotherapeutics segment."
}