{
    "symbol": "FINW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 19:05:07",
    "content": " Net income for Q4 was $6.5 million, compared $3.7 million in the prior quarter and diluted earnings per share were $0.49 for Q4, compared to $0.27 for the previous quarter. Positively in Q4, the company's tangible book value per common share continued to grow to $10.95 per share or 21.1% increase over the prior year period. As we also mentioned on last quarter's earnings call, we expect to continue to originate and hold the guaranteed portion of the certain SBA 7(a) loans, which although a headwind to the company's SBA gain on sale, we expect will result in stronger held for investment loan growth and an incremental tailwind to our net interest income over the long-term. Average loan balances comprising held for sale and held for investment loans were $261.4 million during Q4, as compared to $263.6 million in Q3 â\u0080\u009822 and $286.8 million in Q4 â\u0080\u009921. Total average interest earning assets were $354.4 million during Q4, compared to $335.4 million for Q3 â\u0080\u009822 and $367.6 million for Q4 â\u0080\u009921. Average interest-bearing deposits were $126.1 million during Q4, compared to $104.8 million during Q3 â\u0080\u009822 and $148 million during Q4 â\u0080\u009821. Net income was $6.5 million in Q4, compared to $3.7 million in Q3 â\u0080\u009822 and $10.1 million in Q4 â\u0080\u009921. Net interest income per Q4 was $12.6 million, compared to $12.5 million for the previous quarter and $15.3 million during Q4 â\u0080\u009821. Non-interest income was $9.8 million in Q4, compared to $7.5 million during the previous quarter and $9.1 million in Q4 â\u0080\u009821. The sequential quarter change was driven primarily by a one-time gain on sale of loans recorded to establish a new loan trailing fee asset of approximately $2.3 million and an increase in the fair value of our business funding group, LLC, BFG investment, partially offset by lower strategic program fees due to a decrease in loan origination volumes. This increase compared to Q4 â\u0080\u009821 was primarily due to an increase in gain on sale of loans, partially offset by a decline in strategic program fees resulting primarily from lower originations. Non-interest expenses rose to $10.2 million, compared to $8.5 million in Q3 â\u0080\u009822 and $8.4 million during Q4 â\u0080\u009921. The company's provision for loan losses was $3.2 million for Q4, compared to $4.5 million for Q3 â\u0080\u009822 and $2.5 million for Q4 â\u0080\u009821. Net charge-offs for Q4 were $30.2 million, compared to $3.1 million in the prior quarter and $2.3 million for Q4 â\u0080\u009921. The company's net charge-off rate as a percentage of average loans for Q4 was 4.9%, compared to 4.7% for Q3 â\u0080\u009822 and 3.2% for Q4 â\u0080\u009921. As Kent mentioned earlier, the primary reason for the pickup in our ratio of net charge-offs to average loans is due to our proactive effort to lower balances of sub-36% held for investment loans since early 2022 as we deemed the risk reward on these loans to be less favorable, compared to the rest of our portfolio rather than faster-than-expected credit quality normalization."
}