{
    "symbol": "FINW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 18:11:11",
    "content": " Specifically, of the $272.6 million in total loans at March 31, 2022, strategic program held for sale loans comprised $73.8 million or 27.1% of our total loans. Further, of the $272.6 million in total loans at March 31, 2022, the guaranteed portion of the SBA 7(a) loans comprised $53.2 million or 19.5% of our total loans. The strategic program held for investment loan balance at March 31, 2022 was $28.0 million or 10.3% of total period end loans receivable. Importantly, while constituting only 10.3% of period-end loans receivable at March 31, 2022, these strategic programs provide us with access to strong risk-adjusted yields on held for investment bonds, for which we are also well reserved. Moreover, strategic programs held for investment loans are about evenly distributed between loans with annual interest rates above and below 36% at March 31, 2022. Specifically, loan originations totaled $2.5 billion during the quarter, up 9% compared to the prior quarter and more than doubled from Q1, 2021. Average loan balances, comprising held for sale and held for investment loans, were $296.7 million during Q1, an increase of 3.5% and from $286.8 million in Q4 2021 and a 14.5% increase from $259.1 million in Q1 2021. During Q1 2022 and the previous quarter, we continue to shift the underlying loan mix by increasing our balances of held for sale and held for investment loans with lower yields from our strategic programs. Compared to Q4 2021, growth was primarily driven by a step-up in non-interest income from gain on sale of SBA 7(a) loans and higher strategic program fees, partially offset by a modest increase in non-interest expense. The modest decline compared to Q4 2021 reflects a change in the mix of held-for-sale loans, reflecting higher average balances from strategic programs with lower-yielding loans. The primary drivers include higher gain on sale of loans due to an increase in the number of SBA 7(a) loans sold as well as solid strategic program fees of $6.6 million, which compares to $6.1 million in Q4 2021 and $3 million in Q1 2021. Our net charge-off rate, as a percentage of average loans for Q1 was 3.8% compared to 3.2% for Q4 2021 and 1% for Q1 2021. We believe that we are well reserved with an allowance as a percentage of total loans less PPP loans of 3.7% for Q1, which compares to 3.7% for Q4 2021 and 3.4% for Q1 2021."
}