{
    "symbol": "PDM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 08:20:30",
    "content": " Although there is still a little bit more work to be done, after completing most of the repositioning of this asset for a cost of less than $30 a square foot we've been able to push asking rental rates to the mid-30s while improving overall occupancy rates steadily over the last several quarters. While I've highlighted second quarter leasing results thus far, it's worth looking back over the past 12 months where we've reached pre-COVID new leasing levels and achieved strong and almost 5% cash and 12% accrual roll-ups. I do want to point out that we have previously discussed, during the last two earnings calls, that our Board would review our current dividend level this summer, given the disruption in the fixed income markets and the potential for near-term recession, the Board decided yesterday to maintain our current dividend rate at $0.21 per share per quarter for the time being. As George alluded to in his comments, with the improved lease, economics and rental rate roll-ups over the last few quarters, our quarterly same-store cash NOI and accrual basis NOI, for the second quarter of 2022 increased approximately 2% and 3% respectively, compared to the second quarter of 2021. We will continue to seek transformative acquisition opportunities to elevate the quality of the portfolio and earnings trajectory of the company and that's exactly what we accomplished with the acquisition of 1180 Peachtree, a skylining defining project at the most active corner in Midtown Atlanta with an impressive tenant roster comprised of professional services and financial firms with in-place rents 20% below market and limited near-term lease expirations. Certainly, it's been choppy capital markets but an asset of this quality as we've continued to see in a number of comparable trades since call it the June time frame where we started to really see some of this disruption was while competitive, we still felt like we were the optimal group given the quality of the asset, our previous acquisition call it nine months ago with 999 and being able to really create a beachhead here with 1.3 million square feet. But what's unique about this, I think there are other acquisitions that we've continued to see roll-off in our sector for these types of high-quality deals is that this one will compete with new construction full glass window line beautiful 10-foot plus finished ceilings, really unique building and location-wise could not be more at the corner of Main and Main in Midtown Atlanta."
}