{
    "symbol": "PDM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:32:09",
    "content": " Despite the headwinds that the office sector faced during 2022, including remote work, interest rate increases and recession fears, Piemont continued to execute on its leasing and capital recycling objectives, ultimately driving our Sunbelt concentration to 67% of our annualized lease revenue at year's end with a goal to reach 70% by the end of 2023. JLL reported another quarter of positive absorption during the fourth quarter with the market ending 2022 with 1.1 million square feet of total absorption for the year, the highest annual absorption since 2015 with direct rents in the Midtown submarket increasing 10% year-over-year. We recently completed three leases of our three gallery assets, which also attained lead gold status during this quarter, increasing our overall portfolio lead designation to approximately 50%, with more buildings in process and a goal of reaching 60% lead designation by the end of the year. With this modest amount of exposure, combined with our historically high retention rates and the fact that, the average size of our expiring tenants, using cargo is around 8,000 square feet, matching well with the deepest and most active demand segment of the market, we are forecasting positive net space absorption during the year resulting in anticipated year-end lease percentage in our portfolio of between 87% and 88%, up modestly from year-end 2022. Nonetheless, with over 400 basis points of increases in Fed fund rates during 2022 and further increases projected during 2023, along with two new floating rate term loans replacing our $350 million 10-year 3.43% bonds that are maturing this year. We began the year with approximately 1.14 million square feet of executed leases, up from 800,000 square feet a year ago that were yet to commence for existing vacant space or that are in abatement, which should contribute additional cash revenues of $33 million and cash NOI of approximately $20 million over the next 12 to 24 months. That's really a component of continuing to be able to obviously get the incremental bumps in the existing leases, but we do have a number -- a good bit of continued rent to burn off during the year and we'll continue to fuel that as well as what we anticipate additional leasing and some activity that we have in the pipeline is not signed, but would be more near-term starts that will continue -- be able to contribute to that."
}