{
    "symbol": "CANG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-30 00:15:02",
    "content": " Beyond that  policies released in the last two quarters, that if it imposed new and used car sales have not only boosted confidence among industry participants, but also improved the order of the industry, laying a solid foundation for the sustainable development and prosperity of China's automotive industry. In the face of these evolving market trends and regulatory changes, we remain focused on our car trading transaction business during the third quarter and continue to implement our dual platform strategy covering both the new and used car markets. Against this backdrop, we are striving to build a new digital supply chain with the Cango Haoche platform provided diverse solutions for auto dealers to address their needs across car sourcing, logistics, vehicle registration and other car trading related business. Our high-quality used car sources are also Cango U-Carâ\u0080\u0099s  with dealers combined with our professional one-on-one matching services, Cango U-Car has highly improved dealers trading experience, and the used car transaction efficiency. We are confident that by harnessing the power of our rich industry expertise and well established a lower tier marketing network, we can leverage Cango Haoche to capture policy driven opportunities in the used car market, while providing dealers with better products and services. Meanwhile, we will leverage our longtime strengths to develop our new and used car businesses in parallel and elevate our one stop platform service capabilities, creating value for OEMs and dealers alike and making car purchases simple and enjoyable. Well, we have gradually launched our standardized products on the Cango Haoche app including reliable car search while we call  and also logistics services and deposit guarantee what we call , as well as insurance and also customer leads generation service, which we call . In addition based on our new car transaction business model, we have validated the viability of our used car business, so we have also been investing resources to develop a transaction platform for used cars which we expect to launch by the end of the year."
}