{
    "symbol": "NRGV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 22:32:16",
    "content": " Many of you might be familiar with Jan Kees, if you're in this industry as he comes to us with extensive financial leadership experience directly in the energy industry in a career spanning 35 years across 20 plus countries around the globe, the Energy Vault team and I are looking forward to work with Jan Kees and the contributions he will make as we expand our global infrastructure, fortify our financial and cash discipline within our rapid growth envelope and continue to build the institutional investor relationships as we meet our commitments, and execute our plans. In addition, the commercial team executed on over two gigawatt hours of new project awards in the quarter, including our first long duration hybrid system, a 300-megawatt hour battery and green hydrogen project utility scale supporting a 48-hour storage duration with a large western public utility. We have executed and the team has executed very well I had a plan on our energy management software platform, which is not only supporting adoption of our gravity storage solutions for direct and licensing opportunities that were previously announced, but has also provided a platform to address the immediate market need in shorter duration storage. Energy Vault is well positioned to meet our customer needs with our proprietary EVx gravity-based energy storage solution that is technically and commercially optimized for four to 12 plus hours duration, as demonstrated by early industrial energy and emerging sustainable aviation fuel adopters of the technology, as well as our list of strategic investors, which I mentioned above BHP, Korea Zinc, Saudi Aramco and Atlas Renewable interest in deploying gravity energy storage remain strong. These projects extend our geographic reach and diversification, making our first deployment in Europe and our first shorter duration project to complement our long duration gravity project in Australia, two areas that are seeing significant growth in demand for energy storage. Australia's power markets are ideal for energy storage deployment is an increased power market dislocations over the past year have supported increased revenue opportunities for utility scale energy storage, an opportunity that our software and solutions-based approach is well positioned to benefit from. As I referenced earlier a few times the award of an energy storage project for 300-megawatt hour utilizing a hybrid battery and green hydrogen system is truly transformational and uniquely addresses the utility market need to critically ensure grid resiliency in the event of unforeseen power failures, some of which have resulted in loss of life in the past, the system will provide carbon free energy over 48 hours. Just a few days ago, it was announced that China Tianying and Atlas together with multiple partners including China's Three Gorges construction, which is the largest private power provider in China, and the largest hydroelectric power company in the world will jointly build an integrated energy base supported by our EVx gravity, energy storage technology in BG city, and in China's  province. Last quarter, we announced the commitments of sight and feasibility planning with Arc Energy, the Australian wholly owned subsidiary of Korea Zinc for multi gigawatt hours of both long and short duration storage projects, supporting the sister company Sun metals Corporation in North Queensland, Australia, and we continue to make progress toward deployment here. Look, we're really excited about that, as you probably heard from the prepared remarks, I think we've referenced that about three different times because it is exciting, and not only exciting for the first of a kind of this type of architecture in the energy storage space, but the size of it, 300-megawatt hour and you're complimenting a short duration need with a 48-hour storage need."
}