{
    "symbol": "NRGV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 12:57:01",
    "content": " As we look at 2023 and the Gravity and the EVS projects awarded and underway, as well as early development activity in China referenced earlier, we are expecting the aggregate revenue for 2022 and 2023 in line with our original investment plan, for a total of approximately $680 million across both years. Announcing multi gigawatt hour development of gravity energy storage projects in one of the largest energy storage markets in the world of Australia and our first 3 EVx project awards from customers totaling another 1 gigawatt hour is not something that comes without dedication and a relentless focus on execution, while ignoring the noise. But we need to continue to evaluate that and make sure we understand exactly we want to go there, but there's no projection in front of us right now, where we're going to be spending $200 million a year on CapEx for that type of build, as they expected a year ago, that most of the deals that we are talking now the customer wants to own the project, and wants to own the system. I think in this case with our first 5-megawatt system in Switzerland that we in 2019 went right to market to prove the technology at scale, and that's what led to all the diligence that we had from some of the largest energy groups in the world that, I just mentioned that the diligence on the tech saw working and working as planned, saw the round trip efficiency we are achieving in Switzerland there, and that led to the progression in getting to their needs for longer patient storage. And then what I'd say about EVS is I mentioned this to the last question, also that, I think Brian had, but also that Stephen touched on is, we're looking at trying to innovate to do things between the battery suppliers and our software in a way in helping customers solve some of their complex problems that can help us take cost out to the overall solution and provide something very value added to customers."
}