{
    "symbol": "VPG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 20:56:55",
    "content": " We reported sales of $90.1 million, which was 9.9% higher than a year ago and 1.6% above the second quarter of 2022. Foreign currency continued to significantly impact sensors revenue and resulted in a negative impact of $2.7 million and $700,000 to the sensors top line compared to a year ago in the second quarter respectively. In conjunction with our strategic operational excellence plan in the third quarter, we completed a shutdown of our Legacy strain gage facility in Israel, which we expect will yield approximately $1 million in annual cost savings. Orders of $33.1 million increased 12.8% from the second quarter, mainly due to a large order for precision agriculture applications. Revenue in the third quarter of $20.8 million increased 4.5% sequentially, reflecting higher project-driven sales of DSI, the metal alloy development tools and higher sales of DTS, the safety crash test systems. As I mentioned earlier, in the third quarter, we generated $16.1 million of adjusted EBITDA and an adjusted EBITDA margin of 17.9%. In the third quarter of 2022, we achieved revenues of $90.1 million, gross profit of $37.3 million or 41.4% of sales, operating income of $11.9 million or 13.2% of revenues and diluted net earnings per share of $0.74. On an adjusted basis, our gross profit was $37.6 million or 41.7% of sales, operating income was $12.3 million or 13.7% of sales and diluted net earnings per share was $0.69. Our third quarter revenues increased 1.6% compared to $88.6 million in the second quarter of 2022 and were 9.9% above the third quarter a year ago. Gross margin in the third quarter was 41.4% compared to 42.1% in the second quarter of 2022, which benefited from higher volume and selling price increases, which was more than offset by a higher material cost, unfavorable foreign exchange rates and reduction in inventories. Selling, general and administrative expenses for the third quarter were $25.3 million or 28.1% of revenues compared to $24.6 million or 30% of revenues for the third quarter of 2021. Regarding the outlook for the fourth fiscal quarter, we expect net revenue to be in the range of $88 million to $98 million at a constant third fiscal quarter 2022 exchange rates."
}