{
    "symbol": "VPG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 09:23:07",
    "content": " Looking at the second quarter results in detail, we reported sales of $88.6 million, which was 17.6% higher than a year ago, and 1.1% above the first quarter of 2022. We improved our adjusted gross margin to 42.9%, as compared to the first quarter adjusted gross profit margin of 41.0%, and generated an adjusted EBITDA margin of 17.8%, and a record adjusted diluted net earnings per share of $0.68. Second quarter revenue of $40.3 million, grew 29.2% from a year ago, and was 6.7% higher sequentially. Second quarter sales were $28.5 million, the 13.1% sequential decline, reflected lower sales of OEM Force Sensors in our precision agriculture and construction markets and lower sales of onboard weighing products to the transportation market. Orders of $29.3 million, declined $5.6 million or 16% from the first quarter due to softer demand for Force Sensors in other markets and for process weighing applications. Turning to our Measurement Systems segment, revenues in the second quarter of $19.9 million increased 15.9% sequentially, reflecting higher sales of project-driven solutions to the steel market. As I mentioned earlier, in the second quarter, we generated $15.8 million of adjusted EBITDA and an adjusted EBITDA margin of 17.8%. In the second quarter of 2022, we achieved revenues of $88.6 million, the gross profit of $37.3 million, or 42.1% of sales, operating income of $10.6 million, or 11.9% of revenues and diluted net earnings per share of $0.79. On an adjusted basis, our gross profit was $38 million or 42.9% of sales, operating income was $12.1 million or 13.7% of sales, and diluted net earnings per share was $0.68. Our second quarter 2022 revenues increased 1.1%, compared to $87.7 million in the first quarter of 2022 and were 17.6% above the second quarter a year ago. Foreign exchange for the second quarter of 2022 negatively impacted revenues by $4 million, compared to a year ago and negatively impacted revenues by $2 million, as compared to the first quarter of 2022. On an adjusted basis, second quarter gross margin was 42.9%, as compared to 41% in the first quarter of 2022 and excludes $700,000 of acquisition purchase accounting adjustments. Selling, general and administrative expenses for the second quarter of 2022 were $25.9 million or 29.2% of revenues, compared to $22.5 million or 29.8% of revenues for the second quarter of 2021. The adjusted net earnings for the second quarter of 2022 were $9.3 million or $0.68 per diluted share, compared to $6.7 million or $0.49 per diluted share in the second quarter of 2021. Regarding the outlook, for the third fiscal quarter, we expect net revenues to grow sequentially and be in the range of $90 million to $100 million at constant second fiscal quarter of 2022 exchange rates. Bill, your line is now open. Bill, your line is now open."
}