{
    "symbol": "VPG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 14:00:24",
    "content": " We reported sales of $96.2 million, which was 6.9% higher than both a year ago and the third quarter 2022. FX impacted our total fourth quarter revenues by $5.3 million compared to a year ago and by $800,000 when compared to the third quarter. Beginning with our Sensor segment, Fourth quarter revenue of $36.3 million declined 4.1% sequentially and grew 6.3% from a year ago. Foreign currency continued to significantly impact Sensors revenue and resulted in a negative impact of $300,000 and $2.4 million to the Sensors' topline compared to the third quarter and a year ago, respectively. Sales of Advanced Sensors softened modestly in the fourth quarter, as for the full year, Advanced Sensors revenue grew 41% to approximately $50 million with what we view as the best performing product of its kind in the market today, we are well-positioned on our customers' next-generation platform as we continue to be excited about the long-term potential for Advanced Sensors. Turning to our Weighing Solutions segment, fourth quarter sales of $33.1 million increased 5.4% from $31.4 million from the third quarter of 2022 and 3.2% from $32.1 million in the prior year period. Turning to our Measurement Systems segment, revenue in the fourth quarter of $26.8 million increased 29.2% sequentially and 12.8% from a year ago -- from prior year, reflecting growth across the Measurement Systems portfolio, excluding the negative impact of FX, Measurement Systems revenue grew 31.3% sequentially and 16.9% year-over-year. Adjusted gross margin in the fourth quarter for Measurement Systems was 56.8%, which compared to 56.7% in the third quarter of 2022, while slightly higher on a sequential basis, the fourth quarter adjusted gross margin for Measurement Systems was impacted negatively by unfavorable product mix and foreign exchange rates. Our fourth quarter 2022 revenues grew 6.9% compared to the $90.1 million in the fourth quarter a year ago, and were 6.9% above the third quarter of 2022. Foreign exchange for the fourth quarter of 2022 had a negative impact on revenues of $5.3 million compared to a year ago and a negative impact of $800,000 as compared to the third quarter of 2022. On an adjusted basis, excluding $200,000 of acquisition purchase accounting adjustments, our fourth quarter gross margin of 41.5% compared to 41.7% in the third quarter of 2022. Selling, general, and administrative expenses for the fourth quarter of 2022 were $26.5 million or 27.5% of revenues compared to $25.3 million or 28.1% of revenues for the third quarter of 2022. For the first fiscal quarter of 2023 at constant fourth fiscal 2022 exchange rates, we expect net revenue to be in the range of $85 million to $95 million. John, your line is now open. John, your line is now open."
}