{
    "symbol": "EMKR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-09 22:57:10",
    "content": "  Thank you and good afternoon, everyone, and welcome to our conference call to discuss EMCORE's fiscal 2022 third quarter results as well as the acquisition of the Inertial Navigation Business from KVH Industries that we announced today. Such forward-looking statements include, in particular, projections about future results, including those with the acquisition of KVH's Inertial Navigation Business statements about plans, strategies, business prospects and changes and trends in the business and the markets in which we operate as well as the anticipated benefits and costs of EMCORE's acquisition of the Inertial Navigation Business acquired from KVH Industries. EMCORE's third quarter fiscal revenue was $23.7 million slightly below the bottom of our guidance range for revenue, but down about 27% over Q2. As I pointed out last quarter, it's important to note that fab utilization from these new products is expected to drive the majority of wafer fab starts pushing cable TV requirements into the minority, stabilizing costs and ultimately improving gross margins in the Broadband business. In our press release, we announced that we acquired KVH's Inertial Navigation Business today for $55 million. We expect the addition of KVH's Inertial Navigation products located in Tinley Park, Illinois, to generate over $30 million in revenue on an annual basis and be EBITDA positive with cost synergies anticipated to play out in the first two years. In connection with our all-cash $55 million acquisition of the Inertial Navigation business from KVH, the deal was paid for with $35 million from cash on hand with the balance being financed with a new ABL credit facility provided by Link Fire Capital, which at close consisted of a $6 million senior secured machinery and equipment term loan and $14 million drawn down from a revolving line of credit. So 24 to 26, if I take roughly half of the run rate you mentioned here for quarter, maybe $3 million or $4 million, I would put the endpoint here like 21, 22 with the organic EMCORE business."
}