{
    "symbol": "EMKR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-09 21:50:01",
    "content": " On this call, Jeff Rittichier, EMCORE's President and Chief Executive Officer, will begin with the discussion of our business highlights, I will then update you on our financial results and we'll conclude by taking questions, before we begin, we would like to remind you that the information provided herein may include forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Exchange Act of 1934. Our FOG products are also gaining traction -- We completed the first phase of-production for our new airborne pod were awarded the final pre -production phase, I think in December, which we expect to complete within calendar year 22, low level production of for this program is expected to begin in 23, fiscal 23, and the total value for the program estimates are unchanged about $70 million over seven years. Aerospace and Defence segment revenue decreased when compared to the $11.7 million in the prior quarter, as was the case in the September quarter, the sequential A&D revenue change in the December quarter was attributable to our Quartz MEMS product line, primarily due to a mix shift to equip a product with lower production yields and Defense Optoelectronics products primarily due to supply chain disruptions. The last couple of quarters, we've been at 18% and certainly that's not indicative of the normal gross margin for that business we've had a mix to a different product that has caused us to take a little bit of a setback on yields because we were making really good progress throughout most of last year. So 18%, I don't think we're going to see that in the next quarter and after but we should be making our way back into, let's call it the mid-20s. Let's say it came down almost a little bit more than 300 basis points which last quarter is very, very high and it's still very profitable for the segment as a whole in Broadband but I'm curious if you're seeing both lower volumes and I guess kind of a mix shift to maybe more of these modules versus the transmitter. And so that situation, if it changes and it likely to change at least for the March quarter, and potentially the second -- the third fiscal quarter, second calendar quarter of June will cause the Broadband margin to be lower than what the Cable TV gross margins are."
}