{
    "symbol": "SGRY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 16:23:01",
    "content": " We are pleased to report second quarter 2022 adjusted EBITDA of $86.1 million, a 13% increase as compared to the prior year quarter and nearly 18% growth when excluding CARES Act grants. Based on our solid performance during the first half of the year and our outlook for the back half of the year, we are reaffirming our full year guidance for 2022 adjusted EBITDA to a range of $375 million to $385 million and revenue in the range of $2.5 billion to $2.6 billion. Adjusted EBITDA came in at $86.1 million, with a 14% margin when you exclude the impact of CARES Act grants, delivering 50 basis points of margin expansion compared to the prior year period, which was in line with our expectations for the quarter. Starting with the top line, we performed over 149,000 surgical cases in the second quarter of 2022, 6.7% more than the same period last year with strength across specialties, especially in orthopedics where we grew by nearly 12.5% versus prior year. I guess for Wayne or Dave, as I think about the capital structure and the guidance that you gave that you're going to spend $200 million this year in acquisitions, a lot of investors are thinking about just cash use, cash generation and how you're thinking about the sustainability of that $200 million beyond 2022, given the leverage profile in the current market environment. One thing I would also remind  is our model's pretty unique in that if you consider historical patterns -- and while history is not necessarily an indicator of how the future will repeat, whether you're in the inflationary environment or whether you move into a recessionary environment, if you look back to even the kind of 2008, 2009 period when we went through the Great Recession, the opposite actually occurred. But you've executed on I think $135 million worth of transactions year-to-date, which gives something close to high-single to low-double digit EBITDA contribution -- dollar contribution for 2022 based on my math. And the last thing I would simply say is on the M&A front, as we think about the $200 million, we always recommend use kind of a midyear convention. And our calculation of credit agreement EBITDA, which we put in our press release, I think you can see in the back part about it, was just under $440 million, a little bit higher up than what we had in the second quarter -- I'm sorry, in the first quarter, all exclusively kind of related to the acquisitions that we've completed. There's a few more -- the reason this isn't going as fast as maybe some people would think is because there are a few more kind of obstacles, meaning a lot of these docs haven't done this in the past and/or they're employed heavily throughout the country."
}