{
    "symbol": "SGRY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 15:57:08",
    "content": " This morning, we're pleased to report third quarter 2022 adjusted EBITDA of 96.2 million, a 26% increase as compared to the prior year quarter. The combination of our top line growth and focus on controllable cost allowed us to report an adjusted EBITDA margin of 15.5%, a 180 basis points above the prior year and 150 basis points above our second quarter margin. New physician recruiting efforts yielded over 155 new recruits to our facilities in the third quarter, bringing our overall new recruits in the first nine months of the year to nearly 430 consistent with last year at this time with recruits spanning all of our core high growth specialties. Based on our solid performance during the first three quarters of the   our Q4 outlook, we are reaffirming our full year guidance for 2022 adjusted EBITDA to a range of $375 million to $385 million and we anticipate full-year 2022 revenue in the range of $2.50 billion to $2.55 billion. Starting with the top line, we performed almost 148,000 surgical cases in the third quarter of 2022, 5.6% more than the same period last year with strength across all our specialties, especially in orthopedics where we grew by 9.1% versus prior year. With the third quarter results we released this morning, we are optimistic about 2022 and anticipate full-year 2022 total revenue in the range of $2.5 billion to $2.55 billion   the impact of recent acquisitions, including those that are not consolidated, the third quarter and continued impact of hurricane related closures and our view of the pandemic. I would say this, we continue to believe with our  with the commercial payers that because of our value position, we're able to find a really nice happy medium that allows us to grow revenues appropriately and we feel good about where those negotiations are with Medicare coming in near 4% clearly we have some room on revenue and on the commercial side, those negotiations are always a little bit of a dance between steerage and being the high value player and making sure we're  . Just because your question relates to our guide point from last year or from last quarter going into this quarter, and yes, you're right, the reported adjusted EBITDA number is a little bit better than what our guide was really at the top end of our range. And we think that the team has done a real nice job of showing the power of that I think it's another reason we have a lot of confidence not just in the 100 million of free cash flow that we'll generate next year, but the idea that we have a lot of assets out there that we have a lot of very substantial interest in is, what I would say at what we see as attractive multiples if we can get them over the finish line."
}