{
    "symbol": "SGRY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 13:26:05",
    "content": " This morning, we are pleased to report full year 2022 adjusted EBITDA of $380.2 million, 12% higher than the prior year, and over 20% year-over-year growth when adjusting for the non-recurring benefit of grants. Rounding out our growth story, our M&A team continues its disciplined approach to sourcing and executing on strategically important acquisitions at attractive multiples, and finished 2022 deploying just shy of $250 million at a sub 8x multiple. Off the strength of our fourth quarter reported results and continued investments, we anticipate 2023 adjusted EBITDA to be greater than $425 million and with net revenue exceeding $2.75 billion. Dave will talk about this in more detail, but our adjusted EBITDA of $120.8 million for the quarter and $388.2 million for the year both represent new all-time highs for our company. Adjusted EBITDA for the full year was $380.2 million with a 15% margin, in line with our expectations. These transactions resulted in a fourth quarter ratio of total net debt-to-EBITDA as calculated under the company's credit agreement being 4.3x, a $40 million reduction to our annual cash interest cost, and the elimination of a springing maturity in our term loan that would have brought it due in 2025. And we are setting our initial guidance for 2023 adjusted EBITDA to greater than $425 million, representing 12% growth over 2022. We are projecting 2023 will have a seasonality pattern consistent with 2022, with first quarter adjusted EBITDA and revenue, representing an estimated 20% and 24%, respectively, of our full year guidance. And then the last thing I would point out thatâ\u0080\u0099s really changed, I think, the dynamic the last three or four years for the ASC space is as we continue to add higher acuity service lines: Joint, spine, cardiac, it provides us the opportunity to show the difference in the value creation for payers and for the health system. Yes, one thing I want to highlight is we believe that part of our core business every year is to look out over the next several years and understand what facilities we think have appropriate growth drivers or further opportunity around physician recruitment or ecosystems that we build."
}