{
    "symbol": "CNP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-17 12:54:06",
    "content": " Today, we are also reaffirming our 2023 non-GAAP EPS guidance range of $1.48 to $1.50, an 8% growth rate at the midpoint from the new higher base of $1.38. And finally - in the third quarter of 2022, we increased our 10 year capital plan by $2.3 billion, taking it from $40 billion plus through 2030 to now $43 billion through 2030 with a focus on additional investments in grid reliability and modernization. This $2.3 billion in additional planned capital should not only allow us to provide safer and more reliable energy for our customers, but should also allow us to continue to reduce O&M over the longer term, which additionally benefits both customers and investors alike. In the fourth quarter of 2022, we deployed a CenterPoint record $1.6 billion of capital across our various jurisdictions, bringing our total capital invested for the year to $4.8 billion. For example, in the Houston area, which has the highest concentration of our planned capital spend through 2030, we anticipate that these investments, in combination with our O&M reduction goals, and securitization charges rolling off, should result in an average customer bill increase of only 2% or less per year, well below current inflation rates. Finally, I want to acknowledge and thank all of the CenterPoint employees for a job well done last year, especially those that work through the year-end holidays to ensure the lights stayed on for our customers during the record cold weather that hit millions across the U.S. and also the recent tornado that devastated the cities of Deer Park and Pasadena and surrounding communities in the Houston area. As Dave mentioned, we are reaffirming the full year 2023 guidance range of $1.48 to $1.50 of non-GAAP EPS, which reflects 8% growth over the full year 2022 non-GAAP EPS of $1.38 when using the midpoint of the previously increased guidance range. As Dave mentioned, for the benefit of our customers, we invested $1.6 billion in the fourth quarter and $4.8 billion over the full year in 2022. As of the fourth quarter, aligning with Moody's methodology, our FFO to debt as reported was slightly below 14% and approximately 15% when adjusted for the $1.1 billion of outstanding debt related to Winter Storm Uri extraordinary gas costs. And then as you mentioned, while we get to defer the interest expense on the extraordinary gas costs from Winter Storm Uri here in Texas, we still anticipate receiving $1.1 billion in securitization proceeds in the coming future, and that will really help reduce the overall variable rate exposure."
}