{
    "symbol": "ITRI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 13:26:03",
    "content": " But again, that's something to watch in the quarters ahead from a more positive perspective though it clearly will accelerate energy transition for a lot of Western European countries that would need to work through exactly how they secure energy independence from that kind of situation, that the more renewables and the different sources of energy that need to be put on to the grid systems absolutely accrues very nicely to our technologies, customers will look for the ways to get visibility into the performance of their operations through that, and understand exactly how to balance supply and demand. Some are still in the first gen rollout type of things, but in all cases, there is a more active discussion even on a first gen kind of solution about how to get better value out of it, whether it's the data itself, or how to increase the visibility on the distribution side and really control the grid a little bit better with finer grained control than what we've seen in the past. But we'll continue to work with the customers on the distribution side, on the smart city activities, to be able to automate some of the streetlight kinds of things across major European cities is another area that's been really active in the in the last couple of quarters, and we would anticipate it's likely to continue to be in the quarters ahead. We continue to work with that, and work with customers on scheduling and how that rollout would really work and making sure that as hardware becomes available, the ability to install it quickly and rent it into a commercial environment is there so I would say that there's clearly pressure in that area that we're placing but also customers are eager to get projects going but no change in their commitment to do projects or material changes in how they're planning to spend their capital or things like that. Any combination depending on how people aren't really thinking about it, those are the areas that we've seen a lot of activity, add on capability for streetlights once the network is deployed to do streetlight automation, and be able to use that same canopy network is another area that we've seen a lot of traction over the last couple of quarters in terms of customer dialogue, and are really what we're thinking about is, as we talked about what a book-to-bill ratio would look like."
}