{
    "symbol": "NOK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-30 11:50:02",
    "content": " If you take the product businesses, which are Mobile Networks, Network Infrastructure and CNS on a full-year basis, these three businesses expanded their comparable operating margin by 120 basis points, which is, of course, part of this very good development that you see here. But now, what was extremely pleasing to see, and this was partially behind the very good margin development in the business was that also IP Networks and Optical Networks who had that slightly lower growth in the year accelerated their growth. Now we had â\u0080\u0093 both in Q4 and also for the full-year, we had 3% growth, which means that the declining topline that Mobile Networks had been suffering from for some time has now been turning into growth, albeit still, at this stage, a fairly slow growth. Four quarter rolling gross margin, you can see here, an operating margin here, slight dip in Q4, but on full-year basis, we had 90% expansion in Mobile Networks operating margin to 8.8%. Here, you can see the development of our Enterprise sales between 2017 and 2022, excellent growth, we were around â\u0082¬2 billion last year, 21% growth from 2021 to 2022 and a really, really good 49% growth in Q4. Second is Fixed Networks, which is 32% of sales and which has been a really exciting year in recent years and now generates after a very good development, it generates mid-teens operating margins. And finally, Submarine Networks, which is 13% of sales in NI, which has also grown substantially in recent years and is now low single-digit operating margin. If we look to the future, again, our Fixed Networks business is really focused on growth as it already generates good profitability with a mid-teens operating margin. Again, the same structure on the slide, as you saw for Network Infrastructure, we have restarted growth, which is very important, we had 3% growth both in Q4 and full-year, encouraging development on the gross margin side, and the same can be also said about comparable operating margin, which was, as I said earlier, 8.8% in â\u0080\u0093 not in Q4, but in full-year 2022, it was up 90 basis points. Looking briefly at how we see the Mobile Networks addressable market over the coming years, we see the market growing at a 1% CAGR through 2025."
}