{
    "symbol": "KT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 10:27:05",
    "content": " Operating income jumped 41.1% Y-o-Y to reach KRW626.6 billion, supported by revenue growth driven by DIGICO and efficient cost control. Even on a standalone basis, revenue increased by 0.7% Y-o-Y to report KRW4,608.4 billion and operating income grew by 17.5% Y-o-Y to reach KRW429.9 billion KT is successfully achieving the DIGICO success formula by leading Korea's digital transformation or DX demand and actively cooperating and partnering with Korea's #1 business operators to secure growth momentum. For B2B, KT offers customized services to different industries based on Korea's largest mobile and fixed infrastructure, strength in core DX technologies such as AI, big data and cloud, and our diverse corporate product portfolio, which led to a 10.5% Y-o-Y growth for DIGICO B2B and a 7.1% Y-o-Y growth for the Telco B2B business. The revenue of the cloud and IDC business, the key to digital transformation grew by 14.7% Y-o-Y to continue strong momentum, mainly propelled by the increased sales to large global content providers, KT's preemptive response to new demand and increased demand from the public cloud sector. The Telco B2C business revenue rose by 1.2% Y-o-Y to record KRW2,353.5 billion, backed by stable wireless and broadband revenue growth. The growth of 5G subscribers supported wireless revenue, which increased by 1.9% Y-o-Y to reach KRW1,537.6 billion. The DIGICO B2C business revenue grew 4.7% Y-o-Y to record KRW549.3 billion, thanks to the growth of media and mobile platform businesses. Revenue of Cloud/IDC business showed strong growth, 14.7% increase Y-o-Y-backed by winning orders for cloud projects in the public and financial sectors, upselling to existing customers against higher demand for IDC and revenue growth of the IDC DBO business. Revenue of Contents subsidiaries jumped 35.5% Y-o-Y to report KRW270.4 billion, supported by the effect of consolidation of KT Seezn, HCN and Millie's Library on top of revenue growth of major subsidiaries related to digital advertisement and T-commerce."
}