{
    "symbol": "LIN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 12:52:03",
    "content": " Good morning, everyone, and thank you for attending our 2022 fourth quarter earnings call and webcast. I'm Juan Pelaez, Head of Investor Relations, and I'm joined this morning by Sanjiv Lamba, Chief Executive Officer; and Matt White, Chief Financial Officer. Sanjiv will provide some opening remarks, and then Matt will give an update on Linde's fourth quarter financial performance and outlook, after which, we will wrap up with Q&A. By all measures, 2022 was another successful year for Linde, despite the significant and unprecedented headwinds. And while there are hundreds of daily examples where Linde employees have created real value through their commitment and determination, I'd like to highlight just a few on slide 3. Three important metrics for our owners: operating margin, EPS and ROC, all reached record highs, both for the fourth quarter and the full year. In fact, we achieved our ninth quarter in a row of growing EPS ex FX by 20% or more. On top of that, $7 billion, almost 5% of our average market cap, was returned to owners in the form of dividends and share repurchases. We need to successfully integrate all stakeholders, including employees, customers and the very communities we operate in. Looking at the numbers, we added 50 additional zero-waste sites in 2022, reaching 760 sites around the globe. We reduced absolute Scope 1 and Scope 2 greenhouse gas emissions by over 1 million tons of CO2 versus 2021, despite growing volumes. This is a good start towards our stated goal of reducing 35% greenhouse gas emissions by 2035, which was recently validated by the science-based targets initiative. In addition, through the use of our technology, products and services, we help customers avoid more than 2 times the CO2 emissions from our operational footprint. These achievements have been recognized by the Dow Jones Sustainability Index, CDP and several other independent organizations. And we're not only committed to reducing our own carbon footprint, but we're also playing a major role in the global energy transition, which I'll cover later. When I measure performance and human capital, I first look to our longstanding company values of safety, integrity, inclusion, community and accountability. In support of this commitment, Linde has recently implemented a number of development programs across the enterprise. We're currently at 28% for gender diversity, and I fully expect us to exceed 30% by 2030 across the entire organization. The local nature of our business has also enabled over 500 different community engagement projects, an increase of 25% from 2021. Linde donated more than $10 million to support various charitable and STEM programs, including over $2 million in support of our Ukrainian employees and relief efforts. And while we've had four great years since the merger, I'm even more optimistic looking ahead. The $9.2 billion project backlog, which we define as contractual growth project with secured returns, increased $2.4 billion versus the third quarter due to our OCI win, which I'll talk about shortly. Additionally, 2022 was another record year for small on-site wins as the 52 new contracts will provide secured revenue for the next decade or more. With this in mind, for 2023, we expect to invest almost $5 billion in CapEx and acquisitions across all three supply modes, enabling high-quality growth while increasing asset density and reliability. Furthermore, we expect to start up over $2 billion in sale of gas projects this year, including our $1.4 billion project with ExxonMobil in Singapore. You'll recall that this project is expected to start up in phases, beginning this summer. Therefore, we'll remove it from the backlog sometime during the middle of this year. Of course, it's difficult to talk about growth today without mentioning key secular drivers. I'd like to remind everyone that a few years ago, we stated how we would leverage the secular driver of electronics capacity expansions and win more than our fair share of high-quality projects. Secondly, all projects will follow our investment criteria. OCI is an expert in ammonia production, logistics and marketing, something Linde doesn't want to engage in. In addition, we are partnering with a world-class oil and gas company for the CO2 sequestration. This blue hydrogen project is a great start, and we have several more large-scale energy projects under development. In addition, we will continue to execute in our base business, managing pricing, productivity and increasing density across all three supply modes because we recognize that our owners appreciate the resilience of the industrial gas model. Overall, 2022 was another stellar year despite the many headwinds. This is the fourth year in a row of double-digit EPS growth, and I see no reason why this won't continue. From my vantage point, I've never been more confident about Linde's future. First, you can see FX down 6% year-on-year due to the strong U.S. dollar. I'll speak to guidance at the end, but based on current FX levels, we might have some upside going forward. Weâ\u0080\u0099ll lap that part of this in June and the rest in September, although I do expect a sequential tailwind in the first quarter from our U.S. acquisition of nexAir. The prior year variance is driven by Russian projects, and the sequential decline is from timing of a U.S. project. While we ceased all Russian activity in July of 2022, we continue to reconcile balance sheet liabilities upon reaching settlements with our vendors and former customers. As you know, this represents the contractual pass-through of energy costs and has no effect on operating profit dollars. However, this will impact operating margins as we gross up or down sales and variable costs. This -- prior year, economic weakness in EMEA and severe weather conditions in the U.S. more than offset growth in APAC and project start-ups. So, there's a larger impact to sales than profit given the contractual fixed payments. Versus the third quarter, volume decline is coming from weather impact to U.S. pipeline customers, EMEA's softer economy and normal seasonal impacts from Southern Hemisphere LPG. This mostly occurred in December, but the vast majority of customers are back to their seasonal run rates. Excluding pass-through, operating margins expanded both sequentially and year-over-year in all gas segments as pricing effects net of cost inflation continue to improve underlying business quality. Customer cash deposits are held on the balance sheet as liabilities until we have the contractual right to bill the customer, at which point the liability is recognized on the income statement as revenue. This quarter, we settled a large contract, enabling us to retain all related cash deposits, thus recognizing the remaining liability as current period revenue. During times of rising backlog, cash inflows and margins tend to be higher, whereas in a declining backlog, it's usually the opposite. As Sanjiv mentioned, this is the ninth quarter in a row of 20% or more EPS growth ex FX. Operating cash flow was $9 billion for 2022 or 82% of EBITDA, consistent with our multiyear average. You can see to the right how we invested that cash, aligned with our stated capital allocation policy of growing the dividend, reinvesting in the business and using leftover cash for share repurchases. During the year, we invested $3.3 billion while returning $7.5 billion back to shareholders. For the first quarter, weâ\u0080\u0099re providing an EPS range of $3.05 to $3.15, an increase of 4% to 8% versus prior year or 9% to 13%, when excluding FX. Sequentially, this range assumes that recovering U.S. pipeline volumes and an acquisition are mostly offset by China seasonality and lower engineering profit. Full year guidance is expected in the range of $13.15 to $13.55, representing an increase of 7% to 10% or 9% to 12% when excluding an estimated 2% FX headwind. Furthermore, we're estimating a 4% FX headwind for the first half year and flat for the second half, although recent trends have been better. At this time, we believe it's appropriate to remain cautious against the backdrop of an uncertain environment. And if not, we'll take actions to mitigate like we did in 2020 and 2022. And then, I just -- on the project itself, so the way to think about it, your $0.10 of op profit for every dollar of capital, we should put in about $180 million run rate kind of whenever we think that starts up in 2025. So, let me just take a step back and tell you why projects like this become attractive to have Linde as a partner with. And in the OCI project, as an example, there are a few things that work in our favor. Linde brings a number of things to the table: one, EPC capability with a successful track record executing very large and complex projects; integrating different technology packages. Add on to that the reliability that we're able to bring, which a single captive standalone unit does not have. We, of course, hope the hydrogen pipeline up to our U.S. Gulf Coast system and to the cabin  that has the ability, obviously, to store excess hydrogen at times when we are able to produce more; and strong operational expertise in managing the ATR ASU complex. Ammonia players, in my mind, are increasingly seeing Linde as a very complementary partner, supporting their efforts to start their expansion programs on blue and subsequently green as well. You put all of that together, I think it's a compelling argument, Duffy. As far as the return profile is concerned, and I heard some numbers there, I'd say to you the way we think about returns -- and again, this goes back to our disciplined capital and investment criteria, our -- for us, double digits unlevered post-tax returns is how we would assess a project like this. This is a traditional industrial gas project, no different to any other that we do, and that's how we would then factor the return coming back into the returns you would see hitting the EPS. I'm sure every contract is going to be a little bit different, but your partner sounds like it's going to be a steady and long-term one. So Duffy, let me just -- sorry, John, let me just start off by quickly kind of identifying. As you saw on slide 4, there are three components to this deal coming together. Without an offtaker, we don't develop these projects. In this instance, obviously, when you think about how the project moves forward in examples like this, we are working with numerous partners, developing multiple project streams like this. At the moment, we are in advanced conversations with a number of partners for this very project. And essentially, what we're agreeing with them is potentially what you could call a tipping fee, where we would have structures which allow them to take the cost of transmitting and injecting the CO2 for storage underground and obviously managing that on a permanent basis. So, that's how you would structurally see it. Obviously, the 45Q benefits are part of that discussion and negotiation that we are currently pursuing with a couple, three different carbon sequestration experts. For your existing customers on that pipeline, I assume you're currently supplying them traditional gray hydrogen. So Mike, you're right that there is some excess blue hydrogen that we will have out of this facility. The linkage into the U.S. Gulf Coast hydrogen pipeline network is both space, right? It works as a reliability factor, very attractive for OCI, at the same time, gives me the opportunity to take that surplus blue hydrogen and put it back into my system. In the past, I've explained between gray and blue, the premiums that exist, and we will be putting that into the pipeline for customers who are moving onto blue hydrogen and have the willingness to pay for it. As you'd expect, we tend to be fairly conservative around how we model some of that stuff, and you will see that also here. I see that it stepped down a little bit from the usual sort of $1 billion per quarter in Q4, which I assume was due to restrictions around ahead of your AGM. If I understand correctly through the delisting process, there may be a few restrictions around your ability to pay dividends or do a buyback until you get the approval from the Irish court. Nicola, I'm going to headline that by saying I don't see any constraints, but I'll ask Matt to just give you a little more color on that. So, to your two questions, I think, first, just on the buyback pace. Yes, we were -- since this is classified as a merger of the actual structure, we were essentially out of the market entirely for most of the month of December. We are back in as our traditional 10b5-1, and then it will open up again to active buybacks in a couple of days. As far as the Irish distributable reserves, which you're referring to on dividends and buybacks, as you know, this is the same process we went through on the original merger between Praxair and Linde AG. Jeff, the impact of the winter storm was primarily on our on-site customers, resulting in customer outages. We were there to support them with whatever nitrogen requirements, et cetera, were there, but the outages were at the customers' end. It is -- David, it's embedded. So, it's an attractive project for us the way it comes together. And you mentioned last quarter about 30 projects you're working on, I think, in the U.S. on the back of the IRA implementation. David, I've mentioned that we have a large number of projects we're working on. And that, despite the $1.8 billion that we've now announced, I still see that $7 billion to $9 billion number as being robust in terms of decisions over the next two to three years. Again, it's going back to the OCI a little bit. You can see that with the infrastructure, the pipelines and everything. Obviously, there's a lot of talk now coming out of Europe, though with a response to the IRA. You don't have the hydrogen pipelines, the same expense and stuff. Just wondering how you see your advantages there, if there is a real risk. So Peter, I'm going to give you the example of Germany and Leuna where we have exactly the -- that we have here in the U.S. Gulf Coast. Well, I think -- yes. I'm saying in Europe, you don't have the same pipeline infrastructure that you have on the Gulf Coast. And I was going to give you an example of Germany and Leuna where we have exactly the same structure, multiple customers, pipeline network, serving refineries and chemical companies in that industrial network. So, that's an example of where we have incumbent strength. So, that's one example where we do have the ability to expand and use that incumbent position that we have as a leverage to win more into that industrial activity and the part that we operate in Leuna in Germany. So, that's an example in Europe. What I'd say also to you is I think the nature of the projects in Europe is going to tend to be quite different, where there will be a complex producing product and then putting it into a pipeline network. And I can also tell you that of the number of projects that I referenced previously in response to David's question, I see a number of those currently being developed in Europe as well. In terms of power cost and natural gas costs, anything that happens in terms of it going up or down gets accounted for in our contractual cost pass-through mechanism. For the rest, the way we recover inflationary impact and the way we manage our business is pricing. And as you know, we've got a 30-year track record now of positive pricing. If other costs go up, we manage that through a pricing mechanism as well. I mean, I think a good indication to see these changes you're looking for are the sequential trends. So, when you look at EMEA sequential trends in this most recent quarter, you can see that, to Sanjiv's point, pass-through is negative 6%. That is the energy pricing, that is the natural gas pricing coming down, yet pricing was up 4%. So, we're still seeing stability in the pricing levels. But of course, we are seeing large reductions in the pass-through as that energy comes in. And then, I'd welcome any thoughts on non-China, Asia as well, taking into account your ExxonMobil project start-up in Singapore. So Kevin, just talking about the APAC business overall, and I'll just walk you through APAC more broadly. I've said to you folks before that there's a target on the back of the Americas business, and APAC and EMEA are moving in that direction to try and bridge that gap. Sales were pretty strong in electronics, in particular, across APAC followed by chemicals energy and then a bit of manufacturing. Ex China, again, electronics, very strong chemicals, engineering, energy and manufacturing also extremely strong, some seasonal impact of LPG business in South Pacific that you would normally expect. We see that level stable, and I'm seeing that in January, the same momentum carrying through. The Chinese New Year, obviously, in January kind of impedes our ability to really see how that recovery is going to come through given the reopening that's been touted now. I think the next couple of weeks, I'm watching carefully to see how that trend shapes up, and that's really going to determine what that long-term view on China is going to be. I said last year that I expect moderated growth out of China, and that's kind of what we've considered in our guidance. And I don't know if any of the OCI ammonia is targeted for export for local disassociation, but I'm more interested in general. Since there are a number of blue ammonia projects underway by companies who don't sell hydrogen and nitrogen and I guess, there could be some extra cargoes that will be available eventually in that market. Let's talk about technology, and then I'll talk a little bit about the commercial side of things. As far as technology is concerned, Linde has some really good technology around backtracking, which is cracking that ammonia back to get -- disassociate and get hydrogen back. And we are, in fact, running pilots as we speak on some new catalysts and some new developments over there to make that a lot more efficient as a process. I feel very good about that particular project that we're running through, and you'll hear more on that in the weeks ahead. The reality is for us to make ammonia blue or green, we put a lot of energy into that process. I don't see -- so for me, direct ammonia usage, either on the fertilizer front or direct as a fuel injection or fuel blending, makes a lot more sense in the near term. As technology changes and improves and as the energy balancing work that we are doing, in fact, in our pilot continues to improve, then it becomes a little more viable longer term. Steve, when a fab has been constructed -- and we're talking about solid contracts with long -- Tier 1 players across the world. And we are actually growing that market both in terms of ramp-ups that are happening on new fab that came up two or three years ago, and we continue to ramp our gases into increasing production that is happening over there. And in addition to that, we also continue to improve some of the molecules that we bring into these fabs given the new technologies that are there. And of course, I'll always add that there is a good strong pricing element to that. And if I could, on the OCI blue ammonia project, the 2025 start-up does seem quite ambitious. So, these projects typically take many months to develop, in some cases, years. So, that's the reason why we are reasonably confident about getting this up and running in 2025 and in commercial production. Having said that, contractually, we always protect ourselves, and we have date certain contracts to ensure that we are -- if we have done the investments and done the construction that we needed to do that we are able to then ensure that our facility fees or facility charges are then paid to us on a date certain basis. We are talking to at least three, if not more, very competent world-class companies that are experts in carbon sequestration. And obviously, you would expect us to do some diligence around their ability to get permits sake, where they stand in that process. Again, we feel good about how they are kind of in terms of readiness to manage the sequestration when it comes to the pipeline. Just sticking with that global end-market trend slide, two aspects of it. And then secondly, the other piece within industrial actually had the worst sequential sales growth. Vince, you're right that we will see that largely lap now. You'll see that green -- the greening up of it, if you like, in the quarters ahead. So, that looks pretty much in -- along the expectations we have for that. As far as the rest is concerned, clearly, we -- there are sequential elements over here that have a range of different things. I'm going to just highlight a couple of them, so I make sure that I cover that. One, we told you that U.S. on-site business saw customer outages due to the winter storm in the U.S. That obviously affected between metals and chemicals and energy. We have -- and again, you've heard this before, but I'll just repeat it. Most on-site customers are back to seasonal run rates, in line with expectations or even slightly above. We mentioned that in our Q1 guidance already, as you might have seen. So, feeling pretty good about where that trend is in terms of the developments out of the Americas that you saw. As far as EMEA, I'll just briefly cover and let you know that from our perspective, there has been lower economic activity across EMEA for the course of this year, has been especially true on the on-site business given the volatility on the energy costs, customers in metals, chemicals and energy, obviously, impacted by that. So, volumes were down versus previous year as far as our on-site business portfolio was concerned. But again, having strong contracts and high-quality customers helps, and you can see that in the EMEA margin, which hit that 25% mark, which was a target that I'd set for them as they moved down that journey to try and bridge the gap to the Americas margin. And given the stability in energy pricing, we're starting to see some volume creeping up slowly as far as that on-site business that I mentioned to you earlier on. But of course, they still remain below previous year levels, and we're just waiting and watching how that all shapes up. Generally, what it represents, clearly, items that wouldn't fit in the categories above it represents a competitor or it would represent distributors that we don't have an actual end market identified. In this particular case, it's the seasonal component of LPG. With the good visibility you have over the next couple of quarters, do you think some of the new projects ramping up will offset slower end-market trends, particularly EMEA, and maybe even the U.S., if things deteriorate from here? Tony, as I said, the volume trends that we were looking at in January look really good. And I mentioned the on- site customers in particular, we're seeing them back at seasonal run rate that I would expect them to be at or slightly above that. More broadly around manufacturing, we're also seeing a snapback after the holiday period, so the seasonal impact. Again, January showed us a good clear path to that in the U.S. as well. In Q4, our packaged goods, if I look at the gases and hard goods, both grew sales double digits, and we are seeing momentum continue into January on that as well. I think decarbonized Linde was $3 billion, decarbonized customers was $10 billion, and then greenfield projects was $20 billion. P.J., let me talk about the hydrogen price quickly and then we can talk about the three buckets and how we look at them. So, as far as hydrogen price is concerned, we've been in the hydrogen business for about 50 years now. So, we've got some long-term experience around hydrogen pricing. In terms of how we think about hydrogen pricing, we look at our projects, the capital that we put on the ground and look at, as I said before, double-digit unlevered post-tax IRRs to make sure that those projects stand on their feet. And obviously, given that we lead the hydrogen market, both in the U.S. and elsewhere in the world, we feel pretty good about being very competitive in terms of what we bring to offer. Now, the hydrogen price development that you're referencing over here is largely going to be that variability is largely going to come on the green side of things, a lot of scale-up needed. Even with the PTC of $3 per kg that might come out of the IRA, I would say to you that the inflection point for green isn't quite there yet. The three buckets that we spoke about, you're right, they are three different buckets. When we have assets on the ground in the U.S. Gulf Coast, as an example, today, when we add capture capability to that and then work with the sequestration partner to put a downhole, there is an existing asset base on to which I'm adding a little more incremental capital and getting the leverage of that installed base that I have. For the rest, whether it's decarbonizing our customers or new markets, we are largely setting up new assets, which will be just as we have in the OCI case, in an ASU plus an ATR plus carbon capture. You put that together, we would then again look for a traditional industrial gas contract structures and return profile where we would expect to have returns commensurate with the risk that we undertake. So, that's how I would kind of say to you that those two buckets would really play out. On the last earnings call, you had a very helpful slide for, I'm sure you remember, it was the IRA and accelerating the U.S. clean energy transition. It seems like you have a lot of projects, $3-plus-billion opportunity, fairly low-hanging fruit. There are about 11 to 13 assets that we have on our list for that, $3 billion spend that we talked about. And really, I expect that in the midterm, we will be looking at decarbonizing that. One, we're seeing conversions and demand buildup of blue hydrogen across our existing network. The second, remember that from a sustainability point of view, we've made a commitment that we will bring absolute reductions to our Scope 1 emissions, which are coming from that installed base of steam methane reformers that we operate in the Gulf Coast. So, we will be tackling that both from a point of creating economic value, but also living up to our sustainability commitments that we made in reducing absolute scope on emissions. In the midterm, you'll see actions on all of that. Devon, thank you, and thanks to everyone, for participating in today's call."
}