{
    "symbol": "SKM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 10:32:04",
    "content": " We are providing consecutive interpretation for the call which will consist of a presentation on fiscal year 2022 earnings highlights, future business plans, and strategic directions as well as the Q&A session. The call is attended by our executives from relevant business divisions including Jin-won Kim, CFO and Head of Corporate Planning of SK Telecom. Against this backdrop, SK Telecom announced the vision of becoming a differentiated AI company in November last year. Consolidated revenue reported KRW17,305 billion, up 3.3% year-on-year and the operating income posted KRW1,612.1 billion, up 16.2% year-on-year. 5G subscriber growth and solid growth of new businesses including B2B business resulted in strong revenue growth, while market stability contributed to improved earnings for 2022. Supported by such solid earnings, we will actively pursue transformation into an AI company that I mentioned earlier and lay a strong foundation for future growth businesses to bear tangible and fruitful results. Based on these efforts, we are securing points of contact with customers, providing innovative services of cost time and space and leading changes in diverse industries, through which we are preparing ourselves to play a key role in the global AI era. Furthermore, we're making investments in and forge partnerships with leading domestic and global AI companies to ensure that everyone can benefit from this era-defining technology of AI. Also, we are making continuous efforts to transform A. into a daily digital mate to first achieve the next Internet gateway of our customers. In addition, incorporating diverse third-party conversation generation models, including the new AI technologies is being considered. Through these activities, we aim to lead the super large AI service market in Korea. 's conversation and service levels by applying long-term memory technology that can remember old information and use it for conversations and multimodal technology that can comprehensively infer and communicate like humans based on multiple data types, such as voice, image, gesture and biosignals in addition to text. Next, with the goal of servicing Korea's first commercial UAM in 2025, SK Telecom is focusing on the UAM business as its key innovative future service to gain leadership in this area. For the success of the pilot program in 2025, a target year for UAM commercialization, we will make earnest efforts to secure differentiated competitiveness, including developing a framework for hyper collaboration with Joby Aviation, a global leader in UAM aircraft with which SK Telecom has formed an exclusive partnership. With global expansion started in November last year ifland recorded 21.27 million cumulative downloads as of the end of 2022 and more than 10% of the total MAU in December came from overseas, an encouraging achievement. Thanks to the increase in the utilization rates of Gasan and Siksa data centers, revenue for 2022 saw more than 30% growth year-over-year. As for the enterprise business, we are supporting our clients' AI transformation using a diverse array of AI technologies and solutions such as robotics and vision AI and reaching out to new customers in the distribution and manufacturing sectors to pursue opportunities for additional growth. Let me now present the performance of the fixed and mobile business, which serve as a foundation for our transformation into an AI company. As of the end of 2022, the number of 5G subscribers reached 13.39 million accounting for more than 50% of the total subscribers, an indication that we now have the 5G mass market. As the share of 5G subscribers is expected to reach 80% by 2025, we will focus on acquiring quality subscribers through AI-based digital transformation, which will drive sustained earnings improvement. On the back of the strong Pay TV subscriber base supported by the synergies between SK Telecom and SK Broadband, efforts to supply a wide range of content including newly released films are expected to result in revenue growth. In addition, three IPTV providers including SK Broadband decided to make joint investments last year in content worth KRW 300 billion for the next three years to compete with global OTT service providers and strengthen content competitiveness. The amount of dividend for 2022 was determined by the Board at KRW 3320 including KRW 2,490 that was already paid out and KRW 830 for Q4. Meanwhile, the Board of SK Broadband resolved to pay cash dividend for 2022 based on outstanding growth of business performance and earnings, which is expected to deliver approximately KRW 150 billion of dividend income to SK Telecom. We project our consolidated revenue to be KRW 17,800 billion up approximately 3% year-on-year supported by overall growth in both new growth businesses and fixed and mobile business through AI-based digital transformation. Please go ahead with your question. So there are some concerns that, there will be a slowdown in the revenue growth trend for MNO business. And as your MNO business takes up a large portion of your earnings, I'd like to know, overall outlook for MNO revenue going forward for 2023. Thank you for your question. As for the dividend payout level for 2023, this is something that is subject to the quarterly performance, as well as the year-end performance of our businesses which is also subject to the discussion and resolution by the Board. However, what I can say is that, as you know, very well SK Telecom has been dedicated to shareholder returns and the size of the shareholder return has never decreased in the past. Moving on to our plans â\u0080\u0093 future plans for share buyback or treasury shares, I would like to say that, SK Telecom has been implementing shareholder return policies on par with global standards. When we take a look at the overall situations in the financial market, we can see that there's still a lot of macroeconomic uncertainty and we're no longer in the low interest rate environment as interest rates have been continuing to increase. But once again, we are now considering various options for shareholder return policies for 2023, including share buybacks, so I cannot give you any definite answer. Moving on to your question on the MNO outlook, as we mentioned, the portion of 5G subscribers has reached more than 50%. However, we still see a lot of potential for growth in the MNO business, because there are more price options available for customers and there's increasing trend from migration from LTE to 5G going forward. So given these various positive factors, we will do our best to maintain the growth trend of MNO business in the future as well. Please go ahead with your question. So regarding this question Mr. Keun-joo Hwang, Head of Integrated Marketing Strategy Office will explain the current market situation and our responses. First of all, I would like to mention that the market share that was mentioned in the media reports include IoT lines and auto control lines as well. And as of the end of December last year, our market share is 42%. To respond to competition from MVNO, we will continue to strengthen services and products that cater to specific needs of our customers and we're going to continue to offer new and additional benefits including subscription that SK Telecom has and we're going to strengthen trending membership benefits for our customers. And your second question regarding ChatGPT, as we all know there has been a flood of news reports on ChatGPT recently and there has been a report that the number of subscribers to ChatGPT has exceeded more than 100 million very quickly. And SK Telecom was able to launch an AI conversation service much faster than ChatGPT, which has been receiving a lot of attention these days. Since the launch of A. in May last year, we have been implementing a total of nine updates in order to identify and offer the necessary services that are demanded by our customers. Furthermore, currently we're in the process of strengthening, not only the services, but also AI technology itself, in order to gain fundamental competitiveness of the A.service. And through partnerships with external partners, we're going to build a relevant ecosystem by using various characters and in collaboration with technology and services. So in line with this A., will continue to add new and meaningful functions based on AI so that A. can become a daily mate for our customers. Next, I would like to invite Mr. Kim Yong Joon  Head of A. conversation to share with you some details about AI technology and conversation technology. In doing so, we will be able to offer differentiated services to our customers, based on a differentiated conversation and AI technology. Please go ahead with your question. And so if we assume that in the future there will be more utilization of GPT and other AI engines and solutions, then it may lead to higher demand for data centers. And also, as you are already using GPT engine for your A., I wonder if it has any specific technical requirements compared to other regular Internet services including any need for a specific server or more CPU. So, we don't have any specific information as to how such utilization of ChatGPT, will lead to demand for our data center services in the short-term or medium or long term. And I also heard from a seminar this morning that ChatGPT will have a direct impact on the business performance of companies like NVIDIA, because it will lead to more demand for CPU. But going forward as we get to use more AI engines and AI services, it is definitely going to increase demand for cloud services, which will have a positive impact on the demand for data centers. So, overall, I can say that there will be increase in the demand for data centers going forward. Now I would like to invite Mr. Kim Yong Joon , Head of A.Conversation to discuss the potential impact of ChatGPT utilization and demand for data centers. And of course in the future if there is growing demand for more computing resources we may need to increase our CapEx, but I would like to say that with more utilization of technology and popularization of such technologies, there will be cost reduction drives in the market which will lead to lower costs for these developments. Please go ahead with your question. When you look at our enterprise business as was in the case of last year, it can be broken down into lease lines, IoT lines, and data center business, and cloud business. So, as for the entire enterprise business, growth has been driven by data center business and cloud business. So, on a quarterly basis, the enterprise business division's revenue was KRW400 billion, which is a 10% growth Y-o-Y. And the -- for the entire year, the enterprise business division revenue is KRW1.5 trillion, which represents 12.5% growth year-over-year. As for the guidance for revenue for enterprise business, we will do our best to make sure that our revenue growth is on par with that of last year. Please go ahead with your question. Thank you for your question. And we will be able to have some more specific ideas about business models, as we have more networks and communications with the ground control centers and securing of further reports. Thank you for your question."
}