{
    "symbol": "OSCR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 22:45:23",
    "content": " In 2023, we expect the majority of our tech resources will be focused on impacting insurance company operating results near-term that means less focus on growing +Oscar platform revenue, that being said, we have continued to develop our first +Oscar standalone module campaign builder, and during this quarter we signed our first campaign builder deal with a South Florida based MSO, which is leveraging the tool to power their value-based care operations, drive primary care utilization and manage medical expense. Full year direct and assumed policy premiums increased 99% to $6.8 billion driven by membership, mix shifts to higher premium plans, rate increases as well as improved lapse rates and higher SEP growth rates in the second half of 2022. Even with our sizable membership growth, our 2022 medical loss ratio improved 360 basis points year-on-year to 85.3%, primarily driven by lower COVID costs, mix and pricing, as well as execution on our total cost of care program. Switching to our admin costs, our InsureCo administrative expense ratio improved 125 basis points year-on-year to 20.6%, driven by operating leverage benefits and admin efficiencies from our enhanced scale, partially offset by higher distribution expenses. Our adjusted admin expense ratio, which includes expenses in our holding company, was 24.6% in 2022, an improvement of 440 basis points year-on-year, primarily due to operating leverage and scale efficiencies. Our expected medical loss ratio range of 82% to 84% reflects over 200 basis points of improvement at the midpoint versus last year, driven by rate increases, mix shifts and total cost of care management programs. Switching to our total co, we projected an adjusted admin expense ratio range of 20.5% to 21.5%, an improvement of 360 basis points year-on-year at the midpoint, largely due to cost savings previously outlined. Our projected adjusted EBITDA loss range of $175 million to $75 million reflects an improvement of $335 million year-on-year at the midpoint, largely driven by improvement in our core underwriting margins as well as meaningfully higher investment income with rising interest rates."
}