{
    "symbol": "OSCR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 23:34:04",
    "content": " Second quarter direct and assumed policy premiums increased 101% year-over-year to $1.7 billion, driven by higher membership and business mix shifts towards higher premium silver plans. Our second quarter 2022 insurance company administrative expense ratio was 19.5%, an improvement of 30 basis points year-over-year, driven by fixed cost leverage and variable cost efficiencies. Our overall combined ratio, which is the sum of our medical loss ratio and the insurance company administrative expense ratio was 101.7% in the quarter, an improvement of 50 basis points year-over-year driven roughly equally by the MLR and the insurance company administrative expense ratio and improvements that I previously mentioned. Our second quarter 2022 adjusted EBITDA loss was $76 million which was $25 million higher year-over-year, but as a percentage of premiums before ceded reinsurance improved by 130 basis points from last year. Your line is open. And then the second factor hitting the quarter was unfavorable 2021 risk adjustment development, to your question, and we think that, that is mainly attributable to market deterioration that happened in the back half of last year, where it looks like that the market got a bit that sicker, really, versus our book, and that's probably really likely related to some SEP growth dynamics. As we think about the Plus Oscar pipeline, I think in the past, you've mentioned about one to two deals a year, but given you're no longer pursuing full service, and pass deals for the next 18 months, but you're also rolling out new SaaS modularization effort. Your line is open. And in many cases, we have a chance of actually launching campaign with implementations that might then lead to follow on implementations, but become bigger and bigger And that's where the full focus is right now, because we just think that, that is a prudent thing to do given how much we grew and most importantly, given that we are really doing here is to use the infrastructure we built in the past 10 years to show an impact on healthcare costs, member experience. Your line is open. I don't think that's -- as I mentioned, a lot more competition on modern day infrastructure out there, and so we can give ourselves the time and pause on these full service implementations for these 18 months to make sure we focus on scaling the business for the  members and the profitability targets and serving existing clients. Your line is open. Your line is open. Your line is open."
}