{
    "symbol": "GLAD",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-07 10:25:31",
    "content": " So, beginning with last quarter's results, originations for the quarter were modest at $11 million for the period, which were all add-on investments to existing portfolio companies. Interest income for the quarter rose 18% to $18.4 million, as the weighted average loan yield rose 110 basis points to 12.3% and the average investment balance rose 6.6% to $589 million. Fee income rose on the period to -- by $900,000 with a number of year-end equity distributions and contributed to the 21% rise in total investment income, which was $19.3 million for the quarter. However, our net interest margin also rose $1.9 million or 17% to a record $13.4 million for the quarter. However, net management fees rose by $1.2 million to $4.6 million or 2.9% of assets, as new deal closing fee credits were down and incentive fees associated with the increase in investment yields rose compared to the prior quarter. Notable portfolio exits for the period included the sale of a couple of equity investments in Targus and Leeds Novamark Capital, which generated realized gains of $10.3 million, and the repayment of R2i, which is a highly leveraged credit, and contributed to the 35% drop in PIK income for the quarter. With our floating rate investments exceeding our floating rate liabilities by approximately $425 million and the current floating rates on pace to be up at least 70 basis points for the quarter, we would expect our net interest margin to be up in the range of $750,000 this quarter. During the December quarter, total interest income rose $2.8 million or 18% to $18.4 million based on the increase in prevailing floating rates and increase in earning assets. The investment portfolio weighted average balance increased to $590 million, which was up $37 million or 6.7% compared to the prior quarter. Total expenses rose by $2.1 million quarter-over-quarter, as interest expenses rose $900,000 and higher net management fees rose by $1.2 million with higher average assets, increased investment yields and reduced new deal closing fee credits. Net investment income for the quarter ended December 31 was $8.7 million, which was an increase of $1.2 million compared to the prior quarter or $0.25 per share, which exceeds the $0.21 per share dividends paid and supported the increase to $0.225 per quarter announced in January. The net increase in net assets resulting from operations was $5.7 million or $0.16 per share for the quarter ended December 31, as impacted by the realized and unrealized valuation depreciation covered by Bob earlier. As of December 31, net assets rose by $8.8 million from the prior quarter-end with the realized and unrealized valuation depreciation, which was more than offset by net proceeds from our common share issuance under the ATM program of $10.5 million."
}