{
    "symbol": "CNS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 16:00:03",
    "content": " Sub-advisory, excluding Japan, had net outflows of $90 million as a new $131 million global real estate mandate in the Middle East was more than offset by outflows from a number of clients who rebalanced their portfolios. Open-end funds had net outflows of $244 million during the quarter, with inflows into multi-strategy real estate assets and U.S. real estate being more than offset by outflows from preferred securities. Today, I'd like to briefly cover 3 areas: first, our performance scorecard; second, the current environment and how our major asset classes are performing; last, I wanted to provide our perspective as to why we think our combined listed and private real estate investment platform will present such a unique and alpha-generating offering for investors. As I discussed last quarter, over the next 3 to 5 years, we believe listed infrastructure will see a significant increase in strategic allocations: first, because it provides a really good balance of income, fundamental stability and inflation sensitivity; and second, because over time, more investors should recognize listed infrastructure as an efficient and equally effective means to access the asset class versus private infrastructure. Our investment agility is likewise notable in light of our size, as illustrated by our market share in open-end funds of 36% in U.S. real estate, 13% in global real estate and 45% in preferred securities. Our other U.S. REIT fund, Cohen & Steers Real Estate Securities Fund saw $558 million in inflows, its second highest in history, a portion of which was from a model allocation. Unfortunately, withdrawals from opportunistic real estate allocations that were added during the pandemic by existing clients, together with a withdrawal by 1 client that had been using listed real estate to stay temporarily invested while waiting for private capital calls, contributed to net outflows. As John articulated, we see an opportunity to advise clients on real estate portfolio optimization and expand our market share with advisers in the wealth channel, who don't currently use both listed and private real estate in a complementary fashion. If you look today, the market share of private real estate allocations has gone from 10% to 35% over the past 3 years."
}