{
    "symbol": "HES",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 13:23:08",
    "content": " Based upon a flat Brent oil price of $65 per barrel, our cash flow is forecast to increase by approximately 25% annually between 2021 and 2026, more than twice as fast as our top line growth. With the successful start-up in February of the Liza Phase 2 oil development offshore Guyana, which at capacity will add $1 billion of net operating cash flow annually at a $65 Brent oil price. The Liza Phase 2 development, which achieved first oil in February, is ramping up ahead of schedule and expected to reach its gross production capacity of approximately 220,000 barrels of oil per day by the third quarter. The project will develop an estimated resource base of approximately 925 million barrels of oil and have a gross production capacity of approximately 250,000 barrels of oil per day, with first oil expected in 2025. Given the strength of the oil market and the world's need for more oil supply, we will give serious consideration to adding a fourth rig later this year, which would accelerate our production ramp-up to approximately 200,000 net barrels of oil equivalent per day, a level which will maximize free cash flow generation, lower our unit cash costs and optimize our infrastructure. Current production on the Liza Destiny FPSO is 130,000 barrels of oil per day, ahead of its original base nameplate capacity and is expected to increase to more than 140,000 gross barrels of oil per day over the course of this quarter. In the first quarter, company-wide net production averaged 276,000 barrels of oil equivalent per day, excluding Libya, which was above the high end of our revised guidance range of 270,000 to 275,000 barrels of oil equivalent per day that we provided in March. For the second quarter, we forecast that company-wide net production will average approximately 310,000 barrels of oil equivalent per day, which is 12% above last quarter. For the full year 2022, we now forecast our company-wide net production to be at the low end of our 325,000 to 330,000 barrels of oil equivalent per day guidance range due to the previously mentioned weather impacts in the Bakken in April. In the Bakken, net production in the first quarter averaged 152,000 barrels of oil equivalent per day compared to our revised guidance of 150,000 barrels of oil equivalent per day. For the second quarter, we forecast that Bakken net production will average between 140,000 and 145,000 barrels of oil equivalent per day and that our full year 2022 net Bakken production will be near the bottom of our previous guidance range of 160,000 to 165,000 barrels of oil equivalent per day, again reflecting the severe weather impacts. Net production in the Bakken, however, is expected to build in the second half of the year, reaching 175,000 to 180,000 barrels of oil equivalent per day in the fourth quarter, with more wells online and improving weather conditions. And for the full year 2022, we forecast net production to average between 30,000 and 35,000 barrels of oil equivalent per day, reflecting the addition of the Shell-operated Llano 6 well in which Hess has a 50% working interest late third quarter. The well will spud in May by Shell and will be tied back to Shell's Auger platform, with gross production from the well expected to build to a plateau rate of between 10,000 and 15,000 barrels of oil equivalent per day by the end of the year. Second quarter and full year 2022 net production are forecast to average approximately 65,000 barrels of oil equivalent per day. As a result of the Liza Phase 1 optimization work and the continued ramp-up of Liza Phase 2, we forecast second quarter net production from Guyana to average between 70,000 and 75,000 barrels of oil per day and to increase to 85,000 to 90,000 barrels of oil per day in the fourth quarter. Changes in operating assets and liabilities during the first quarter of 2022 decreased cash flow from operating activities by $1.1 billion, reflecting payments made for previously accrued Libyan income tax and royalties of approximately $470 million for the period December 2020 through November 2021, premiums paid of $325 million to remove the ceiling price on outstanding WTI and Brent crude oil collars effective April 1, 2022, and an increase in accounts receivable due to higher crude oil prices. Our E&P cash costs were $13.79 per barrel of oil equivalent, including Libya, and $14.54 per barrel of oil equivalent, excluding Libya, in the first quarter of 2022. We project E&P cash costs, excluding Libya, to be in the range of $15 to $15.50 per barrel of oil equivalent for the second quarter, reflecting planned maintenance and workover spend in the Gulf of Mexico and North Dakota and higher price-driven production taxes. For the full year, cash costs, excluding Libya, are expected to be in the range of $13.50 to $14 per barrel of oil equivalent compared with prior guidance of $12.50 to $13 per barrel of oil equivalent, primarily due to the impact of price-driven production taxes and the expectation production comes in at the low end of our full year production guidance. DD&A expense, excluding Libya, is forecast to be in the range of $12 to $12.50 per barrel of oil equivalent for the second quarter and full year guidance of $11.50 to $12.50 per barrel of oil equivalent is unchanged. This results in projected total E&P unit operating costs, excluding Libya, to be in the range of $27 to $28 per barrel of oil equivalent for the second quarter, and $25 to $26.50 per barrel of oil equivalent for the full year 2022. E&P income tax expense, excluding Libya, is expected to be in the range of $135 million to $140 million for the second quarter and $460 million to $470 million for the full year, which is up from previous guidance of $300 million to $310 million due to higher commodity prices. We expect noncash option premium amortization, which will be reflected in our realized selling prices, will be approximately $165 million for the second quarter and approximately $550 million for the full year, inclusive of the additional premiums paid to remove the previous ceiling price on outstanding crude oil hedging contracts for the remainder of this year."
}