{
    "symbol": "HES",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 14:22:06",
    "content": " As we look to the second half of the year, we expect global oil demand to increase by 1 million to 1.5 million barrels per day as a result of China's economy reopening after COVID lockdowns and increasing air travel. In terms of global oil supply, while shale producers have enabled the U.S. to grow oil production by approximately 1 million barrels per day over the year -- in the last year, there is very little spare capacity left in the world. Based upon a flat Brent oil price of $65 per barrel, our cash flow is forecast to increase by approximately 25% annually between 2021 and 2026, more than twice as fast as our top line growth. Given our strong cash flow growth, we commenced a share repurchase program during the second quarter, repurchasing approximately 1.8 million shares of common stock for $190 million under our existing $650 million board authorization and we intend to opportunistically repurchase the remaining amount by year-end. On the Stabroek Block in Guyana, where Hess has a 30% interest and ExxonMobil is the operator, we continue to see the potential for at least 6 floating production storage and offloading vessels, or FPSOs, in 2027 with a gross production capacity of more than 1 million barrels of oil per day and up to 10 FPSOs to develop the discovered resources on the block. In terms of our sanctioned oil developments, production at the Liza Phase 1 development has reached its new production capacity of more than 140,000 gross barrels of oil per day in the second quarter following production optimization work on Liza Destiny FPSO. Our third development on the Stabroek Block at the Payara field with a gross production capacity of approximately 220,000 barrels of oil per day is on track for start-up in late 2023. The project will develop an estimated recoverable resource base of approximately 925 million barrels of oil and have a gross production capacity of approximately 250,000 barrels of oil per day with first oil expected in 2025. Given the strength of the oil market and the world's need for more oil supply, we added a fourth rig earlier this month, which will allow us to achieve net production of approximately 200,000 barrels of oil equivalent per day in 2024, a level which will maximize free cash flow generation, lower our unit cash cost and optimize our infrastructure. In the second quarter, company-wide net production averaged 303,000 barrels of oil equivalent per day, excluding Libya. In the third quarter, we expect company-wide net production to increase by approximately 10% from the second quarter and to average between 330,000 and 335,000 barrels of oil equivalent per day, excluding Libya. In the fourth quarter, company-wide net production is expected to further increase to between 365,000 and 370,000 barrels of oil equivalent per day, excluding Libya. For the full year 2022, we now forecast net production to average approximately 320,000 barrels of oil equivalent per day, excluding Libya. Second quarter net production averaged 140,000 barrels of oil equivalent per day. Production is now recovering and is expected to increase to between 155,000 and 160,000 barrels of oil equivalent per day in the third quarter. For the fourth quarter, we forecast net production to further increase to between 160,000 and 165,000 barrels of oil equivalent per day. For the full year 2022, we now forecast Bakken net production to average between 150,000 and 155,000 barrels of oil equivalent per day. Moving to a 4-rig program will allow us to grow net production to approximately 200,000 barrels of oil equivalent per day in 2024, which will optimize our in-basin infrastructure and drive further reductions in our unit cash costs. In the deepwater Gulf of Mexico, second quarter net production averaged 29,000 barrels of oil equivalent per day compared to our guidance of approximately 30,000 barrels of oil equivalent per day. In the third quarter, we forecast Gulf of Mexico net production to average between 25,000 and 35,000 barrels of oil equivalent per day reflecting planned downtime at Tubular Bells and a Penn State Well being shut in due to a mechanical issue. For the full year 2022, our forecast for Gulf of Mexico net production is now approximately 30,000 barrels of oil equivalent per day. In Southeast Asia, net production in the second quarter was 67,000 barrels of oil equivalent per day compared to our guidance of approximately 65,000 barrels of oil equivalent per day. Third quarter net production is forecast to average approximately 55,000 barrels of oil equivalent per day, reflecting planned maintenance at both JDA and North Malay Basin. Full year 2022 production is expected to average between 60,000 and 65,000 barrels of oil equivalent per day. In the second quarter, net production averaged 67,000 barrels of oil per day, reflecting a modest delay in the ramp-up of Liza Phase 2. For Liza Phase 1 production optimization work was completed in the second quarter, and the FPSO is now operating at or above its new gross production capacity of 140,000 barrels of oil per day. Third quarter net production from Guyana is forecast to increase to a range of 90,000 to 95,000 barrels of oil per day and average approximately 75,000 barrels of oil per day for the full year 2022. In April, we sanctioned a fourth development at the Yellowtail, which will develop approximately 925 million barrels of oil and have a breakeven Brent oil price of approximately $29 per barrel. Our third quarter Guyana net production guidance of 90,000 to 95,000 barrels of oil per day includes approximately 7,000 barrels of oil per day of tax barrels. Our full year 2022 Guyana net production guidance of approximately 75,000 barrels of oil per day includes approximately 6,000 barrels of oil per day of tax barrels. Our E&P cash costs in the second quarter of 2022 were $13.90 per barrel of oil equivalent, including Libya, and $14.56 per barrel of oil equivalent, excluding Libya. We project E&P cash costs, excluding Libya, to be in the range of $14 to $14.50 per barrel of oil equivalent for the third quarter and in the range of $13.50 to $14 per barrel of oil equivalent for the full year, which is unchanged from previous guidance. DD&A expense, excluding Libya, is forecast to be in the range of $13 to $13.50 per barrel of oil equivalent for the third quarter and $12.50 to $13 per barrel of oil equivalent for the full year, which is updated from the prior guidance of $11.50 to $12.50 per barrel of oil equivalent. This results in projected total E&P unit operating costs, excluding Libya, to be in the range of $27 to $28 per barrel of oil equivalent for the third quarter and $26 to $27 per barrel of oil equivalent for the full year 2022. E&P income tax, excluding Libya, is expected to be in the range of $170 million to $180 million for the third quarter and in the range of $540 million to $550 million for the full year, which is up from the previous guidance range of $460 million to $470 million, primarily due to higher commodity prices."
}