{
    "symbol": "RGS",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-01 10:57:02",
    "content": " In the last two quarters, we have reported adjusted EBITDA of $12 million, which is a testament to the progress made by the Regis team and our franchisees. Coming out of fiscal 2021, we utilized 2022 as a year to stabilize Regis through the winding down of our legacy businesses, streamlining our G&A, selling our technology platform and amending and extending our credit agreement while simultaneously aligning on a go-forward strategy with our franchisees to drive our business forward, all of which required a tremendous amount of work and execution and that work continues to come through in our results. Adjusted Q2 '23 EBITDA on a consolidated basis was $8 million compared to $3 million in the prior year's quarter, a $5 million improvement. Operating income on a year-to-date basis has improved by almost $9 million versus the prior year at $3 for the six months ended December 31, 2022, versus a loss of $5 million during the prior year period. Staying with the theme of expectations and no surprises, given the timing of certain expenses such as the Supercuts education event that took place in January, as well as the seasonality of sales, we expect the next few quarters to come in below Q1, '23 adjusted EBITDA, which still represents continued year-over-year improvement. On an adjusted basis, second quarter consolidated adjusted EBITDA was $8 million compared to $3 million in the prior year's quarter. The $5 million improvement was driven by our lower G&A which included a $600,000 positive actuarial insurance adjustment, the wind down of loss-generating company-owned salons and a $1.1 million grant from the State of North Carolina related to COVID-19 relief. Our core franchise business achieved adjusted EBITDA of $8 million in the quarter, a $2 million improvement compared to $6 million in the prior year quarter. On an adjusted EBITDA basis, our company-owned segment was just above breakeven for the quarter and improved $3 million from the second quarter last year. For the first half of fiscal 2023, revenues were $122 million compared to $146 million in the first half of fiscal year 2022, similar to the second quarter revenue decline, this decline was expected and relates primarily to a reduction in franchise rental income and the wind down of our corporate-owned salons, as well lower product sales to franchisees. Even with the planned strategic spend in the back half of fiscal year 2023, we are now reducing our G&A outlook further and expect G&A to normalize between $54 million and $57 million annually with fiscal '23 trending towards the low end of that range."
}