{
    "symbol": "YY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 22:45:06",
    "content": " 2022 marked a year of uncertainty of multinational companies as we continue to be impacted by macro economy  headwinds, the combination of post-COVID normalization, high inflation and the strong US dollar created downward pressure on our users' online payment, spending and top line growth, despite these short-term challenges, we've taken actions to focus on the contribution of our user community, improved content quality, keeping engagement on our various products and pursue sustainable, high-quality growth. Second, we witness accelerating in user growth of Bigo Live as its MAU grew by 40.3% year-over-year in the fourth quarter of 2022, up from 11.9% in the last year. In the fourth quarter, Bigo Live's obtained its strong user growth trajectory, thanks to effective logins and increase the user acquisition efficiency during the quarter, Bigo Live's MAUs increased by 18.3% year-over-year to 36.8 million notably MAUs in Southeast Asia and other emerging markets increased 21.6% year-over-year. In 2023, in argument with our strategy of Likee, we intended to further enhance Hago's monetization efficiency, while maintaining our efforts to achieve consistent profitability at the product level Hago is going to optimize its futures throughout its users socializing patterns and better facilitate user interactions, such as we expect to further improve Hago user retention and organic growth capabilities, which are crucial gradual stabilization and eventual recovery of user growth over time. Our total net revenues following the quarter was US$604.9 million compared to US$663.7 million in the same period of 2020, primarily due to macroeconomic uncertainties and unfavorable exchange rates, which negatively affect paying user sentiment. Non-GAAP net income margin for the full year of 2022 was 8.3%, up from 4.2% in 2021, notably BIGO's non-GAAP net income expanded to $288 million in 2022 with its non-GAAP net income margin improved to 14.4% from 7.8% in the prior year."
}