{
    "symbol": "YY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-30 00:02:05",
    "content": " As a result of macroeconomic uncertainties and the seasonality during two Ramadan holiday in the Middle East, Bigo Live's live streaming revenue and the number of paying users declined during the second quarter. Our total net revenues for the second quarter was US$596.1 million, compared to US$661.7 million in the same period of 2021, primarily due to macroeconomic uncertainties and unfavorable exchange rates, which negatively affects paying user and average. Revenue sharing fees and content costs was US$247 million in the second quarter compared with US$289.1 million in the same period of 2021, primarily due to optimization of revenue sharing costs, bandwidth costs decreased to US$20 million from US$27.5 million in the same period of 2021, primarily due to the company's improved efficiency in bandwidth usage. Gross profit increased to US$218.4 million in the second quarter, with our gross margin improved to 36.6% from 30.7% in the same period of 2021. Our GAAP operating income for the second quarter was US$38.7 million, compared to operating loss of US$101.1 million in the same period of 2021 Operating income margin for the second quarter was 6.5% compared to operating loss margin of 15.3% in the same period of 2021. Our non-GAAP operating income for the second quarter, which excludes share-based compensation expenses, amortization of intangible assets from business acquisitions as well as impairment of goodwill and investments and gain on disposal of subsidiaries and business, was US$59.9 million in this quarter, compared to non-GAAP operating loss of US$30 million in the same period of 2021. GAAP net income from continuing operations attributable to controlling interest of JOYY in the second quarter of 2022 was US$18.7 million, compared to net loss of US$109.3 million in the same period of 2021. Non-GAAP net income from continuing operations attributable to controlling interest of JOYY in the second quarter was US$51.5 million, compared to non-GAAP net loss of US$0.5 million in the same period of 2021. Notably, BIGO's non-GAAP net income expanded to $86.3 million in the second quarter, with its non-GAAP net income margin improved to 17.2% from 3.3% in the prior year period."
}