{
    "symbol": "AER",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 12:29:05",
    "content": "  Operator: Good day, and welcome to AerCap's First Quarter 2022 Financial Results. Before we begin today's call, I would like to remind you that some statements made during this conference call, which are not historical facts, may be forward-looking statements. Further information concerning issues that could materially affect performance can be found in AerCap's earnings release, dated May 17, 2022. Good morning, everyone, and thank you for joining us for our first quarter 2022 earnings call. First, for the impact of Russia, this was a strong underlying quarter for the company, and I'm pleased to report $2.23 of adjusted earnings for the period. Across all our business lines; aircraft, engines, cargo and helicopters, we are seeing improving demand, increased utilization of our assets and the improving financial health of our customers. There has been a strong rebound in traffic on a global scale, as an ever-increasing number of countries removed the last of the COVID-related travel restrictions and welcome foreign travelers once again. The favorable environment created by these various dynamics, coupled with the proven resilience of the AerCap business model sets us up for a strong year ahead. In addition, we are seeing similar trends in Southeast Asia today to the ones we saw in the U.S. and Europe as those markets recovered. Second, we also see strengthening demand for aircraft sales as the effects of COVID-19 begin to ease off in most parts of the world. Investors are very interested in owning physical assets as a way to provide protection in a higher inflationary environment, supporting both aircraft and engine values. Excluding the impact of a charge we have taken as a result of the war in the Ukraine, for FY 2022, we expect to generate between $6.50 and $7.00 of adjusted EPS, as well as approximately $5 billion of operating cash flow. Without doubt, the GECAS acquisition has made AerCap a stronger, more diversified and profitable business, and earnings are significantly ahead of where we expect the AerCap business to be on a standalone basis. As you will see from the chart, the demand side of the industry continues to improve with global flight traffic back to 75% of 2019 levels as of May 22, with North America leading the charge at 24,000 daily flights. A very visible example of this is that Ryanair carried 1 million passengers in April 2021, but last month, April 2022, they carried 14.2 million passengers, a 14x increase. China is the only major market where significant restrictions remain, but as we have seen over the past two years, they tend to shut down and reopen very quickly. In just one example, Changi Airport in Singapore saw traffic return to 40% of 2019 levels, from just 15% in three months as a result of this easing, and we are seeing similar results elsewhere, with Asia-Pacific ex-China traffic back to 70% of 2019 levels, or 16,000 daily flights. The conversations I have with the CEOs of airlines in Southeast Asia have been far more upbeat since April 1, as they are seeing bookings surge from where they were Just a couple of months ago. Firstly, from Slide 5 you can see that the overall level of new aircraft supply remains well below the run rate of 2018, the year before the 737 MAX was grounded. In 2018, there were just over 1,600 new aircraft deliveries from Boeing and Airbus, and using that as a benchmark 1,900 fewer aircraft have been delivered since then. For 2022, Airbus has set a target of 720 aircraft deliveries and Boeing has set a target of 500, which is unlikely to be hit. But even if they do, that's still amounts to 400 fewer aircraft per annum being delivered each year. Whilst it's at times frustrating to see the delays on the 737, 787 and A320neo family aircraft for a variety of issues, it does help with the demand for our other products. Turning to widebody supply, as you're aware, Boeing has not delivered any 787s for the last 15 months. Similarly, Airbus are also supply-constrained as A320neo production is unlikely to go above three a month for several years to come due to supplier constraints and a significant number of widebody aircraft have been retired during the pandemic. In contrast, widebody demand is starting to come back, led by the 787, just two weeks ago with three airlines looking for three 787-8s. Importantly, because Asia has been close to international travel for the last year, the European majors have put a lot of their widebody fleet that normally flies to Asia on the North Atlantic. Since the closing of the GECAS acquisition, we've been in negotiations with Boeing regarding a legacy GECAS order for up to 68 737 MAX aircraft, over which GECAS had a cancellation rights that AerCap could exercise. In light of the favorable macro supply-demand dynamics that I just discussed, the recovery in demand that we see in particular for the 737 MAX family and the attractive terms that we were able to agree with Boeing, I am pleased to report that we will not exercise our cancellation rights and we look forward to taking delivery of these aircraft in the years ahead. Turning back to AerCap, the business units are all performing well with a variety of catalysts across the Group. On the engine side, our 100% owned engine leasing business is comprised of engines from all manufacturers with a concentration of General Electric and CFMI engines. To put this in context, for the week ending Friday, May 13, the global GE and CFMI engine fleet was operating at 80% of 2019 levels despite China being effectively grounded last week. The long-term product provides permanent power to the airline and can be for terms of up to 12 years, similar to aircraft leases. Short-term leases are used to get airlines through shop visits peaks or acute events, which helps to keep the aircraft operating and generating revenue. With more aircraft coming out of storage, we expect to see an increase in shop visits in preparation for re-entry into service. In cargo, the demand environment also remains strong as the boom in e-commerce continues to have a positive impact. Whilst this is helpful for overall demand, it has also helped to expand the types of customers that are willing to enter into longer-term lease agreements. For example, we are now seeing retail businesses, such as Inditex, the owner of Zara, taking their own cargo aircraft to vertically integrate their operations to reach the consumer directly. The cargo business should also be helped by the elimination of freighter capacity from the market in Europe in July 2022, following similar moves from the U.S. and China at the end of 2021. Clear evidence of the demand for our cargo business is that we launched the 777 conversion program with 15 firm commitments and 15 options, for a total of up to 30 777 freighters. We already have 16 777s under contract or LOI, equating to $1.5 billion in rental commitments, and this is even before the first aircraft delivers from the conversion program. Then in our helicopter business, leasing activity remains elevated in a way that hasn't been seen for many years. To give an example, we leased six times more helicopters in the first four months of this year than we did in the same period last year. So to wrap up, I just want to emphasize that over the last two years AerCap has had to deal with extraordinary events. The events in Russia, although undoubtedly a setback, are manageable as a result of the way we've consistently run our business, the strength of the recovery in the Rest of the World and the power of the combined company. For the first quarter, our adjusted net income was $540 million, or $2.23 per share. Prior to the Russian invasion of Ukraine and the imposition of sanctions, AerCap had 135 owned aircraft and 14 owned engines on lease to Russian Airlines. The net carrying value of these assets on our balance sheet was approximately $3.1 billion as of December 31, 2021. These include, for example, maintenance rights assets, lease premium assets, security deposits and maintenance reserves. In contrast to our aircraft remaining in Russia, most of these were older aircraft that on their last lease. As a result, our net charges related to the Ukraine conflict were approximately $2.7 billion or approximately $2.4 billion after tax. Excluding the charges related to the Ukraine conflict, our net income for the first quarter was $387 million or $1.60 per share. Excluding this amount, and a small amount of transaction and integration-related expenses in the quarter, our first quarter net income was $540 million or $2.23 after-tax. Basic lease rents were $1,554 million for the quarter. During the quarter, our cash collections rate exceeded 100% because in addition to the regular rent and maintenance payments for the quarter, we also received repayments of deferral balances. Our combined accounts receivable and deferral notes receivable decreased during the first quarter by $63 million or 8%, from $768 million as of December 31, to $705 million as of March 31. As I mentioned on last quarter's earnings call, a lease premium asset is amortized over the remaining term of the lease and reduces basic lease rents. Leasing expenses were $208 million during the quarter, including $50 million of maintenance rights amortization expenses. So when you add the $57 million of lease premium amortization, the $51 million of maintenance rights amortization and the $50 million of maintenance rights amortization range with leasing expenses, you got the total of $158 million of purchase accounting adjustments that I mentioned in the walk on the previous slide. SG&A for the first quarter was $97 million, which is in line with the $150 million of annual target expense savings that we had for the GECAS transaction. As of March 31, our total sources of liquidity were approximately $17 billion, which resulted in a next 12 months sources-to-uses coverage ratio of 2.1 times. On the fourth quarter earnings call, I mentioned that our leverage ratio would likely go up as a result of the impairment of aircraft remaining in Russia, and estimated that it could go up to around 3:1 debt to equity. We actually ended the first quarter at 2.9 times debt to equity, so a little better than expected. As I mentioned earlier, our cash collections during the quarter were strong and our operating cash flow was $1.3 billion. Our secured debt to total assets ratio was approximately 15%, the same as last quarter and our average cost of debt for the first quarter was 3%. For the full year 2022, we expect to generate adjusted earnings per share of $6.50 to $7. Adjusted GAAP income reflects the add-back of non-cash maintenance rights and lease premium amortization, as well as transaction-related expenses. As many of you will recall, we also reported adjusted earnings after the ILFC transaction in 2014 for the same reasons. The combined total of these maintenance rights and lease premium assets is approximately $3.9 billion, the vast majority of which will amortize over the next seven years. For this year, we expect it to be around $700 million of amortization in total. In 2022, we expect to generate total revenues of approximately $6.9 billion. We expect our interest expense for the year to be approximately $1.6 billion, which reflects an average cost of debt of around 3%. We've assumed an effective tax rate of around 13% and we expect to have approximately $50 million of earnings from our equity method investments, primarily, our investment in our engine leasing joint venture, SES. That gives us net income of approximately $1.6 billion on an adjusted basis, or EPS of $6.50 to $7 for the full year. So there is some offset from an expense standpoint, but overall on a net basis, the impact of the Russian assets is around $200 million for the remainder of this year. While we've seen a strong recovery in terms of passenger demand and cash collections, nonetheless, we will continue to see an impact from lower revenues associated with leases that were restructured during COVID, either as a result of airline bankruptcies or out-of-court restructurings. Secondly, GECAS business overall was less affected by COVID than the legacy AerCap business, basically due to the composition of the portfolio. And third, we put in place $24 billion of financing for the GECAS acquisition at an average cost of debt of 2.6% which was well below our average cost on a standalone basis of 3.8%. Overall, these results are well above what AerCap would have done on a standalone basis for this year. As we've mentioned, we've submitted insurance claims for $3.5 billion related to our assets remaining in Russia. As a result of the write-off of our assets in connection with the Ukraine conflict, our debt-to-equity ratio increased to 2.9 times at the end of the first quarter. In addition, going forward, based on our contracted CapEx and assuming sales of approximately $2 billion a year, we would expect to delever to 2.5 times by the end of 2023 and 2.3 times by the end of 2024 before taking into account any additional capital deployment or return of capital to shareholders. So, bringing this all together, we expect to start generating excess capital by the end of this year and will be well positioned to start returning capital to shareholders. Between now and 2024, we expect to generate approximately $2 billion of excess capital. Of course, if we exceed our projections for either earnings or aircraft sales or if we've received insurance recoveries during this time, the amount of excess capital could be materially greater. Hi, thanks for taking my questions. So back in March of last year, there was obviously a lot of uncertainty generally, but we estimated at the time that aircraft would probably generate somewhere in the low 4s in terms of EPS for 2022 and that's of course before the impact of Russia, which probably would have brought it down to the low 3s. And I think I would also point out that when we look at 2022 in the numbers here, the projections we've given, we are still facing headwinds. And secondly, you had $3 million of gain on sale in Q1. So, the gain on sale was definitely lower in the first quarter, and the main driver of that is there were sales of around $800 million worth of legacy GECAS aircraft that were pending when the acquisition closed in November. And these were aircraft that GECAS had contracted to sell, but the sales hadn't closed yet when we did the acquisition. The average gain on those sales was over 10%, but in purchase accounting, we had to mark those assets at the sale price, which is the price that the buyer is paying us. For the first quarter, those would have been around $20 million higher. For instance, we would have had $20 million more gains if we didn't have that purchase accounting effect. Basically, we haven't assumed much in terms of gains on sale in this forecast, but we would expect on the other assets that weren't contracted before the acquisition, we would expect to have healthy gains as we have in the past. I believe in it -- obviously, highlight some of the same data that Mark and I have been harping on in a big part of Mark's presentation in Dublin last week, essentially the looming shortage. Again, I'm just thinking about how the shortage is going to manifest in terms of lease rates. And what you're seeing here is on the widebody side it hasn't been in focus because people have been so focused on the recovery in the narrowbody market has obviously led our way out of COVID, but now we are beginning to see it in the widebody side. Like in the narrowbody side, it's being led by the best asset in the class, which is the Boeing 787 and we are seeing a significant uptick relative to where we were on that aircraft type. Now we are seeing it, first, because we're the biggest in the world out there and we see a lot of activity. The airlines are just starting to realize it that there is a coming squeeze on widebody capacity following -- we all know what the issues are in the 787, but Airbus also have their supply limitations as well. So what will happen as our widebodies come up to 787s, 330neos, we're certainly endeavoring to push rentals up as they come up for reset, be that on extension or off a new order. Well, of course, we maintain dialog with our existing customers, and as you've seen, we've been able to get 20-plus aircraft out of Russia and we continue to work with them wherever there is an opportunity to mitigate our risk there. So 15% in the first quarter of last year, down to 12% this quarter. So, Helane, I would think about it as roughly 13% to 14% for the full year. This quarter is a little different just because you had the large loss which impacts it, but I'd say kind of on an adjusted basis, 13% to 14% is a good number to use. And then the other question I had was, I just listened to -- I don't know if it's Pete or Gus, , but I just listened to a presentation that United talking about the demand they are seeing in Southeast Asia, which I think you just mentioned as well. Strong demand, wanting more widebody aircraft especially because their 777s are slow in returning. Look, the second part of your question, for any of the new widebody placements we're doing, they are tracking interest rates. With regard to obtaining new aircraft, we obviously have a very significant order book. And as I mentioned in the call, in my prepared comments, given the demand we are seeing for the MAX and the resurgence in demand for the MAX, also the strengthening of the lease rental in the MAX where I say now the MAX 8 is on a par with the 320neo in terms of its lease rentals. Hi, thanks for taking my questions. So $6.50 to $7 adjusted EPS, a good number. I guess, first question, when comparing to the first quarter adjusted EPS of $2.23, if you were to run rate that that would imply over $8 of EPS. Or alternatively, if there may be some one-time expenses or something over the course of 2022, which would have rolled off in 2023, I think you spoke about, for example, the cost of reactivating the fleet. So, look, I mean the main thing that won't be -- that we got in the first quarter that we won't be getting in subsequent quarters is the revenue from the Russian leases, right, because those have been terminated. And so that -- during the first quarter, we were receiving that rent revenue, but that comes out of this forecast for the subsequent quarter. You're right that we will have some higher leasing expenses come through just as we're getting aircraft moved, reactivated et cetera. And then in terms of one-time items for the first quarter, I guess the only one that I would note is we did have a one-time mark-to-market gain on interest rate caps, which was $36 million pre-tax. Now, obviously, could get those during the rest of the year but I wouldn't count on it. Yes, when I did the math of Russia that's about $0.70 for the rest of the year. It's just a very small amount of gains that we've assumed, Vincent, because really mainly because of that -- well, for two things. One, because of the GECAS thing that I mentioned in response to Ross' question, but also, as I think you know, just historically we haven't assumed significant gains on sale in our forecast. That's really just I think down to some conservatism on our part, not due to any market things that we're seeing. Pete, maybe following up on that question about aircraft sales, you mentioned kind of going from 2.9 to 2.7 in leverage in the nine months. And indeed, we put a portfolio of assets into the market for sale just two weeks ago in anticipation of the large Air Finance conference that was held here in Dublin last week, where there was a positive tone. And I think having said all that, though, it is worth reiterating the extraordinary challenges that the business has had to face over the last two-plus years and to be in a position where after all of that, at the end of this year that we expect to be at 2.7:1 is a testament to the resilience of the AerCap business model and the strength of the cash flows we generate. Pete, maybe just kind of on a more mundane level, the $158 million of charges, roughly two-thirds coming out of revenue and a third out of expenses, could you just remind us -- I know that some of them are difficult to determine the scheduling, but if we were to think about it like you mentioned how much we would likely to see for 2022, any sense as to -- can you give us a sense as to the likely step-down in 2023? 2023, Moshe, I think it's probably going to be roughly a similar number, maybe $600 million to $700 million. I mean, as you know, these tend to be lumpy, right, because they're based on maintenance events, basically, in shop visits and that type of thing. So I saw you still have some aircraft availability open for next year, 92% placed through 2023. All the 2022 aircraft were dealt with some pretty short order and on 2023 there is a few airplanes there, narrowbody assets that we will move. They came out of the Russian situation, but those aircraft will get moved in the very near future. I guess, what about the non-Russia aircraft, like is this obviously there's quite a bit of demand, given -- we're talking about aircraft shortages across both narrowbody, widebody. Well, I would say, we took a decision not to lease any 787s off the order book for some time. On the narrowbody side, of course, we have a few -- we always have a few airplanes, and you certainly want to have some airplanes always available within the 24 months availability for the airlines to make sure that you can satisfy some of their nearer-term requirements they have as well. I guess to roll for the next couple of years, obviously, macro, aircrafts by demand et cetera are all going to influence the outlook. And then pardon if I've missed this, but are you assuming any share buybacks in that $6.50 to $7? I mean -- and I think you could see in our slides that we are assuming that we -- or we project that we'll get back to our target leverage ratio by the end of the year, as Gus said, it could happen sooner but that's what we're projecting at the moment. Look, I think that as you look out beyond 2022, for sure, there are things that are impacting this year that we would expect to diminish over time. And part of that is, is the kind of nearer-term ones in terms of the leasing expenses and other costs of getting aircraft back in the air, that type of thing, aircraft that you have on the ground that aren't earning revenue, right, those type of things. But I think the longer one is, you've got some leases, as I mentioned, that were restructured during COVID and those will roll off over time, and then they'll go back to normal. But all the things that you talked about in terms of the recovery rate, the greater demand, the supply shortage, all of those things should fold into higher numbers for us. And HELI seem to make a big thing of differentiating between state-owned Russian airlines and private Russian lines, and imagining that that will be a difference of treatment as we go forward. AerCap has what we call escalation caps, which is a proxy for inflation, and they've been well negotiated over many years. And how inflation feeds into higher interest rates, we are protected there on the lease contracts that we've negotiated in the past that they have an interest rate adjustment to them. But, historically, higher interest rates and inflation have led -- historically if we go back over the last 40-odd years in this business, aircraft have been hedges against inflation. On relation to the Russian aircraft, we never believed there was any difference between whether it was private or not, that didn't make any difference. And just on that, three-quarters of our exposure of our Russian assets were on lease to private airlines and a quarter or two to Aeroflot and Rossiya. Hi, thanks for taking my questions. No, I mean it's really just lease rents and maintenance revenues that we expect. Obviously, it would have been higher, right, given with the Russian rents, if those were in there, but we took out nine months of that. So at $33 million a month, give-or-take. So no further real, like, growth I guess from the first quarter, it's really like -- I guess the run rate is like the first quarter and then take out the $33 million related to Russia, pretty much. I mean, obviously, it's going to go down in the second quarter because you don't have Russia in there. And then could you -- and then in terms of the insurance policy, I know you filed a claim for $3.5 billion. Yes, during the quarter we also made a claim against the Russian insurers. The way the insurance policies work is that there is a claim against the Russian insurance companies, and there is also then a claim against the Western insurance companies that reinsure that risk."
}