{
    "symbol": "LX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-14 02:16:08",
    "content": " Good morning, and good evening, everyone. Our loan originations for the past quarter reached RMB56.1 billion, representing an increase of 29% year-over-year with total outstanding loan balance reaching RMB99.6 billion as of December 31, 2022, representing an increase of 16% year-over-year. First, the continued improvement in asset quality; second, the ability of our installment e-commerce platform service business to deliver growth against a weak backdrop and breakthroughs in our tech-empowerment service sector, which achieved its first quarterly profit; and third, notable results in reducing operating costs and in increasing efficiency. In the fourth quarter, loan contributions from our prime customers increased by 60% year-over-year, while loan contributions from our high risk customers increased by 13%. In the fourth quarter, the percentage of new prime customers with approved credit lines increased by 18.2% with average ticket sizes for new customers increasing by 16.7% quarter-over-quarter. Our installment e-commerce platform service business under a weak backdrop of poor overall consumption throughout the year last year was able to achieve 1.4 billion in GMV for the fourth quarter, an increase of 40.2% year-over-year. As mentioned, our total operating revenue for the fourth quarter was RMB3.1 billion, representing an increase of 13.4% quarter-over-quarter and a 38.7% year-over-year. Revenue from tech-empowerment service was RMB430 million, representing a 17.4% decrease quarter-over-quarter and 34.6% year-over-year, which was mainly due to the COVID impact where both the volume and the rev share percentage were lowered. Based on the company's preliminary assessment of the current market conditions, total loan originations for the first quarter of 2023 are expected to be around RMB60 billion, representing an increase of 39% on a year-over-year basis. Good morning, and good evening, everyone."
}