{
    "symbol": "RDY",
    "quarter": 2,
    "year": 2023,
    "date": "2022-10-28 16:31:02",
    "content": " The SG&A spend for the quarter is INR1,656 crores, that is US$204 million, an increase of 4% year-on-year and 7% quarter-on-quarter, which is in line with business growth. Our North America Generics business recorded sales of $351 million for the quarter, with a strong growth of 38% year-over-year and 53% on a sequential basis. Adjusted for this COVID contribution, we have grown -- within the emerging market segment, the Russia business declined by 2% on a year-over-year basis and grew by 84% on a quarter-to-quarter basis in constant currency. Yes, please go ahead. Yes, please go ahead. As for the first question, I would -- the best way to discuss it is we are very consistent, meaning that even if you -- on the long-term basis, and that's something we are very trying to be very considerate our communication, our U.S. market, our U.S. activities will grow is growing in the single digits on a month year basis while from time to time, we have mix ups and leaks down in accordance to the competition. So it's -- so we are trying to target not 40 products per year, but rather maybe lower number of the debt around the 2025 products per year, but those products with the potential to be first to market, meaningful growth, etcetera. So absolutely, this is the idea that this will help us to pay for the R&D for the Origin OpEx activities, knowing our pipelines and knowing the cash position, that's why we felt very comfortable to commit in June that we can finance Horizon 2, while including the R&D associated with the including the R&D associated with the resin one, while speaking the overall guidance of EBITDA of 25% on a multi basis. Obviously, it's indeed important to us, especially in India on both OTC as well as nutraceutical on both in going to, let's call it, the traditional channel as well as the commerce what we are trying to achieve, first, we believe that we have an identified either by ourselves or with partnersâ\u0080\u0099 products that have a great data behind it, all the products that we will launch whether OTC as well as on taste, we will detect by scientific data."
}