{
    "symbol": "ALE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 11:08:04",
    "content": " Our regulated businesses are also in execution mode as they firm up plans for further investment in the clean energy transformation, including significant regulatory engagement with Minnesota Power and Superior Water, Light and Power rate cases well underway. Regarding Minnesota Power's customers, on June 28, U.S. Steel announced plans to invest approximately $150 million to enable production of direct-reduced or DR-grade pellets. Net income in 2022 reflects higher wind resources compared to 2021, partially offset by losses under the Caddo wind energy facility's power sales agreement resulting from market volatility and transmission congestion in the Southwest Power Pool. Our Corporate and Other businesses, which includes New Energy, BNI Energy, our investment in the Nobles 2 wind energy facility and ALLETE Properties recorded net income of $2.2 million compared to net income of $1.3 million in 2021. Keep in mind that under ALLETE's ownership, New Energy's partial year financial results for 2022 will be affected by transaction costs and purchase price accounting. We're confident in the quality of the case Minnesota Power filed, and within rates in effect at the beginning of this year, we believe we are off to a constructive start that supports Minnesota Power's financial health and ability to continue the clean energy transition while delivering safe, resilient, reliable and affordable service to our customers. MISO's long-range transmission plan also supports Minnesota Power's Energy Forward strategy with projects that are critical to the reliability and resiliency of the regional power grid as renewable energy is added, existing power plants are retired, extreme weather events become more frequent and electrification of our economy advances. Two important rate cases, the results of Minnesota Power's IRP, the addition of significant solar capabilities from New Energy and ALLETE Clean Energy's progress on build-transfer projects and optimization of its portfolio."
}