{
    "symbol": "NA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-17 13:56:02",
    "content": " Joining us today from Nano Labs are the company's Chairman and Chief Executive Officer, Mr. Jianping Kong; and the company's Chief Financial Officer, Mr. Bing Chen. On our call today, Mr. Kong will give you an overview of the company's performance. Before we continue, I'd like to remind you that some information discussed on this call will contain forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934 as amended, and as defined in the U.S. Such statements are based upon management's current expectations and current market and operating conditions and relate to events that involve known or unknown risks, uncertainties and other factors, all of which are difficult to predict and many of which are beyond the company's control, which may cause the company's actual results, performances or achievements to differ materially from those in the forward-looking statements. Further information regarding these and other risks, uncertainties or factors is included in the company's filings on the Securities and Exchange Commission. During today's call, Mr. Kong and Mr. Chen will deliver their remarks in Chinese, and the company representative will provide corresponding English translations. With that, I would now like to turn the call over to Mr. Kong, the Company's Chairman and Chief Executive Officer; Mr. Kong, please go ahead. Thank you, operator and everyone, for joining Nano Labs Fourth Quarter of 2022 Earnings Conference Call today. The fourth quarter of 2022 was a difficult quarter for our industry and overall crypto market, the dynamic market environment such as the conversion of Ethereum from POW to POS in mid-September last year had partially impacted our business. In addition, I would like to share the most recent developments of our iPollo Metaverse. Depending on the decentralized technology and innovative consensus mechanism, it can deeply integrate with AIGC, lower the threshold for user creation providing metaverse developers with low-cost rendering solutions and more efficient developer tools. iPollo's elastic computing network now supports the inference of stable diffusion machine learning models, allowing for the generation of patterns from the text that can be directly minted as NFTs. With the integration of AIGC an important Layer 2 tool, iPollo Metaverse as the metaverse infrastructure provider allows the developers to create the metaverse, which provides a wide range of possibilities for the creation of unique and innovative metaverse experiences. At the same time iPollo Metaverse is committed to achieving open social and immersive experiences in the 3D metaverse world, which allows tens of thousands of real users to achieve real-time and low-cost interaction in the same scene with high fidelity and zero-latency environment, bringing users to new Web3.0 lifestyle. At the same time, our company also plans to provide 3D printing services for the user's metaverse world so that the virtual and reality can be organically combined. Next, I will turn the call over to our Chief Financial Officer, Mr. Chen, for a closer review of our financial results. On behalf of the management, I will provide a brief financial overview of the fourth quarter of 2022. Net revenues increased to RMB 12.7 million or USD 1.8 million for the fourth quarter of 2022 from RMB 3.2 million for the same period of 2021. Cost of revenues increased to -- significantly to RMB 89.3 million or USD 12.8 million for the fourth quarter of 2022 from RMB 26.9 million for the same period of 2021, mainly due to the inventory write-down caused by a decline in market expectations. Total operating expenses were RMB 60.3 million or USD 8.7 million for the fourth quarter of 2022 from RMB 113 million for the same period of 2021. Selling and marketing expenses increased to RMB 5.6 million USD 0.8 million for the fourth quarter of 2022 from RMB 3.4 million for the same period of 2011. General and administrative expenses increased to RMB 15.5 million USD 2.2 million for the fourth quarter of 2022 from RMB 10 million for the same period of 2021. Research and development expenses decreased to RMB 39.2 million or USD 5.6 million for the fourth quarter of 2022 from RMB 99.6 million for the same period of 2021. Loss from operations was RMB 136.9 million or USD 19.7 million for the fourth quarter of 2022 compared with loss from operations of RMB 136.8 million for the same period of 2021. Net loss was RMB 132.8 million or USD 19.1 million for the fourth quarter of 2022 compared with net loss of RMB 135.5 million for the same period of 2021. As of December 31, 2022 the company had cash and cash equivalents of RMB 87.8 million or USD 12.6 million compared with RMB 233.9 million as of December 31, 2021. Although the company is facing an uncertain market environment, we are actively addressing our development strategy and are full of confidence in the company's future development potential. First of all, I wanted to know like what has caused the company's financial metrics decline in the fourth quarter. First, the conversion of Ethereum mainnet from proof-of-work to proof-of-stake in September 2022 affected some of the company's existing business. Also recently, we launched a new A-series iPollo computing devices, which feature high-performance graphics cards with large memory and high-core central processing units. At the same time, the company's iPollo Metaverse has recently made new technological progress AIGC has been connected to the iPollo Metaverse as an important Layer 2 tool. Additionally, we also plan to provide 3D printing services for users' metaverses to integrate the virtual and the real world. In addition, we began to develop AIGC, real-time rendering, ZKP computing and 3D printing as well as other development directions of metaverse."
}