{
    "symbol": "TENB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 23:17:02",
    "content": " Before we begin, let me remind you that we will make forward-looking statements during the course of this call, including statements relating to our guidance and expectations for the third quarter and full year 2022, growth and drivers in our business, changes in the threat landscape in the security industry and our competitive position in the market, growth in our customer demand for and adoption of our solutions; the potential benefits and financial impact of our acquisitions, including our recent acquisition of Cymptom and Bit Discovery; planned innovation and new products and services; our expectations regarding long-term profitability and our ability to attract and retain employees and its impact on our business. Tenable.ep also creates a more compelling upsell path for our existing customers and benefited our dollar-based net expansion rate in the quarter, which remains elevated in comparison to prior years, and it's well above our 110% threshold. Income from operations was $12.2 million, essentially flat compared to last quarter, but $5.7 million better than the midpoint of our guided range, which had contemplated incremental COGS for our public cloud infrastructure, increased spend for industry events, and higher headcount related costs. Our guidance also contemplates approximately $4 million to $5 million of less contributions from upfront AD on prem revenue and higher levels of adoption of AD and Tenable.ep, our unified exposure platform. And for the full year, we currently expect calculated current billings to be in the range of $768 million to $776 million, which reflects a $4 million increase from the midpoint of our prior guidance, including $2 million of the Q2 outperformance and $2 million of contribution for Bit Discovery, primarily in Q4. Non-GAAP income from operations to be in the range of $45 million to 49 million, which is a $1 million increase from the midpoint of our prior guidance, reflecting a $6 million beat over the midpoint of our Q2 guidance offset by $3 million of operating losses from Bit Discovery and $2 million of higher inflationary costs. I would say, first of all, overall, we're pleased with performance in the quarter, we grew CCB 27% and as you know, we added a lot of new customers 540 new enterprise platform customers, we transacted a bunch of large deals."
}