{
    "symbol": "TENB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 23:57:02",
    "content": " Before we begin, let me remind you that we will make forward-looking statements during the course of this call, including statements relating to our guidance and expectations for the second quarter and full year 2022, growth and drivers in our business, changes in the threat landscape in the security industry and our competitive position in the market, growth in our customer demand for and adoption of our solutions; the potential benefits and financial impact of our acquisitions, including our recent acquisition of Cymptom and the expected acquisition of Bit Discovery; planned innovation and new products and services; our expectations regarding long-term profitability and our ability to attract and retain employees and its impact on our business. EP now offers customers a comprehensive cyber exposure management platform that assesses hybrid IT, the full life cycle of cloud and cloud-native environments, active directory and following closing of the acquisition and integration of Bit Discovery and Internet-facing assets such as web applications, cloud resources, open gateways, bringing these solutions into one unified platform enables us to identify, evaluate and prioritize risk across the entire digital footprint for our customers. Revenue for the quarter was $159.4 million, which represents 29% year-over-year growth, which is up from 20% growth in Q1 last year and 26% growth last quarter. CCB, defined as the change in current portion of deferred revenue plus revenue recognized in the quarter, grew 31% year-over-year to $156.5 million. And for the full year, we currently expect calculated current billings to be in the range of $764 million to $772 million, revenue to be in the range of $673 million to $679 million, non-GAAP income from operations to be in the range of $44 million to $48 million, non-GAAP net income to be in the range of $19.5 million to $23.5 million, assuming interest expense of $15.7 million and a provision for income taxes of $8 million; non-GAAP diluted earnings per share to be in the range of $0.16 to $0.20, assuming 119.5 million fully diluted weighted average shares outstanding. For the second half of the year, revenue is not expected to be significant, but we expect Bit Discovery to add $2 million to $3 million of CCB, most notably in the latter part of the year, and $2 million to $3 million of non-GAAP net loss. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. We're seeing continued traction and certainly in the midmarket, but are seeing notable wins for Tenable.ep in the enterprise, how the usage will break down with the newer platforms being or the newer exposure solutions being added to EP, we'll keep a close eye on that over the next couple of quarters. Please proceed with your question. Please proceed with your question. And so we see our continued investment in R&D, our continued ability to differentiate our product capabilities, both in core VM as well as a broader understanding of what's happening with the customer's attack surface, specifically helping them around cloud-native assets and workloads, the protection of identities and active directory infrastructures and helping them assess and understand risk more holistically. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. But even if you exclude that, still a $5 million revenue beat in the quarter, which is one of your largest - again, looking back over the last couple of years, you only raised the revenue outlook by $10 million for the year."
}