{
    "symbol": "CIEN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-01 13:22:13",
    "content": " Firstly, we are working very closely with this small number of partners to resolve these acute challenges around delivery commitments and volumes; secondly, we continue to qualify engineering alternatives to expand our sources of supply and to pursue product redesign activities; and thirdly, we continue to invest in our readiness with respect to contract manufacturing capacity as well as our inventory levels to be prepared when these components do arrive. We've seen orders continue to well outstrip revenue and the statistic that I kind of shared about 60% year-on-year order growth for the last 4 quarters, that's sort of a testament to it. Is there a way to size kind of the impact of products already redesigned, so we can just get a sense that given that we're a year through this that you've already redesigned and that's made x number of revenue available just to kind of balance out some of the downdraft that we're seeing. We knew that demand was going to increase substantially this year, and we planned, as we shared with you, for a well double-digit growth this year, and we took a lot what we thought were the right supply chain actions in place for that in terms of placing orders, in terms of actually engineering work to reduce our dependency. You could see now things are very turbulent given all the supply chain challenges, but we were up pretty robustly in the quarter and in fact, 44%, from a revenue point of view, I wouldn't sort of bear too much to that because you've got ebbs and flows, largely driven by supply chain at this moment in time. But frankly, going back a year that wouldn't be the area of the product portfolio we would have concentrated our multi-sourcing activities on because it's been a very reliable part of the supply chain ecosystem in the past. We haven't finished this year, and that's been -- and that's challenging enough right now, given the supply chain pieces that we're seeing. Consensus right now is about $4.2 billion, as Jim said, and I think that's probably a reasonable -- probably a reasonable number, given what we're seeing. That's entirely possible if the supply chain set stays with some stability and we fix some of these particular issues that we're seeing right now, more than that right now would be kind of speculation."
}