{
    "symbol": "AGS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 20:20:05",
    "content": " Moving on to our domestic EGM recurring revenue business, although we have produced 12 consecutive quarters of premium footprint growth, we estimate we have only penetrated 65% of the addressable casino market for our products. Turning first to our domestic EGM gaming operations business, fourth quarter revenue increased 8% year-over-year and 13% versus Q4 of 2019 to a new company record of approximately $47 million. In addition to our sustained premium unit momentum, the successful launch of our initial games in the higher-yielding, high-denomination game segment, the strong performance of our launch titles on the recently introduced Spectra cabinet, continued implementation of our installed based optimization initiatives and consistent GGR trends across our served markets, further supported our record setting recurring revenue performance in the quarter. Looking ahead to 2023, we expect a strong pipeline of premium unit demand and an increasingly stable core unit footprint to support consistent sequential growth in our domestic EGM install base at a level similar to what we achieved over the past several quarters. Looking beyond EGM, our Table Products business remains on an encouraging trajectory with fourth quarter revenue and adjusted EBITDA each increasing by over 20% versus the prior year. Looking ahead to 2023, we expect further customer adoption of our PAX S shuffler, Bonus Spin Xtreme progressive and AGS Arsenal site license program to result in consistent sequential growth in both our table products revenue and adjusted EBITDA as we progress throughout the year. Mixed headwinds resulting from an anticipated increase in EGM product, sales revenue to exceed the rate of growth in our EGM recurring revenue business additional investment into our R&D organization, albeit at a more moderate rate than in 2022 to support our future growth initiatives and the impact of market level inflationary cost adjustments on our business. Supported by the company specific catalyst emerging across all three operating segments of our business, the resilient trends we continue to observe within our day-to-day operations and our cautiously optimistic outlook for the remainder of the year, we expect to exit 2023 with net leverage in the range of 3.25 times to 3.75 times. I think when you look at our product mix and between new products and that didn't exist back then, but even just thinking in the last year or so, you look at the product mix with premium and the setup we have there and how it's still new business and we've got a lot of white space ahead of us."
}