{
    "symbol": "ME",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-07 22:32:02",
    "content": " Our revenue for the three and six months ended September 30, 2022 was $76 million and $140 million, respectively, representing an increase of 37% and 22%, respectively over the same periods in the prior year. Our gross profit for the three and six months ended September 30, 2022 was $38 million and $64 million, respectively, representing a 37% and 9% increase over the same period in the prior year. Operating expenses for the three and six months ended September 30, 2022 were $106 million and $221 million, respectively compared to $74 million and $147 million for the same periods in the prior year. Net loss for the three and six months ended September 30, 2022 was $66 million and $156 million respectively, compared to net losses for the same period in the prior year of $17 million and $59 million. The increases in net loss for the three- and six-month periods were primarily driven by a benefit from changes in the fair value of warrant liabilities of $30 million for the three months ended September 30, 2021 and by the previously noted higher operating expenses in the current period. Total adjusted EBITDA for the three and six months ended September 30, 2022 was a deficit of $30 million and $79 million compared to a deficit for the same periods in the prior year of $30 million and $57 million, respectively. As a reminder, our full year guidance include revenue in the range of $260 million to $280 million, a net loss in the range of $350 million to $370 million and adjusted EBITDA deficit of $195 million to $215 million. We're in a strong position with over $411 million in cash on the balance sheet as of September 30, plus the additional $50 million that we received in October for the fifth year GSK partnership. First, we disclosed that at the end of the second quarter, we had over $411 million in cash plus we received the $50 million for the third -- fifth year GSK payment in October. I think a lot of people are still surprised to hear that we have a therapeutics group and that we actually do the therapeutics ourselves, but it's not just that it's a research and we hand it over to GSK that I have over 100 incredibly talented people in the therapeutics world working in real labs with like real PI tests and making progress and doing the real work of translating from a basic discovery into something that is now very proudly in human trials."
}