{
    "symbol": "ME",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-08 19:11:06",
    "content": " Our revenue for the three and nine months ended December 31, 2022 was $67 million and $207 million respectively, representing an increase of 18% and 21% respectively over the same periods in the prior year. Looking at the composition of our revenue, consumer services revenue represented approximately 80% of the total revenue for both the three and nine months ended December 31, 2022 and research services rev new, which was primarily derived from the GSK collaboration, accounted for approximately 20% of total revenue for those same periods. Our gross profit for the three and nine months ended December 31, 2022 was $31 million and $95 million respectively, representing a 13% and 10% increase over the same periods in the prior year. Operating expenses for the three and nine months ended December 31, 2022 were $128 million and $349 million respectively compared to $124 million and $271 million for the same periods in the prior year. Looking at the bottom line, net loss for the three and nine months ended December 31, 2022 was $92 million and $248 million respectively, compared to net losses for the same period in the prior year of $89 million and $148 million. Total adjusted EBITDA for the three month end of December 31, 2022, improved to a deficit of $43 million compared to a deficit for the same period in the prior year of $64 million. Full year revenue for fiscal 2023, which will end on March 31, 2023, is now projected to be in the range of $290 million to $390 million with a net loss in the range of $325 million to $335 million. Before we go into questions, I'd like to just make sure that one thing was clear and on my -- when I was giving full year guidance, the full year revenue for the fiscal year 2023, which will end on March 31, 2023, is now projected to be in the range of $290 million to $300 million with a net loss in the range of $325 million to $335 million."
}