{
    "symbol": "HR",
    "quarter": 1,
    "year": 2021,
    "date": "2021-05-07 20:41:03",
    "content": " I think if people get a chance to take a look at those, they should because that's sort of what we're trying to build throughout our markets as that continuity. And I think what's changed in our philosophy, going back 6, 7, 8 years now, has really been a focus on more major markets with much greater population growth, really with the focus on areas that are going to benefit from the continued expansion of the knowledge worker and the knowledge economy and things like that also happen to be attractive from a lower cost of living perspective. I think now as we're looking at where we're going to be over the next 5, 10 years, it really is much more focused on major markets where we can really deploy all of our platform capabilities and continue to grow. So I think as you see us continue to recycle out of assets, they're going to be out of smaller, more rural markets where we can't get as much of economies of scale and growth into more of our major markets where we think there's going to be a lot of growth that we can really leverage going forward. And I think as we look towards the rest of the year, with the new leasing activity certainly picking up, us being able to drive that to actual getting people in the buildings, I think that's where we see it coming back. And we want to reposition our assets if needed, out of space that is not going to be functionable or long term, and probably the next 3 or 4 years because I do think there's going to be a big cycle come 2025, 2026 for space needs and how tenants have adapted and so forth. So I think it's still back to -- we feel comfortable in our goal and what we're looking at our leasing teams for and our conversations is that we want to get to that 92%, 93% occupancy. I think it's just started, and I think we're going to see it and starting to see narrative in -- from general economy folks who are now recognizing it. I think in markets where it's more of a market share type game, as we're looking at our renewal discussions, we've got people saying, well, maybe I'm just going to go build a new building. So I think it's very much a market-specific analysis that we're doing on that, but it certainly is -- we certainly are seeing it go up quite a bit. I think the -- you mean from an annual growth perspective on the acquisitions, I think what we're seeing, we're certainly expecting that it's going to average out 2.5%, 3.5% annual growth from the assets that we're buying. So I think our acquisitions -- we're fully anticipating that they're going to support that 2.5% to 3%, 3.5% type run rate that we've historically targeted."
}