{
    "symbol": "HR",
    "quarter": 2,
    "year": 2021,
    "date": "2021-08-06 15:51:11",
    "content": " And I couldn't be happier to be able to do this at HTA with an outstanding team, a team that's demonstrated, on a continuing basis, their ability to drive results, as I said before, doubling the size of the business and growing earnings over 20% over the past 5 years. As a result of this performance, we're able to update and tighten our earnings guidance for 2021 to a $1.74 to a $1.78, which incorporates our view that the same store for the year will come back to a range of 2% to 2.5% with acquisitions that are increasing to $375 million to $600 million while selling between $70 million and $125 million of assets and funding the remainder which -- with already raised capital which will keep our leverage between 5.5 and 6 times. It's not every day we see a founder of 15 years who's got, I think he has over 3 million units, so let's call it over $100 million invested in the Company voluntarily resign and rush you guys to put -- Peter, I admire your dedication to step up at 77 and take this job. You said whistleblower is not financial, but then you say in the 8-K that there's no financial -- I'm confu -- is it or is it not financial impact because you -- or a financial matter because you throw out the disclaimer that you don't expect material financial impact but not zero financial impact. I think as we look at things, everybody has been able to sign off that we don't anticipate this having a material -- the topic at hand, we don't anticipate it having any sort of material financial impact to the Company. And I think, obviously, given the questions that are out there, we wanted to make sure that we could, again, put it in the context of a business that's continued to perform, a business that continue to have opportunities, a business that continues to have various investment opportunities, including development that is better than we've seen and continues to put out earnings. You know, Mike, I think we've got to be specific to what we put out in the 8-K. it's just -- every Company has a whistleblower hotline that's put in place."
}