{
    "symbol": "FMS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 12:37:04",
    "content": " Throughout today's recorded presentation, all participants will be in a listen-only mode. As always, I need to start out the call by mentioning our cautionary language that is in our Safe Harbor statement as well as in our presentation and in all the materials that we have distributed yesterday. Given that we have only 60 minutes, we need to limit the number of questions again to two in order to give everyone the chance to ask questions. Should there be further questions and time left, we are happy to go a second round. Before I start with my prepared remarks, I would like to take a moment to recognize the hard work and dedication of our great teams around the world. As the new CEO, my overarching strategic aspiration is to unlock value as the leading kidney care company and to drive up shareholder return. Today, I will introduce the key elements of the strategy roadmap and we will also host the Capital Markets Day on April 19th to delve deeper into these topics. Since the first of the year, we have fully implemented our new operating model, reorienting to two globalized operating segments: Care Delivery, our health care services business; and Care Enablement, our med tech business. This new operating model not only provides increased transparency internally, but it will also bring enhanced transparency to our external financial reporting. We will spend time detailing the new reporting structure, along with historical figures and future expectations, during our Capital Markets Day. As you will have seen in yesterday's announcement, Fresenius is planning to deconsolidate Fresenius Medical Care. The necessary change in our legal form, will create a simplified, more agile and efficient governance structure, which will enable full independent decision-making and at the same time, strengthen the rights of our free float shareholders. Another critical step, is taking a more rigorous approach to capital allocation. I have implemented a disciplined financial policy, to drive the much needed improvement in our return on invested capital. I am proud of what we've accomplished today, with our FME25 transformation program, and we will further accelerate and extend it within the new operating model. In addition, we are implementing operational efficiency and cost reduction measures beyond FME25. And with a disciplined lens and focus on the core business, and improving profitability, we are further optimizing our portfolio. I will speak about what these measures entail for both Care Delivery and Care Enablement respectively, in a moment. And none of these measures will be successful, if we don't have a winning culture in place. This includes fostering a clear culture of accountability, and with the successful implementation of our global sustainability program through 2022, and we have laid a strong foundation to drive integration of sustainable principles into our business. We have decided on new global sustainability targets for the coming years, focusing on enhancing quality of care and access to health care, reducing the company's environmental footprint and building the best team to serve our patients. As part of this, we continue to promote diversity, equity and inclusion and I'm proud of the initiatives we continue to advance here. As I mentioned earlier, our new simplified operating model went into effect as of January 1. This new structure provides increased transparency, and enables us to compare directly to our peers. With our globalized and fully allocated G&A functions, we have the flexibility to scale these functions as needed, to provide an appropriate level of support to the respective segments. And for me, it's remarkable to see the difference the new structure has made already particularly around visibility and transparency, and it has opened up further possibilities to unlock value and improve profitability. With this change, we would move from a controlled structure with several decision-making Boards to a standard German two-tier system with one Supervisory Board and one management Board. In addition to the improved shareholder rights, there are important business relevant benefits too. This governance structure enables faster and fully independent decision-making, and it also provides more optionality on our future strategic direction. It frees up time and capacity of the executive and management team, and enables them to focus solely on Fresenius Medical Care. With the conversion of the legal form, Fresenius will not be a controlling shareholder any more. Consequently, as a large German corporation, we would move from an indirect codetermination via the Fresenius Supervisory Board to a direct codetermination where all Supervisory Board members would be committed solely to the future of Fresenius Medical Care. With our focused capital allocation priorities to which I come later, and our strong track record of deleveraging, we expect only limited weighting pressure resulting from the deconsolidation. As a well-known issuer, we are confident to maintain our good access to the capital markets. We will also need to carve out in some, although rather limited areas where we share services with Fresenius in Germany such as G&A services for payroll, taxes or treasury, which are already contracted at arm's length. An extraordinary shareholder meeting is required later in the year, currently assumed to be in July. The one-time costs associated and corresponding carve-out measures are assumed to range from â\u0082¬50 million to â\u0082¬100 million, which we will treat as a special item. Additionally, we are working towards strengthening our financial position, with a disciplined approach to capital allocation and improving our return on invested capital. Given our current leverage position and the high interest rate environment, deleveraging is our primary capital allocation priority. And finally, with a laser focus on driving organic growth in our core portfolio, our investment activities will be limited. With particular acceleration in the fourth quarter, our FME25 program delivered sustainable savings of â\u0082¬131 million, well above our expected range for the year. Additionally, we have increased the scope of the program, largely comprising of additional opportunities to improve the profitability of our Care Enablement segments that continues to be heavily impacted by inflationary pressures. We expect incremental â\u0082¬120 million to â\u0082¬170 million sustainable savings in 2023, which will bring us to â\u0082¬250 million to â\u0082¬300 million exiting the year. And to achieve this, we now expect onetime cost of â\u0082¬250 million to â\u0082¬300 million. With our new operating model in place, we now have clear line of sight and the leadership accountability in place to drive performance and run the segments like the two separate businesses that they are. On this slide, we have outlined our path to unlock value in each of our operating segments. In Care Delivery, our turnaround efforts are focused on productivity and efficiency measures. And in the US specifically, we have focused on labor stabilization, growth and improving our operating leverage and we have already started clinic closures. In Care Enablement, our product margin has been severely impacted by macroeconomic inflationary and supply chain pressures and is falling short of our aspirations. To improve profitability, we are focused on pricing initiatives, productivity measures and reviewing our manufacturing footprint. As I mentioned earlier, the proceeds from these disposals will be used to further deleverage. With the move to the new operating segments, a reallocation of goodwill and the recoverability of goodwill is required. And as the evaluation also takes into account interest rates, WACC and changes to the macroeconomic environment possible changes to those factors may result in a goodwill impairment in Care Enablement in the future. Before I turn to our financial performance, I would like to emphasize that our strategic aspiration and planned initiatives are tangible. This gives me the confidence for a recovery of earnings growth in 2024 and beyond, and I look forward to sharing more details during our Capital Markets Day in April. In the fourth quarter, we continue to deliver organic growth. In line with expectations, our operating income declined by 8% on a constant currency basis and before special items. And as expected, our business development continued to be impacted by higher labor costs and macroeconomic inflationary pressures. While the US labor market remained challenging, our labor stabilization efforts continues to drive gradual improvements in our labor KPIs. On a constant currency basis, healthcare services delivered revenue growth of 2%. The North American region delivered stable organic growth and improvement from the third quarter, despite the impact from accumulated excess mortality, staffing challenges and capacity constraints in certain clinics. Revenue for the Products business was flat for the quarter, as higher sales of in-center disposables were offset by lower sales of machines for chronic treatments also resulting from delays from the lifted FDA shipment hold. On a year-over-year basis, we experienced the largest margin contribution from business growth, including COVID effect. The most significant margin detractors were macroeconomic inflationary pressures, including labor cost increases and the year-over-year headwind from applied US provider relief funds. These headwinds were partially offset by the acceleration of our FME25 program, which led to higher savings in the fourth quarter. Other one-time costs consist of the remeasurement effect of our investment in human sites and impact from the Ukraine war, which included the impairment of a production plans, resulting from economic sanctions imposed on Russia. However, the focus on lower CapEx resulted in a stable free cash flow development year-over-year. At 3.4 times net debt to EBITDA, we were at the upper end of our target leverage corridor and it is a priority for us to stay within this self-imposed range. And as I mentioned earlier, future deleveraging is at the top of our capital allocation priorities. With our new financial reporting structure, and in line with our DAX peer group, we will now change to an annual outlook for revenue and operating profit. And for 2023, I really want to focus on the key assumptions and drivers, of expected earnings development. Despite some stabilization, we are assuming a continued headwind of â\u0082¬200 million to â\u0082¬240 million from the inflationary cost environment, resulting from the annualization impact from these costs, plus although on a lower level, a continuation of the inflationary environment. However, we are seeing gradual improvements in the challenging US labor market. And as outlined last year, of the defined labor cost headwind, a portion was expected to become a tailwind for 2023. And some of the permanent measures we implemented in 2022, were always expected to have an annualization effect  We are assuming a merit increase of 3% to 4% across the globe. In the US, we are assuming a broadly stable dialysis treatment following developments for the full year, that could range from plus 1% growth to a minus 1% decline. As I mentioned earlier, we are assuming sustainable FME25 savings of â\u0082¬250 million to â\u0082¬300 million by the end of 2023. And last year, as we all know operating income was supported by â\u0082¬277 million of US provider relief funds and we do not assume any additional funds will be made available in 2023. And to provide a comparable basis for our 2023 operating income outlook, we have adjusted the base accordingly. In 2023, we expect low to mid-single-digit revenue growth. On the adjusted basis that I just explained on the previous slide, we expect a flat to high single-digit percentage weight decline for operating income in 2023 and from a phasing perspective, we do expect the low point in our operating income development in the first quarter. To help you with your 2023 modeling, we are assuming a tax rate of 25% to 27% and financial cost of â\u0082¬350 million to â\u0082¬380 million at constant currency. While 2023 will be a year of level setting, we are confident in our path to unlock value as the leading kidney care company. We expect to come out of 2023 stronger, and well positioned to drive sustainable, profitable growth with the recovery of earnings growth in 2024 and by 2025, with an improved operating profit margin of 10% to 14%. And when you look at the 2025 margin aspiration, please keep in mind, that this includes the assumed strong revenue growth of our value-based care business, which comes with an incremental, but lower margin and therefore, dilutes the overall margin. And I imagine, you have some questions for me and I'll hand it over to Dominik, to begin the Q&A. So when I look to the pushes and pulls, you've kindly given us, it implies that there's maybe $130 million of business growth in 2023 to hit the midpoint of your guidance. In terms of the margin range for 2025, as I'm sure you can appreciate there's a lot of these initiatives that I've outlined today that will gradually pay off between 2023 and 2025. And you're absolutely right, of course, FME25 is a big piece of that. However, these underlying measures that I speak about in efficiencies on the productivity, improving the operating leverage, as well as certain pricing measures will also contribute to that margin expansion. Additionally, we do expect some reimbursement catch up here with PPS over this period through 2025, as well as the patient growth recovery. So I think what we can see is we're looking at this three-year window is the combination of all of these measures coming and coming to fruition that gets us back closer to historical profits, but I think with a leaner more focused approach on the operations here. With regard to the 2023 guidance, of course, the delta is business growth. Bear in mind that that labor number is a net number, which includes the merit increase as well. But, of course, what we were trying to do was just tease out the main headwinds and tailwinds, but of course there's an underlying business performance here as well. We've just now, this year just trying to focus on the main pluses and minuses and it's not meant to be a complete exhaustive list as I'm sure you can appreciate it. What are your assumptions around pricing, wage inflation and cost out given, EBIT growth at the midpoint based on your margin target vastly outpaces revenue growth over this period. So you'll be able to see, projects and services in the way you've all been asking to see it for many years. In terms of potential disposals, we've taken a hard look at the portfolio. And I guess, all I would say right now is, we're looking at what really is too far removed from the core and also what maybe isn't performing at the kind of margin level, we would expect. And we're also looking at International Service markets, where either the reimbursement or profitability or scale is maybe no longer viable for us. As we bring them to fruition and execution over the course of the -- probably the next 12 to 18 months with some in 2023, we'll update on those in real time. And then, you asked a question on the -- let me get all your questions here. You asked a question on the, margin for 2025. Of course, as I mentioned, BBC will be a little bit of a driver of that dilution, as that medical costs under management grows. We'll still get the low single-digit percentage of margin, but that does dilute the overall margin. But I think the key piece here will be what we cover in Capital Markets Day in April, on the bridges to the services and products margin improvements. Helen, if I could just follow-up please in the absence of a margin bridge and looking forward to getting that in a couple of months. So you have increased your exposure to value-based care, quite strongly through with pre-merger Interval Health. So the question is, it's a highly dilutive business, but still brings some EBIT. I would say, while magnitude and timing is highly uncertain, how do we evaluate from a top-down perspective which that some funds will be granted as otherwise smaller dialysis centers would not survive. In terms of the EBIT guidance, yes, you're right. Obviously, that is baked into these projections. And I don't really â\u0080\u0093 I mean obviously, it's an accretive absolute EBIT contribution but it does leave the percentage. But obviously, we are seeing with all the other efficiency measures and productivity measures and pricing measures along with FME25, we do see a path to that margin range that we outlined. And of course, that's why we have published that. In terms of government support, we really don't see any path to that. And of course, we continue to kind of along with many providers speak to the concerns that we have. And obviously, we know that the reimbursement system is in a lag. And obviously, we do have a benefit of the 3% PPS rate this year. And obviously, if anything changes we will update the market accordingly. Yes, look it's a question we get asked a lot. Obviously, we are larger in scale and obviously, it's impacting us quite significantly. I guess the hypothesis here is that it could put stress on the smaller operators and maybe that becomes a benefit for us, if we're able to pick up those patients. But obviously, that's not built into this and I'm speculating on what duress there under. I can honestly say, we're not having them knocking at our door saying, buy us, and we're not buying any way. But obviously, it's something that we are keeping our ears to the ground on and watching carefully. And I was just wondering, if you could share your thoughts on what's going on there. Obviously as you correctly point out there is this -- the accumulation of the excess mortality, but -- and I think it's why we have been quite narrow and flattish with our range on, kind of, the growth projection for 2023. But we're also seeing, kind of, the mortality coming down quite significantly from the peak consistently. We continue to see, kind of, slight improvements now with the Medicare Advantage book of business. We had hoped it would be at the end of last year in the Lame-Duck period, but it didn't happen. Obviously, a clearly important metric and obviously something that the company has struggled with in recent years. Yes, look, return on invested capital there's no question, it's disappointed, being in the 3s. I haven't put a target range out there, but clearly we need to minimally clear our cost of capital here. We'll think through whether we put some targets out there for April, having really got that far on the rolling target. But, obviously, weâ\u0080\u0099re so low, it needs to improve and I'm very mindful of the increase in cost of capital and the impact on our WACC. Look, it would be interesting to see what that -- how that all plays out. We know that some of those assets have been -- how do I say, shopped for sale and there wasn't take up on there, now they're doing the spin-off. We'll also see how customers react to it and what that means and if there is opportunity, obviously, our team are staying close to it and looking at it. But I think, for us, we're clear where we are with our portfolio, but maybe it will help with pricing in the market overall. So, yes, I think we're just watching and waiting to see what happens as they complete the spin out and whether -- yes, what kind of transaction happens as a result of that. Second part of that is, DaVita made a lot of noise at Q3 around missed treatments having picked up and stayed quite high through 2022, which they said was a 100 basis point headwind to their treatment volumes, which they have expected to continue into 2023. There's about 20,000 transplants in the US every year. I assume given your market share that roughly 35%, 40% of that is your patients. And if I miss something just tell me at the end, but I think I was scribbling furiously here. In terms of the missed treatments, and I think we saw this kind of phenomena in lower growth in Q2 to biased in Q3. And I think at this point, both of us are saying who we don't know. So -- and then as it relates to COVID and the excess mortality we'd always guided 5,000 to 6,000 for the full year. And bear in mind these are still somewhat -- not completely final because of the data lag, but we ended the year with around 5,200. And then just maybe as we think about our same market decrease that's been coming -- as I already mentioned, that's been coming down a little bit every quarter where we were at minus 1.9% at the end of the year. We're seeing that a little bit higher, maybe around 25,000. So I think there's a little bit of an increase, which obviously is likely to be supported by some of the executive orders there as well, but an increase but still quite small numbers in terms of the overall patient volumes. I suppose just -- well, I guess maybe just one follow-up on the excess mortality round COVID. Essentially, the average has been that roughly 20% of your patients die to your COVID increased that by a few percentage points. So -- and that was obviously the numbers I'm giving you kind of more US numbers, but international normalized even quicker I would say because obviously we didn't have the same impact from COVID that we did in the US. Outside of your own execution and numbers, I'm just curious what you're assuming for any industry changes for your projections. And secondly on volumes, I'm curious, if patients flow may slow if drugs are more effective in CKD 304 is happening and or getting better overtime. And then thirdly, apologies as I mentioned earlier about DaVita reading, given we're talking about 2025, just wondering, if you are assuming in your assumptions any impact on commercial mix in 2024. So, yes, we're not really assuming anything different in the underlying fundamentals in our market situation due to the ESRD or CKD. What we are doing of course with our value-based care efforts is moving more into managing that CKD population, which we feel is an important part of our strategy that ultimately we should get healthier patients coming in into the funnel. In terms of the -- what we are feeling there is that, if we are getting a healthier patient coming in then that means that, they would be on dialysis for longer. It's an interesting question on the drug piece because, obviously, we're watching SGLT2s closely. So that means that we should -- ultimately they may still, kind of -- as it will still end up on the SRD, but again, we'll have a healthier patient for longer. But we see that impact is maybe what six, eight years away. But obviously, if we can get benefits on the CKD population, that will ultimately benefit us there. And then, we have say, just healthier patients for longer. On the Marietta situation, we're still assuming that that will have a positive ruling and there is no impact negative assumed in this outlook. Obviously, we're just waiting to get that resolved with the MSP language. And just a quick follow-up on one of your slides on for '23 guidance, on treatment growth of minus 1% to plus 1%. Yes, just an update on the progress of that would be useful. The home target, it's still aspirational to be at 25% by 2025. And we recognize, that home growth has been impacted by obviously, the labor challenges and kind of staffing shortfalls that we had in 2023. At the end of Q4, we were at roughly just around 16%. So, it's definitely a focus for us to continue to accelerate -- and now obviously, as we see this labor situation stabilizing, we should be able to kind of get back on the training and really continue to drive that. Like we had kind of maybe this time last year, where we're seeing that momentum come through. So, yes, still really excited about home, very much a key pillar of our strategy to kind of offset in some ways is the labor challenges that we have. But ultimately, also feed into our value-based care strategy of really improving outcomes in a home setting, which should ultimately reduce cost as well. My first question is can you provide an update on the labor shortage situation in the US, and also the amount of open positions that you're still looking to fill at the moment. And then related to that, how important is a significant improvement in that regard, when thinking about achieving your new 2025 target. So labor yes, as you know, it's been a many moving pallets on that as I mentioned, which was one of our more difficult numbers to kind of size for 2023. But I'm really starting to feel, that we've got our arms around this labor situation and stabilizing it. In terms of the open positions, we are currently around 4,400 down from around 5,000 last quarter. I'm also really happy to see that, the use of temporary labor, the spend overall has come down quite significantly, and not just the volume that we're using, but the rates are declining as well which is really important. And then, the other part that was a challenge for us, was this constant turn of labor through the summer. We're seeing some significant improvements in our employee turnover rates particularly, in the less than one year period and that is kind of a better hiring adherence, kind of longer training classes, kind of a buddy system. I think we're also seeing, maybe this is some of the inflationary measures, the hot kind of market has subsided and we're seeing that show up, in a little bit lower weights as well, overall. So, I feel really good about what we're doing there. And on top of that, not just the shortages and the cost, but the productivity improvements that we have both baked into this, kind of this midterm view on margins. There are slates of candidates and that will move into interview -- an interview time line, shortly. I truthfully, don't know, how long it's going to take. And obviously, it depends on anyone's availability and time line as well. Due to time, we can take one last question. Yes, in terms of clinic closures, we're targeting around 50 to 100 in this first wave. And that's on a base of 2,600 in the US. And it's a pretty quick payback usually kind of 2-ish, two to three years payback there. So obviously, we're quickly accelerating that and ensuring that we keep our proportionate patient volumes as well. And then on your second question, in terms of ROIC, I think that was always kind of part of a positive business case here with home that, home should positively impact that, because you don't need as much kind of capital infrastructure. So, I think that's also why we want to continue to make sure we're accelerating that and making sure it reaches its full potential. So I'm sorry that we couldn't take all the questions, but we'll need to catch a plane unfortunately. Thank you for taking the time, and the many interesting questions. I appreciate there was a lot of data today, a lot of information to unpack but I appreciate your continued interest and support of Fresenius Medical Care."
}