{
    "symbol": "CEAD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 10:54:08",
    "content": "  Operator: Good afternoon, ladies and gentlemen and welcome to the CEA Industriesâ\u0080\u0099 Q2 2022 Earnings Conference Call. These statements reflect CEA Industriesâ\u0080\u0099 current beliefs, and a number of important factors could cause actual results to differ materially from those expressed in this call, including the risk factors set forth in the companyâ\u0080\u0099s Form 10-K, which was filed with the SEC. Also, please note that the company filed its quarterly report on Form 10-Q and issued a press release announcing second quarter results earlier today. As highlighted in our earnings press release, during the second quarter, we generated over 70% growth on the top line and nearly doubled gross margin compared to Q1. Nonetheless, we are navigating the environment and expect to continue driving growth and improving profitability in the second half of the year. Over the first half of 2022, we made significant investments in our sales, marketing and product development initiatives. We not only expanded contracts with current customers, but also signed multiple new agreements throughout the quarter. One specific contract Iâ\u0080\u0099d like to highlight is with Green Brothers Farm, a family-owned and operated farm that is developing a 26-acre site exclusively for indoor cannabis cultivation. The initial contract valued at roughly $1.2 million is for the first phase of products and services, which is estimated to be completed by the end of the year. While we still have work to do to execute on our organic growth initiatives, we believe the early results from our investments in sales and marketing are encouraging. Also, during the second quarter, we established a partnership with Merida Capital, a cannabis-focused private equity firm to be the preferred provider of various products and services for Meridaâ\u0080\u0099s indoor cultivation facilities. Our subsidiary, Surna Cultivation Technologies has worked with Merida on several projects in the past, and our success in effectively building out their facilities is what ultimately drove this formal partnership. As I have mentioned on past conference calls, we are intensely focused on identifying both organic and inorganic growth opportunities beyond our traditional cannabis end market, including the rapidly growing urban indoor farming market. While a few states this year had disappointing outcomes on cannabis legalization efforts, there are several states we look forward to serving as their cultivation licensing and rules and regulations are finalized, particularly on the East Coast. New Jerseyâ\u0080\u0099s recreational sales began earlier this year, and the Cannabis Regulatory Commission is still accepting applications for recreational cannabis businesses. We have been actively marketing in all of these states through trade shows, social media, SCO and advertising, and we are currently pursuing several leads we have secured over the past few months. At this time, I will pass it over to our Chief Financial Officer, Ian Patel, to cover our second quarter financial highlights before returning for closing remarks. Jumping right into our results, Q2 revenue was $3 million compared to $4.5 million in the year-ago period. The decrease was a result of supply chain and project delays, which impacted revenue recognition, and we expect to recognize this delayed revenue in the second half of the year. In addition, our backlog of approximately $10 million is also expected to be recognized over the next 18 months. Our net bookings in the second quarter were $1.5 million compared to $900,000 in the same period in 2021. Gross profit for the second quarter of 2022 was $300,000 or 10.2% of revenue compared to $1.3 million or 28.4% of revenue for the same period in 2021. The increase was primarily related to $620,000 non-cash goodwill impairment charge related to the decline in our stock price, with the balance driven by increased investments in marketing and headcount. Net loss for Q2 2022 was $1.8 million or negative $0.23 per share compared to net income of $300,000 or $0.17 per share in the year ago quarter. As of June 30, 2022, cash and cash equivalents were approximately $20.6 million compared to $2.2 million as of December 31, 2021, while working capital increased by $17.4 million during this period. However, it also provides us with the opportunity to acquire accretive businesses at attractive multiples, which will only strengthen our financial profile and position us to accelerate growth and profitability in the quarters ahead. We have been actively quoting from leads we have received from several trade shows such as: NECANN, Vermont and Chicago; CWCBE, New York; Indoor Ag Tech Summit, New York; and more. The states we are looking forward to in the near future are, of course, New York, New Jersey and Mississippi and we have been targeting those states for some time now. Regarding the indoor or CEA indoor food market, we see the indoor ag market is much like the cannabis market was in its beginning days. But we believe the indoor ag market will blossom as cannabis did, which is why we are enacting several state and marketing initiatives towards that market. Our sales and marketing investments are focused on driving new bookings, which are contracts. We have discussed these issues in the past and have several initiatives in place to mitigate the effects of supply chain delays, such as diversifying our supplier network. Second question or third question, you have consistently mentioned M&A initiatives this year, but we havenâ\u0080\u0099t seen anything materialize. Just to add to that as the cost of capital has gone up over the last several months, we are seeing a bit of a lag between the decline in asset valuations and private seller expectations. Again, as interest rates and ultimately, the cost of capital has gone up, smaller private investors are eager to make sure they are generating returns and in the casualty of that projects start to get reconsidered. An audio replay of this call will be available on ceaindustries.com/investors, beginning on August 12 at 4:00 p.m. Eastern Time and will remain available until August 26, 2022."
}