{
    "symbol": "CEAD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 15:34:09",
    "content": "  Operator: Good afternoon, ladies and gentlemen, and welcome to the CEA Industries Q3 2022 Earnings Conference Call. Joining us today are the company's Chairman and CEO, Tony McDonald, as well as the company's CFO, Ian Patel. These statements reflect CEA Industries' current beliefs and a number of important factors could cause actual results to differ materially from those expressed in this call, including the risk factors set forth in the company's Form 10-K, which was filed with the SEC. Also, please note the company filed its quarterly report on Form 10-Q and issued a press release announcing third quarter results earlier today. If you would like to be added to the company's e-mail distribution list, please send an e-mail to info@ceaindustries.com. Subsequent to the quarter, we signed multiple new contracts with indoor produce farms located in New York and Florida for our engineering services, which are outside of our traditional cannabis vertical. As I have mentioned on past calls, we recognize the growing opportunity to tap into the larger vertical agriculture market and these wins reflect our execution of that initiative. More recently, we entered into a significant new nonequity strategic alliance with Hydrobuilder Holdings LLC, leading omnichannel platform with 22 retail locations and 10 warehouses serving the indoor and outdoor CEA in hydroponics industry. This alliance will combine our industry-leading CEA systems engineering and technologies with Hydrobuilder Holdings expansive commercial-first omnichannel platform, creating a one-stop shop solution for cultivation companies across North America. Over the summer, we announced a formal partnership with Merida Capital, a cannabis-focused private equity firm in which Merida agreed to use us as its sole provider of certain projects and services for its innovation facilities. In October, we signed a contract with one of Merida's Connecticut-based clients to provide a suite of HVA systems that include our EnviroPro Air Handlers as well as heat recovery fan coils, dehumidifiers and circulating fans. Our partnership with Merida has quickly materialized with new business, and we look forward to continue growing this relationship as it presents a high-quality, high conversion sales channel for our business. In addition to our sales and marketing investments highlighted last quarter, we recently started working with Agritecture, advisory services and technology firm, focused on climate-smart agriculture. Similar to our success with Merida, we believe this partnership will enable us to accelerate the growth of our sales pipeline in the vertical agriculture market. With our strong balance sheet, we can remain diligent in our pursuit of accretive opportunities that will bolster our service and product offerings, which we believe could accelerate our growth and profitability in the future. Gross profit for the third quarter of 2022 was $600,000 or 11.8% of revenue compared to $700,000 or 20.2% of revenue for the same period in 2021. The decrease in gross margin was primarily driven by an increase in our variable costs, which include the cost of equipment, external engineering costs, shipping and handling and travel and warranty costs as a percentage of revenue as well as the reallocation of certain operating expenses to cost of goods sold. Net loss for Q3 2022 was $1.0 million or negative $0.13 per share compared to net loss of $400,000 or negative $1.69 per share in the year ago quarter. As of September 30, 2022, cash and cash equivalents were approximately $21.1 million compared to $2.2 million as of December 31, 2021. Looking ahead, we plan to continue executing our organic and inorganic growth initiatives while expanding the business outside of cannabis. As I mentioned earlier, our strong balance sheet enables us to be patient in our pursuit of M&A and we plan to execute an accretive transaction when the opportunities arise. The expansion of our partnerships and product lines, coupled with our investments in sales and marketing will continue to fuel our growth in the coming quarters. We look forward to exiting the year with strong momentum, and we'll provide further updates on our business initiatives during the next conference call. Well, given that we formalized the alliance with Hydrobuilder just a couple of weeks ago, it is too early to expect the benefit in Q4. However, we do expect to see the partnership benefits next year as we collaborate on sales opportunities as our delivery pipeline can take many months. First, we're looking to partner with companies that are profitable and margin accretive to our business perfectly with deep roots in either the traditional cannabis or vertical ag industries. Public markets typically see the first hit, which we've been experiencing all the year, but there was a delay in seeing that permeate into the private market. An audio replay of this call will be available on ceaindustries.com/investors beginning on November 15 at 5:00 p.m. Eastern Time and will remain available until November 28, 2022."
}