{
    "symbol": "IDN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-14 00:58:03",
    "content": " Before we get started, I will make, I will take a few minutes to read the forward looking statement. When used in this conference call, words such as will, believe, expect, anticipate encourage and similar expressions as they relate to the company or its management, as well as assumptions made by any information currently available to the company's management, identify forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. As if any projection or forecast, they are inherently susceptible to uncertainty and changes in circumstances and the company undertakes no obligation to and expressly disclaims any obligation to update or alter forward-looking statements, whether resulting from such changes, new information, subsequent events, or otherwise. Statements made on today's call are as of today, June 13th, 2022. Please refer to the company's press release issued this afternoon for further definition, reconciliation and context for the use of this term. We will begin today's call with Bryan Lewis and Intellicheck’s Chief Executive Officer, and then Jeff Ishmael, Intellicheck’s new CFO, who will discuss the Q1 2022 financial results. Jeff is a very operationally focused CFO with extensive SaaS experience and was the founding CFO at Cylance where he was employee number seven, he had an instrumental role in the company's success. This was followed by his role as the first CFO of Obsidian Security, another SaaS based startup that was founded by key members of the Cylance team. In addition to Jeff's extensive SaaS focused financial experience, he also brings extensive operational expertise having overseen significant organizational functions, including business operations, business intelligence, legal and HR. Before getting into our first quarter results, I'm going take a few minutes to give some additional color to our recent restatements that led to the delay in reporting our Q1 results. During the first quarter of 2021 Intellicheck employees did a cashless exercise of incentive stock options, due to an isolated administrative oversight resulting in part from the change in payroll providers. The oversight is being recorded as a 1.244 million liability on the balance sheet as liabilities for shares surrendered on the March 31, 2022 and December 31, 2021 balance sheets. In conjunction with the issue above the company, determined that certain participants associated options awards no longer qualify as equity rewards, but rather as a liability resulting in an additional liability of 141,000 for the three months ended March 31, 2022 versus the prior year period. This change in classification to liability resulted in an adjustment to the first quarter of 2021 equity compensation expense, increasing it by $3.56 million. As a result of the first quarter 2021 restatement, SG&A expenses related to equity compensation decreased for the three months ended March 31, 2022 by $3.95 million compared to the same period of 2021. To ensure that this type of narrow isolated incident does not happen in the future, the company has engaged in a nationally recognized fintech company specializing in managing employee stock option plans to coordinate the management of transactions by employees, with respect to exercises of their stock options. In addition, as a further safeguard, future cashless exercise of stock options will be settled by the sale of the surrendered shares and will be administered by our third party provider. As a reminder, these restatement amounts were predominantly non cash, had no impact on revenues or EBITDA and again, we have put safeguards in place and have engaged third-party specialists to administer and advise on the equity compensation plans. Turning now to our quarterly results, I will share the highlights with you, and then Jeff will go into further financial detail later in the call. SaaS revenue was up 21% over Q1, 2021 and down 10% from Q4 2021. I will remind everyone that generally for our retailers using our products either directly or through a sponsoring bank, 33% of transaction volumes occur in Q4 and 21% of volume occurs in Q1. As we look at what happened during the quarter, I believe that the results show that number one, clients continue to find new uses for our products. Number two, we continue to expand in our core markets and number three, we are continuing to find new markets that need our services. Looking at our financial services clients, we are seeing strong progress with financial services company, number three. Financial services company, number four has completed the rollout of the bank mobile platform, where the bank employees come to you in the lobby and process all your banking needs using a tablet. You may remember that last year, this client purchased a bucket of transactions that they expected to meet their needs over a one year period. The security audit at the top three banks we spoke about on the last call continues and as I said, it seems the larger the bank, the longer the process. The good news is that while it is happening, the bank is continuing to work with us to identify additional areas in which our services could be used. On the retail client front, I'm pleased to report another important development. Our off price retailer that started out using Intellicheck for parsing to prepopulate applications at their 3000 locations and that we just renewed for a three-year deal, has completed the rollout of an additional use case at their locations. In addition to credit applications, they have now begun using us for no receipt returns. Looking at new wins, we have signed a prestigious new client and have moved them into production. They can get banking information, credit card information, and just as importantly, password resets. Now if someone at this client calls to reset a password, they will be asked to authenticate themselves using Intellicheck software. Even though this client went live just recently, we are already in discussions with them about other divisions that could potentially use us in North America with the further potential to expand internationally. In addition to this, we have successfully completed a response to the New Hampshire unemployment security RFP. While not a large state when it comes to unemployment claims, I believe that given the issues many states are having with their current provider, this could become an important entree to that market. The first is a bank holding company headquartered in the south with almost 2,800 branches. In response to those who have asked about the traffic coming from retailers, I could say it's very healthy and growing. Please note that I only looked at fully implemented retailers, so as not to skew the data with a rollout or a new use case. When new use cases are added, the transaction volume use case goes up significantly. For example, I looked at the first four months of 2022 versus 2021 for the off price retailer I spoke about who added no receipt return since they completed rollout at the end of April. A lot of people still think we are primarily tied to brick and mortar retail, but let me remind you that is not the case. Again, I compared Q1 2022 to Q1 2021. So before I turn the call over to Jeff, there are some statistics that I think are noteworthy given their impact on selling. In the last year alone versus the previous year, account losses in key areas like checking and savings accounts increased 73% from $7.8 million . New account fraud rose $6.7 billion and the amount that hit the consumer rose 672% with an average of $1,551 loss per victim. What I find promising is that I believe that the new clients we are signing, the pilots that are starting and the number of leads that are coming to us indicate that key markets are beginning to take notice. In closing, we have added new leadership to the finance team with a SaaS experienced CFO who knows how to drive growth, analyze data, and has extensive operational and systems expertise. At the same time, we are continuing to seek sales associates that have related industry experienced and relevant relationships. During the quarter, we added two new members to the sales team with relevant experience, and they have hit the ground running. I remain enthusiastic about the future for Intellicheck as we continue to expand our presence in multiple markets like automotive, banking, global email providers, and age restricted product to delivery services while we advance as a global, fully automated identity verification and fraud prevention company with what I believe are significant opportunities ahead of us. Revenue for the first quarter of 2022 grew $532,000 or 19% to $3,395,000 compared to $2,863,000 in the same period of 2021. Our SaaS revenue for the first quarter of 2022 grew $577,000 or 21% to $3,353,000 from $2,776,000 for the same period of 2021. Gross profit as a percentage of revenues was 90.7% for the first quarter of 2022, compared to 92.3% for the same period of 2021. The decrease in gross profit percentage was primarily driven by higher cloud services, cost, and other web based support. operating expenses, which consists of selling, general and administrative, marketing, and research and development expenses were $4,547,000 for the first quarter of 2022, compared to 7,281,000 as restated for the same period of 2021 due to the reclassification of the options as discussed. Included within operating expenses for the first quarter of 2022 and 2021 were $592,000 and $4,545,000 respectively of non-cash equity compensation expense also due to the reclassification. On a non-GAAP basis, excluding the impact of non-cash compensation expense in both periods, operating expenses increased $1,219,000 or 45%. The company reported a net loss of $1,468,000 for the first quarter of 2022, compared to the restated net loss of $4,624,000 for the same period of 2021. The weighted average diluted common shares were $18.7 million for the first quarter of 2022, compared to $18.5 million for the same period of 2021. Adjusted EBITDA for the first quarter of 2022 was a loss of $80 6,000 compared to a loss of $51,000 for the same period of 2021. Turning to the company's liquidity and capital resources, as of March 31, 2022, the company had cash of $11.1 million, working capital define as current assets minus current liabilities of $9.7 million, total assets of $23.5 million and stockholders’ equity of $18.9 million. As of March 31st, 2022, we had net operating loss carry forwards of approximately $18 million. Please proceed with your question. Yes, they have been using us just for credit applications and they were getting hit with a lot of fraud on the note receipt return, which is where the retailer always eats all the fraud loss. They said that that would probably double the transaction volume and as I said on a call, it appears that is the case. We kept them flat in the first year of it because we were working on getting this new use case next year, the fees go up 87% and in the third year they go up 33%. Just sort of…\n Very, very, yeah, I'd say very, very few. So certainly it's one of the areas that we're going after with any one of the clients that we're already in, particularly the clients that we're already in because they don't have to do any work. Like we're already integrated into their point of sale system, they just need to make it work for a new use case. So that's, you know, Bruce has any one of the sales people that covers a bank that has retailers, we're going directly to the retailers to see, you know, what their interest is in this use case. And, and then secondly, financial services client number eight, I didn't completely catch what you're going to be doing incrementally for them. They've got an interest in passports and then potentially other international documents, besides passports. So they're looking for us to authenticate things in addition to driver's licenses and state IDs, they want to be able to use international documents as well. One of the things that we brought out with the Identity platform was the ability to do international, something that we couldn't do before. And I'd say we're, I'm breaking out integrations to be sort of a difference between what I'd call more provisioning, where we're setting people up with our web tool and then direct integrations to somebody who's using, what we call IDN-Direct. So for the I, and before we used to complete, conflate those two things really, I think it's a better thing to look at what is direct because that tends to be more high volume versus what is a provisioning, which can be high volume, but generally sort of small, medium volume. And we've got about 10 different IDN-Direct implementations in various stages either in active development or planning, which is kind of consistent with where we used to be in the past. But when we conflated the numbers, it sounded like a bigger thing, but it was better to give people an idea of what is probably more revenue driver than a provisioning. Please proceed with your question. Hey Scott\n Bryan, you gave us some good same-store sales year-over-year, color of 6%. I I'd say it's still slightly below, not by much though, we're getting there. Well, what I'd say is, we did a lot of investment last year. Like for example, to bring out the new identity platform we needed to jumpstart some of our development team. It's got a beginning, middle and end, and then we don't need the people anymore. And so to me, that to hire outside consultant developers to do that because they want to extent, you just turn off their contract, which is what we did in that case. The other thing that we've done that was new expense for us, we never had a marketing team before. And we built that out and we're spending money on marketing, and that is certainly paying off. I will say that, that media giant that we talked about came in as an inbound lead because the marketing works so well. So really, the goal now is I think we rightsized. If we find the right salesperson, we're going to make them an offer. I think for the most part, that's probably the best word to use partnership, maybe work together if it's something that is symbiotic and see if it really does make sense before you jump in. And I don't know, it seems a lot of times, I don't see it really adding a ton of value. So at this point in time, I think I'd rather keep the cash on the books for – if I see things that could to spend maybe on salespeople or other things like that. But right now, I think we've got a ton that we can be doing just to grow and sell and I'm kind of focusing on that. Please proceed with your question. That's more of a Board level decision, what I'd say, and historically and currently, the Board's opinion is not to give guidance. If you could, on the two new bank pilots, and I guess maybe throw in the top three credit card issuer that's in the security audit. Because some of the banks say, well, I'm only going to do it if it's a transaction $2,500 or greater. Some are thinking, no, I need to start at $500. So I'd say at this point in time, I think that very good opportunities, but I couldn't give you an accurate number that I'd want to hang my hat on today. I would say that probably as we get closer to launch of the proof-of-concept, we have better insight into that because knowing exactly what their decision tree on risk is I can compare it to some other bank of the same size and then come up with an estimate. On pricing increases, last quarter, you said 1,100 store department chains that had a 33% price increase that was supposed to go through this quarter. And then secondly, you said FinServ two and three would be renewing at some point this year. Yes, that's going to be next quarter. And I would say that, I'm very happy with so far the price increases that we've agreed to because they are a combination of price increases and volume guarantee. But I'm going to knock the way down and I don't want to jinx it all yet, but we're in the final stages of – we're in the stages of finalizing all of that now. And then just lastly, the transitions to the new pricing model, where people are paying upfront. So – and then they apportion certain costs that just for their accounting, they're going to want to do it pretty much pay as they go, so it's similar to where they were. And as I said, too, there's going to be guarantees to the number of transactions that we're going to do. And then on the sales side, you said you added two this quarter. And I know you've had some challenges, some turnover in the sales org. Have you seen any improvement in the recent hires working out better than the hires over the last one year, 1.5 years? We're about – I think we are eight or nine salespeople, nowhere near where I want to be. The two guys that we hired, already the meetings that they brought me to, I'm very pleased with. Please proceed with your question. Appreciate it for taking my questions, so first question, just a follow-up on that question about sales. Look, I think that we could – as we begin to focus more on a vertical alignment of salespeople so that they're speaking the same language as the client. But when we are – when we start to get bigger and we know that we can focus on areas, what we're doing is looking to hire people who are experts in that area. And as we size up the opportunity by vertical, then we're going to get a really good idea of where we want to hire people because – the way that I look at it, if you're not speaking the language, you don't have any credibility. And you guys get it in the fine world, people talk duration; and equity world, they talk volatility; and nobody from the different world knows what that means. I want to make sure that somebody is going in and talking to an auto dealership, they know the language. I want somebody who knows the market that they're going after, has a track record of proving that they can succeed in and understand the awesome opportunity that they have coming to Intellicheck as a salesperson. To me, that's – I'm always looking for more than we're providing. So – but I would say that given it's a new sales team, given it was and they were building pipeline and things, I think it was within where we wanted to be. And certainly, the sales people that we have who are successful always want to do more as well. So within bounds, given that number two, going into a code freeze. And then last question, just related is actually about a follow-up on that code freeze. I think previously, you said Q3 that, that would be completed. It's just a matter of when in Q3 because that will depend to when all the retailers go into a cold freeze, where in Q4, they go into it will have an impact on implementations this year. Please proceed with your question. A couple of things, I wanted to follow up on the comments about the pre-purchasing the buckets, and separately, the guarantees. How do those, call them, changed marketing approaches affect the quarterly pattern that you have guided us to in the past, the 21% in Q1 and 33% Q4 and so forth. So the one thing I'd say, the guarantees, the only thing that – and Jeff correct my accounting because you know how much I hate accounting, those guys are basically build in arrears. But for the most very large retailers, Roger – the large retailers, given the nature of how they do their expensing, they're saying on a model where we're going to build them in arrears. The bank that has prepaid, we have a lot of the retailers who pay us direct and then they reimburse the retailer. A lot of the other clients and the other markets that we have, they're the ones who are prepaying a bucket. Well, I think you – it would help if you were more forthcoming. I don't – I mean, more – sharing more with us in terms of the adjustments to the revenue models that we're carrying in our heads. For instance, if a shortfall, if an arrear age is trued up in the Q4, maybe there's a thesis that Q4 is going to be notably higher percentage of annual than the 33%. So as things play out, hold our hands in terms of how to think about it. I was struck by the Javelin data; at least, I think they're from Javelin. Astonishing numbers, which puts up in bright lights to me, the – one of the mysteries of your penetration or lack of penetration among the existing financial services companies, where these are credit card issuers, they've got some, call it, retailers out there who are on board and presumably happy to be shouldered from these fraud patterns. But why isn't the door – your doorway having other retailers and relevant customers of the FIS – I'm sorry, financial services company. Those types of things, which is why the spend on marketing was important to me. I think it was very interesting that the top three banks that we're talking about, even though we were working with them, a whole new division of that bank came to us through going to our website and filling out a form because they wanted to hear about us. I think, there's also – as I said, I'm always looking – I need more people, more quality people knocking on doors. I mean we're just looking for them, and we're adding them. So I think it's a combination of things, but again, this company has short change marketing itself for a very long time. And I think it is happening now, and knock away if it's increasing. And when I say quality needs, there's – they're all good, but a bar to me is very different than a super-regional kind of banks coming in and saying, I need to talk to you guys about what we do. Finally, I had expected you to give texture and commentary about the platform 2.0, that I've felt that it represented a departure, a quantum increase in capabilities and opportunities and you were excited about it, but there was not a word in the prepared remarks. No, one thing I did say, Roger, was what we do know – and remember, every new clients going on the new platform. So there, I would say that we've got a lot of very interesting things happening with the Identity platform with clients who are looking to, all right, how do I incorporate now the sanctions information or the international information. One, banks don't like the pure pipes you have coming into a fewer chance you have for a cyber event. So we often find that the bank itself, when they find something that they want, they'll go to a vendor, we could pass that through. So now they're coming to us because we're the first step, we've got all the information. Once they give us the – we get the deal or pass forward or international document information, we can go connect all the people that we're talking to, all the different vendors that we're acting as passes for, grab what that client needs, package it up, mark it up and get it to the client. Sales sometimes take a bit, but it's beginning to show fruit. I think its – Roger, kind of stole some of my – what I was going to say in the closing. The surge in identity theft and fraud, I think, really does highlight why people need our product. It's happening across every vertical, every market, and we can play in every vertical and every market. And I think the fact that we continue to expand our market penetration both in our original core market of credit cards and banking, but we're also proving our value in all of these other new markets as well. So to me, the new Identity platform, the ability to do more for our clients is going to be great thing and I continue to be excited about what lies ahead for Intellicheck. And this concludes today's conference, and you may disconnect your lines at this time."
}