{
    "symbol": "XPEL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 14:42:03",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to the XPEL Incorporated Second Quarter 2022 Earnings Call. Good morning, and welcome to our conference call to discuss XPEL's financial results for the 2022 second quarter. On the call today, Ryan Pape, XPEL's President and Chief Executive Officer; and Barry Wood, XPEL's Senior Vice President and Chief Financial Officer, will provide an overview of the business operations and review the company's financial results. During the course of this call, we will make certain forward-looking statements regarding XPEL, Inc. and its business, which may include, but are not limited to, anticipated use of proceeds from capital transactions, expansion into new markets and execution of the company's growth strategy. Often, but not always, forward-looking statements can be identified by the use of words such as plans, is expected, expects, scheduled, intends, contemplates, anticipates, believes, proposes or variations, including negative variations of such words and phrases or state that certain actions, events or results may, could, would, might or will be taken, occur or be achieved. The forward-looking events and circumstances discussed in this call may not occur by certain specified dates or at all and could differ materially as a result of known and unknown risk factors and uncertainties affecting the company, performance and acceptance of the company's products, economic factors, competition, the equity markets generally and many other factors beyond the control of XPEL. Although XPEL's attempted to identify important factors that could cause actual actions, events or results to differ materially from those described in forward-looking statements, there may be other factors that could cause actions, events or results to differ from those anticipated, estimated or intended. Except as required by acceptable securities laws, forward-looking statements speak only as of the date on which they are made and XPEL takes no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events or otherwise. We had a very strong quarter, highlighted by our record revenue, gross margin and EBITDA performance. It was an outstanding result when you consider the poor but not unexpected Q2 new car SAAR in the U.S., the lockdowns in China that occurred in Shanghai area. And we had strong performance across most of our regions, certainly evident in our U.S. region, which grew 43.4% to a record $49.2 million in the quarter. So that's off of lows that we've seen on modestly higher new car inventory, but we're still operating at less than 2/3 capacity, as has been the case for the past several quarters. Most of our company-owned facilities continue to experience strong demand, which generally means our aftermarket customers are also continuing to see strong demand in their shops. Looking outside the U.S., record revenue in Canada, Europe, U.K. and Latin America still see strong demand in Canada in one of our most mature markets, but proving there's still room to grow there. Europe continues to perform even in the face of the negative FX impact to revenue and margin, resulting from the strengthening U.S. dollar, particularly against the euro and the pound, not so much against the Canadian dollar unlike in the past. Measuring rates as of Q2 2021, revenue was negatively impacted by approximately $1.7 million, and margin was negatively impacted by approximately $400,000 for the quarter. And we expect worse FX impact to revenue, gross margin in Q3 for sure, just with the way rates have moved, and then one would assume in Q4 as well. As we discussed on last quarter's call, we were expecting our Q2 China sales to be reduced by approximately $5 million due to the COVID-related lockdown situation in the region and in Shanghai in particular. So with the impact of China and then the currency, U.S. dollar strength, we saw almost $6.5 million worth of negative impact to our overall revenue plan. So absent those impacts, revenue growth would have been a little over 31% year-over-year. We had good gross margin performance for the quarter, and we continue to make great progress on our initiatives in this area, and we finished the quarter at 39.3%, great result. It's even more impressive when you consider what we just talked about, strengthening U.S. dollar puts pressure on gross margin with U.S. dollar-denominated product cost everywhere we sell. And the quarter gross margin was negatively impacted by about $400,000. So overall, it's certainly a net negative any time your revenue is down. Overall, improvements to gross margin are consistent with the strategy that we've been talking about. And even with sort of all of the noise there, we remain very confident in our ability to reach a 40% gross margin run rate exiting the year. Obviously, you see we're very close there for Q2, but we get the mix benefit with China. China should represent an increased percentage of sales, but we still should be able to make that up in the second half of the year. Obviously, we're not -- even with a good gross margin improvement program we have, we're not immune to the trajectory of cost that everyone is seeing overall. Another big highlight for the quarter reached the highest EBITDA margin in our history, 20.5%, first quarter that we've ever exceeded 20% EBITDA margin. And like we talked about in the other comments, we achieved this result despite encountering approximately $2 million in EBITDA headwinds related to the China lockdowns and the strength of U.S. dollar over the prior year. So you consider that, if those 2 things hadn't occurred, our EBITDA margin for the quarter would have approached 22%. So all the way around, I think it's consistent with what we've been saying. We work our gross margin plan to completion and then manage expenses, which are still trending a little bit higher on a percentage of revenue basis than we'd like, but you put it together and you can drive operating performance in this business, and we are and we expect to continue to do so. This is a little less than our previous guidance of 30%, mainly due to China impact in the first half, slower recovery of China in the second and then strengthening U.S. dollar as we've talked about. That said, manufacturers have been more bullish in their expectations for new car production recovery in the second half. And if you look at the comments from the manufacturers, I'd say they've incrementally become more positive about the production recovery and the concept that there's pent-up demand on our new car buyers in the channel, which we believe. So we expect revenue for Q3 in the $85 million range, plus or minus, which represents improvement in China and increased headwinds from continuing strong U.S. dollar. Q3 picks up Europe holiday season, Europe OEM plant shutdown for sort of the same reason is now a factor for us in terms of revenue. And it's also our greatest time of the year for marketing events, which drives SG&A. Last year, we saw our highest EBITDA in Q2 and then sequential declines in Q3 and Q4. But absent those type of things happening or other one-offs, there's nothing sort of structurally different about Q3 or Q4 versus Q2. So in other words, there's no reason that Q2 should year after year outperform Q3 from an operating standpoint or even outperform Q4. From the product side, window film business continues to do great, grew 42% for the quarter up to $60 million, sequentially was up just about 37%, so almost 19% of revenue for the quarter. So still small, but growing, and we're seeing really good year-over-year growth each month this year as we continue to execute the strategy there and expect that to continue to grow as a percentage of sales and a percentage of window film business overall. Last month, we announced our partnership with Rivian, electric vehicle manufacturer to be the exclusive supplier of their factory direct paint protection film program. We finished the quarter approximately $74 million in inventory, which is relatively flat to Q1. So we expect the inventory to peak within a few million dollars of where we are, plus or minus, or I guess it would not be minus but plus, between now and early Q4, which is probably a little bit later than our previous estimate. But regardless we remain well positioned to mitigate any of the supply chain risks, and we've really seen the bulk of that inventory build. So that's a substantial departure just as a reminder, from the first half of this year where we used almost $23 million in cash, almost $23 million of cash to build inventory. So that inventory build has effectively stopped and then we will begin to release some cash from inventory, but that's just probably pushed back a little bit further in the year. As we talked about before, we took the first part of this year to finalize the integration of everything that we had done last year and reassess our strategy and program and go forward. We've discussed previously that we've got a desire, an ongoing program to really invest in the software offering and build the best platform we can for our customers to use to run their business, and this will be part of that. And as in the prior quarter, this growth was driven by increased demand in our company-owned facilities that Ryan was talking about and acquisition-related labor revenue from our dealership services businesses. On a year-to-date basis, total service revenue grew 80.1% to $30.6 million. And keep in mind that sometimes our product revenue is converted to service revenue when we do these acquisitions, such as PermaPlate and Tint Net. Total installation revenue, combining product and labor, increased a little over 106% and represented 15.7% of total revenue. And overall, our total revenue was up 16.7% sequentially versus Q1. And again, as Ryan mentioned, we were pleased to see gross margin coming in at 39.3% for the quarter. Sequentially, gross margin was up 19% from Q1, and our year-to-date gross margin finished at 39%. And for the first half of the year, total SG&A expenses were up a little over 56% and represented 22.4% of total revenue. And part of this quarter-over-quarter growth is due to increases in travel-related expenses, as our team has returned to conducting more in-person meetings and providing more outbound training and holding more marketing events. And we think this is important after the last 2 years of limited in-person contact, and we're actually happy to see these expenses increase as we think we get great returns on that investment for sure. Sequentially, SG&A expenses were down approximately 2.5% versus Q1, but we did have some one-timers in Q1 related to our dealer conference. Q2 2022 EBITDA increased 26.6% versus the prior year quarter to approximately $17.2 million, which again was a record for the company. And on a sequential basis, EBITDA increased 44.9%. And as I mentioned before, our sequential revenue increase was 16%, so we saw some great leverage quarter-to-quarter. And as Ryan mentioned, we achieved these results despite China headwinds and the challenges related to the strengthening U.S. dollar. So if you normalize for all that, Q2 EBITDA would have grown a little over 40% versus Q2 2021. And on a year-to-date basis, our EBITDA grew 27.8%. Q2 2022 net income increased 16.8% versus Q2 2021 to $11.9 million, which reflects a net income margin of 14.2%. So normalizing just for the FX impact, net income would have grown a little over 21%. And on a sequential basis, net income grew 52.5% versus Q1. On a year-to-date basis, net income grew 15.7%, and our year-to-date net income margin was 12.7%. And our debt level could go up or down in future quarters, depending on the excess cash that we generate and the timing of any future acquisitions. So actually we're very pleased with the quarter, and we're excited about the rest of the year. When you look at how much you're outgrowing new car sales, particularly in the U.S., I mean, could you sort of break down the biggest drivers, whether it's sort of attach rates or the amount of film going on for vehicle. Clearly, attach rate for paint protection film is increasing, has been increasing, and we think we'll continue to increase. Within the paint protection film business, the trend over time has been more product per vehicle on average. So you used to cover a smaller portion of the cars in aggregate, and that's grown over time and probably continues to grow. Then we have additional products that are allowing us the opportunity for more content per vehicle, be they starting with coatings and the window film products where we're able to take market share in some of those cases, particularly in the window film business where it's a more established business. And then I think to the extent that we're in the service business, increasingly via acquisition and other things, that has the ability to drive dollar content and dollar-denominated growth in excess of what you would get just for the product sale, just simply because the service is priced so much higher than just the product. As you look at kind of the dealer base, I guess, first of all, could you remind us sort of how many franchise dealers are selling your PPF. And I think you will find many, many dealerships that don't offer paint protection. And the opportunity is to obviously offer it if you're not, and then offer it with greater conviction and much greater unit volume, much greater attachment to units sold. When you get the dealers involved, and it's not as driven by the enthusiast buyer who's conventionally about the product in the aftermarket, you can get attachment into a much broader range of vehicles, and we think that that's really important to do. I was going to ask, I mean, I bought a vehicle this quarter -- during the quarter and ironically or maybe not so ironically, it came about half of the vehicle's already sort of preloaded with XPEL. Or is that sort of strictly dealers looking for margin enhancements and just sort of preloading it on and basically making people say they don't want it, which rarely happens. The -- when you look at the environment we're in with the shortage of new car inventory, we talk a lot about the takes and puts that occur in that environment. One is that dealers having an opportunity to do more preloading and do that sort of upfront accessorization, so that might be what you're seeing. And yes, it's typically, ultimately motivated by the dealer's profit motive like anything that they would sell. But -- what our job is, is to help educate the dealers that paint protection film is in fact, a better alternative, in our view, than many of the other things that they sell or preload. You can leave a lot and cancel it and hard add like a paint protection film that's actually on the car, that stays. What our job is and what we're doing and we'll continue to do is to say, the paint protection film is a product that customers love, those that buy at once are incredibly likely to buy it again. And it's a real tangible product with demonstrable value, and therefore, it's a better thing to sell with these new cars than maybe some of the other things you're offering. And what the OEM channel has the ability to do is to reach buyers today that we wouldn't reach in many cases, any other way either because the dealers aren't offering it or the customer is not aware of it. So especially in Rivian's case, they've been very forward in terms of marketing it, talking about it, branding it as XPEL. So I think they've done themselves serviced by doing that, and they've done the broader business of paint protection film service by introducing it to a lot of people that didn't know about it. I think when you look at Rivian with an alternative channel, it's allowed them to engage in marketing activities and whatnot direct to the consumer because they're that much closer to them. And those, I would say, haven't necessarily run together in -- over the past 3 quarters. Now it seems like maybe they're coming in to alignment a little bit more where we have reports from dealerships getting sort of increased fill rates, increased delivery rates and that seems to tie a little bit more into what you hear the manufacturers talk about. So if you went back to last year, our expectation was that Q2 would see a meaningful improvement in the overall inventory situation. And while I think the inventory ticked up off of the lows for Q2, no one would probably call out a meaningful recovery. But it does seem now that there's kind of room for optimism there for the rest of the year, both by what we're seeing even in fits and starts at the dealership level and then matching that with the OEM's public comments. Make sure that's -- yes, yes, absolutely. So still, you're running -- I think you said less than 2/3 capacity in dealer services. Well, I think the question was even a few quarters ago, did we expect that the inventory to recover such that we could maintain that capacity, and we were pretty adamant that we believed it would and that we wanted to do that. So the first order of business, hopefully, as that inventory recovers as we use more of the capacity that we have and that is accretive to gross margin. But I do think that, that's something that we are looking at and open to as a way to build out that platform. But like we did with that, a little tuck-in there, and there's probably some other opportunities for that, certainly ones we would consider going forward. Thanks, everyone, and thanks to the XPEL team for doing a great job and looking forward to speaking to everybody in the future."
}