{
    "symbol": "XPEL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 15:45:21",
    "content": " Q4 China sales came in at $6.2 million, which was a 50% decline from Q4 2021, and obviously, thatâ\u0080\u0099s significant considering Q4 has historically been the highest quarter for China, while itâ\u0080\u0099s seasonally a lower quarter for most other regions, which normally peak in Q2 or Q3. So effectively, even in the U.S. business, while you wouldnâ\u0080\u0099t know it from 36%-plus growth, thereâ\u0080\u0099s a slight drag on Q4 with the dealership focus TintNet, one hand the business actually being down versus the prior year given new vehicle availability in the markets that it serves. And given the revenue growth we expect this year, inventory probably doesnâ\u0080\u0099t go lower than $75 million, but it still means we do not expect to commit substantial cash flow to inventory this year like we did in 2021 or 2022 and we are planning across all product categories or reduce days on hand. We have a long runway in that product segment, OEM business, which is about 3% of revenue today had a good year setting up for a great 2023 and we have a variety of expansion opportunities within the current book of business and the new projects that are contemplated. As I mentioned earlier, we expect gross margin to improve around 200 basis points throughout the year to get us to that sort of ending run rate again, a 200-basis-point improvement and we expect SG&A in the 22% range, thatâ\u0080\u0099s plus or minus 1% probably. Our Q4 vision product line, which is our architectural window film, revenue grew 95% to $1.2 million, and on a year-to-date basis, vision revenue grew 98% to $5.7 million. And also, as Ryan mentioned, our OEM business had a great year with revenue growing approximately 64% to $10.2 million. I think you are right in that, itâ\u0080\u0099s probably hit less than 50% of the customer base for the -- in the quarter or for the portion of it in the quarter, but it actually probably hit even less of the revenue, because it was really product oriented and not service oriented."
}