{
    "symbol": "JP",
    "quarter": 4,
    "year": 2021,
    "date": "2022-03-29 11:34:07",
    "content": " And welcome to Jupai's earnings conference call for the fourth quarter and full year ended December 31, 2021. Leading the call today is Mr. Jianda Ni, our Chairman and CEO, who will reveal the highlights for the fourth quarter and full-year 2021. Jupai is committed to asset allocation and product transformation with continued focus on equity and the secondary market products, mutual fund products and other net worth net products. We are encouraged to see the other products, including insurance, accounted for 6.4% of the aggregate value of wealth management products distributed in the fourth quarter compared to 4.3% in the last quarter as we continue to further diversify our product categories. Net revenues for the fourth quarter of 2021 were RMB 70.4 million, a decrease of 28.2% from RMB 98.0 million in the corresponding period in 2020. For the full-year 2021, net revenues were RMB 359.1 million, a decrease of 7.5% or RMB 388.2 million in 2020. Operating costs and expenses for the fourth quarter of 2021 were RMB 89.3 million, a decrease of 2.3% from RMB 91.4 million in the corresponding period in 2020. For the full-year 2021, operating costs and expenses were RMB 360.2 million, a decrease of 14.8% from RMB 122.6 million in 2020. Net loss attributable to ordinary shareholders for the fourth quarter of 2021 was RMB 248.3 million as compared to net income attributable to ordinary shareholders of RMB 2.0 million from the corresponding period in 2020. For the full-year 2021, net loss attributable to ordinary shareholders was RMB 267.9 million as compared to RMB 331.4 million in 2020. Net loss attributable to ordinary shareholders per basic and diluted American deposit share for the fourth quarter of 2021 was RMB 7.30 and RMB 7.30 respectively as compared to net income attributable to ordinary shareholder per basic and diluted ADS of RMB 0.06 and RMB 0.06, respectively, from the corresponding period in 2020. For the full-year 2021, net loss attributable to ordinary shareholders per basic and diluted ADS was RMB 6.08 and RMB 8.08, respectively, as compared to RMB 0.94 and RMB 0.94 respectively for 2020. As of February 25, 2022, we have repurchased 1,922,180 ADS as part of the company's 24-month share repurchase program of up to US$10 million announced in February 2020 at a total cost of the US$2,109,847 inclusive of transaction charges and related fees. Jupai is committed to focusing on asset allocation and product transformation, with continued focus on equity and effective market products, mutual fund products and other net worth asset product. In terms of equity products, the number of listed issuers with underlying assets in Jupai's private equity funds reached 26 for the whole year of 2021, and 6 of them were listed issuers in the fourth quarter covering areas including high tech, health care and consumption industries. We continue to further diversify our strategy for secondary market equity fund products, with the current asset under management reaching RMB 1.5 billion, covering products with diverse strategies from aggressive to conservative, as well as quantitative and high frequency trading, stock picking. In the fourth quarter, secondary market equity fund products, including mutual funds, accounted for 88.2% of Jupai's equity value of wealth management products distributed. In addition, other products such as insurance accounted for 6.4% of the aggregate value of wealth management products distributed compared to 4.3% in the last quarter. Jupai has committed to the implementation of our precise key client customization strategy, providing multi-to-one service group based on investor demand or financial  allocation among real estate, secondary market, private equity and mutual funds, providing investors with more professional and efficient investment strategy and customer services, with which we're diversifying wealth management for now. Jupai will continue to focus on our prospective client customization strategy as we implement our asset transparency system, providing high quality service to investors and continuously improving the company's profitability."
}