{
    "symbol": "MAS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 11:31:02",
    "content": " Your line is now open. Your line is now open. Your line is now open. Your line is now open. We haven't seen evidence of trade down when we look across the volume of our big ticket items, like spas, for example, we continue to see strong demand there, strong backlog of about 25 weeks remaining, so -- which is greater than we would typically see in a normalized environment on our -- in China, where we have really a focus on the higher-end products, that Hansgrohe receives there with a good growth in China, and that continues. Your line is now open. Having said that, the portfolio as we reconfigured it, what John mentioned with the brake fix component, with the fact that it's lower ticket, and they're high bank for the buck, coupled with the fundamental shifts that we've seen in terms of how people buy and -- products for their home and how they view their home, we feel good about the long-term aspects of our portfolio. Your line is now open. We've talked about now for a number of quarters about how we're working very hard to drive stickiness in the PRO paint demand and as evidenced by our continued growth and share gain in that, part of our business that the team is doing an outstanding job, together with our channel partner to really take advantage of the opportunity that we had with our supply chain excellence when we had an opportunity to acquire a share of wallet of some new customers, to really show them what that Behr paint can do, and we've had positive response there. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. So when we look going forward, with the millennials coming in and forming houses, and we know that they're DIYers and they're DIYers for multiple projects based on our research, not just want and done, so to speak, so I think that's a very -- the impact of COVID as it relates to how those DIYers view their home and invest in their home and the equities that they've developed in their home and the savings accounts that we think for the next couple of years, for sure, that the DIY volume is going to have some nice tailwinds because of those structural factors. Your line is now open. Your line is now open. Your line is now open."
}