{
    "symbol": "GENE",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-27 19:56:06",
    "content": " We'll look firstly, to the GeneType commercialization, the Phase 1 launch of the GeneType multi-risk test in the US and in Australia, looking at the first six diseases and we're looking forward to being able to announce Phase 2 launch in the coming days in the United States. We have another four publications on the way under review and we're hoping that they are going to be released over the course of the next six to eight weeks, and we -- of course, we own our own NATA and CLIA certified laboratory here in Melbourne, which does a lot of that testing for a gene type product and that's a really exciting thing. They are going to actually help us, improve our own capabilities with software, hardware, consumables and technical solutions and really we're starting on the oncology-based platform NGS sequencing, which is then leading to the development of some of the really most exciting comprehensive based tests that I'll talk to in the next five minutes. The budget impact model that we talked about earlier validates the implementation of the GeneType test, and I'll talk through some of those outputs, which is actually getting us some fantastic conversations with these payers worldwide and really standing up and taking notice about how GeneType can actually help save lives and detect disease earlier than ever before. Instead of them having all of their equipment showcased in a training facility, we're going to be working on putting that into a commercial laboratory facility, but at the same time that it really advances some of the developments of some of the comprehensive testing that we are doing and our natural first step with QIAGEN is around NGS, it's around a monogenic disease, it's around some of those diseases that actually really compliment and are naturally adjacent to tests such as a GeneType oncology test. When I say coming days during the month of March, we believe that the three new tests for the multi-test being in atrial fibrillation, melanoma and pancreatic cancer, which also adds to the multi-risk test, are going to be available for us to be able to add on to the already GeneType multi-risk test with the other six tests in the United States. Phases thereafter are going to be directly attributed to us advancing the comprehensive story around the multi risk test, which looks at, as we spoke about before, the monogenic component as well as the polygenic component, as well as the clinical risk models, which is the hereditary breast and ovarian cancer, which is the first one. There's another really, I think, important element that we've heard from clinicians about why our risk assessment tests I'm going to use the word better, but more easily implemented than those more traditional models is they're much simpler. What we would really, ideally love to do is actually be able to do it all in one particular test, a comprehensive men's panel, a comprehensive women's panel, which looks at monogenic and integrates with the genotype multi risk test at the same time, which becomes a really powerful product for physicians to be able to use in one simple non-invasive saliva based test and as Carl mentioned earlier, a very largely simple questionnaire for a physician to be able to do because they are absolutely time poor."
}