{
    "symbol": "AMCX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 15:52:13",
    "content": " Today, we will discuss certain non-GAAP financial measures. With that, Iâ\u0080\u0099d like to turn the call over to Matt. Today, we will discuss certain non-GAAP financial measures. With that, Iâ\u0080\u0099d like to turn the call over to Matt. She has done a tremendous job leading the company's transformation in every respect, driving our strong streaming subscriber growth, jump starting our global expansion efforts, optimizing our performance marketing, and ensuring we're leveraging our strong linear business. In the second quarter, we grew our streaming revenues 20% year-over-year with normalized growth of 36%, driven by our focus on improving our performance marketing outcomes, acquiring and retaining high value subscribers with a disciplined data-driven and cost conscious approach in addition to refocusing our efforts on branding and promotion for our strong content. Strong streaming revenue growth was offset by several timing impacts in the quarter, including expected lower affiliate content licensing, advertising revenue, and unfavorable foreign exchange translation, the result of the unprecedented strength of the dollar. In summary, with the strength of our premium content slate and development pipeline, continued efficiencies from awareness and performance marketing, and ongoing global streaming expansion, we are well positioned for the remainder of 2022 and beyond to drive meaningful streaming and digital revenue growth. And even as we have focused on maximizing linear, we have also been expanding the potential of our own digital distribution and importantly, partnerships with third-party AVOD and free ad-supported streaming or SaaS platforms, that carry our channels and select library content very intentionally for the emerging and rapidly growing connected television environment. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}