{
    "symbol": "SYNL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 14:37:11",
    "content": "  Operator: Good afternoon, everyone, and thank you for participating in today's conference call to discuss Synalloy's Financial Results for the Second Quarter ended June 30, 2022. Joining us today are Synalloy's Executive Chairman of the Board, Ben Rosenzweig; President and CEO, Chris Hutter; CFO, Aaron Tam; and the company's outside Investor Relations adviser, Cody Cree. Before we go further, I would like to turn the call over to Cody Cree as he reads the company's safe harbor statement within the meaning of the Private Securities Litigation Reform Act of 1995 that provides important cautions regarding forward-looking statements. Before we continue, I'd like to remind all participants that the discussion today may contain certain forward-looking statements pursuant to the safe harbor provisions of the federal securities laws. With that, I would like to turn the call over to Synalloy's Executive Chairman of the Board, Ben Rosenzweig. Coming off a record start to the year, we're reporting another strong quarter, our fifth consecutive one of year-over-year growth in net sales, net income and adjusted EBITDA as well as a third consecutive quarter of record net income. As we look to the future, to better align the company to the transformed vision and goals we've implemented over the past 18 months, we're officially rebranding to Ascent Industries Co., effective tomorrow, August 10. Within the Tubular Products segment, we'll continue to utilize the powerful brands we have like SPT, BRISMET and ASTI, and they will all be part of Ascent Tubular Products. In the current market environment, we remain hopeful that we're on the cusp of finding more value than we've seen in the recent past in deals across both segments that we operate in. Additionally, with our One Team mentality, it's important that the companies we evaluate are able to operate cohesively in our portfolio and provide cross-functional work capabilities to our segments. And when I assess our capital allocation options, we feel good about our near-term cash generation, in addition to our significant borrowing capacity, enabling us to continue to pursue accretive acquisitions in meaningful size and scale even after repurchasing our own stock. Obviously, we'll continuously reassess as new information becomes available to us, but I wanted to share my thinking with you as we stand today. We're solidifying our commercial sales strategy, finding new routes to market, optimizing our footprint and promoting cross-functional work processes to drive incremental margin. While we have achieved several milestones for the first half of 2022, there's still much work ahead of us, and we remain focused on driving long-term value for our shareholders. Now I'd like to pass the call over to Chris to provide greater details on our operations across both segments, but I'll be available later on to answer any questions. As mentioned earlier, our momentum continued in the second quarter, resulting in another strong quarter of growth and record results. While we have a deep history in production of stainless steel, nickel alloy and coated pipe and tubular products as well as the processing and distribution of heavy wall seamless products, our capabilities and unique products are better represented with our refresh brand. When you think about Ascent Tubular products, envision a company that is a producer of fluid transfer products. Our products focus on liquid or gas transportation, and example applications include municipal water projects, oxygen production facilities, food and beverage manufacturing, pharmaceutical, household goods and chemical production, just to name a few. As we begin to see pricing stabilization in the back half of the year, our supply chain will play an integral role in enabling us to maintain our margin targets while lessening our working capital requirements, and the work we've accomplished this quarter has put us in a good position to do so. Looking forward, our near-term operational priorities are focused on closely managing our inventory amid a dynamic pricing environment, growing our business development efforts and finalizing our automation projects. A large function of this ties directly to our commercial efforts as we have made meaningful inroads in our OEM and project sales initiatives, which naturally tend to more discrete projects with higher volumes and a more predictable production schedule. Our focus on OEM and project sales efforts is beginning to bear fruit and the outcome has been an average in approximate 1,000 basis point gross margin enhancement over our distribution route to market. As we continue to expand our efforts in this space, we look forward to updating you in future quarters on how this progresses. We continue to see signs of that stabilization at least through quarter 3, and we believe the work we've done and the strategy we're continuing to execute is setting up tubular for success into the near future. As a specialty chemicals manufacturer providing best-in-class solutions to our customers operating in over 15 different industries, we are committed to expanding our footprint through organic growth and value-accretive acquisitions while developing our research capabilities to yield new high-value products and production capabilities. Throughout the quarter, we were able to capitalize on the efforts of John Zuppo and his team to drive better-than-expected bottom line results. Owing to our specialized products and the amount of R&D and customization we provide for our customers, our Specialty Chemicals business benefits from stability during market cycles, allowing us to grow in a more steady and linear fashion. We continued our upward trajectory during the quarter by bolstering our sales teams, integrating our facilities to promote cross-function work process and growing our footprint and capacity across our sites. This past quarter, we were also able to lock down 3 new core customers at our Virginia site. Our sales, technical and operations teams have also continued to integrate from separate companies into 1 unified business. This is integral to promoting more efficient work processes and will lead to more accurate production planning, reduced off-quality products and improve our on-time delivery rates. As we establish ourselves as Ascent Chemicals, a larger and more diversified manufacturer of specialty chemicals, it is crucial that we consistently deliver best-in-class products and services on time and in a reliable manner. In fact, our focus in the second half of the year will be on our equipment upgrades at our Virginia site as well as some low-cost growth projects in South Carolina to diversify into personal care products and further into specialty chemical capabilities. Overall, our Specialty Chemicals segment recorded a great quarter, and we look to continue our stable growth through the back half of the year. We look to be the industry leader in the manufacturing of our specialty chemical products through a robust sales pipeline, efficient work process and identifying value-additive acquisition opportunities, with strong research and development capabilities to enhance our overall product mix. In both segments, we're extremely proud of what our teams were able to accomplish throughout this quarter. Our core operations and team strategy continue to improve, and we firmly believe our company is poised to establish Ascent as a premier industrial manufacturer of both tubular products and specialty chemicals. I'd like to now turn it over to our CFO, Aaron Tam, to walk through our second quarter financial results in more detail, then I'll return to answer any questions you may have. For the second quarter financial results, net sales increased by 40% from $83.1 million to $116.2 million compared to the prior year period. The increase was primarily attributable to the competitive pricing increases made across both of our business segments, while also benefiting from a deliberate product mix shift towards higher average selling price and higher margin products. Also, it's important to note that our net sales included $8.4 million in DanChem sales that weren't in the prior year resulting in a nearly 30% organic growth rate. Gross profit increased 48% to $20.9 million compared to $14.1 million in the second quarter of 2021, while gross margin increased 100 basis points to 18% from 17% in the prior year period. The improvement in both gross profit and gross margin was primarily attributable to increased selling prices and the previously mentioned mix shifts as well as a more diversified supplier base, offsetting the impact of increased raw material costs, freight costs, repairs, maintenance and supplies expenses. For reference, DanChem contributed $0.8 million in adjusted EBITDA for the second quarter of 2022. Lastly, looking at our liquidity position as of June 30, 2022, total debt was $68.3 million compared to $70.4 million as of December 31, 2021. And as of June 30, 2022, we had $41.2 million of borrowing capacity under our revolving credit facility compared to $39.4 million as of December 31, 2021. That is obviously DanChem is contributing to that shift of percentage and as we continue to look to expand our Specialty Chemicals business, you would see that, the pipe, change a little bit. And I would say the only mix that we're seeing from a shift is we're seeing -- the distribution route to market, which is supplying distributors, that tends to change as surcharges and pricing fluctuates. And we've put an extreme amount of effort into shifting our approach to market by chasing the end-user projects, which we can really control the demand of that. And that's what I referred to as batch projects, and that could be anywhere from $100,000 project to multiple millions of projects for infrastructure, water, methane, whatever type of utility project we're producing product for. I think for investors who've been here for years, I think that would be appropriate considering the results that you've been putting out the last 4, 5 quarters. They've got more net debt, less earnings and a lower revenue and profile than we do, so -- and a market cap of $300-plus million. So it's just -- it's frustrating for many people within the organization, but we're doing what we can to remain steadfast on, again, delivering quarter after quarter of solid results, bringing the right team, building the right team, trying to be prudent with our decisions and invest in things that we think will be most accretive for shareholders, so... I'd like to thank everyone for listening today, and we look forward to speaking with you again when we report our third quarter 2022 results."
}