{
    "symbol": "ASRT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 22:44:04",
    "content": " Not only did our financial results in the quarter once again exceed our forecast in nearly every metric, we were able to extend our debt maturity and cut our cost of debt capital from 13% to 6.5%, incredibly low in today's market, exit an unprofitable segment of our business, increasing our future revenue and profit and added a new source of accretive revenue in Sympazan that adds to the diversification of our top line. In the trailing 12 months ended September 30, Aquestive recorded $9.9 million in net sales. Starting with Slide 3, net product sales were $34.3 million for the third quarter of 2022 compared to net product sales of $26 million in the prior year quarter and $35.4 million last quarter. INDOCIN also decreased by $1 million versus last quarter due to a reduction in channel inventory levels, partially offset by a return accrual benefit recorded in the quarter. The $400,000 increase in Otrexup net sales from the last quarter is primarily due to increased volume in the quarter despite a slight decline in wholesaler inventory levels. CAMBIA net sales were $400,000 lower than the prior year quarter, primarily due to lower volume as we pulled back on promotion leading up to the loss of exclusivity in January 2023. Also on Slide 3, adjusted EBITDA for the third quarter was $21.4 million compared to $22.9 million last quarter and an adjusted EBITDA of $15.8 million in the prior year quarter. As mentioned in prior quarters, we do not pay any royalties on the first $20 million in INDOCIN sales. Summarized on Slide 4, adjusted selling, general and administrative expenses in the third quarter were $9.3 million compared to $8.6 million last quarter which included a $2 million insurance benefit and $7.9 million in the prior year quarter which included a $750,000 legal settlement. Looking forward, we do expect an increase in operating expenses in the fourth quarter versus our third quarter year-to-date run rate, funding both increased OTREXUP sampling and marketing costs as well as additional cost to support Sympazan. On August 25, we closed our offering of $70 million aggregate principal amount, 6.5% convertible senior notes due September 2027. These proceeds were used to redeem our 13% senior secured notes of $59 million due in January 2024, plus accrued interest of $3 million. On September 30, 2022, our long-term debt balance, as shown on Slide 5, was $66 million, reflecting the $70 million convertible debt balance less unamortized debt issuance cost of $4 million. Also on Slide 5, ending cash on September 30, 2022, was $64.8 million. Looking ahead to the fourth quarter, ending cash will reflect the $15 million in total purchase price payments for Sympazan and the final purchase price payment for Otrexup of $10 million. There are several moving parts, including favorable year-to-date results which include favorable SPRIX volume, favorable channel mix across the portfolio due to lower volume and unprofitable channels, INDOCIN net sales growth was driven by the new commercial and channel strategies, our exit from 340B and return to normal channel inventory levels are expected to result in a higher net product sales for INDOCIN. And because of the partial quarter, we've guided that we'll do at least $1 million in the fourth quarter for it."
}