{
    "symbol": "ASRT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 21:59:06",
    "content": " Net product sales increased 37% versus the prior year with one third of the incremental growth coming from our newly acquired product Otrexup, which in this quarter we recorded 3.1 million in sales slightly ahead of our internal forecasts. This quarter Assertio reported $0.38 per share versus $0.27 in the prior year quarter, representing growth of 41%. Starting with slide 3, net product sales were $35.5 million for the first quarter of 2022 compared to net product sales of $26 million in the prior year quarter and $32.2 million last quarter. Indocin net sales in the first quarter increased by $6.8 million over the prior year quarter, and $3 million over last quarter due to an improvement in net realized price. Otrexup net sales for the first quarter were $3.1 million, representing one third of the portfolio year-over-year sales increase of $9.5 million. Also on slide 3, adjusted EBITDA for the first quarter was $23.9 million compared to $15.7 million in the prior year quarter and $17.8 million last quarter, reflecting 34% quarter-over-quarter growth. The first quarter non-GAAP adjusted earnings per share was $0.38 versus $0.27 in the prior year quarter, reflecting 41% growth. Summarized on slide 4, adjusting selling, general and administrative expenses in the first quarter were $9.5 million versus $7.3 million in the prior year quarter and $10.1 million last quarter. Net income for the first quarter was $9.1 million, reflecting 99% growth over the prior year quarter net income of $4.5 million, which included the $5 million insurance benefit and 98% growth over last quarter’s net income of $4.6 million. Net cash provided by operating activities, as reported in the company's statement of cash flows for the first quarter was $27.4 million, versus a use of cash of $4.2 million in the prior year quarter reflecting the fourth consecutive quarter of positive operating cash flow. As previously mentioned, first quarter cash flows were impacted positively by the $8.3 million income tax receipt."
}