{
    "symbol": "MSFT",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-24 21:24:05",
    "content": " Microsoft Cloud revenue was $27.1 billion and grew 22% and 29% in constant currency, ahead of expectations. Microsoft Cloud gross margin percentage increased roughly 2 points year-over-year to 72%, a point better than expected, driven by lower energy costs. Revenue from Productivity and Business Processes was $17 billion and grew 7% and 13% in constant currency, in line with expectations when excluding the favorable FX impact noted earlier. Office 365 Commercial revenue increased 11% and 18% in constant currency, slightly better than expected with healthy renewal execution and ARPU growth as E5 momentum remains strong. Office Consumer revenue declined 2% and increased 3% in constant currency, with continued momentum in Microsoft 365 subscriptions, which grew 12% to 63.2 million, partially offset by declines in our transactional business. LinkedIn revenue increased 10% and 14% in constant currency, driven by growth in Talent Solutions, partially offset by weakness in Marketing Solutions from the advertising trends noted earlier. Operating expenses increased 34% and 37% in constant currency, including roughly 13 points of impact from the Q2 charge noted earlier and roughly 7 points of impact from the Nuance acquisition. Revenue was $14.2 billion, decreasing 19% and 16% in constant currency, below expectations driven by Surface, Windows Commercial and search. Windows Commercial products and cloud services revenue declined 3% and increased 3% in constant currency, lower than expected, primarily due to the slowdown in growth of new business and stand-alone offerings noted earlier. Segment gross margin dollars declined 29% and 24% in constant currency, and gross margin percentage decreased roughly 7 points year-over-year, driven by lower device gross margin and sales mix shift to lower-margin businesses. Operating expenses increased 6% and 9% in constant currency, including roughly 6 points of impact from the Q2 charge noted earlier and 3 points of impact from the Xandr acquisition. Operating income decreased 47% and 40% in constant currency, including roughly 6 points of unfavorable impact from the Q2 charge noted earlier. In Productivity and Business Processes, we expect revenue to grow between 11% and 13% in constant currency or $16.9 billion to $17.2 billion. As a result, when excluding the Q2 charge and favorable impact from the change in accounting estimate, we expect full year operating margins to be down roughly 1 point in constant currency and roughly 2 points in USD, even with the headwinds from materially lower OEM revenue and higher energy costs. Joe, next question please. Joe, next question please. Joe, next question please. Joe, next question please. So, in some points, itâ\u0080\u0099s important because if you look at the operating income margin guidance that I talked about, the fact that we are guiding to really only one point of margin deceleration for the year on a constant currency basis with probably over $2 billion of headwind from the OEM business from what we had anticipated heading into the year, the focus on margins, the focus on prioritization, the focus on putting our investments into where we know they have high return, I actually feel quite good about the place that puts us in as we exit the year in terms of â\u0080\u0093 and the right energy, right, or leaving the year in Q4 on leverage. Joe, next question please. Joe, next question please."
}