{
    "symbol": "MSFT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-10-25 19:05:03",
    "content": " As you heard from Satya, in our commercial business, we saw strong overall demand for our Microsoft cloud offerings with a growth of 31% in constant currency as well as share gains across many businesses. Company gross margin dollars increased 9% and 16% in constant currency, and gross margin percentage decreased slightly year-over-year to 69%, excluding the impact of the latest change in accounting estimate, gross margin percentage decreased roughly 3 points, driven by sales mix shift to cloud, the lower Azure margin noted earlier and Nuance. Revenue from productivity and business processes was $16.5 billion and grew 9% and 15% in constant currency, ahead of expectations, with better-than-expected results in Office commercial and LinkedIn. Office 365 commercial revenue increased 11% and 17% in constant currency, slightly better than expected, with the strong renewal execution noted earlier. Paid Office 365 commercial seats grew 14% year-over-year, driven by our small and medium business and frontline worker offerings, although we saw a continued impact of new deal moderation outside of E5. Office consumer revenue grew 7% and 11% in constant currency, driven by continued momentum in Microsoft 365 subscriptions, which grew 13% to $61.3 million. LinkedIn revenue increased 17% and 21% in constant currency, ahead of expectations, driven by better-than-expected growth in Talent Solutions, partially offset by weakness in marketing solutions from the advertising trends noted earlier. Azure and other cloud services revenue grew 35% and 42% in constant currency, about 1 point lower than expected, driven by the continued moderation in Azure consumption growth, as we help customers optimize current workloads while they prioritize new workloads. In our on-premises server business, revenue was flat, and increased 4% in constant currency, slightly ahead of expectations, driven by hybrid demand, including better-than-expected annuity purchasing ahead of the SQL Server 2022 launch. Revenue decreased slightly year-over-year to $13.3 billion and grew 3% in constant currency, in line with expectations overall, but with OEM and Surface weakness offset by upside in gaming consoles. Devices revenue grew 2% and 8% in constant currency, in line with expectations, driven by the impact of a large Hollands deal, partially offset by low double-digit declines in consumer Surface sales. Windows Commercial products and cloud services revenue grew 8% and 15% in constant currency, in line with expectations, driven by demand for Microsoft 365 E5 noted earlier. Search and news advertising revenue, ex TAC, increased 16% and 21% in constant currency, in line with expectations, benefiting from an increase in search volumes and roughly five points of impact from Xandr even as we saw increased ad market headwinds during September. Xbox content and services revenue declined 3% and increased 1% in constant currency, driven by declines in first-party content as well as in third-party content where we had lower engagement hours and higher monetization, partially offset by growth in Xbox Game Pass subscriptions. Segment gross margin dollars declined 9% and 4% in constant currency, and gross margin percentage decreased roughly five points year-over-year driven by sales mix shift to lower margin businesses. Revenue will be driven by around 20% constant currency growth in our commercial business, driven by strong demand for our Microsoft cloud offerings. On a constant currency basis, excluding the incremental impact of the lower Windows OEM revenue and the favorable impact of the latest accounting change, we continue to expect FY 2023 operating margins to be roughly flat year-over-year. Please proceed with your question. Jesse, next question, please. Please proceed with your question. Jesse, next question please. Please proceed with your question. Jesse, next question please. Please proceed with your question. Please proceed with your question. Jesse, next question, please. Please proceed with your question. Please proceed with your question."
}