{
    "symbol": "NX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-04 15:10:16",
    "content": " At this time, all participants’ lines are in a listen-only mode. We reported revenue of $267 million during the first quarter of 2022, which represents an increase of 16%, compared to $230.1 million during the first quarter of 2021. The increase was largely attributable to volume increases in our Fenestration segments, combined with higher prices related to the pass-through of raw material cost inflation. More specifically, we realized net sales growth of 14.5% in our North American Fenestration segment, 15.5% in our North American Cabinet Components segment and 18.6% in our European Fenestration segment, excluding the foreign exchange impact. We reported net income of $11.2 million or $0.34 per diluted share for the three months ended January 31, 2022, compared to $7.9 million or $0.24 per diluted share during the three months ended January 31, 2021. On an adjusted basis, net income increased by 25.9% to $11.3 million or $0.34 per diluted share during the first quarter of 2022, compared to $9 million or $0.27 per diluted share during the first quarter of 2021. On an adjusted basis, EBITDA for the quarter was essentially flat year-over-year at $24.4 million, compared to $24.3 million during the same period of last year. The increase in earnings for the three months ended January 31, 2022 was attributable to continued strong demand, operational efficiency gains and increased pricing. However, the decrease in margin percentage was driven by inflationary pressures and time lags on material index pricing mechanisms. Moving on to cash flow and the balance sheet, cash used for operating activities was $21.7 million for the quarter, compared to $3.4 million for the same period of last year. Due to the typical seasonality in our business, free cash flow was negative in the first quarter of this year. In addition, the value of our inventory increased further due to inflationary pressures, which had a negative impact on working capital. Our balance sheet continues to be strong, our liquidity position is solid and our leverage ratio of net debt to last 12 months adjusted EBITDA was at 0.4 times as of January 31, 2022. As stated in our earnings release, demand remains healthy, but the rate of inflation continues to pressure margins. However, based on improvements in labor performance, the expected continuation of our pass-through pricing strategy, conversation with our customers and the latest macro data we are now comfortable providing the following guidance for fiscal 2022. Net sales of $1.13 billion to $1.15 billion, adjusted EBITDA of $135 million to $140 million, depreciation of approximately $31 million, amortization of approximately $15 million, SG&A of $115 million to $120 million, interest expense of $2 million to $2.5 million, tax rate of 28%, CapEx of $30 million to $35 million and free cash flow of $55 million to $60 million. While we do expect some level of volume growth in our Fenestration segments for the remainder of the year, note that our current expectation is that revenue growth for the remainder of the year should be driven more by price, as opposed to volume and we expect margin expansion to be second half weighted. From a cadence perspective for Q2, we expect net sales to be up mid-to-high single digits year-over-year in each segment. However, due to inflation and the time lag associated with passing on price increases for most of our raw materials, we believe it will be a challenge to realize margin expansion in any segments in Q2. Looking ahead into the second half of the year, on a consolidated basis, we currently expect mid single-digit net sales growth year-over-year in Q3 and Q4. In addition, due to easier comps and the expected benefit from our pricing strategy, coupled with some volume growth in our Fenestration segments, we expect to realize some margin expansion in Q3 and Q4. Joe’s guidance was key during our transition into a pure-play building products company several years ago and more recently, his mentorship and support proved invaluable as I transitioned into the CEO role. Volume growth in our Fenestration segments and higher prices in all segments, mostly related to the pass-through of raw material cost inflation resulted in revenue growth of 16% year-over-year. On a consolidated basis, we estimate that revenue growth for the quarter was weighted approximately 10% due to an increase in volume and approximately 90% due to an increase in price. The rate of raw material cost inflation remains a challenge, as we typically see a 30-day to 90-day time lag in passing these increases through to our customers. This segment generated revenue of $146.6 million in Q1, which was $18.5 million or 14.5% higher than prior year Q1. Strong demand in our IG spacer and screen product lines, volume growth in vinyl fencing components and price increases across all product lines were the main drivers of the growth. Improve pricing, volume-related efficiency gains and productivity-related improvements were more than offset by inflationary pressures on raw materials, which cause margin erosion of approximately 170 basis points for the quarter. However, our current expectation is for margin expansion in the segment later in the year, assuming that the rate of inflation subsides. Our European Fenestration segment generated revenue of $58.9 million in the first quarter, which was $9.8 million or 20% higher than prior year. As such, adjusted EBITDA came in at $10.4 million for the quarter, which was $300,000 less than prior year and yielded margin compression of approximately 420 basis points. Similar to our expectations for other segments, we do anticipate that margins will improve as the year progresses, again, assuming that the rate of inflation subsides. Our North American Cabinet Components segment reported net sales of $62.4 million in Q1, which was $8.4 million or 15.5% higher than prior year. Volumes decreased in the segment year-over-year, mainly as a result of customer’s decisions to reduce overtime hours worked in their plants. Increases in hardwood index pricing, as well as discretionary pricing actions offset the volume and resulted in revenue growth year-over-year. Adjusted EBITA was $2 million for the quarter, which was $1.2 million less than prior year and resulted in margin compression of approximately 280 basis points. Weather-related challenges in the Appalachian Wood region, as well as increases in Maple demand were the main drivers of the increases in lumber costs. As a reminder, we have material index pricing mechanisms in place, but they typically have a 90-day lag and we will require a period of flat or declining wood pricing before we’re able to catch up on our emerging performance in this segment. As we look forward through the remainder of the year, we feel good about the demand environment across all of our product lines. In North America, the housing market remains strong and our customers continue to have high levels of backlog, which we anticipate will slowly dwindle throughout the year. The rate of inflation and the potential for further interest rate hikes could impact demand at some point in the future, but we do not expect this to occur in the near term due to the high backlog levels. Although, consumer confidence could ultimately be impacted if inflation continues to ramp and energy costs continue to increase. From Quanex perspective, we have seen enough improvements in our supply chain and stabilization in our labor force to say that the main challenge we now face is the rate of inflation and the ability to pass-through price in an expedited manner. As Scott mentioned earlier, we have enough data points and adequate visibility into our customer’s backlog to give us confidence in providing full year guidance. Again, we expect to generate revenue of $1.13 billion to $1.15 billion and adjusted EBITDA of $135 million to $140 million. At this point, it is too early for anyone to accurately predict or estimate the impact that this war will have on the European or global economies or what supply chain disruptions or other impacts this may have on our industry. Nonetheless, our team has managed through COVID and numerous global supply chain challenges over the past few years and we are very confident in our ability to navigate this event as well. Your line is open. Maybe talk, obviously inflation is the kind of the remaining challenge, as you described, just talk about looking across each of the segments, the cadence of what you’re seeing, whether prices are flattening, reaccelerating kind of in real-time and just trying to get a sense for your confidence around the trajectory of margins recovering in the back half of the year? But, in general, if I look at each of our raw material segments, the ones that continue to see the most levels inflation are primarily tied to oil or chemical-based raw materials, so resins, any other components like carbon black, some of our butyl rubbers that are very tied to oil, still see some significant inflationary pressures. And same thing with wood, we started to see some leveling out of wood, but we’ve had a pretty tough winter in the Appalachian region with snow and rain that makes it really hard to forest some of those and harvest some of those lumber yards. I mean, as you can imagine, it’s very hard to forecast inflation and pricing. However, we have a pretty good handle on the pricing aspect, which some of that’s built into the model, as well as some cushion on inflation, inflationary costs going a little higher from where we are today. We’ve made it public that, our target is to approach net debt free by the end of the year. We have some pretty large CapEx projects that, we’re going to be focused on throughout those years. As we told you, the Board authorized the $75 million repurchase plan. And then, finally, the M&A pipeline, there are things that we’ll continue to look at and be interested in. And I would say that, the amount of deals crossing our debt seems to have slowed and I think that that’s been reinforced by some of the feedback that we get from the banks that the deal pipeline in general slowed down a little. But we’re going to continue to remain diligent on our checklist of things that meet our requirements for an M&A and if something’s there, we’re in great position to capitalize on it, but at this point, nothing imminent. Your line is open. I think if you look back at last year’s second half, we started to see inflation really kick up in the third quarter and especially in the fourth quarter. So what should drive that margin expansion year-over-year, obviously, volume is going to help, but I think, more so there’s going to be pricing as we enter the second half. And like I said, there is a little bit of an assumption that inflation ticks up a little higher from where we are today, but we do expect it to subside at least we’re forecasting for that. It’s more the rate of inflation and at some point, even if inflation continues to tick up, at least it gives us the ability to catch up. I mean, Europe, we’re hopeful that’ll happen in 3Q, but probably more likely in 4Q, I mean, margin profile in Europe continues to be strong. And then, one more, thinking about inflation with the SG&A guidance, the low end of that SG&A range, flattish year-over-year, kind of surprised, given inflation in the U.S. normalizing of T&E, maybe you can talk to how you’re thinking about SG&A and budgeting for that? So, we have internal projects, where we’ve been able to reduce SG&A in some areas. Stock-based comp has obviously had a big benefit to that, as well as we’ve aggressively managed our medical cost and it’s, I think, performed relatively well, and although, we see inflation, it’s -- I think we’ve done better than the market in managing our medical costs. And then last quick one for me, if I think about the high end of the guidance range on sales and EBITDA, it implies lower incremental margin on the high side of both numbers than it does on the low end. I will say that, sitting here today, probably, more comfortable with the higher end of the revenue guidance range than we are on the EBITDA range just because of the inflationary environment where in. Your line is open. You listed a couple of contributing factors that decision, the improvements in labor performance, continued pricing and speaking to customers, et cetera. We made some labor adjustments in terms of our wage rates throughout last year and so as you bring new people on and get them acclimated to our processes, the learning curve around that has improved versus prior year and that’s been a big deal. And in our North American Cabinet Components segment where we talked about -- our customers reducing labor hours that, that’s mainly attributable to them losing labor. I mean, it’s -- that tends to be more plant specific. The main areas that I’m going to be focused on as it relates our impact, first and foremost, will be the European economy. In terms of our components, aluminum pricing, which we’re already starting to see on the rise and I’m not as worried about supply, but people are trying to capitalize on this to drive price up. We’ll obviously be able to recover it, but then it goes into the time lags. Your line is open. In the window business, you kind of are, right, Northern Europe window spacers, U.K. actual the windows versus the U.S. Can you just talk about how demand trends might be a little different in COVID using the U.K. and the U.S. is counterpoints just, not even extended answer, but just how different those markets have been in terms of demand? So, we’ve seen strong demand in both areas. I think, where I contrast on a go-forward basis, in the U.K. and Europe, I think, discretionary impact will be impacted more by increases in energy costs, even more so than what we complain about here in the U.S. about fuel and heating fuel and energy costs going up. So I think it’ll have an ability -- the potential to impact the U.K. and Europe much faster than we’ll see here in the U.S.\n And then, George or Scott, I’m not sure which one of you made the comment or which region? People -- when you have companies that are working 50 hours to 60 hours and sometimes more than an hours a week, you have significant loss of employees, you cannot continue to work at that level, someone will go across the street, make the same amount of money. And so they realized, in that segment, our customers there that, that they’re working too many hours, so they physically made the decision, we’re going to back off and let the backlogs grow and that’s what we saw during the course of last year and it’s remained. Now they’ve also, as they start to retain their employees, because of the reduction in working hours, we’re seeing better performance, because they’re able to retain their labor. So, I don’t think we’ll see the continued growth in that backlog, but that’s what happened. I mean, you talked to one of the things people focus on is, does do when this price increases create demand destruction, which you mentioned, and I don’t know if you just were being very holistic in your comments. So the two pieces, I’ll start with your second question first. But we are -- we haven’t seen it at this point and that was more related to Europe than it is to U.S. Now in terms of backlogs with my window customers, they seem to be handling that more. So that’s what gives us so much confidence, as we look at our demand going forward, because of such high backlogs. They’ve done a very good job of being able to control their labor and fulfill the man as much as possible, so. Your line is open. This has been an, obviously, multiple years of an unprecedented operating environment with everything that’s gone on. If we ever get back to normalization, one thing we haven’t talked about as much in recent calls is, what kind of opportunity is left to drive margins higher longer term and I realize Europe is that had pretty significant margins right now, but specifically in North America Fenestration and/or the Cabinets, be it with automation or other internal initiatives? In North America, I still think and we still think that the biggest opportunity for margin expansion is in the Cabinet Components business. We’ve gone through quite a long period here of chasing price and the 90-day lag hurting us and it’s really masked all the things we’ve done on the shop floor to improve efficiencies and things of that nature and I think once pricing does stabilize and come down on the wood side, you’re going to see that margin expansion at some point. And then in the North America fenestration segments, we still think there’s some meat left on that bone too and it’s probably more related to our screens business and the vinyl business, and not so much the vinyl windows business. As you know, we’ve been ramping up production and manufacturing of the vinyl fencing business."
}