{
    "symbol": "NX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-06-03 14:43:02",
    "content": " On an adjusted basis, EBITDA for the quarter increased by 40.4% to $45.2 million compared to $32.2 million during the same period of last year. Nevertheless, based on improvements in labor performance, the expected continuation of our pass-through pricing strategy and conversations with our customers, we are increasing guidance for the fiscal year as follows: Net sales are now expected to be $1.18 billion to $1.2 billion; adjusted EBITDA is now expected to be $150 million to $155 million; and free cash flow is forecast to be $65 million to $70 million. Volume growth in our Fenestration segments and higher prices in all segments, mostly related to the pass-through of raw material cost inflation resulted in revenue growth of 19.4% year-over-year, on a year-to-date basis, revenue growth of 17.9% versus prior year. This segment generated revenue of $177.9 million in Q2, which is $31.8 million or 21.7% higher than prior year Q2. On a year-to-date basis, adjusted EBITDA was $42.5 million or 15.1% higher than prior year. Our European Fenestration segment generated revenue of $73.4 million in the first quarter, which represents – in the second quarter, which represents an increase of 19.1% year-over-year. Adjusted EBITDA came in at $15.1 million for the quarter, which was $2.3 million better than prior year, but yielded margin compression of approximately 30 basis points. Our North American Cabinet Components segment reported net sales of $72.9 million in Q2, which is 14.7% higher than prior year. On a year-to-date basis, revenue was $135.2 million, which represents an increase of 15% versus prior year. Adjusted EBITDA was $4.5 million for the quarter, which is $1.4 million better than prior year and resulted in margin expansion of approximately 140 basis points. On a year-to-date basis, adjusted EBITDA of $6.5 million is $200,000 less than prior year and results in year-to-date margin compression of 50 basis points. And to reiterate Scott’s comments, we expect the following: net sales to be $1.18 billion to $1.2 billion; adjusted EBITDA to be $150 million to $155 million; and free cash flow to be $65 million to $70 million. I don’t have that broken out by segment, but I think George alluded to the fact that second half revenue growth year-over-year will be driven mainly predominantly by price versus volume."
}