{
    "symbol": "SP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 22:27:01",
    "content": " As we noted in our earnings release, we expect another strong year of growth in 2023 with adjusted gross profit growth of 11% at the midpoint, of which approximately 2 percentage points reflects the full year impact of AeroParker acquisition and our expected adjusted EBITDA growth, which is also 11% in 2023 at the midpoint of our guidance range anticipates additional investments in G&A that we believe will set the foundation for achieving accelerated gross profit growth. Fourth quarter 2022 adjusted G&A expenses were up 20% year-over-year largely due to the decision to make strategic investments in business development, technology and other resources that we believe will enable us to capture and support accelerated growth in 2023 and beyond. And now just finally to say, what we are also seeing is in the competitive space for operations within North America in Aviation, we have some clients who have not made -- competitors, I should say, you have not made the investments in technology, who are perceived to be lagging the cutting edge in the minds of airport clients or prospective airport clients and they are receptive to someone coming in both with technology solutions, operating expertise, but at the same time marketing strategies for them to drive revenue into those airports. I think in Aviation, itâ\u0080\u0099s a lot of the same story, but the additive is that, because we have AeroParker now, we have an additional service line that we can bring to clients and we had some recently where we have gone to some of our established airport clients, and we have said, we would like to tell you about AeroParker and look what it can do, it can provide reservation, functionality for people who want to make those arrangements in advance, it can provide other convenience, e-commerce and other solutions that clients are looking to provide, again for people traveling to an airport to reduce friction, make the travel experience better for them. I think, bringing in new business development individuals that can further allow us to get maybe a little bit deeper into clients, maybe we havenâ\u0080\u0099t had a relationship with before or maybe not, we havenâ\u0080\u0099t had the relationship at the same level that we have had before and then bringing in new individuals that can help us continue to grow the business and then lastly support functions that can allow us to grow in terms of overall gross profit growth and support gross profit growth. But you mentioned financing or other options and we are seeing this, it hasnâ\u0080\u0099t resumed in the municipality space yet, but universities are really looking at the same -- some of these same issues and we were â\u0080\u0093 we partnered with some financial backers for -- in effect a P3 privatization at University at Toledo last year, which has gone exceptionally well and where the university was getting both upfront cash flow from investors, but also sharing an increased revenue stream thatâ\u0080\u0099s been brought about by us bringing in our technology, capturing more of the revenue and so they have an ongoing higher revenue stream than they had previously plus this upfront payment."
}