{
    "symbol": "UNFI",
    "quarter": 1,
    "year": 2023,
    "date": "2022-12-07 13:37:02",
    "content": " In this changing environment, we believe UNFI is well-positioned for further value creation, leveraging our scale, diversification, private brands, and professional services portfolio that helps our customers drive, sales and save money are all drivers of differentiated capabilities that enhance connectivity and market visibility for both our customers and suppliers. We're managing our SG&A spending well and have shifted existing dollars into higher strategic priorities aimed at driving growth and profitability, including growth opportunities in our services platform and added resources in digital and business transformation to improve the way we serve customers. Our gross profit dollars prior to the LIFO charge in both years increased by $64 million over last year's first quarter and gross profit rate declined to 20 basis points, driven by changes in both wholesale customer and product mix. We still expect our year end adjusted EBITDA leverage ratio to be lower than last year's 2.6 times, driven by net debt reduction over the coming three quarters, including the benefits from the AR monetization program and higher full year adjusted EBITDA. We saw about10% inflation, down 3% was in line with the total industry, including some of the large box retailers that have been driving growth because of value in the more recent past, and we're continuing to work really hard to make sure that our customers are as competitive as they possibly can be. But we also created an even more attractive opportunity for suppliers to invest to drive their growth across an incredible range of very innovative, very agile, locally and regionally positioned retailers, and that supplier investment is something that drives the retailers' competitiveness, drives higher sales and profitability growth, and that then allows us to make our cost base more efficient in line and in addition to the programming we have to drive process improvement, technology improvement, and ultimately, automation improvement. I hope you've heard and take away from today's call that UNFI continues its relentless focus on improving the service we provide our customers and has well thought out plans to drive growth and efficiencies this year and beyond, all leading to strong returns for our shareholders."
}