{
    "symbol": "TW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 16:31:03",
    "content": " Fourth quarter revenues of $293 million were up 5.8% year-over-year on a reported basis, stripping out the 350 basis points of FX headwinds that continued to be severe, we generated revenue growth of 9.3% on a constant currency bases. Our efforts to lead with innovation resulted in another quarter of strong institutional revenue growth, with average daily volume of 31% year-over-year, driven by new client wins and strong industry volumes. While high volatility and FX continued to dampen the true growth across U.S. and European Credit, our Muni business continues to see strong revenue growth, a product of the higher rates driving our retail channel and continued success in gaining wallet share across the institutional channel. After a record nine months of trading, a more subdued environment across CDS produced relatively flat year-over-year growth in the fourth quarter, though up nearly 10% on a constant currency basis. Similar to global credit, our global swaps business produced a record 2022 with constant currency revenue growth of 18% year-over-year. In sum, our blended fees per million increased 18% year-over-year, primarily as a result of stronger growth in cash, credit and cash equities, and an increase in cash rates fee per million. For cash rates products, fees per million were up 23%, primarily due to a positive mix shift towards higher fee per million U.S. Treasuries and the migration of certain European government bond clients from fixed to variable contracts at the end of last year. Drilling down on cash credit, average fees per million increased 6% due to stronger growth in munis, which carries a higher fee per million than overall cash credit. January volumes were up 3% year-over-year with double-digit growth across greater than one year global swaps, our biggest rates product and U.S. credit, our biggest credit product. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}