{
    "symbol": "TW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 16:18:07",
    "content": " Importantly, these records translate into strong revenue growth as Tradeweb powered past $300 million in quarterly revenues for the first time in our history. This quarter was marked by strong performance across all our asset classes, with rates in credit continuing to lead the way, accounting for 46% and 31% of our revenue growth, respectively. Finally, within equities, institutional ETFs produced record quarterly revenues with average daily volume up 54% year-on-year, driven by new client wins and strong industry volumes. Tradeweb facilitated a record $89 billion in portfolio trades in the first quarter of 2022, an increase of more than 25% year-over-year, aided by a client growth of 70%. Our biggest revenue bucket within our rates franchise, just like credit, the multiyear growth story continues as swaps registered another strong quarter, aided by rebounding industry volumes and market share gains. In sum, our blended fees per million increased 6% year-over-year, primarily as a result of stronger growth in higher fee per million credit, cash rates and cash equities. For cash rate products, fees per million were up 8%, primarily due to growth in higher fee per million U.S. treasuries and migration of certain European government bond clients from fixed to variable contracts. Drilling down on cash credit, average fees per million increased 9% due to stronger growth in U.S. high yield, which carries a higher fee per million overall cash credit. Looking at the credit derivatives and electronically processed U.S. cash credit category, fees per million increased 9%, driven by growth in European CDS, which carries a higher fee per million than the group average. Similar to the first quarter, the diversity of our growth remains a theme as we continue to see double-digit average daily revenue growth across global interest rate swaps, European government bonds, low equities in U.S. and European corporate credit."
}