{
    "symbol": "AMG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 12:49:04",
    "content": " Overall, we see a growing opportunity for our affiliates to attract flows and generate performance fees across our diverse set of absolute return, data sensitive, and private market strategies that builds on itself over time, as strong performance leads to inflows, which translate into higher asset levels and a greater opportunity to generate future earnings growth. For the first quarter, adjusted EBITDA of $255 million grew 3% year-over-year, driven by new investments and strong affiliate investment performance and partially offset by a decline in performance fees and mark-to-market gains on strategic investments to $25 million in the quarter. Looking ahead, we remain focused on executing our growth strategy and on evolving our business towards secular growth areas and our opportunity to drive substantial earnings growth by investing in new and existing affiliates and returning capital to shareholders through share repurchases positions us well to compound earnings at industry-leading levels and deliver significant shareholder value. Please proceed with your question. So maybe just a little bit in terms of how well-positioned AMG is in this environment, given not only our strong balance sheet and capital position, which as you know will further be enhanced post the Baring deal closing, but also just the unique nature of our business and the way that our earnings and cash flow characteristics tend to perform in this type of an environment. Please proceed with your question. Please proceed with your question. We've talked a number of times already today in both our prepared remarks and in the answers to questions about the diversity of our business, the excellent performance we're seeing, and that will continue to drive strong earnings over the course of the year. But when you look more past next quarter, you look over the next couple of quarters, what you're seeing in our business is seeing flow story, really good performance, especially in the absolute return strategies, which presumably will lead to better flows in those categories, and maybe even strong flows in those categories. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}