{
    "symbol": "AMG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 10:53:02",
    "content": " Today, our affiliates manage approximately $200 billion of assets under management that can generate performance fees across absolute return, private markets, and data-sensitive strategies, reflecting significant diversity in their contribution to our earnings. And you are seeing exactly that, as affiliate performance and associated performance fee earnings, continued investments in new and existing affiliates, and the impact of share repurchases position AMG to deliver growth in earnings per share. Turning to our second quarter results, economic earnings per share were $4.03, in line with last year's quarterly results as new investment activity and share repurchases offset the impact of markets, foreign exchange rates, and net flows. Now turning to financials, for the second quarter adjusted EBITDA of $213 million including $7 million of net performance fee earnings was down 6% year-over-year primarily driven by lower performance fee earnings as new investment activity largely offset markets and FX. Notwithstanding the severity of the market drawdown in the first-half of the year, our economic earnings per share grew nearly 5% over that time period, as capital allocated to new investments, and share repurchases and the overall diversity and performance of our business more than offset the impact of markets. The one that you referenced is absolute return strategies, that's businesses like Systematica, like Garda, like Capula, and also like AQR, to your question around  , where exceptionally strong performance is resulting in significant potential performance fee earnings, not only in 2022, but also as we think about the long-term as these businesses continue to grow. So, taking a step back, over the last decade, we've generated more than $1 billion in cash flows from performance fee earnings that significantly enhanced our capital position, it's benefited our shareholders through executing on our growth strategy and through repurchases."
}