{
    "symbol": "PFHC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 15:07:12",
    "content": " The increase was due to higher average pricing on equipment and on materials, providing more materials for our customers and to a lesser extent, higher efficiency on our fleets as measured by pumping hours per fleet net income was $70.1 million for the quarter net income, excluding the stock compensation with a deemed contribution from a related party, would've been $108.9 million compared to $24.1 million. The increase from the prior quarter was driven by FTS contributing to the full quarter compared to one month of contribution in the first quarter, as well as increased pricing and a higher amount of materials provided during the quarter, the manufacturing segment generated revenues of $34.9 million in the second quarter up 8.9% from the first quarter, approximately 88% of this segment was intercompany revenue compared to 84% in the prior quarter adjusted EBITDA for manufacturing was $9.4 million in the second quarter down slightly from $10 million in the first quarter. Please proceed with your question. So, I think my comment on the bundling is when we look forward over the next 12 months, I think the, the point is we see accretion, we see improved performance not just through increasing prices particularly as you look out into next year and I think that, as we said, we're only about 30% bundled or on the sand side and we think there's a lot of opportunity there as it relates to the short term we do continue to see pricing discussions and pricing improvement. Please proceed with your question. Please proceed with your question. And so you're when you've got a really good pit crew, your R&M expenses tend to run pretty consistently otherwise, but what you end up with is that race car is on the track longer running and that's, I think that's one of the main things that drives our superior performance and allows us to get the industry leading EBITDA per fleet. Please proceed with your question. We like what we're seeing on the CapEx budgets, and there is a shortage of horsepower in the market and with the complexity and the mismatch, the as you see more of our peers adding, mismatching fluid ends and mismatching components when you look at the amount of horsepower, that's in a maintenance cycle at any given point 20% to 25% usually when you start mismatching parts and having different types of fluid ins, different types of iron you start seeing more frequent failures and more stress on that supply chain. Please proceed with your question. Please proceed with your question."
}