{
    "symbol": "RBC",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-12 15:17:03",
    "content": " Net sales for the second quarter of fiscal 2022 were $160.9 million versus $146.3 million for the same period last year, an increase of about 10%. Adjusted operating income was $30.5 million, 19% of net sales compared to last year $29.9 million, 20.4% of net sales. Adjusted EBITDA was $45.4 million, 28.2% of net sales compared to $43.5 million and 29.8% of net sales for the same period last year. Regarding the third quarter, we expect sales to be somewhere between $245 million and $250 million, and we are expecting a very strong fourth quarter with contributions from both the industrial and the aerospace markets. As a percentage of net sales, SG&A was 18.4% for the second quarter of fiscal 2022 compared to 17.8% for the same period last year. For the second quarter of fiscal 2022, other operating expenses were comprised mainly of $2.8 million in amortization of intangible assets, $1.4 million of acquisition-related costs, $1.1 million of restructuring costs and related items and $400,000 of other items. Other operating expense for the same period last year consisted mainly of $2.6 million in amortization of intangible assets, $1.5 million of restructuring costs and related items and $100,000 of other items. On an adjusted basis, operating income would have been $30.5 million for the second quarter of fiscal 2022 compared to adjusted operating income of $29.9 million for the second quarter last year. The rate in the second quarter was impacted significantly by approximately $1.9 million of discrete tax expense, primarily associated with the valuation allowance for capital loss carryforwards. Further, in part as a result of the blackout associated with the acquisition of Dodge, benefit associated with stock compensation activity was approximately $100,000 during this past quarter compared to $400,000 last year and $2.1 million last quarter of fiscal 2022. For the second quarter of fiscal 2022, the company reported net income of $6.9 million compared to net income of $20.4 million for the same period last year. On an adjusted basis, net income would have been $23.5 million for the second quarter of fiscal 2022 compared to adjusted net income of $23.2 million for the same period last year. On an adjusted basis, net income available to common stockholders for the second quarter of fiscal 2022 was $23 million compared to $23.2 million for the same period last year. And on an adjusted basis, diluted EPS for the first quarter of fiscal 2022 was $0.89 per share compared to adjusted diluted EPS of $0.93 per share for the same period last year. Excluding the impact of the additional shares issued for the offering of the common and preferred stock, adjusted diluted EPS would have been $0.92 per share compared to $0.93 per share for the same period last year. Your line is open. I mean, I think once you start to factor in Dodge, we're looking at total amortization per quarter of somewhere in the $17 million to $18 million, including RBC legacy. Your line is open. So for Q3, I'd say this – the center point for RBC is around $153 million compared to last year of about $145 million or $146 million. Your line is open. Your line is open. And then just on the accounting, Rob, you and I have talked about this briefly previously, but you're expecting is about $5 million in preferred dividends each quarter or the stock where it is. The dividend should be about $5.8 million a quarter, just based on the liquidation value of the original securities of 100 and the number of shares issued at 5%. Your line is open. Your line is open."
}