{
    "symbol": "RBC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-26 14:50:21",
    "content": " RBC Bearings net sales for the third quarter of fiscal 2022 – for the fourth quarter of 2022 were $358.9 million versus $160.3 million for the same period last year, an increase of 123.9%. Adjusted EBITDA for the fourth quarter was $104.4 million, 29.1% of net sales, compared to $45.9 million and 28.6% for the same period last year, a 127% increase. Expanding on gross margin that Mike already covered, gross margin for the fourth quarter of fiscal 2022 was affected by a $6.8 million inventory step up related to the Dodge acquisition. For the fourth quarter of fiscal 2022, other operating expenses included $5.7 million of costs associated with the Dodge acquisition, including $4.7 million of costs associated with transition services. On an adjusted basis, operating income was $70.4 million for the fourth quarter of fiscal 2022, compared to adjusted operating income of $32.5 million for the fourth quarter of fiscal 2021. On an adjusted basis, net income available to common stockholders for the fourth quarter of fiscal 2022 was $36.3 million compared to $27.4 million for the same period last year. Turning to cash flow, the company generated $46.9 million in cash from operating activities in the fourth quarter of fiscal 2022 compared to $41.9 million for the same period last year and $180.3 million in cash from operating activities for the 12 month period fiscal 2022, compared to $152.5 million for the same period last year. Your line is open. Your line is open. Your line is open. So you know if you have – if you're running $10 million through a plant and your variable cost of supplies, tooling and hardware and oil and filters and other is 5% of your revenues, well if your revenues go down $2 million then its 5% of $8 million rather than $10 million. Your line is open. So that's going to – you know that should go away after this quarter, that’s what we’re anticipating and then there's $1 million of other ancillary costs as associated with legal, accounting, things like that, that were associated with the acquisition. Your line is open. Your line is open. Your line is open. Yeah, and our target still is by fiscal ’23, it’s to pay down at the minimum $400 million of debt and I think all the way through this quarter already we played down about $100 million through the fourth quarter and so we’ll continue every quarter reducing that, allocating our capital to get to our target and get that leverage down."
}