{
    "symbol": "VLO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 15:28:03",
    "content": " Excluding the unfavourable impact from the change in working capital of $722 million and the other joint venture members, 50% share of Diamond Green Diesel's net cash provided by operating activities, excluding changes in DGD's working capital, adjusted net cash provided by operating activities was $1.2 billion. Excluding capital investments attributable to the other joint venture members, 50% share of Diamond Green Diesel and those related to other variable interest entities, capital investments attributable to Valero were $718 million in the first quarter of 2022. We returned $545 million to our stockholders in the first quarter of 2022, with $401 million paid as dividends and $144 million of stock buybacks, resulting in a payout ratio of 44% of adjusted net cash provided by operating activities for the quarter. Please proceed with your question. Please proceed with your question. We're giving our volume guidance in terms of how the second quarter looks, but I think going forward, as long as there's this much backwardation in the market, we'll make -- trying to figure out what the margin capture is going to be on a go-forward basis, a little more difficult. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. One of the things that you've seen in the working capital ideas is that with this tiny traded derivatives market, the paper markets, it's sort of is trying -- what you're seeing is the trading companies and the operating companies are trying to sort out who's going to have the physical length that's going either across the Atlantic or to South America, depending on trade flow, and it's because there's just -- this volatility is an derivative market. Please proceed with your question. Please proceed with your question. And the -- we are -- it will be lumpier because they are sizable projects and so I think direction of that is true from -- potentially from a year-to-year, I don't think you'll see us go from 0 to $2 billion or something like that, but you'll certainly see a $0.5 billion of variability with respect to our strategic capital spend here in the near term. Please proceed with your question. But with our experience in acquisitions of assets, you go through the periods of being super enthusiastic about it, and then you get deal heat, you want to go do it and then you buy it and then you get in there and you start looking at it and Lane tells me it's going to cost $3 billion to get it up to a Valero standard, and I look at it maybe that wasn't exactly the best thing. Please proceed with your question."
}