{
    "symbol": "SUMO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-08 20:56:02",
    "content": " As customers embark on their cloud journeys, our leading SaaS analytics platform helps address the challenges and needs for reliable and secure cloud native applications, which ultimately helps address their broader desk SecOps requirements for both observability and security. We're also continuing to see customers expand their initial use case as they recognize the benefits of using our platform for engineering, operations and security teams to address the challenges of observability and security as well as DevSecOps initiatives. Our Q4 revenue growth was driven by continued traction with our customers that spend more than $100,000 a year with us, as these customers grew 27% year-over-year. As highlighted by the customer use cases we shared, we are winning new customers in both the security and observability markets while also successfully cross-selling the benefits of our entire cloud analytics platform as we enable our customers to deliver reliable and secure cloud-native applications. As further evidence of the value we provide our customers, we ended the year with 44 customers with ARR greater than $1 million, representing more than 40% year-over-year growth. Taken in conjunction with our ARR growth of 24%, this means that our FY '23 ARR growth was driven equally by the new customers we added in the last 12 months and by our existing customers expanding the use of our platform. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Now one of the aspects that's really important here because of the shortage of labor, in security and particularly, this is a great opportunity for Sumo to really leverage our MSPs, EDR/MDR partners to bring them to complement our superior technology from a SaaS perspective to complement where customers are either because of maturity or secondarily, because of resources. Your line is now live. Your line is now live. Your line is now live. Your line is now live. So I think that could be even a larger proportion of contribution for us, particularly because we've made investments not only in technology to simplify it, but also investments on the compensation side for our reps, let alone the reps from the MSPs, both on the VAR side as well as their own delivery side to make sure there's no friction, but more importantly, there is margin and value to the ultimate customer."
}