{
    "symbol": "ACN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-22 11:54:04",
    "content": " We delivered revenues of $62 billion, representing a record 26% growth in local currency, adding $11 billion in revenue for the year. We achieved this profitable growth while continuing to invest significantly in our business and people with $3.4 billion deployed across 38 acquisitions that are well balanced across markets, services and strategic priorities; $1.1 billion invested in R&D assets, platforms and industry solutions, including growing our portfolio of patents and pending patents to more than 8,300; and $1.1 billion invested in the training and development of our people to grow the skills needed to serve our clients. This year, we are proud to achieve our highest brand value and rank to date on BrandZ's prestigious Top 100 Most Valuable Global Brands list, increasing 28% to over $82 billion and ranking number 26. We were very pleased with our strong bookings this quarter, which reflects 22% growth in U.S. dollars and 31% growth in local currency, including 26 clients with bookings over $100 million in the quarter. Operating income was $2.3 billion in the fourth quarter, reflecting a 14.7% operating margin, up 10 basis points compared with Q4 last year. We delivered $71.7 billion in new bookings, reflecting 21% growth in U.S. dollars, hitting 100 clients with quarterly bookings of $100 million, which positions us well as we begin FY '23. First of all, against the backdrop of the current macroeconomic environment, we delivered $18.4 billion in new bookings in Q4, a year-over-year increase of 31% in local currency. And our operation services, now a $9 billion business with 19% growth in FY '22 are fundamental to total enterprise reinvention for our clients because they help our clients digitize faster, access digital talent and reduce cost. And as our clients build their digital core, security continues to be more important than ever, With over $6 billion in revenue and 45% growth, our integrated security capabilities from identity to threat intelligence to manage security services to incident response are critical as our clients respond to increasing risk as the security landscape widens. For earnings per share, we expect full year diluted EPS for fiscal '23 to be in the range of $11.09 to $11.41 or 4% to 7% growth over fiscal '22 results. And so maybe I'll also just take a chance to talk about what that means in terms of how we're going to invest in our business next year and how that relates to how we're seeing our profit because I think it's really important to point out that we're really proud of what we accomplished this past year in '22, where we did 10 basis points of expansion."
}