{
    "symbol": "SAM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 21:21:04",
    "content": " Given Truly Hard Seltzerâ\u0080\u0099s growth last year, we knew we will be facing tough volume comparisons this year, the continuing decline of the hard seltzer segment, which was down 17% in volume and 13% in dollars and off-premise channels in Q2 is deeper than previously expected, which impacted our second quarter results, and is expected to continue to impact Trulyâ\u0080\u0099s performance for the balance of 2022. For the remainder of the year, weâ\u0080\u0099re focused on fueling Twisted Tea and Hard Mountain Dewâ\u0080\u0099s growth and remaking Trulyâ\u0080\u0099s core original flavors with improved formulations, a new ad campaign to communicate those changes and superior distributor support and retail execution. While the hard seltzer segment was 10% of total beer dollars in the second quarter of 2022, itâ\u0080\u0099s down from 11.4% in the second quarter of 2021. I think the interesting thing I just looked at the other day in RTDs is that they have about the same number of brands and SKUs, like call it, 250 brands and over 1,000 SKUs as hard seltzers do right now in the market, but there are 7% of Beyond Beer and hard seltzers are 48% of Beyond Beer. And I think what happened over the last year, if you look at -- just look at our 12-pack distribution, itâ\u0080\u0099s something like 58% of the ACV right now. The other thing I would suggest, again, a sign of strength of the brand to believe in it is that -- itâ\u0080\u0099s -- from a single-serve perspective, itâ\u0080\u0099s by far and away, the number 1 FMBs 24 ounce, itâ\u0080\u0099s number 4 in all beer of all -- like so thereâ\u0080\u0099s three beer brands that come ahead of it, maybe guess where they might be, and then itâ\u0080\u0099s Twisted Tea. They walk into -- itâ\u0080\u0099s like the most egalitarian place for a brand to present itself, and Twisted Tea has got -- is getting the attention, and weâ\u0080\u0099re also adding -- weâ\u0080\u0099re adding some flavors in 24-ounce as well to broaden that yellow band that you see in convenience stores."
}