{
    "symbol": "SAM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 22:51:07",
    "content": " In 2023, we expect overall volumes to decline with strong growth in Twisted Tea, offset by our expectation for continued negative Truly volume growth as the Hard Seltzer category likely will decline between 10% and 15%. As evidence of its durability, the brand's fourth quarter dollar sales growth in off-premise measured channels accelerated to 33% versus the full year's 31% and Twisted Tea's 2023 year-to-date growth rate has further accelerated to 36%. As Jim mentioned in his remarks, we're disappointed that the reformulation of Truly has yet to improve trends and are planning a major refresh of the Truly brand in the second quarter of 2023 that includes new easy-to-navigate packaging, more motive versus product-centric brand communication elevated media spend across all channels, especially digital and social media and aggressive marketplace execution to improve product availability and visibility, especially with our lightly flavored variety packs. For example, we realized in last year's second quarter after launching Truly Margarita that adding further bold flavor variety pack innovation was not going to be as successful as we had experienced with prior innovations as consumers were clearly overwhelm category news. Based on this new work and stepped up brand investment, we're expecting to gain share this year, although the first quarter will be more challenging as we lap last year's Truly Margarita launch. In summary, we believe the investments we're making this year in enhancing our marketing plans and packaging for Truly continuing to fuel Twisted Tea's momentum, reducing supply chain complexity and lowering our cost base should drive operational effectiveness and improve top line growth market share and margin performance over the next few years. Shipment volume for the quarter was approximately 1.71 million barrels, a 16.7% increase from the prior year, partly due to an additional week in 2022 compared to 2021, reflecting increases in our Truly Hard Seltzer, Twisted Tea, Hard Mountain Dew, Angry Orchard and Dogfish Head brands, partially offset by decreases in the Samuel Adams brand. Our fourth quarter 2022 gross margin of 37% increased from the 28.7% margin realized in the fourth quarter of 2021, primarily due to lapping prior year costs related to the 2021 Hard Seltzer slowdown, partially offset by higher brewery processing and inventory obsolescence costs. This decrease in the net loss of $40.4 million or $3.29 per diluted share was due to lapping the 2021 combined direct and indirect costs related to the 2021 slowdown in Hard Seltzer category growth as well as higher net revenue in the current quarter, which were partially offset by increased supply chain costs and slightly higher operating expenses. If you look at numerator, we're still within the 21- to 34-year-old age group, which is a group that's really stuck behind Hard Seltzer. I think the share gains will come -- first of all, there's a long tail for perspective in Truly is the #2 brand, the next 46 brands equal the share that Truly has, including Bobbitt Seltzer. We didn't -- we don't expect it to be an overnight success, but it's something that other brands have 5 or 6 years has started us so we're going. And we think we're building a brand that could stand for those 3 things: refreshment, session ability and variety and whether you take that in a traditional like super space, Hard Seltzer market is Truly Hard Seltzer or within the Vodka space or we've already talked about getting into Tequila as well, which to us, they're all kind of the same occasions. Just maybe if you could provide some more color on your decision to not take more pricing, in particular, given the continued margin headwinds and the increases that you were able to successfully pass through in -- I guess like I know this is initial guidance, but as we look at it, just trying to understand if there's upside to the pricing as we look out over the course of the year."
}