{
    "symbol": "SAM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 21:17:06",
    "content": " Our new Truly Margarita is the most successful new product launch thus far in 2022, as it’s the number one new SKU in all of beer with a 4.6 volume share and a $4.40 share of hard seltzer and measured off-premise channels year-to-date. You may proceed with your question. You may proceed with your question. You may proceed with your question. But it’s certainly it’s important because I mean one thing I will say is that, our – we get – we have – last year, we finished the year with the second highest penetration rate of any brand and beer next to Bud Light, which means we have there is a large willing group of Truly consumers who are looking for innovation from us and having the extra shelf space is really important to get it out there permanently on the shelf so they can find it. You may proceed with your question. If we look at depletions and shipments and the way I think you have to look at the quarter and as Dave indicated in his remarks, as you have to see that in light of last year’s Q1, where shipments grew 60%, depletions 48%, everybody was fully behind the hard seltzer growth across all channels and across all parts of the channel. You may proceed with your question. I think another – the next frontier might also be beyond beer in on-premise, so we talked about Seltzer, Twisted Tea, I think only maybe 3% or 4% of Twisted Tea’s volume is in on-premise, but that’s an opportunity for us as well to pursue that. You may proceed with your question. You may proceed with your question. So that’s something that’s very much on our radar and we’re going to see how things participate, I think how they play out as it relates to state lemonade to start the year, which you reference lemonade really got hurt with our supply chain issues in the first quarter. You may proceed with your question. As it relates to the mix between innovation depends on how you want to look at whether it’s line extension innovation or new brand innovation we have a lot of innovation this year and say, we’re probably waited toward innovation, everything from Twisted Tea Light to Truly Margarita, which are wine extensions, but they’re innovation to hard do, which is more Bevy or Seltzer, which are brand new. You may proceed with your question. You may proceed with your question. I think, I mean, we – I mean, we’re – we have a plan to start the year, and I think this year, I mean, our first goal this year was to continue to try to gain share as we have last year in Hard Seltzer, but to build a broader base of support across the portfolio."
}