{
    "symbol": "TME",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 10:30:06",
    "content": " Next, let's look at the Tencent Musician platform, leveraging our robust technology to innovate and augment our one-stop service offerings for musicians, in the third quarter, we launched a new feature TME Artists Album, champion . In the third quarter, we came up with YG Entertainment, , to provide our users with benefits in the 30 days head start period following the release of their new songs, notably  digital album, greatest works of art, , recorded the sales of close to 7 million copies by the end of the third quarter, whereas latest EP West, Taylor Swift's new pop album Midnight, and BLACKPINK's digital single, Pink Random and album Born Pink also achieved startling sales reflecting our users pent-up demand for user engagement with artists from home and abroad. In terms of sound effects, improvements in this quarter, we became the first music platform domestically to offer an immersive audio experience with Dolby Surround song,  to our Super VIP membership's subscriber and the entire users as well as in these music releases on our Tencent emulation platform. This quarter, our online music MAUs were 587 million, down year-over-year primarily due to churn of our casual users amid competition from Ten Entertainment Platforms, as well as cost optimization measures to focus on boosting monetization efficiencies as a platform of scale. Notably, online music paying users, a cohort representing high quality users, continued to grow at a robust pace, and drove paying ratio to a new record, while ARPPU also kept improving sequentially driven by our expanding content offerings and product enhancements, as well as broadened sales channels and moderated promotions. For live streaming services, we continue to expand our differentiated content offerings and user experience, benefiting from our streaming format innovations and deeper cooperation with our music contests  Revenues from audio live streaming rose double digit year-over-year in the third quarter to reach a new high. Hi, good evening management. Hi, good evening management. Hi, good evening management. The healthy subjects subscription revenue growth, driven by a combination of both ARPU increase, as well as subscriber growth and not just subscriber growth, the continued solid increase in advertising, as well as good cost control on our content cost side all leads to healthy and sustainable improvements in music margin."
}