{
    "symbol": "TME",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-21 12:17:18",
    "content": " Looking ahead into 2023, as we are repositioning ourselves to better capture future growth areas, we currently expect our quarterly revenues from online music services will exceed those from social entertainment services at some point within this year. Meanwhile, with our relentless focus on executing our growth strategies and operating efficiencies, we are confident to achieve year-over-year growth in total revenues and profitability as well as continuous improvement in user quality in 2023 while fueling the thriving music industry Next, I would like to talk about remarkable achievements we have made in many aspects of our businesses build a point our insistence on excellence and innovation. Our algorithm upgraded also contributed to our more personalized listening experience leading to sustained healthy year-over-year growth in QQ Music and Kugou Music, recommendation streaming volumes and the time spent per user in the fourth quarter. Online music paying users, a high-quality user cohort, maintained a strong growth trend and ARPPU also continued to improve sequentially for the third consecutive quarter and increased year-over-year. His original song Worthless Relationship,  has attracted high streaming volume and landed a spot on many of our music charts as we are building a bridge between performance and the fan bases revenues from audio live streaming increased by double digits year-over-year with solid growth in paying users and ARPPU year-over-year. The increase was primarily due to improvement of monthly ARPPU for music subscribers, growth of paying users, lower revenue sharing fees for livestreaming services and improved operating cost efficiencies. In the â\u0080\u0093 in terms of online music, we expect subscription revenue to continue to deliver healthy growth of over 20% year-over-year, driven by both growth in paying users as well as ARPPU. Please un-mute yourself and go ahead. Please un-mute yourself and go ahead. Please un-mute yourself and go ahead. Please un-mute yourself and go ahead. Xueqing, your line is open. Please un-mute yourself and go ahead. Please un-mute yourself and go ahead. Please un-mute yourself and go ahead. Xueqing, your line is open. Please un-mute yourself and go ahead."
}