{
    "symbol": "OUT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 19:30:06",
    "content": "  Operator: Good day, everyone, and welcome to the OUTFRONT Media First Quarter 2022 Earnings Conference Call. Good afternoon, and thank you for joining our 2022 first quarter earnings call. Our comments today will refer to the earnings release and a slide presentation that you can find on the Investor Relations section of our website, outfrontmedia.com. After today's call has concluded, an audio archive will be available there as well. Relevant factors that could cause actual results to differ materially from these forward-looking statements are listed in our earnings materials and in our SEC filings, including our 2021 Form 10-K and our March 31, 2022, Form 10-Q, which we expect to file tomorrow. Reconciliations of OIBDA and other non-GAAP financial measures are in the appendix of the slide presentation, the earnings release and on our website, which also includes presentations with prior period reconciliations. It's great to be here sharing our first quarter results, which came in stronger than we anticipated when we spoke last in February. Many of the positive trends we previously noted continued into the start of 2022 and, indeed, through to today. And given the flexibility of digital, we continue to book late incremental business. This is reflected in our increase in billboard yields, and transit revenues continue to improve as employers increasingly encourage their teams to join them in the office, at least part of the time. These trends, binds with the terrific efforts of our employees, led to our strong revenue results, the details of which can be seen on Slides 3 and 4. Total revenue grew 44%, ahead of our low 40s expectation. We continue to see strong revenue growth in virtually all of our regions for both billboard and transit, but our performance in large markets was exceptional, with New York and L.A. being 2 of our best performers in Q1. Other, which consists mostly of Canada, was up 40% versus the prior year. Our strong revenue growth led to a nearly $60 million year-over-year improvement in both OIBDA and AFFO, which grew to $70 million and $36 million, respectively. On Slide 5, you can see a more deep outlook at our U.S. Media revenues. Billboard grew by 33% from last year, but even more impressively, it was up around 20% versus the same quarter in 2019. Transit also accelerated its year-over-year performance, up 115% in Q1 compared to the 101% observed in Q4. Transit revenues continue to face the headwind of lower ridership, but we were, again, pleased to see the New York MTA revenue recovery outpacing readership growth when both are measured against the same period of 2019. Indeed, the positive gap between these 2 widened, which is a trend that gives us further confidence and our expectation of 2019 transit revenue levels being achieved next year. National growth outpaced local again this quarter, up 59% year-over-year compared to local's 36%. Billboard was strong across both sets of advertisers, with national up 39% and local up 30%. One of the most encouraging trends for our company is our impressive U.S. billboard yield growth, as seen on Slide 7. Over $2,300 is a Q1 record, a 35% increase from last year and 25% above Q1 2019. While occupancy has improved from last year's first quarter, the largest contributor to our yield growth is rate, which was significantly ahead versus both '21 and '19. Digital revenues continue to be helped by increased yield, new inventory and incremental late booking revenues, which expand our selling window. This trend was well illustrated in Q1, as we booked a large contract on March 24, that added nearly $0.5 million to our first quarter revenues. Unsurprisingly, Digital Transit continues to be led by the New York MTA, with demand returning and increased digital inventory at the stations and the beginning stages of rail car deployment. Billboard lease expense was up 14% year-over-year in Q1, primarily reflecting higher variable expense on a small portion of our billboards that contained revenue share agreements. Notably, a majority of these types of revenue share boards are in New York and L.A., which were 2 of our best performing markets this quarter. Fixed lease costs were up only 3% in Q1, reflecting new locations and modest annual lease adjustments. Transit franchise expense is typically a revenue share expense and was up 35%, primarily due to higher revenues, but also due to contractual step-up of minimum annual guarantee payments to the New York MTA. Posting, maintenance and other expense was up 18%, given the additional activity that results from our higher revenue. Lastly, on expenses, corporate and SG&A expense combined increased 28% versus last year. This reflects higher revenue and OIBDA, driving increases in our accrual of performance-based compensation costs as well as a small increase in bad debt expense. On Slide 11, you can see our OIBDA for the quarter is up $59 million from last year and represents a margin of almost 19%. Billboard OIBDA margin was 32.7%, up more than 8 percentage points from a year ago and more than 3 percentage points higher than our 2019 margin of 29.6%. Transit OIBDA improved by $15 million given the higher revenue, offset somewhat by increased transit franchise expense. As we mentioned on the Q4 call, quarterly transit revenue has seasonal fluctuations, while the New York MTA MAG is accounted for on a straight-line basis. We continue to expect that over the full year, the MTA revenue gap to the MAG breakeven will significantly narrow. Q1 CapEx spend was $17 million, including $4 million of maintenance spend. We added 31 digital billboards in the U.S. this quarter, increasing our U.S. total to 1,432, up 174 or 14% versus Q1 2021. In recognition of potential supply chain issues, we ordered boards with additional lead time and still expect to add 150 to 200 total digital billboard displays this year. Looking at AFFO on Slide 14, you can see our Q1 AFFO of $36 million improved by $60 million year-over-year as essentially all of our OIBDA growth flows through to AFFO. For the full year, we continue to expect AFFO growth to be around 60% from 2021 to $205 million. Committed liquidity is over $850 million, and our total net leverage declined to 5x as our OIBDA continues to recover. We continue to monitor rising interest rates and remain very comfortable with our debt stack as our next maturity isn't until 2025, and only 21% of total debt is subject to floating rates. Lastly, we announced today that our Board of Directors has again declared a $0.30 cash dividend payable on June 30 to shareholders of record at the close of business on June 3. Looking specifically to Q2, while obviously, geopolitical and broader economic uncertainties exist, we expect to have another great quarter. From where we sit today, we currently estimate that Q2 revenues will grow in the low 30s percent range, with transit up between 80% and 90% versus last year. As we look at the balance of the year, we believe there are a number of trends that will continue to benefit the business. First, our conversion to digital, which allows for more advanced creative messaging, shortens our time to market, increases our selling window, benefits from automation and also opens up our assets to new advertisers. And third, a diverse client base that includes the return of out-of-home stores such as entertainment, tech, medical, professional services, retail and travel, but also newer users such as cannabis and online sports betting. Outdoor remains by far one of the most cost-effective forms of advertising with Magna estimating that outdoor's cost per thousand impressions is lower than any other form of media, TV, radio, print and digital. Recent changes to digital due to IDFA appear to have influenced some companies advertising campaigns, such that they are beginning to incorporate more traditional advertising into their branding efforts. Given these facts, we believe outdoor and indeed outfront stand to benefit and take a larger portion of total advertising going forward. To conclude, I'd like to say that in my many years of working in out-of-home, I'm as enthusiastic about the state of our industry today as I ever have been in the past, the wind in our sales. Jeremy, I'm sure you've heard or at least heard of a lot of the earnings calls this quarter across the advertising space. And there's been a lot of companies not in out-of-home, but all sorts of digital and other businesses, that have called out incremental weakness in certain categories, auto, CPG, et cetera, talked about supply chain constraints and visibility getting worse. And if there are any categories that you have seen weakening, it'd be interesting to hear which those are and how you're offsetting it, and then I was just curious around New York and L.A., obviously, huge markets for you guys, how far from pre-pandemic revenues are those markets at this point? If we look at the categories that drove Q1, entertainment doubled, technology was up nearly 2x, travel was up 80%, utility was up 75%, resell up 60%. And as we sit here today, looking at Q2, pretty much every category is again nicely in the black. And you mentioned auto, while we saw a little way to running Q2, obviously, auto is actually sort of pacing up 34%. So I do think that when you look at our business, if we are going to notice something, we wouldn't really notice it because remember that we're not quite 50-50, but we have a lot of local business we have a lot of national business. And that national business is literally it's laying down by the day, if you like, typically in 2- to whatever it is, 4-week periods for a few weeks or maybe a couple of months hence. Just going back to the New York and L.A. comment, I mean, the billboard businesses in both markets are nicely above 2019 now. Obviously, transit weighs on the business in New York because that's currently placing around whatever it is around 70% of '19. Just in your prepared remarks, Jeremy, you called out that billboard rate was above 2019 levels. And I guess I can imagine a cynic sort of saying, well, that's just driven by inflation as opposed to some of the comments you made about outdoor potentially taking share, given some of the IDFA like changes that have taken place. I mean that's well ahead of any inflation that we've seen over that time, including the kind of whatever is headline inflation rate that we're seeing right now. And I do believe that inflation generally for our business and for the industry as a whole because of the relatively fixed cost nature of the leases were versus our ability to go out and length of those leases versus our ability to go out and if you like, sell over much sort of shorter duration than leases actually thinking inflation is generally a good thing for us, generally a good thing for the industry. So in the later half of the year, third and fourth quarter, New York will be a positive EBITDA story in transit. So I think, overall, the transit -- our transit portfolio EBITDA should turn positive later in the year going forward. Looking at 2023, we've said in the past and we'll say again that we expect our transit revenue overall, including the MTA, to be back at 2022 levels, and we shouldn't have this MAG situation impacting next year's numbers. So when you sort of drill into our business, we have -- in both our local and national business, we had percentage of our boards that typically would book -- we call them kind of tenant locations. So it's relatively short, and we think that short a good thing because in the past, out-of-home has always seen as being something that was pretty inflexible. If you have major campaigns down 8 weeks before, there's no way you could get into out-of-home, whereas now with the flexibility of digital, you can literally come to us on a Friday evening and see your campaign on the Saturday. Historically, I think inflation hasn't necessarily impacted the cost of the screens, maybe some of the materials and some of the labor cost a little bit higher. And of course, physical with digital to be sort of 50% issue at the media market. Quite often, we'll be competing with Facebook or indeed looking to complement their digital campaigns through out-of-home, which is -- tends to drive people online. I think we can use our digital screens is a very, very good effect in terms of keeping customers and consumers advice of what's going on in the system. And we, obviously, just want that to continue and really now more people put off using public transit because our cities need public transit to exist."
}