{
    "symbol": "ICE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 12:27:06",
    "content": " Recurring revenues, which include our exchange data services, and our NYSC listings business increased by 5% year-over-year in the fourth quarter. For the full year exchange segment, revenues increased by 8%, including a 33% increase in our interest rate business, a 20% increase in equity derivatives, and an 8% increase in our global natural gas revenues. Somewhat offsetting with slower growth in our end-of-day pricing business, we're experiencing a slower sales cycle and pressure from asset base revenues in our index business, which declined double digits year-over-year, as investors shifted out of higher fee risk assets, such as equities and corporate bonds, and communities and treasury ETFs. Although our European carbon markets experienced headwinds in 2022 due to the aforementioned factors, the secular trend towards cleaner energy continues and is a growth trend we are uniquely positioned to capture, as evidenced by the record year in our North American environmental markets with volumes up 5% year-over-year in 2022. These factors, coupled with our continued efforts to build institutional connectivity to our bonds platforms, continued to record full year revenues -- to record revenues in our ICE Bonds business in 2022 up nearly 100% year-over-year. For example, in 2022, inflationary concerns and market speculation of central bank activity benefited our European and U.K. interest rate business, driving a 33% increase in revenues for the full year. Across our mortgage business, even against this backdrop of rising interest rates, our business outperformed the broader market driven by strong recurring revenue growth, up 16% for the full year. Alex, your line is now open. Alex, your line is now open. With the recurring revenues up about 16% mid-teens in 2022, I was hoping you might be able to help unpack what portion of that recurring revenue growth was from unit growth, from existing -- excuse me, unit growth from new customers versus wallet share gains from existing customers where you're expanding the services they are offering to them versus what portion of the growth is coming from current versions from transactional to the recurring revenue side."
}