{
    "symbol": "ICE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 13:09:14",
    "content": " Recurring revenue growth which accounted for nearly 85% of segment revenues grew by 6% in the quarter, once again driven by double digit growth in our index and consolidated feeds businesses, and strong performance from our ICE Global Network and other data services businesses. Importantly, these high growth recurring revenues are underpinned by mission critical data, and technology that's embedded in our customers workflows, and by adding more stable revenue streams to our current mortgage technology revenues, we will improve the visibility and durability of our earnings and cash flow, further complementaring our all-weather business model. So given the resiliency of that business model that Black Knight has, continuing to shift more of the business towards recurring, you have a millennial generation that's just now coming into their home ownership years, that is a very substantial population in the U.S. that's going to be entering the mortgage buying market and we see all of those as trends that will help support you know the long term goal of 8% to 10% growth for the business. As we're able to compliment all of that origination data, with the secondary marketing data that we get from Black Knight, coupled with the servicing and loan performance data, we now have a really unique data set that as Jeff mentioned is going to provide a completely different level of transparency and visibility into how the secondary market thinks about pricing our mortgage backed securities and certainly modeling out prepayment. Because here the industry is so inefficient, it is the most analog space in asset class that we've seen, as we've been on our journey of taking businesses from analog to digital, that what's really driving this and when you think about that TAM, we are not taking market share from other people, we are taking market share from just complete inefficiency, manual processing and costs that are rising on the end consumer, costs that are rising for servicers and originators and the plan is to bring that all down."
}