{
    "symbol": "ADMA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 19:23:03",
    "content": " We refer you to the disclosure notice section in our earnings release we issued today in the Risk Factors section of our 2021 annual report on Form 10-K for the year ended December 31, 2021 as well as the risk factors section of our quarterly report on Form 10-Q for the quarter ended September 30, 2022 for a discussion of important factors that could cause actual results to differ materially from these forward-looking statements. Our strong normal source in RSV hyperimmune plasma supply inventories, which are included in the total inventories of $163 million recorded at the end of the third quarter are anticipated to support all upwardly revised revenue forecast on an ongoing basis across our IG portfolio. Excluding the impact associated with the sale of lower margin 2,200 liter scale BIVIGAM, the company estimates corporate gross margins for the third quarter would have been approximately 2% to 4% higher compared to reported results, translating to an approximate 26% to 28% corporate gross margin in a normalized quarter. In addition to approximately $1 million in non-recurring operating expenditures incurred during the quarter, the company estimates third quarter operating loss would have been approximately $7 million the equivalent of approximately 50% improvement compared to the prior year's third quarter. Additional offsets during the third quarter of 2022 included increased plasma center operating expenses of $1.7 million and this was attributed to having nine plasma centers in operation compared to five operating centers during the same period last year, as well as increased general and administrative expenses of $2.2 million resulting from increased headcount, commercialization and marketing expenditures. As you understand, the seven to 12 month manufacturing timeline, these BIVIGAM margins in the 4,400 liter production scale, which was recently approved in April 2021 from 2,200 batches will go from a single to low double-digit margin to the mid-20% to 30% gross margins for the 4,400 batches over the coming quarters. I want to ask a follow-up question around gross margin dynamics in the quarter, the math seems pretty clear with respect to the dynamics between the 4,400 and 2,200 liter production volumes, but just want to think about this over the next couple of quarters because it sounds like there's some residual inventory that probably will remain around, I'm guessing, till sort of mid-2023. There's a couple of quarters to go that we feel that the 4,400 will be sold exclusively starting in the middle of 2023 at a higher margin production process again in the 20% to 30% range for the 4,400 batch production liter process."
}