{
    "symbol": "MNTV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 11:45:19",
    "content": " Good afternoon, and welcome to Momentive Globalâ\u0080\u0099s second quarter 2022 earnings call. Joining me on todayâ\u0080\u0099s call is Zander Lurie, CEO; Priyanka Carr, COO; and Justin Coulombe, CFO. Prior to this call, we issued a press release with our Q2 2022 financial results as well as managementâ\u0080\u0099s prepared remarks for todayâ\u0080\u0099s call. During the course of this call, management will make forward-looking statements, which are subject to various risks and uncertainties, including statements related to our strategy, investments, revenue, operating margin, unlevered free cash flow margin and cash flow. A discussion of the risks and uncertainties related to our business is contained in our filings with the Securities and Exchange Commission, in particular, in the section entitled Risk Factors in our quarterly and annual reports, and we refer you to these filings. A reconciliation of GAAP to non-GAAP results may be found in our earnings release, which is furnished with our 8-K filed today with the SEC and may also be found on our Investor Relations website. Finally, todayâ\u0080\u0099s call will reference Rule 40 financial performance, which the company defines as a combination of year-over-year revenue growth and unlevered free cash flow margin. The company will discuss its target operating model in Rule 40 on its August 5 Virtual Investor Day for more information or to register for the event, please visit our Investor Relations website. At Momentive, we are pursuing several long-term initiatives to expand our market opportunity, increase our value proposition for customers, and drive more operating leverage. As illustrated in our full year 2022 guidance, we expect to hit low to mid-double digit operating margin in Q4. If you tune into our Investor Day tomorrow, youâ\u0080\u0099ll hear us lay out a very achievable path to Rule of 40+ financial performance, characterized by durable growth in both of our go-to-market channels and significant operating leverage. In Q2, sales-assisted revenue increased 30% year-over-year, our fifth consecutive quarter of 30%+ growth, surpassing $175 million in run rate revenue. We ended the quarter with approximately 15,700 customers, up 67% year-over-year. We added approximately 2,000 new customers quarter-to-quarter, including Jefferies, SecurID, Sodexo Pass France, Tufts Medical, and Volkswagen Group of America. This is a highly efficient, profitable sales motion with a focus on capturing new customer relationships early to facilitate account growth as we deliver value over time. With our sales-assisted revenue base at scale, we are focused on growing customers within our existing base of 345,000+ organizations. We ended the quarter with more than 2,200 customers spending more than $25,000 annually with us. As a reminder, our insights solutions target four primary buyers: investors, marketing professionals, product leaders, and researchers. As weâ\u0080\u0099ve discussed on prior calls, insights solutions revenue recognition is still largely project-based, so its impact on our top line is more immediate compared to our subscription-based products. Retention and renewal metrics remain healthy, particularly for customers with multi-seat products, and our expansion motion is building momentum. In our self-serve channel, year-over-year revenue growth of 1% was in-line with our expectations. In our Q1 call, we shared our diagnosis of the main issue in self-serve, a weaker top-of-funnel and we outlined the steps weâ\u0080\u0099re taking to reinvigorate growth on the web. Specifically, generating high-quality user traffic through new content and search engine optimization strategies, focused brand initiatives, and competitive search engine marketing investments to reinvigorate SurveyMonkey traffic. As noted, these top-of-funnel initiatives will take time to impact revenue. But our leading indicators are showing early positive signals in North America, the geography with our strongest conversion rate while retention, AOV, and conversion metrics remain in a healthy range. As we think through the second half of the year, weâ\u0080\u0099re adjusting our revenue outlook to reflect increasing macro and FX headwinds, especially as it relates to new business across both go-to-market channels. However, we are maintaining our 6% to 7% non-GAAP operating margin guidance for the year, which implies low to mid-double digit margin in Q4 and believe we can drive meaningful operating leverage to reach Rule of 40 financial performance. The market is there, our products and teams are in place, and weâ\u0080\u0099re at scale to drive more profitable growth. Before I turn the call over to Justin, I want to discuss the Board and management changes we also announced today. Ken Ewell, who joined us as Chief Customer Officer in December of 2020, will now oversee the entire sales-assisted go-to-market strategy, from new sales to renewals, support, and expansion. Given our increased focus on growth through expansion within our existing base, we think the time is right to consolidate our sales-assisted motions under one leader. He strengthened the Finance organization, hired a strong Chief Accounting Officer, and partnered with the Board and executive team to build the plan and processes that tie to the operating model targets weâ\u0080\u0099ll share with you tomorrow. Weâ\u0080\u0099re putting our CFO search on the fasttrack while Justin remains in his role through the end of Q3, and the Board and I wish him future success. As weâ\u0080\u0099ll discuss tomorrow, the pace of change continues to accelerate, and thereâ\u0080\u0099s a clear need for our powerful, accessible solutions that help business decision-makers succeed when the stakes are high. We believe we are on the path to Rule of 40 financial performance through more profitable growth, driven by expansion within our existing customer base of 345,000-plus organizations. Iâ\u0080\u0099ll now turn the call over to Justin, who will review our Q2 financial results and outlook. I believe we have the assets, business model, and leadership team in place to drive profitable growth and reach Rule of 40+. In Q2, total revenue was $120.2 million, an increase of 10% and within our previously issued guidance range. Revenue from our sales-assisted channel increased 30%, surpassing $175 million run rate revenue, and accounted for 37% of total revenue, compared to 31% in the year ago period. We added approximately 2,000 customers and now have 15,700 customers with a sales-assisted relationship. Further, approximately 75% of last 12 months bookings were from customers with at least one multi-seat product, such as Teams or a Sales-Assisted package. The investment weâ\u0080\u0099ve made to pursue expansion within our massive 345,000+ organizational domain customer base is working, and weâ\u0080\u0099ll provide additional detail on our path forward at tomorrowâ\u0080\u0099s Investor Day. And remaining performance obligations, or RPO, which is the sum of deferred revenue and backlog, rose 13% to $250 million, partially driven by continued traction winning larger, multi-year customer commitments. As weâ\u0080\u0099ve shared in the past, we signed our largest customer to a multi-year deal in Q2 of 2021. Now that weâ\u0080\u0099ve lapped this milestone, we anticipate RPO growth will track closer to deferred revenue growth over time. Non-GAAP gross margin was 83%, improving by approximately 30 basis points from the year-ago period. Non-GAAP operating margin expanded to 2.8% compared to 1.3% in Q2 2021, driven by rigorous expense management specifically with respect to hiring. On a percentage of revenue basis, all functional operating expense lines improved year-over-year, demonstrating the leverage of our business model. In Q2, we recognized $3.3 million in one-time restructuring benefit, which represents the net effect of exiting a portion of our San Mateo, California office space, and continuing to re-align our organizational structure to align with our strategy. As part of our previously announced $200 million share repurchase program, in Q2 we repurchased $32 million of Momentive stock, representing approximately 2.6 million shares at an average price of $12.51 per share. Today, weâ\u0080\u0099re providing full year and Q3 2022 guidance. For Q3, we expect revenue to be in the range of approximately $119.5 million to $122.5 million. For the full year 2022, we expect revenue in the range of approximately $479 million to $485 million, which reflects the impact of demand environment changes we began to see in late June and increasingly unfavorable foreign exchange rate headwinds. As weâ\u0080\u0099ve noted in the past, revenue from our insights solutions formerly known as market research is recognized on a consumption basis as projects are completed, impacting quarter-to-quarter revenue growth trends. As Zander referenced, weâ\u0080\u0099re seeing transitory softness in new insights solutions deals several of the buyers we target are heavily impacted by the current macroeconomic headwinds. Weâ\u0080\u0099ve updated our foreign exchange assumptions for the year, which generates a headwind in the low-single digit million-dollar range in full year 2022 revenue compared to our prior guidance. We continue to expect full year 2022 non-GAAP operating margin of 6% to 7%, which assumes a consistent gross margin profile and operating leverage acceleration in Q3 and Q4. And while we are not providing full 2023 guidance today, we are sharing that we expect to drive at least 5 points of Non-GAAP operating margin leverage in 2023 versus our operating margin guidance for 2022. We expect full year 2022 free cash flow in the range of $1 million to $7 million, which reflects the top line bookings headwinds noted above. As a reminder, our free cash flow includes the impact of approximately $29 million in one-time transaction-related and restructuring expenses a portion of which were accrued as expenses in 2021 but will result in cash outflows in 2022. Excluding the $29 million in one-time transaction-related and restructuring expenses, we would expect full year 2022 free cash flow in the range of $30 million to $36 million. The remainder of 2022 will build on the same operating discipline and lay the foundation for durable and profitable growth, coupled with expanding margins. We look forward to updating you further at tomorrowâ\u0080\u0099s Investor Day, where weâ\u0080\u0099ll outline our operating model targets, including our path to low to mid-20%s non-GAAP operating margin, mid to high-20%s unlevered free cash flow margin, and Rule of 40+. On the self-serve channel, we have not seen any degradation in our renewal rates. And so weâ\u0080\u0099re quite pleased with the value that our product is delivering existing customers, 900,000-plus individual customers and on teams that are seeing value in the product, and weâ\u0080\u0099re not seeing any degradation amidst the macroeconomic headwinds on new business. And so while some of our business may soften if macroeconomic headwinds persist, weâ\u0080\u0099re also going to be well-positioned to challenge for other business that turns out of more expensive providers. And then secondly, on the past calls, youâ\u0080\u0099ve talked a lot about focusing on margin expansion and Rule of 40 targets but also growing your sales-assisted channel quickly. So you can see implied in our Q4 guidance, low to mid-teens operating leverage there, and that will increase at least 5 points in 2023. Weâ\u0080\u0099re not giving guidance yet for full 2023, but we are driving operating leverage in the business every day. Meanwhile, we continue to invest and grow that sales-assisted business. And so for the first few years, obviously, this was an area that was not generating cash, we are going to be continuing to focus to make that channel more profitable. And you can see that a lot of the incremental leverage in our business is, in fact, coming through that sales-assisted channel. So as our renewal business strengthens as that cross-sell and upsell business grows, those are obviously higher incremental profitability deals. So with the sales-assisted new logos growing materially in the past 12 months, how should we think about how much of that is coming from conversion of self-service customers. And I believe in the past, youâ\u0080\u0099ve talked about kind of like a 4x uplift of these converted customers. When we went public, we talked about the 4x revenue uplift we get from converting a basket or footprint of self-serve paid subs into a sales-assisted motion. In fact, the LTV of sales-assisted customers that come from self-service over 2x. And while doing that, we are also expanding existing self-serve or sales-assisted customers. So as we mentioned on the call, today, we have over 2,200 customers that are 25,000 and up, and our overall footprint of 16,000 sales-assisted customers is up some 60%-plus year-over-year. So we continue to see health in new sales, specifically in converting self-serve teams and customers into sales-assisted customers. Continue to see help in converting single-product sales customers into multi-product thatâ\u0080\u0099s now over 900 customers continue to see health in driving that 25,000 and up metric, which is critical to us. And overall, that net nets out to 110% net revenue retention for our multi-seat customers, which is over 75% of our bookings. The vast majority of folks who come to SurveyMonkey, send a survey, try the product and then weâ\u0080\u0099ll convert into paying customers when we do a great job for them. After they convert into paying customers, itâ\u0080\u0099s our job to renew them or to upsell them on to a team package. And when you sit in my chair and you have over 900,000 paying subscribers, our number one job, and Iâ\u0080\u0099m speaking to all of our employees today is to hug your customers and make sure theyâ\u0080\u0099re getting great value from our products. We are seeing health in certain leading indicators, particularly in North America, in Canada and UK that tend to be our highest AOB markets. That is our â\u0080\u0093 obviously, our top effort right now is to reinvigorate health at surveymonkey.com for new business, but our renewal business is healthy. Just wondering if you could talk about the pressure on budget and how that maybe creates a competitive opportunity, do you place more investment against sort of competitive displacement against offline market research products in this environment or is there any general comments on that sort of opportunity given the pressure on budgets that youâ\u0080\u0099re referencing here. Robert, Iâ\u0080\u0099ll take the sales question first, and then Iâ\u0080\u0099ll hand it over to Priyanka to address some of the self-serve initiatives that weâ\u0080\u0099re deploying. On the sales-assisted side, as you mentioned now, we have critical mass of over 16,000 customers. And so our marketing teams, our data teams, weâ\u0080\u0099re synthesizing a whole bunch of signals and using machine learning and AI and the feedback we get in our products to be targeting future sales customers in that base. When our teams get in front of customers, they love the product. And really, as I mentioned before, we just need to make sure that we allocate our resources and marketing dollars and time of our account executives against the healthiest industries because there are industries and there are geos that are facing big macro headwinds and they convert into budget constraints. The top of the funnel, which is how we attract more customers to come to our website to learn about our products, that is our primary focus area at this point in time. It doesnâ\u0080\u0099t mean weâ\u0080\u0099re branding efforts further down in the funnel, which is our pricing and conversion ones, youâ\u0080\u0099ll see activity around that. But our focus really is on durable user growth, as weâ\u0080\u0099ve mentioned in prior calls. And weâ\u0080\u0099re doing the durable user growth, as weâ\u0080\u0099ve discussed to multiple levers. We picked up tremendously on our content production in the last quarter, publishing over so many pieces of content, and we already see the impact of that, especially in North America, where a lot of that content is focused. It takes time for someone to learn about us and then eventually become a pay user and it takes time for these initiatives to pay, the leading indicators in the markets that weâ\u0080\u0099ve been focused on have been growing positively consistently in the last several months as weâ\u0080\u0099ve been taking them on. That sales motion, that renewal motion and upsell motion is a huge growth driver in our path towards Rule of 40. On the self-serve business, Pri talked a bit about the top of funnel needs for us to continue to grow traffic grow our user base where we have healthy conversion and renewals. You can see in our Q3 guide as well as our Q4 guidance on profitability, thatâ\u0080\u0099s going to translate into double-digit margins in 2023. Youâ\u0080\u0099ll hear more from Pri as well as from our Chief Customer Officer, Ken Ewell; and Justin and I will discuss how that product strategy and our go-to-market motions will help us achieve Rule of 40 over the next few years."
}