{
    "symbol": "FMX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 15:33:03",
    "content": "  Operator: Good morning, and welcome to everyone to FEMSA's Second Quarter 2022 Financial Results Conference Call. During this conference call, management may discuss certain forward-looking statements concerning FEMSA's future performance and should be considered as good faith estimates made by the Company. Actual results are subject to future events and uncertainties, which can materially impact the Company's actual performance. As always, we also have Jorge Collazo on the line, who leads Coke FEMSA's Investor Relations team. Today, the plan is to have Daniel start with some higher-level strategic considerations, followed by an overview of performance trends during the quarter, and then Eugenio will provide more granular comments on the quarter results. As you already saw in our results released earlier today, FEMSA delivered another strong set of numbers for the second quarter, reflecting sound plans and solid execution at every business unit and continuing with the good momentum that began at the end of last year and has accelerated through the first half of this year. This means not only increasing our growth trajectory in both revenues and earnings, but also ensuring that this growth is reflected in shareholder value. This is consistent with a balanced investment approach that further strengthened our presence in Latin America, while also allocating incremental resources to new markets where we can find pockets of growth and bring to bear the strength of our core business verticals and create value. For example, at Coca-Cola FEMSA as an enabler of the commercial and multi-category initiatives, but our aspiration is that digital will become a core element of our customer-centric value propositions and permeate every aspect of our activities as it becomes a competitive advantage for FEMSA. Expanding on the subject of growth and value creation, we are making progress on our long-term strategic planning review across the Company. This is a month-long process that started by challenging each business unit on FEMSA, as a parent company to come up with the strategies, both organic, inorganic and structural, that will put them in a position to catapult their scale while achieving an attractive level of risk-adjusted returns over a sustained period. This, at the strategic level, I would like to talk about two big topics that are on the minds of everyone on this call. Historically, we at FEMSA have focused on driving operational success and the share price has taken care of itself over time. Right now, the divergence is especially stark given the strong momentum and outlook at every one of our business units and the sound performance of the investments we have made in the last couple of years. The strategic planning review currently underway involves significant analysis to help us define the strategies to achieve our ambitious long-term growth objectives, but also how best to work towards reducing and eventually eliminating that valuation gap. In the meantime, we are working to improve our disclosure further, particularly around the newer or less understood parts of our business, such as Envoy Solutions, our Health Division, OXXO International and our digital initiatives. The second big strategic topic I want to discuss now is the tender offer to acquire Valora Group AG that we announced a few weeks ago, which is, of course, related to our long-term growth priorities, as I just described. Valora is the leading convenience and food service operator in Central Europe, and it offers a high strategic fit with our Proximity operations as well as an excellent platform on which to build our core Proximity business in Europe. We believe we can help Valora accelerate its growth trajectory, bringing to bear not only our larger scale, but our understanding of convenience and proximity models and our expertise in driving organic growth, leveraging Valora's strong brand portfolio and management team. In particular, within Valora's current markets, we believe Germany presents attractive potential for organic growth. On the other hand, we will benefit from Valora's opinions and multi-format expertise to further develop the value propositions in our high potential core markets in Mexico and Latin America. Having said that, as you know, Valora is a listed company in the Swiss stock exchange and the tender offer process must run its course. As the months go by, it is increasingly clear that the pandemic generated some seemingly longer-lasting changes to consumer patterns and the drivers of like-for-like growth. Our average ticket is now structurally higher in real terms, reflecting an increase in categories like spirits, wine and some replenishment items, while our traffic keeps improving much more slowly and remains below 2019 levels. Consequently, we're gathering and using data to generate insights that are already informing adjustments to our commercial and segmentation strategies as well as our expansion priorities, allowing us to gain market share during the first half of the year. It is encouraging to see that OXXO can grow earnings by double digits and reach record operating margins even with structurally lower traffic levels, as demonstrated again in the second quarter. And regarding the store base expansion, we are maintaining our full year target of approximately 100 new stores for OXXO in Mexico, even as growth was still below trend this quarter. Furthermore, we continue to replenish our pipeline after the shocks of 2020, and we are putting conditions in play to accelerate the pace next year with a target closer to 1,000 new stores in Mexico for 2023. On top of this, we're increasingly excited about OXXO's opportunities in South America in general and Brazil in particular, where after three years operating Grupo Nos, our joint venture with Raizen, we are already ramping up our growth plan to add over 250 stores per year and potentially more. Our operations continued to perform well in the second quarter, even as the comparison base is getting tougher, particularly in the Chilean market where high levels of consumer liquidity help us achieve very strong results the last couple of years. Having said that, we again saw good growth trends in Colombia and Mexico, where we continue to drive material gross margin expansion by applying some of the commercial strategies developed at Cruz Verde. For its part, our Logistics and Distribution business had a good quarter, driven by the continuation of a secular trend at Envoy Solutions in the facility supply business. As people continue to return to office in larger numbers in the U.S., we are also making incremental gains in our gross-selling efforts among the three core businesses verticals, which represent an attractive opportunity to drive growth. I also want to talk a little bit about our digital platforms, both Spin and OXXO Premia, our loyalty program has continued to grow their users and more importantly, their active user base. Together, they now have more than 15 million acquired users and more than 12 million active users, and we are working hard to expand each product's value proposition and use cases to drive engagement and further accelerate the network effect of the entire ecosystem. Before I turn it over to Eugenio regarding Coca-Cola FEMSA, as Constantino mentioned last Tuesday, they achieved a solid second quarter set of results, building on a positive momentum despite the inflationary environment that is affecting industries worldwide, substantially mitigating margin pressures by leveraging their hedging initiatives and dropping down on expense efficiencies while accelerating the rollout of their omnichannel platform, which now reaches 645,000 active monthly buyers. Total revenues during the second quarter increased 22.2%, while income from operations increased 9.9% compared to the second quarter of 2021. On an organic basis, total revenues increased 18.9% and income from operations increased 8.6%. FEMSA's net income increased 45.4% and reached MXN7.6 billion, reflecting higher income from operations, a decrease in net interest expense and a noncash foreign exchange gain related to FEMSA's U.S. dollar denominated cash position as impacted by the depreciation of the Mexican peso, which represented a positive swing of MXN2.5 billion during the quarter. This was partially offset by a decrease in our participation in associates' results, reflecting the recognition of our best estimate, extraordinary impairment and other noncash exceptional charges announced by Heineken in connection with their decision to exit their operations in Russia. And by a MXN799 million negative swing in other non-operating expenses, which reflect the demanding comparison days that included dividends received during the second quarter of 2021 from our investment in Jetro Restaurant Depot. During the quarter, we added 168 units to reach 834 net new stores for the last 12 months. As Daniel mentioned, we are maintaining our year-end target of 800 net additions from Mexico, even though we are still behind schedule as of the first half of 2022. OXXO same-store sales were up 15.6% for the second quarter, driven by an increase of 11.8% in average customer ticket and a 3.4% growth in traffic. When compared to the second quarter of 2019, same-store sales are up 15%. Gross margin for the quarter contracted by 40 basis points to reach 41.2%, reflecting lower commercial income as some of our key suppliers curtail their commercial and marketing activities as a response to reduced inventory levels driven by the scarcity of certain raw materials. Income from operations increased 33.7% while operating margin increased to 120 basis points compared to the same period of 2021 to reach 10.2%, a record for comparable quarters, driven by a structurally leaner expense structure and the resulting operating leverage. Add up to that, revenues increased 32.5% and same-station sales grew by 25.2% relative to the second quarter of 2021 as vehicle mobility continued to recover and gradually approach pre-pandemic levels. During the quarter, gross margin was 12.3%, while operating margin reached 4.3%, reflecting continued tight expense controls and improved operating leverage. During the second quarter, we expanded our drug store count by 144 net additions to reach a total of 3,862 units across our territories at the end of June and 403 total net new stores for the last 12 months. This represents a significant acceleration in our growth rate, driven mainly by Mexico and Colombia and puts us in a great position to meet our target for 2022. However, it is important to note that on a currency-neutral basis, revenues grew 12.5% and same-store sales increased 9%, a solid performance across our operations, even if the comparison base becomes more demanding, particularly in Chile. Gross margin decreased 110 basis points in the quarter, mostly reflecting a one-off inventory write-off at our Chilean operations, partially offset by improved operating efficiencies and a more effective collaboration and execution with key supplier partners in Mexico. As a result, operating margin contracted 80 basis points as site expense controls across our territories was not enough to fully offset the impact from the slightly lower gross margins. Regarding our Logistics and Distribution businesses, revenues increased 50.2% relative to the second quarter of 2021, reflecting steady pace of acquisitions made in the past 12 months by Envoy Solutions. On an organic basis, total revenues increased 17.3%, reflecting strong performance across Envoy Solutions segments, especially in the retail and facility supply segments, coupled with good demand dynamics in our operations in Latin America, particularly in the warehousing space. Operating margin contracted by 30 basis points, reflecting a higher cost and labor transportation environment in certain markets. Operating income increased 5.6%, reflecting solid top line and favorable raw material hedging strategies, coupled with operating expense efficiencies. Wrapping up halfway through the year, our business units are in great shape, and we feel good about our chances to meet our ambitious plans for the full year and beyond, always driven by our outstanding team of colleagues. But as I mentioned before, we're also working to ensure that the value we'll create is shared by all of our stakeholders. Second question, kind of related to the last point that Daniel touched on capital allocation. This has been a key and recurring question from investors given the cash generation, strong balance sheet and also considering the current stock performance. And my final question, just quickly on the corporate structure, kind of, related to the point below, at least as it pertains to Heineken. But any updates or thoughts on the corporate structure of the Company, given the -- again, the ongoing discussion that we have with investors, the complexity, the conglomerate, the discount valuation that you guys also touched upon. I'm not sure if the studies you're conducting, maybe if you can share already some early insights or learnings that you've had. We're seeing a continuation, Ricardo, of the patterns that we've seen sequentially as we obviously troughed in the middle part of 2020 with the peak of the pandemic, which is a couple of things. We're still kind of in the mid-teens, up from 2019 levels, mostly driven by changing consumer habits as they found in also a place to get a reasonably priced bundle of pantry products as well as alcohol. I mean, hard liquor and other categories that were traditionally not part of what the consumer thought the OXXO store could fulfill their needs. So we're seeing, I mean, a continuation of that trend and that continues to positively affect the ticket. That on the other hand, as you know what severely contracted -- severely really curtailed by the contraction in traffic that we experienced through the pandemic, and we're still not back. From 2019 levels, we're still down in the mid-teens in terms of traffic, although it's coming up, as you saw this quarter, it was up 3.4% as mobility continues to regain. Again, it has to do with the store locations that we discussed before, but also some change in consumer patterns, as Daniel mentioned in his comments, consumers, especially are looking more towards in-home options rather than on-the-go options as they change their pattern of, I mean, working from home and others. But again, that's more than offset by other categories which were lower in the past for OXXO and are now introducing into a higher ticket. So overall, I think there's still some upside to the same-store sales number in the future, and we're optimistic about that. Ricardo regarding the corporate structure, I mean, as I mentioned in my comments -- and definitely, we are working with the long-term plan for each of the business and our intention because we recognize that definitely, there is a gap, I mean, between the share price and what we consider the fair value of the Company. And our intention is that toward year-end, we will be in a better position to share where we stand in terms of the particular action plans. And that is something that, obviously, as I also mentioned, requires involvement of the Board. So we're working very closely with the Board in order to come with a more clear, if you want, directional update towards the end of the year. To your specific point on buybacks, I mean that is one of the alternatives that that we're looking at as part of the overall strategic plan that entails also capital structure, not only corporate structure. So buyback is clearly one of the tools that is available and that is being considered as Daniel said, as one of the many tools that we have in the arsenal to address this corporate conglomerate discounts. Well, I mean, thank you for the question, Bob. I mean, regarding our loyalty program, I mean, we -- I mean, we are very, very excited about the results that we are seeing today. I mean, not only about the acquisition, but also the number of active users. And as I mentioned, I mean, we are in the early stage, you know that how we can really monetize, I mean, that information in order that we can see how we can create value going forward. So I mean, today, the tender is in the range of 15%, so which is very, very high, I mean if you see that we just started a few months ago with the program. So as I said, we're very excited -- I mean, even though that we have several millions, I think we are in the early stage, but we are very optimistic about the future of the loyalty program and I mean how much more value we can bring to OXXO. I think so far, Bob, to be honest, the impact on gross margin of Premia is still. I mean, given the -- some lack of commercial programs, we're partnering with some of their CPG partners as well. So although the tender is high, I think the impact on gross margin is still negligible at this point. You have a lot bigger scale now, and it appears that there's both revenue and efficiencies, growth opportunities. I mean, as I said, we're very pleased with how Envoy is growing, both on an organic basis and how successful the inorganic activity has been. I think we've got a dedicated team that's looking obviously at different regional territories, which we don't have a strong presence in to be able to increase our coverage and take advantage of the scale -- the purchasing scale, which is where most of the synergies come from and be able also to deliver to national accounts in territories we were not in. But then we also have -- I mean, the core team that's focused just on the day-to-day operations, keeping the efficiencies where they are, optimizing well to market, playing around with pricing and in segmentation. The industry, if itself, if you look at foodservice disposables and if you look at Jan-San and packaging, which are the three main segments that we're focused on, is over $80 billion to $100 billion in size, and we're still in the $2 billion to $3 billion sales range. And I think it's a space with very attractive secular trends in which we are already seeing the fruits of value very soon after we bought the original platform two years ago, and we continue to see a big runway for additional capital deployment and value creation for the years to come. Well, you know that I mean there are a combination of elements. I mean, in order for the customer we are talking about B2B customer, how they make their decision. I mean, obviously, price is a key one, but also, I mean, the fact that now, as Eugenio mentioned, we have three, if you want, categories or main categories that we were able to sell. I mean, that combination also is very powerful. I mean, the fact that we can provide the service and we can come with the three categories, if that is the case. So I think price, services, and the quality of the products are the main key decisions that the customers take into account in order to buy our company. And the fact that we are growing, obviously, we're in a good position to come with a very competitive price structure to them. And it's great that we hear that hopefully, by year-end, we'll get more clarity, so we look forward for that. Luis, I mean, first of all, I mean, this strategic review, we started before we made the decision to acquire Valora. And as you can imagine, obviously, that requires time because we are analyzing, I mean, several alternatives, and we need, obviously, the involvement of the Board. Second, I mean, regarding the business complexity, I mean, the way that we see the acquisition in Europe is this time we are investing in one of our key core businesses, which is Proximity. I mean, as you know, we have been looking for Proximity opportunities in developed markets for many years, and we find, I mean, that investment to be very attractive, not only about what we can go there, but also we -- we strongly believe that we can learn as well from the way that they run the business, I mean, opinions. I mean, there are elements that we recognize that we can also bring into our core markets in Latin America and maybe create also value here. And on top of that, I mean also one element that I would like to mention that, I mean, over the last couple of years, and I think you will share that with me. I mean, the trends in Latin America are not as they were in the past, I mean, in terms of growth, I mean, when you think about risk return on our investments. So definitely, I know that when you compare the return that we have with Valora, it's very, very difficult to compare with the returns that we have in OXXO. I think we strongly believe that we're thinking in the future in the Proximity business that was, I mean, a good decision. And we are working hard, I mean, in order to come with the right answer or options, I mean, in terms of the structural solution. Again, I mean, as you know, in M&A, the timing is not always ideal. But at this point, we felt that the timing was right to do this deal at a valuation that both made sense for the Valora shareholders and still allowed us ample room for value creation by following our own strategy. But again, the good news is that the LRP plan and the structural alternatives that we have to kind of capture these -- or eliminate this conglomerate discounts are the same that they were one month, two months or six months ago even. I wouldn't say that -- I mean, Premia is growing. Clearly, the heavy users are spending more, but it's not directly related. Is that -- I mean, obviously, we're worried about significantly lower traffic. I mean, in the case of the gross margin, there are several elements, Alvaro. So one, I mean, definitely, as we mentioned and most probably you hear that from Coca-Cola FEMSA, I mean, there is a pressure in supply chain. I mean -- and obviously, based on that, I mean, many of our suppliers, they have made the decision in order to reduce or be much more selective, I mean, in terms of the delivery of the product. Hence, I mean, lower, if you want, incomes or commercial income. I mean, definitely, that has been the case in other years before, and we expect that to recover in the future. And then just I think to round that up -- Alvaro, this is Eugenio -- if you have suppliers in key categories, let's talk about beer for a second. And you're having some issues with certain type of packaging, for example, which means you're not going to -- you're pushing less product. And that means you're going to engage in less promotional activity, which at the end of the day is where commercial income comes from. But as you know, commercial income is a big driver of gross margin expansion historically for us, and that's why we highlighted it because this is something that is happening because of the supply chain shocks not because of anything structural. I think as we get closer to the fourth quarter, the activity in a number of CPG categories, hopefully, will ramp up. I mean the intention -- I mean first of all, I mean we need to continue and finish the process in Switzerland. I mean, so that I think is important to mention. Our intention is that at least for the first couple of years, we will run that on a stand-alone basis with an advisory board and will represent that in FEMSA, but also with board members from the European market. And I think Alvaro, maybe part of your question, I think, probably comes from how are we going to disclose that and whether or not you're going to be able to track it. I mean, we still have to fine-tune and I think there's a lot of work being done on how can we improve disclosure, and we've spoken with some of you in the past about increasing access to Daniel and Paco and Eugenio, and the management teams of the operations. Daniel mentioned in his remarks a few minutes ago, Envoy, Digital, OXXO International, and obviously Valora is a part of that once we finish the tender offer process that we would hold investor seminars where you guys can talk to the CEOs and the management teams and importantly, ask questions. And so whatever shape, I think probably for the first quarter of next year, we will have an enhanced proposal. And the guidance of at least 250 stores per year is very welcome, but I'd like to understand enough broadly long-term view. Obviously, we know there is a very hard combat that you're facing going forward, but also it's true that the underlying market fundamental relator rate, especially inflation is high. I mean, definitely, we -- as you know, there is a joint venture, which we are with license. I mean before we signed the JV agreement, we developed a long-range plan. I mean, that was part of the agreement when we put together the joint venture. And we know that we will grow with OXXO on a stand-alone basis, but also continue to develop the select brand inside of the gas station of the Shell brand in Brazil. I mean, so far, over the last, almost three years that we have started the JV in Brazil, we are very, very excited by the results that we have seen with OXXO. And over intention, I mean, if you compare the population of Brazil with Mexico, definitely, there is room to grow. I mean, we should not be -- I mean in the long term, we should not expect that the number could be very different from what we have seen here in Mexico. Definitely, I mean, our intention is to grow in key or relevant big cities in Brazil. And from there, decide, I mean, if there is room to grow in more medium and smaller sized cities. I mean in terms of the marginally, if you want returns, I mean, I don't see obviously that it will be very different from the one that we have in Mexico. It's more attuned to the padarias, but it I think has a value proposition and a mix of products that are uniform across, you know what you're getting each time you go to a different shop. So I think the value proposition is kind of hitting the sweet spot, and we're actually growing much faster than we originally anticipated because of that. I mean, clearly, as you mentioned, we are facing difficult comps. Nonetheless, the mix in format that we have, the loyalty program in Chile, and I think the resiliency of the space in the categories that the Health Division is serving in Chile, I think are allowing us to maintain, I mean, solid unit economics, good traffic and good profitability. So yes, I mean, you will probably not see the same-store sales growth that we experienced over the course of the past 24 to 48 months. And then Chile also provides us with a very strong base and supplier leverage that is helping us expand in Colombia and Mexico with very attractive commercial terms that are making the unit economics at Colombia and Mexico, I mean, a lot better than they otherwise would have. So I think if you look at the entire portfolio of health, I mean, notwithstanding the fact that we might see a slowdown of growth in Chile, the value creation railroad for the division itself is, I think, on a very positive trend. But I mean, first of all, as I mentioned during the call, Leandro, we are running this, what we call strategic review, and that is on a business-by-business basis in order to see what is the potential in terms of growth for each of the business units. So that is one element that clearly we take into account, obviously, revenue growth, I mean how we can be more efficient and definitely can be more profitable. And then on top of that, obviously, I mean, as the structure review, the intention is based on those strategic plan, what we can do in order that ideally, that value that we feel very comfortable that we will create at each of the business units, we can transform into shareholder value. So I mean it's -- as I said, it's a combination of what we are doing in each of the businesses and how we by reviewing the structure and what are the options in order that ideally we can convey that value creation in each of the business into the stock price that I would say in a nutshell, the intention of this exercise. I mean basically, its bottom up what's the best plan for each one of the businesses to maximize their own value. Or is there another one that is able to, again, habilitate this value creation on the one hand, but on the other hand, also allow the shareholders to -- or to make this value creation transparent to our shareholders through either the current structure or different structures going forward. If I may, just a second question, which is not related to the first one, where we have been seeing traffic at Proximity division catching up. So that means that likely supermarket, for example, as a channel, we still have a higher share of those volumes of leverages. And just to understand if you think maybe you could recover to the pre-pandemic levels or there's some structural change in which maybe supermarkets, or other channels will have a higher percentage of the market, such as, for example, maybe consumers learn the benefits of storing and then doing purchases at supermarkets and maybe they won't need to go as much to convenient stores. I think it's a mix, Leandro. That trend that you mentioned with supermarkets gaining share in some of that, especially through multipack strategies as the consumer because of inflation is looking to get the optimal per unit price. And the other one is we are also making changes to our own product peaks at the different types of categories to be able to compete efficiently with these, call it, cost-effective multipacks in the personal snacking category. I think -- I mean, clearly, there was a structural shift. Having said that, I think it's still being sorted out, and there's still things from a commercial perspective and from a market segmentation perspective, that we can do to get back some of that the underlying traffic and gain in other categories as well. And so that's, I think, very encouraging. I mean, and I think Juan mentioned that earlier, is the fact that I mean, as we learn, I mean, what are the structural changes, we obviously are incorporating those learnings into our processes. I mean, we have been very, very successful in order that now, I mean, our expansion, obviously, taking into account those changes. And we have been very, very effective in terms of being very profitable with our expansion over the last two years. And on top of that, we know that we will get much more insight I mean, from over OXXO Premia, the loyalty program, and that is something that will help. And also the OXXO Spin they are doing a very good job in terms of store segmentation in order to see how -- I mean, based on those changes, how we can better, if you want, allocate the assortment for stores and recognize in which areas, I mean, those structural changes are more relevant and in which areas maybe they are less relevant. But I mean, you can imagine with a store base of 20,000 stores, I mean, there are very, very different answers depending on which segment you are analyzing and I mean, these changes. And I would add on to something Daniel just said, which is on the expansion front, and we mentioned it quickly in the opening remarks, but I think it bears repeating. The new stores that we have opened over the past, let's call it, 12 months or even 18 months, I mean basically, the cohorts of new stores that we are opening under this more stringent process that we put in place during COVID are performing twice as better relative to the new stores or comparable cohorts in the last 10 years. And it's very encouraging to see that with the right metrics and the right segmentation, you can open stores that are going to perform right out of the gate much better than stores that you opened 3, 5, 10 years ago. Yes, does the scope of the BCG study include an analysis of how the Board's structure composition and processes are impacting the stock's NAV discount.? I mean, definitely, the BCG scope is mainly related to what we call the strategic plan for each of the businesses. I mean, as you most probably are aware, there was some changes, I mean, in the governance that were communicated earlier this year. And in that process, there are changes that will happen at the Board level over time, which is obviously taking into account the composition and all the elements that are relevant from a governance point of view. So I mean, those are the comments that I can make. But definitely, I mean, as part of this structural review that we are considering, I mean, definitely, there are implications, I mean, in terms of how the governor will need to be implemented going forward. But I mean, as Eugenio said, we are looking at this moment, the three layers. So I mean, the opportunities that we see inside of each of the business. So bottom-up, exercise, then how we allocate that portfolio and then, I mean, what are the changes that potentially will require in terms of the structure. And based on that, then we will obviously need to decide, I mean, if some of these changes apply, how that will be managed, I mean, from a Board point of view. And Carlos, I mean, just to follow-up. I mean, as you know, earlier in the year, we announced, I mean, a gradual set of changes to the Board committee structure composition and the size of the Board. But just as a reminder to everyone, I mean, the Strategy and Finance Committee, which is the heart of most of the strategic decisions that get taken to the Board is made up primarily of independent directors and all these decisions, portfolio decisions, M&A decisions whatever are thoroughly reviewed in light of what makes sense from the long-term perspective for the FEMSA shareholder. And again, the composition and the makeup of that committee is starting to change with the changes that we implemented this year, will change also in the coming years as we bring to bear, I mean, more skills in the sense of digital transformation, in the sense of other, call it, ESG topics and other of the agenda items that are on top of mind of shareholders and of the Board. I mean obviously, the BCG study, I mean, they reached out to some of you, some analysts, some investors. I mean, it's a small part of the overall very, very comprehensive process that is in place. So I don't want to take anything away from the BCG study, but it's just a part of everything that's going on. I mean looking at the positive side of the complexity equation, I was wondering if you could -- do you foresee like more complementarity in the, let's say, distribution business in Brazil with AGV Solistica and Coca-Cola FEMSA enable to on the distribution side. I think one area that we've been talking a little bit about were, you see, Coke FEMSA and the proximity division actually overlapping or converging has to do with the multi-category distribution platforms and an effort to enable traditional trade to be able to order digitally participate from a more efficient supply chain and just partner up with large chunks of the traditional trade. These are efforts that both Coke FEMSA and also have been working on and increasingly they're coming together when you think about a digital payment solution for the mom and pop, could that be the spin platform that could then be applied for Coke FEMSA customers. On the other question...\n You mentioned something about integration, but I'm not sure what business unit you were referring to. On the -- well, first, on Solistica in Brazil in partnership with Raizen and the drugstores in Mexico, I mean, you can give us an update on what we see in terms of the -- are we still going to continue with the three banners, are you going to integrate into one banner. If you could give us an update there on the drug stores in Mexico, that would be helpful. The first one, just to complement, Solistica in Brazil is having the Raizen joint venture with their distribution efforts. So again, as we've mentioned in the past, we believe distribution is a core element amongst all of our business units. We actually have an internal call it, logistics best practices board across all of the business units that are getting together. I mean, regarding the integration, I mean, referring to the brands that we manage in the health division. I mean, definitely, the way that we have been able to create values being more around how we escalate, I mean, our purchase capacity in order that we can transfer, I mean, those conditions to each of the brands. So I mean, we don't have any explicit plan in order to consolidate under one brand. In the case of Mexico, I mean, as you know, in Mexico, we have today three plants, obviously, the largest one is ISA. I mean in the new regions, we are growing with that brand. I mean normally, those brands that are in the northwest part of the country, we are keeping those brands, and we are developing as well private label products. I mean, we don't have any particular plan in terms of consolidating or changing the brands. More we are focused on how we can create value with those brands because, I mean, those are -- I mean, the customers are very loyal to those brands. I think there are different elements, I mean, in terms of potential synergies. I mean, first of all, normally, if you think about, I mean, the layout of pharmacy, you will have, I mean, convenient categories, you will have Health and Beauty. And obviously, you will have, I mean, all the proper drug store. In the case of convenience products, definitely I mean there is a synergy, I mean, in terms of the scale and how we can leverage the scale of OXXO, and that is something that definitely we are doing. And then secondly, I mean, also in terms of expansion and the skills that we have developed, that also is something that we are also using for the pharmacy business. And also related to expansion, we're already testing, I mean, some locations when we have -- I mean, next to an OXXO, I mean, a pharmacy and that we are also doing that with our discount format in Central Mexico. So we see, I mean, a lot of opportunities, definitely about the way that each of the businesses grow is differently. So I mean, that is a very structural change compared with the fact that OXXO Mexico, particularly the growth is coming from purely organic growth. I mean, that is why we have those differences in terms of returns. So during COVID, the drugstore business actually thrived, whereas OXXO and many others suffered a lot with traffic. And we mentioned on the drugstore side, we're actually facing tough comps, especially in Chile. And the other comment I would make is regarding margins because the Health division is basically operating at about a 10% EBITDA margin, which granted is not the 15% that we have at OXXO, which has 20,000 stores, but it's -- we think it's a pretty respectable EBITDA margin where you're getting into double digits for the drugstore business. So as we continue to scale up, we've spoken in the past, Mexico is the one market where we are subscale. I think if you look at the future digital ecosystem, I think also pharmacies in Mexico will play a large role in that. The ticket size for pharmacies and the drop size are probably more attuned to a home delivery mechanism, the loyalty program, especially for chronic ailments is something that I think lends itself well to a digital solution. I mean, inorganic growth, no, we are not considering anything in particular. And I would say what we really -- I mean, we think that the Valora team has done a great job. I mean, in the convenience side. I mean, as you know, we are doing also a good job here in Mexico. But I mean, they have done a pretty good job there in Europe. So that's where we would like to learn from there, I mean, in the convenience space, and we can bring value here in terms of the organic expansion that we have been very successful, particularly in Mexico, but also in other markets in Latin America. Ladies and gentlemen, if you wish to replay the webcast for this call, you may do so at FEMSA's Investor Relations website."
}