{
    "symbol": "SCKT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 20:02:02",
    "content": " Such statements involve risks and uncertainties and actual results could differ materially from the results anticipated in such forward-looking statements because of a number of factors including but not limited to, the risk that manufacturer of Sockets products may be delayed or not rolled out as predicted due to technological, market or financial factors, including the availability of product components and necessary working capital, the risk that market acceptance and sales opportunities may not happen as anticipated, the risk that Sockets application partners and current distribution channels may choose not to distribute the products or may not be successful doing so, the risk that acceptance of Sockets products in vertical application markets may not happen as anticipated, as well as other risks described in Socket's most recent Form 10-K and 10-Q reports filed with the Securities and Exchange Commission. Our Q4 revenue was $5.2 million, a 15% decrease compared to the $6.1 million in Q4 of 2021 and a 39% increase compared to the $3.7 million reported in Q3 2022. In Q4, we recorded an operating loss of $152,000 compared to an operating income of $693,000 in Q4 of 2021 and an operating loss of $947,000 in Q3 2022. In Q4 EBITDA was $301,000 compared to $1.1 million in Q4 of 2021 and a loss of $506,000 in Q3 2022. Looking at our full year results for 2022, excuse me, our revenue was -- our revenue for 2022 was $21.2 million, compared to $23.2 million in 2021, a decrease of 8%. In 2022, our diluted earnings per share was $0.01 compared to diluted earnings per share of $0.48 in 2021, and both years benefited from income tax credits. Operating expenses were $10.8 million, increased to 11% compared to $9.7 million in 2021 as we continue to invest in business to fuel long term growth. 2022 diluted earnings per share of $0.01 included a $0.09 per share income tax benefit, primarily related to the adoption of Section 174 of the Tax Cuts and the Job Acts of 2017, compared to diluted earnings per share of $0.48 in the prior year, which included $0.21 per share income tax benefit. Our Q4 revenue decreased 15% to $5.2 million compared to $6.1 million in the prior year's quarter, but the increase to 39% is sequentially compared to $3.7 million in Q3 2022. Q4 operating expenses were $2.7 million, increased to 8.4% over the prior year's quarter and 3.8% sequentially over their preceding quarter. Compared to the diluted earnings per share of $0.11 a year ago, a net loss per share of $0.11 in the prior year -- in the prior quarter, Q4 diluted earnings per share of $0.06 included $0.08 per share income tax benefit related to the adoption of Sections 174 of the Tax Cuts and the Job Acts of 2017. For the full year of 2022, we invested $1.2 in capital expenditure, repurchased 266,000 shares for $837,000 and repaid the $500,000 of loan balance. As of December 31, 2022, our inventory level, net of reserve, was $5.6 million compared to $5.2 million a year ago."
}