{
    "symbol": "EE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 11:32:03",
    "content": " Yesterday afternoon, we released our third quarter earnings press release, along with the presentation that our President and Chief Executive Officer, Steven Kobos; and our Chief Financial Officer, Dana Armstrong, will speak to you this morning. Excelerate delivered another strong quarter of financial results, as we continue to advance our growth strategy and make good progress on our commercial opportunities. Against the backdrop of the most significant energy market disruption since the 1970s, we've seen the true value of Excelerateâ\u0080\u0099s flexible business model, which enables us to adapt our asset portfolio to deliver optimal solutions that scale with our customersâ\u0080\u0099 needs. Through the quarter, we demonstrated once again our ability to navigate successfully the complexity of today's global LNG market. In our short time as a public company, we've rebalanced our commercial portfolio to address increasing LNG demand and energy security concerns in Europe. Our fleet flexibility has also allowed us to capture economic upside from elevated FSRU charter rates, while we continue to position our gas sales business for growth and increased profitability over the long term. On this morning's call, I'll focus my remarks on our third quarter financial results, the current state of the global LNG market, and progress on our commercial opportunities. Dana will then walk through the details of our quarterly performance and our 2022 financial outlook, before we open the call to your questions. We delivered $39 million of adjusted net income, and $86 million of adjusted EBITDA. Our bottom-line results during the quarter were driven primarily by another solid contribution from our regasification business, and our gas sales business in Brazil. On the commercial front, the deployment of the FSRU Exemplar to Finland remains on track, and our charter hire for the vessel commenced on October 1. I'll also highlight that on October 3, we executed our shipbuilding contract with Hyundai Heavy Industries, or HHI, for our new state-of-the-art FSRU, which will be delivered in June 2026. Next, as we approach the end of our first year selling gas downstream in Brazil, we are pleased that our gas sales business is proving to be as valuable as planned. On August 31, the FSRU Exemplar completed its seasonal regasification charter at the Bahia Blanca GasPort in Argentina. During this period, the Exemplar regasified 12 LNG cargos, and provided energy security to Argentina during the Southern Hemisphere winter season. Since our last earnings call in August, we have continued to see robust demand for flexible LNG infrastructure around the world as countries seek energy security and independence. In Europe, countries are bracing for winter, and while they have succeeded in filling natural gas storage capacity to over 90%, the supply outlook for the 2023, 2024 heating season remains a concern. The September shutdown of, and subsequent damage to, the Nord Stream I and II pipelines, cut off critical natural gas supplies to Europe, and further intensified supply pressures In real time, we've watched the situation that could have been solved, politically evolve into one that now must be fixed with deployment of new infrastructure. The ongoing curtailment of Russian flows, combined with increased natural gas storage injections heading into the winter season, has led to increased LNG imports to Europe. The resulting increasing competition between OECD and non-OECD countries for finite LNG supply, has exacerbated an already tight market. The combination of European onshore storage levels being near capacity, increased LNG imports, and mild fall weather have resulted in a buildup of latent LNG vessels around Europe. The increased demand for FSRUs and LNG in Europe, is also influencing energy policy globally. Some countries, particularly those in Southeast Asia, have chosen to reduce LNG consumption in the near-term as a direct result of elevated pricing in the spot market. However, because LNG remains an important part of their future energy mix, they're continuing to seek long-term affordable LNG supply to meet their energy needs. It is clear that natural gas will continue to play an important role in the energy transition, serving as a complementary backstop to balance the intermittency of renewable energy. As I mentioned on our last call, we reached an agreement with the government of Finland for the Exemplar to provide up to 5 billion cubic meters per year of regasified LNG capacity through a new regasification terminal in southern Finland. This flexible LNG terminal will bolster the energy security of Finland, while also serving more broadly the needs of the Baltic Sea region. Although the Exemplar is currently undergoing customer requested winterization upgrades during a technical stop in Spain, our charter hire with Gasgrid Finland commenced on October 1. Finland, by the way, has done an exceptional job developing the tunnel facility, and the Exemplar should begin regasification operations at the Port of Inkoo, Finland, in December 2022. We've established a gas marketing entity in Finland, opened a new office near Helsinki, and our commercial team is actively pursuing near-term gas sale opportunities. This is our second FSRU deployment to Europe since the invasion of Ukraine by Russia, and it demonstrates the ability of our business and our fleet to pivot quickly to capture new commercial opportunities. Under the terms of the agreement with the German government, the Excelsior will commence its charter hire in the first quarter of 2023. The vessel is expected to provide regasification services in Germany's planned LNG import terminal, which is being developed at the Port of Wilhelmshaven by Tree Energy Solutions, E.ON, and ENGIE. Last quarter, we expanded the scope of our Albania project to include potential gas sales to countries linked to Europe's southern gas corridor, including Italy, Greece, Bulgaria, and Turkey. The damage to the Nor Stream pipelines has made the southern corridor as an entry point for LNG deliveries even more critical for Europe, and our planned Vlora terminal is even more valuable, since it will add incremental capacity and alternative supply in the event of further disruptions. In recent weeks, we've engaged with third parties for the engineering design for both the 300-megawatt power plant and the LNG terminal in Vlora. While weâ\u0080\u0099re advancing the Vlora LNG terminal towards FID, we are also evaluating other downstream opportunities that would allow us to connect to existing natural gas pipelines in the region. The government shares our view that long-term LNG supply will be a central part of its energy mix moving forward, and the country's advancing plans to sign new long-term LNG supply agreements to guarantee more affordable and predictable LNG pricing. As discussed last quarter, rapid economic growth in Southwest Bangladesh is expected to drive increased energy demand in the region, and greater need for regasified LNG as a fuel source. The new FSRU will have storage capacity of 170,000 cubic meters of LNG, and a maximum regasification capacity of 1 billion standard cubic feet per day. The state-of-the-art FSRU will be equipped with HHIâ\u0080\u0099s proprietary LNG regasification system, dual-fuel engines, best-in-class containment system and boil-off gas management, and other innovative technologies which will drive improved performance and efficiency, while lowering emissions. Overall, we're pleased to have delivered another quarter of great financial results. For the third quarter, we reported adjusted net income of $39 million, an increase of $18 million or almost double our second quarter adjusted net income. adjusted EBITDA was $86 million, up $11 million, or up about 15% versus last quarter. The sequential quarterly increase was driven by lower idle fuel cost, lower repair and maintenance expenses, and higher margins from our Bahia Blanca seasonal charter in Argentina. This was partially offset by higher SG&A due to an increase in consulting, marketing and business development-related costs. In comparison to the third quarter of last year, our adjusted EBITDA was up $21 million, an increase of about 32%. The year-over-year increase was driven mostly by our gas sales in Brazil, partially offset by an increase in SG&A, related to our transition to a public company structure. We're proud to say that with the recently announced Finland and Germany charters, we've enhanced the quality of our portfolio even further. As of the end of the third quarter, we had letters of credit issued of $40 million, and no outstanding borrowings under our $350 million revolving credit facility. The combination of our cash on hand and our available borrowing capacity, provides us with sufficient flexibility to fund our ongoing operations, dividend payments, and CapEx needs in the near-term. Our CapEx spend for 2022 has been lower than previous expectations, primarily due to the sequencing of the Finland and Germany opportunities, both of which required minimal CapEx ahead of other projects in our pipeline. As Steven mentioned earlier, our Board Of Directors approved our second quarterly dividend as a public company. The decision to increase our guidance was driven primarily by our solid performance in the third quarter, in combination with lower anticipated business development costs, and slightly higher Finland margins in the fourth quarter, as compared to our previous guidance range. For the full year 2022, we now expect adjusted EBITDA to range between $264 million million $274 million, and adjusted EBITDA is expected to range between $300 million and $310 million. So, that's included in our guidance, obviously, but we do see some lumpiness in our repair maintenance expense for our vessels, and it really just depends on what specific projects we have going on, on a quarter-to-quarter basis. So, we had two full months of Bahia Blanca in the second - or sorry, in the third quarter, and I think we had a month and a half in the second quarter. But again, we are still advancing longer term, and frankly as the other projects in our pipeline, I think that sequencing this year has worked to our benefit, because many of the emerging markets are seeing that by the time you can come forward with these projects, they expect a more harmonized global LNG market. It sounded like in Dana's opening comments, that development costs, project development investment and costs are sustainably down, not versus some of the maintenance quarterly lumpiness. Our business development costs are lower than our expectations, so they're pretty flattish quarter-over-quarter, but we didn't spend to the level of what we had anticipated, and that's just a result of some of these projects pushing out as we're prioritizing Finland and Germany. So, to the degree we defer some of these emerging market opportunities that Steven was referring to out a couple of years, the work you're doing in Europe doesn't have the same development expense. The reality is, as we've discussed many times, you're continuing to see pricing on long-term LNG. And without getting too much into the weeds now, you're seeing IMF and others assisting some of these entities in APAC and elsewhere reentering, in fact, the short-term LNG spot market."
}