{
    "symbol": "UCTT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 21:37:04",
    "content": "  Operator: Good day everyone, and welcome to the Ultra Clean Second Quarter 2022 Conference Call. Jim will begin with some prepared remarks about the business, and Sheri will follow with the financial review, and then we'll open up the call for questions. I'll also highlight how UCT's diversification strategy has become a compelling advantage, and then I'll turn the call over to Sheri for a financial review. The relaxation of China's COVID lockdown protocols, combined with strong execution at our other global sites, enabled us to reach revenue above the midpoint of our guided range. After a comprehensive strategic review of our corporate structure and operations, we began the process of divesting some of our non-semi businesses during the quarter that we acquired with the Ham-Let acquisition. For the second half of this year, we reiterate our belief that 2022 will be another year of growth for the WFE market and UCT. While some customer order flows and delivery schedules have been adjusted into the following quarters to align with ongoing supply chain constraints and capacity limitations, we have not seen any significant cancellations. While UCT has mostly been able to deliver on time, the industry remains challenged with shortages in the supply chain. We are working quickly and constructively with our customers to alleviate bottlenecks by accelerating new supplier qualifications, prioritizing shipments and collaborating to forecast trends that better support future demand. In addition to our new facility in Malaysia, we are also expanding and realigning our product manufacturing footprint in the U.S., Europe and Israel to ramp production and increase flexibility to ensure business continuity. Likewise, our Services division is investing to support increased wafer starts and the need for consistent high utilization for some of the world's largest chip makers. While there are signs of potential weakness in PC, low-end smartphones and some consumer electronics, those are being offset by strong demand in the high-performance computing, IoT, robotics and automotive sectors. Today, the chip industry powers most aspects of our economy, so it's far less vulnerable to a single retail end market, and so is UCT. We indirectly touch every chip that goes into every phone gaming device, laptop, tablet, server, smart car and more, which is why we expect to outperform the overall WFE market. I would like to thank our highly capable global team for their hard work and commitment, ensuring UCT remains the partner of choice for our customers. In today's discussion, I will be referring to non-GAAP numbers only. The easing of COVID restrictions in China and ongoing demand for our products and services resulted in total revenue for the second quarter of $608.7 million compared to $564.1 million in the prior quarter. Products gross margin was 17.8% compared to 18.2% in the prior quarter, and Services was 37.2% compared to 35.5% in Q1. Margins can be influenced by material and transportation costs, manufacturing region, product mix and volume, so there will be variances quarter-to-quarter. As a percentage of revenue, operating expense was 9.2% compared to 9.6% in the prior quarter. Margin from our Products division was 10.2%, flat with the prior quarter, and Services margin was 16.9% compared with 15.7% in the prior quarter due to higher operating efficiency. Based on 45.6 million shares outstanding, earnings per share for the quarter was $1.04 on net income of $47.4 million compared to $0.95 on net income of $43.3 million in the prior quarter. During the second quarter, we divested two of our noncore non-semi subsidiaries that came with the Ham-Let acquisition, and a third sale is pending. With demand still outpacing what the overall equipment industry can deliver, uncertainty around the global supply chain and COVID-related interruptions, we are keeping our guidance range wide. Jim, maybe first off, I wanted to make sure and get a clarification and just to make sure that you're emphasizing this correctly that any movements you're seeing with your products customer base is primarily due to the supply chain and issues that they're having and not on any changes in demand that you're seeing on your front. We saw from our two main customers sub-movements -- actually, we saw a little bit in the last quarter, but -- and they're basically pushing out one quarter and then the following quarter will push into the following quarter. So they're trying to sit on less 99% build tools, waiting for that last few parts. So that's the reason they're not lost or anything, and they're typically shifting one quarter out. And as my follow-up question also for you, Jim, in terms of your Services business, a lot of it is obviously dependent on wafer starts, good utilization rates. At the same time, do you believe the diversification on the Services side is helping you kind of mitigate some of the volatility that you're seeing in areas like the PC market and the low-end smartphones that you've mentioned before. I think you see that in the -- although the revenue was similar to last quarter, the operating margin was certainly a nice additive. But if you draw a line over 8 quarters, you'll see that trend. So depending on what we're making, it's typically somewhere between a month to some of them as long as four months. Yes, there is one customer that we're working with on the service side, on the 3-nanometer next node, but we haven't seen it from any other customers yet. Obviously, we're working with the largest litho provider on their next-gen tools right now, which are starting to roll out at the end of this year and into next year. If I can go back, one area where your question on lead times on fluid solutions, there's such tightness in supply in that area in capacity that actually the lead time on the fluid solutions parts are more like 9 months. And then thirdly, in Malaysia, we're also seeing a lot of the new products that the customers have been developing starting up over in the Malaysia factory. We're at, I think, the quarter about $20 million out of Malaysia. And it's showing no additional questions, I'd like to turn the floor back over to Mr. Scholhamer for closing remarks. Thank you, everyone, for joining us today, and we look forward to speaking to you again next quarter."
}