{
    "symbol": "SELB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 00:56:02",
    "content": " Despite geopolitical turbulence, max economic volatility and sector specific headwinds, we believe Selecta’s proactive approach to managing risk, which included opening additional SEL-212 clinical trial sites in the US in the face of heightened geopolitical instability, prioritizing our product portfolio to manage our resources and raising additional capital ensures that Selecta can build on the exciting progress made in 2021 and realize the full potential of our leading precision immune tolerance platform. 03:21 With our focused wholly-owned portfolio and financial runway into mid-2024, we believe Selecta is well positioned to execute on our clinical stage assets in biologics and gene therapies advance our proprietary IgG Protease Xork into the clinic complete our IgA protease clinical candidate selection for a program and accelerate the development of ImmTOR-IL, our next generation antigen-specific precision immune tolerance platform. Our sharp and strategic approach has allowed us to support and accelerate the development of our wholly owned pipeline with a focus on tolerogenic therapies for autoimmune diseases and therapeutic biologics, as well as provide transformative solutions for our gene therapy partners to unlock the true potential of Adeno-Associated Virus or AAV gene therapies. 11:39 Pre-clinical studies suggest multi potential benefits of ImmTOR in AAV gene therapy, including increased transgene expression in the first dose, mitigation of hepatic inflation – inflammation, more durable transgene expression and inhibition of capsid specific B and T-cell responses. 12:26 In a single dose clinical study in healthy human volunteers conducted in partnership with AskBio, we observed the ability of ImmTOR to mitigate the formation of anti-AAV neutralizing antibodies out to 30 days in our preclinical data in mice and non-human primates suggest that control of anybody's can be maintained with two additional doses of ImmTOR. Most notably, we are excited by our plans to enter the clinic with SEL-302, complete the DISSOLVE program with our partner Sobi, advance IND enabling studies across our wholly owned pipeline, support our numerous collaboration partners and rapidly progress our next generation precision immune tolerance technology ImmTOR-IL into the clinic. 24:52 The strong strategic effects we've seen in our preclinical work support our belief that ImmTOR-IL has the potential to unlock first-in-class antigen-specific immunotherapies for autoimmune disease, as well as improve the efficacy and safety profile of therapies in biologics and gene therapy. So, as you know we had the humans healthy volunteer study that we also did with AskBio and we have previously reported on that and the finding that we could inhibit neutralizing antibodies out through 30 days with ImmTOR and with a single dose of ImmTOR in healthy volunteers and our preclinical studies in both mice and non-human primates indicate that by giving additional monthly doses of ImmTOR we can sustain that inhabitation. But we're clearly -- especially in autoimmune disease are especially excited about ImmTOR-IL in the context where you have two autoimmune diseases, restore balance between T effector and Treg and we believe that ImmTOR-IL is ideally suited to that, but we stay focused on the programs we use ImmTOR alone, such as SEL-212 and MMA."
}