{
    "symbol": "JMIA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 12:40:07",
    "content": " For H2, we expect losses of $87 million to $107 million, which implies the reduction versus H1 of 5% to 22% and versus last year, a reduction of 12% up to 29%. JumiaPay TPV increased by 31% year-over-year and 45% on a constant currency basis, supported by the robust GMV growth. On-platform penetration of JumiaPay as a percentage of GMV, reached 27% in Q2, up from 25% in Q2 last year, as we focused on increasing the penetration of JumiaPay in a disciplined and gradual manner. Turning to transactions on Page 13, JumiaPay transactions reached $3.4 million in Q2 this year, up 25% year-over-year, supported by accelerating volume growth across the business and in the food delivery category in particular. Overall 33% of orders placed on the Jumia platform in Q2 2022 were completed using JumiaPay, compared to 35% last year. Revenue reached $57.3 million in Q2 2022, up 42% year-over-year and 56% on a constant currency basis. The growth across a broad range of revenue streams is allowing us to continue making growth investments in the form of consumer incentives, which were up by US$3.6 million year-on-year in the second quarter. Here, you see clearly the growing contribution to marketplace revenue from marketing and advertising and value-added services, which reached an all-time high in Q2 at 41% of marketplace revenue compared to 33% a year ago. Marketing and advertising revenue reach an all-time high of $4.6 million surpassing the previous record reach in Q4 2021, up 76% year-on-year, the fastest growth rate in over two years. On the flip side, fulfillment revenue reached US$7.7 million down 7% year-on-year due to a broader deployment of the next day free delivery. We are working across all revenue streams to drive either faster growth and margins or a combination of both with respect to first half the activity, first half of revenue grew at an average north of 100% year-on-year over the past three quarters. We expect sales and advertising of $35 million to $45 million in H2 2022, implying a year-on-year decline of 18% to 37%. Technology expense reached $14.3 million in Q2 2022, up 70% year-on-year and 83% on a constant currency basis. G&A exuding share-based compensation reached $26.6 million in Q2 2022, flat year-on-year and at 11% on a constant currency basis."
}