{
    "symbol": "JMIA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 10:07:03",
    "content": " In terms of e-commerce dynamics, with sustained growth across all relevant usage KPIs, despite a more challenging macro environment, but are active consumers reached $3.1 million, up 3% year-on-year as we continue to acquire new consumers and grow the base of returning consumers. Orders reached $9.4 million, up 11% year-on-year with sustained volume growth across product categories with the exception of JumiaPay app Digital Services, where we scaled back marketing investments and incentives to support unit economics. GMV reached US$240.7 million, up 1% year-on-year and up 14% on a constant currency basis. On-platform penetration of JumiaPay as a percentage of GMV remained stable at 28% in the Q3 2022 versus 27% in Q3 2021, as we maintained a disciplined marketing approach to driving on-platform penetration. JumiaPay Transactions reached 3 million in Q3 2022, down 1% year-on-year, impacted by softer Transactions performance in the JumiaPay app as we scaled back marketing investments and promotional intensity on the app. Revenue reached US$50.5 million, up 18% year-on-year and up 33% on a constant currency basis. Other revenue was up 53% year-on-year and 59% on a constant currency basis, partly due to the momentum of our logistics of the service offering, which generated over $1 million of revenue during the quarter. Marketplace revenue reached $32.2 million in Q3 2022, posting its fastest year-on-year growth rate in nine quarters. Two-third of the marketplace revenue growth came from commissions, which reached an all-time high of $12.6 million, up 56% year-on-year, driven by commission take rate increases implemented over the past couple of quarters. On the flip side, fulfillment revenue, which includes shipping fees charged to consumers, reached $7.9 million, down 11% year-on-year as a result of the selected deployment of next day free delivery. The accelerating market-based revenue growth drove strong gross profit growth, which was up 29% year-on-year and 43% on a constant currency basis, reaching $33 million, and gross profit margin as a percentage of GMV reached an all-time high of 13.7%. Sales and advertising expense was $15.4 million, down 32% year-on-year and 28% on a constant currency basis as we brought more discipline to our marketing investment. G&A excluding share-based compensation, reach US$28.3 million, up 12% year-on-year and 22% on a constant currency basis."
}