{
    "symbol": "JMIA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 13:24:07",
    "content": " In Q1 we posted the fastest year-on-year GMV and order growth of the past nine quarters, 27% and 40%, respectively. Excluding consumer incentives which are marketing investments, revenue and gross profit year-over-year growth rates also reached their highest levels over the past nine quarters, 56% and 31%. And starting from 2023, we expect to begin decreasing the adjusted EBITDA loss on a year-over-year basis. Second, we posted in Q1 the fastest order and GMV growth rates of the past nine quarters, orders accelerating by 40% year-over-year, reaching 9.3 million. JumiaPay transactions reached 3.2 million in Q1, up 32% year-over-year, supported by accelerating volume growth across the business and in the food delivery category in particular. On page 18, you can see that as we posted strong usage growth, we delivered the fastest revenue and gross profit growth rates in over two years, excluding consumer incentives, which are marketing investments in nature at 56% and 31% year-on-year, respectively. In terms of revenue trajectory, we observed three main things, first, the strong revenue growth, up 44% from $33 million in Q1 ‘21 to $47.6 million in Q1 ‘22. When we look at the sequential trends over the past nine months, we can see that we are slowing down the pace of marketing investment increases by 228% and 159% year-on-year in the third and fourth quarters of ‘21 to 94% year-on-year in Q1 ‘22. Sales and advertising expense per order and as percentage of GMV, both reached in Q1 ‘22 their lowest levels in four quarters at $2 per order and 7.5% of GMV. Technology expense reached $13 million in Q1 ‘22, up 56% year-on-year and 62% on a constant currency basis, as we increase technology headcount to support innovation and product development. G&A, excluding SBC, reached $13.1 million in Q1 ‘22, up 23% year-on-year and 30% on a constant currency basis. Adjusted EBITDA loss reached $55.3 million in Q1 ‘22, up 70% year-on-year and 76% on a constant currency. And finally, on the third building block, cost efficiency in Q1, we’ve seen our marketing efficiency improve, both on a per order basis and percentage of GMV, reaching the lowest level in the past four quarters. And starting from 2023, we expect to begin decreasing the adjusted EBITDA loss on a year-over-year basis."
}