{
    "symbol": "JHX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-07 10:52:10",
    "content": " In addition to our strategic products increase in January 1, 2021, the 10% increase in price mix was driven by the product mix shifts you see in this chart, specifically in fiscal year ’22, the decrease in the proportion of sampling and backerboard volume and increasing the proportion of hottie banded exterior volume and the increase in the proportion of ColorPlus volume. The net sales growth was delivered through the team's continued execution of the high-value product penetration strategy, Fiber Cement net sales increased 22% in the quarter, which contributed to an outstanding 13% growth in price mix. Our demonstrated momentum in high value product mix penetration in all three regions, combined with continued market share gains in LEAN execution gives us confidence in raising the fiscal year 2022 adjusted net income guidance range as well as in providing fiscal year 2023 guidance. Today we are introducing a fiscal year 2023 adjusted net income guidance range of $740 million and $820 million, specific to our North America segment, we're providing two points of guidance for fiscal year ’23. This is illustrated by our fiscal year ’23 adjusted net income guidance of $740 million to $820 million, which is an increase of 18% to 31%, compared to our fiscal year ’22 guidance midpoints of $625 million. Fiber Cement, we are going to starting it with Europe, we said 10 years from now, we want €500 million of Fiber Cement and €500 million of Fiber Gypsum and that's the path we're on and we'll continue to execute that growth through North American capacity, until the right time, we will put a 5% of plans in Europe. As far as the margins between the various products, you see the price points there as we push further up into innovation and ColorPlus, those would help us deliver on a higher margin and that's what some of what you're seeing in our guidance for next year, at the 30% to 33% level, we don't get specific margins by product group."
}