{
    "symbol": "JHX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-16 23:07:03",
    "content": " Our Asia Pacific team has also delivered a remarkable step-change in performance over the past three years and a significant change in the scale of the business, a 58% increase in adjusted EBIT and 16% volume growth is excellent leverage across this three-year period. However, if you remove the impacts of hyperinflation in fiscal year 2022, the team would have delivered in full year, EBIT margin 220 basis points higher than the 12.9%, which is well above the initial target of 14% we set out in February of 2019. Through the acquisition of Europe in April, 2018 and the execution of our strategy to transform our business these past three fiscal years, we have step-changed our financial profile and believe we have the right go-forward strategy to continue to deliver growth above market with strong returns. Global adjusted EBIT increased 30% to US$225.3 million for the quarter and US$815.6 million for the full year, both representing a 30% increase over the prior corresponding period. In the fourth quarter, the North America team delivered net sales growth of 25% to US$694 million. In the fourth quarter, execution on LEAN manufacturing and a focus on high value product mix, help to offset the inflationary environment leading to strong adjusted EBIT growth of 21% at an adjusted EBIT margin of 26.3%. Quarterly net sales growth was delivered through the team's continued execution of the high value product penetration strategy as well as a January 1, 2022 price increase, which led to price mix growth of 14%. We are particularly pleased that European EBIT margins have improved in line with our expectations set three years ago, excluding the impacts of hyperinflation the full year EBIT margin would have been 220 basis point higher in fiscal year 2022, exceeding our original target of 14% set back in February of 2019. I want to thank the team there for the excellent job they've done in integrating into James Hardie, hitting all of the targets we set together over these first four years and positioning the business to deliver on our initial 10-year plan of becoming a €1 billion business with over 20% EBIT margins. We delivered net sales greater than US$2.5 billion, an increase of 25% over last year and US$741 million of EBIT, an increase of 26% over last year. We expect similar outstanding performance in FY2023, specifically in North America; we expect net sales growth of between 18% and 22% are maintaining strong EBIT margins of between 30% and 33%. Our user mix have not changed since the last time we spoke in February, thus, we expect the price mix growth for fiscal year 2023 to be between 9% and 12%. We expect the second price increase to help improve our overall top line result while offsetting cost pressures, enabling us to deliver the EBIT margin range of 30% to 33% for the full year. The first quarter will be the most significant outlier from the rest of the year, without the benefit of the second price increase and with higher costs due to inflationary pressures to continued investment in growth initiatives including some people actions taken to drive retention, we expect Q1 EBIT margins to be the low point of the year and below our full year range. Again, we are confident in the full year target of net sales growth of 18% to 22% and EBIT margin of 30% to 33%. Further, as Sean just mentioned in North America, we are providing guidance for net sales growth of between 18% and 22% for the full year fiscal year 2023, while delivering an excellent adjusted EBIT margin of between 30% to 33%. And so that’s going to – it’s obviously going to slow the rate down, but because of the pricing of Color today if we hit our penetration, which we believe we will for this year, we’re going to end up with the price mix component between 9% and 12%. Very helpful, Sean, just in terms of price mix for North America 9% to 12%, when your ColorPlus expectations for another 25% year-on-year, so just looking against the net sales growth of 18% to 22%. As far as 9 points to 12 points of price mix, 7% of that is embedded with the price increase, which is taken across all products not just ColorPlus and then we’re not going to give specific guidance margins by quarter."
}