{
    "symbol": "PPBI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 14:26:21",
    "content": " In addition to deposit pricing impacts, the higher interest-rate environment has led to recent deposit fluctuations in our commercial escrow and exchange business due to lower commercial real-estate refinance and sales activity in the third quarter, a dynamic that may persist as we work-through the economic cycle. We held our loan-to-deposit ratio relatively flat at 84%, as we added $400 million of brokered time deposits of varying maturities during the quarter. Third quarter EPS increased to $0.77 per share, a 5% increase on a linked-quarter basis, driven by a total revenue increase of $6.3 million to $201.3 million. Taking a closer look at the income statement, net interest income increased $8.3 million to $181 million, driven primarily by a 26 basis-point increase in our asset yields and slightly higher average loan balances. Turning to the balance sheet, we saw a slight decline in gross loans of $122 million from the prior quarter, driven by lower loan fundings in commercial line utilization rates which declined slightly to a quarterly average of 40.4% and a spot rate of 39.9% as of quarter-end. Period-end deposits were $17.7 billion, a decrease of $338 million from June 30th primarily driven by a $532 million decrease in deposits from the banks escrow and exchange business due to lower transaction volumes and $127 million decrease in municipal deposits. To help offset the escrow and exchange deposit flows, in early September, we added another $400 million in term broker deposits which provided additional liquidity and enhanced our interest-rate risk asset sensitivity. Our tangible common equity ratio ended the quarter at 8.59%, an increase of 7 basis points from June 30th and our tangible book-value per share decreased slightly to $18.68 from $18.86 at June 30th. But, in this environment where we've seen Fed funds be raised by 300 basis points in six months and likely to be at somewhere north of 4% by year-end in a nine month period of time, that's just simply unprecedented and the returns that one can get risk-free rate on treasuries for some investors become attractive."
}