{
    "symbol": "PPBI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 17:20:19",
    "content": " Second quarter EPS increased to $0.73 per share, a 4% increase on a linked-quarter basis, driven by total revenue increase of $7.2 million to $195 million as net interest income increased almost 7% compared to the prior quarter. Net interest income increased $10.9 million to $172.8 million, driven primarily by $548 million in higher average loan balances and higher interest-earning asset yields. Our reported net interest margin expanded by eight basis points to 3.49%, reflecting a favorable remix towards higher-yielding loans and higher accretion income and fees as we saw an uptick to our loan prepayments compared with the prior quarter. The core net interest margin of 3.33% was flat to the prior quarter and included seven basis points of higher core loan yields, offset by a seven basis point increase in our cost of funds primarily due to the full quarter impact of the $600 million of FHLB term advances. Non-interest income, excluding security gains of $22.2 million decreased $1.5 million from the prior quarter due largely to $1.2 million of lower trust income due to the seasonal timing of the annual tax fees recognized in the first quarter. Our provision for credit losses of $469,000 was flat to the prior quarter's $448,000, with the increasing probability of downside risks due to high inflation and the ongoing supply chain challenges, we are carefully monitoring the current and forecasted macroeconomic environment. The second quarter results reflected solid loan growth of $356 million or 9.7% annualized driven by $1.5 billion in new loan commitments and continued increases in line utilization, which grew to a quarterly average of 41.6% compared to 39.5% in the prior quarter. Period-end core deposits were essentially flat, down by $27 million from the prior quarter, but remain higher than year-end 2021 by almost $600 million and nearly $900 million higher from June of 2021. Our loan-to-deposit ratio remained flat at just over 83%, and our cash balances increased $164 million to $973 million at quarter end. And finally, from an asset quality standpoint, asset quality remained solid as nonperforming loans decreased $11 million from the prior quarter to 0.3% of loans held for investment from 0.38% in the prior quarter. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead."
}