{
    "symbol": "PPBI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 13:59:03",
    "content": " Our commercial escrow and exchange business experienced another quarter of deposit outflows declining by $396.7 million, which is a result of decreasing commercial real estate transactions. As a result, our efficiency ratio improved to 47.4% from 48.3% and our pre-provision net revenue totaled $102.7 million, an increase of $2.3 million from the prior quarter and as a percentage of average assets rose to 1.89% from 1.85%. Non-interest income increased to $181.4 million, driven primarily by higher yields on interest earning assets and $3.8 million of additional swap income benefit compared to the prior quarter. Average total deposit costs came in at 58 basis points, reflecting an increase in broker deposits of $418 million. Looking at our expectations for the first quarter, we anticipate our non-interest expense to approximate $102 million to $103 million due to increases in deposit expense, FDIC insurance costs, as well as the timing of certain seasonal items, such as payroll taxes and annual staff merit increases. Our provision for credit losses of $2.8 million increased compared to the prior quarter's $1.1 million impacted by changes to the overall size, composition, asset quality and unfunded commitments of the loan portfolio. Deposits ended the year at $17.4 billion, which represented a linked-quarter decrease of $394 million attributable mostly to the escrow and exchange business as well as lower deposits in both commercial and consumer businesses as we continue to defend our deposit costs. I might also add, as you think about the margin in that, I think that both accretion and in this environment, fees, prepayment, deferred fees that amortize, we're seeing high single digit in terms of basis points, net 7, 8 basis point, 9 basis point range in that margin, which is down, obviously, from where we were running last year, when we saw higher prepayments. The way that we have always thought about it is that we've generally managed the balance sheet to be close to neutral, slightly asset sensitive and really not looking to take a position one way or another that generate pretty consistent good earnings in a variety of environments and to be able to provide the deposit and loan products that our clients need and are competitive in the market. It's a little north of $400 million, but it's a little lighter in the first half of the year call it about $80 million on average per quarter for the first half and closer to $120 million, $125 million on the back half per quarter."
}