{
    "symbol": "TECH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-04 12:18:08",
    "content": " 20:34 For Exosome Diagnostics, revenue growth accelerated as prostate cancer test counts -- as prostate cancer test counts increased over 50% compared to the prior year period, representing a quarterly test volume record. Please proceed with your question. 25:15 On top of all that, this is all cell and gene therapy, but we're also seeing explosive growth for our GMP proteins in regenerative medicine as well, so we've got a lot of customers that are scaling up around our agenda and that's equally exciting to us. And then maybe just on ACD, it looks like there were some sequential deceleration in that business from 2Q levels and you're averaging something and I guess like the high singles for the year, and that's down from at least in my model like 30% plus in 2021. Please proceed with your question. And as long as that core stays with the momentum we're seeing, which we do, then it's a mid-teens and up and then the accelerator from there of course is how do these smaller segments how do they scale and they've got the higher growth rate cell impact the overall portfolio, so number one again cell and gene therapy and on a $70 million run rate growing at 30%, 40% next year as a category that's going to start having a bigger impact. Looking ahead obviously, we'll give more clarity next quarter as we finish up our operating plans for next year, but it's the same message, we've been saying all along, which is that we expect it to be --there to be incremental slight but incremental margin improvement over the course of the next four or five years of strategic plan and we expect that to start next year – that continue next year. Please proceed with your question. We're helping on operationally so read of the integration kind of already occurred to be honest and the team has worked well together for a couple of years and some now with scale ready anyway, so it's -- so we have a good view port in how it's coming and I don't think it will be a year, I think it will be under a year from now. Please proceed with your question. It's -- we are very close to going from cash to accrual, that's also going to help probably next quarter is our goal maybe, but we’ll see, but you know, we're getting there and we have a whole new team for surgeon taking the helm there especially commercially, it's really worked wonders. 38:30 Well, net-net, I always been big on price, it's just in my DNA and we've put in place processes and structure here years ago and went after kind of an annual 1% net year kind of target and we're well above that this year. Please proceed with your question. Please proceed with your question. Please proceed with your question. So it's always a complicated balanced portfolio, kind of thing and like I said in the past we've kind of shot for a 1% net kind of year-on-year and this year it's probably double that we're shooting for and so far so good we're doing -- the team is doing pretty well."
}