{
    "symbol": "TECH",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-06 23:59:04",
    "content": " Now let's discuss our growth platform starting with our protein sciences segment where we grew organically by 16% for the quarter, and 19% for the fiscal year. Next, let's discuss our diagnostics and genomic segments where we grew revenue organically by 8% in the quarter and 10% for the full fiscal year. Operating margin for the protein sciences segment excluding the impact of partially owned consolidated subsidiaries is 45.5%, a decrease of 170 basis points year-over-year with favorable volume leverage and productivity gains more than offset by the impact of foreign exchange and strategic investments to support future growth. In summary, the growth momentum across our businesses remained strong, using fiscal year '19 as a pre COVID baseline, the company's core organic revenue CAGR has been consistently in the low teens in the past couple of years. By the time we reach the end of fiscal year '23, we expect our core margin improvement to offset these headwinds and finished the fourth quarter of fiscal year '23 with approximately 100 basis points of year-over-year margin expansion, thus entering fiscal year '24, right on track to achieve 40% adjusted operating margin by our target of fiscal year '26. So I'm more worried about and thinking about that the person replacing me, when I'm doing my tenure, it'll be a 500% growth 5x from when I started then person replacing me has to have that kind of runway so we can take it from one half billion or more to between 7.5 billion and 10 billion and the pawns we're in as, we're low in share in all the markets we serve, we see no problem making this a fantastic company going forward and an even stronger leader in the life science tools and diagnostic market so. And as long as our core stays where it is, and proteomics is still strong, biopharma, it's 30% kind of growth rates, we see an amazing double-digit year ahead of us and we're not going to get more bullish than mid-teens at this point, but we never do. And if we're going to exit the year with 100 basis points of expansion that would suggest that we're going to have worse than 150 basis points contraction in the early part of the year, itâ\u0080\u0099s because the FX headwinds are more severe when you look in the first half of the year, and they are in the back half of the year, as well as, as Chuck mentioned in his opening comments, we had a very successful quarter in Q4 with regards to getting staff back up and holding on to our key people. And it's an instrument business, it's got great IP, we have other things we can add to the platform, we think, and we have runway across all three major platforms, as we've talked about, a lot, I mean, everything from the Ella platform, which we're completing within a year of 510(k) process, the 1345, a brand new facilities, manufacturer they can more than triple the output."
}