{
    "symbol": "MOV",
    "quarter": 1,
    "year": 2023,
    "date": "2022-05-26 13:24:14",
    "content": " In the U.S., we grew sales by 6.6% in the first quarter, reflecting solid growth despite lapping increased stimulus that began during the first quarter last year and the beginning impact of inflationary pressure on the domestic consumer. In our licensed brands, we saw a very strong year-over-year performance as much as Europe was closed at various times during the first quarter of last year. As Efraim mentioned, during the first quarter, we anniversaried last year's stimulus in the U.S. and began to see the effect this year of increased inflation on the consumer in addition to slowing domestic growth, all of which created a challenging comparison year-over-year. As a percentage of sales, operating expenses for the quarter decreased to 43.2% from 44.6% in the first quarter of last year. Expansion in gross margin, combined with continued expense discipline in the first quarter, drove a $12 million increase in operating income to $26.1 million as compared to $14.1 million in the first quarter of fiscal 2022. Inventory at the end of the quarter was up $10 million compared to the same period of last year, primarily due to the timing of receipts and the addition of the Calvin Klein brand to our portfolio. Therefore, including a strong first quarter, our outlook remains unchanged, and we continue to expect fiscal 2023 net sales to be in a range of approximately $780 million to $800 million, gross profit of approximately 58% of sales and operating profit to be in a range of $125 million to $130 million. And while we do not generally provide quarterly outlook, we expect our second quarter net sales to increase 2% to 4% over last year, which includes a negative 500 basis point effect of foreign currency. So we expect it to continue to be strong, but each of the quarters for the remainder of the year should be relatively flat in essence to last year with each of our businesses contributing to the strength of our gross margins, but no real callouts to anything significant in each of the quarters of the fiscal year."
}