{
    "symbol": "RMBL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 19:12:15",
    "content": " During todayâ\u0080\u0099s call, Iâ\u0080\u0099m going to focus on three main themes: First, we are executing on our financial and operational goals, as we continue to take share in the powersports industry led primarily by our high quality used inventory offering, which uniquely positions us to continue building market share against the backdrop of a challenging macroeconomic environment. We delivered over a half a billion in quarterly revenue for the first time in RumbleOnâ\u0080\u0099s history, expanded gross profit margin to over 25%, and we increased net income 54% and adjusted EBITDA 41% quarter over quarter and we are reiterating our full year financial outlook of $1.9 -$2.0 billion in revenue and at least $145 million in adjusted EBITDA. We sold over 20,700 powersport units, led by over 41% growth in used retail units quarter-over-quarter, delivered more than $414 million in powersports revenue and grew powersports gross profit to $130 million. Looking at the second quarter, as compared to Q4 2021, which was our first quarter as a combined company we grew used retail powersports sales 86% from $66 million in Q4 to over $122 million by Q2. As far as additional interest in vehicles being offered for sale because of the economy, we have not seen it demonstrated in the capture rates, but again a lot of what we're seeing I think is a little bit masked just because of execution on the pre-owned side and quite honestly the lack of competition, it's really the traffic in the showroom floor is the example of the traffic, I talked about on -- on our website. The industry on the preowned used has not fluctuated like it has been automotive and it certainly hasn't been under any pressure that we've seen and really the last three years, we did not see the normal downturn valuations of pre-owned inventory in fourth quarter and we're not anticipating it this year either. They are very old school from our perception website, they are not omnichannel functional and but one thing we have done is we've added the RumbleON cash offer tool for trade evaluation on the majority of our websites even using third party and that has been -- that's really been a huge mover of our ability to acquire, but more importantly, I think what it has done for the stores is when the customer comes into the showroom floor now much like a CarMax transaction. So I wouldn't model anything significantly different there obviously we look at all components of working capital, receivables, and payables, and all those things that makeup the cash from operations we'll continue to drive GAAP profitability, continue to make sure we are seeing the flow-through of that down to the net income line."
}