{
    "symbol": "UXIN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-29 11:34:15",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by and welcome to the Uxin Earnings Call for the Quarter Ended December 31st, 2021. Welcome to Uxin's Earnings Conference Call for the quarter ended December 31st, 2021. DK will review business operations and company highlights, followed by John, who will discuss financial and guidance. These statements are based on management's current knowledge and assumptions about future events that involve knowing or unknown risks and uncertainties, which could cause actual results to differ materially from those in the forward-looking statements. We are pleased that our business maintained its robust growth throughout the third quarter of  year 2022, which stems from October to December 2021. Total transaction  grow by 111% year-over-year to 4,879 units in the quarter, and grow by 33% compared with last quarter. Although the resurgence of COVID-19  in Xi'an, where our first IRC is located, resulted in the city-wide lockdown in last December. This  growth movements of our second IRC in Hefei, generating since it's launched, as it actually helps us mitigate some of the negative impacts from the disruptions in Xi'an. Globally, officially opened for business in mid-November 2021, after six months of cooperation with the successful model of our CI IRC and sub foundation. As such, we have equipped our  IRC with an omnichannel sales model, integrating online sales into its warehouse-style operation. We offer our customers a diverse collection of high quality and cost effective vehicles, premium transaction services, hassle-free after-tax guarantees, creating the superior use cash shopping experience that has been widely welcome back customers these opening. Our NPS continue to rise for the fifth consecutive quarter, to reach a new record high of 59 in the third quarter from 56 in the prior quarter. This is a testament to our persistent efforts in optimizing all aspects of our operation to better pursue the customer needs from vehicle sourcing to transaction, delivery, and after sales services. For example, around 25% of used cars in the retail inventory was procured from customers in this quarter. Notably, we further strengthened our used car purchase services from local consumers, which enabled us to further reduce procurement costs while boosting sales conversion rates in the region. By improving the synergies between each process throughout the supply chain cycle, we reduced the time needed to make the car we procure ready for sale by 30% in the quarter. To voucher the opening of the Hefei IRC this quarter, we also ramp up our new medium marketing strategy. We were able to successfully reach our target customers, basically improving our marketing efficiency and reducing its costs through this new mix, marketing strategy. During these three months ending March 31, 2022, we have experienced a lockdown in Xi'an, as well as the expected Chinese New Year holiday off-season. As you know, Xi'an was the second provincial capitals city in China to shut down since the outbreak in 2020, our  actually began to recover after the Chinese New Year holiday. However, driven by robust performance of our group a IRC, we expand our retail sales to continue to grow in the fourth quarter. I will walk you through our financial performance in the quarter that ended December 31st, 2021. In this quarter, our retail sales volume increased by 61.3% quarter-over-quarter. As a result, despite the COVID-19 impacts starting from mid-December, our revenue grew 46.5% quarter-over-quarter,  the revenue guidance we should have had time. In the second quarter, we only had one IRC in Xi'an with a total inventory of about 600 cars. The newly added Hefei IRC can reach up to 2,500 cars inventory. The increased inventory enabled us to ramp up our sales, enhance our operation efficiency, and improve our one-stop car shopping experience to our customers. Thanks to the opening of Hefei IRC, we can keep our retail growth momentum, both in Q3 and that will be in Q4. With the opening of Hefei IRC in Q3, we incurred additional costs and expenses on construction, renovations, site rental, and new employees. We also invested in additional marketing for customer acquisition in Hefei City, as well as entire Anhui Province to maximize our branding the regional markets. Our business progress and operation optimization have been executed steadily following our long-term development plan, and we received a further capital injection from our strategic investors. With respect to the financing transaction with NIO Capital and Joy Capital, last Friday or March 25th, we received a $10 million from the segment close. For the revenue was $506.6 five million, representing a quarter-over-quarter growth of 46.5% and a year-over-year growth of 56.9%. Gross margin was 4.1%, stable compared to with 4.2% last quarter. Total operating expenses were $120 million compared to $285.9 million in the prior quarter, and a $188.3 million in the same period the last time. As I shared earlier, during this quarter we incurred expenses and preparation of the launch shop new Hefei IRC, and we also invested in additional marketing. Similar to last quarter, there was a fair value impact related to our financing transaction. The shire price was $1.58 per ADS on December 31st, 2021, compared with $2.76 per ADS on September 30th, 2021. Consequently, net income from continuing operations was a net gain of RMB 1.28 billion in the first quarter compared with a net loss of RMB 1.71 billion in the last quarter, and a net loss of RMB 172.9 million in the same period last year. Then about our cash position as of December 31st, 2021, we had a cash and cash equivalent of RMB 161.3 million. We expect our total revenues to be in the range of RMB 440 million to 460 million for the three months ended March 31, 2022. Although our revenue growth slows down a little bit, we expect our retail sales volume to continue to increase. However, as we successfully launched our Hefei IRC in November last year, its robust performance helping us to mitigate some of the impact. After the Chinese New Year holiday, our IRC has also renewed its growth gross category as it sales volume has surpassed its, pre -COVID level. During the fourth quarter, our Xi'an IRC continued to experience disruption caused by lingering COVID effect. However, we expanded strong momentum of our Hefei IRC to enable us to offset the impact and sustain our growth in terms of retail sales volumes. In fact, for the full  year of 2022, we  retail and total sales volumes to achieve solid sequential growth. Going forward, we will continue to diversify our selection of vehicles, and as such I think our average price will reduce to around RMB 100,000 to RMB 120,000, which is more suitable for the diverse needs for customers. In terms of our advantage, the customers are our focus, as we have always prioritized customer perception to improve the quality of our growth. We were the first one in China to sell used cars online nationwide, removing the geographical barrier for customers. Now, our vehicles are delivered to the door steps of our customers in more than 200 cities across China, within four days. As we mentioned before, please sign financing agreement with NIO Capital and Joy Capital in July 2021 for the total consideration of $300 million. As part of this agreement, we received the first tranche of $100 million in July 2021. On March 25th this year, we received $10 million of the second tranche. As such, we have received totally $137.5 million for the financing and about $37.5 million from the second tranche. On top of this, will received up a total of $155 million warrants to the asset size by our investors. With this money, we aim to continue  and extending our IRC network to stand our business growth in the long term as we expect the  for used car products and services. According to the financial report, Hefei IRC has had a positive impact on the company's performance. In 2021, the used-car market in China continue to grow as its self volume exceeding 70 million units or 1 trillion RMB in transaction volume value. For retail, no used-car dealership had market share of more than 1% in terms of sales volumes in China. In recent years, consumers are increasingly comfortable with buying used cars."
}