{
    "symbol": "EVRI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 16:24:04",
    "content": " Please proceed with your question. I think the different teams are doing everything they can to continue to meet the demand of our customers, no impact in the second quarter for us and you obviously we're looking at the second half of the year, we donâ\u0080\u0099t anticipate anything for the second half of the year being impacted by supply chain. Please proceed with your question. Please proceed with your question. But I think usually in terms of cadence, you're right Q4 ends up being a little bit softer unless there's a kind of push by the operators like last year, where it seemed like there's a lot of sale opportunities on the equipment side. Please proceed with your question. Please proceed with your question. If you could give us just a little bit more insight into what we think, what we'll happen to the EBITDA margins as we roll forward because there's obviously a lot of discussion about investment and commitment to growth and I totally get why you're doing that. And I would look at that more of a like on the first half of the year, I think that that's probably more what you should look at than just this quarter because of the high amount of sales and maybe Mark can give a little bit of additional commentary. But I think we kind of start returning thinking farther out to that you're kind of getting to that higher level of back closer to 50 maybe not above, again because we're expecting to see strong unit sales continuing as we go into next year right now as we sit here. Please proceed with your question. And last year in the second quarter, but moving forward we talked pre-COVID is right, when COVID hit that we thought we were in that kind of equipment replacement cycle that are the age of the kiosk, the average kiosk out in the field was getting just a little bit north of three years at that point. Please proceed with your question. I think for specific drivers, as you talked about pushing to 15% ship share refreshing the install fees, keeping the FinTech pipeline going among a couple others, but focusing in a bit more, I guess what's changed since we last spoke at Q1 earnings, I would imagine those were initiatives kind of in place well before then, like if you just think about now versus three or four months back, kind of what's changed to lead you to think that may be the right reinvestment rate. I'm thinking more on the R&D side and then kind of the non-R&D OpEx side but what's changed make you think, maybe a higher reinvestment rate is the better kind of profile for this business --\n Kind of make sure I can address your question, Jeff, we're move it along, but to Mark but I don't think we changed. Please proceed with your question. Yes, look, I think Randy kind of hit on the pieces, really, when you look at what's going on in the cost revenues on the equipment sales side, and how it's also been translated into the installed base side of things."
}