{
    "symbol": "GLNG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 14:57:04",
    "content": " She will start a 20-year contract for BP on the Tortue field, located offshore Mauritania and Senegal and will unlock an EBITDA earnings backlog of $3 billion to Golar or $151 million of EBITDA annually from next year and until 2043. The Mark II design has a liquefaction capacity of up to 3.5 million tons. As a result of that, our share of Hilli distributable adjusted EBITDA has increased considerably to $62 million this quarter, an increase of close to 150% on year-over-year basis. In line with our simplification efforts and to focus our business on FLNG, weâ\u0080\u0099ve been awarded a conversion contract for Golar Arctic for â\u0082¬269 million and sold our FSRU Tundra for $350 million to Snam. So due to strong commodity prices and incremental earnings from Hilli, our total FLNG tariffs have almost doubled to $108 million this quarter compared to $55 million in Q1 of last year. For â\u0080\u009822, we have hedged the TTF price exposure for Q3 at $25.37 per MMBtu, generating $19 million of TTF-linked EBITDA to Golar for the quarter. With TTF at $49.5 for â\u0080\u009823, this will generate approximately $160 million in EBITDA to Golar, where 50% of that is now secured in terms of locked in the price. Combined with the Brent forward price for â\u0080\u009823, which currently stands at $88 a barrel, we expect to generate $305 million in Golar share of Hilli EBITDA next year. Total debt service for Golar share of Hilli is $50 million, and Hilli alone will generate free cash flow to equity of $255 million for 2023 or $2.35 per Golar share. During the quarter, Golar and Keppel Capital, together, the owners of Gimi, agreed to a $50 million incentive payment to Keppel Shipyard for initiatives to safeguard sail-away within the first half of â\u0080\u009823. The CapEx numbers received have seen inflation, but remain within the $500 million to $600 million of CapEx per ton of liquefaction capacity, which we think is highly attractive compared to other maritime and shore-based liquefaction solutions. The Mark II design has a liquefaction capacity of up to 3.5 million tons. As an illustrative example, we have highlighted some Mark II tolling fee scenarios ranging from $2 per MMBtu in the low end, which is lower than for most the most recent U.S. shore-based liquefaction project, yet they would give Golar a CapEx to EBITDA of around 5x on capital employed, so 20% unlevered return. Add to that the contracted EBITDA from Gimi from startup in second half of next year, we expect to have a run rate EBITDA of north of $400 million and subject to commodity prices ranging between $400 to $500. Please ask your question. As we have been highlighting on several of our previous quarterly calls, weâ\u0080\u0099ve taken very active steps to ensure the current timeline, which is basically the driver of the $50 million cost increase, which then safeguards that timeline, and we are very happy with the progress weâ\u0080\u0099re making basically on a daily basis and feel very comfortable with the current delivery date. We will take our next question. Please ask your question. We will take our next question. Please ask your question. We will take our next question. Please ask your question. We will take our next question. Please ask your question. We will take our next question. Please ask your question. We will take our next question. Please ask your question."
}