{
    "symbol": "CSCO",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-15 20:36:02",
    "content": " For fiscal Q3, our guidance is: we expect revenue growth to be in the range of 11% to 13%; we anticipate the non-GAAP gross margin to be in the range of 63.5% to 64.5%; our non-GAAP operating margin is expected to be in the range of 33% to 34%; and our non-GAAP earnings per share is expected to range from $0.96 to $0.98. What we wanted to give you confidence is we have better visibility than weâ\u0080\u0099ve ever had in the past, both from the backlog and the $17 billion â\u0080\u0093 almost $17 billion of RPO thatâ\u0080\u0099s current, thatâ\u0080\u0099s going to turn into revenue in the next 12 months in the ARR. Let me take the share question because I think Iâ\u0080\u0099ve said on several calls that, obviously, market share is reflective of revenue and with our backlog that as we began to ship certain products that we would be a gainer of market share, and we certainly expect that when these numbers are digested and the new reports come out for Q4, that youâ\u0080\u0099ll see that to be the case. Our supply chain team and our product engineering teams have worked pretty relentlessly over the last several quarters with product redesign, with qualifying alternative components, with working with our suppliers to get to their subcomponents to make sure we could free this up so that the increase in supply thatâ\u0080\u0099s leading to some of the share gains that weâ\u0080\u0099re talking about is the result of a lot of hard work by a lot of people inside the company. About three months ago, you guys were talking about if product orders were down 10% for the year, then your product backlog at fiscal year-end would be 2x to 3x higher than the normal kind of $4 billion or $5 billion range. And then maybe just as a quick follow-up, so as we enter, letâ\u0080\u0099s say, the next fiscal year, I mean given your excellent work on supply chain, and the team has done a phenomenal job, would that imply â\u0080\u0093 I mean basically, we could be back at normalized backlog within a quarter, maybe two quarters at the worst-case scenario if trends hold consistent where we are today."
}