{
    "symbol": "CAMP",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-23 23:56:04",
    "content": "  Our first quarter software and subscription services revenue grew 13% year-over-year to $39.6 million, representing approximately 61% of the total revenue for the first quarter. Software and subscription services revenue of $39.6 million, up 13% year-over-year and down 4% from the prior quarter, represented approximately 61% of consolidated revenue. In terms of performance metrics for our software and subscription services business, where main performance obligations in the first quarter was approximately $250 million, a 7% increase from $200 million in the prior quarter and a 57% increase from $137 million in the same quarter a year ago. So, although this quarter, we were down slightly with gross margin and that was driven by this pressures from the supply chain, we do see that we will progressively start moving upward to that 50% target over the next three to five years and it will be a gradual going from say 40%, 41% to 42%, 43%, up to 50% as that install base becomes more evident and we monetize that install base. While you're -- while that's happening and that's where our focus is, we also have the one-off of our vehicle finance business, which you probably know from a couple of years ago, was a pretty large portion of our overall subscriber base and was generating a good, what I would say, consistent revenue, albeit that revenue was at pretty low ARPUs and not in terms of -- our gross margin at our target gross margin level. So, Mike, we haven't quantified it in terms of the quarterly revenue target, but what we've done is we've identified of that population of customers, let's say that 60 to 65 customers that that customer base is historically represented on an annual revenue run rate, somewhere around 65 million to 75 million, maybe as high as 80 million if you go back in history. The -- and it's been -- we're penetrated by the fact that we are very focused on converting our base of hardware customers over to the subscription models, where the predominant portion of that revenue when it happens, gets positioned in the product category, the device category, not in the recurring application subscription category. The second thing is when you look at the revenue base that existed in 2021 -- first quarter of -- fiscal 2022, there was at least $2.5 million to $3 million of vehicle finance revenue that was in there that has come down, has been dwindling down as those prepaid contracts get service to their term. So, there's combination of factors, but we feel really good about the fact that as we are converting our base of customers, our telematics device customers over and we're building that install base, an incremental 200,000 subscribers that I mentioned a little earlier, that will start to grow and we will start to monetize it, thereby offsetting this decline that you're seeing in the legacy recurring application subscription revenue. It's become a key area that we're concentrating on here in the near-term, especially as we really target two things that we need to navigate through; one, converting the base of our customers and moving them into multi-year service contracts; and two, navigating through some of these supply chain challenges."
}