{
    "symbol": "ERO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 06:01:06",
    "content": " With key growth projects progressing on track and on budget, plans for a strong second half of the year, highly competitive operating costs, and early signs at consumable costs are moderating, we are confident not only in the strength of our operating business, but also in our ability to execute on our strategy on a time horizon that looks incredibly bright for copper. With contributions from the first upper level project Honeypot stope within the Pilar Mine, which we started mining during the quarter, copper grades continued to trend above our full year copper grade guidance of 1.6%. By higher production levels during the quarter, our unit operating costs were affected by changes to copper concentrate sales channels due to operating challenges at our primary domestic smelter, as well as the relative strength of the BRL to the U.S. dollar. In addition to a less favorable BRL exchange rate than originally budgeted, our all-in sustaining costs at the Xavantina Operations of $1,169 per ounce of gold produced reflected a higher level of sustaining capital expenses spent during the second quarter. And while we have observed local pricing of certain consumables moderate, the combined influence of unit operating costs in the first half the year, as well as expectations at copper concentrate sales allocations, will continue to be weighted towards export sales through the balance of the year, we are raising our full year cost guidance. As David noted, our second quarter results reflect both strong operating performance and external headwinds, including changes to concentrate sales channels at influence top line revenue, unit operating costs, and working capital. With respect to foreign exchange derivative contracts, we reported realized losses during the first quarter of $3 million and an unrealized loss of $1.4 million due to the weakening of the BRL from approximately $4.75 per U.S. dollar at the end of the first quarter to approximately 5.24 BRL per U.S. dollar by the end of the second quarter, Prudent capital management undertaken by our teams during the second quarter, resulted in deferrals of over $20 million in capital for the year. And as you will have seen over the last five years, if you go back through our financials, you will see various adjustments on a quarter-by-quarter basis in terms of the pricing and how adjustments are made, depending on what the metal price is doing, depending on what our customer does in terms of allowing us to secure pricing during the time that, that material is traveling, which is somewhat unique compared to a lot of our peers who have to sell under long-term contract and have very significant price participation and pricing look-back mechanisms, we do not."
}