{
    "symbol": "RH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 00:19:04",
    "content": " There is going to be opportunities that we probably shouldnâ\u0080\u0099t imagine that might unveil themselves whether itâ\u0080\u0099s from a real estate perspective, business opportunities that might exist, ability to accelerate our business in different ways, whether itâ\u0080\u0099s as we mentioned kind of what Iâ\u0080\u0099d call, Iâ\u0080\u0099d always call interior design offices where if you stop and think about our business, interior design is really something that elevates and amplifies our product. If youâ\u0080\u0099re in Paris in the next few weeks and if you are anywhere near this  Avenue Montaigne look up, we will see â\u0080\u0093 I think itâ\u0080\u0099s almost 100-foot high, something like that, 100-foot-high, 70-foot illustration is the  wrapping RH Paris as a symbol is our design ethos and beliefs. So I think in the third quarter, with luxury housing is not a fourth quarter, luxury, if you think about where luxury housing has been, it was down 18% in the first quarter of â\u0080\u009822, down 28% in the second quarter of â\u0080\u009822, down 38% in the third quarter of â\u0080\u009822 and recently reported a couple of weeks ago down 45% in the fourth quarter of â\u0080\u009822, which means because youâ\u0080\u0099re talking about months and they are kind of going down, it probably means that the last month of the fourth quarter was down close to 50%. We donâ\u0080\u0099t know where we are, we kind of can perceive how much bigger we are than other people, assortment we may have, maybe eat in our restaurants and walk around and just getting to and from the restaurants going up and down the stairs, you are going to see and perceive a lot about our business where other businesses it could be a walk on buy, right. So, how that affects us, and just watching through the pandemic, and seen to the other side of that correctly and strategically not getting stuck into being tactical like, there is just no way that once people start pushing the promotional buttons that they are pushing, that they are not going to push it more times, now, and there is not going to be more emails, and there is not going to be itâ\u0080\u0099s like look at the emails you get, and look at them and the timing of the quarter, okay. I mean like, from one day to the next, it was crazy like, how the markets were pricing in, where interest rates were going and all of a sudden it completely flipped just because of the banks shut â\u0080\u0093 banks that got shutdown over the weekend and everybody believes that all people believe me, like, letâ\u0080\u0099s think about this."
}