{
    "symbol": "NHI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 15:29:04",
    "content": " The Bickford lease was reset on April 1 and we're happy to see that their EBITDARM coverage for the second quarter was 1.3x and occupancy improved through the quarter including another 100 basis point, monthly increase in July. We're encouraged by the quarter of our new SHOP operations, which contributed over $3 million of NOI, excluding non-recurring transition costs, which is in line with our forecast for the year. Beginning with our net income per diluted common share for the second quarter ended June 30, 2022, we achieved $0.47 compared to $0.85 for the same period in 2021, and sequentially up $0.29 from the first quarter in 2022. As a result of these significant items, revenues on a GAAP basis for the second quarter were down $14.4 million as compared to the prior year quarter. Excluding the effects from the Bickford straight-line rents and intangible lease incentive write-offs, revenues for the second quarter are up $10.8 million from the prior year second quarter. In the second quarter, we acquired a 53-unit assisted living facility in Oshkosh, Wisconsin, for approximately $13.3 million at an initial cash yield of 7.25%, which also resulted in a retirement of our $9 million first mortgage loan to that same customer. During the second quarter, we placed an additional four properties in held-for-sale and recorded a $4 million related impairment charge. The sequential quarterly increase in FAD was largely driven by the SHOP contribution of approximately $2.9 million, which excludes transition expenses and is net of non-controlling interests. Our second quarter dividend of $0.90 per share was paid on August 5, 2022, and represents normalized FFO and FAD total dollar payout ratios to 69.5% and 71.4% respectively. During the second quarter, we purchased approximately $1.2 million shares of our -- 1.2 million shares of our stock for approximately $70 million at an average price of $58.52 including commissions. Since the second quarter of 2021, we have completed the disposition of 31 buildings for $288.2 million, including $73.3 million in the second quarter of this year. That said, the $3.2 million in NOI for the quarter excluding transition costs is in line with our forecast and we continue to expect the first year annualized NOI contribution will be in the low-to-mid teens with future incremental upside of $6 million to $8 million. What I would say to you is we did talk about $2.9 million in rent deferrals in the second quarter -- or I'm sorry, $3.9 million in rent deferrals in the second quarter."
}