{
    "symbol": "ITCI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 14:54:04",
    "content": " These statements may include statements regarding, among other things, the efficacy, safety and intended use of the company's product development candidates, our clinical and non-clinical plans, our plans to present or report additional data, the anticipated conduct and results of ongoing and future clinical trials, plans regarding regulatory filings, future research and development, our plans and expectations regarding the commercialization of CAPLYTA, potential impact of the COVID-19 pandemic on our business and possible uses of existing cash and investment resources. Consistent with the strong demand has been the highly positive feedback we are receiving from physicians regarding CAPLYTA's clinical profile in a broad range of patients with bipolar depression, as well as their early experience with patients. Importantly, across our clinical trials, weight gain was similar to placebo and in fact in our longer term open label studies, patients with bipolar depression had no weight gain from baseline to six months, while patients with schizophrenia lost an average of 7 pounds in one year. In addition to our commercialization of CAPLYTA, we have ongoing programs to expand our label to include the treatment of a broad range of mood disorders, including major depressive disorder or MDD and mixed features in MDD with bipolar depression. Following the exciting approval of CAPLYTA for both bipolar I and bipolar II depression in late December, Q1 marked the first full quarter of the launch of our expanded label. We have seen utilization of CAPLYTA across a broad range of patients, including both bipolar I and bipolar II depression, and is both monotherapy and adjunctive use. New patients starts, as reflected by new-to-brand prescriptions or NBRX, have increased approximately 300% following CAPLYTA's bipolar depression approval. Since the Bipolar depression launch, we have seen a rapid increase in the number of commercial patients being prescribed CAPLYTA and expect to see additional growth in this channel through the remainder of the year. And since the launch of the bipolar indication, we have been getting -- seeing a very high level of demand for samples and that demand is continuing as physicians are identifying new patients to put on CAPLYTA and looking to start them on a sample to assess the effectiveness and the safety and tolerability, and that sample demand is continuing. So based on our studies in our bipolar depression, in our programs that were completed, we looked at the subset of patients with mixed features and where we have seen an effect in mixed features patients, and that's what led us to design the study for our current study. And I think our expectation is that overtime as physicians get more and more awareness of CAPLYTA and more and more experience with CAPLYTA in other indications like bipolar depression, there will be a positive halo on their prescribing in schizophrenia as well, and we are seeing those increases in schizophrenia also."
}