{
    "symbol": "ASR",
    "quarter": 3,
    "year": 2021,
    "date": "2021-10-26 13:50:15",
    "content": " Passenger traffic continued to improve across the board, reaching a total of nearly 14 million passengers in the third quarter, which was only 1.4% below the pre-pandemic levels of 3 quarter 2019. Again, Puerto Rico posted the strongest recovery, beating third quarter '19 levels by over 16%. Mexico delivered the best performance in terms of international traffic on the back of successful vaccination process in the U.S., nearly reaching pre-pandemic levels of 3 quarter '19. Compared to the pre-pandemic levels of third quarter '19, domestic traffic in Mexico was only down by 9%, improving from the 12% drop posted last quarter. In Colombia, domestic traffic was only 4% below third quarter '19 levels. On a monthly basis, traffic continued to gradually recover throughout the quarter with the total traffic beating third quarter '19 levels by 3%, driven by Puerto Rico and Colombia, which were both above pre-pandemic levels, while Mexico was slightly down by 1% as domestic traffic lagged behind international recovery. Importantly, we achieved an 11% increase in revenues over pre-pandemic levels in third quarter '19 with non-aeronautical services of 17% and aeronautical services nearly 8%. Mexico accounted for 67% of the total ex-construction revenues in the quarter while Puerto Rico and Colombia represented 22% and 11%, respectively. On a per passenger basis, commercial revenues remained distorted by the reduction in passenger traffic, reaching nearly Ps.118 compared with the pre-pandemic level of Ps.99 posted in the third quarter '19. By contrast, consolidated costs were down mid-single digits when compared with third quarter '19 levels, even despite the 11% increase in revenues during the period. Compared to third quarter '19, operating costs and expenses ex-construction rose 7%, below the 10% increase in revenues ex-construction. Cost in Puerto Rico rose nearly 10% year-on-year, but declined 27% when compared with third quarter '19. Compared to third quarter '19 pre-pandemic levels, EBITDA was up 18%. In percentage terms, EBITDA in the quarter compared with third quarter '19 levels increased by 14% in Mexico, 15% in Puerto Rico and 1% in Colombia. In terms of the traffic -- sorry, in terms of the tariff, what I have said in the second quarter's earnings call is that we will not be able to reach the 99.8% maximum tariff compliance that we have reached over the last 20 years, due to the maximum tariff increase that was approved at the beginning of April this year."
}