{
    "symbol": "SSB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 14:01:03",
    "content": " John mentioned it on the call, but we had a great year on margin expansion and I think we have a Page 12 in the deck that talks about kind of the progression of net interest margin from the fourth quarter of last year to the quarter this year and NIM's up 120 basis points. I think in the last forecast, it's moved up 25 basis points to peak out at 5% and then there to be a 25 basis point decrease by the fourth quarter. And then based on the interest rate forecast deposit beta, we would expect deposit cost to get in that 1.15% to 1.25%, that second part of the year, which is about a 100 basis points from where we were there this past quarter and as we think about that timing, we would expect, 40% to 50% of that to happen in the first quarter with the remainder of that over the -- of the rest of the year. And that's why I think as we look at the next year and if we look at those deposit betas, and we assume that we end the year about 100 basis points higher than where we are today, a lot of that -- we think 40% to 50% of that gets front-loaded into the first quarter. I think Steve's numbers -- he was just given -- he was assuming about $10 million a quarter in that 10 basis point comment he made a few minutes ago about margin dollar -- moving the margin dollars from noninterest income, but it's a little bit of a swag at this point. And if we're to close to 5% Fed funds rate, that's about $40 million a year, and that's sort of the assumption, and that's the 10 basis points on assets. But as we kind of think about comparing the fourth quarter to future, until the Fed stops raising rates and some of our interest rate-sensitive businesses like mortgage and core deposit, we think it's probably similar, 55 to 65 basis points of assets. And that will be come in throughout the course of the year as those initiatives begin, but all that's baked into that $950 million number that I referenced and expecting something in the low 2.30% in the first quarter. And then as it relates to deposits, as Will mentioned on the call, at the end of the year, I think we had $150 million or so of broker that's been out there for, I don't know, three or four years, and no wholesale borrowings at the Federal Home Loan Bank."
}