{
    "symbol": "SSB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 16:44:06",
    "content": " And you noted the 5 basis point, deposit beta last time around, but I'm wondering what the underlying assumptions are within the I guess it's up 4.7% in your ramp scenario, if you could remind us on that, because I would think given all the 12% liquidity or whatnot, you'd actually be much more acid sensitive than peers, then maybe that modeling would show me? Based on Moody's consensus forecast to be at 2.25% to 2.5% Fed Funds rate at the end of the fourth quarter and with about a $41 billion interest earning asset base, which we expect to be reasonably flat. And that's where you can see that we ended up at the Fed funds rate at 2.5%, deposit beta was 5% on the first 100 basis points, and 24% over the entire cycle. And I guess, on‘23 if Fed Funds, moves like Moody’s consensus has it now, which would be to hit 3% in ‘23, you're going to see further improvement from that 320 to 330 range Steve mentioned in Q4, you'll see improvement in 2023 margin from that point as well, if that rate environment in fact occurs. And then just my only other question is around loan growth, how you guys are feeling about kind of this, just north of 6% run rate, this quarter into the rest of the year, and then the commentary around resi mortgage and portfolio and more of that production obviously, with the addition of ACBI I guess that's now down to a smaller percentage of the balance sheet. But I mean, ultimately, we're a growth company and great growth markets, kind of our mantra is to grow everything good in the bank at an annualized rate of about 10% through a cycle, our guidance on loan growth the last couple of quarters has been high single digits up to 10%as prepayment speed slowdown with the rising rates, we think that our current production levels will produce that level of growth. So, I would think that over the course of the next several quarters, I'd say probably towards the end of the year, we'll get to maybe more of a 50/50 mix, just because we like some of this portfolio arms and other things in a higher rate environment. Hey, good morning, everyone. Yes, we're assuming that back to the Moody's consensus forecast, which we use to do our modeling is that we would have a 225 to 2.5% Fed Funds rate at the end of the fourth quarter. Hey, good morning, everyone. But, as we put more production on the balance sheet less than fee income, we're going to see less fee income moving forward, I think before we'd guided our secondary fee income to be 30 of non -interest income, the assets to be between 75 and 85 basis points."
}