{
    "symbol": "VBTX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:27:05",
    "content": " Our average loan growth from Q4 to Q2 was only $107 million, producing less-than-expected revenue for net interest income, but our ending loan balance was $362 million greater than Q4 ending balance, resulting in a 21% annualized growth quarter and a great starting point for Q2. The why behind our growth profile continues to be the same four things: one, focus on constant upgrade and hiring of experienced and proven talent; two, operating in the strongest growth markets in the country; three, continued market disruption; and four, a commitment from my team that strong risk-focused growth is a pathway to enhancing our company's value. During Q4 everything fell our way, including bond prepayment income, collection of non-accrual interest, BOLI proceeds and an ALLL reserve release, if we adjust Q4 EPS for those things plus first quarter day count and share count, then we're right on top of our Q1 2022 operating results of $0.66 in EPS. Third, Veritex's asset sensitivity has increased since Q4 and with market expectations of additional Fed rate hikes in 2022 of 200 basis points this will add significantly to net interest income. And I think the biggest thing for net interest income growth is just, knowing that through 75 basis points of moves and we're off the floors where our asset sensitivity is up and our growth profile. I mean, we'll have -- we may be talking about a much smaller adjustment in Q1 of 2023, but you just can't accrue that, because you don't know it's where your TSR performance and you don't know how you're going to perform and how all your peers are going to perform. Spread look, I think, if you were to look at -- we're typically -- and I always think of spreads not rates fixed or variable, it's all about spread. I don't think -- you've always heard me say that, I think DFW is the most irrational deposit pricing market I've ever worked in, in 40 years, but it's not."
}