{
    "symbol": "VBTX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 14:17:04",
    "content": " Our total provision of $11.8 million for the quarter accounts for the charge-off, growth and keeps our ACL at 1.01% of loans. As you look at the financial results on a year-over-year basis, remember to factor in the capital raise in the first quarter where we issued approximately 4.3 million common shares and raised $154 million in common equity. The two biggest items in the increase are the Fed raising short-term interest rates, which represents $4.2 million of the increase in growth, which also accounted for about 700 -- $0.7 million  The net interest margin increased 10 basis points from Q3 to 3.87%. Veritex recorded an equity method loss of over $5 million as funded volume decreased to almost $415 million, but gain on sale margins collapsed to 1.89% due to rising rates, significant rate volatility and the impact of long-dated rate locks. I'm just - I'm not - I actually think we can grow net interest income next year because of the loan growth we've been talking about low double digits, it's going to - but it's just going to be harder. You can tell that if we close $75 million in the fourth quarter and only $117 for the year, I mean, we've got - some of that's pent-up demand after Q2 and Q3 and the USDA really came through for us. So it sounds like it's - instead of in LTV, it's basically a cash flow perspective and... Class B in general, that makes up 33% of our office book today, 62% of our office book is in Class A, which is encouraging to me because that's where I will - I think we'll see the least amount of stress. No, I think it's still coming just because I think you've got time deposits, you've got money market customers that you're going to fight hand-to-hand combat to retain these customers, these relationships and these dollars. I think that's something we think about in the back half of 2023, when the recession outlook is clear, credit is - the situation is clear and capital has built close to this 10% - if it's a 10% CET1 or better."
}