{
    "symbol": "VBTX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 15:08:02",
    "content": " The question is, are we just going to hold are we going to sell and so I expect close volume now that the USDA is getting it its funding lined up, and we're heading into a new fiscal year, starting October 1, I expect a really strong back half of the year on the funding side, but may just all end up in portfolio, which has got really good implications for net interest margin, growth, et cetera. So, there's some offsets, but I wouldn't go crazy, especially in Q3 getting overly optimistic that -- I mean, I think we're going to have better than Q2 overall in fee income because the interest rate swaps I think the government guaranteed business is going to stay weak on the gain on sell side through the quarter and then improve more in Q4. I also think that our mortgage warehouse business continues to see good opportunities in the deposit space there, the escrow deposits, those type things where we're seeing, we're able to achieve good spreads over our ECR rate, and then let you know, our community bank continues to really produce great results for us on the deposit side, got a strong emphasis on Treasury. I mentioned four intentionally, and they are all pretty significant drivers, with the one downside being our Correspondent Banking division, and you can see the Correspondent Banking division because of what's happening with growth across -- loan growth across the industry, and the Fed pulling liquidity out of the system. I think now you've heard me say for the past few years, going back a few years pre-pandemic, I called it hand-to-hand combat and that I felt like DFW was the most irrational deposit pricing market I've seen in my career, which covers a long time and a lot of geography and it's just incredibly competitive. Hey, good morning, guys. It would seem like expense growth could really decelerate you guys who get some really strong kind of positive operating leverage, as we think about next year just given the NII trends and the movement in earning assets that you talked about, Terry. I mean it's sitting here at 14.7% year-over-year, but when you're generating close to 22%, backing out the effect of PPP fees in 2021, I don't really -- I don't think I'll say a whole lot about expense growth, as long as we can generate that revenue growth. Hey, good morning, guys."
}