{
    "symbol": "ETR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 16:52:04",
    "content": " And now Iâ\u0080\u0099d like to introduce your host for todayâ\u0080\u0099s program, Mr. Bill Abler, Vice President, Investor Relations. We will begin today with comments from Entergyâ\u0080\u0099s CEO, Drew Marsh; and then Kimberly Fontan, our CFO, will review results. In an effort to accommodate everyone who has questions, we request that each person has no more than two questions. In todayâ\u0080\u0099s call, management will make certain forward-looking statements. Actual results could differ materially from these forward-looking statements due to a number of factors, which are set forth in our earnings release, our slide presentation and our SEC filings. Reconciliations to the applicable GAAP measures are included in todayâ\u0080\u0099s press release and slide presentation, both of which can be found on the Investor Relations section of our website. Yesterday, the planned leadership succession that we announced in August took effect. Kimberly Fontan takes over as Chief Financial Officer, and Kimberly Cook-Nelson assumes the role of Chief Nuclear Officer. Meanwhile, Chris Bakken will serve as the Executive Vice President of Entergy Infrastructure to provide leadership and mentorship to both Pete Norgeot, who was recently promoted to Chief Operating Officer; and Kimberly Cook-Nelson as they settle into our top operational roles. While the new senior leadership -- with the new senior leadership team in place, Entergy has a bright future and we expect to deliver on the commitments that we have made to our key stakeholders. Today, we are reporting strong quarterly adjusted earnings of $2.84 per share. In fact, with our biggest quarter behind us, we are narrowing our 2022 guidance by raising the bottom of the range by $0.10 per share and we are affirming our longer term outlooks for 6% to 8% annual growth through 2025. Last week, our Board of Directors raised our quarterly dividend by 6%. The annualized amount is now $4.28 per share, consistent with our target payout ratio of 60% to 65%. During the quarter, we continued to execute on many important fronts. Absent the settlement, we expect a decision in the second quarter of next year. While the prudent review of Ida cost is ongoing, moving forward with the financing will benefit customers by reducing interest rate risk. In September, we received an ALJ recommendation on our proposed Orange County Advanced Power Station or OCAPS. I will note that the Governor of Texas has indicated his support for the plant, including its hydrogen capability. OCAPS hydrogen capability is less than 5% of the total investment, and it provides a critically important option for fuel diversity and ensures the plantâ\u0080\u0099s continued value in a low carbon future. Also, an economically viable hydrogen economy is no longer decades away. As we have said, Entergyâ\u0080\u0099s region is uniquely positioned to take advantage of this opportunity and we expect the Gulf Coast to lead the way, bringing jobs and economic benefits to our communities. If approved, OCAPS will be our first unit capable of burning up to 30% hydrogen on day one1 with plans to eventually be 100% hydrogen capable. As we laid out at Analyst Day, our industrial customers have many inherent advantages that make them low cost producers on the global stage. For example, Entergy Texas and New Fortress Energy signed an MOU for collaboration on developing renewable energy and hydrogen infrastructure. Entergy Texas will supply 120 megawatts of green power to serve this facility, which is expected to be one of the largest of its kind in North America. In Louisiana, Olin and Plug Power announced plans to produce green hydrogen from a 15-ton per day plant. CF Industries announced a $2 billion carbon capture ammonia complex in Ascension Parish, which will create more than 400 jobs. As I said, we have seen a lot of progress in the last few months. As we said at Analyst Day, fundamentals of our region uniquely position the Gulf Coast for substantial growth even in a challenging economy. This facility is being constructed near U.S. Steelâ\u0080\u0099s expansion in Osceola and it is expected to be completed in 2024, and U.S. Steel received the facilityâ\u0080\u0099s clean energy attributes. This illustrates how we work collaboratively with our customers and our regulators to support growth, jobs and sustainability in our region. In September, the Louisiana Commission approved four solar projects totaling 475 megawatts. They also approved our new Geaux Green tariff, which -- thatâ\u0080\u0099s G-E-A-U-X, Geaux, which began taking reservations from large commercial and industrial customers yesterday. The 365 megawatts allocated to the tariff were fully reserved in just a few minutes, indicating strong faster demand for sustainability products. Entergy Texas is seeking 2,000 megawatts of clean energy and Entergy Mississippi is seeking 500 megawatts. In addition to clean energy, resilience is important for our customers who depend more than ever on reliable electricity supply. Since Hurricane Ida, we have invested in new infrastructure built to higher standards that will improve the systemâ\u0080\u0099s resilience, including more than 22,000 distribution poles, more than 2,200 transmission structures and eight fuel stations. At Analyst Day, we laid out our $15 billion 10-year accelerated resilience plan. We expect our proposed investments to significantly reduce physical and financial storm risk, and we are engaging with stakeholders to make our case. We did our homework and the accelerated resilience plan is heavily informed by our neighbors in Florida, knowing that their hardened assets performed well and Hurricane Ian along with the strong performance of our own hardened infrastructure over the past couple of years gives us confidence that we can substantially reduce our exposure to storms and provide meaningful benefits to customers. As part of our recent customer affordability initiatives, we have helped more than 35,000 customers with more than $5 million in bill credits. Based on 2022 gas prices, these modern assets are reducing fuel cost by an estimated $400 million compared to what it would have otherwise been. Our nearly decade-long participation in MISO has also produced customer savings, which totaled more than $2 billion through 2021. Another lever for affordability is continuous improvement, which is more important than ever. Besides driving investments and growth for our owners, that industrial growth is important for our communities, especially in todayâ\u0080\u0099s economic environment. It starts with growing our clean energy capacity, which will reduce our customerâ\u0080\u0099s indirect emissions and continues through electrification of industrial processes to reduce their direct emissions. We are very excited about our near-term and long-term prospects, and we look forward to continuing this conversation with you at the EEI financial conference in a few weeks. While we wonâ\u0080\u0099t see him day-to-day, the impacts of his tireless dedication to our four key stakeholders remain. We raised diversity, inclusion and belonging as a strategic pillar. Without missing a beat, we navigated through the pandemic and storms of the last couple of years. As part of his distinguished career, Leo completed 74 earnings calls over the past 19 years and he has been a steady presence for our key stakeholders. We will work with him as Executive Chairman for the next several months, as we continue to make progress on the vision and strategy that he established. As I turn the call over a word about our new Chief Financial Officer, Kimberly Fontan. Most recently, Kimberly served as our Chief Accounting Officer and she also has senior leadership experience in operations and regulatory roles. Kimberly brings a broad experience and perspective, and sheâ\u0080\u0099s a great addition to Entergyâ\u0080\u0099s senior leadership team. Now I will turn the call over to our Chief Financial Officer, Kimberly Fontan. As Drew said, we have had another strong quarter, with results to keep us on track to meet our financial commitments. Summarized on slide three, our adjusted earnings were $2.84 per share. Consistent with comments on guidance last quarter, we are narrowing our guidance range by raising the bottom end $0.10. This result is consistent with our objective of steady, predictable earnings growth. On slide four, you will see the adjusted EPS drivers for the quarter, higher retail sales was the primary driver as last year was impacted by Hurricane Ida. Excluding weather, sales growth in the quarter was 5.7%. Power delivery expenses increased, including higher vegetation costs in part driven by inflation. Industrial commodity spreads continued to support positive margins and robust Gulf Coast operational levels, refining remains highly profitable with low product inventory supporting high operational rates, record commodity spreads continue to drive Gulf LNG exports to Europe today and expansion of this capacity in the future. Beyond supportive commodity spreads, the Gulf Coast region continues to offer industrial customerâ\u0080\u0099s inherent labor, infrastructure and global shipping advantages. And as we discussed at Analyst Day, this next wave of our industrial growth is being accelerated due to onshoring trends. These trends are caused by broken supply chain globally, manufacturers needing reduced geopolitical investment risk, as well as global customers who need energy security. The quarterâ\u0080\u0099s result is $993 million, a decline compared to last year. Key variances, including the timing of fuel and purchase power payments, the wind down of EWC and increased O&M, offset partially by higher utility customer receipts. Turning to credit and liquidity on slide nine, we continue to work towards achieving in range or better credit metrics by the end of 2023. We continue to monitor our deferred fuel position, and in the third quarter, our balance increased approximately $150 million. The forward curve for natural gas continues to decline, which helps with customer bills as well. Last quarter, we gave our early take on the impact of the inflation reduction add for our customers and for Entergyâ\u0080\u0099s cash and credit position. After additional analysis, we continue to be optimistic about the benefits from this legislation. We expect to see meaningful value for our customers, though, as you can see, the value is dependent on volatile commodity prices. To-date, of the $1.2 billion expected need through 2024, we have issued nearly $1.1 billion, most of which are equity forwards. Moving to slide 12, given the added clarity from 3 quarters of actuals, we are narrowing our adjusted EPS guidance range and affirming our long-term 6% to 8% growth outlook through 2025. For the full year, we once again raised our expectation on sales growth. While a positive for 2022 going forward, we will continue to plan conservatively for this customer group as electric demand from these customers varies. Our O&M estimate for the year reflects flex spending, including initiatives to improve customer call response time and the enhanced customer assistance programs that we have discussed. Actions like these help us ensure that we deliver steady, predictable adjusted EPS growth year in and year out. Additionally, we will discuss Entergyâ\u0080\u0099s long-term growth story, including our unique industrial growth opportunity, our accelerated resilience program, renewables expansion, IRA opportunities and our role in the hydrogen economy. Just want to start off with the 2,500 megawatts add in RFPs. But we do think that the IRA provides upside, as well as reducing the need for tax equity partnerships on that front. And just if I could ask about U.S. Gulf Coast industrial activity expansion, just wondering what cadence do you see for that growth as far as LNG export capacity and other factors? I think thatâ\u0080\u0099s a great question, Jeremy. In terms of jobs, it certainly will be helpful for jobs in our area and continue to allow our customer -- our residential and commercial customer bases to grow. Itâ\u0080\u0099s not as big as it was 30 years ago, honestly, because of the amount of automation and other things that are inherent in modern industrial facilities. The message we sent an Analyst Day around the back half of the decade, representing the lionâ\u0080\u0099s share of the growth, and even at Analyst Day, we showed what sectors we thought would populate that growth as well, tying in our industrial expansion with the electrification and ESG concerns of our customers. One moment for our next question. I guess how does sort of this inflationary environment kind of change your planning parameters versus the Analyst Day expectations, especially as we are looking to bridge into next year with a sort of a $0.30 band at the top and bottom end? The drivers for 2022 were really around our flex levers, which includes both pull-forwards and onetime items like the enhanced customer assistance program that we talked about earlier this year. The other impact from 2022 was inflation, as you noted, and we were able to cover that in 2022 through the increased weather and volume that we had in the first three quarters of the year. That said, we have included a level of inflation in our forecast for 2023 and we expect to meet our outlook as said, and we cover that with continuous improvement opportunities that we have been working on. As it relates to your interest rate question, I think, at Analyst Day, the outlook was about 5%, we -- or 5.25%. That said, our treasury team has done a lot of work over the last few years who would help mitigate exposure to potential rising interest rates by refinancing long-term debt in the periods of lower interest rates to help us offset in future periods. And Shar, I will just add one thing on that last piece. Kimberly mentioned that we are intending to exercise the equity forwards and then we have the securitizations, which we should be finishing up over the next several months. Those two things should alleviate some borrowing needs in the next near-term, I should say. And then just to ask, maybe just shifting to financing, I mean, obviously, your capital growth opportunities are increasing with resiliency, hardening, green tariffs, et cetera. I guess, how are you sort of thinking about more accretive ways to finance this growth in this current really challenging capital markets environment. I mean thereâ\u0080\u0099s been some press sort of highlighting that you could be looking to raise about $2 billion through a minority sale of your utilities combined into a holding company, excluding Texas. I know we had talked to you about the value difference between private capital and public capital markets, and to the extent that we can capitalize on that, and thereâ\u0080\u0099s a difference there, we would be compelled to do that. Figured this is Drewâ\u0080\u0099s first CEO call, I was going to try to put him on the spot. One moment for our next question. On the AMT, I just wanted to check, how much of an impact are you expecting once we reach 2026. And I was wondering in the interim over the next couple of years, just given that same slide, slide 10, we are currently seeing Henry Hub forward prices kind of in the 450 range or above over the next few years. As the slide indicates, we donâ\u0080\u0099t expect the corporate minimum tax until 2026. Thatâ\u0080\u0099s not being offset in 2024, 2025. If you think about how thatâ\u0080\u0099s being calculated, itâ\u0080\u0099s a 3-year historical average and then we can replace book with tax depreciation. That said, to your point on the graph on the right, we do think that we have significant opportunity on the nuclear PTCs. But those do start coming in, in 2023 and 2024 and so we would expect those to come in earlier than that corporate minimum tax. And we will work with our regulators to provide benefits to our customers, but also offset the effects of that corporate minimum tax when we do have exposure to that. The short answer is, the stakeholders in the State of Louisiana all have expressed an interest in resiliency. The commission in and of itself, obviously, is always going to be interested in how we pace it. And certainly, given the sensitivities around the current economic environment, how does this ultimately impact customer bills. But I think the -- as we stated in Drewâ\u0080\u0099s opening comments, itâ\u0080\u0099s very clear that the lessons that we learned from NextEra is also highlighting the work that we have been doing to get the alignment around the need for accelerated resiliency spending. Obviously, the decision is going to ultimately play out through the resi -- after the resiliency filing when the LPSC sets a procedural schedule. But the homework that we have done to-date all the way up to and including the most recent lessons learned from our friends in Florida, all informing our bullish point of view around the need to do this. We are not in a position to tell you in advance or to get ahead of our regulators, but we do believe we are making good progress on getting a line amongst our stakeholder group. One moment for our next question. I can share affirmatively that we are actively engaged with relevant stakeholders and trying to contact a settlement and find common ground and I can only report that, that work is ongoing, but nothing public. One moment for our next question. If you could just break down that, I believe itâ\u0080\u0099s $0.60 higher than the original guidance, basically how much is that acceleration versus more the inflation and kind of organic pieces of that? Thereâ\u0080\u0099s a number of both pull-forwards, as well as inflationary items. But from an inflation perspective, we are seeing that more in -- you see it in fuel, you see it in chemical type costs and then we see it on the capital side and less so in the labor market side. And then if you think about the flex side, we have long talked about flexing up when there are opportunities from whether in volume or other things that happen in the business and thatâ\u0080\u0099s really what you are seeing on the other side, opportunities to spend where we can support our customers and our stakeholders. I will add that the inflation effects, they are touching us. And so we are also seeing, what I would say, in commodity services area. So vegetation is a big area where we have seen inflation and so we have been ramping up, as you mentioned, our continuous improvement efforts to offset that, because the inflation piece doesnâ\u0080\u0099t go away easily and so there are continuous improvement efforts are ramping up to offset that over the next however long we need it. We certainly look at and watch to see -- try to stay under those caps so that we are both managing the affordability for customers, as well as obviously, creating value for all of our stakeholders. The specific number that we would file in Arkansas next year would still -- is still being developed, but it will certainly take into consideration of inflation. One moment for our next question. Thank you for taking my question, and again, congrats, not just to Drew and Kimberly, but obviously, Leo. One is your demand growth, especially on the C&I side has been really, really healthy, not just this year but last couple of years, and this quarter, we saw a turn in residential demand growth. We will add baseload generation, smaller units to the extent that they are needed to support reliability and ensure that we continue to meet the needs of our customers. But near-term, Orange County is the project thatâ\u0080\u0099s on the plan. And certainly, I think, Orange County is an example of how we would approach it with hydrogen capability defined, because of the long-term need to make a potential transition or a targeted transition, I should say, to clean energy where our customers are taking us. I think, Michael, in the near-term, we donâ\u0080\u0099t have a need for incremental capacity that can offset that. But certainly, if the demand -- the energy demand accelerates, then we would certainly need to look at that. And right now, I think, we are looking at sort of the back end of this decade is, where we start to see the need for additional capacity, either from storage in some form or perhaps natural gas converting to hydrogen over the long-term. And then one on related follow-up, can you -- lots of really positive things happening in Louisiana. Well, I think, we continue to work with the retail regulators around options to be -- to get more efficient recovery, particularly as we begin to ramp up things like resilience. In our resilience filing, you will see that we have a request for more contemporaneous cost recovery. I think Iâ\u0080\u0099d have to look specifically what it assumes, but it certainly assumes that we work constructively with our regulator in order to move us further up in that band. But we will need to get better mechanisms in order to hit all of the financial targets that we need to hit, particularly the credit metrics that we are targeting going forward. One moment for our next question. Congratulations on the official new roles, I guess, as of yesterday. Most of my questions have been asked, but just a couple for me. But there were parts of it, obviously, that didnâ\u0080\u0099t perform as well and thereâ\u0080\u0099s been some discussions, I guess, in Florida around undergrounding those portions of the system that are higher risk. And you wouldnâ\u0080\u0099t be surprised to hear us say, the conversation -- we expect the conversation to go towards cost benefit and risk reward. As you think about the location of where the risk of high winds versus high water shows up, itâ\u0080\u0099s different depending upon what portion of the region you are talking about. But in Louisiana, they are definitely taking into account the benefits of undergrounding, which historically has -- the benefit has been that the frequency of outages with underground facilities is lower. But when there is some type of disruption, the duration is longer, that is after you tend to overcome the initial upfront cost of undergrounding, which in our service territory has historically been cost prohibitive. Whatâ\u0080\u0099s different now, given some of the, I will call it, the positive recency bias with storm experience, we -- and certainly, some of the cost -- potential cost improvements and benefits of undergrounding, it is part of the conversation. But I know itâ\u0080\u0099s days, are you still seeing a lot of interest there, obviously, you touched on this a little bit, but what interest specifically are you seeing around maybe use of electric drives for future projects and putting renewable energy into those electric drives to the extent possible to sort of make the profileâ\u0080¦\n Yeah. We noted the recent earnings call for Energy Transfer on the Lake Charles LNG project where they are spending the gamut in consideration of the electric drives, gas compression, as well as a carbon capture. But across the landscape, we are seeing the expected acceleration of development of the LNG projects in the service territory. And we remain bullish as are our customers, notwithstanding the current economic environment. I think Drew alluded to some of the structural benefits or advantages that those customers have, and thatâ\u0080\u0099s continuing to show up, not just in the expansion, but also in the ESG components of the LNG expansion as well. And Ross, I will just add that, that theme around the LNG with electric drives and having a cleaner product, is not unique to LNG. We are seeing that in other industrial processes where folks that, particularly if you are putting in -- they are putting in new facilities, they are trying to electrify as much as possible. If anybody is putting anything new, whether itâ\u0080\u0099s in metals or LNG or petrochem or whatever, they are looking to see if they can electrify those industrial processes that normally, probably, would have been handled through fossil fuels. One moment for our next question. Just wanted to go back to SERI a little bit here, maybe from a different angle, itâ\u0080\u0099s now up to just three or four slides in your presentation. Certainly, the settlement, Rod, referenced the settlements that we have in Mississippi and we are in conversations with others to see if we can find a global event. Prior to the work that we are doing right now up at FERC and all the different proceedings that we have, w went -- I donâ\u0080\u0099t know, couple of decades without significant litigation around SERI. And I would expect that once we are through this, it will kind of go back to that natural state. But certainly a strategic alternative around with that is something that we consider, but we would not have an option around that until we get through the litigated settlement. And so if we are able to get through the litigation, then we could consider something like that, but thatâ\u0080\u0099s -- if we go back to a normal run rate, I donâ\u0080\u0099t think that would be the best option for us. So we will have to wait and see how this develops, but certainly, until we get through the current conversations up at the FERC, we wouldnâ\u0080\u0099t be able to go forward in any way on the strategic front. Also, as a reminder, we maintain a webpage as part of Entergyâ\u0080\u0099s Investor Relations website called Regulatory and Other Information, which provides key updates on -- of regulatory proceedings and important milestones on our strategic execution. While some of this information may be considered material information, you should not rely exclusively on this page for all relevant company information."
}