{
    "symbol": "ETR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 23:53:07",
    "content": " :\n 00:05 Thank you for standing by, and welcome to the Entergy Corporation's First Quarter 2022 Earnings Release and Teleconference. 00:24 I would now like to introduce your host for today's program, Bill Abler, Vice President, Investor Relations. We will begin today with comments from Entergy's Chairman and CEO, Leo Denault; and then Drew Marsh, our CFO will review results. In effort to accommodate everyone who ask questions, we request to each person ask no more than two question. 00:51 In today's call, management will make certain forward-looking statements. Actual results could differ materially from these forward-looking statements due to a number of factors, which are set forth in our earnings release, our slide presentation and our SEC filings. Reconciliations to the applicable GAAP measures are included in today's press release and slide presentation, both of which can be found on the Investor Relations section of our website. 01:24 Thank you, Bill and good morning, everyone. Today, we are reporting first quarter adjusted earnings of $1.32 per share, a very good start for the year. With favorable weather and higher-than-planned retail sales, we are ahead of schedule and solidly on track to achieve our 2022 objectives. During the quarter, we continued to execute on both our near and long-term deliverables, just as we have over the last several years. We've made demonstrable progress on our operational, strategic and financial objectives. 02:03 Operationally, I'll start with some notable regulatory updates. Texas is done and Louisiana's securitization proceeds from the 2020 storms, plus $1 billion towards IDA will be completed in the coming weeks. Entergy Louisiana's filing for the balance of IDA will be completed within the coming days, and the Entergy New Orleans filing will follow later this year. 02:44 As expected, Entergy Mississippi filed its annual formula rate plan which enables continued customer-centric investment and supports our financial outlooks. We're continuing to drive progress on enhancing the resilience of our system, which benefits customers that supports local economic activity as well as our growth plan. This $86 million project replaced approximately 80 structures to increase resilience along several miles of critical path transmission in La Pouch Paris, an area that was severely affected by Hurricane Ida last year. Entergy Louisiana also completed a $100 million project in North Louisiana, that positions the region for economic growth. The West Monroe project will provide additional transition capacity, improve reliability and is built to withstand extreme weather events. What that means for customers is enhanced reliability and resilience, better integration of clean generating resources and economic benefits to improved access to lower cost of power. Bottom line, the Entergy team continues to focus on delivering operational excellence across all facets of our business. 04:15 Strategically, I'll start with our merchant business wind down. The Palisades team is fishing strong, and I would like to thank them for their dedicated service. 04:50 As you know, DOE recently announced a program to save nuclear plants that are about to shut down. However, we are five years into Palisades shutdown process. That said, alongside Holtec, we will work with any qualified party that wants to explore acquiring the plant and obtaining federal funding. 05:29 But I do want to be very clear, this does not change our strategy. Entergy is exiting the merchant nuclear business, even if Palisades continues to operate as a part of Entergy. Across all of our operating companies, we continue to be a critical partner to support strong economic development, bringing new businesses, new jobs and new tax base in the communities we serve. For example, Entergy Arkansas, along with the Wynne Economic Development Corporation announced completion of the select site certification for a 37-acre industrial site. 06:17 Over the past five years, our economic development team has helped bring to provision close to 300 announced projects, $42 billion of capital investments, and more than 25,000 jobs. 06:50 As we have discussed, growth from our industrial customers has been driven in large part by cost, labor, logistics and regulatory advantages of the Gulf Coast as well as favorable commodity spreads, which continue to support expansion. Further, the current geopolitical state of the world makes the U.S. and the Gulf Coast in particular, a top choice for stability. This opportunity represents a win for our customers, communities and owners, not to mention the community. As of today, we have approximately 650 megawatts of renewable capacity in service. 625 megawatts of solar projects approved by regulators , 725 megawatts of announced projects and up to 4,000 megawatts of RFPs. That's more than half of the 11,000 megawatts of renewable resources in our supply plan through 2030. Since our last call, Entergy Texas concluded evaluations of its 2021 solar RFP. Entergy Arkansas recently issued its RFP seeking up to 500 megawatts of renewables to provide cost-effective clean energy, which furthers fuel diversity. Entergy Louisiana also issued notice to proceed with renewable RFP seeking up to 1,500 megawatts in Louisiana. Our customers' demand for decarbonization solutions, including green products is not slowing down. However, we fully recognize the near-term cost and schedule pressures that solar projects are facing. 09:25 Supply chain constraints have been exacerbated by the Department of Commerce investigation, which we expect will drive additional delays and the potential for further cost increases. These dynamics are affecting the entire U.S. solar industry, but we are continuing to work through these constraints and are executing on our solar expansion plans. For example, Sunflower solar in Mississippi are roughly up  online this year as its panels on site installation is nearly complete. A greater portion of our own projects are expected in the latter half of the decade, which would be past the current working insurance. As we've said before, we have a large backlog of customer-centric investments with the ability to rotate capital into our plan as an opening presents itself. The bottom line is that we recognize the near and medium-term constraints, still see strong market fundamentals in the long term supports our supply demand and customer objectives. 10:47 On our last call, we told you about the new U.S. Steel expansion. In support of this project and the customers' decarbonization goals, Entergy Arkansas filed for approval to acquire the 250 megawatt driver solar facility. It also highlights our unique growth strategy to help customers achieve the outcomes they desire, which in turn drives the outcomes for all Entergy’s stakeholders through more jobs and economic activity in our service area, increased capital deployment to support electrification, low growth to offset costs and higher rate of change towards societal decarbonization. We continue to see examples in the industry that reinforce the need to balance reliability, supportability, environmental sustainability. To put that into context, that's about 25% of our 2021 total  savings. That's not to say that we capture the entire market, but we're working how to serve our customers' needs and maximize this opportunity. With many carbon reduction goals coming past 2030, achieve greater opportunities beyond the next 10 years. Financially, we continue to strengthen our balance sheet. Beyond the securitization progress that I mentioned, also significantly reduced our remaining  through 2020. Currently, only 25% of the original amount discussed at our 2020  remains. We are on track to achieve steady predictable growth adjusted EPS in dividends, the opportunity to do even better. That includes our plans to quickly advance resilient investment in our coastal region to lower storm risk for our system, our communities and our customers. 14:13 As I said, we've had a productive start to 2022, and we will continue to successfully achieve the milestones that keep us on track to deliver steady, predictable earnings and dividend growth while maximizing operating efficiencies and investments to make our system most resilient, reliable, clean and affordable it can be. 14:41 Before I conclude, I encourage you to see our recently released 2021 integrated report, \"The Future is on\". The report lays out how we delivered results in 2021, discusses why we're optimistic and excited about Entergy's future. Today, we are reporting strong results for the first quarter. As you can see on Slide 3, we had adjusted earnings of $1.32 per share. 15:37 Turning to Slide 4, you'll see the drivers for the quarter. As a result of our continued customer-centric investments, we saw higher levels of revenue as well as higher depreciation and interest expenses. As Leo mentioned, we expect to complete our exit of the merchant nuclear business in the coming months. Higher utility revenue, lower fuel and purchase power payments and lower pension contributions were the largest drivers. As a reminder, fuel and purchase power payments were significantly impacted by winter storm Uri in 2021. Non-capital storm spending was higher than last year, which provided a partial offset. To that end, Entergy Texas recently completed securitization for its 2020 storms. And on the day of our last call, the LPSC approved storm recovery and financing for the 2020 storm plus $1 million down payment on Hurricane Ida. Louisiana securitization is expected to be off balance sheet, and we anticipate a $3.2 billion issuance in the coming weeks. Entergy Louisiana plans to file for Ida cost recovery in the coming days, as Leo mentioned, we are targeting to receive proceeds by year-end. If approved, this reserve would enhance credit and ability to respond to potential future storms. In addition, ENO plans to file for Ida cost recovery later this year. Our net liquidity at the end of the quarter was $3.5 billion, being further supported by the tax securitization proceeds received on April 1, and the $3.2 billion Louisiana securitization proceeds once they are received. 18:33 Beyond securitization and liquidity, we continue to focus on resilience, which we will discuss in detail at our Analyst Day. And that time, we have reduced our equity needs by nearly $170 million through our ATM program, with roughly $570 million remaining to be executed between now and the end of 2024. Given the small amount, our plan is to close out the remaining days with the ATM program. 19:43 Looking forward to Slide 10, we have a solid base plan with good visibility to achieve our guidance and outlook. We did not see a meaningful impact on our operational results, and we remain on track to achieve our annual cost estimate. As a result, we are affirming our 2022 adjusted EPS guidance range as well as our longer-term outlook. 20:13 As we move towards Analyst Day in New York, in June, we're executing on our operational, strategic and financial objectives and building on a solid foundation. In New York, we'll share our longer-term views on customer-centric investments and financial outlooks. I'm nearly not going to, Shar, get into any kind of details about what would or wouldn't work. The technical details, though, around operations, the plant will have to stop operating in May because we'll be out of fuel. And we really haven't done the investigation into what that work would be because as you might guess, we have been planning for five years to shut the plant down. We do have an agreement with Holtec and obviously, that has certain features in it that by and large, have all been -- all the conditions have been met, except for the plant is still operating. 22:27 And as I said, we couldn't be more supportive of the fact that continuing operation of the country's nuclear fleet is important, the reliability of the bulk electric system and to the ability for us to decarbonize the economy, shutting those plants down is just moving backwards. So in terms of opportunities out there that could continue to change or improve around our credit metrics, obviously. The one that we cited, I think, last -- at the end of last year, I guess, on the last call, was around pension. And certainly, interest rates are changing that pension liability. That is something that we are watching closely, if rates continue to stay high and returns turn come back around to -- closer to our expectations, then it could create some more headroom in our credit metric. That's probably the one that we are looking at most closely right now, so we're monitoring that. 24:44 In terms of, obviously, we need to get the securitizations done. Outside of that, our expectations around capital, which obviously also drives our equity needs. But we have other capital projects that are waiting in the wings, particularly around resilience. So if there is extra headroom for us because of delays in solar, there's quite a bit of resilience investments that our customers are waiting on and expect us to achieve if there's an opportunity. And then just one quick follow-up, if I may, and I appreciate that. I know -- I mean, obviously, you guys talked about resiliency and sort of the green tariffs. Just given the timing of sort of the regulatory initiatives and the technical conferences, I know you obviously highlighted how they would fit in with the Analyst Day. 26:28 Well, I think, Shar, we're going to let the punch lines of Analyst Day show up on Analyst Day. From Leo's comments, the near-term risk that we were referring to in terms of existing owned projects was roughly 280 megawatts because we we’re discrete about both -- we're explicit about both West Memphis and Walnut Bend. And so from a megawatt standpoint, they really don't represent a material amount of capacity. And recall, Leo also mentioned the lion's share of our renewable capacity actually shows up on the back end of the decade. So we're calling it out because we recognize that there are some near-term constraints, but they really don't influence, how we're thinking about our build-out. 28:28 And I think to your last point, Nick, I think Drew mentioned it and I mentioned in the script, we've got a capital plan and timing that's laid out. And can you just kind of talk about just the current state of power markets, how you're kind of managing customer bill impacts and the ability to just continue to extend your rate base growth here, perhaps any levers that makes your jurisdiction more unique than others, that would be helpful. So the way you phrase it was an interesting way to think about it, in terms of putting pressure on the plan. And in resilience, we think that inflation will actually strengthen the economic case from a customer's perspective to get those things done. Certainly, when you talk about renewables and higher gas prices, there's more economic headroom there right now. So those things are helpful already, but we think it will accelerate our plan around renewables. 30:36 And then, of course, around resilience, a key piece of the plan is the costs associated with putting up hardened lines, distribution lines, transmission lines prior to a storm compared to the cost associated with doing it after the storm. And to the extent that there is inflation, that's going to exacerbate that difference, which is already substantial, and accelerate the need for customers to do it ahead of time in a planful way. And so obviously, those things have an impact on the customer bill, but the alternative of not doing it is an even greater impact on the customer bill. So I think it will drive customers who want to accelerate our plan, which will include renewables and resilience investment. Just want to come back to DOC a little bit more, if I could. And for 2023 projects, if you could just break down price risk versus timing risk. 32:10 Price risk -- ask the question again, so I want to make sure Drew and I are trying to figure out who's going to answer what part of the question because I know that was a price risk question in there as well. 32:28 So the -- on the projects that we just referenced that being Sunflower, for instance. We're expecting that one, as Leo alluded to, to be in service sometime in August. The other ongoing projects that we are expecting a bit of delay of the ones I referenced earlier, West Memphis and Walnut Bend. We're working with our BOT partners, both of whom are reputable firms, to lock down both price and schedule certainty. But beyond that, we'll see if Drew adds anything to that. 33:23 Well, I think the only thing I'll add to what Rod said is that -- and actually, Rod mentioned earlier, the bulk of our expectations are beyond kind of the next two year window. And we've issued RFPs, the DOC piece accepted. And they are -- prior to the DOC action, they were already aware of tariff activity in that space. I mean, I think most of the folks that we've been engaging with would talk about by the end of the year. But even if it goes a little bit longer, we don't think that, that puts our overall expectations in jeopardy. And certainly, in the near term, as I mentioned earlier, there are plenty of other things. If projects are delayed, there are plenty other things for us to accelerate forward and meet other customer expectations. And just kind of pivoting a bit here to nuclear and really small modular reactors, just want to know your thoughts on, I guess, how this could unfold going forward. When you think about the ability to build cost competitive, carbon-free, smaller projects that aren't -- the issue, for example, we have with the size of the capital budgets of the existing technologies is that they're as big as the companies that fund them. So we're very excited about that opportunity, when and how it fits itself into our needs, we're continuing to monitor and it's a little bit difficult to say. But certainly, I think we should all be -- room for that technology to take root. 36:31 We are spending, I know probably more of our efforts in the hydrogen space because of the unique position that we have in the hydrogen market with producers, consumers, stores, transported all in the heart of our service territory. It's very helpful, I leave it there. Good morning, guys and Drew long time no see. So the answer is the total cost estimate for that storm is still at $2.7 billion in total, $1 billion of that is in the first securitization we expect to price in the next few weeks. We still be -- just to clarify, we have to get approval for the full amount to get cost recovery for the full amount. So essentially, you'll be seeking approval for the full $2.7 billion and the $1 billion that you've gotten already will be applied towards it. Thank you very much. If I can, just to focus on the first quarter and some of the dynamics here. You had specifically identified at the start of this year, a number of very large customers. But I have to imagine, based on your comments already that there are actually several other larger customers that you're talking to. I'll take the first part, and I'll turn the second part over to Rod. And so certainly, in terms of the sales expectations, we did have higher-than-anticipated industrial sales in the quarter. In fact, I would say, compared to our expectations, obviously, refiners, seeing very high crack spreads performed well. We did have some unplanned outages in some of the chemical and petrochemical space, which pulled us down a bit. And then there are unplanned outages for our Cogent customers, and that actually lifted us back up. So that Cogent piece was actually fairly strong, where there were a number of outages that helped lift is back up. 40:33 I would say that the other part, the unplanned outages for our regular customers, that was fairly significant too. So I mean, all in all, it's probably about what we were expecting but a little bit higher. And as we sort of go through the balance of the year, and I showed you the statistics on one of the slides or some of our key industries, we do expect them to continue to run at high utilization rates. Aside from planned or unplanned outages, they're going to try and trim those off as much as they can to run as hard as they can, given the current commodity environment. 41:10 And I will also say LNG wasn't on that page, but LNG utilization rates are extremely high as well. So I'll turn it over to Rod to talk about other...\n 41:22 I was only going to elaborate on the LNG piece, and I'm not going to, Leo's point, give any pouch lines around Analyst Day because we'll give our point of view on our five-year outlook. But we are seeing greater interest in signing offtake contracts, which would support our view on expansion in the LNG space. We'll leave it to our customers to lead that conversation, but we'll note empirically that 85% of the projects are under FID consideration in the LNG space are in Entergy service territory. And our ability to serve their expansions in addition to their -- helping them meet their ESG objectives remains a growth opportunity for us for us, and we still remain bullish about it. I'm sure you guys have seen the headlines in Florida, but also in Louisiana itself, especially as it relates to catastrophic storms. I mean I was thinking about insurance specifically, obviously, a broader backdrop here, but insurance seems to be getting headlines here outside of the utility space of very late. Just like everybody else, we have seen broad insurance premium pressure. And so we are working through that regardless of whether it's property or general liability or what have you, et cetera. But that's, as you said, it's sort of symptomatic of a broader perspective around inflation. I think long term, that is a commodity which cycles, and we expect the wild  spirit that's out there and the oil patch to take over at some point and help bring prices back down again. 44:13 As far as sort of inflation in the capital space, we talked about that a little bit with solar, we're seeing it in other materials and some of our other capital projects. But I think the thing to keep in mind on that is, we're seeing it for our current marginal capital projects, but they're being added to a much larger rate base, which is already invested in and fixed. Certainly, as I mentioned, the fuel piece is something we're paying close attention to. And as far as just other operating costs, we haven't seen much pressure as of late. But we're certainly mindful of that, and we are driving our continuous improvement efforts to make sure that we stay ahead of that on an ongoing basis. I think going back to last year, you talked about kind of having discussions with key stakeholders and the like. We have just completed the analytics around the risk scenarios, probably consequence of storms. And so the feedback loop is just beginning, and we'll have more color around it at Analyst Day. And there's a keen interest in understanding, one, what's our point of view around the risk and the benefits of acceleration. Obviously, in the current economic environment, most of the stakeholders, customers and regulators and others alike are always going to be interested in how we think through the cost and bill impact. 47:29 And so we're beginning, but I'm expecting a very active engagement from the stakeholders as we move through New Orleans. Certainly, Louisiana in route to what we believe to be our first formal filings in that July time frame for the City of New Orleans. And then the state of Louisiana certainly around that time frame, but not just likely later. Even in Texas, Steve, we have -- we've begun dropping ideas around how they ought to think about resiliency. They -- certainly, their point of view might be a little different in terms of the sense of urgency that you alluded to than say, Louisiana and New Orleans. But we certainly have their attention, especially given the role of our Texas service territory in the industrial growth space. But short answer is we're just beginning, but more to say about it at Analyst Day, Steve. So it sounds like at the very least, you'll have better data scenarios for the Analyst Day of what different options are. And obviously, the results will be over time, depending on what customers states want. One question, just -- can you give us a little bit of a sense, you've alluded to being conscious of commodity and gas prices and obviously, take your points about the longer-term benefits of some of your investment plans. The one that you're probably most interested in, of course, is Louisiana and the securitization costs associated with that. It will depend on what the final pricing is of those securitization bonds, but somewhere in the neighborhood of about 10% once all those securitization costs are into bills. So obviously, our customers are expecting that. 50:36 The gas price piece -- that reflects -- it depends on the jurisdiction, but it generally gets into bills fairly quickly in Louisiana, Texas, New Orleans. There is a little bit of hedging that goes on in Mississippi and Louisiana can help that, but it's pretty small. Nevertheless, we're continuing to work through it, the continuous improvement program that we have as part of that. And then over time, I think gas prices are a little bit above where our previous expectations were, but they're still in a manageable range. And as we said and as you were alluding to, Jonathan, the investments that we intend to make should help with gas price risk and inflation risk on a longer-term basis. 52:08 On 2022, yeah, it's going to be a portion of what I was explaining earlier because it's not always the overall securitization costs. I think a general rule of thumb around there is about $1 per MMBtu is about a 3% to 4% increase in gas prices, if that's sustained over a year. Of course, we haven't seen that yet, but that would be kind of the thought there. I know that other taxes piece, you said would be kind of more front-end loaded. So in terms of O&M, I think in the first quarter, you're talking to the timing elements. And in terms of the interest expense element, we are seeing some interest expense that's a little bit higher than we would expect to stick as we go through the course of the year. It actually is going to be building over the balance of the year, but there are some timing elements in the first quarter that will turn around. With residential demand trailing off as our residential customers are going back to work, school and kind of a pre-COVID life. So from our vantage point, we're actually tracking according to plan there with a little bit of robustness in the C&I space, but that's about it. There's a big chunk of distribution costs and that is going to go mostly to residential and commercial customers, not as much on industrial customers. So the $5 billion to $15 billion, that isn't over the next three years, that goes out through 2030. And it's really an acceleration of work that we could do over time based on the fact that we might take things that are working today, but are old standard and pull them down and put up something of a new standard. 58:16 So one way to think about it, Ross, would be if you were going to spend $10 billion, and then all of a sudden, you got $1 billion worth of federal funding, we may spend $11 million, would be one option to be able to -- and you get it for effectively $11 billion worth of resilience for $10 billion number. And then maybe longer-term, as you get to the credit metrics you need on the balance sheet you want on the balance sheet. As you execute some of these opportunities and maybe grow rate base faster than that in the long term, but there might be an equity need attached to the capital. The expansion of our industrial base is a growth opportunity, just the growth that we're seeing, as we've talked about, the utilization rates are high, inventories are low, all the commodity spreads are in the right place. 60:31 And then the electrification side of things where they're going to take existing load or existing processes that are not electrified and electrify them, and that creates load growth. I would say at a minimum, that just makes the runway pretty long for us in terms of where we are with the current outlook. The growth in sales, the growth in investment, and the growth in financing needs and balance all that out in a way that creates a different trajectory for us going forward. So I think all of those combined certainly bode well for a continuation of the growth that we've seen and demonstrated over the course of the last several years, pretty much like clockwork. 62:05 Thank you, Jonathan and thanks to everyone for participating this morning. Our quarterly report on Form 10-Q is due to the SEC on May 5, and provides more details and disclosures about our financial statements. Also, as a reminder, we maintain a web page as part of Entergy's Investor Relations website called Regulatory and Other Information, which provides key updates of regulatory proceedings and important milestones on our strategic execution. While some of this information may be considered material information, you should not rely exclusively on this page for all relevant company information. Thank you very much. 62:55 Thank you, ladies and gentlemen for your participation in today's conference."
}