{
    "symbol": "LMB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 14:38:16",
    "content": " Third quarter ODR sales of $62.8 million were up 40.1% from last year's third quarter, resulting in ODR segment backlog of $124.5 at September 30, up 4.4% from $119.3 million the end of the second quarter, and up 27% from December 31. The operations of the business generated cash and we've experienced continued improvement in our cash collections and net overbill position, primarily due to the resolution of a claim settlement in Q3 of 2022, which provided $5.9 million in cash, in addition to the cash generated from operating the business. Sales of ODR pricing and T&M were again particularly strong, with product sales up almost 40% year-over-year, and T&M sales up almost 50% year-over-year As of September 30th, ODR segment backlog was $124.5 million, up 4.4% from $119.3 million at the end of the second quarter, and up 27% from December 31. And we keep looking for the better customers out there, we're actually directing our sales teams to be laser focused on what's the potential of the owner, like where could it go, clearly, Fortune 100 companies, there's tremendous opportunity. But dedicating resource and specifically account manager dedicated to that really makes the initial push, I would say, we've got to gain trust, we're looking for long term relationships, those customers, once we maintain trust, then they're starting to discuss to us once we prove confidence in the overall look of their business, and that's where we can provide our solutions to a more of a holistic infrastructure look, what we believe differentiates us is we're focused on accounts, not opportunities, we're focused on solution not fitting. I'm just saying that the middle of the range, the guidance would be like $8.5 million or so which is well below -- which is below the just reported quarter and below last year's fourth quarter, which I think was $9.5 million and yet the revenues are going to be much higher than both of those quarters."
}