{
    "symbol": "CRUS",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-02 20:59:11",
    "content": " As youâ\u0080\u0099ve seen in the press release, Cirrus Logic delivered record revenue this quarter with sales of $590.6 million driven by products shipping and smartphones. And this means that in contrast to many components in the consumer smartphone market, we can anticipate multiple years of sales at high volumes from our next-generation audio products, providing the company with sustained revenue contribution, excellent long-term visibility and the opportunity to redeploy our highly skilled engineering teams on to innovations that target other products and markets. Your line is now open. Obviously, the results in the December quarter, really strong, and I think the guidance is sort of in line on a revenue basis for March, but thatâ\u0080\u0099s down, I donâ\u0080\u0099t know, 25%, give or take, on a sequential basis, which is maybe a bit more than typical seasonality or maybe you could just clarify what typical seasonality might be at this point in the cycle. And Iâ\u0080\u0099m just trying to put those two things together in terms of how â\u0080\u0093 the current generation of those products has been shipping for a while, and youâ\u0080\u0099re going to have new generations coming, so how are you thinking about the potential for ASP resets or content expansion in dollar terms as those products launch generally, understanding you canâ\u0080\u0099t be super specific given the customer. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Yes, so, I think John mentioned this earlier Ananda which is essentially the signals that we got from our customer as we shipped into the December quarter, would suggest that there was significant demand for the products and the overall performance for the December quarter shows that we were benefiting from the smartphone unit volumes."
}