{
    "symbol": "BLBD",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-08 21:31:10",
    "content": " Our units sold were nearly 2,000 which drove a record first quarter revenue for Blue Bird, up over $100 million from fiscal year 2022. As a result, adjusted free cash flow for the quarter was up $54 million compared to the first quarter of fiscal year 2022. Overall, it is an incredibly solid first quarter for Blue Bird with the legacy priced units being the main thing holding us back on the EBITDA conversion which was negative $4 million. Consolidated net revenue of $236 million was also a record for Q1 and $107 million or over 80% higher than prior year, driven by higher units, improved mix of electric buses, and pricing actions that are starting to take hold. Breaking down the $236 million in revenues into our two business segments, the bus net revenue was $213 million, up by approximately $100 million versus prior year. In fiscal 2023 Q1, adjusted net income was negative $10 million or $8 million lower than last year. However, if you raise that fiscal year 2021 orders just to fiscal 2022 pricing level or 5% that would have generated approximately $10 million more as reflected on the chart. It is also worth noting, if we assume all bookings at current fiscal 2023 pricing at the 25% level plus an additional 10% in throughput, we would see an additional $15 million positive impact and this is how we are viewing the fourth fiscal quarter of this year. Finally in fiscal year 2023 Q4, with higher volume increased EV mix, best pricing and lower material costs, we expect to generate $265 million to $285 million in revenues, with adjusted EBITDA of approximately $20 million plus/minus $2 million. This represents a run rate of $80 million, or approximately 8% going out of the fiscal year 2023 and set us up for taking it to the next level in fiscal 2024 and beyond. Putting it all together for the total year, we expect revenues in excess of $1 billion and an increased adjusted EBITDA of approximately $43 million, with a range of $40 million to $46 million. In summary, we are forecasting a significant improvement year-over-year in all aspects with revenues up more than 25% to over $1 billion, adjusted EBITDA in the range of $40 million to $46 million and positive free cash flow of $5 million to $11 million. Once the supply chain further normalizes, we expect to sell approximately 9,500 units including 1,500 unit EVs, and generate $100 million or 8% adjusted EBITDA on approximately $1.25 billion in revenues. Looking beyond that in the medium-term our EV growth and operational improvement can support volumes of 10,500 to 11,000 units including EVs in the range of 2,500 to 3,500 units generating revenues of $1.5 billion to $1.75 billion, with adjusted EBITDA of $150 million to $200 million or 10% to 11%. Our long-term target remains to drive profitable growth towards $2 billion in revenues comprising of 12,000 units, of which 5000 revs and generate EBITDA of approximately $250 million or 12%. We now expect the EBITDA performance to be approximately $43 million, up nearly fourfold compared to fiscal year 2022. However, as we've shown in our outlook on Page 20 in our presentation in the short-term for a normal year, we expect to have about $100 million plus of EBITDA with 8% on roughly 9,500 units with a good mix of EVs."
}