{
    "symbol": "WCC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 15:50:08",
    "content": " We are carrying very strong positive momentum into 2023 and I am confident that this year will be another transformational year, with advances in our digital capabilities, above-market growth, continued margin expansion and record free cash flow generation that supports our capital allocation priorities. Preliminary reported January results are encouraging, with sales up approximately 17% year-over-year, including the impact of a stronger dollar, which is expected to negatively impact first quarter sales growth by about 2 points and the Rahi acquisition providing about a 3-point benefit. Gross margin was a fourth quarter record at 21.9%, up 110 basis points versus the prior year and down 20 basis points sequentially. Adjusted EBITDA, which excludes merger related and integration costs, stock-based compensation and other net adjustments was another fourth quarter record and 41% higher than the prior year. Organic sales increased 14% versus the prior year, including a 6% benefit from price in the quarter, along with volume growth in our markets. For the full year, sales reached a record $21.4 billion or up 18% organically compared to 2021, including double-digit growth in each of our strategic business units. Profitability was also strong, with record adjusted EBITDA and adjusted EBITDA margin of 9.6%, 130 basis points higher than the prior year driven by operating leverage, integration cost synergies and the execution of our margin improvement initiatives. Record sales in our UBS segment were up 22% versus the prior year on an organic basis in the quarter, marking the fifth consecutive quarter of organic growth above 20%. Profitability was also strong with an adjusted EBITDA margin of 11.4%, 180 basis points higher than the prior year, driven by our gross margin improvement initiatives, operating leverage and integration cost synergies. For the full year, you can see that working capital was a use of cash in 2022, driven by our strategic investment in inventory in response to global supply chain shortages and increases in receivables due to our exceptionally high level of sales growth. This outlook reflects our expectation that 2023 will be the third consecutive year of record results, with record sales, gross and EBITDA margins and record free cash flow and is consistent with the long-term financial framework we presented at our Investor Day in September of last year. So we are not -- I think the normalization -- the short answer to the normalization question is, you will see that as we move through the year, but I think what you will see and what is outlined in our outlook fundamentally is strong market outperformance and itâ\u0080\u0099s driven by the execution of our initiatives, the tremendous cross-sell, which were taken up again and these secular growth trends that we think fundamentally have shifted the company to a secular growth company. So let me start by providing the historical context of generally, in a normal demand environment, we would see our free cash flow generation split 30% first half, 70% the second half, 40% of that free cash flow generation in a year typically occurred in the fourth quarter primarily because we would see the sequential decline in sales, we would then release both accounts receivable and inventory."
}