{
    "symbol": "MRNS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 22:04:10",
    "content": " We received over 40 completed CDKL5 deficiency disorder prescription enrollment forms in the fourth quarter of 2022 and over 90 total completed CDD prescription enrollment forms for the fiscal year ended December 31, 2022, inclusive of clinical trial patient transitions and naive commercial patients. In addition to the strong commercial progress, we've made in 2022, we continued to generate consistent and compelling data that highlighted the potential of ganaxoloneâ\u0080\u0099s differentiated mechanism of action and its safety and efficacy profile to benefit patients, including two-year open label extension data in CDKL5 deficiency disorder. Moving to our Phase 3 TrustTSC trial in tuberous sclerosis complex, we're pleased to share that we are actively screening and enrolling patients, targeting 90 clinical sites predominantly in the U.S., and Europe with additional site activations expected in Canada, Australia and China. As a reminder, based on previous conversations with the FDA, we expect that a positive RAISE study will be sufficient for filing in the U.S. We're currently working with the FDA to determine what information would be required to support the inclusion of patients below the age of 12 in our studies, which could expand the pool of eligible patients and further support enrollment. Let's assume we -- on day one, we choose to do an interim analysis at day 60 when the DSMB comes back to the company, we might have enrolled five, 10, 15 or 20 more patients and that would be critical to evaluate that double blind portion of the study with the final FDA filing. And that is going to, I think, increase the sensitivity to detect a treatment difference on that second endpoint and get us patients again that are consistent in terms of their severity, but also as I mentioned mirror the patients in the Phase 2 study. And as Joe said, that's why we're seeing in the Phase 3, I think the critical piece that we're spending our energy on is really making sure that these protocol amendments still lead to patients whose next step would be general anesthesia. So, thanks for the question. So, thanks for the question."
}