{
    "symbol": "BASE",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-08 02:02:04",
    "content": " Good afternoon, and welcome to Couchbase's third quarter 2022, earnings call. With me are Couchbase 's President and CEO, Matt Cain; and CFO, Greg Henry. Today's call will contain forward-looking statements, which include statements concerning financial and business trends and strategies or expected future business and financial performance and financial condition, and our guidance for future periods. Forward-looking statements, by their nature, address matters that are subject to risks and uncertainties that could cause actual results to differ materially from expectations. For a discussion of material risks and other important factors that could affect our actual results, please refer to the risks discussed in today's press release, our quarterly report on Form 10-Q for the quarter ended July 31st, 2021, our quarterly report on Form 10-Q for the quarter ended October 31st, 2021, to be filed with the SEC and other periodic filings with the SEC. During today's call, Greg and I will provide details on our third quarter results, as well as our fourth quarter and full year guidance. Our third quarter revenue was $30.8 million, growing 20% year-over-year. Total annual recurring revenue, or ARR, was $122.3 million, which was up 21% year-over-year. In our core business, we saw ongoing big deal momentum, robust renewal activity, some significant expansions, and delivered accelerating year-over-year revenue and ARR growth ahead of our guidance. We also saw several COVID -impacted customers return to growth and we're cautiously optimistic that others will follow, which would add a tailwind behind our accelerating ARR growth. But perhaps most importantly, we are seeing momentum in our cloud business, bolstered by positive reception and very strong initial uptake of our recently announced posted Database as a Service offering, Capella, which I'll discuss more in a moment. Overall, our strong fiscal third quarter performance demonstrates how enterprises are turning to and investing in Couchbase, as a key technology partner, supporting their digital transformation initiatives. Looking ahead, we're set up for what we believe will be a great fiscal fourth quarter and a landmark year for the Company in fiscal 2023. At Couchbase, our mission is to empower enterprises with the ability to build, deploy, and maintain their mission-critical applications by delivering the world's most scalable, highest-performing, and flexible modern databases. Enterprises are choosing to build their most important applications on Couchbase because we offer the scalability, flexibility, and ease of adoption necessary to accommodate the incessant growth in data volume and variety that is at the core of digital transformation. We also provide developers the tools they need to build software in a modern, agile, and elegant way, and we do this for both new applications and existing ones that need to be re-platformed. Simply put, I remained confident that we have the opportunity to drive a generational rethink in the $60 billion database market. Turning to some of the developments in the quarter, in October, we held our annual user conference Couchbase ConnectONLINE, with the theme of Modernize Now, which underscores the need for organizations to become more flexible and increase developer agility to expedite modern application initiatives. We saw over 5,200 registrations, and we educated customers and prospects about our modern database across more than a 100 sessions. Of course, the big news at Connect, was our introduction of Couchbase Capella. Our new fully hosted Database as a Service Offering, that delivers database flexibility and ease of adoption for developers, and performance at scale for enterprise applications with the best price performance of any Database as a Service. Capella is available as a free trial for developers, enabling them to get up and running with Couchbase with just a few clicks in a matter of minutes. And now with Capella, which is fully managed and automated, customers can focus exclusively on agile development of their most important applications, instead of worrying about operational database management efforts. Though it is still early days for Capella, the feedback from customers has been overwhelmingly positive. More specifically, we had more than doubled the number of clusters deployed in the first month of Capella, than we did in the previous 3 quarters. This is the activity we would hope to see, further reinforcing our confidence that this new offering will be a major growth driver for Couchbase, and will greatly accelerate developer adoption. Of note, the partner sourced to an influenced new business for the first three quarters of FY2022 has already surpassed that of all our previous fiscal year. Beyond launching Capella on AWS with support from AWS satisfactory team, we were invited to 2 new select go-to-market programs and qualified for multiple designations and integrations with AWS offerings. Now, I would like to spend a few minutes discussing some customer wins in the quarter and how enterprises are leveraging the power of Couchbase to transform their business. A new G2K logo in Q3, Amgen Technologies, a leading insurance Company in France, began its modernization journey by selecting Couchbase over another NoSQL solution to replace Oracle and Postgres to power their data hub. Another new win from the quarter, which was also our largest Capella deal to date, was with a leading financial services provider that empowers billions of people and millions of merchants to buy and sell online, across many emerging global markets. Also in the quarter, Domino's Pizza significantly expanded with Couchbase. Domino's will be using Couchbase for real time point-of-purchase, customer segmentation, and behavior analytics, to determine customer lifetime value and to deliver personalized marketing campaigns. They were also able to take things that they already knew about their customers and then combine that with the new information to take action in hours, versus weeks or month, as was previously the case. Once customers adopt our technology, they quickly find new use cases. With our platform, Domino's can deliver not only the perfect pizza, but also insights to its internal business partners in real-time. As I take stock of Couchbase 's first few months into our journey as a public Company, I am very proud of all that we have accomplished in just a short period of time. It has been very encouraging to see the recognition and validation of our modern database for enterprise applications from across the industry, including partners, industry analysts, and customers. enterprises are increasing the urgency by which they modernize their application , which intensifies the need for a modern database like Couchbase, and is the reason why we are so excited to come to work every day. And while we are not completely back to a normal enterprise buying and selling environment as pandemic protocols are still impacting our business, we are seeing spending from some of our key customers and our distressed industries recover, and our go-to-market organization is starting to get back in front of our customers in face-to-face engagements. Drafting off the momentum of our release of Couchbase Server 7.0 in the second quarter, and building off our current virtual private cloud offering, the release of Couchbase Capella hosted database as a service offering in the third quarter, marks the beginning of a new chapter in the Couchbase story. Bigger picture, Capella enhances one of the core value propositions of Couchbase: the ability to enable enterprises to leverage our modern database in whatever deployment and consumption model that that business requires, while at the same time, fundamentally changing how developers can access the platform. We've invested an enormous amount of time into this offering, and as I discussed earlier, we're thrilled with the customer feedback we've received so far. We have a robust Capella roadmap ahead of us and you can expect more announcements next year, including support for additional cloud providers, more features, and more capabilities. We are currently investing in the next release of Couchbase mobile, our full featured embedded NoSQL database for mobile and edge computing. The next release of our core platform is also coming next year and with it, we're making it even easier to migrate from relational databases. We are the only modern database for enterprise applications that makes it easy to seamlessly combine operational capabilities and analytical insight, and the next Couchbase server release will feature important updates to our analytics features. You will also see us extending our core platform support to additional processing architectures, which will reduce the cost for both our customers, as well as Capella in the future. As Matt mentioned, Couchbase 's strong third quarter performance was driven by ongoing large deal momentum and our core enterprise business, including some significant expansion as well as acceleration of our cloud business. While some of our customers in distressed industries remain impacted by the pandemic, we saw improvement in the third quarter and are cautiously optimistic that those customers will continue to recover. Total revenue in Q3 was $30.8 million, growing at 20% year-over-year and up 4% from the prior quarter. Subscription revenue was $29.0 million, also up 20% year-over-year and up 3% from the prior quarter. Professional services revenue in Q3 was $1.8 million, up 16% year-over-year, and 9% quarter-over-quarter. Total annual recurring revenue for ARR was $122.3 million, representing 21% year-over-year growth and 6% quarter-over-quarter growth. We're pleased with ARR performance, as year-over-year growth accelerated in the quarter. We remain focused on this segment of the market and are pleased to report our ARR per customer performance in the quarter was $215,000, up from $193,000 from the same period last year. We have a long-term gross margin targets remain above 80%, with our trajectory somewhat contingent on the rate of uptake and eventual mix of our growing as-a-service offering. Turning to expenses, our sales and marketing expenses for Q3 were $21.5 million or 70% of total revenue, compared to $17.1 million or 67% of revenue a year ago. We continue to make significant investments across our sales and marketing organization, including aggressive additions to quota carrying headcount, as well as ongoing investments to customer success, our partner program, and bolstering our go-to-market expertise in cloud. Specifically, we continue to invest in Couchbase Capella, in addition to ongoing core platform development. General and administrative expenses for Q3 were $5.8 million or 19% of revenue, compared to $3.6 million and 14% a year ago. Non-GAAP operating loss for Q3 was $12.1 million or a negative 39% operating margin, compared to a negative $7.9 million or a negative 31% operating margin in the year-ago quarter. We remain committed to investing aggressively, and although we are on track to exceed our full-year operating loss target, we now expect our second half OpEx investments to be more weighted towards Q4. We ended Q3 with $207.6 million in cash, cash equivalents, and short-term investments. Our remaining performance obligations, or RPO, totaled $124.3 million, up 41% from $88.3 million last year and up 5% from $118.9 million from the prior quarter. Furthermore, as I indicated earlier, we're seeing signs of recovery in portions of our customer base impacted by COVID. That said we're continuing to see variability with respect to the implementation timing of certain deals, which impacts our revenue visibility. Accordingly, we are prudently considering this variability in our revenue guidance, even as we see continued upside our ARR outlook. For the fourth quarter of fiscal 2022, we expect total revenue in the range of $33.9 million to $34.1 million, therefore, a year-over-year growth rate of 16% at the midpoint. We anticipate ARR in the range of $129 million to $130 million, which represents 20% growth at the midpoint. For the full-year fiscal 2022, we expect total revenue in the range of $122 million to $122.6 million, therefore, a year-over-year growth rate of 19% at the midpoint. Your line is open. Thank you for taking the questions and congrats on the improved ARR growth above 20%, really nice to see. Capella marks a major milestone for us as a Company, as you know, Couchbase has been architected for the most mission-critical applications. We have a cloud to edge, cloud made up platform, but what the Capella offering allows us to do is completely simplify the ability for developers and other personas to adopt that industry-leading technology. What I talked about in the call, is the early indication that we're seeing of just how valuable that consumption model is. That's not to do diminish our NVPC offering, but more so to demonstrate how powerful it is when we provide a form factor that is so easy, that within a couple of clicks, they're up and running with the full power of the Couchbase platform. It's not just about the cluster volume either, it's about the conversion that we're seeing in people that are interested to deploying clusters, where we've seen a 4 to 5X increase in efficiency of that metric. Setting aside the product lead growth initiatives, you asked about developers, we're putting a lot of time into the developer experience. And more specifically, when we think about it, there's developer advocacy, making sure we're building great products and providing integrations for developers to see the full power of Couchbase. So engaging the developers, articulating what other customers are doing with the power of our platform, how they're finding our elegant design and enabling truly next-generation applications. We're excited that in the quarter, Sanjit, all leading indicators on developer traction, everything from web page views to organic traffic, time on page, downloads, were materially up quarter-over-quarter and year-over-year. While we're really excited about Capella and what it's going to do for us and doing for us today, we're still not at the point where we're going to be disclosing anything specifically around the financials or the time frame. We're certainly continuing to work through that, and when the time comes, we will obviously share that. We're just not ready to do that today, given that it's still an immaterial part of the business. As we think about the relationship between ARR and revenue, and this certainly came up in the last call around some of the timing of deployments. We've had I think going on 3 straight quarters, actually multiple quarters of sustained 20% or above ARR growth. So just about next year, obviously, we're not at the point where we're going to give fiscal '23 guidance yet. We'll do that a quarter from now, so I'm not going to comment on specifically about next year. And right now, because of our definition of ARR, we're obviously able to count things that are in the future where they're not generating revenue today, but we will be in the future. We obviously like the fact and we hope that ARR continues to remain above the revenue growth, but that's where we're going to see. We set the definition of that for that exact reason, because the deal we do with these large customers, the implementation timing and the start dates is always a little uncertain. You noted, I think you've said that the first 3 quarters of the year outpaced all of partner activity in fiscal '21. When we think about our partner business, this is an area the -- of the Company that we've been investing in for many, many years, and believe it's a key foundation to building a great database and specifically, an enterprise database Company. When we talk about our partner investments, that's everything from GSIs to ISVs to cloud service providers. And we study very carefully not just how we are influencing large enterprise opportunities and leveraging the relationships and the reach that these partners provide, but also opportunities that are sourced, where partners are bringing net new opportunities to the Company. I'd say the continued strength is expected, Matt, because we've continued to make this a point of focus and then investing in it for many years. And if anything, we are accelerating our investments there, particularly in the area of cloud service providers, as they become even more important for us with Couchbase Capella. Size, deploy, hundreds of thousands of developers and touch developers and large enterprises having a form factor that's conducive to allowing them to accelerate digital transformation projects is critically important. It's helping us gain leverage in our overall go-to-market and will be an area that we continue to focus on, not just with go-to-market investment, but ensuring that we have the appropriate roadmaps and technology integrations to grow that channel as we go forward. And then Greg, if I think -- if I have my math right, I believe cRPO grew near 34%, I guess. And maybe following up on Sanjit's question on -- I know you're not guiding the next year, but to me that would seem like a pretty good indicator of the trajectory of the business. RPO 's grown north of 40%, I believe, now 2 quarters in a row. Again, we're working with some of the largest enterprises and are paying the very complex\n deployments, and we're doing big, healthy renewal and expansion deals, and there is a multiyear dynamics. You're seeing that in the total RPO, figure also seeing in the short-term RPO as I mentioned with Sanjit question was around the implementation timings. And so that's why you see some of the  seeing with current RPO and ARR and versus revenue is a  indicator, but we feel great about where the ARR is heading in terms of re-accelerating and getting healthfully back in the 20s, and the cRPO just add to that. So we're excited about what that brings in the future, and we're going to continue to do these great, healthy deals that are a long-term focus for Couchbase. It will -- Ittai, first of all, I'm not surprised you want to talk about Capella, and I could talk about it all day because of the potential it has for us. Quite frankly, we're seeing a very healthy balance of existing customers and new customers. We had the biggest quarter in our history from our overall Cloud business, which was our NVPC product and I was asked what was I pleasantly surprised by from the quarter. Quite frankly, the commercial activity on all things cloud, it's as if we released \"hosted \" Capella a quarter ago because of the number of conversations that we're having, which I think is indicative of the demand that we have. We had a new logo as a matter of fact, in Asia, where we work closely with AWS short sales cycle, heavy demand for the technology, and the partnership allowed us to show up in local language and local support to get things over the line. At the same time, we're talking to some of our largest customers for net new applications and eventually migrating existing application. When we look at that trial activity, we do fundamentally believe that Capella will be the new logo engine for the Company as we go forward. And I think when we studied the clusters deployed and some of the early stage top-of-funnel activity, we're certainly seeing that really extending the reach of the Couchbase platform to many more customers. And so we certainly expect new customers to come to us, find us, and start to get into trials on Couchbase Capella. At the same time, we will be articulating the value proposition on that offering to existing customers. But over the course of the past many quarters, everything from additional sales capacity, to marketing investment, to cloud specialization, to overlay cloud securities experts, we're really being mindful of that balance. And most importantly, starting from a how do we satisfy our customers and ensure that they are successful, whether they're coming on their own via one of the marketplaces or we are working with one of our existing customers to migrate over. Your line is open. Greg, if I look at Q3, definitely help you, if I look at Q4 guidance compared to some of the consensus numbers out there and maybe consensus is a little bit all over the place, looked a bit differently. Look, we do deals when customers want to do deals. We're not aggressively pulling forward, and we talked about that in the last call. Look, I would tell you on the revenue side, look, we're just started to see some of these large customers we have. And so we're very excited about these deals, and we're trying to provide the most accurate guidance to you and also be prudent. It's just a -- it's a timing difference, but there is no impact on the full year. And that's why you saw for the full year, we've raised ARR revenue and our profit guidance as well. As we've talked previously, we took great pride in showing up as true partners to those companies during those times, making sure that we weren't just a technology vendor, but a partner that was there for them in good times and in future great times. One of my most proud moments during the quarter on behalf of the Company, we were dealing with one of the world's largest hospitality companies. So we're seeing points of strength, we are certainly engaged with our customers in this quarter and beyond, and I'd say we're cautiously optimistic. Obviously, there is still variance and pressure on return to normal activity, but I think as we mentioned, this is part of our acceleration and one of the many contributing factors to additional tailwind as we go forward. And I would just add, there was one other customer too, unique situation, cruise line that last year came to us, obviously, in the midst of the pandemic, wasn't generating, wasn't selling, generating any revenue. And look, we had to do a special deal and take care of them as one of our valued customers. And so that's just a great example of where we are starting to see some of that return from COVID and how we've taken care of these customers and done right by them, and we're going to see them as great customers for many years to come. I wanted to ask about the comments, Greg, that you made on ARR expected to accelerate -- continue to accelerate going forward. Yeah, look, we talked about this even on the IPO road show that we knew we were going to be heading into a re-acceleration period and we feel like we're entering that now. And based on what we see both on the existing customer base and our pipeline, the new logo is particularly it's coming we believe from Capella here. And so it's just a combination of all those things what we see in the pipeline, the product launches we have, all those things give us excitement and confidence that we will be able to continue this acceleration beyond Q3 into Q4 and into next year. I did not, but I'm happy to, because you will -- the customer count for ending Q3 was 568 customers. Jason, I think one of the things that we take pride in is that we're focused on being the modern database for enterprise applications. We're multi-modal, we're designed as a cloud-native database that can run from cloud to edge at the highest performance and scalability, and now with any consumption model that the customers want. So I think we take great pride in our unique differentiation that we believe we will be able to sustain in helping customers, not just with new applications, but in re-platforming relational ones. And so as we think about enterprises, they're going to be evaluating legacy relational technologies, next-generation modern databases. With Capella, we're able to let developers do that directly. And so look, if you were to pick a database, our customers are going to have those or will be trailing them. But there is no other database that can do the things that we have because of the architectural approach and point of optimization that we've chosen from the very outset of our Company, which we remain committed to. Look, that is exactly how we break it down and we think about the -- if I put my -- whenever I think about competitive dynamics, I put myself in the shoes of our customers. We know that that is the answer to that question is no and they're often in evaluation to figure out which technologies they can layer in to augment their applications or in some cases, offload to offer relational databases. And so while there is overlap and we may have points of comparison, when we get into scale and performance and cloud to edge deployments, those comparisons go in our favor for the applications that we're architected for. But again, our job is to ensure that we're solving database problems that our enterprises can't get from other areas. The familiarity with SQL, Cloud to Edge deployments, multi-modal capabilities, everything from Key Value cash, document database, asset transactions, becoming a true source of truth and system of record for the most mission-critical applications. When we get into alternatives, yes, they're looking at them, but there is no other solution that has that full set of capabilities integrated into a single platform. Just around the large deal that you saw, I assume that was a current customer migration, but would love to hear some of the dynamics around that deal, in particular around sales cycle. So just a little bit curious in some of the early activity, particularly the larger deals, if that was reflected in terms of what you saw this quarter. I think the 1 that you may be referring -- our largest Capella deal today, that was an accelerated sales cycle out of emerging markets. They talk about not just our performance, the breadth of our capabilities per my comments to Jason, but also the familiarity and ease-of-use of SQL and what we've built into Capella as an offering. But quite frankly, we're seeing some very nice-sized deals in new logos. Those are really important deals for us, and the fact that we can see those enter into the pipeline and move to closure at a fraction of the normal time period that we would have with a customer-managed solution. As a matter of fact, we think about the impact of Capella in the following order: new logos, first; second, net new applications and existing customers; and then the final piece will be customers migrating their existing applications. And you combine that with all of the capabilities in the Couchbase platform that we've worked so hard to build and takes such great pride in, you can see why we're excited about the path forward. Big thanks for some of the other metrics you provided, and ARR for customer up nicely, again, I think even sequentially. I know you've tried to help us understand some of the metrics that could change, like margin, for example, gross margin around, as we shift to Capella. So if we do start seeing the pickup which we expect, that certainly could have an impact on the ARR per customer as we go. As we mentioned on gross margin, obviously, the cost of Capella is greater than the self-managed software. We've stated that we believe we can continue to be an 80% plus gross margin business over time, but that will all depend on the mix and how fast the uptake is and all that. Obviously, the offset is more customers, faster growth rate is what we're looking for out of Capella as the engine to grow new others. Your line is open. Just a quick one in terms of the feedback that you've seen post-release of Couchbase Server 7.0 and how it has support for asset transactions changed the types, if at all, the types of workloads you can go after. And then to that end, when you talk to customers today, what are you seeing with respect to growth in net new workloads versus replat forming of legacy relational technology. I appreciate you articulating the importance of Couchbase 7, our largest server release in history and made material advancements on making it that much easier for companies that are re-platforming applications off of relational technologies. We talked about 1 of the G2K 's Amgen, not only was that a relational migration, but they are -- we are now the system of record for their data hub. Another deal that we saw in the quarter is another G2K, actually one of the world's largest auto manufacturers, starting to repurpose off our relational technologies, combining that with net new capabilities, powering things like marketing research applications. In this case, the team had no previous familiarity with \"NoSQL technologies \" but because of the SQL bridge that we've enabled, they can get into and enjoy all the benefits of Couchbase. And so the combination of being able to service the relational data model, but also open up all the power and flexibility and agility that comes with the NoSQL engine and to do that in the single form factor, allows us with the addition of asset-based transactions that we've been in market with for a long time to again become that full system of record and what we say, increase the density of the application that we support. You layer in Couchbase Capella, and now, not only are we managing all aspects of the database technology, but the underlying platform and infrastructure of the service. So you can see how that increases our reach, increases our wallet share, but most importantly, able to satisfy customer demand for net new and re-platformed applications. And as you look into next year, when you think about some of the go-to-market investments that you're making, whether it's in Capella or quota capacity on the direct side of the fence. We're obviously continue to aggressively invest in both the R&D side of the house as well as sales and marketing, and you'll continue to see that as we go into Q4 and into next year, from a purely, from a capacity quota carrying, we tend to do most of our hiring in Q4 and Q1 as we ramp for next year. And we're on track to do that again this year, but we feel very comfortable where we are from a headcount and sales capacity perspective at this point. So it's not just quota carriers, but ensuring that those quota carriers have all of the support they need across the Company to make our customers successful. What we think about first is, how do we get to and support our customers and then ensure that we have the appropriate investments to make sure that we're showing up as a true business partner. We understand the ratios of those resources that we need and everything from our largest companies ' G2Ks, and we're obviously going to have a different model for the buy-from motion and really being mindful about the work to be done and the resources we need to put in place, in addition to continued aggressive investment on the innovation side, and we put those 2 things together and good things happen. With the continued innovation in our leading core platform, our ongoing strength in our mobile and edge portfolio, the launch of the fully-hosted Couchbase Capella, recent large customer wins, and continued execution of our land and explode motion, we're well positioned for acceleration."
}