{
    "symbol": "RSI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 19:55:04",
    "content": " Your line is now open. So I think you're starting to really get momentum being built, which of course is outstanding for us because of all the companies in the industry, we think we may be one of the ones haven't disproportionately large share of casino revenues and we do particularly well in the casino markets. Your line is now open. So at the midpoint of our guidance, Latin America and then these later US markets after 2020 those could grow in the neighborhood of 35% this upcoming year and a lot of you estimate closely from the state data that's reported very nice portion of our revenue, about two-thirds of our revenue last year came from Pennsylvania, Illinois, New Jersey. So our expected growth in those markets is more modest, but I think the takeaway from all of that is the markets that we didn't enter with a known brand or casino database to leverage are growing really nicely and that's a great sign for new markets that are -- are newer markets, but also new markets that launch over the coming years. Your line is now open. I think you called out some of the things that we model, obviously, competition is a little harder to model other than the way you apply that to what you think a market size might be and what your share of that's going to be, but it's really about the costs that we're going to acquire players for, which we've got some standards for. Your line is now open. Your line is now open. So I think Pennsylvania is a great example where for years we had a large shares  early we have a great brand there and be able to develop a great experience for the players and we've been able to retain market leading share, for example, the online slots in that market despite constant new entrants coming into the marketplace. We canâ\u0080\u0099t control what the competitors so, we can control how well we execute and how well we innovate to create experiences and players want to stay with us and we've been very successful delivering that over the years and we're actually very focused on that now I have a lot of great ideas we're working on that, we think are going to really help us in that area. Your line is now open. Your line is now open. So I think there's a lot of room for spend as a percentage of revenue to go down as markets mature, obviously, some of that's going to depend on the competitive environment, it's going to depend on whether there's more legislation with sports or casino and how much we want to invest, because we see the opportunity."
}