{
    "symbol": "ARE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 21:41:02",
    "content": " We're very proud of our approximately 1,000 client tenant base, a one of a kind treasurer that continues to generate remarkable demand for our Alexandria lab space and Peter and Dean will highlight more on this, but again, two million square feet leased in fourth quarter, over eight million for the year and almost 18 million for the last two years with rental rate increases last year of about 22% on a cash basis. 4Q '22 and yearend 2022 was another strong quarter by all fundamental financial metrics and a few others and Dean will highlight some of this, almost 100% -- almost a 100% on collections from a very strong and durable tenant base and very proud of almost 95% occupancy and we put in I think very strong same-store performance both for the quarter and the year. A comment about our successful and continuing value harvesting and recycling of our precious capital, Peter will detail that, but amazingly stellar 2022 with $2.2 billion successfully harvested and then reinvested in a highly disciplined, disciplined manner and Peter and Dean will also comment on the excellent and steady progress we've made year to date, just one month in to our 2023 business plan for value harvesting and capital recycling and we're very optimistic about that. Of note, over 70% of VC dollars deployed went into an Alexandria cluster, and with VC funds across tech and life science raising nearly $160 billion in 2022, a record eclipsing 2021 is $150 billion, significant dry powder is on hand to deploy over a multiyear time horizon. Outstanding execution by our team, as Peter had highlighted, on outright dispositions, partial interest sales, aggregating $2.2 billion, with an amazing $1.2 billion in gains or consideration in excess of booked value, a 4.4% cap rate on cash NOI, all exceptional statistics and significant value creation tap for reinvestment. We reported total revenues of $2.6 billion, up 22.5% over 2021, with FFO per share as adjusted of $8.42, up 8.5% over 2021, and outperforming our initial outlook for 2022 of $8.36 by $0.06, and ahead of consensus, both for the fourth quarter and the full year of 2022. The last four years of rental rate growth on lease renewals and releasing the space have been the highest in the company's history, including rental rate growth of 31% in 2022. Over the last two years, cash rental rate growth has been the highest in the company's history, including 22.1% for the full year of 2022. Now the last two years have generated the two highest annual periods of rentable square feet leased, including 8.4 million rentable square feet in 2022. three out of the last four quarters represented the highest quarterly periods of rentable square feet leased, including two million square feet in the fourth quarter. And at this pace, cash flows from operating activities after dividends, over the next three years, should generate over $1 billion and that's an amazing statistic and very efficient capital for reinvestment. As Peter had highlighted, we have 7.6 million rentable square feet of projects that are 72% leased and projected to generate $655 million of incremental net operating income over the next three years. FFO per share as adjusted over the last 2 years has included an average of $103 million of realized gains each year from venture investments, or approximately $26 million per quarter. But I think if you look at the fact that, I think about 75 -- or in certain years, about 75% of products that have hit the market have started from external innovation that end up on -- in pharma's hands, it's pretty telling that, that is a long-lasting strategy to cone the biotech world, to buy the companies and to keep the teams in place because they generally have platforms and other products behind their initial ones."
}