{
    "symbol": "JBI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 12:21:07",
    "content": " Adjusted EBITDA margins were roughly stable year-over-year, but due to our volume growth, commercial actions and productivity initiatives, margins increased sequentially for the second consecutive quarter, rising by 100 basis points over the first quarter of 2022. And while we continue to see inflationary pressures on raw materials, labor and logistics, the cumulative margin improvement over 200 basis points as compared to our recent trough in Q4 of last year provides clear evidence that our commercial actions and cost-saving initiatives we implemented last year are working. In the second quarter, revenue of $247.7 million was up 42.2% compared to the prior year quarter and 27.4% on an organic basis, driven by solid execution in all three of our sales channels. Adjusted EBITDA margin for the quarter was 20.5%, a decrease of only 10 basis points from the year ago quarter despite the inflationary impact of raw material, labor and logistics ahead of commercial actions taking full effect. This represents a 65% free cash flow conversion for the quarter and 84% year-to-date, adding to our multiyear trend of strong conversion of adjusted net income to cash. From a balance sheet perspective, we closed the quarter with $710.1 million of total debt, $40.7 million of cash and equivalents and a net leverage of 3.9 times net debt to adjusted trailing 12-month EBITDA, down from 4.3 times at the end of the first quarter. I'm pleased to announce that based on our solid first half of the year, continued strong backlog and our current visibility of end markets, we are raising our full year 2022 outlook for revenue and adjusted EBITDA. From a revenue perspective, our upwardly revised outlook reflects our strong first half results including the execution of pent-up demand in the New Construction sales channel to start the year and continued strength in our commercial and other sales channels."
}