{
    "symbol": "AVTR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 15:42:03",
    "content": " Continuing our momentum from the first quarter, we achieved 6.4% core organic revenue growth on an 18.4% comparable from a year ago, driven by continued strength in biopharma and advanced technologies and applied materials. Notably, in the second quarter, we experienced more than 20% core organic growth in our bioproduction business and strong growth in our semiconductor platform, that drove double-digit growth in our advanced technologies and applied materials end market. Looking ahead, we expect full year COVID headwinds of around 3%, reflecting approximately $100 million less COVID-related revenues than planned at the beginning of the year, as vaccine-related revenue is moderating faster than anticipated. Second quarter core organic revenue growth was 6.4%, on top of an 18.4% growth comparison from the prior year. Building on Michael's comments, we generated total revenue of $1.91 billion in the second quarter, representing a 2.8% reported growth rate. Over the last three years, we have averaged 5.8% core organic growth in the second quarter which is at the higher end of our 4% to 6% long-term target. From a regional perspective, Americas which represents approximately 60% of annual global sales, achieved an 8.1% core organic revenue growth, driven by continued strength in biopharma and advanced technologies and applied materials. Biopharma, representing almost 55% of our annual revenue, experienced high-single digit core organic growth in the quarter, including more than 20% core organic growth in bioproduction. Health care which represents approximately 10% of our annual revenue, declined low-single digits on a core organic basis in the second quarter against the more than 30% growth comp from last year. Education and government, representing approximately 10% of our annual revenue, experienced a low-single digit core organic revenue decline in the second quarter and like health care, was up against a challenging comp of nearly 40% in 2021 that included project-related spend which is not repeated. Advanced technologies and applied materials, representing approximately 25% of our annual revenue, achieved double-digit core organic revenue growth in the second quarter, driven by growth of proprietary materials to semiconductor and electronic device customers. By product group, proprietary materials and consumables offerings achieved double-digit core organic revenue growth, driven by strong demand for our process ingredients, chromatography resins, excipients, single-use solutions and serum, as well as for our electronic chemicals platform. Michael previously mentioned the 10.2% growth in adjusted EBITDA or about 14% without the foreign exchange translation headwinds and over 140 basis points of adjusted EBITDA margin expansion to 21.2%, reflecting expansion in our core business and contributions from our 2021 acquisitions. Given ongoing business momentum and less aggressive comparable growth in the second half, we anticipate modestly stronger core organic growth rates in Q3 and Q4 and attractive margin expansion in line with our original full year guide. But as we see it today, there's certainly nothing in our end markets, as you can see from our strong core growth in the quarter that gives us any signals that we're headed for an environment that would deteriorate. If you go back to kind of what we've said about the second quarter maybe as a starting point, we indicated that our core organic revenue growth would be in the range of first quarter performance and similar on margins. Looking at the second half of the year, as I refer you back to Tom's prepared comments, by holding our full year organic guide at 4% to 6%, we're trending right in the middle of that through the first half of the year, see second half kind of planning out in a similar way. But with stronger COVID headwinds in the third and fourth quarter compared to, say, maybe the first quarter, you're going to see modestly stronger core organic growth in the third and the fourth quarter on principally weaker year-over-year comparables. Firstly, on our proprietary offerings that are spec-ed into our customers' production platforms, whether that be in bioproduction or in biomaterials for implantable medical devices or even in things like the semiconductor end market, our order books are at historically high levels which is to say that you're close to having a full year of a demand on orders. And I think it's also important to remember that, that $400 million or so of COVID revenue last year, it was -- first half versus second half, the comparisons were pretty enormous."
}