{
    "symbol": "AVTR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 12:59:04",
    "content": " Through the first three quarters of the year, our core organic revenue growth of 7% and adjusted EBITDA margin expansion of 130 basis points exceed our long-term targets. Adjusted EBITDA was $384 million in the third quarter, representing over 100 basis points of margin expansion and approximately 13% growth from last year after adjusting for FX headwinds. Our core organic revenue growth of 7.8% was modestly stronger than expected, driven by approximately 30% core organic revenue growth in bioproduction and double-digit growth in advanced technologies and applied materials. The inorganic contribution from our 2021 acquisitions accounted for 2.5% growth, representing only the revenue from Masterflex as both Ritter and RIM Bio lapped their one-year anniversaries in the second quarter and are now included in organic growth. As has been the case every quarter this year, our core organic revenue growth was above our long term target of 4% to 6%, and stands at nearly 7% through the first three quarters of the year, demonstrating the strength and resilience of our core business. On to page 6, from a regional perspective, Americas which represents approximately 60% of annual global sales achieved 8.8% core organic revenue growth, driven by continued strength in biopharma and advanced technologies and applied materials. Biopharma, representing almost 55% of our annual revenue, experienced high-single digit core organic growth in the quarter, including approximately 30% core organic growth in bioproduction. Education and government, representing approximately 10% of our annual revenue, experienced a low-single digit core organic revenue decline, driven by low-single digit growth in the Americas, offset by lower consumables demand in Europe. Advanced technologies and applied materials, representing approximately 25% of our annual revenue, achieved double-digit core organic revenue growth in the third quarter, driven by growth of proprietary materials, including those to semiconductor and electronic device customers. We are now updating our full-year guidance to reflect our third quarter performance, $400 million of expected revenue from our 2021 acquisitions, changes to foreign exchange rates and current market conditions, including softening industrial demand in Europe and inventory destocking in select lab consumable categories like liquid handling. Starting with revenue, we expect full-year core organic revenue growth of 6% to 6.5% and COVID headwinds of about 3.5%, resulting in organic revenue growth of approximately 2.5% to 3%. For the fourth quarter, this reflects approximately 2% to 4% core organic revenue growth and about 4% COVID headwind, resulting in flat to low-single digit decline in organic revenue. We've reflected some of the headwinds that you've referenced around Europe industrial exposure and these liquid handling consumables, and our expectation for Q4 core organic growth is in that kind of 2% to 4% range, which it is important. As we think about our long term algorithm, mid-single digit organic growth, margin expansion of 50 to 100 basis points and kind of mid-teens EPS expansion coupled with really strong cash flow and high conversion, that's essentially the model that we're focused on and running."
}