{
    "symbol": "LZB",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-01 11:00:03",
    "content": " For the period, total written sales for our company owned retail business were down 5% versus last year's second quarter, with same-store written sales down 10% versus pre-pandemic, fiscal 2020 Q2 these total written results were up 18% and same-store written results up 12%. Joybird also comped positively against the pre-pandemic fiscal 2020 second quarter, up 43%, but was down 27% versus last year's Q2, reflecting similar consumer trends as well as the effects of changes in campaign execution with a key marketing partner, which have since been reversed. On a consolidated basis, fiscal â\u0080\u009823 second quarter sales increased 6% to $611 million versus the prior year quarter, with pricing and surcharge actions and a positive effects of product and channel mix, offsetting lower unit volume. Consolidated GAAP operating income increased to $62 million and non-GAAP operating income increased to $61 million, a record for the second quarter and an increase of 19% versus last year's second quarter. Starting with our Retail segment, delivered sales increased by 31% to an all-time record $252 million, as we improve service to consumers and make progress towards returning to our pre-pandemic lead times. For the quarter, delivered sales in our wholesale segment grew to $446 million, a 2% improvement compared with the prior year period and a record for a second quarter. Joybirdâ\u0080\u0099s delivered sales decreased 5% to $38 million versus the prior year second quarter and written sales were up 27% against the comparable period, reflecting slowing e-commerce trends and the effects of changes in campaign execution with a key marketing partner, which have since been reversed. While the full enterprise consolidated non-GAAP gross margin for the quarter increased 380 basis points versus the prior year period, and increased 250 basis points sequentially from Q1, primarily driven by price, mix and better plant performance. The improvement in gross margin versus year ago was driven primarily by the change to our consolidated business mix with retail becoming a larger portion and carrying a higher gross margin than our wholesale business as well as favorable pricing and surcharge actions, partially offset by the combination of higher raw material and plant costs. As a result, we expect delivered sales for the fiscal â\u0080\u009823 quarter to be in a range of about $525 million to $535 million down versus the third quarter of fiscal '22, but higher than pre-pandemic levels and consolidated non-GAAP operating margin in a range of about 7% to 7.5%."
}