{
    "symbol": "CHH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 13:20:05",
    "content": " Our future growth is now enhanced by the addition of the Radisson Americas brands to our best-in-class business delivery engine, and we now expect to drive an incremental $80 million in recurring adjusted EBITDA from this business unit upon its full integration in early 2024. Our investments in the WoodSpring Suites brand's marketing and distribution capabilities enabled us to achieve RevPAR growth of nearly 28% in the third quarter of 2022 compared to the same period of 2019, driven by increases in both occupancy and rate. Given the strong RevPAR trends, our ongoing strategic initiatives and continued optimism, we are raising both the bottom and top ends of our forecasted RevPAR growth range and now expect full year 2022 domestic RevPAR to increase between 13% and 15% as compared to full year 2019, which represents 11% to 12% growth versus 2021. Specifically, we are very pleased to see the demand for our new construction brands increased by over 30% in the third quarter year-over-year, a 23% year-over-year increase in new applications for domestic franchise agreements year-to-date through September, and even stronger momentum recently with over one third of the total domestic franchise agreements for the quarter executed during September further reinforces our confidence in our continued growth prospects for the rest of the year and beyond. Please go ahead with your question. Hi, good morning everyone. Please go ahead with your question. Please go ahead with your question. So, we were aware of that. So, we were aware of that. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Hi, good morning everyone. Please go ahead with your question. Yes, I think when you look at in our upscale portfolio today with the Ascend Collection and I would expect most of the Radissonâ\u0080\u0099s will be conversion as you move down into upper midscale, country and comfort particularly the strategic pips that we do for those brands thatâ\u0080\u0099s where you get a lot of RevPAR accretive unit growth from the upper midscale brands. Please go ahead with your question. And then when you take a look at the, just the RevPAR performance, obviously I mentioned, RevPAR accretive by about 38%, on an apples-to-apples basis, when you look at, pure Radisson versus 2019 the whole portfolio is up a little over three percentage points versus 2019 levels, year-to-date, itâ\u0080\u0099s up about two percentage points. Please go ahead with your question."
}