{
    "symbol": "CHH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 13:25:04",
    "content": " Led by our hotelâ\u0080\u0099s ability to drive room rates, we have now exceeded our 2019 RevPAR levels for 14 consecutive months, including July RevPAR growth results which surpassed 2019 levels by approximately 14%, and we expect our momentum to continue into the third quarter. The brand continues to generate strong developer demand with a 28% increase in franchise agreements awarded year-to-date through June compared to the same period of 2021, and a 10.8% increase in RevPAR during the second quarter versus the same period of 2019. Specifically, in the second quarter, our extended-stay domestic pipeline expanded to over 360 hotels and we awarded 41 extended-stay domestic franchise agreements, a 24% increase year-over-year and a 78% increase compared to 2019 levels. Our investments in the WoodSpring Suites brand marketing and distribution capabilities enabled us to achieve RevPAR growth of over 28% in the second quarter of 2022, and compared to the same period of 2019, driven by increases in both occupancy and rate. For the second quarter 2022 compared to the same period of 2021, total revenues, excluding marketing and reservation system fees were $178.6 million, a 25% increase despite a slight increase in our adjusted SG&A expenses, primarily due to the resumption of our annual convention in the second quarter, our adjusted EBITDA grew 16% to $129.6 million. Given the strong RevPAR trends, our ongoing strategic initiatives and continued optimism, we are raising the bottom end of our RevPAR growth range and now expect full year 2022 domestic RevPAR to increase between 11% and 13% as compared to full year 2019. For full year 2022, we continue to expect unit growth of the more revenue intense segments to range between 1% and 2%, not including the impact from the onetime exit of the WoodSpring Suites hotels nor the pending Radisson Hotels Americas acquisition. Even excluding the impact of the pending Radisson Hotels Americas acquisition, we expect to drive continued growth in adjusted EBITDA and adjusted EPS for full year 2022 above both 2021 and 2019 levels. Finally, for full year 2022 and excluding the impact of the pending Radisson Hotels Americas acquisition, we expect to drive continued growth in our adjusted EBITDA margin above 2019 levels. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}