{
    "symbol": "CHDN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 15:42:16",
    "content": " We generated record net revenue of nearly $583 million, up 13% from the prior year quarter and record adjusted EBITDA of $291 million, up 25% from the prior year quarter. Turning to our TwinSpires business, revenue and adjusted EBITDA for TwinSpires Horse Racing business was down compared to the prior year quarter as more people continue to return to wagering in person at racetracks and other brick-and-mortar facilities. Second quarter adjusted EBITDA for Churchill Downs Racetrack was up nearly $59 million compared to the prior year quarter, and up nearly $12 million compared to the second quarter of 2019. Second, our three HRM properties in Kentucky delivered another strong quarter with both combined revenue and adjusted EBITDA up 22% compared to the prior year, quarter, and up 8% on a sequential quarter basis. Despite this disruption, Derby City Gaming still grew topline revenue by 11% and adjusted EBITDA by 8% for the quarter compared to the prior year. Newport Gaming continues to benefit from the expansion and redesign of the gaming floor, delivering over a 60% increase in net revenue and more than doubling its adjusted EBITDA up for the quarter compared to the prior year quarter. Fourth regarding our wholly-owned gaming properties, adjusted EBITDA for the second quarter was down $10 million and margins for our wholly-owned gaming properties were down five points compared to the prior year quarter. Adjusted EBITDA of our two Mississippi casino properties combined for the second quarter was flat the second quarter of 2019, despite the introduction of major competitor in Arkansas and 2020, and economic weakness in the States, driven by higher gas prices, higher interest rates, and higher inflation than our customers experienced in 2019. Turning to our equity investments at gaming properties, Rivers Des Plaines generated record revenue in the second quarter and adjusted EBITDA was up nearly 60% compared to the first quarter. However, similar to our wholly-owned properties, the prior year quarterly comparisons of difficult comp for the reasons I just mentioned, Rivers Des Plaines also incurred more marketing expense, additional labor costs, and other costs related to the opening of the gaming floor expansion in the second quarter of this year. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much."
}