{
    "symbol": "SAN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 10:33:04",
    "content": " The core equity Tier 1 was above 12%, 12.05%, while good organic capital generation, 40 basis points from Q1 '22 earnings and minus 23 basis points from dividend accrual and the second buyback -- share buyback that is going on and started mid-March. In terms of results, we grew profit 8% year-on-year with double-digit customer revenue growth, cost heavily affected the inflation, especially in Brazil and Argentina. In Corporate and Investment Bank, our goal is to become one of the leading investment banks in Europe, consolidating our leadership in Latin America and continue to accelerate growth in the U.S. Additionally, as leaders within the sustainable sphere, we completed in April 2022, our plan to acquire 80% of WayCarbon, a leading Brazil-based ESG consulting firm. So our capacity to attract the customers and growing more profitable business in a -- higher in rate, the scenario, you're going to provide a big significant uplift to our revenues Naturally in this inflationary environment, we need to be, as always, looking at matching the cost. This case environment in which -- we're going to continue to deliver good results in Brazil and growing probably nicely in the country and having a return on tangible equity north of 20% or around 20%, not a particular deterioration in this regard. But taking into account return on tangible equity and risk-weighted asset growth that in the quarter was in 3%, if I remember well, probably we're going to keep growing risk-weighted assets there, our capital generation, taking into account the payout policy is going to be significant. I should say that -- well, in relation with the interest rate sensitivity, when you come from negative in Europe, like we are in Europe and you go into positive territory, very likely going from minus 5% to plus 0.5%, you're going to capture 100%. And not as -- the growth is less so than  CBI quarter-on-quarter results went up 78% and partially, it was due to the good fee income generation and also this applies to wealth management and asset management that performed very well in the quarter, and this is on the back of the good fee income generation that we got."
}