{
    "symbol": "SAN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 12:54:06",
    "content": " Yes, in one part of the business we are growing while across the board in constant Euro loans increased 2% quarter-on-quarter â\u0082¬17 billion, which increases in almost all countries deposits were up 2% also in the quarter with some shift towards tying the policies given the current interest rate environment. This increase was supported by AI which also increased 5% which as we can see hustler rate has accelerated in the last two quarters, primarily as Spain, and Portugal are beginning to benefit from interest rate increases, in addition to the growth that we have already seen in countries like UK, Poland, US, etcetera. For 2022, again, we maintain our expectations of double-digit growth in in NII and the fee income, higher growth in costs affected by our investments in the utilization, and obviously inflation and the cost of risk of around 2%. And thanks to active customer management, nine-month revenue was 25% higher year-on-year in cost in Euros; 36% in Euros with very positive performance in both credit and debit cards across the regions, particularly in South America. Naturally, this leads to improvement in the cost to income, I do recognize that to reduce nominal costs as we are doing Europe, but CIB is difficult in the current inflation environment, and probably is impossible, we need to renew some agreements with unions, and this is going to put pressure on this cost to income for sure, on the back of higher incomes were improved, but also remember that well in South America, at some point, we the outlook that we have for Brazil is becoming more constructive on the trends at some point. Can we have the next question, please? Can we have the next question, please? Can we have the next question, please? Over up in some countries less in CIB probably as well, again, in share, we're expanding the business probably we're going to get all the costs faster than that probably, as I mentioned in the presentation or cost mentioned in the presentation CIB as the main driver of positive cars in Europe, while the units, the retail units in Spain and Portugal are deeply in nominal negative growth. Can we have the next question, please? Carlos, please go ahead. And thank you, Carlos. Can we have the next question, please? Can we have the next question, please? Carlos, please go ahead. And thank you, Carlos. Can we have the next question, please?"
}