{
    "symbol": "GOEV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 20:31:02",
    "content": " With the acceleration of the LDV, we have partnered with a third-party for limited production while our facilities come online. With the acceleration of the LDV, we have partnered with a third-party for limited production while our facilities come online. We ended the quarter with access to approximately $250 million, including approximately $220 million of unused capacity on our SEPA facility, and cash and cash equivalents of $33.8 million. Cash used in operations for the six months ended June 30, 2022, was $236 million, compared to $108.8 million for the six months ended June 30, 2021. Some of the benefits include, better visibility to capital, greater control, reduced market risk while retaining the flexibility to align timing with the needs of the business, and overall, potentially less dilutive with the embedded convertible feature and we have drawn down the first $50 million tranche. In addition to these facilities, we intend to file a new $300 million universal shelf to allow access to the remaining $200 million under the PPA and for continued access to the capital markets going forward and we plan to access $150 million to $200 million in incremental capital this year. Moving on to the Q2 results, our second quarter 2022 results are as follows, research and development expenses of $115.5 million for the quarter, compared to $57.6 million in the prior year period. This is our first key commercial fleet agreement that further allows us to focus on the larger volume, higher margin revenue opportunities, which includes revenues from offsetting and other non-vehicle revenues, starting with 4,500 vehicles with an option to increase to 10,000 vehicles, this order adds another opportunity for us to go after additional non-dilutive and lower cost of capital financing opportunities. Turning to our forward-looking guidance, with the focus of SOP in Q4 2022, we anticipate the following expenditures for the remainder of the year, approximately $200 million to $245 million of operating expenses excluding stock-based compensation and depreciation, and approximately $100 million to $125 million for capital expenditures. Well, there is the opportunity for us to receive an additional, I think, itâ\u0080\u0099s up to $85 million, but we are not prepared to speak to that at this time, but we do have the access to additional capital, as well as we are in discussions to get greater advances on those capitals since we are pulling forward some of our programs."
}