{
    "symbol": "GOEV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 19:48:09",
    "content": " I will now turn the conference over to your host, Kunal Bhalla, Senior Vice President, Corporate Development and Capital Markets. Thank you, and welcome, everyone, to Canoo's quarterly earnings conference call. Today, I have with me Investor, Chairman and CEO, Tony Aquila; along with CFO, Ken Manget; and CAO, Ramesh Murthy. These are subject to significant risks and uncertainties, and our actual results may differ materially. For a discussion of factors that could affect our future financial results and business, please refer to the disclosure in today's earnings release and on our most recent Form 10-Q and 10-K and other reports that we may file with the SEC, including Form 8-Ks. During this call, we'll discuss non-GAAP financial measures. You can find the reconciliation of these non-GAAP financial measures to GAAP financial measures in today's earnings release, which can be found on the IR section of our website. As many of you already know, our discipline is big news or no news. Turning it over to Tony to talk about some big news, but not old news. Thank you, Kunal, and thank you, everyone, for joining us for our Q4 and full year 2022 results. Before getting into it, I'd like to thank all our associates for their hard work and dedication to our mission. We are pushing the envelope on technology, innovation and what an EV means to consumers and fleets. That requires a specific mindset, skill set and focus on milestones. If you look at the steps that we have taken since I became CEO, we immediately jumped in and started the verification and realignment of the strategy. I'd like to sincerely thank our believers, all stakeholders that hung in there with us while we have worked through the transition. And to those that were focused on headlines, they can now focus on the milestones achieved. As you can see in our earnings release, we have now reached a conclusion on the SEC investigation. Our agreement with the staff still needs to be approved by the commission itself, something we hope will happen in the next few weeks. And as we continue to eliminate these legacy matters, it only increases our ability and efficiency in achieving future milestones. I'd like to remind everyone that as the largest shareholder and long-term-focused investor, we invest continuously on many levels to help de-risk the business and increase its opportunities for success. Our just-in-time discipline has helped us become more efficient, especially during the realignment. However, it has added more complexity as we and others access the capital markets in the current market conditions. We see this as a portion of the long-term cycle, but just a portion of accessing the capital markets. We led the charge by alerting investors about the risk factors that the EV industry faces, not only to talk about the opportunities and advantages, which are great. As we have shown, we have signed up world-class customers, and we will continue to focus on our three-stage customer engagement model and on growing a solid customer pipeline. And that phase, we'll be more focused on milestones versus event-based or just-in-time. This will lower the cost, make more efficient use of capital and allow us to focus on long-term sources. We navigated the volatile economic environment in 2022 with a mixed view of our performance, as we reflect back. U.S. manufacturing and job creation, we believe there -- as you know, we led the charge to bring jobs and manufacturing to the U.S. heartland, which we are very proud of; completed our Phase 1 SOP in Michigan; announced vehicle manufacturing facility in Oklahoma City; and kicked off Phase 2 SOP OKC, including establishing an EV battery module manufacturing facility in Pryor, Oklahoma. Partnering with the state of Oklahoma and the Cherokee Nation to establish workforce training programs, committed to hiring up to 550 employees to support our manufacturing ramp as we scale production. We had previously stepped in to lead the share purchase from the Chinese investor to address the serious concerns and the settlement, mitigating potential IP leakage risk. We also focused on BOM optimization, the build of materials, reduced cart counts to under 1,800 parts, one of the lowest per EV vehicles. thousands of vehicles, orders has been our strategy. Now, we're very proud to have customers like Walmart, Zeeba, Kingbee, recently Schindler Elevator and CBRE to add to the names of our customer partners. Our product is being well received in the market, and we are excited to help electrify the working fleets in America and beyond. For commercial vehicles placed into service in 2023, Canoo fleet customers will benefit from the maximum allowed credit of $7,500 per unit. Under new IRA sourcing rules, most vehicles don't qualify for the consumer credit. As we stand here today and reflect, we struggled and underestimated the complexity of some of our milestones, especially taking into account the legacy impacts and the macroeconomic backdrop. As we start to put the legacy matters behind us, we will be better focused on our future. Our capital-raising strategy is maturing, especially as we remove legacy matters like the SEC overhang, which improves our access to low-cost, long-term non-dilutive capital. We have all been through a lot these last 16 months, and some of us even longer. As we continue to mature, migrating from an R&D design and premarket delivery to a manufacturing and market launch organization, hitting these milestones will better help us manage the current market turbulence based on our growing track record of achieving important milestones. On the good side, our cost per FTE is going down as a result of changes in our mix as we align with our continuing R&D becoming more focused on certain segments like customer innovation and fleet, government, military, Department of Defense and very specific geographic expansion markets. Now, let me share some of the fourth quarter and recent highlights. We received 217-mile EPA certification for the LDV, which we will continue to focus on improving. Further, our advanced deliveries with Walmart proved excellent range and retention in triple-digit heat and below freezing temperature conditions. We continue to see strong demand for our product, and it's a tribute to the hard work of our design, manufacturing, engineering and customer journey teams. Oklahoma City manufacturing readiness continues to progress, and we remain focused on exiting 2023 at a 20,000 run rate. This additional use of our technology speaks to the TEM, technology equipment manufacturer, versus an OEM, which is an original manufacturer -- original equipment manufacturer. Ken and Tony in their respective areas bring a wealth of experience in capital raising, strategic finance and manufacturing. I've spent time most of my career in multiple areas of the capital markets, first in the sell side, where structured billions of equity and debt capital raises, including non-dilutive financing for major automotive OEMs. Subsequently, I was at Ontario Teachers' Pension Plan, where I first met Tony while managing a $10 billion global equity strategy that invested in growth equity, pre-IPO and public companies. I've hit the ground running, and I'm actively working with the team on finalizing our 2023-2024 diversified capital plan. As in this raise, we focused on allocating to improve the diversification of our shareholder base. I will now be picking up the mission of moving us from a just-in-time capital raise strategy to what Tony described before, which is a more milestone-driven strategy. Cash used in operations for the quarter and year ended December 31, 2022, was $70.6 million and $400.5 million, respectively, compared to $120.2 million and $300.8 million, respectively, for the same periods in 2021. Capital expenditures were $8.5 million and $97.3 million, respectively, for the quarter and year ended December 31, 2022, respectively, compared to $62.6 million and $136.6 million, respectively, for the 3 and 12 months ended December 31, 2021. Net cash provided by financing activities for the 3 and 12 months ended December 31, 2022, was $109.2 million and $290.4 million, respectively, compared to net cash used financing activities for the 3 and 12 months ended December 31, 2021, was $6 million and $11.4 million, respectively. Our R&D spend in Q4 '22 was 25% lower than Q3 '22, and our R&D spend in second half of '22 was 53% lower in R&D spend compared to the first half of 2022. However, we achieved a 45% reduction in operating expenses, excluding stock compensation and depreciation. Our guidance for Q1 2023 is as follows: OpEx, $55 million to $70 million; and capital expenditures, $30 million to $45 million. With respect to that, we have focused on a 20,000 run rate exit, and we'll be fine-tuning that with our customers as to what the deliveries will be in the quarters. But right now, we're just -- to be cautious with everybody, we know with a lot more certainty than we do on a weekly basis as we ramp things up or a quarterly basis, we know with strong confidence that we can exit the year at a 20,000 run rate based on the delivery schedules and the installation schedules of all the equipment. But I would say, from items on the ground, we're probably somewhere in the 65%-ish range of items on the ground, probably at north of 85% with what's inbound. And we have a few areas where we are working on manual workflows or semi-manual workflows where we have some vendors, which are taking a little bit longer and need longer lead time. But we found workflow around that, which gave us the confidence to put the stake in the ground about a 20,000 unit run rate. I mean, there's a lot of headline about jobs, et cetera, right now, but just wondering how you are positioned in terms of your hiring needs. Look, I'd say where we sit today based on the fact that we studied the labor shed now for multiple years on Oklahoma and we've kind of zigzagged a little bit by diversifying our risk from being concentrated only in Pryor, Oklahoma to now splitting it to Oklahoma City and Pryor, our confidence comes up. We need to equip it, but we'll be using AI tools. And with respect to your question on hiring, I think like most of the early manufacturers, I think we upgraded our manufacturing team a bit earlier in the process. And -- because you come to different phases of needs, the people have performed great tasks. But now, we're bringing in teams that have experience at scale. And we're doing it as we step into the 20,000, 40,000, 60,000 run rate and above, trying to get ahead, trying to learn from what some of our peers experienced with, if you will, bringing it up to scale. Just one last one for me, maybe for Ken. We're exploring a number of diversified funding sources, which leveraged some of the background I was describing earlier. For example, we couldn't -- prior to getting some of the legacy matters addressed, especially with respect to the SEC, we couldn't actually file for things like in the Department of Energy loan program and things of that nature. Now, our opportunities are exponential for us to access capital as we start to establish this management team's track record. I was wondering if you could just kind of give a little bit more detail on maybe where you're seeing strength in demand, what segments, mix, order size, just anything additionally that you could share would be great. So look, our orders have been around the Grade A, BBB credit type customers because we know that's going to reduce our cost of capital. But in addition to that, we focused on customers that have unique workflows and for us to meet those workflows, so we can get multiyear long-term orders. And these are generally higher margin because the customer gets a very good return on capital, and they're higher margin for us as well. So, the mix has been primarily focused around the LDV with limited units of the LV and primarily large, medium-sized fleets. So, we get distribution to some of them, but we'll be doing it on a very concentrated rollout so we don't also have the same problems that some of the other companies had with mass rollout of their vehicles because you do have to anticipate some service, maintenance, repair, support items. So, I think very concentrated, large orders, get our book up to where the credit rating is really good as we look at some of those non-dilutive financing items that we'll be announcing in the coming quarters. In fact, they're here today working with us. Actually, we're trying to taper it back just a little bit so we can distribute some other customers as well. I think actually, it's -- for the big companies, it's more of a business target and a target for business performance. So, it really -- it's just been extra additive. But for the medium-sized businesses, it's kind of -- it's a tipping point decision. So, the Inflation Reduction Act is super additive to helping the customers that are -- have more difficulty in the transition, if that makes sense. I mean, I guess maybe the counterbalancing variable is that oil prices and gasoline and diesel have fallen to the lowest levels in about 1.5-year. I think it would be for those companies that are focused on selling 1 or 2 at a time because it's immediate return on capital versus kind of, if you will, your greenhouse gas emission targets and so on. I think for the bigger companies, that's a marginal issue. And the life -- because they look at the long life of the vehicle, the total cost of ownership and return on capital, these are just better platforms as we proved with thousands of miles of testing and deliveries. Right now, it's still very positive for us, looking at on a return on capital from a long-term basis. So, those customers are still steaming ahead. But to your point, I would imagine for the small, small business, which we have not focused on the individual user basis at this time, I would imagine that they are slowing down. With the fact that our range is now 50% greater than what most of our customers, not all but most of our customers are requiring, they actually can get a lot more return on capital, which accelerates the amount of deliveries they can do on a daily basis as we see these bigger customers emerging. And so, the payback period can be, depending on them, as soon as 3.5 years."
}