{
    "symbol": "GOEV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 19:20:27",
    "content": " I would now like to turn the call over to our host, Nick Cunningham, Senior Vice President of Investor Relations and Capital Markets. This is Nick Cunningham, and I'm the SVP of Investor Relations and Capital Markets at Canoo. This is my second earnings conference recently call since joining the company, and I'm thrilled to be working alongside such experience and innovative partners. Today, I have with me Investor, Chairman, and CEO, Tony Aquila, and Interim CFO and Chief Accounting Officer, Ramesh Murthy. For a discussion of factors that could affect our future financial results and business, please refer to the disclosure in today's earnings release and on our most recent Form 10-Q and 10-K and other reports that we may file with the SEC, including Form 8-Ks. During this call, we'll discuss non-GAAP financial measures. You can find the reconciliation of these non-GAAP financial measures to GAAP financial measures in today's earnings release, which can be found on the IR section of our website. Last quarter, we made it clear that we are a high-tech customer-centric advanced mobility company. Again, to all our believers and supporters, thank you for riding alongside us on our journey. Today, I'm going to cover highlights from the quarter, including our solid and growing partnerships with two states and the nation, the NASA win, an update on financing, and our progress towards production. We are inspired by our future forward partners in the state of Oklahoma and Arkansas as well as the Cherokee Nation, which continued to attract significant technology investments to the region. With the passage of the Large-Scale Economic Activity and Development or, if you will, LEAD Act, we believe the state of Oklahoma will offer an increasingly business-friendly climate. The bill received overwhelming bipartisan support from the Oklahoma legislature, passing the Senate by a 41 to 5 vote and the House by an 81 to 17 vote. Starting with House speaker, Charles McCall, Senate President, Pro Tem Greg Treat and Governor, Stitt for their incredible leadership. He established a three-state partnership with Oklahoma and Louisiana to create a regional hub for the development, production and use of clean hydrogen. Over the coming quarter, we expect to move a 1,000-vehicle order from the state of Arkansas from Stage 2 to Stage 3. This environment was selected for the combination of two visionary states and a nation, the Cherokee nation, where we stand by our commitment toward workforce development. We have already broken ground on our mega micro factory in Pryor, Oklahoma and are getting ready for the next phase of development. I would like to personally thank our government affairs team, in particular, Chris Moore for their many, many months of work in supporting initiatives within the states and the nation. Great news as well, the final CFIUS dilution condition related to the shareholder, DB Global Holdings has been satisfied, and we are no longer subject to any further provisions under the national securities agreement. On the federal level, the administration continues to make strides with the national electric vehicle infrastructure formula program, which dedicated $7.5 billion in infrastructure funds over the next five years to the states for additional EV charging stations. In March, the administration authorized use of the Defense Production Act to provide funding for mining, processing and recycling of lithium, nickel, cobalt, graphite and manganese and other materials. While the benefits from this initiative may not be immediate, we believe it may increase the supply of these materials from domestic sources over the medium to long term. This potentially benefits our partners like Arkansas, which has one of the nation's largest lithium reserves. A quick shout out to representative Steve Walmart from the Third District of Arkansas, who recently highlighted our NASA contract on the House floor. Artemis may well prove to be one of the longest running space programs, and we are honored to partner with NASA in this historic endeavor. And with today's media landscape and population, we anticipate billions of impressions associated with the Artemis program. These vehicles will be produced in America by the people of the Heartland, including Native Americans and veterans. On to financing, we have been clear with our partners and associates regarding our philosophy of raising capital judiciously. It is a different market today, one with challenging conditions, but our strategy aligns with this type of market environment. I reiterate we will raise appropriate amounts to satisfy what we need, bridge 2 milestones and be in a position to take advantage of our track record, our value creation and potentially improving market conditions. To start, we entered into a $250 million equity purchase agreement with financing partner Yorkville Advisors. Next, we have a commitment for a $50 million pipe from an existing shareholder, further demonstrating long-term support and belief in the company. We also filed a $300 million shelf, bringing our total accessible capital to $600 million, optimizing our financial needs to SOP. A related party is exploring raising up to 100 -- or excuse me, up to $1 billion of non-diluted capital for the construction of the prior facility. Oklahoma mega microfactory in Mid-America Industrial Park in the form of an ESG Clean Energy, Native American affected communities opportunity zone funding vehicle. Further to our focus on sourcing regenerative non-dilutive investment capital, this taps into eco-friendly high net worth investors focused to deploy this capital in a tax-efficient manner that makes a big ESG difference. We take a different approach to traditional problems in the supply chain starting with our design, which requires 50% less parts. Today, we have arranged for an on-time delivery of 100% of the required semiconductor chips for gamma and TT builds. Building on what I said last quarter, supply chain issues have worsened, especially as things have heated up on the geopolitical arena. We are still in process of securing on-time delivery of 26% of the semiconductor chips needed for SOP, which at standard cost represent less than 2% of our BOM. This issue has our team's full attention, and we are working aggressively to resolve it. As many OEMs and others have indicated there may be industry relief for the semiconductor supply chain shortage coming in just in time, aligning to our Q4 2022, SOP. What remains is whether we will hit our full target of 3,000 units to 6,000 units is still remaining open  Since the end of Q1, we have more than doubled the gamma builds to 39 vehicles. We completed our second year of deep winter testing of more than 2,000 additional miles. We will soon be entering desert testing for the second year, validate our systems once temperatures have reached optimal conditions. With gammas increasingly coming off the line and entering testing, we are preparing to start the scale of production at our Bentonville advanced manufacturing facility. Our second building, is going up now, and we are front-loading battery production for SOP. On to sales, our Stage 2 orders have increased 17% from Q4 2021 to Q1 2022, totaling over 17,500 units to date, our preorders are completely organic. We continue to move forward sales discussion with several key partners, and we solidly anticipate that we will be sold out this year and next. I would like to thank our partners, our suppliers, our employees for continuing to contribute to Canoo’s mission. Our first quarter of 2022 results are as follows; research and development expenses of $82.5 million for the quarter, compared to $39.3 million in the prior year period. Excluding $7 million of stock-based compensation, research and development expense was $75.5 million. SG&A expense was $55.6 million for the quarter, consistent with the prior year period. Excluding $13.7 million of stock-based compensation, SG&A expense was $41.9 million. GAAP net loss was $125.4 million for the quarter, compared to a GAAP net loss of $15.2 million in the prior year period. Cash used in operations for the three months ended March 31, 2022, was $120.3 million, compared to $53.9 million for the three months ended March 31, 2021. Capital expenditures were $28.4 million for the three months ended March 31, 2022, compared to $12.1 million for the 3 months ended March 31, 2021. Due to the timing of the inflow from our announced funding, management has added a going concern qualification to our financial statements for Q1. For the second quarter of 2022, we anticipate the following expenditures, approximately $95 million to $115 million for operating expenses, excluding stock-based compensation and depreciation and approximately $85 million to $105 million for capital expenditures. Before we open the call up for Q&A, I'll turn it over to Tony for closing remarks. We will push forward to support workforce development within the Heartland, where we will build our vehicles. We are committed to technological industrial level change, which will up-fit these communities and uplift them. Our commitment, to hiring and training a workforce consisting of veterans and Native Americans is just solid. I would like to thank, again, our partners, our suppliers and our associates for their unwavering support of our mission. Just a quick question on the expected CapEx of $8.4-ish million, was this related to financing timing, or was it related to some other reasons? Frankly, what it is it's more -- it's a payment related to milestone recognition of our fixed assets. And so that's why the guidance like, $230 million to $250 million. Sameer, as you know, we typically provide guidance only for one quarter. But I think our capital raising efforts, kind of tells you -- and if you know our track record, I mean pretty disciplined. I mean, that was going to be my next question, the 250 plus 50, plus additional share is about $200 million. What do you expect the timeline to be for, one, the closing of the first PIPE and on drawdown of the rest of the €250 million. And then, just after the S-3 filing, they access to the Yorkville, so that's a couple of weeks. So, look, I think the thing that we're very focused on is the second building in Bentonville. That's a pretty big focus for us, obviously, because Bentonville can produce 20,000-ish vehicles for us. I think also in addition to that, you saw the commentary about exploring more non-dilutive capital in the essence that the MAIP where we're building, this is an opportunity zone, that could give us access to some very interesting capital. And a lot of people talk about ESG like it's a thing; for us, it's just our culture. In addition to that, the microchip's gap for SOP, we've secured gamma and TT, but that 2% of the BOM cost for ships of almost all vehicles out there, it does make you more reliant on the chips you have, right, from a yin-and-yang. Any discussions we make on that would most likely be joint and/or authorized, but it's a very exciting program. I'm really proud of what the country is doing, and it's just an amazing privilege to be a part of it. We're running somewhere between, call it, up to 12 units a week right now. When you have half the number of parts, and you have a unique design that's designed to be repairable, it actually is proving to be much better. And I don't know, if you guys can travel yet, but love to have you come down and drive them, driving this vehicle by wire is an experience. Well, I'm not that far way, so I think – I can take upon your offer. So right now, we are using them for customer engagement, and we're primarily concentrating on fleet customers right now. And I believe maybe some – probably one-third of it is coming from various fleets in the order, maybe a little more than that. I mean we should have played -- I was driving them around in L.A., I guess, a week ago. And I mean, people are just stopping us on the street asking questions, pulling up to us on stop signs, just because of the amount of space, the utilization, the turning rate and capabilities are -- is the best I've felt about it all coming together. But the best thing is I tell everyone, when you drive it and you sit in it and you see it and you park it next to something that you're used to, it just tells you what we did. I know it just might be a little bit hypothetical, but what other opportunities are you looking at in this because it's a pretty -- you mentioned it's a pretty visible thing to go to watch account down and watch Canoo vehicle take the astronauts to the rocket. Well, I mean, I think -- Jamie, we told you about our focus was to focus on the market movers and really focus on purpose-built activities. So although it's an important one, but it does open us to engage with other government agencies, which we already are."
}