{
    "symbol": "CRKN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 16:38:03",
    "content": "  Operator: Good morning, everyone, and welcome to Crown ElectroKinetics Corporation Earnings Call for the Third Quarter 2022. With us todays - on today's call are Doug Croxall, Crown's Chief Executive Officer and Chairman, and Joel Krutz, Chief Financial Officer. Before we begin, I would like to remind you that today's call contains certain forward-looking statements from our management made with the meaning of Section 27A of the Securities Act of 1933 as amended and Section 21E of the Securities and Exchange Act of 1934 as amended. Words such as may, should, projects, expects, intends, plans, believes, anticipates, hopes, estimates, and variations of such words and similar expressions are intended to identify forward-looking statements. These statements are subject to numerous conditions, many of which are beyond the control of the company, including those set forth in the Risk Factors section of the company's quarterly report on Form 10-Q for the third quarter 2022 filed with the SEC. Today's Veterans' Day, as you all know. All right, we're going to begin with business update - afterward. At Crown, we remain committed to our vision actively working to become a key sustainability supplier to the U.S. based office buildings by helping them retrofit their legacy infrastructure to be environmentally responsible and energy efficient through providing an affordable smart glass solution to the commercial real estate market that will enable its customers to reduce energy and in turn lower carbon emissions. Recently, we announced that we closed on $4 million of fresh capital, that capital will allow Crown to deliver its Gen 1 product, while also providing us the runway to continue negotiating our debt capital, which I'll discuss in a few minutes. We will place our Gen 1 inserts into a limited number of our customers offices with the main goal of achieving detailed customer feedback, such as the overall look and feel how the data gathering is commencing the battery performance and the user interface. Throughout calendar year 2023, while our full production line is hopefully being built, we will continue to broaden the number of customers using our Gen 1 inserts, all the while allowing the customer feedback to drive the features for our Gen 2 inserts. If we're successful, we should have a dozen different customers by mid to late '23 with a limited number of Gen 1 inserts installed into their offices. Legislation brings immediate and substantial savings for our current and future customers, and has the potential to accelerate rapid adoption of our smart window insert in a similar manner to - that which kick started the solar industry. As previously announced and discussed on earlier earnings calls, we've been engaged in discussions for $30 million debt facility for some time. Upon successful closing, we'd be in the position to build our new roll-to-roll line, enabling us to produce film at widths ranging between 12 and 72 inches. Once the new lines are producing the capacity, we expect our smart window insert annualized revenues could reach more than $200 million. Recently, you saw the announcement that we've begun the application process to dualist our shares on upstream, a revolutionary trading app for digital securities and NFTs powered by Horizon Fintex and MERJ Exchange Limited. Ultimately, our Board of Directors determined that the dual listing on upstream could be an excellent way to reach a worldwide market of potential new investors who can learn about Crown and invest in Crown. Upstream introduces what it believes to be the future of trading, featuring some of the highest levels of transparency, accessibility and investor protections enforcing - enforce using the theory and blockchain technology. Crown's market potential is significant with few if any comparable solutions, and finally we continue to be engaged in ongoing strategic commercial discussions with other potential partners. On to the financials, Crown's net loss for the third quarter '22 was $3.1 million which included $0.5 million of non-cash stock-based compensation expense. This net loss was $2.6 million lower than the $5.7 million recorded during the quarter ended September 30 last year, which included $3.1 million of non-cash compensation. As of September, these restructuring efforts have reduced our run rate costs by $3.1 million or 24%. The benefit of these actions was evident in our reduced cash burn levels with Q3 cash deployed for operations of $2.1 million, or $0.7 million per month. We've complemented this material reduction with our capital raising efforts over the last few months including the $4 million that Doug mentioned, which we raise subsequent to September 30. So couple - things to note - the cost of our inserts are pretty equivalent, slightly more expensive, than the cost of a solar shade. So if you look at like a standard kind of five-by-five window in an office, like those white solar shades to be priced anywhere from $450 to $580, our insert is priced, you know, $70 to $100, more expensive than that. So - there while certainly building owners are concerned about, you know, their leasing levels and the vacancy levels and inflation and potential recession. So our price point kind of moves us out of some of those typical concerns, doesn't mean we won't be affected, selling our product like anyone else's, and in a recessionary period. We're still in that conversation as matter of fact, we've got a couple of new customers that we're negotiating current deals with. So we still - think that there's pretty good runway for us, even if, you know, and hopefully it doesn't happen, but even if we move into a recessionary period. So if we look at, if we look at a solar shade, right and I'm a commercial building owner, I'm going to have a normal level of maintenance, and I'm just going to have to replace those correct. And if I'm - that is there a difference in like the IRA benefit, for example of using your solution versus, a solar shade. To be honest, most of the building owners don't do an ROI on their solar shades, it's just you got to do it. So they're not looking necessarily at okay, what's the return on investment if I put these in, most of the building owners are cycling those out every seven to 10 years, the entire building. So it's kind of one of those standard things, when you're a new tenant, you're moving into an office, carpet, paint, and blind typically get replaced is a TI. As a matter of fact one of our customers that we're dealing with right now, they're looking at replacing blinds in one of their buildings and we're, they'd rather use our inserts, because our inserts does provide an energy reduction which is a carbon reduction which is important to the building owner. You can still see through the window, you can still see what's on the other side. So there's a lot of benefit, aesthetic and energy benefit to the insert versus the solar shade, for pretty much the same cost. And then my last question is obviously, you know, interest rate environment has changed and just - understanding stuff line of sight on the debt financing, but this must have thrown a little bit of a wrench in that as we've gone through the process, nothing to do with you guys, but the environment. Yes, it's kind of embarrassing, because we thought we were going to close this debt, you know, sometime in the summer, and then it became sometime in the early fall. And now clearly, it's going to be sometime in the winter. And the impact on the rising rate environment is not - affected our term sheet or the business terms of the debt, it's just taken a lot longer to, you know, kind of find that match. And so, we're going to continue with both and, you know, hopefully one gets to the finish line before the other. So, but we're still very confident that what we have from a product and technology perspective is very, very interesting to a lot of debt funding sources. And so - we'll continue to move forward, but we haven't seen that big of an impact frankly, to the terms, we've kind of had these terms locked down since like August timeframe. Just following-up on the debt, you know, it sounded like he had some terms in place and curious one - some type of terms in place since August. Yes, so the delayed in funding has definitely delayed our product delivery, our first product delivery was supposed to be this quarter, it's been shifted to the next to Q1, '23. And that's really a function of - one thing and one thing only that's capital resources that we didn't have previously, but we now do have. And we have three, three, maybe four customers that we'll be delivering product to in Q1 that we expect to in Q1. Sure, yes, so - small companies that are pre-revenue, you can never have enough capital on your balance sheet, I think it's safe to say. We haven't seen a tremendous amount of inflationary pressure on our own bill of materials, I mean, slight, but not anything outrageous at all, and we kind of - we were kind of predicting that this might be happening. So we've done a pretty good job in locking down some of our pricing and, and getting some inventory in place already doesn't mean that we have everything we need. But we feel comfortable with the amount of capital we have on the balance sheet, we feel comfortable with the amount of runway that gives us to get first product in. And frankly, we feel really comfortable about, the potential of the debt capital coming in or frankly, we have a couple of strategics that we've been talking to, and we feel pretty comfortable, they're going to be there for us if we need them as well. And it really all gets back to the strength of the technology and the product, and what our partners are seeing - in the product and what that product can do in the market. At this time, I would like to turn the call over to Mr. Doug Croxall, CEO and Chairman for closing remarks. It's - today is not only Veterans' Day, but today is actually the birthday of my - one of my grandfather's like Grandpa Croxall, who passed about 30 years ago. We're doing everything that we can to get this product ready and get this product out to the market, because we know that that impact is pretty important for the environment and for the future generations behind us. Ladies, gentlemen, this concludes today's conference call."
}