{
    "symbol": "CRKN",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-12 13:23:12",
    "content": " I’ll now hand the call over to Allison Soss, Investor Relations for introductions and the reading of the Safe Harbor statements. Good morning, everyone, and welcome to Crown’s fiscal 2022 second quarter conference call. With us on today’s call are Doug Croxall, Crown’s Chief Executive Officer and Chairman; and Joel Krutz, Chief Financial Officer. Before we begin, I would like to remind you that today’s call contains certain forward-looking statements from our management made within the meaning of Section 27A of the Securities Act with 1933 as amended and Section 21E of the Securities and Exchange Act of 1934 as amended. These statements are subject to numerous conditions, many of which are beyond the control of the company, including those set forth in the Risk Factor section of the company’s Annual Report on Form 10-K for the fiscal year ending March 31, 2021 filed with the SEC. I’m going to start in get my report on the operational performance of the quarter, and then I’m going to hand it over to Joel who’s going to go through his report on our financial results. It’s an affordable, solar powered insert, which does not require hard wiring and can be easily installed in the interior side of the existing window in commercial office. Crown’s DynamicTint, which is our pigment based in film was initially developed by HP and is based on our proprietary and patent protected electro kinetic technology. Crown Smart Window Insert easily installs into a building’s existing window frame, leaving the existing window intact. At this time, Crown’s engaged with over two dozen REITs through an iterative customer discovery process. While previous technologies focused on smart glass market have been around for over two decades, these technologies have frankly fallen short of what the market demands and what the market can afford with legislative support and growing social awareness, building owners and tenants today are more aware of their surroundings and becoming more environmentally conscious in their decisions. Earlier this year, we launched our initial field test in May, June of the summer from the 22nd floor of the Los Angeles building, where our patented ink technology was partially rendered into a window insert and then placed over single pane windows. In August, we announced the preliminary results that suggest the Crown Smart Glass Insert can reduce the HVAC energy costs of buildings by approximately 26%. We’ve continued to work closely with their executive, their ESG and their engineering teams to identify the most efficient and meaningful way, in which to migrate our DynamicTint technology into a product offering. With Hudson’s lead, we are identifying two buildings in California to rollout our Smart Window Inserts with the potential third building in the Northwest. As you’re also aware, we announced our first commercial agreement – MetroSpaces, a proptech-focused real estate holding company as our first customer. We’ll install our Smart Window Inserts in their 70,000 square foot Houston office building. Since our last call, we’ve made key new hires rapidly expanding our engineering, manufacturing, and marketing teams. And most notably, to help this growing team, we’ve welcomed Mindy Hamlin as Vice President of Engineering. Looking ahead, we’ll continue to add talent as part of our rollout for our commercialization strategy. Now, I’ll pass the call on to Joel, who will review our financial results. Crown’s net loss for the quarter ended September 30, 2021 was $5.7 million, which included $3.1 million of non-cash stock-based compensation expense. This facility would potentially provide Crown with access to additional financing for our operations, if required during the company’s production ramp up phase for the next two years. And finally, to better align Crown’s operational and financial calendars, we’ll be changing our fiscal year end from March 31 to December 31 effective this year. This will mean, we close out the current fiscal for the nine months stub yet, and we’ll begin our new fiscal year reporting from January 1, 2022. Now, we’d like to open the call for questions. Please state your question. It doesn’t sound exactly if the agreement is entirely formalized, but curious on that front, but two buildings to three buildings, what Hudson may be looking for and obviously they have 110 other buildings. And what we’re trying to do is identify the first couple of buildings would make the most sense for us to rollout and for Hudson, a lot of their buildings are owned with other partners. And so one of those buildings that we’re targeting, we want to get as much exposure as we can, not just the Hudson, but some of their other financial back. It’s looking like, it’ll be a building in the LA area, a building in the Bay Area, in a building in either Seattle or Vancouver. So, and it’s not a trial, I mean, this is a real customer contract, where they’re actually buying the product and we’re building it and installing it. And there’s a lot of decision-making that goes into, which buildings when you have 110. I suspect, I mean, in the press release, you highlight two buildings and then potentially third, but there’s – it sounds as though there’s also a discussion for additional buildings behind me as well. And then obviously, I know, you’ve been speaking and meeting with a bunch of REITs and you mentioned it too doesn’t REIT that you’re in customer discovery process. And maybe could you provide some qualitative background as to, what you’re discussing, what the feedback is, and this is obviously a customer funnel. And because this is our product kind of straddles operations, engineering, ESG, tenant relations, leasing, there’s a lot of different parties that are interested in what we’re doing within the REIT. So the first few meetings are literally explaining what a Smart Window Insert is, because one doesn’t exist anywhere other than what we’ve made. And so far, we’ve been – I don’t want to say bad in the film, but we’ve not had any REIT say, we’re not interested in moving forward. Most of what we hear is, when can we get a demo, when can we get a prototype sent to our facility and that’s what we’re quickly building and getting out to the market. So it’s a bit of a process, but that process has been ongoing. And so we’re kind of coming towards the end of the funnel, if you will. And final question as obvious, has to deal with manufacturing capacity sort of, that’s obviously the next step in the process. How’s that coming along and maybe address the buildup positioning and if you’re having supply chain issues that you’re hearing, like, acknowledge them across a lot of conference calls, if you’re having any issues on that front as well. I know that a lot of companies are, we have not – doesn’t mean that we won’t in the future, but we have it. So if we do, that’s obviously a risk that we would publish in our Q’s and K’s and let the market know. But so far, we haven’t seen anything, where that does not mean that we won’t. As a matter of fact, my office overlooks Santa Monica Bay, and every day, there’s more and more cargo ships that are lining up on the horizon. So I know it’s a problem, but it hasn’t reached us yet. As far as manufacturing capabilities, we’re able to make our own film right now. And we’re also looking at how to expand and when to expand, so that we can meet what we think is a growing demand from our current and prospective customers. So it didn’t cover the mulling, the mulling is the frame. And so we redesigned – and frankly, the gasket didn’t look like it fit in the building. And so the second go around with the new framing design is more insulative, because it’s covering the mulling and therefore protecting a lot of that heat from radiating into the office. And the perspective customers that we’ve demonstrated the new framing system for, frankly, couldn’t tell the difference, is matter of fact, many of them said, this looks exactly like it was a part of the building when the building was built, 30 years ago. So – and then as far as how that relates to their field test, Jeffrey, is that we’re trying to get a number of days, where the weather – now matches the weather pattern that we used – that we experience, I should say, over the summer for the first field test. We have a pretty good dataset, but we want to have a pretty robust data set, because it’s an important number. So we’re going to – we’re continuing to test, hopefully in another three or four weeks, we have enough meaningful data in our data set to draw that comparison. And the way I would categorize it is that they’re very good assets for Crown to own, because there are some claims in the portfolio that cover areas of technology that we very well may see our product and technology move towards. So we want to have ownership in that area so that we can make use or sell a product without worrying about infringing, somebody else’s patents. I’ve been really quite impressed by Crown’s comprehensive preparation for product rollout, such as, the proper packaging for transport that you should maybe when we did a virtual visit. Now I say that, in two hours, I’ll get a phone call from Corvallis and they’ll say, oh, there’s something we don’t know. And it’s really just – right now, it’s a process of getting the tools built, getting the lines assembled and getting the lines running. And frankly, when you look at the roster of employees that we have working on this, I’m blown away by the quality and integrity of our workforce. Please state your question. So oftentimes, it’s can we see the demo and I’ve been little travel recently, but we’re going to be back at it. And the nice thing about this insert, it’s not the same as buying a window. If you’re buying a window for a building, that means you’re removing a window. It’s a much more complicated and inconvenient process than a window insert where yes, I’ll buy a 1,000 inserts and put them in a building and see how it goes. I mean if they don’t like it, they can always remove it. And you can’t – it’s not like three years ago, we sat down and we decided, okay, when we get this technology working, let’s productize it into an insert because at late 2021, there’s going to be a lot of momentum for building owners to do something to reduce their carbon footprint. So the iterative process is really understanding where our inserts can get, which buildings need them, what’s easy for us to deliver in order to satisfy the demand that we’re seeing from some of the REITs. So we’re in that – look, we’re in a really unique place right now for five years, the core team of engineers have been at trying to develop this technology. It’s an incredibly satisfying journey, and it’s a really – it’s an awesome place to be. So right now, it’s just about getting out meeting with that we’ve been talking to and starting getting them to sign purchase orders delivered. And then they look at their portfolio of buildings and say, let’s start with this one or someone like Hudson a couple of trying to understand what – how do you think that they would roll out or with if you having success in Hudson, would people be more aggressive and say, okay, let’s take bigger bites at the apple. And some are like we’ll try with a couple of buildings and see how it goes for six months, and then maybe we’ll expand. Also a good problem to have, but we’re moving in that direction right now. So to answer your question, Shawn, it’s a little bit of both. So the way that will do our installation and we’ve done an installation already, we did it in our office in Los Angeles. It’s not hard, but it is a manual process. So we’ll likely have – we’ll start off with pure Crown employees doing all the installation, because we want to understand the best, fastest, most efficient way to do it with the least amount of inconvenience to our customers. But over time, it’ll likely look like a crew leader from Crown employees with a team of laborers that are probably locally sourced that are handling the installation in buildings. And so we’re thinking through those problems and those processes right now, we think we have a pretty good plan for it. Please state your question. When we look at IT, we look at where the – what the IT claims to have invented, and we look to see if that’s something that we need for our current product or potentially for our future plans. We also look to see if potentially it’s a claim, a patented claim that could be used by a competitive technology out in the marketplace. So all of those factors kind of come to bear when we make a purchase decision and it’s not so much led by the manufacturing process right now is the actual product or what the product might be or a product that’s being used, sold, or manufactured by a competitor. And it doesn’t mean we won’t look for manufacturing process type intellectual property, we certainly will. And we’ve actually designed shipping containers, not the containers that go on a semi truck, but our own containers that hold our inserts in a way that allows us if we have to store it in a building over long periods of time. We think that once the inserts arrived there’ll be installed, because they’re installed pretty easily on the inside of the office. At this time, I’d like to turn the call over to Mr. Doug Croxall, CEO and Chairman for closing remarks. Sometimes it felt like we’d take three steps forward and 16 steps backward, but we’re finally getting to that point where we can see all of the efforts that we put into this start to bear fruit. And I want to thank everyone who participated in that process, and I’m really excited about what we have in store, not only for our shareholders and not only for our customers, but for the world moving ahead."
}