{
    "symbol": "PACB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 00:08:05",
    "content": " However, the region remains mostly resilient as it posted record revenue and grew over 50% compared to the second quarter of last year, as weâ\u0080\u0099re growing in multiple markets from human genome to gene editing, to microbiome, the strength and diversity of our customers in the U.S. market gives me confidence that other regional headwinds are only temporary and we will re-accelerate going into the next year and beyond. We reported $35.5 million in revenue in the second quarter, representing 16% year-over-year growth, which was in line with our guidance for sequential growth. As discussed, we reported $35.5 million in product and service revenue in the second quarter of 2022, which represented an increase of 16% from $30.6 million in the second quarter of 2021, and 7% sequential growth compared to $33.2 million in the first quarter of 2022. Turning to consumables, revenue of $14.6 million in the second quarter grew 19% from $12.2 million in the second quarter of last year. Asia-Pacific revenue of $8.0 million reflected a 18% decline over the prior year period primarily due to China, which was 30% lower compared to the second quarter of 2021. Finally, EMEA revenue of $5.8 million was 12% lower compared to the prior year period and was impacted by broader macro dynamics, which slowed customersâ\u0080\u0099 capital purchases. Excluding amortization of intangible assets, second quarter 2022 non-GAAP gross profit of $16.4 million represented a gross margin of 46.2%, compared to a GAAP and non-GAAP gross profit of $13.8 million or 44.9% in the second quarter of last year. The increase compared to the second quarter of last year was partially driven by a multi-instrument order at higher ASPs, as well as greater consumable and service revenue volume due to a growing installed base of Sequel II/IIeâ\u0080\u0099s in Q2 2022. This represents a 74% increase from non-GAAP operating expenses of $51.3 million in the second quarter of last year, reflecting growth in headcount, operating expenses related to the acquisition of Omniome, increased R&D spend, and increased travel as we transition out of the pandemic remote environment. GAAP and non-GAAP operating expenses in the second quarter included a total non-cash stock-based compensation of $18 million, compared to $13.9 million in the second quarter of last year. Long-term deferred revenue declined approximately $23 million and current deferred revenue increased approximately $21 million for a net change of approximately $2 million in Q2, primarily as a result of a multi-instrument order from Invitae in the quarter as well as future credits awarded to Invitae via the amendment to the co-development agreement."
}