{
    "symbol": "PACB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 02:09:11",
    "content": " Before we begin, I'd like to remind you that on today's call, we will be making forward-looking statements, including statements regarding predictions, progress, estimates, plans, expectations, intention, guidance, expectations for, including advantages and capabilities in connection with new products, technology and software development and launches, and the anticipated timing of such development and launches, expectations resulting from continued building and enablement of HiFi ecosystem, expectations with respect to our partnerships and collaborations, estimates, intentions, and plans to use the company's cash and investments to fund current development and commercialization initiatives until achieving positive operating cash flow without the need to raise additional capital and other information. As we discussed on our last call, first quarter revenue was lower sequentially due to the COVID-19-related headwinds that disrupted our customer operations and our internal team's ability to act -- interact with customers. Revenue of $12.7 million in the first quarter grew 22% from $10.4 million in the first quarter of last year and Sequel II and IIe consumables represented approximately 85% of our total consumable revenue in the first quarter, with the rest from older systems and other consumables. America's revenue of $19.1 million grew 57% compared to the first quarter of 2021, as the region delivered a record number of systems and grew consumables and service revenue commensurate with a larger install base of Sequel II and IIe. Specifically for the second quarter, we expect revenue to grow sequentially compared to the $33.2 million reported in the first quarter of 2022, with sequential growth in both Americas and EMEA partially offset by a slight decline in APAC due to the record consumables revenue quarter we experienced in Japan for Q1. And what specifically -- it sounds like you're assuming by the end of the quarter, Q2, it's kind of getting back on track kind of what's assuming in Q2 and for the rest of the year for China. And we're obviously moving towards the higher end first, because we see incredible opportunity in whole genome sequencing in particular at -- with higher throughput platforms, the ability to reach the sub thousand dollars cost, that we've talked about in the past. One of the things that in our executive business reviews this quarter was uncovered is that the time to get a new customer to run their first chips or first smart cells could be as much as 90 days from when it's installed, because they're working on workflows, et cetera, et cetera."
}