{
    "symbol": "PACB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 18:03:04",
    "content": " In the fourth quarter, PacBio achieved revenue of $27.4 million, a 24% decrease compared to the previous year's quarter. From a regional perspective, America's revenue of $12.0 million declined 36% compared to the fourth quarter of 2021, primarily driven by lower Sequel II, IIe replacements, with the recent announcement of the Revio launch. GAAP and non GAAP gross profit in the fourth quarter reflects loss on purchase commitments and adjustments for excess inventory, totaling approximately $7.1 million, primarily related to a faster than expected ramp in Revio demand, which results in faster than expected decline and Sequel II, IIe demand upon the launch of Revio. Our expectation is with Revio that, sure the earliest shipments will probably be to the higher throughput and highest throughputs, and that'll probably be mostly through Q1 and even a lot of Q2, but we're going to -- it's really important that we provide this technology to all of our customers, and so we're going to try really hard to be to, you know, to get some of our lower throughput customers, which we think will be the high throughput customers of tomorrow, the system as soon as we can. So we have been very clear with our customers and we are -- one of the things we are trying to do is, we are laser focused on our customers, that's one of our core values and helping them understand, timing of when they're going to receive Revio when they utilize -- utilization of Sequel IIe consumable and II and IIe consumables. Some customers that have ordered, say recently, that it's likely that they're not going to get their Revio for a while, so they're going to continue to run their projects on Sequel IIe. And what's happening is that they will bring a Revio machine into their lab and they'll start to move projects away from short-reads to long-reads for exactly what you said, the benefits of completeness, structural variation, being able to see phasing straight out of the gate without any tricks, epigenetics, you know, there's just, it's just become so apparent that there's so much advantage to looking at long-reads over short-reads, in most applications, and that you're starting to see a lot of people start to make that switch and move forward. As we get Revio out the door and prepare for Onso, and then you're going to see us continue to focus over the second half of the year and into next year on how you integrate with bundles, how you increase the performance of both Revio and Onso quite frankly, and then increase our value to the customers."
}