{
    "symbol": "MIDD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 16:29:07",
    "content": " We plan to see growth in commercial too, our leading technology, customers' development plans and our backlog are amongst the growth drivers, piecing this all together, for the year with full year-over-year growth and margin expansion in two segments and with resi likely seeing second half year-over-year growth, we currently see total companies - total company revenues up modestly and growth in EBITDA dollars and margins. So I mean, I think as we've continued to take pricing, inflation has continued to come through even in the back half of the year, you see some of the commodity items going down, but as you kind of dig through things like electronic controls and another. Yes, so we are going to continue to see the destocking in the first part of the year and it's not only, again, our products coming up, but I mean there is inventory of other brands that they've got in the inventory, so they're not going to load up on, let's say, some of our new products until they got inventory levels overall. And then, we can't say precisely, we are inventory in the channel is going to be at that point, but I think we feel like we're in a much better situation going into the back half of the year and perhaps could see growth because inventory levels are reset and we do feel like there is some momentum in the platform. We've invested in our ICE platform, a number of our cooking platforms, particularly areas where we see large market opportunities where we think we're going to have longer-term organic growth and where we're launching new innovations across the company. So I mean I think we've been seeing the benefits as we've gone through the year, and we still have, I'll say, more equipment that's getting turned on as we speak here, particularly in the fabrication areas, we're really trying to automate our factories more and more and fabrication tends to be the pinch point."
}