{
    "symbol": "MIDD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 20:20:21",
    "content": " And I'll say that I mean we've got multi-year strategy here, investing in the platform innovation brought to market, but we feel -- continue to be despite the disruption early on, very excited about that platform and the growth opportunities, as well as the targets that we have mentioned about the journey to 20% EBITDA margins over the next three years. I mean, I think as we mentioned, we continue to have overall double-digit increase in orders in Q1, we haven't posted that, but I mean, we saw continued trends at the beginning of the year, but as we've kind of moved into the April period, that's where we've seen it slow a bit. But now we've got a new wave of price increases, which we've addressed that kind of pushes things for another, let's say, quarter to two given our significant backlog, but we are confident that the price increases that we've taken already capture what we've experienced so far with a lot of the recent cost increases that certainly we didn't anticipate at the beginning of the year given what the drivers for those increases have been. I mean certainly, we are probably most sensitive to the residential part of the market, but I just also kind of point out that the premium end that we play in is not only the housing market has shown to be a little bit more resilient, but that demographic, the customers -- let's say there is a little bit more ability to cover the price in that segment of the market. Now, we say that with a lot of uncertainty and a lot of hard work that's being done, but I mean I think those are the efforts that have been underway for a while and we've -- that's where we work closely with a lot of our strategic suppliers that make sure they're making the proper investments in their businesses as well. And I think the holding the margins that is some of the benefit of the strategic and operating initiatives that we had been executing on that still the benefit over the next couple of years, but I mean I think that's kind of where we're at in this continuum of supply chain. But I'm not going to say we're going to do right now from a quarter perspective, but certainly, we believe in the strategic initiatives and where the company is headed, we -- despite some of these near-term challenges we're all working through, we've got a very confident positive outlook where we're going into the next several years. Now, we've talked about that we're not able to sequentially take huge jumps, right now, so I mean I'll let you do your modeling on how much the other two's kind of ops would need to be to offset down in one but hopefully a little bit I comment there maybe are able to let you put some size, the magnitude of the swings a little bit."
}