{
    "symbol": "BB",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-28 05:50:25",
    "content": "  Operator: Good afternoon, and welcome to the BlackBerry Second Quarter Fiscal Year 2023 Results Conference Call. My name is Brent, and I will be your conference moderator for today's call. I would now like to turn today's call over to Mr. Tim Foote, Vice President of BlackBerry Investor Relations. Good afternoon, and welcome to BlackBerry's Second Quarter Fiscal 2023 Earnings Conference Call. With me on the call today are Executive Chair and Chief Executive Officer, John Chen; and Chief Financial Officer, Steve Rai. After I read our cautionary notes regarding forward-looking statements, John will provide business update, and Steve will review the financial results. We'll indicate forward-looking statements by using words such as expect, will, should, model, intend, believe and similar expressions. Forward-looking statements are based on estimates and assumptions made by the Company in light of its experience and its perception of historical trends, current conditions and expected future developments as well as other factors that the Company believes are relevant. Any forward-looking statements are made only as of today, and the Company has no intention and undertakes no obligation to update or revise any of them, except as required by law. As is customary during the call, John and Steve will reference non-GAAP numbers in their summary of our quarterly results. For a reconciliation between our GAAP and non-GAAP numbers, please see earnings press release published earlier today, which is available on EDGAR, SEDAR and BlackBerry.com website. Good afternoon, everyone, and thanks for joining today's call. This was a solid quarter for BlackBerry, delivering revenue in line with expectations and beats on the earnings. This quarter, IoT delivered strong 28% year-over-year revenue growth. When we win a new design, this revenue is the first to be recognized with royalties coming later when a vehicle enters into production. This strength in design-phase revenue is expected to continue, given the significant amount of professional services we already have lined up and the pipeline of potential new design wins in the next few quarters. On the production front, we saw an uptick in royalty revenue, but it remains below the pre-pandemic level, mainly due to supply chain headwinds. The strength of design wins was clearly illustrated by Volkswagen, one of the world's largest automobiles selecting BlackBerry QNX for its new VW.OS platform. This builds on design wins in recent quarters with BMW, Volvo and a long list of electric vehicle players in China. On the EV front, we won another ADAS design with the Chinese automaker, and BlackBerry QNX is now embedded in 7 of the China's 10 largest EV OEMs. In addition to our strong position in auto, we have significant opportunities in the other verticals, too. This quarter, we announced additional support for the aerospace and defense market, with QNX achieving the latest technical standard known as the Future Airborne Capability Environment, or FACE. FACE is a software standard, jointly developed by government and industry that establishes a common operating environment. It enables the reuse of software components across different hardware, reducing developer friction and costs. In addition to aerospace and defense, we saw progress in the medical and industrial markets with wins that include surgical robotics, a retail distribution pick-and-pack robot as well as control for a nuclear power plant. Overall, in the quarter, we won 19 new designs with 9 in auto and 10 in the general embedded market. This investment is supported by the large and growing schedule of professional services secured through the recent design wins, and by adding headcount, will enable additional revenue. In North America and Europe, however, there appears to be a short-term contraction with certain chip supplies, constraining the ability of OEM to build inventory and meet demand. Going forward, the impact of rising interest rate on consumer financing, together with economic uncertainty created by the possibility -- creates the possibility of future choppiness. Despite this ongoing challenge, we're delivering strong year-over-year growth and have a solid pipeline of potential new designs coming in the upcoming quarters. Normally, given the strength of the QNX business, we will adjust our revenue outlook upwards. However, given the macro headwind, we've been prudent in holding our outlook as is. We expect fiscal year '23 revenue for the IoT business unit to still be in the range of the $200 million to $210 million, as previously stated. You may recall that we are currently running a limited number of these trials, including the top OEM and Tier 1s and these are progressing well. We continue to receive requests for additional trials, and this ongoing demand remains a positive sign of the customer receptivity of IVY. On the ecosystem side, we were excited to close another investment by the IVY fund this quarter in a German start-up named COMPREDICT. COMPREDICT uses AI to enable automakers and fleet providers to utilize predictive maintenance, i.e., using vehicle sensor data to get ahead of the maintenance issues. The predictive maintenance use cases are added to many others that IVY is enabling, including usage-based insurance, intelligent EV battery management, in-vehicle payments and the next-generation 911 emergency response, just to name a few. Looking ahead, we expect our product -- our next product release in December and remain focused on IVY design wins, which we currently expect to secure in calendar year 2023. Gross margin was 55%, ARR came in at $321 million, dollar-based net retention rate was 85%. In the quarter, we closed business with a wide range of customers but saw particular strength in our core verticals of government and financial services. In North America, we secured business with the Department of Treasury, the Federal Trade Commission, Department of Energy, the IRS, the New York Stock Exchange and the U.S. Mint. We also won business with leading merger agency such as the U.S. Army Corps of Engineers, U.S. Central Command, U.S. Marine Corps and other branches of the Department of Defense. Internationally, we secured business with UK Her Majesty -- I guess, we changed that now, Majesty Treasury, the UAE Ministry of Presidential Affairs, the New Zealand Parliamentary Services, the Australian Electoral Commission and the Polish Ministry of Foreign Affairs, just to name a few. In financial services, we won new logos as well as renewal and upsells with leading banks in U.S., UK, Switzerland, Japan, Israel, Italy, and more. In addition to these core verticals, we recorded a strong quarter for new business in the middle market. This is a large segment of the market dominated by legacy players, offering legacy solutions and one where our Cylance product portfolio is resonating well. Customers in this segment, particularly like our lightweight agent and how effective our products are at detecting threats. Our AI engine, the most mature in the market has seen billions of data points, both malicious and non-malicious and used machine learning over several years to effectively distinguish between the two. Further, mid-market customers are among those with the fewest resources and expertise to staff a 24/7 security operating center. As we described in previous quarters, there have been some headwinds for Cyber ARR. However, we expect ARR to return to grow early next fiscal year. First, we saw the total pipeline of potential opportunity for our Cylance product at the end of Q2 increased by 23% year-over-year; and for new logos specifically, the increase was 73%. Second, significant progress has been made with the product portfolio in recent quarters and is continuing. For example -- I'll give you an example, recent enhancement to our PROTECT EPP product have positively impacted our false positive rates as evidenced by trusted third-party VirusTotal. Third, on the go-to-market front, weâ\u0080\u0099re working to replicate the success we already had, particularly with the mid-market customer, we added a lot of cybersecurity industry experience this year, and we expect to see more traction as these new hires fully ramp up. Fourth, this coming quarter, weâ\u0080\u0099re commencing a program to build strong relationship with key channel partners and distributors that are well-established players in the cybersecurity market. We also received a lot of positive feedback following the Cylance product rebrand, including a significant increase in both website traffic and new leads. Turning to the overall demand environment for cybersecurity, the rest of the FY23 looks fairly solid. As I mentioned earlier, BlackBerry has a strong government footprint and demand in this vertical appears to still be robust. Overall, weâ\u0080\u0099re not seeing customers cutting back on the cybersecurity budgets, even in the middle market, given how critical it is to maintain their cyber defense. Therefore, there are no changes to the outlook that we have provided previously. We understand that the length of time that this has taken is frustrating for shareholders, and we are equally as frustrated, if not more as we work on it every day. However, we firmly believe that divesting the portfolio remains the best option for shareholder value. While the portfolio is still relatively fresh, the IP thatâ\u0080\u0099s part of the deal and the businesses monetizing it, itâ\u0080\u0099s not related to our core business. At the time, we were required to announce the deal, we understand that getting the government approval could take up to 210 days, if not longer, but we were pleased that the process was completed much sooner. Catapult, who are working to conclude their financing in parallel to getting government approval. Unfortunately, we believe the turmoil in the financial markets created unexpected challenges for their original financing syndicate. However, there has been much interest from other parties wanting to step in take their place, and Catapult are currently working to lock down their final syndicate. In parallel to this, weâ\u0080\u0099re actively working on an ordinance where financing is not a contingency, as well as finalizing our plan to restart the monetization engine ourselves, should that be necessary. Let me now hand over the call to Steve, who will provide additional colors on our financial results for the quarter. As usual, my comments on our financial performance for the second quarter will be in non-GAAP terms, unless otherwise noted. And these non-GAAP operating expenses exclude $22 million in amortization of acquired intangibles, a $10 million fair value gain on the convertible debentures, $5 million in stock compensation expense, $4 million from the impairment of long-term real estate lease assets and $3 million of restructuring expenses. BlackBerry continues to make carefully considered investments for top line growth, such as adding additional headcount to the IoT team in response to our strong schedule of professional services from design wins, as well as expanding our reach in the cyber market, as John outlined earlier. The non-GAAP operating loss for the second quarter was $22 million, and non-GAAP net loss was $29 million. The GAAP basic loss per share was $0.09, and the non-GAAP loss per share was $0.05. Adjusted EBITDA, excluding the non-GAAP adjustments previously mentioned, was negative $16 million. Now, breaking down revenue in the quarter. Software product revenue remains in the range of 80% to 85% of total revenue, and professional services formed a balance. As before, approximately 80% of software product revenue was recurring. Total cash, cash equivalents and investments were $699 million at August 31, 2022. Before we open the line up for Q&A, let me summarize the key points for the quarter. Number one, our IoT business unit delivered strong year-over-year revenue growth, in large part driven by ongoing strength from design-phase revenue. IVY remains firmly on track with proof-of-concept trials progressing well, and the team is executing on the product development roadmap as planned. Our Cybersecurity business unit, net revenue expectation, delivering strong sequential business growth and continue to implement a strategy to build the business with ARR expected to return to growth early next fiscal year. Despite the volatility in the macro market, we are maintaining our revenue outlook for both business units and continue to execute against our plan. Your line is open. If you kind of delve in a little bit more to the Cybersecurity business, the billings commentary sounds promising. So the UEM, as you know, itâ\u0080\u0099s a very price-sensitive market on the mid and low-end, and particularly dominated by one major player in the market, including Cylance and so forth. For the higher-end markets, where they absolutely needed better security, we tend to hold on to those businesses well, and in some cases, expand on it. We also have -- in addition to just the UEM, secure communication and also an opportunity to upsell our UES product, too, the Cylance product. So on a whole for the UEM, we kind of expected our sales to holding in pretty flat. And then, weâ\u0080\u0099ll have a way to grow the business next year by bundling some more other stuff and new products that come out and features. The final point Iâ\u0080\u0099d like to make is, -- Microsoft, for example, their Intune is really a mobile application manager. So, the customers are beginning to recognize that the security side of the equation, theyâ\u0080\u0099re not fulfilling their requirements. So, I think there might be a good strong argument for us to either overcome their tech from Microsoft Intune or actually coexist with them in account that absolutely needed mission-critical security. So, thatâ\u0080\u0099s kind of our game plan and our current thinking. And we feel reasonably good about what I just said in terms of where the market validation has been, especially with big customer. So either weâ\u0080\u0099re going to have to follow up with you, and youâ\u0080\u0099ll want to check with John G on those information. And the legacy product line, itâ\u0080\u0099s interesting, we see actually the most progress we made is against the legacy player, particularly in the mid-market, where the mid-market doesnâ\u0080\u0099t really have a CECL, doesnâ\u0080\u0099t have a SOCs what we offer, and particularly Guard, which is the managed service, thatâ\u0080\u0099s very well, resonates really well. The numbers are not huge in terms of the actual amount of dollars, but the number of accounts that weâ\u0080\u0099re winning are reasonably sizable. Your line is open. My first question, maybe a little bit of a bigger picture question. John, Iâ\u0080\u0099d be curious to get your updated perspective on the auto software competitive landscape in regards to the IoT business. In the last few months here, weâ\u0080\u0099ve seen both companies that havenâ\u0080\u0099t traditionally played in auto looking to make inroads here and in some cases, announcements with customers and some of the chip companies as well talking a bigger game of auto software. So, QNX is probably the biggest player in the auto embedded software space, particularly in the area of operating system. I will refer you to the last two, three quarters of big win in BMW, in Volvo, in Volkswagen and a lot of the electric vehicle players. And because we occupy a pretty unique position on the stack, most people, when you talk about a big company want to get into auto software, they tend to be more on the UI side, user interfaces, more on the infotainment side, but sell them under the core side of the deck. And so, we are one of the players they take because of operating system. As far as your question -- so we feel pretty good about where we focus and the more mission-critical and safety certified components of our products, and there will be more that will come out. And we have -- just in case you donâ\u0080\u0099t remember this, but we have the highest level of ISO Certification in safety. So, we feel pretty good about our position. As far as the question on chipset, probably the two or three biggest chip players that we work with are very committed to each other for a very long time, and particularly two of them are Qualcomm and NVIDIA. And as you know, Qualcomm and NVIDIA are quite dominant in the auto space. So, we feel very comfortable in both our partnerships and their position in the market and our position in the market that doesnâ\u0080\u0099t overlap. So, I think just being overly -- I donâ\u0080\u0099t want to jinx it obviously, but we feel pretty good. And in addition to that, even players like Google, I think a quarter ago or two quarters ago, has adopted our Hypervisor as their Google Android Auto play. And then, staying within IoT for my follow-up, you recently announced that youâ\u0080\u0099ve gained certification in the aerospace market. And so, when we look at the success in our auto market, itâ\u0080\u0099s really all rely on the highest level of safety certification. And weâ\u0080\u0099ve been doing reasonably well on what we call the gen market -- General Embedded Market, which medical and industrial is in there. But we are very interested in the cycle of replacing some of the legacy software in the aerospace, particularly aircraft area. And so, this is why we want to make sure that weâ\u0080\u0099re certified so that developer can reuse the code. And we likely will work through large system integrators like Raytheon and -- of the world, but thatâ\u0080\u0099s to the extent that I can share at this point. Your line is open. Well, itâ\u0080\u0099s a -- so first of all, QNX, the operating system has been in the business for over 30 years. And you all remember that -- I mean some of us, not all remember that. But, it was way back when it was the infotainment company, itâ\u0080\u0099s actually belonged to Harman. So, what we have done since the time I arrived, what we have done is to expand from infotainment into areas of more safety-oriented and security-oriented applications actually related to a car. And, of course, then in parallel, the world started to move towards the software-defined vehicle. Now, some people try to use the Auto Grade Linux, AGL, but AGL couldnâ\u0080\u0099t get it certified, and itâ\u0080\u0099s an open source also with a -- has its own business challenges to it. And then, being -- having over 200 million cars that use our software today actively, it will present a pretty sizable market for a lot of other players to ignore, so -- or a player to be ignored. So, this is why Google works with us and Qualcomm works with us and NVIDIA works with us, and TI works with us, and ARM works with us, and itâ\u0080\u0099s a long list of players that all use us, as a said foundational piece. Itâ\u0080\u0099s -- well, our strategy is obviously use more of our foundational modules in the stack. And then, if you have multiple copies and then as we get deeper into the engine and deeper into the safety side of the equation of a car operation, it will -- QNX will be able to demand -- or command a little bit more ARPU. So, we have more copies and higher-value copies like Hypervisor is -- have a higher value than infotainment, for example. And then, donâ\u0080\u0099t forget IVY, because IVY is our next-generation push into edge-to-cloud. And it not only provides security and privacy, it also provides economics because cloud-only solution is too expensive, and itâ\u0080\u0099s too much data being generated along the operation of a car. So, we feel that we have a pretty good one, two, three punches on the auto space or at least on the IoT side, and weâ\u0080\u0099re going to expand it beyond auto, as I said. But today, weâ\u0080\u0099re very focused on auto. Just in regard to the patent portfolio, I mean, I know itâ\u0080\u0099s -- youâ\u0080\u0099re limited in terms of what you can say. And so, there are two data points, you already answered one, which is those that needed our license, will have to address the past deployment. So, itâ\u0080\u0099s not just time ticking away and therefore -- so thatâ\u0080\u0099s one of the answer to your question. There was an article published, itâ\u0080\u0099s factually incorrect, and itâ\u0080\u0099s factually incorrectly throughout -- almost throughout the entire article about the number of years for our portfolio and the value of that. Because if it had been true, then it wouldnâ\u0080\u0099t have to be syndicated still wanting to make this thing happen. Even though this article has been around for a little while, and this was reprint by a newspaper that would like to, I guess, sensationalize something that is not true. You indicated you still expect revenue to be roughly flat year-on-year, but implied in that comment is a seasonal uptick in the fourth quarter. And Iâ\u0080\u0099m just wondering, is that also still expected in line with prior expectations. Well, you commented on ARR growth expected early next year. So, itâ\u0080\u0099s a little bit of a complicated set of math, but Iâ\u0080\u0099ll focus on the kind of the high level. So, yes, our Q4 pipeline is a lot more bigger than Q3. And so, we believe that therefore my statement about the revenue relatively flat in line with the last fiscal year, itâ\u0080\u0099s a proper statement. And if you look at all the headwinds from all the deals that we expected to either get or renewed and ones that are being attacked, especially the mid-market state, we believe that the major part of our headwind is behind us, will be behind us after Q4. Sorry, I should say that because we kind of look through it on a quarterly basis. So therefore, next fiscal year, I donâ\u0080\u0099t know whether itâ\u0080\u0099s Q1 or definitely Q2, that we expect ARR to have a year-over-year increase, and we should continue that trend going forward. In fact, I had recently presented to the Board, we have not deviated from that -- deviating from that at all. So, you could see that from a John G group, the Cyber Security group, the compounded annual growth should be roughly about 10%. So, that will be what we will focus on getting. Your line is open. So, in general, if you look at a cycle of an auto win somewhere between 7 to 10 years, so what we will see upfront is that probably on an overall -- letâ\u0080\u0099s say, a deal brings us $1 million. Obviously, itâ\u0080\u0099s a lot bigger than that, but letâ\u0080\u0099s just start with $1 million. So, I would say the 10% upfront probably is something that we should expect and could expect on development seats. And then, probably there are some professional services revenue. So, I will put it again in the range of 5% to 10%. Now, the bulk of the production will come in year normally four, five, six, seven, eight. However, we see that compressing because of all the -- because weâ\u0080\u0099re going electrified, right, the electrification. Now, whether they will get to three or five years, who knows. So, we get a little bit of upfront, which is always nice. And then, we get some professional services, and then we will get the production royalty. Now, I was also wondering, you have a very solid offering in terms of IVY. And today, you mentioned the hybrid approach that is in cloud and on device, which is a vehicle, which is, I think, very novelty -- very novel, because you donâ\u0080\u0099t want the OEM to be finalized for success where the success means more data. And if the whole objective is to put the data into the cloud, you, that is, BlackBerry shouldnâ\u0080\u0099t or the OEM shouldnâ\u0080\u0099t be like a reseller of AWS. So, I like that strategy big time. I would now like to turn the call back over to John Chen, Executive Chair and CEO of BlackBerry for closing remarks. Before we conclude todayâ\u0080\u0099s call, Iâ\u0080\u0099d like to remind everyone about upcoming BlackBerry Security Summit on October 27th, in that particularly assess the keynote addresses with BlackBerry executives, customer-led case studies, interactive talk on cybersecurity innovation and best practice from BlackBerry Research and Intelligence team and more, all virtual and all on-demand."
}