{
    "symbol": "VLRS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-22 19:01:04",
    "content": " To illustrate the company's efforts at cost control and revenue management during this recent quarter, assuming an economic fuel price equal to the second quarter 2021, Volaris will have produced an EBITDAR of $292 million or 42% margin. During the second quarter, total revenue was $691 million, an increase of 20% compared to the same period of 2021 and 59% versus 2019. We were able to recoup significantly less of our fuel costs this quarter than in the recent quarters as economic fuel price we paid sore to $4.40, up more than 105% year-on-year and exceeding the highest levels in the company's history for the entirety of the quarter. International capacity grew by 25% year-over-year with the greatest contribution coming from the Mexico to U.S. market, where we also saw healthy growth despite the vaccine-related search in travel to the U.S. last summer. As detailed by Enrique, total operating revenues for the second quarter were $691 million, a 20% increase compared to 2021 due to higher capacity, healthy load factors and a solid net revenue. Higher fuel costs drove total CASM to $0.085 for the second quarter, a 35% increase compared to the second quarter of 2021. Furthermore, Volaris delivered cash generation of $9 million for the second quarter, closing with $759 million in cash and cash equivalents, representing 30% of the last 12 months operating revenue. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. I think from Volaris' perspective, what is very important is that for the second half of the year, as Holger said, we still have space for two additional aircraft to operate from Mexico to the U.S. And in the medium term, we are adjusting, obviously, our network growth plans to the U.S., given these results. You may now go ahead. You may now go ahead. Number one, there are some aircraft delivery delays from Airbus, that are going to impact us in the overall growth rate for the second half; and number two, given the higher fuel cost, we are constantly tracking capacity in terms of marginal contribution."
}