{
    "symbol": "VLRS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 06:20:17",
    "content": " Regarding our first quarter performance, we generated total revenue of $567 million in the period, an increase of 80% versus 2021 and 53% versus 2019. The incremental cost of fuel price and volume during the first quarter was $149 million, or a 157% increase versus the first quarter of last year. Volaris was able to pass through to revenues 95% of the factor in the quarter, sustaining a healthy 84% load factor for the period and closing the quarter with a TRASM level of $7.0. As proof of our success, trips per capita in Mexico doubled to 0.55 from our founding in 2006 to 2019, and this indicator is now back to an uptrend Volaris accounted for 56% of the domestic aviation growth in that period, primarily with first-time fliers coming from the buses and virtually doubling the size of the domestic market in terms of passengers. During the first quarter, Volaris flew close to 500 departures per day, an increase of 55% compared to 2021, serving over 71 different destinations in Mexico, the United States, Costa Rica, Guatemala, El Salvador, Honduras and Colombia. Consolidated ASMs for the second quarter of 2022 is expected to increase around 5% compared to the first quarter of 2022, implying about 20% ASM growth versus the second quarter of 2021. Total operating revenues for the first quarter were $567 million, an 80% increase compared to 2021 as detailed by Holger. Total CASM closed at $0.74 for the first quarter, a 13% increase compared to the first quarter of 2021, driven by higher fuel costs. Confirming the financial benefit of the renewal of our fleet, Volaris’s fuel efficiency measure in ASMs per gallon improved by 6.1% from the first quarter of 2019 to the first quarter of 2022, resulting in fuel savings of 4.7 million gallons or $14.7 million. Furthermore, Volaris delivered cash generation of $9 million for the first quarter, closing with $750 million in cash and cash equivalents, representing 31% of the last 12-month operating revenue. We expect to end 2022 with approximately 115 aircraft depending on Airbus delivery schedule compliance, increasing NEOs to 54% of our fleet, assuming no significant disruption related to COVID-19 regulatory and macroeconomic and geopolitical events with the impact on Volaris’s business and budgeting an exchange rate of MXN 20.5 to MXN 20.8 per dollar and an economic fuel price of $3.1 to $3.4 per gallon, we update our full year 2022 guidance as follows. So let me tell you that as we mentioned during the call in the first quarter, we demonstrated that we were able to offset 95% of the fuel price and volume increases and we sustained healthy load factors and traveling level."
}