{
    "symbol": "CHEF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 13:25:19",
    "content": " Our net sales for the quarter ended December 30, 2022 increased approximately 41.8% to $791.3 million from $558.3 million in the fourth quarter of 2021. Approximately, 6% of year-over-year sales was due to the 14-week fiscal quarter in 2022 versus a 13-week fourth quarter in 2021. Selling, general and administrative expenses increased approximately 40.4% to $153.4 million for the fourth quarter of 2022 from $109.2 million for the fourth quarter of 2021. On a non-GAAP basis, we had adjusted EBITDA of $50.1 million for the fourth quarter of 2022, compared to $30.2 million for the fourth quarter of the prior year. Adjusted net income was $18.8 million or $0.48 per diluted share for the fourth quarter of 2022, compared to $10.2 million or $0.26 per diluted share for the prior year fourth quarter. And I guess, I just wanted to ask about the 2023 outlook and what you're thinking on seasonality, because the way that we stay at about 85% of the company EBITDA is generally generated in the last three quarters of the year. And as Jim said, even though we had that extra week in last year's numbers that week to us it's almost like a throwaway week, because it's a week of travel, or it's a week of regrouping, and it fell in the fourth quarter, so we really didn't get much out of it. So of course, you would like to â\u0080\u0093 if you were at 25% and you can keep 25% you're making a lot of money because it's not really costing you more to move that box now that it went from $30 to $40. So when the opportunity comes to acquire really good small businesses, we'll start to accumulate them and then eventually put them either in a facility we own or build a new one and we'll consolidate them to give us enough volume where it makes sense to have the staff, the cutters, right, and part of the overhead to really attack a market, I think Allen Brothers stake in seafood in New York is a $0.5 billion business."
}