{
    "symbol": "JELD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-31 13:37:06",
    "content": " At this time, I would like to welcome everyone to the JELD-WEN Holding, Inc. Third Quarter 2022 Earnings Conference Call. After the speaker's remarks, there will be a question-and-answer session. Before we begin, I would like to remind everyone that during this call, we will make certain statements that constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. JELD-WEN does not undertake any duty to update forward-looking statements, including the guidance we are providing with respect to certain expectations for future results. Additionally, during today's call, we will discuss non-GAAP measures, which we believe can be useful in evaluating our performance. As Chair of JELD-WEN's Board of Directors, I'd like to start this morning's call with some brief remarks about our third quarter performance and share some of the Board's area of focus. In summary, in the third quarter, we delivered solid revenue and EBITDA improvements over the prior year. We've identified a short list of qualified internal and external candidates, and we're working closely with an executive search firm to further narrow our list. While I can't speculate on timing, we're actively moving through the process, but making sure that we find the right leader for the future success of JELD-WEN. To that end, we've made several leadership appointments this year, including Julie Albrecht, our new CFO, who some of you may have talked to. We've also refreshed our regional leadership in all our business segments, both Julie and our regional leaders have extensive management experience and we'll utilize their expertise to refocus the respective areas of the business and improve performance. One of the actions in the area streamlining the company, we initiated the strategic review of our Australasia business with a goal of maximizing value for both JELD-WEN and the business. As we move forward, we're certainly committed to sharing any meaningful updates with you as they materialize. Cathy's diverse skill sets will be a great asset to our Board, particularly in digital transformation, marketing and e-commerce. As a recognized leader in the global building products industry, JELD-WEN's brands, manufacturing capability and broad customer partnerships position the company for long-term success. Despite near-term headwinds in markets we serve, we know there are attractive and durable drivers of long-term growth. So with that, let me turn the call over to Kevin to expand on these areas and provide more details about some of our near-term actions before Julie takes on and describe a little more of the detail of our operating results. Since stepping in as interim CEO of JELD-WEN, it's been my mission to help guide our team through a period of market uncertainty and organizational transition. My objective is to try a focus across the organization to improve execution and performance, while laying the groundwork for further strategic actions so the new JELD-WEN CEO can hit the ground running. For more than 60 years, JELD-WEN has grown through building strong partnerships, making investments, both organic and inorganic, to serve new customers and markets and embedding innovation and sustainability into our strong portfolio of high-quality brands. While there are challenges in the near term, we are positive on the intermediate and long-term demand potential in each of our end markets that remain under built for both new residential homes and existing homes that are increasingly in need of renovation. However, as we've assessed recent financial performance, our results are not reflective of the full potential of JELD-WEN. In recent quarters, we suffered from taking on too much without sufficient alignment and accountability at every level of the organization. To this end, we're taking decisive actions to improve results that ensure the fundamental strength of the business lead to meaningful shareholder value creation. Now before I discuss the current actions we're taking to improve execution and financial performance, let me first start with the highlights of our third quarter results. We generated revenue of $1.3 billion and adjusted EBITDA of $116.5 million, an increase of 13% and 18% year-over-year, respectively. EBITDA margins expanded this quarter by 40 basis points to 9% due to favorable price cost, improved operating leverage from volume mix and positive productivity. As we head into Q4 and next year, we faced an increasingly challenging macroeconomic environment with persistent inflationary pressures and a softening housing market in North America and Europe. We're taking a fresh look at our business to find new ways to reduce the impact on our financial results, well positioning the company for success. As Dave shared, we're taking steps to streamline and strengthen the company to improve our bottom line over the short and long term as we continue to navigate these near-term challenges. First, we continue to rightsize the organization in line with our customer demand as the housing market continues to soften. This includes reallocating resources to where demand is strongest, while scaling back in areas where we are seeing softness. Second, we've taken an end-to-end look at our supply chain to better manage our raw material and trade spend while ensuring improved security of supply to our customers. In both scenarios, however, we're taking the opportunity to reengage with our suppliers to create mutually beneficial outcomes. To that end, this past quarter, we hosted a 2-day supplier summit in the U.S. with approximately 75% of our partners. The purpose was to strengthen our partnerships by better understanding each other's respective needs, discuss collaboration opportunities and identify ways to take cost out and improve sustainability of the value chain. Third, we're also taking steps to simplify and streamline our business to focus resources on our core assets and product lines. Also, the closing of our Melton U.K. stairs and windows business that will conclude by the end of the year is another good example. Lastly, our segment leaders are taking a customer-centric, data-driven approach, assessing profitability and growth potential across product lines, channels, geographies and facilities. Before I hand the call over to Julie, I'd like to take a moment to recognize our global associates and their continued dedication to the company and our customers, especially during this time of significant change and external challenges. In our recent annual employee engagement survey, we had extremely strong participation rates and experienced improvement in nearly every key measure year-over-year. Since joining in mid-July, as good considerable time getting to know my finance team and many other associates and have also visited several of our manufacturing facilities. I'm focused on four areas that will drive shareholder value and strengthen JELD-WEN for the benefit of all stakeholders, and you see these on Slide 7. Second is data availability, quality and analysis, so we can better use data to guide our decision-making on the commercial side, as well as to improve our operations. Now to our consolidated results for the third quarter, which you can see on Slide 8. As Dave and Kevin had mentioned, we delivered solid revenue and adjusted EBITDA improvement over the prior year period. Our revenues were approximately $1.3 billion, and our adjusted EBITDA was nearly $117 million, which resulted in a 9% EBITDA margin, a 40 basis point improvement compared to the prior year. Adjusted EBITDA benefited from favorable price cost, the impact of positive volume mix and improved productivity, which were all partially offset by higher SG&A expense. This quarter's loss was primarily due to a $55 million pretax non-cash goodwill impairment charge in our Europe segment, reflecting their challenging operating environment. Now as you see on Slide 9, our 13% sales growth was driven by core revenue growth, with price realization having a 15% positive impact and increased volume mix growth contributing 3%. On this slide, you also see a breakdown of key revenue growth drivers by segment. Price realization was again strongest in North America at 17%, followed by Europe at 13%, while Australasia increased 10%. North America and Australasia volume mix grew by 6% and 4%, respectively, while Europe decreased 3%, reflecting the increased difficult operating environment in that region. I'll now review our segment highlights for the third quarter, which are on Slide 10. Net revenue increased over 23% driven by strong price realization and positive volume mix, partially due to an easier comparison due to the labor challenges experienced in the third quarter of last year. Increased demand in this quarter was strongest within windows, exterior doors and company-owned distribution. Net revenue in the Europe segment decreased 5.5% driven by foreign exchange headwinds, partially offset by 10% core revenue growth. During the third quarter, macroeconomic conditions deteriorated in Europe driven by the continued war in Ukraine, significant inflation and rising interest rates. The decrease in margins was driven by significant cost inflation, including a more than 80% increase in energy costs year-over-year and the negative impact from lower volume mix partially offset by productivity savings. Australasia revenue increased almost 6%, including a 14% increase in core revenue, partially offset by the negative foreign exchange impact from the stronger U.S. dollar. Free cash flow used was $131 million during the first 9 months of the year, but was positive by approximately $70 million during the third quarter. We are focused on improving working capital in our segment and expect to generate positive free cash flow in the fourth quarter, while positioning ourselves to significantly improve cash generation in 2023. Our net debt leverage decreased to 3.6 times from 3.8 times last quarter, but does remain elevated from 2.8 times at the end of last year. This increase in leverage compared to last year was primarily due to lower earnings, increased working capital, reflecting both inflation and supply chain challenges and from repurchasing $132 million or approximately 7.6% of shares outstanding as of year-end 2021. First, we will continue to invest organically, specifically in projects that exceed our internal return hurdles and strengthen the financial position of JELD-WEN. We're developing new processes and tools that create more rigor around our capital expenditure process, while ensuring alignment with our segment strategies. In addition, we are focused on reducing our financial leverage, and we are targeting a net leverage ratio of less than 3 times in the near to medium term. We will also continue to evaluate smaller acquisition opportunities and other capital allocation options depending on a number of factors, including our net financial leverage, and our cash generation, as well as the returns achievable from these capital deployment opportunities. In North America, looking at almost any leading indicator of activity, the housing market is slowing and is likely going to continue moderating. While repair and remodel or R&R activity is impacted by many of the same factors, similar to prior housing cycles, we do anticipate R&R activity to fare better than residential new construction. We started to see orders moderate during the third quarter, particularly in our traditional channel, and this stuff is has persisted through October as residential new construction activity slows and our distribution partners align their inventories to end market demand. North America remains significantly under-built relative to demand for new residential homes, while the average age of existing homes continues to increase. In Europe, the economic situation continues to deteriorate, largely due to the effects from Russia's invasion of Ukraine. Within the residential portion of our business in Europe, for the past few quarters, we have felt softening demand in residential new construction, dating back to the beginning of the COVID-19 pandemic, given the lengthier build cycles compared to North America. More recently, demand has significantly slowed for repair and remodel projects as consumers pull back on discretionary purchases in response to higher energy costs and the uncertain macroeconomic outlook. Our channel partners, particularly within retail, are also aligning their inventory levels to softening demand. And in Australasia, demand for residential new construction and repair and remodel largely remains healthy, and we continue to see good demand for our products given the backlog of existing homes, and extended build cycles. While visibility for residential new construction is limited, we expect repair and remodel demand to remain healthy and for the backlog of existing homes to drive good demand for our business through at least the first half of 2023. After assessing current market conditions, and our financial forecast, we are reaffirming our full year core revenue guidance of 10% growth, including 4% to 6% consolidated revenue growth. However, given persistent inflation pressures and lower-than-expected productivity savings, we are revising our full year adjusted EBITDA expectations to be between $400 million and $420 million from our previous guidance of $430 million to $450 million. On this slide, you see the primary drivers underlying our updated guidance expectations for the year. Increased inflation, particularly for raw materials and energy is the biggest factor, followed by lower-than-expected productivity improvement. Partial offsetting these negative drivers are lower SG&A expense and favorable foreign exchange, both relative to our prior guidance. Based on our run rate, and CapEx pipeline, we've updated this guidance to be between $85 million and $95 million of CapEx spending this year. As Kevin described, we are taking necessary actions to lessen the impact on our financial results, softening end market demand and persistent inflation filed to in the company for longer-term success. While we have not overcome the negative earnings impact from these headwinds this year, we have taken cost actions that we expect to deliver total annualized savings of more than $80 million. However, we have not been able to take cost out as quickly as we need to, and we continue to actively identify and develop additional actions to improve margins. We have the foundational elements in place to drive significant improvement in our financial performance including a talented and engaged workforce, a strong portfolio of brands and customer partnerships that we have established through over 60 years of business. The first one is, Julie, maybe you could talk about what drove the elevated SG&A and overall corporate expense in the quarter. When you look at kind of year-over-year and quarter-over-quarter, as you can imagine. Obviously, in each quarter, we're assessing what our expected payouts are under our various incentive plans. And so when we look at this Q3 versus what we were doing last Q3, there were just higher expense this year due to different dynamics. Just trends and increased activity there, a little bit of, obviously, inflation continuing in medical costs as well. But really, those are the two kind of main drivers to the higher SG&A. Those are kind of ramping up in Q4, and then we've got additional actions that will be taken kind of rolling into 2023. So generally speaking, I don't expect anything really unusual going forward there. Obviously, earlier this year, right, we've had some other income that was higher than we would have expected. That's normalized more in Q3 and so I'd probably expect Q3 levels, maybe a little bit lower as we wrap up this year. But the right level of broad experience, leadership capabilities, capital markets experience, it really depends. Your line is open. The walk down the midpoint by $30 million and you all have in your slides, you know, higher inflation, reduced expectations for in productivity savings. I guess the inflation impact in the second half is slightly more negative, I'll say that the negative impact from the lesson productivity, that inflation headwind versus our prior expectations is higher by around kind of that $20 million to $25 million range. And I will tell you that energy both in Europe and North America is, you know, gosh, $15 million or so of that increase, just - I mean I think you can imagine, in both regions, energy prices, there's just been upward pressure, right, as we move through this year. And it was - while we expected some of that, we absolutely didn't expect what we're really looking at here. When it comes to productivity, again, that's kind of probably in that $15 million to $20 million range. A lot of that was in the third quarter, although a little bit in the fourth quarter as well. One of the drivers was ramping up a couple of our new products and really for various reasons, just a little more inefficiency in those ramp-ups than we were forecasting. So I guess what I'd say generally speaking is, as we entered the second half, we expected second half margins really - again, for the second half to be closer to 9% and we're looking at closer to 8%. And so and again, a lot of that has been - you can see that drop off there in the fourth quarter. And then in the prepared comments, you mentioned European volumes are down 3%, and the conditions were deteriorating a bit given the kind of energy crisis going on. I will say in Europe, in the fourth quarter, I mean, we're looking at around that 15% range of year-over-year volume decline. So that really, again, does reflect that really continuing weakness that we've already mentioned. But for really additional color, I'm going to hand off to Kevin. We're pretty much seeing with Europe, the problems in pretty much all countries. And with some of that, we're seeing some of the volumes dropping pretty significantly just due to those pressures, especially on energy. Your line is open. So if we look at the fourth quarter guide in total, you've got revenues, I think, implied down low single digits to up to 10% decline and you have been running comfortable double digits on pricing. And so the fact that we're not changing our total sales guidance, 4% to 6%. As we've mentioned in our second quarter call, that the reduction was driven by pricing being better than we had expected, but volumes being lower, and we mentioned volumes being flat to down 2%. I will say at this point, while we're continuing to expect that 10% core revenue growth for the year, we do see pricing being a little bit stronger than we had expected three months ago and volumes being overall a little bit weaker. When we look at the fourth quarter, pricing continues to be, call it, low double-digit growth. Volume at the company level is kind of - we expect to be down kind of in that 5%, 6%, 7%, and so that really is across the regions. And so Europe is the leader there, I've already mentioned an expectation of down around 15%. Just to add on to Julie's comments regarding North America, a lot of this has to do with kind of some of those challenges we're seeing everything from a slowdown in the residential with slowness in applications, permits, starts, et cetera. Overall, I think we're adjusting - working with customers and suppliers to balance that out at this point. And then my second question, in the opening comments, you talked about kind of this resource exercise with respect to featuring how to resource customers and pursuing just profitable growth, optimizing what you're targeting there in terms of the right - customers, the right sales. To your point, in areas that we do see low profitability, we're going to focus on a fix or repair process. But to your point, as we evaluate those, if we find that there are certain products or lines of business that are not sustainable, we're going to evaluate those and determine working with customers, et cetera on how we mitigate that, whether it's how we improve repair or fix or how we may exit. Your line is open. I just wanted to ask, would you be able to give us a rough quantification of how you expect raw mats inflation to impact the P&L next year. And so I think it would be premature to comment, especially specifically about raw materials as we move into next year. But I think from what we saw last year, we've mitigated some of that and it stabilized to a certain degree. Those challenges will continue, but we're looking obviously at not just the labor but also how we modernize some of our facilities and you invest in a little more automation as well/\n Okay. Your line is open. I'm curious, I think, Kevin, you mentioned something around specific categories. But I think in the area of exterior doors and also interior doors, we're seeing some of that pulling back. So I would say as far as where we see some of that with retail and traditional, those are probably some of the major areas we're seeing. And obviously, we're trying to adjust working with customers and our suppliers balancing that. I think we're still seeing, as Julie mentioned, some challenges with inflation, et cetera. But of course, it does mean that we're going to be working with suppliers and customers. So I think price, it's been a dynamic. We've been a little bit kind of behind, but it's also something we're trying to do to work on inventory as well. Your line is open. I do think that for us, working with a lot of our customers on the Pro custom segment is obviously desirable. I think we're seeing with some of the pullback, it's happening kind of across the board. It's kind of been a mix across the board, but it's something that we're trying to balance. And then perhaps taking a step back and thinking about things bigger picture, there's obviously been an intense focus on the operations side of the business in the last couple of years and really driving some efficiencies and some improvements there. I would say going forward, one of the things we focused on is really pushing that accountability within the region down to the plant and function level. But I do think that what's different to me is driving that accountability within the region, the businesses down to the plant level, but also the function level as well. But going forward, we expect to provide stronger updates and progress on how we're doing in future updates. Your line is open. I am still a little surprised the big step down in margins, anything you want to call out because it is a little short of the drought than we expected. So as I mentioned earlier, we have entered the second half, expecting our second half margins to be around 9%. And again, we've had a really significant drop off in our outlook really specifically to the fourth quarter. And so that is really driven by, again, in that region, the dramatic drop-off in demand but as well as this inflation I've talked about as well. So that - when you look at margins in Europe, I'd expect them to be in the fourth quarter better than what we saw in Q3, but still pretty significantly down versus the prior year and generally more in this range that we've delivered throughout 2022, obviously, this year. And then just talking then about North America, really, I think they'll be able to deliver pretty consistent margin levels kind of Q3 into Q4. And so while that is lower than we had expected earlier - well, a few months ago, we're not expecting as dramatic of a drop-off versus our expectations as we are in Europe. And again, their numbers since they're only about 10%, 15% of our business really just overall have less of an impact. But really, Europe is kind of the leader when it comes to how margins have deteriorated from what we were expecting and especially in the fourth quarter. I mean, yes, it's - I mean, I don't know that I have the specifics there. I mean volumes are -- I mean, again, we're expecting volumes to be down like I've already mentioned in Q4, and again, most dramatically in Europe. So - but I can't really comment right now on how specific that is, again, really a combination, especially in Europe, of the lower volumes and more significant inflation. Yeah, I think that's always an area of focus, you know, working closely with our customers, especially on the retail side. Overall, as far as price, as I mentioned before, it's something that we're going to have to balance. But like I mentioned, too, it does really involve our close relationships with suppliers and customers to kind of talk through that. We think price is one component that we need to measure, but also gets into the overall value for our customers, and that's a conversation that happens really customer to customer about what warrants the price. So we're going to do our best to manage that, but it's going to be an ongoing dynamic. Your line is open. Yeah, this is - I would say that we're not a real heavy backlog business. But I would say that we are seeing some of those reductions year-over-year, it's not so much, but definitely quarter-to-quarter, we're seeing some of that draw down. I think from an overall perspective on backlog, in some places, we're pretty healthy in our Australasia business, but North America, specifically to your question. That's one we're seeing a little softness, but that's the one we're trying to balance with inventory levels and working with our entire supply chain going forward. And then, I guess, you've got the strategic review in Australasia that's ongoing. But at this point in time, Australasia is the only part that we're doing the formal strategic review. We are focused on reviewing all segments, to your point, -- but at this point in time, it'd be premature to discuss any other options. North America as well, like I said, doing a line of business reviews to make sure we got good visibility and transparency across our product lines. No, I think that's right. I think one of the things to keep in mind, as Kevin talked about one area of focus for us is simplifying the business. So we're focused right now on the Australia business, improving Europe, and there's still a lot of work to do within the North American business even on things that we have talked about and had in executing on, but when you look at the footprint rationalization. But your point on product lines that's come up before, I mean there'll be ongoing evaluation as there always is. Your line is open. We don't - I mean, we don't really get into that level of detail. So I think you can assume nothing terribly unusual there, but we - that's not information we typically provide. And you're spot on that we're keeping a close eye on different sources of funds as we move through 2023 and obviously, our - one of our main focus areas is what we do control, and that is obviously our earnings generation and our management of working capital. So that's kind of like number one, when you think about sources of cash. So then when you get to uses, if we can deliver whatever amount of sources, I mean, as I mentioned in my prepared comments, continuing to invest in ourselves, and I think we have some improvement for how we manage kind of front to back of our CapEx processes. And so that's, again, kind of co top of the list with CapEx. I mean we've got various potential for how do we want to say, invest in ourselves when it comes to footprint rationalization, other types of, call it, kind of transformation, profit improvement activities that are beyond what we would be doing just in the normal course. Your line is open. Obviously, there's a lot of moving parts with savings and cost initiatives and pricing actions to keep up with inflation and then now the potential volume headwinds. Can you kind of - I mean normally, we would take volume decline to put the decremental margin on it to kind of figure out what the downside is. Some of the things we need to do have our longer-term initiatives, but we're also trying to balance that with the short-term stuff that we can do. But also, as Julie mentioned, strong look at our SG&A as far as from a cost structure, we're looking to make sure that we scale, but also with an eye on the ability to scale back up in the future if demand goes the other way. I mean, I think you guys were doing kind of in 2017 through 2019, you were kind of in the low 400s from an EBITDA perspective with single-family starts in the $800,000 to $900,000 range. I think as we've already talked about and is pretty clear from the market, especially as we start '23, there's going to be volume decline. I think looking at second half, I think it's a big TBD right across the region, what's going on with interest rates, where is the conflict in Ukraine, where is that landed, what's the status. And I think as far as Kevin has mentioned, you know what we're very, very focused on how do we mitigate on the bottom line, the demand weakness that we're going to see, so anyway, I think we've kind of got to leave it at that right now. Your line is open."
}