{
    "symbol": "JELD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-01 15:05:20",
    "content": " As the earnings release dated this morning, results came in below expectations for the quarter and we've adjusted the full year outlook to reflect first half performance and a continued challenging operating environment for the remainder of 2022. In North America, we continue to experience strong order rates and revenue growth in the traditional channel which primarily serves the residential new construction market despite some customers adjusting inventories to account for more normal manufacturing lead times. We continue to experience strength in certain European markets, including France and Central Europe that are delivering sequential and year-over-year improvement for the segment as well as in Australasia, where demand remains strong within both residential new construction and repair and remodel markets. While the long-term fundamentals of our business remains strong, the factors that impacted second quarter results, including elevated input costs and softening demand are unlikely to abate before year-end and are reflected in our revised full year outlook. Australasia adjusted EBITDA margin decreased 100 basis points in the second quarter to 10.5%, primarily due to the deleverage impact of lower volume/mix, partially offset by strong price realization and positive productivity. We'll see that rate reasonably consistent as we get into the third quarter and the fourth quarter, except that, that price/cost dynamic is much closer in the third quarter than the fourth quarter and helps -- will help us kind of with 100-ish basis point improvement in sequential performance from the second half versus the first half. There was -- which obviously is nonrecurring but there was actually some favorability on our FX hedging that would reasonably be expected to occur considering the strength of the dollar and the situation that we're in, coupled with a few onetime cost adjustments that we continue to -- we continue to look for opportunities, particularly in the environment that we're in to execute something similar as we would get into the back half of the year."
}