{
    "symbol": "JELD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 14:45:23",
    "content": "  Operator: Good morning, and welcome to the JELD-WEN Holding Inc. First Quarter 2022 Earnings Conference Call. Before we begin, I would like to remind everyone that during this call, we will make certain statements that constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. JELD-WEN does not undertake any duty to update forward-looking statements, including the guidance we are providing with respect to certain expectations for future results. Additionally, during today's call, we will discuss non-GAAP measures, which we believe can be useful in evaluating our performance. I'll start this morning by thanking our global associates, and especially those in Europe, for their continued commitment and dedication to serving customers during this challenging time. Together with the generosity of our associates, JELD-WEN has already contributed more than $50,000 to the American Red Cross in support of humanitarian efforts in the region, a true testament to our values-driven culture. Turning to the first quarter results, we delivered another quarter of core revenue growth, our seventh in a row, driven by solid end market demand, strong price realization, and progress on our key initiatives. That said, a significant step-up in inflation relative to our expectation at the start of the quarter, exacerbated by the war in Ukraine, had a significant impact on results. Absent these extraordinary inflationary impacts, we would have achieved the high end of our expected range for the quarter. In addition to price actions, we are executing initiatives to enhance margins, including expanding the rationalization and modernization programs to reduce fixed costs, focusing on consolidating our footprint and improving technology at facilities to improve labor efficiency and throughput, minimizing raw material consumption through value-added, value-engineered product design, and continuing to partner with suppliers to provide the best quality cost and availability for our operations and customers. While global inflationary pressures continue, we remain encouraged by the favorable underlying demand fundamentals across most of our primary end markets. We are confident that the initiatives we have deployed to drive profitable growth and margin expansion, will benefit us through the balance of this year. Q1 net revenues increased 7.2%, driven by a 10% increase in core revenue, with all three segments contributing to core revenue growth. As I mentioned a moment ago, this marks the seventh consecutive quarter of consolidated core revenue growth. As we continue to deliver innovative and margin accretive new products, and improved service to our customers, we've realized higher pricing, and we expect to maintain this price due to differentiated customer service, product solutions, and market-leading position. While pricing actions offset raw material and freight inflation, Russia's invasion of Ukraine, and the subsequent sanctions on many Russian exports, led to greater volatility and higher than anticipated prices on a number of key inputs, including energy, metals, logs, and mill work. In North America, core revenue grew 13%, largely due to price increases and continued solid demand for products in both residential, new construction, and repair and remodel, or R&R activity. Strong end market demand drove increased orders throughout the quarter, resulting in both a sequential and year-over-year increase in backlog, our highest backlog since the start of the pandemic. We executed on a variety of material cost reduction initiatives, including resourcing, substitution, value-added value engineered or VAVE projects, and also enacted cost controls aimed at alleviating the impact of inflation. We realized some benefit from these initiatives in the quarter, and expect to realize most of the saving from these and others currently underway over the coming quarters. In Europe, core revenue grew 8% due to continued price momentum, partly offset by softer than anticipated volume in certain markets due to geopolitical uncertainty and significant inflationary impacts stemming from the crisis in Ukraine. Some project business was pushed out into future quarters, and we experienced limited destocking by certain customers. And our Australasia core revenue increased 1%, as accelerating price realization was largely offset by softer than forecast volume mix. However, continued builder labor challenges, severe flooding in Queensland and New South Wales, and an increase in COVID-19-related absenteeism, had a temporary impact on delivery timing and throughput. To conclude my comments on the quarter, we repurchased $40.2 million of our stock during Q1, or approximately 2% of shares outstanding. As we move into the second quarter, we continue to focus on carefully managing costs and making accretive investments to bolster the capabilities, service and resources that matter most to our customers. Over the last few quarters, I've provided details on how we're accelerating the deployment of our business operating system, the JELD-WEN excellence model, or JEM, through transformation efforts in our 14-model value stream sites across the globe. I'd like to provide some details on new aspects of this transformation, the evolution of model sites to product lines, the addition of sites in Europe and Australasia, and the introduction of our first smart factory. As we've mentioned, JEM deployment enables us to improve throughput, maintain market-leading lead times, and reduce per unit cost. The additional efficiency we gain from this approach, plus the six sites we're adding in Europe and Australasia, will unlock approximately $100 million in additional revenue opportunity for JELD-WEN in 2022. We've also deployed new technology, including sensors and software, to our first smart factory. To provide some context on the magnitude of improvement we're seeing, three projects completed in the first quarter, have driven throughput volume improvement between 77% and 92%. In the past three years, we've achieved more than $100 million dollars of savings from our footprint rationalization and modernization efforts, which have improved profitability and performance, increased throughput, delivery capabilities, and capacity. With additional projects underway and more in the pipeline, we believe we have considerable runway to generate continued meaningful cost savings and margin improvement. This localized approach has helped us maintain self-sufficiency in key manufacturing processes, and deliver quality products with industry-leading customer lead times. This gives us flexibility as we optimize the supply chain to manage the effects of inflationary markets through rapid resourcing and insourcing, substitution, and redesign decisions. And as a key customer for many of our suppliers, we're using this position to manage our material purchases more effectively. Another part of our strategy is helping our channel partners and customers solve their challenges by offering new and innovative products and services that add value to their business, helping to strengthen our position as the supplier of choice. For example, we're offering more pro-specific skews of prefinished, preconfigured doors, and integrated door systems, to help reduce installation labor requirements. And we are piloting quick-shift programs in North America that focus on rationalizing skews to deliver higher volume on-trend products that customers want, while enabling our production runs to be more efficient and reduce lead times. This launch addresses the rapidly growing demand for products that are designed-focused, energy-efficient, and sustainably-sourced, with a high degree of recycled content. So, we're excited about the opportunity to provide them with this next-generation, energy-efficient composite product. Shipments will commence in the second quarter, and we expect rapid expansion through 2022 for this margin-accretive product line. Additionally, our exterior fiberglass doors continue to be a growth driver for us. We've added new door and skin capacity in our North Wilkesboro facility that helped drive customer conversions, leading to growth above 20% and share gain for JELD-WEN. In a few weeks, we are bringing additional capacity online in our west coast facility, and expect to see continued growth and share gains this year. Since the expansion of our new east coast facility in Statesville, North Carolina, in the fourth quarter, we secured seven new projects in 2022, with one of the largest multifamily builders in the United States, and expect to secure incremental business with new customers as the year progresses. We expect these unique growth drivers, and continued positive housing demand, to accelerate topline growth. While the steps we’re taking to get ahead of inflation, will deliver margin expansion and improved profitability in the back half of 2022. Net revenue increased 7% to $1.2 billion, driven by 10% core revenue growth, partially offset by 3% adverse foreign exchange impacts. Core revenue increased from a sequential and year-over-year improvement in pricing, partly offset by lower volume mix. Adjusted EBITDA decreased 18% to $80.2 million, driven by significant increases to input costs. Net loss per share and adjusted EPS were $0.01 and $0.16, respectively, compared to EPS and adjusted EPS of $0.25 and $0.27 a year ago. We delivered another quarter of strong core revenue growth, with positive core growth in each segment. Pricing increased sequentially, as we executed additional price increases to mitigate the impact of inflation. Price realization was strongest in North America at 14%, followed by Europe at 11%, while Australasia increased 6%. Volume mix decreased 2% in the quarter, driven primarily by slower backlog conversion in Australasia and softer demand in Europe, as well as having one less selling day in the quarter. Please turn to Page 9, which shows the magnitude of raw material and freight inflation over the past four quarters, and the price increases we've instituted to mitigate the effects. While material and freight inflation was greater than expected, we successfully offset the impact with price. Moving to page 10, you can see our segment highlights for the first quarter. Core revenue growth in North America was 13%, primarily driven by strong price realization, while volume mix was a slight headwind. Revenue growth accelerated through the quarter, driven by strong pricing and positive volume mix contributions in both February and March. JEM actions and improved labor productivity, drove meaningful improvement and throughput through the first quarter, with weekly volumes in March up high single digits compared to the fourth quarter, setting the stage for future growth. Order rates remain strong, particularly with our traditional channels, which increased roughly 40% over last year due to strength in residential new construction. Adjusted EBITDA margin in North America decreased 320 basis points, primarily due to higher input costs, including raw material, freight, labor and energy, as well as startup costs for new capacity. North America fully covered raw material and freight inflation with price on a dollar basis, but the impact has diluted the margin rate. Europe revenue increased 8%, 1%, including the impact of foreign exchange. Another quarter of strong price realization drove core revenue growth, partially offset by lower than anticipated volume mix. However, inflation pressures and a general uncertainty related to Russia's invasion of Ukraine, impacted demand in other markets. Again, pricing improved year-over-year and sequentially. However, the deleverage impact of lower volumes due to market uncertainty, delays in higher margin project work, and inflation pressures, particularly for energy, metals, and labor, were considerable margin headwinds. Australasia revenue increased 1% in local currency, declining 5.2% FX-adjusted. Orders remain very healthy, reflecting our strong market position and continued solid demand for new housing. Australasia adjusted EBITDA margin decreased 170 basis points in the first quarter, primarily due to the deleverage impact of lower volumes. Operating cashflow used during the first quarter was $186.9 million, compared to $64.9 million last year. The increase in operating cash flow used in operations was primarily due to high working capital needs, driven by inflationary impacts on the balance sheet, and lower net income. We expect improved cash flow conversion this year, as inventory investments convert to revenue and ultimately to cash. We ended the quarter with total cash and liquidity of $265.6 million, and $584.7 million, respectively. Net debt leverage increased 23.5 times from 2.8 times at year-end, primarily due to the temporary impact of inflation our cash flow and from utilizing our sizable cash position to purchase 40.2 million of our shares, or about 2% of the total shares outstanding. Our net leverage charter remains at 2 times to 2.5 times, and we expect to make considerable progress towards this goal through growth and margin expansion this year, and accelerating cash conversion. We'll continue deploying our cash in a disciplined, returns-focused manner, and compounding the returns on that cash over time. Input cost inflation will continue to have some negative impact in Q2, and we expect extended market uncertainty in Europe. However, pricing actions have been announced in all of our markets, and realization will accelerate through Q2 and the balance of the year. Additionally, we have meaningful ongoing initiatives in place to drive growth and additional margin expansion as we've progressed towards our 2025 financial goals. Before we discuss the market outlook, I would like to provide an update on the divestiture process for our wood fiber building products business in Towanda, Pennsylvania. as we shared in the third quarter of 2021, the court appointed a special master to oversee the divestiture process. As part of that process, the court asked the Department of Justice for its views on the special master's recommendation, which is expected to be delivered later this month. While timing is uncertain, we are well prepared to navigate each possible outcome, and remain focused on ensuring a fair and orderly transition for associates and customers, while delivering value for our stakeholders. In North America, we continue to expect strong demand for both residential new construction and R&R activity. This demand is driven by favorable demographics, healthy consumer spending, and high personal saving levels, record home equity, and an aging housing stock. We recognize potential affordability challenges may create a temporary lull in demand during the second half of the year, but we believe the tailwinds to demand, including migration and move-up, will be more powerful and durable and long-lasting. For Europe, Russia's invasion of Ukraine has created uncertainty in the near-term. However, our operations are in many of Europe's strongest economies, and we expect activity to accelerate once there is greater clarity on the duration of the war in Ukraine. And in Australasia, demand for new residential homes remains robust, as the country's housing market continues its recovery from a multi-year recession. We expect housing demand and fundamentals, including record low interest rates and significant pent-up demand, to remain supportive, and we expect demand for our products to remain strong throughout the remainder of the year. While we've experienced extraordinary global headwinds in the past two years, we remain acutely focused on the aspects of the business that are under our control. We are well positioned to capitalize on favorable housing market trends by realizing internal productivity improvements from our initiatives, offsetting inflationary impacts through price realization, and launching new innovative growth products that are margin accretive. As we look ahead, the work we have done over the past few quarters has positioned JELD-WEN to be successful in any market environment, and we remain committed to our outlook for the year. We are confident that our efforts to provide a differentiated customer experience and industry-leading capabilities, will drive long-term value for all of our stakeholders. I think, Gary, you said it sounded like Q1 would have come in at the high end of your expectations but for the additional step-up in inflation. On an internal basis, our first quarter missed slightly on our eternal expectations, again, due to the uncertainty that we saw in the first quarter from inflation and a little bit of volume decline based on what's going on in Europe. As we talked about earlier on the last call, we've got some - we have good pricing. We're pulling some other levers on cost and on just making sure that we're set up correctly, reestablishing or not reestablishing, but reaffirming what we're working on, on our rational modernization programs in JEM. But we've got price in place, we believe, to become a tailwind for the full year. And then secondly, I think last quarter you said that in terms of the organic growth guidance, that more than half of that growth was price. And obviously, this quarter, I think volume mix was down across segments. I don't think that we've seen the volume necessarily decline because of price, with the exception of maybe a little bit of the uncertainty that we saw in Europe for a short period of time there. And for the most part, a lot of the growth drivers that we've been talking about, new products like Auraline or VPI expansion, the exterior door growth and new capacity coming online, that's just starting to hit us, but as we - as a plus. So, as we looked at the quarter, stepping through the quarter, we saw sequential improvements, sequential growth, particularly in North America. That pricing that we've got, we've taken some additional levers and we expect that to push through and offset some of this new inflation in this quarter and beyond. So, we've seen some favorable mix in channels. In Europe, the mix shift has been a little bit less commercial in the northern portions of Europe where we tend to be a little bit more commercially-focused, geared more towards residential and R&R type business. And again, that's mostly just due to pushing out of projects, no straight cancellations, but we did see some destocking there related to the war, and then high demand on R&C and R&R in Australia, or in Australasia, mostly just a supply and a pull-through piece there as contractors couldn't work with all the flooding events that happened there in the quarter. Those are behind us, we believe, and that demand will start to pull through as crews get back to work and we're able to ship the product. Typically, first quarter tends to be a slower quarter, but one where we build up inventories and are ready to supply for the season. So, we're cautious about it, but yes, we're seeing inventories, certainly in retail, about normal. So, we've been talking about the initial commitment that we made around our rationalization, modernization programs, around $100 million. What I would tell you is, we continue to stay on the same - and that was the first three-year program. We continue to stay on that same pace, and we've got additional items that we're initiating now, or actually executing on now, that we'll start to see benefit even in the second quarter, third quarter, and beyond. Apart from the incremental inflation, there's also these forex headwinds that appear worse than anticipated at the time of guide. As we see the dollar beginning to strengthen, obviously that'll have a little bit of an impact. And so, I'm just curious what level of incremental inflation you're expecting in the back half. And then, with some of these accelerated process transformations that you guys are putting in place, it sounds like it's a really good opportunity there, but I'm just curious what the incremental cost is associated with those actions. What I would tell you is, it's similar to what we've been - we've seen in the past. I would tell you that we see - we typically look at them from the rate of return, and some of these are a result of the work that we've done in JEM, in improving our capacity in a number of facilities. And that gives us the ability to bring capacity in from smaller, less important plants that we're able to close, take cost out, and continue to grow our capacity. So, very similar to the same programs that we've been talking about for the last three years, really, where the investment kind of, it's almost become a virtuous cycle at this point, where we lean out facilities, kind of making room for taking on additional capacity, and we take the latent capacity offline and we continue to lean. Is the reiteration of ‘22 EBITDA guidance - I take it, it’s based on kind of the current inflation as of April, but then incremental price capture from the recent announcements as we move through the year. That’s fair, although we do continue to anticipate, and our model continues to anticipate, fairly significant inflation throughout the year. In addition, remember, we talked about some unique growth drivers that we had through the year, which will continue to hit. As we've launched our Auraline product, we're able to ship the new capacity out of our BPI facility and out of our exterior plant. And you put on top of that the levers that we're pulling and continue to pull on our restructuring programs, on our rationalization and modernization programs. And then, it looks like during the quarter pricing offset material and freight inflation. So, we saw additional labor inflation certainly in the quarter, at the beginning of the quarter, mostly related to some of the early Omicron COVID, but not meaningful for the remainder of the quarter. Obviously, we have some great internal programs that are high returning that we'll continue to invest in. We believe in our - for the full year, as well as for our long range - the long-range plan that we put out on our Investor Day last year. And we're looking, as always, at M&A as a potential opportunity for us to accelerate our strategy and to continue to grow the company. I mean, you're acknowledging 1Q, given some of the puts and takes, was a little below internal plans, some of the near-term realities around the cost inflation and maybe some disruptions. Yes, Mike, I would say that first of all, you’ve got to look at, we made our guide for the full year. The addition of price, obviously the acceleration of some of our programs around rationalization and modernization that we've been - have had underway, will continue to help and continue to drive that. But we're also very - we’re very excited about the kind of JELD-WEN -specific growth drivers that we've been talking about, which will start hitting here in season and for the remainder of the year. And at this point, we're awaiting certain decisions of the court, and the court's waiting on that opinion from the justice department. I would say that as far as the results go, we’re, to a certain extent, at the mercy of the court, to use that phrase, in terms of the timing of the process itself. As far as the results of the business, when we would separate out, we would do that at the appropriate time, based on the position of where a deal is and what our advisors recommend from that standpoint. My first question is, looking at the volume cadence or the volume mix cadence in North America, considering your commentary, Gary, around the backlog there and the sort of cadence that you're seeing or you saw through March, does that suggest that you could see a positive shift in terms of the volume mix as we go through the next several quarters, that that can be sustained, and especially when you think about some of the comps that you face in the second quarter and then in the back half? That mixed piece towards our traditional business and R&C continues to move favorably as well, as does in the retail segment, the mix of more specials versus stocks. So, kind of favorable - we would expect a favorable progression in North America on volume mix through the year. Something I mentioned as well in the prepared comments, working with builders and with our traditional channel partners, we've been able to focus on some quick-ship programs and some kind of just-in-time or just-as-they-need-it type programs, where we've been able to do - utilize our skew rationalization program to pick kind of the on-trend, but most popular - most popular on-trend type of skews and really focus the efforts on that. So, customers still get what they want, but easier for us to plan the manufacturing and forecast around, easier for our channel partners to be able to move them through their system, and easier for builders to select. Think of pre-hang for exterior doors, taking that entire entryway door system, put it into a system that's easier to install, allows a different type of labor to put that in, which makes it easier to select, easier to transport, and easier to install. So, those are some of the things that we're working on as we're working with our channel partners and customers to solve their problems, and it adds value, which is a great thing for us as well. Given the uncertainty in Europe and affordability concerns in the US, Gary, you kind of meant - you alluded to maybe potential risk of a temporary law in the back half of this year. So, the uncertainty in Europe, I'll take that first, we've seen that primarily in our commercial businesses in certain regions of Europe, where there's been some uncertainty and slow-down, mostly pushing orders out, or pushing projects out, and a little bit of destocking in some of those areas. I think that's going to continue a little bit here into the second quarter, and just really based on kind of the news and the things that we see going on. We'll be watching that very closely, but we are still seeing some robust activity in other parts of Europe. In North America, we've seen sequential growth through the quarter, and we expect that to continue through the year, with more favorable mix. So, while we'll see some of the, call it, inflationary pressures as price continues to take on, particularly this new set of energy costs or freight, we would expect that to sequentially improve as we exit the second quarter into the second half, and then a lot of those growth initiatives really start kicking in here kind of end of this quarter, as we start shipping. We've announced that we're starting to ship Auraline, our new composite product, this quarter. So, we would expect all of that to kick in and just be natural levers for growth in the second half, as we talked about. And then from a supply chain labor bottleneck standpoint, it's kind of been a drag on your volumes the last few quarters. We've - on a general basis across the entire enterprise, while we've had - like any - at any time in history, we've always had - you always have some material or some issue. On the side of labor availability, our big issue around associates was really kind of the third quarter of last year. We had a short period at the beginning of this year with the Omicron, kind of a couple of weeks there where we saw some accelerated absenteeism, but I would say that's really behind us. We've either been able to work through and solve some problems, or we've gotten kind of used to what we need to do in order to address it. But our JEM programs and the work that we've been doing on improving throughput, have seen us sequentially improve, which is why - the output of that is the lead times that our customers are seeing on our products. And for the most part, certainly on the door side, we're seeing pre-pandemic lead times, certainly on interior doors, darn near close on that on exterior, and our window products continue to have industry-leading lead times as well. So, I feel like we’re kind of demonstrating that for the customer, and it's a result of all the work that we've done on throughput improvement and ensuring that we're staffed correctly. I would say that what you're going to see is some of the inflationary pressures continue to show up in the second quarter, as price and perfecting that backlog reduction, happens in the second quarter. But I would say that you will definitely see that in this back half of the year, as we're able to leverage the other growth initiatives on top of it as well. I think most questions have been answered, but based - in terms of the margin and pricing, you talked about that sort of coming through in the second half of the year. For North America, you're talking about the growth that you're seeing, but then also mention that potential for the sort of affordability-driven lull in the second half. So, yes, the - we’re obviously watching R&C and what's going on in those markets. And I would tell you, right now, we see the fundamentals of that continuing to be strong, based on the order loads that we're getting and the backlogs that we continue to have. So, that's built into our forecast for the full year as well. And we continue to see, based on the presale of some of those products, that's going to propel us and drive us in that second half. When you think about where we've got some good growth initiatives, the two notable ones, particularly Auraline, which is an accretive window product for us, will help propel margins in that arena. So, we've got kind of focused on both and there's no structural reason why both can't propel and continue to grow. Typically, in Northern Europe is where we're seeing a little bit more impact. We are - we feel good about the housing fundamentals in our markets, and we feel good about our forecast for the full year, and reiterate our guidance for the full year based on our ability to overcome some inflation with pricing, as well as our JELD-WEN-specific growth initiatives that we've been talking about. We'll look forward to sharing with you the results of our growth initiatives, our continuing work with JEM, and rationalization and modernization programs in the coming quarters, and thank you again for your interest."
}