{
    "symbol": "JBL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-27 14:45:26",
    "content": "  In terms of agenda over the next 60 minutes or so, we aim to accomplish the following: discuss the trends underway within the end markets we serve, review our fourth quarter and fiscal year â\u0080\u009822 results, provide first quarter guidance, offer our fiscal â\u0080\u009823 outlook that includes enterprise level growth while also remaining sensible and grounded given the realities of the dynamic global macro environment surrounding us today. Core operating income during the quarter was $447 million, an increase of 42% year-over-year, representing a core operating margin of 5%, up 80 basis points over the prior year driven by the aforementioned strength in certain end markets, slightly offset by unanticipated costs associated with the power shortages in Chengdu during the month of August. Net interest expense in the quarter came in higher than expectations at $53 million primarily associated with rising interest rates, while our tax rate came in better than expected by approximately 70 basis points, resulting in core diluted earnings per share of $2.34, a 63% improvement over the prior year quarter and at the higher end of our range. As a result, we feel the outlook for our business is solid and expect demand to be resilient with year-over-year revenue growth at an enterprise level to be approximately 3% for FY â\u0080\u009823 in spite of an economic slowdown. For FY â\u0080\u009823, we expect core operating margins to improve by a conservative 20 basis points over the prior year mainly driven by end market growth and improved mix of business. In FY â\u0080\u009823, we expect to continue to invest in targeted areas of our business with the bulk of our strategic growth CapEx aimed at the automotive EV space, along with the healthcare, 5G wireless, power generation and industrial end markets, generating multiyear returns in FY â\u0080\u009823 and beyond. We have deep domain expertise complemented by investments we made in capabilities, all of which gives us confidence in our ability to deliver 4.8% in core margins in FY â\u0080\u009823 along with $8.15 in core EPS and more than $900 million in free cash flow. Your line is now live. And so the impact of that is if you look at the slides we presented, our cloud business going from FY â\u0080\u009822 to FY â\u0080\u009823 on a dollar basis, I think, shows a $200 million decline, â\u0080\u009822 to â\u0080\u009823. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}