{
    "symbol": "JBL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-16 13:49:04",
    "content": " Altogether, the team delivered core earnings per share of $1.68 on revenue of $7.6 billion, resulting in a core operating margin of 4.6%, a 40 basis point increase year-on-year. In addition, we remain committed to delivering a minimum of $700 million in free cash flow for the year, while increasing core operating margin to 4.6%, a 40 basis point improvement year-on-year. Given the higher revenue, I'm particularly pleased with our ability to drive an extra 30 basis points of margin improvement compared to our expectations in December, mainly through broad-based trends in several key end markets benefiting from long-term secular trends, as well as outstanding execution by our business, operations and supply chain teams. Your line is now live. Your line is now live. Your line is now live. So I think today with the outlook for the business over the next couple of years, where I think we're headed, what we could do in terms of margin, what we could do in terms of some continued growth, I think buybacks make a lot more sense than any type of change to our dividend. Your line is now live. I would also, maybe from a relativity standpoint or a contextual standpoint, suggest that the current guide that Mike gave and the $7.25, I think we've done a pretty good job of contemplating all the supply chain issues and events in terms of weaving that into our guide for the balance of the year. Your line is now live. Your line is now live. Well, I think on one of the slides today that was posted or shown during the call, if you look at the green box, which we talk about as kind of our diversified manufacturing business, I think what we're suggesting there is, is collectively that group of businesses will run on the core margin line around 5%. Both of those margin, call them goals, targets, or guide, both of those I think on an annual basis -- and again, if I go back 15 years, those are probably the strongest margins we've posted in terms of as we bifurcated the business, EMS, DMS. Your line is now live."
}