{
    "symbol": "MNRL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 18:50:07",
    "content": " As a reminder, we have an incremental 13,000-plus gross locations and over 108 net locations in our undeveloped inventory at the end of the first quarter, with approximately 60% of those net locations in the Permian Basin. Looking ahead, our net activity well inventory, which represents the combination of our drilled but uncompleted locations, or DUCS, in our permits was 11.7 net locations at the end of the first quarter, our net DUCs and inventory at the end of the first quarter stayed roughly flat versus the fourth quarter, despite our extremely strong  DUC conversions. Given both our strong production growth in substantial activity well inventory at the end of the first quarter, 2022, we now anticipate our production volumes averaging approximately 12,000 barrels of oil equivalent per day for the remaining nine months of 2022. Yes, no, Chris great point to bring up -- I think the organic development on our portfolio this quarter has been tremendous, really wanted to highlight that, in both the earnings press release, as well as the conference call, earlier comments that we made, When you think about our portfolio performing as it did, the record drilling results, really wanted to reiterate to everyone that when you think about the 2.1 net wells that were spud during the quarter, roughly 2/3 of those were organically sourced from acquisitions that we had affected prior to 2020. So, hence us then looking forward and given the strong net activity well inventory that we have in inventory, roughly the 11.7 net locations at the end of March us providing guidance for the remaining nine months of the year that we look at -- we're looking at potentially 9,000 -- or sorry, 12,000 barrels of oil equipment per day of production during the remainder of the year. And I, think very opportunistically in the fourth quarter, we're to add a really that really nice $93 million DJ debt acquisition that's immediately paying results in terms of active conversions and developments."
}