{
    "symbol": "PCOM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 18:31:12",
    "content": " Thank you for participating in today’s Conference Call to discuss Points’ financial results for the First Quarter Ended March 31, 2022. Delivering today’s prepared remarks are Chief Executive Officer, Rob MacLean, President, Christopher Barnard; and Chief Financial Officer, Erick Georgiou. Before we go any further, I would like to turn the call over to Jackie Keshner of Gateway Group, Points’ IR advisor, as she reads the Company’s safe harbor that provides important cautions regarding forward-looking statements. Important factors that could cause actual results to differ materially, and the assumptions used in making such statements, were included in our first quarter 2022 financial results press release issued prior to this call, as well as other documents filed with the Canadian and U.S. securities regulators. Under the terms of the transaction, Plusgrade will acquire Points in an all cash transaction for a total consideration of approximately US$385 million or US$25 per share, representing a 52% premium to our 20-day volume-weighted average as of the close of May 6th. Joining forces with Plusgrade in what will become a truly global leader and provider of value adding and revenue generating services for partners in the airline hospitality, rail and financial service industries is an exciting future. Total revenue in the first quarter of 2022 increased significantly to a quarterly record of $127.4 million, a 96% increase over the year-ago quarter, and an 11% increase over the fourth quarter of 2021. Gross profit in the first quarter of 2022 was $18.7 million, more than doubling from $9 million in the year-ago quarter and growing 9% on a sequential basis. The increases in both metrics primarily reflected sustained performance improvements from our marketing activity and the benefits from pandemic recovery tailwinds, with many of our partners continuing to generate strong organic growth. Operating expenses increased sequentially and year-over-year in the first quarter of 2022 to $16.4 million, an increase from $10.2 million in the year ago quarter. The increase was attributable to the gradual easing of spending restrictions tied to the start of the pandemic, higher stock-based compensation and the effect of $1.2 million in wage subsidies we recorded in the year-ago period, which had previously helped to offset our operating expenses. Adjusted EBITDA for the first quarter of 2022 came in at $6.7 million, up significantly from $1.2 million in the year-ago quarter, and $5.5 million in the fourth quarter of 2021. Turning to our balance sheet, the strong sales activity we had during the quarter generated total funds available at approximately $145 million at the end of Q1, up significantly from approximately $109 million at the end of 2021. To summarize our first quarter performance, we continued to drive strong growth across our key financial metrics, driven by strong marketing activity and supported by sustained recovery related tailwind, which increased transaction activity across the platform. While today’s macro environment remains fluid and difficult to predict, we remain encouraged by our first quarter results and solid financial position, and believe we will enter our next chapter of growth with Plusgrade from a position of strength. The echo Rob’s earlier remarks, we believe the Plusgrade transaction comes at a very attractive valuation that provides strong value for our shareholders. To review some of our commercial highlights from the quarter, much of our first quarter activity deepened our growing footprint in the Middle East and sustained the momentum we have generated with our exchange deployments. As we previously shared, we’ve been engaged with Marriott for well over a decade, and have actively expanded and enhanced our end market services for them most recently, adding our Top-Up capability directly into their booking flow in the fourth quarter of 2021."
}