{
    "symbol": "RGEN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 13:17:05",
    "content": " Revenues for the first nine months came in at $615 million, up 28% organically, which takes into an account a 9% decline in COVID revenue during this period and 5 points of FX headwinds. The growth in these two franchises more than offset the decline in COVID revenues, which were down by $19 million or 40% year-on-year. More importantly, we now have over 20 accounts with revenues in excess of $1 million per year, up more than 70% from a year ago. As mentioned earlier, we again saw predicted drop off in COVID revenues in the quarter, and we now expect coverage revenues to come in at $135 million to $140 million for the year, an adjustment of $7.5 million from the midpoint of our previous guidance and down 28% versus our 2021 finish. Weâ\u0080\u0099re tightening our reported revenue to a range of $795 million to $805 million, representing total revenue growth of 19% to 20% and 24% to 25% at constant currency. Weâ\u0080\u0099re also increasing guidance for our base business growth to 33% to 34%, up 1.5 points at midpoint from our previous guidance, and we anticipate organic revenue growth in the range of 21% to 22%. On our top line, we delivered revenue of $200.7 million in the third quarter, representing 19% growth at constant currency, 16% organic and 13% growth is reported. Breaking down our third quarter reported revenue growth of 13%, our base business contributed at 21 points of growth and organic M&A added 3 points of growth, which were partially offset by reduced COVID-related growth of 11 points. Adjusted gross profit was $114.4 million in the third quarter of 2022, increasing by $10.6 million or 10% compared to the same period in 2021. Our adjusted operating margin was 29% in the third quarter of 2022 compared to 32% in the prior year period, where our rapid revenue acceleration outpaced our investments to scale up the business at that time. Overall, we are tightening our 2022 full year revenue guidance of â\u0080\u0093 got metric to $795 million to $805 million, which continues to reflect increased projected demand for our base business, offset by significant foreign exchange headwinds and lower projected COVID-related revenue. We are slightly lowering our adjusted operating income guidance to a range of $231 million to $235 million, and we are reducing our adjusted operating margin guidance by 50 basis points to the range of 28.5% to 29.5% of revenue for the year. And then just, Tony, on your comment about next year, your growth has been north of 20% the last five years on a base business perspective, youâ\u0080\u0099ve got the 16% to 20% range. The fact is that we have now 20 gene therapy accounts that are generating over $1 million per year in revenue for us, up 70% versus a year ago."
}