{
    "symbol": "RGEN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:58:02",
    "content": " This increase in base business offsets approximately half of our expected COVID decrease, with overall revenues for the company now projected to be $770 million to $800 million, a less than 4% adjustment from our initial guidance in February. On the top line, we've delivered revenue of $206.4 million in the first quarter, representing an increase of approximately $64 million or 45% reported growth. Looking closer to first quarter growth of 45%, our base business contributed 28 points, with an additional 5 points coming from our 2021 acquisitions and 12 points attributed to COVID. Now moving down our income statement, adjusted gross profit was $124.6 million in the first quarter of 2022, increasing by $39.8 million or 47% compared to the same period in 2021. Adjusted operating income for the first quarter of 2022 was $67.4 million, an increase of $21.7 million or 47% compared to the 2021 first quarter. In the first quarter of 2022, our adjusted net income was $53.7 million, an increase of $15 million or 39% compared to the first quarter of 2021. Based on the strength we are seeing in our base business, which we project to offset about half of the expected reductions in our COVID revenues, we're updating our 2022 full-year revenue guidance, a GAAP metric, to $770 million to $800 million, representing reported growth in the range of 15% to 19%, organic growth of 14% to 18% and constant currency growth of 17% to 21%. This revenue guidance includes base business revenue of $598 million to $628 million, growing at 24% to 31%, COVID revenue of $150 million and inorganic acquisition revenue of $22 million from our 2021 acquisitions. The fact that we're saying 65% of our revenues for COVID is going to be in the first half of the year and 35% in the second half of the year, it just means if you just do the math, it's a much lower number for COVID in the second half of the year."
}