{
    "symbol": "RGEN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 14:38:04",
    "content": " Organically, our base business was up 35% in the quarter and 39% for the full year while overall organic growth for the company was up 4% in the quarter and 22% for the year. We expect to build off the 30% organic growth we saw in the fourth quarter for fluid management and the 17% organic growth we saw for full year 2022, which was hampered by the destocking on the component side. As reported today, we had another strong quarter with base organic business up 35% and overall growth of 4% despite the $38 million COVID charge in the quarter. With an additional $100 million COVID challenge in 2023, we expect the filtration franchise to be down 4% to 12% overall, but up in the range of 10% to 20% for our base filtration business. The pipeline of opportunities expanded in the fourth quarter and based on funnel strength, we expect 2023 growth to be in the range of 15% to 20% as we gain traction with our RPM platform and new products hit the market. Within our base business, we saw continued strength in our gene and cell therapy business, which grew at 36% and 52% as reported for the fourth quarter and full year, respectively, and represented between 14% and 15% of total revenue for the year. For the total business in the fourth quarter, organic revenue growth was 4% and constant currency growth was 5% while overall reported revenue was flat year-over-year. Digging deeper into our overall revenue performance, our 35% base business organic growth in the fourth quarter was essentially offset by reductions in COVID-related revenue of 38 million. Regarding overall revenue distribution by region for the full year of 2022, Asia represented 20%, Europe represented 37% and North America represented 43% of our global business. Adjusted gross profit for the full year 2022 finished at 456.9 million, an increase of 62.1 million or 16%, and adjusted gross margin was 57% representing a decrease of 190 basis points year-over-year. Adjusted research and development expenses for the fourth quarter and full year 2022 were 5.9% and 5.4% of total revenue, respectively. Adjusted SG&A expenses for the fourth quarter and full year 2022 were 23.5% and 22.6% of total revenue, respectively, compared to the 22% level in the same 2021 periods. Adjusted operating income for the full year of 2022 was 232.2 million, an increase of 17 million or 8% compared to 2021. Adjusted net income for full year 2022 was 188.6 million, an increase of 13.3 million or 8% compared to 2021. We are setting our 2023 full year revenue guidance, a GAAP metric, at 760 million to 800 million, representing reported growth in the range of minus 5% to flat and organic growth of minus 4% to plus 1%. Maybe, Tony, just to start, on the third quarter call last year, you talked about 16% to 20% base business growth. Thanks for that, Tony. Thanks for that, Tony."
}