{
    "symbol": "RGEN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 12:48:07",
    "content": " Similar to Q1, our base business continues to perform well finishing up 41% for the quarter and 39% through the first six months of the year. In terms of pacing, we still expect second half of the year of COVID revenues to be down 30% to 40% versus first half with full year COVID revenues now expected to come in at $140 million to $150 million, slightly down from our estimate on our Q1 call. In filtration, our business was up more than 40% in the second quarter and 50% through the first six months of this year, compared to the same periods in 2021. We are very encouraged by our base business growth, which we anticipate will be above 30% this year with additional capacity coming online, new products, continuing to hit the market, excellent performance by our recent M&As. At the market level, we expanded our presence in gene therapy with another strong quarter with year-over-year growth of approximately 70% excluding COVID-related revenue at gene therapy accounts. On our top line, we delivered revenue of $207.6 million in the second quarter, representing an increase of approximately $45 million and 27% reported growth. Adjusted gross profit was $121.9 million in the second quarter of 2022, increasing by $20.8 million or 21% compared to the same period in 2021. Adjusted gross margin of 58.7% for the second quarter compares to 62% in the same period of 2021, where we had significant revenue acceleration pacing well ahead of our capacity and personnel expansion activities. Second quarter 2022 adjusted operating income was $65.6 million, an increase of $8.9 million or 16% compared to the same 2021 period. In the second quarter of 2022, our adjusted net income was $51.4 million, an increase of $6.5 million or 15% compared to the same 2021 period. Adjusted EPS increased to $0.91 per fully diluted share in the second quarter 2022, an improvement of $0.12 or 15% compared to $0.79 in the 2021 quarter. Overall, we are updating our 2022 full year revenue guidance, a GAAP metric to $790 million to $810 million, which reflects increased projected demand for our base business offset by slightly lower projected COVID-related revenue. Yes, I haven't run that analysis, but just thinking through that â\u0080\u0093 I would say that what we've done over the last seven years and the impact of those products and contributing about 25% of the revenue, I would expect that it'll be at least 25% of the revenue on a go forward basis. We see it as about a $50 million revenue business this year, Paul, and growing well north of the 20% plus for the foreseeable future."
}