{
    "symbol": "EAF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-03 12:58:03",
    "content": " Turning to our fourth quarter performance, our production volume was approximately 29,000 metric tons, representing a 36% year-over-year decline and a 22% sequential decline from the third quarter. In addition, toward the end of the fourth quarter, we began to proactively reduce production at our European manufacturing facilities, most notably our facility located in Pamplona, Spain, to better match production volume with graphite electrode demand and to manage high energy costs more efficiently. While the impact on our fourth quarter production levels was modest, we expect to reduce our production volume from our two European facilities to approximately one third of their capacity for the first half of 2023. Turning to sales, our fourth quarter sales volume of approximately 28,000 metric tons, represented a 37% decline from the same period in the prior year, and a 22% sequential decline from the third quarter. Fourth quarter shipments included 19,000 metric tons sold under our LTAs at a weighted average realized price of $9,400 per metric ton and 9000 metric tons of non-LTA sales at a weighted average realized price of $6,100 per metric ton. As we look at the first quarter of 2023, reflecting the headwinds that we discussed, we anticipate our total graphite electrode sales volume will be in the range of 15,000 metric ton to 18,000 metric tons for the quarter. Lastly, regarding our top line outlook for the first quarter of 2023, we expect our weighted average non-LTA pricing to remain comparable to the 2022 full year average of approximately $6,000 per metric ton. Adjusted EBITDA was $80 million, a decrease from $183 million in the fourth quarter of 2021 reflecting the lower sales volume and higher year-over-year costs. For the fourth quarter, we experienced a year-over-year increase of 47% in cash COGS per metric ton, which represented a 20% sequential increase compared to the third quarter of 2022. As we look ahead, we project our cash costs per metric ton for the first quarter of 2023, to be flat to up slightly compared to the fourth quarter of 2022. Therefore, we're projecting a year-over-year increase in our cost per metric ton in the range of 17% to 20%, on a full year basis for 2023, as compared to 2022, which averaged $4,300 per ton. For these reasons, and with sales volumes expected to normalize, return to more normalized levels beginning in the back half of 2023 and for the full year of 2024, we are optimistic that our cost per metric ton will improve significantly as we move beyond the current year."
}