{
    "symbol": "CYN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 20:53:33",
    "content": " These forward-looking statements can be identified by terms such as anticipate, believe, expect, future, plan, outlook and will and include, among other things, statements regarding the company's continued development of the Enterprise Autonomy Suite or EAS and its components, expectations regarding sales and our revenues, growth strategy, ability to deliver sustainable long-term value, ability to respond to the changing environment and operational focus. Total operating expenses for the third quarter ended September 30, 2022 were $5.3 million compared to $2.1 million in the same quarter of the prior year. G&A expense also increased by $1.6 million which was largely related to increased noncash stock-based compensation, expenses incurred for additional personnel and professional services to support our status as a public company. Net loss per share on a basic and diluted basis was $0.16 based on approximately 33.6 million weighted average shares outstanding for the quarter ended September 30, 2022. For the 9 months ended September 30, 2022, total operating expenses were $13.7 million compared to $5.8 million in the prior year period. And part of the reason for our selection and what we see as really the long-term vision that grows this from being a customer for a vehicle is that it really does ultimately grow into this being then repeated across other vehicle form factors within their global fleet, which is a substantial vehicle fleet and growing that footprint within the customer and bringing to fruition that sensibility that we have been touting about the way that we've built the technology, which is that automating that second vehicle, that third vehicle becomes a de facto solution with Cyngn as opposed to with a different automation supplier. So we're seeing firsthand that this strategy that we have been pitching about the ability to automate different types of vehicle form factors by being more software-centric, by being a more software-defined vehicle and vehicle agnostic is really coming to fruition and getting us the most difficult selection of winning that first vehicle and winning the next one becomes iteratively and incrementally easier and easier for us, which means on the flip side, trying to capture those becomes more and more difficult for our competitors."
}