{
    "symbol": "CHPT",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-02 20:00:05",
    "content": " Our fourth quarter grew 93% year-on-year and 22% sequentially, making another record quarterly revenue level for the company, while improving non-GAAP margins by 3 points to 23%, delivering on our expectations set on our last call that we would sequentially improve gross margin. Fourth quarter revenue was strong at $153 million, up 93% year-on-year and 22% sequentially, but below our previously announced guidance range of $160 million to $170 million, as Pasquale noted. Network charging systems at $122 million was 80% of fourth quarter revenue, up 109% year-on-year and 25% sequentially. Subscription revenue at $26 million was 17% of total revenue, in line with its third quarter percentage contribution, up 50% year-on-year and 19% sequentially. In the fourth quarter, Europe delivered $22 million in revenue, growing 129% year-on-year and 26% sequentially. Non-GAAP operating expenses for the fourth quarter were $81 million, a year-on-year increase of 5% and a sequential increase of 2%. In fiscal 2023, our European business delivered $73 million in revenue, up 190% year-on-year. To maintain our path to profitability, we responded to fiscal 2023 gross margin shortfalls by spending $35 million less in non-GAAP operating expenses relative to our original annual guidance and essentially kept quarterly non-GAAP OpEx flat each quarter of the year. For the first quarter of fiscal 2024, we expect revenue to be $122 million to $132 million, a year-over-year increase of 56% at the midpoint. Reaching this milestone next year with the North American EV passenger fleet estimated by Bloomberg in at under 5% and under 8% in Europe, should position the company well early in the industry's growth cycle. The thing that I would focus you on as we've talked about or path to profitability, the burn that you see, call it, adjusted EBITDA, call it, whatever you want to call it, that's going to decline meaningfully over time over the next year or two because getting to zero across the over something that's super important. As you pointed out, I think both of you pointed out in the prepared remarks, you effectively held the non-GAAP OpEx flat all year roughly $80 million and the -- as a percentage of sales, down to 50% from 100% earlier in the year."
}