{
    "symbol": "CHPT",
    "quarter": 3,
    "year": 2023,
    "date": "2022-12-01 20:52:03",
    "content": " At time this, I would like to welcome everyone to the ChargePoint Third Quarter Fiscal 2023 Earnings Conference Call and Webcast. I would now like to turn the call over to Patrick Hamer, ChargePointâ\u0080\u0099s Vice President of Capital Markets and Investor Relations. With me on todayâ\u0080\u0099s call are Pasquale Romano, our Chief Executive Officer and Rex Jackson, our Chief Financial Officer. This afternoon, we issued our press release announcing results for the quarter, which can also be found on the website. We would like to remind you that during the conference call management will be making forward-looking statements, including our fiscal fourth quarter and full fiscal year 2023 outlook. These forward-looking statements involve risks and uncertainties, many of which are beyond our control and could cause actual results to differ materially from our expectations. For a more detailed description of certain factors that could cause actual results to differ, please refer to our Form 10-Q filed with the SEC on September 8, 2022 and our earnings release posted today on our website and filed with the SEC on Form 8-K. Also, please note that we use certain non-GAAP financial measures on this call, which we reconcile to GAAP in our earnings release and for historical periods and the investor presentation posted on the Investors section of our website. And finally, we will be posting the transcript of this call to our Investor Relations website under the Quarterly Results section. Thank you, Patrick and thank you everyone for joining our eighth earnings call as a public company. We had another record quarter with strong growth yielding $125 million in revenue, at the low end of our guidance range, up 93% year-over-year and 16% sequentially. Demand again exceeded supply for the quarter, resulting in additional growth in backlog. As we manage the revenue and gross margin challenges presented by supply chain constraints, logistics disruptions and new product introductions, Iâ\u0080\u0099d like to comment on operating expenses. As our OpEx this year shows, we have significantly slowed our operating expense trajectory. As we have commented previously, we have invested ahead of the market for many years and our revenue growth has been and continues to be correlated with the availability of electric vehicles. With the continuing announcements by manufacturers of new EVs for consumers and fleets, we believe the global vehicle industry has passed the point of no return. And though we have the typical challenges ahead to scale rapidly, we expect to grow operating expenses opportunistically and thus to continue to show improved operating leverage as we have done this year. Focusing for a moment on R&D, ChargePoint believes a broad product portfolio is essential, because you have to be everywhere drivers go to be relevant. We have achieved major recent releases of our highly modular Express Plus DC product line, which powers our global fleet and passenger car fast-charge solutions and introduced the CP6000, our newest commercial and AC fleet product line, expanding our capabilities in the geographies we serve. With these products in production, we expect to shift a higher percentage of R&D spend to evolutions of our platforms and to continue investments in our cloud software, which comprehensively drives our entire ecosystem for drivers, commercial station owners, fleets and the large array of ecosystem partners. Given our pace of growth, we will of course continue our investments in sales and in our channel relationships, which combined give us industry leading reach. Last year, we averaged one booking over $1 million per quarter. This year, we have seen steady increases in the number of bookings exceeding $1 million within a quarter which is a reinforcing trend supporting our land-and-expand strategy. In the third quarter alone, we had 11 bookings to end customers of over $1 million. Our consistent expansion within existing customers was over 65% of our billings for the quarter, consistent with historical trends and we now account 80% of the 2021 Fortune 50 as customers and  (ph) of the 2021 Fortune 500. Lastly, on investment in support of the remarkably increasing scale of the business, we will be adjusting spend proportions in favor of business systems, sales automation, customer lifecycle management, support operations tools and installer and channel partner platforms. We believe that the breadth of our product lines backed by the right systems infrastructure, are significant competitive advantages. In Rexâ\u0080\u0099s commentary, he will address billings by vertical, but I wanted to comment briefly on some of the progress in European fleet, two key enablers, we believe critical to ChargePointâ\u0080\u0099s revenue growth outpacing North American consumer EV arrival rates. For example, short-haul and last-mile billings are up over 475% year-over-year and transit is up 180% year-on-year. Our installed base of network ports under management grew to over 210,000, a year-over-year increase of 30% and sequential increase of 6%. Of those, over 65,000 are in Europe and over 16,700 are DC fast, an increase of more than 1,000 DC fast ports quarter-over-quarter. As a reminder, we do not include home chargers for single-family residences in our network port count, but we continue to see strong demand for residential. Complementing this, our roaming reach is now over 400,000 ports in North America and Europe. Rex will elaborate on guidance, but in short, the breadth and scale of our business model combined with accelerating driver demand for EVs, has allowed us to narrow our annual revenue guidance range with a higher midpoint than we gave in March and reiterated at each quarterly call. While these headwinds continue, we are seeing signs of freight cost decline and component shortages concentrating. Looking at some of the environmental statistics that are so critical to all of us, we estimate that our network has now fueled approximately 5 billion electric miles to-date. We estimate the drivers utilizing our network have avoided approximately 200 million cumulative gallons of gasoline and over 940,000 metric tons of greenhouse gas emissions. We are growing rapidly across our three verticals in two geographies, so we simply need to do everything bigger and better to maximize our opportunities and generate maximum returns for our shareholders. We believe that with each passing quarter, we add to the remarkable technology team, customer relationships, channel structure and other competitive advantages we have been building over the 15-year history of the company. Thanks, Pasquale and good afternoon everyone. A quick reminder, as in previous calls, my comments are non-GAAP, where we principally exclude stock-based compensation, amortization of intangible assets and non-recurring costs related to restructuring and acquisitions. For Q3, revenue was $125 million, up 93% year-on-year and 16% sequentially at the low end of our guidance range of $125 million to $135 million. As Pat mentioned, the difference between our results and the midpoint of our guidance was largely due to shipments of AC units delayed beyond quarter close, all of which shipped in November. As we have for multiple quarters running, we fundamentally ship what we could build and book more than we could ship. So we worked down a meaningful percentage of our existing backlog during the quarter, a good thing since much of our backlog was at older and thus lower pricing, our ending backlog increased. Network Charging Systems revenue at $98 million was 78% of Q3 revenue, up 105% year-on-year and 16% sequentially. Subscription revenue at $22 million was 17% of total revenue, up 62% year-on-year and 7% sequentially. Our deferred revenue, which is future recurring subscription revenue, principally from existing customer commitments and payments for our cloud software and Assure warranty coverages, continues to grow, finishing the quarter at $175 million, up from $168 million at the end of Q2. Turning to verticals, as you know, we report them from a billings perspective, which approximate the revenue split. Q3 billings percentages were commercial 69%, fleet 18%, residential 12% and other 1%, representing a slight shift in favor of fleet. Residential contribution was strong, but on a percentage basis was impacted by supply shortages. From a geographic perspective, North America Q3 revenue was 86% and Europe was 14%. In the third quarter, Europe delivered $17 million in revenue and grew 145% year-over-year. Europe revenue was essentially flat sequentially due to product availability, but from a bookings and backlog perspective, Europe had a record quarter. Non-GAAP gross margin for Q3 was 20%, up 1 percentage point from Q2â\u0080\u0099s 19%. However, that impact was partially offset by $7 million or 5 points of purchase price variances and elevated logistics costs, the margin impact of a heavier DC mix due to AC supply shortages and $3 million or 2 points in product transition charges. Non-GAAP operating expenses for Q3 were $79 million, a year-on-year increase of 26% and down 1% from Q2. We are pleased to see OpEx, as a percentage of revenue, dropped from over 100% in Q1 to 74% in the second quarter and to 63% in the third quarter. This progression is a critical component of the combination of revenue growth, margin expansion and OpEx leverage improvement necessary to reach our stated goal of generating free cash flow by the fourth quarter of calendar 2024. We do not expect OpEx to drop in dollar terms as we go forward, but expect leverage to continue to improve, especially given that we have now released a number of core products that have taken years to develop. Stock-based compensation in Q3 was $26 million, essentially flat from Q2. Looking at cash, we finished the quarter with $398 million in cash and short-term investments. We had approximately 342 million shares outstanding as of October 31, 2022. Turning to guidance, for the fourth quarter of fiscal 2023, we expect revenue to be $160 million to $170 million, up 108% year-on-year and up 32% sequentially at the midpoint. For the fourth quarter, we expect non-GAAP gross margin to again improve sequentially, but for the year to be below the 22% to 26% range we previously targeted. With our continued focus on OpEx, we are lowering our annual guidance for non-GAAP operating expenses to $325 million to $335 million down from our prior guidance of the lower end of $350 million to $370 million. With that, I will turn the call back to the operator for questions. Pat, on the fleet side of the business, which obviously is a huge opportunity, I know we are still a bit vehicle constrained, but every kind of quarter we get closer to that constraint coming down. So, I donâ\u0080\u0099t see a change in urgency, because the â\u0080\u0093 I mean, I think there has been a lot of pent-up demand for vehicles, because they just pencil. What you are seeing, Iâ\u0080\u0099ll just draw your attention to a couple of comments that I made, large growth rates year-on-year in both the kind of midsized logistics, short-haul vehicles, because you are starting to see more supply come online. And then you are also seeing which is a disproportionately mature transit industry, so effectively buses, where because there are plenty of manufacturers that have maturing products, products that have actually seen more than one generation, you are seeing that growth rate as well. So, I made â\u0080\u0093 I had some specific comments in my remarks on that. And I made a similar comment in answer to a question, I believe, last earnings Q&A. And just to kind of a little bit more color on kind of what held us up a bit this quarter on the revenue side, we made a supply-driven design update effectively of one of our AC platforms that was planned. And as a result of components coming in a bit late and a very complicated transition in what is a kind of mature product in the factory, just didnâ\u0080\u0099t get it all built in time. So as Rex pointed out in his comments, I think I made it in mine as well we cleared all that and shipped it. Thatâ\u0080\u0099s a good question, one I canâ\u0080\u0099t directly answer, but we have been building backlog, as we have said, at a rapid rate this year. I think the only thing to say is it would be substantially higher, but I just canâ\u0080\u0099t give that out. But anyway, the other thing I was thinking is and listening to the question from James West and how we are handling things, we have supply chain constraints, but our growth rate is fairly astounding. And then I would expect from a backlog burn off perspective next year for that to be a nice boost to â\u0080\u0093 or maybe a boost or a sustainer of growth rates, right. I donâ\u0080\u0099t know how fast we will burn out, but I donâ\u0080\u0099t see it as being blood-ish. And then to your point, Rex, in your prepared remarks, you called out $7 million in purchase price variance, $3 million in product transition costs. So if you are focused on the price increase, as we said, weâ\u0080\u0099ve got about half of it in Q3, I would expect to get most of it â\u0080\u0093 most of the rest in Q4. And then in terms of the variances and whatnot, as Pat mentioned just a moment ago, the logistics side of the house is turning around pretty well. It used to be pretty much across everything, and now itâ\u0080\u0099s more isolated components, and then I would see that coming down nicely over the next couple of quarters. Canâ\u0080\u0099t forecast when it goes away entirely, but I do think it would be on a downward trajectory, maybe not in Q4 because a lot of things are baked in, but certainly as we go into next year. And then one thing you should know â\u0080\u0093 in terms of getting to 100% of price increases, make sure you understand where they apply, they apply mostly to North America â\u0080\u0093 hardware in North America. And it will â\u0080\u0093 if youâ\u0080\u0099re doing a model, it will apply â\u0080\u0093 when we get to 100%, it wonâ\u0080\u0099t be 100% because we have contracts with major customers that wonâ\u0080\u0099t let us do that everywhere. But the impact is certainly a meaningful and positive as we saw in Q3, and we expect to see in Q4. Itâ\u0080\u0099s â\u0080\u0093 I mean, weâ\u0080\u0099re continuing to focus in a balanced way across all the verticals, and we will continue to do so. I want to just make sure that we reinforce a point in â\u0080\u0093 that I was making in my prepared remarks, in that when we decided to really escalate our spend rate relative to where the market was even before we went public, that was essentially to intersect with the growth models that we have put together for EV installed base effectively. Where â\u0080\u0093 the reason that things have leveled off quite a bit with respect to OpEx expansion, and as Rex mentioned, it doesnâ\u0080\u0099t mean itâ\u0080\u0099s going to go down, itâ\u0080\u0099s just weâ\u0080\u0099re controlling that trajectory now, is because weâ\u0080\u0099ve built out most of the functions substantively necessary to support the verticals and the geographies. There will be continued investments as we flesh things out and as certain verticals unwind from vehicle shortages, but I donâ\u0080\u0099t expect us to unnaturally overweight anything and leave another vertical uncovered. I just want to clarify that when you are referring to â\u0080\u0093 you mean our Assure programs, our... Maybe itâ\u0080\u0099s Assure programs, okay. So just to make sure I am referring to the right thing certainly from a software perspective, which is one of the things we supply that with call service. As far as our Assure Warranty program, we put a lot of energy into increasing the attach rates on that over the last couple of years. They are not 100%, but they are very healthy and they are not trending down, they are trending slightly up, and we would expect that to continue. Big swing on that is, there are some customers who canâ\u0080\u0099t buy it because they want to self-serve and then obviously, we have to work successfully with our extensive channel network to drive short through that, and weâ\u0080\u0099re working on that steadily, but â\u0080\u0093 yes, Assure is in a great place. Yes, there is a lot to unpack here, Gabe, but we will â\u0080\u0093 letâ\u0080\u0099s see if we can take them in order. So the first one regarding hot or cold spots in commercial, Iâ\u0080\u0099ll shorthand your question that way. As Rex has mentioned, I think on a few earnings calls, the workplace component, while itâ\u0080\u0099s there and continues to be vibrant is muted a little bit relative to what it would be if people were in the office 5 days a week, 100% of the previous workforce that was in office have returned to office. And even relative to the previous answer that I gave to one of the questions today, it stresses why you have to be everywhere drivers go. So we lose our network effect advantage to businesses if we were to see a focus on one sub-vertical versus another, thatâ\u0080\u0099s why we donâ\u0080\u0099t do it. But most importantly, when we see unforeseen macro trends that will change traffic patterns and driving patterns, if youâ\u0080\u0099re in every vertical, youâ\u0080\u0099ve been insulated from that. And thatâ\u0080\u0099s â\u0080\u0093 youâ\u0080\u0099ve seen us despite a lot of supply chain constraints, etcetera, effectively doubling the business. And that is largely due to the fact that weâ\u0080\u0099re a bit insulated from mix shifts due to grant programs, things like that, because as things bubble up in one vertical and maybe bubble down in another, the put offsets the takes and you wind up having a fairly predictable steady and healthy growth rate. From an ASP perspective, itâ\u0080\u0099s so much higher on an ASP basis. So if you look at the active ports under management, which is a reasonable a reasonable view because we do represent a network that is virtually every use case driver might encounter publicly, youâ\u0080\u0099ll see a fairly steady port percentage of DC. Now specifically with NEVI, you may see some pull forward there. Iâ\u0080\u0099ll remind you that in the inner years â\u0080\u0093 because it is a 5-year program, in the inner years, that will be a bigger percentage of the overall DC requirement in the United States. But in the outer years, that â\u0080\u0093 because the amount of grant money per quarter there is constant, but the market will be so much bigger, it will get more diluted. Iâ\u0080\u0099ll also remind you that weâ\u0080\u0099re operating in two geographies, and that phenomenon does not exist in Europe. And then as fleet unwinds, from a vehicle supply perspective, that will start to build. Right now, fleet is very heavily DC-oriented because so much of it is transit and mid-sized trucking, etcetera, so hard to call the fleet impact on this whole thing. But again, the DC mix is much more of an ASP ratio problem or not a problem, but phenomena than it is a port count shift or a demand shift. Sorry, again, for all the multiple questions and then one. Maybe this year, itâ\u0080\u0099s just more of a chip issue. Well, one of the â\u0080\u0093 like, Gabe, one of the things Iâ\u0080\u0099ve learned over my career is using a crystal ball is probably not a great way to run a business when something is driving the financials as hard as supply chain is. So I donâ\u0080\u0099t know what the hell is going to happen in the macro that could potentially stop the recovery thatâ\u0080\u0099s happening in the â\u0080\u0093 on the supply chain side, but something could happen thatâ\u0080\u0099s unforeseen. We are seeing, as weâ\u0080\u0099ve reported now for several quarters, the concentration on the material side that is concentrated largely in ICs. In the long-term, if, and itâ\u0080\u0099s a big if, the macro starts to significantly pull back demand for consumer electronics that use common ICs that would be prevalent in chargers, we would see that segment of the IC shortages clear up substantially. We do see some of that now, hard to call how long itâ\u0080\u0099s going to take to fully kind of fully relieve itself there. And then in the long-term, we expect that power semiconductors will likely continue to be in demand because they are used across the energy transition. And obviously, because I just said that, you know that thatâ\u0080\u0099s something that our supply chain team is working on continuously. I mean, look, the fast charge product line that weâ\u0080\u0099ve been kind of grooming and expanding, that is a product line â\u0080\u0093 it shifts everywhere now. It may â\u0080\u0093 because everything has been designed to be a fairly Lego-block whether we have a European standard cable or a U.S. standard cable attached, it doesnâ\u0080\u0099t change the fundamental electronics of the core or the software. The hardware remains configurable and that mention, we launched the CP6000 thatâ\u0080\u0099s up and running and in manufacturing and shipping now. And that one there is a global AC platform, so it can do the entire power range as well as single or three-phase. It does all the metering required for the entire world that we can see from a meter standards perspective, and weâ\u0080\u0099re systematically going through all the incremental certification processes to cover the globe there. We havenâ\u0080\u0099t gotten through 100% of everything in every corner of the markets that we serve, but weâ\u0080\u0099re making steady progress and that will wrap up in the not-too-distant future. Some European countries require socketed in some scenarios where the driver brings their own cable you can dynamically change the unit from socketed to cable attached, and you can meet all of the shuttered not socket requirements all over Europe with the same platform. So again, from a manufacturing velocity standpoint and ability to deal with demand, instantaneous kind of mix issues, which always happen, like the long-term trends we can predict pretty well. But instantaneously within a quarter, especially as you get close to the end, you could get deals that come in that move things around locally really quickly. And I couldnâ\u0080\u0099t be happier with how the teams have come together in both those acquisitions, they are fully integrated. And weâ\u0080\u0099ve kind of culturally all â\u0080\u0093 weâ\u0080\u0099ve learned a lot from those folks, and they have, I think, learned a lot from us. And together, I think weâ\u0080\u0099re better than we were before all three of those companies came together on the technical side and on the sales side. And if you look at how many â\u0080\u0093 if you look at the historical headcount of the company, kind of pre-COVID then you â\u0080\u0093 we were still private, right, and going public and now being public for nearly 2 years, 2 years in March, most of our workforce â\u0080\u0093 not most, but a substantial percentage of our workforce that has been hired since COVID have not had the benefit of a great amount of personal interaction just because itâ\u0080\u0099s been constrained. Now thatâ\u0080\u0099s coming back and weâ\u0080\u0099re doing a lot of things to make sure we actively get people collaborating and being very careful by the way, to make sure that we embrace the flexibility that todayâ\u0080\u0099s workforce sort of demand. So we are trying to make sure that we donâ\u0080\u0099t culturally slow down the integration, but that we also donâ\u0080\u0099t throw cold water on peopleâ\u0080\u0099s expectations of slightly more flexible work environment. So, culturally, itâ\u0080\u0099s gelling really well. So, now we know what to invest in from customer onboarding tools and automation, sales force automation, business process, reengineering internally to support what â\u0080\u0093 you think you know what itâ\u0080\u0099s going to look like and then you really know what itâ\u0080\u0099s going to look like when itâ\u0080\u0099s upon you. So, there is a ton of that stuff going on cross-functionally inside the company. It will take time to come to complete fruition because we are also trying to run a business while we are doing that, but I am very happy with how our team has come together. Pasquale, I share your preference for performance indicators over Fortune telling with a crystal ball and that being said, you have the largest business development team in the industry and have a very interesting way of managing that team making them compete for resources. Well, I mean I donâ\u0080\u0099t think we have a shortage of market activity. And I am not trying to be â\u0080\u0093 and with respect to NEVI, I am not disappointed. And if you want to update, as you asked, I expect something to happen in the front half of the year, but not a lot. And I think you will start to see quite a bit of activity in the back half of the year in 2023, and that if things continue on the current trend. And so if you are in our position and you are betting on something on an optimistic side or you are betting on something at all until it materializes, it really undermines your ability to be predictable as a public company. So, when we start to see it ramp and we start to see what our win rate will be, we will be able to make further comments. Just one other one for me and I am just curious if you can comment, I know itâ\u0080\u0099s relatively fresh. But just on this e-RINs news that came out today, just curious if you can kind of clarify how you guys are positioned around that, what you expect. So, I havenâ\u0080\u0099t had a chance, given that we have been a bit pre-occupied with the goings on of this call today to really circle with our program people here to get a full impact statement. But what I can say is that the current LCFS program credit that we take advantage of or the proportions that we can take advantage of that we share with certain customers, thatâ\u0080\u0099s in the other line, on the revenue line. There are occasions we are, but itâ\u0080\u0099s not material or our business model. And so we have to analyze the scenarios and where that â\u0080\u0093 where those credits go, whether â\u0080\u0093 what percentage you are going to go to us, what that will look like in the long-term, and how much we will administer on behalf of our customers, but largely benefit our station on our customers, so too early to give you a full answer. But if you look at the other line, you will get a pretty good indicator of what LCFS has done. One, you mentioned how your â\u0080\u0093 some of your backlog is still on old pricing versus new pricing. So, if you look at the years so far, we have gone â\u0080\u009817, â\u0080\u009819, â\u0080\u009820. And so for Q4, we think we will improve on â\u0080\u009820 given mix and the other things that we have to wrestle with on PPV and that sort of thing, itâ\u0080\u0099s getting hard to put ranges on it. But we did want to let people know, being transparent, that the â\u0080\u009822 to â\u0080\u009826, which we thought we could get to is not mathematically likely, so we are taking that off the table. And then as far as the backlog is concerned, we burn off a significant amount of backlog every quarter, so itâ\u0080\u0099s reloading. And as you can imagine, that takes a while to work through the system in terms of you have got a bunch of quotes out there and now you have to go when you are doing new quotes and you put the new pricing in, so it takes a while for that to go through the system. And as I have said earlier, I think we will probably bang through the older pricing over the next couple of quarters, Q4, Q1, so that will be fully on the new pricing. In terms of how the margins improve there, we havenâ\u0080\u0099t given out a figure on what the price increase level was, but it was significant, right. And so, it will have a very, very nice impact on margins when we roll that through increasingly through the next six months. Just clarifying the previous comment, you talked about transitioning to new pricing over the next six months or the next two quarters by Q2 of next fiscal year. And second question, just on OpEx. So, on the pricing front, again, if you think about â\u0080\u0093 if you announce a price increase, you got to get it out to channel, you got to get it out to sales. As you know, we have been building backlog all year. So, it takes â\u0080\u0093 you do a June price increase, it fully see that roll through, you are looking at nine months at a minimum, just the way it works, right. And so we are well underway, and we did see some nice impact from that in the third quarter. And then as far as operating expense trajectory is concerned, I think if you look at our OpEx for Qs one, two and three on a non-GAAP basis, which I would encourage you to do, even though we all look out. And itâ\u0080\u0099s been very steady this year, and thatâ\u0080\u0099s very purposeful. There is some â\u0080\u0093 the nice thing as we look forward, our new product introduction expenses that hit OpEx will be many of which were in this past year will be substantially reduced. But as I have said in my prepared remarks, I do think OpEx will go up, but I think itâ\u0080\u0099s going to go up in a very measured way in the near-term and a substantially reduced rate relative to our revenue increase. And then frankly, if you were to look back 2 years from now â\u0080\u0093 2 years ago, what was the OpEx rate of increase percentage-wise, nobody expects us to be below that. I just wanted to maybe come back to the margin and just as we are thinking about the prior guide, I think it was indicating somewhere around 25% or 26% for the back half. So, the number â\u0080\u0093 so, if you go through our last two calls and this one, what you will see is the PPV/logistics side of the house, when we had some effort charges this quarter. And then we had â\u0080\u0093 twice we have had stuff not get out of the dock from an AC, which is a higher-margin product perspective. So, there have been 6 points to 8 points, even 9 points in each quarter that doesnâ\u0080\u0099t have anything to do with our business model. It doesnâ\u0080\u0099t have anything to do â\u0080\u0093 well, it may be a little bit with mix but not really. And as lot would have it, as we said, Q3 was another quarter where we just couldnâ\u0080\u0099t get enough product out, especially from an AC perspective. So, when we look at that going forward, itâ\u0080\u0099s a pretty simple question of when the external environment eases so that we get those points back, thatâ\u0080\u0099s a pretty easy fix. We are attacking the op side of the house, both from a scaling perspective and a cost reduction perspective with the vengeance . So, I think there is cause to look forward with gross margin go, I see how this can improve. One of your competitors called out installation issues with DC fast chargers, which stemmed from both labor shortages and transformer supply chain constraints. Whatever you do in construction, especially when it involves electrical upgrades things take â\u0080\u0093 you are into construction permitting and utility interconnect, so things take a while. But I will point you â\u0080\u0093 the easiest way I can kind of help you understand it from our perspective anyway, is we added over 1,000 DC fast charger ports to our active ports under management count. Now, that means those products have been â\u0080\u0093 that were sold through in the past, went through site design, construction, permitting, all the usual stuff, utility, interconnect, and were activated. But it gives you a flavor for the fact that if you have a pipeline, a proper pipeline, the delays essentially pipeline away, so â\u0080\u0093 and the delays arenâ\u0080\u0099t there everywhere. So, in this quarter alone, you are seeing that 1,000 come out, which is a pretty big number. So, I just think as long as you are feeding the top of the funnel, a business like ours, and also because of our diversity of the verticals we are in and geographies, itâ\u0080\u0099s a bit more muted for us. Just one quick question on the subscription gross margin, I think it kind of came in at below 40% in the quarter, kind of flat from last quarter. But â\u0080\u0093 so on a non-GAAP basis, our subscription margin actually moved up nicely in Q3 to the extent that itâ\u0080\u0099s â\u0080\u0093 if you go to GAAP, obviously, we are growing with the team. We are investing heavily, frankly, doing some pre-investing in that space, just because we see good customer support. So, obviously, those people live in that line item and the costs are allocated accordingly. So, by the way, but net-net, our subscription gross margin went north and frankly, we are putting a lot of energy to make sure that continues. When you think about the pricing and what that means for margins, do you think you need to do another round of price increases in order to reach your longer term margin targets, or do you feel with the pricing you have already done and potential for some of these other impacts to perhaps things like supply chain that you can â\u0080\u0093 you get that continue done or are you going to be around? Sorry, I didnâ\u0080\u0099t catch the tail end of the question due to the reception, but on the basic question of are we anticipating further price increases, I think the answer to that is TBD with a shading in the direction of not in the near-term because we just did â\u0080\u0093 we did one early last calendar year and then we did another one that was larger, but North America hardware solution specific in June. And then beyond that, we have got a lot of operational improvements that we are doing is the PPV and the PPV and logistics situations ease. I think we can get where we need to be through more traditional means, right, just improving our costs and improving our expenses, etcetera, versus going for further price increases. But in terms of broad-based price increases, I donâ\u0080\u0099t see one on the table in the near-term. Mr. Romano, I will hand things back to you for any closing comments. Well, I just wanted to say, first of all, thank you for everyone for the thoughtful questions. They had to work very, very hard to pull off the quarterly results. I know they are all very proud of their accomplishments and are looking forward to not only wrapping the year up in Q4, but to the road ahead in 2023 for us. I think itâ\u0080\u0099s really, as I have said in my remarks, the number of makes and models across the board in both passenger cars and the fleet segment really â\u0080\u0093 itâ\u0080\u0099s a really stark difference than it has been even a year ago in terms of availability. And as those things reach some reasonable level of manufacturing maturity, I think you will â\u0080\u0093 we will all be very pleasantly surprised with the pace of adoption and relative to the installed base in this market. We will see you at our last earnings call of the year next time, and we will sign off for now. Ladies and gentlemen, that will conclude ChargePoint third quarter fiscal 2023 earnings conference call."
}