{
    "symbol": "CHPT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-05-31 21:01:04",
    "content": " And so we think that we’ve set ourselves up now for not only a very high velocity of OEs because we commonized that platform, which is very important when you’re managing software, but also enabled us to not become hardware limited from a resource perspective for many times – for many future generations to the last point I’ll make, and then I’ll leave you alone is our smart cable environment in all our new products, DC and AC enables us to change connector types dynamically in the field and has future proofed us against evolving interface types. If you look at that one, we do think and then the other was passing along some of the costs and you know what that means that we’re – we feel like we’ve got the moves in place necessary to significantly improve things, particularly in the second half. Colin, it’s – so first of all, win rate’s historically been quite high as we can measure it on fueling and convenience brands in general, especially, if you remember the – now, which is something that most people have forgotten about the VW settlement that actually had program – money awarded to states much in the same way that they were an analogous way. One of the things we run into, like the thing I mentioned in my script when you have several million dollars within NPI expenses, it looks like you’ve got the sort of sustainable rate that you’re doing, but – so we got popped pretty good in Q1 on that. I think most of our business isn't driven by – it's not really a subsidy driven business as a whole, I mean, obviously if you take the navy program, if you take 30C tax credit, if you take all those different policy components, it's nice to look at a business – nice to think about a business that may have this huge inflection, but they will look at our growth rate without that stuff coming out of a pandemic in the worst supply chain environment with backlog building."
}