{
    "symbol": "UPH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 16:01:05",
    "content": " We continue to show strong revenue growth $36 million in Q1 2022 compared to $33.9 million in Q4 2021, a sequential 6% increase and an 18% increase from pro forma Q1 2021 to Q1 2022, and this growth combined with margin expansion to 43% in Q1 of 2022. Virtual Care Infrastructure generated $15.6 million, 43% of total revenue with a gross margin of 47%. Our Services business, MedQuest and UpHealth Behavioral had Q1 revenues of $17.7 million. Our Services business, MedQuest and UpHealth Behavioral had Q1 revenues of $17.7 million. Our products and services address the needs of very large markets, and we are uniquely positioned and the intersection of 3 fundamental core capabilities, Integrated Care technology platforms, Virtual Care Infrastructure and technology-enabled services that are required for the digital transformation of health care. On Slide 27 now, looking at revenue breakdown by segment on a GAAP basis, services, which again includes our digital pharmacy and behavioral health businesses, with the largest contributor with $17.7 million or 49% of the first quarter's total revenues. The company's revenue mix continues to shift towards the higher-margin Virtual Care Infrastructure and Integrated Care Management segments, which increased from 48% of Q4 2021 total revenues to 51% of Q1 2022 revenues. The company's gross margin on a GAAP basis was 43% in the first quarter, up from Q4's gross margin of 22%, which was adversely affected by the expense recognition issues at Integrated Care Management, which we discussed on our last call. First quarter margins by segment were as follows: Integrated Care Management 63%; Virtual Care Infrastructure, 47%; and Services, 35%. Gross margins in Virtual Care Infrastructure increased from 39% in Q4 2021 to 47% in Q1 2022, largely as a result of operating leverage in the U.S. telehealth business. We're forecasting 2022 revenues of $205 million to $233 million, an increase of 38% to 56% over 2021, and gross margins of 42% to 43%."
}