{
    "symbol": "FORR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 09:22:04",
    "content": " Specifically, research revenues increased 14% compared to the first quarter of 2021 as a result of the aforementioned double-digit growth in CV. As a result of these increased expenses, adjusted operating income declined by 7% to $13.1 million or 10.5% of revenue in the current quarter compared to $14 million or 12.3% of revenue in the first quarter of 2021. Specifically, for the full year, we continue to expect FX headwinds to reduce revenue growth by approximately 1% to 2% with an insignificant effect on adjusted operating margin. For our consulting business, we expect revenue to continue to be flat to down in the second quarter with double-digit growth in the second half as we ramp capacity and mid-to-high single-digit growth for the full year. Given all of this, we expect second quarter revenue to increase 160% to 170% compared to prior year and we expect event revenue for the full year to approximately double compared to 2021. In the second quarter given everything I just walked through, we expect total revenue of $144 million to $148 million and for the full year, we continue to expect total revenue to be $550 million to $560 million. In terms of other guidance, in the second quarter of 2022, we expect our adjusted operating margin to be 14% to 16%, and we continue to expect our full-year adjusted operating margin to be 11.5% to 12.5% given the post-pandemic ramping of the business along with our ongoing investment initiatives to drive growth. Finally for the second quarter, we expect our adjusted EPS to be in a range of $0.70 to $0.76 and we continue to hold our guidance for the full year in the range of $2.25 to $2.35. If we're talking about the split between new business versus existing migrations the bulk of Forrester, well, it's both but we are seeing really healthy uptake from our existing client base and that's where we're seeing a lot of the bookings benefits to revenue benefit where those deals are mostly multiyear, selling at/or above list price and they're also a pretty healthy contract value increase as they migrate to the new portfolio."
}