{
    "symbol": "FORR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 20:53:04",
    "content": " CV bookings growth slowed for three reasons: one, higher-than-expected sales attrition and a slowness in hiring new sales reps; two, lower conversion rates driven by geopolitical and economic conditions; and three, higher-than-normal seat holder turnover in our client accounts. As George mentioned, we delivered CV growth of 10% in the quarter and overall revenue growth of 15% driven by research and events businesses. Specifically, for the total company, we generated $148.2 million in revenue compared to $128.7 million in the prior year period, a 15% year-over-year increase as I just mentioned. In terms of segment results for the quarter, research revenues increased 10% compared to the second quarter of 2021 as a result of the double-digit growth in CV. Our consulting business posted revenues of $39.3 million, which were down 4% compared to the prior year due to a combination of our analysts continuing to shift a portion of their focus to delivering on our CV business, along with some of our clients delaying scheduled projects. And finally, our events business posted revenues of $19.5 million, representing an increase of 191% compared to the second quarter of 2021. Finally, net income increased 51% and earnings per share increased 52% compared to Q2 of last year, with net income at $19.2 million and EPS at $1 for the current quarter, compared with net income of $12.7 million and earnings per share of $0.66 in the second quarter of 2021. Given all of this, we expect third quarter revenues to increase by 190% to 200% compared to prior year, and we expect event revenues for the full year to approximately double our results from 2021. To sum up our year-to-date results and outlook, there are 3 key points: One, Forrester will continue to grow and improve Forrester decisions; two, we will navigate our economic and transition headwinds; and three, we expect to continue to grow CV at double-digit rates."
}