{
    "symbol": "FOR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-27 19:31:03",
    "content": " We estimate our national market share is now 2.2%, up from 1.4% a year ago based on Forestar's trailing 12-month lot deliveries and new single-family homes sold in calendar year 2021. As Dan said in his opening remarks, 22% of lots sold in the quarter were from Forestar-sourced projects up from 13% a year ago. Consistent with our last earnings call, we expect revenue to be higher in the second half of the year than the first half and we expect lower pre-tax profit margins in the first half of the year compared to the second half due to the quarterly mix of expected lot deliveries and to a lesser extent operating leverage. Your line is live. The demand for lots is strong, whether it's a 99-lot community or a 300-lot community, we also only price based on what we think is a phase or roughly a year's worth of demand. If anything I think we've learned how to adapt a little better order material sooner in the development process, and really be able to deliver lots really hasn't extended as much as maybe I had anticipated. Your line is live. We've talked about that during the call, the flexibility that Forestar-sourced projects give us compared to builder source projects that allows us to price lots later in -- or closer to when we're ready to sell them. I think to answer your first question Truman, about 30% of the cost of a finished lot for us to develop that lot is in the land itself, and about 70% is in the development cost, the grading, the pipes in the ground, the streets the things that make up a finished lot. As far as -- I think there was a second question there where am I seeing rapid land inflation, I think my answer is the same as last quarter kind of Austin, Texas and Phoenix are probably where we're seeing pretty big increases in the price to buy land. Your line is live. Your line is live. It's -- our goal is to find that balance between what we think is the best price we can achieve but at the same time making sure there's velocity in those subdivisions -- because again with our return-focused model, velocity is every bit as important as the margin that we're getting and we're really focused on asset turns."
}