{
    "symbol": "PFSW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-13 18:42:01",
    "content": " We drove solid year-over-year service fee equivalent revenue growth as we continue to meet robust fulfillment demand within our current client base and to ramp new client engagements, while restructuring expenses related to our LiveArea transaction and our strategic alternatives process impacted our bottom line for the quarter, we have otherwise made progress with optimizing our cost structure to better align with our current PFS operational framework. These three qualities are at the core of our PFS Operations and coming off a record fulfillment year in 2021, we have continued to leverage our multi-node fulfillment strategy and highly branded operations to provide effective tailored services for our clients, we have quickly reached capacity in each of the three new fulfillment centers we've opened over the past two years, demonstrating our ability to swiftly expand our global distribution network to support our clients. And I think the additional element is client growth in that, we continue to see organic growth with current clients, because of that demand, but we also can see -- continue to see a very strong sales pipeline, good conversion of that sales pipeline is evidenced by strong bookings in the first quarter and our expectation will continue to see the strong bookings continue throughout Q2 and Q3, which are really indicative of clients with these high-end brands looking for our platform to service their needs. I, kind of, joke that we have a just in time facility plan where we have the ability to -- within the normal sales cycle of three to four months make a decision on whether to deploy a short-term facility like we might do with the Northeast, for instance, if we have a single client, we want to test the waters in the new geography done that several times or to open a brand new facility, like we did here in Dallas or in Las Vegas last year and go from signing a lease into full production in less than 90-days."
}