{
    "symbol": "ELVT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 16:32:04",
    "content": " Combined principal loans receivable totaled $546 million as of September 30, 2022, up 6% from $513 million a year ago and up 3% sequentially from where we ended the second quarter. Staying on this slide, revenue for the third quarter was up 11% from the third quarter a year ago, due to an increase in the average outstanding loan balance resulting from second-half growth experienced in 2021 and the first half of '22, while individual product APRs were modestly lower between the periods. On a pro forma basis, which assumes the adoption of fair value loan accounting at the beginning of 2021, adjusted EBITDA for the third quarter of '21 would have been approximately $14 million higher with pro forma adjusted EBITDA of $17 million. On a pro forma basis, which assumes the adoption of fair-value loan accounting at the beginning of 2021, pro forma net income of approximately $0.2 million, or $200,000, would have been reported for the third quarter of 2021, an increase of approximately $11 million from the reported results. As it relates to fair value in the quarter, the fair value premium decreased approximately 50 basis points to 9.6% at the end of the third quarter of '22 from Q2 levels of 10.1%, due to modestly higher credit performance and higher discount rates, partially offset by continued shift in portfolio mix. On a pro forma basis, the overall premium as of September 30, 2021, was approximately 9.3%, as we ramped up our loan growth starting in the third quarter of '21, leading to a higher mix of new and therefore riskier customers in the loan portfolio, which carry a lower fair value premium. Turning to credit on Slide 8, consistent with our expectations, total credit losses increased on both a dollar basis, as well as a percentage of revenues year-over-year, driven by the strong growth in loans in the second half of '21 and their associated seasoning, as well as the continued inflationary pressures on the portfolio. Shifting to Slide 9, operating expenses in total for the third quarter were just above $35 million, lower than the third quarter of '21 million by $5.8 million, or 14%, and versus the second quarter of '22 by $4.8 million, or 12%."
}