{
    "symbol": "ELVT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 05:23:09",
    "content": " At quarter end, the loan portfolio totaled $511 million, which is a 45% increase over a year ago and down slightly since year-end due to seasonal tax paydowns. Despite the overall drop in the loan portfolio, we saw new customer unit growth of approximately 40% and returning customer unit growth of slightly over 20% during the first quarter of '22 as compared to 2021. Looking at the bottom of this slide, adjusted EBITDA and adjusted earnings for the first quarter of '22 decreased compared to prior year as Q1 '22 was impacted by increased net charge-offs along with the adoption of fair value loan accounting, both of which I'll discuss further on later slides. On a pro forma basis, considering the adoption of fair value loan accounting at the beginning of 2021, adjusted EBITDA for the first quarter of 2021 would have been reduced approximately $15 million with pro forma adjusted EBITDA of $17 million. The impact of adoption resulted in a net increase to retain earnings of approximately $98 million, net of tax, which represents the reversal of the previously recognized loan loss provision and the fair value adjustment of the loan portfolio as of January 1. On a pro forma basis, the overall premium as of March 31, 2021, was approximately 12.6% as the loan portfolio was comprised of more mature loans and lower new loan originations during the COVID-19 pandemic period in 2020 and the first quarter of 2021. As Jason just discussed, with the heavier mix of new customer loans during the second half of '21, our net charge-offs as a percent of revenue during the first quarter of '22 were above our long-term target range of 45% to 55% of revenue but were in line with our expectations as we closely monitor the performance of these vintages. As addressed during our prior call, we forecasted continued growth in the loan portfolio with expected end of year combined loans receivable principal of $640 million to $670 million, representing a 15% to 20% annual increase or 25% to 31% from the end of Q1 '22."
}