{
    "symbol": "ELVT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 07:11:05",
    "content": " So to summarize what we know today: one, while we see modest softness on credit at present, we anticipate slightly more pronounced delinquencies in the second half of the year; two, even with softening credit performance, we believe the loan to the portfolio will generate returns similar to pre-COVID vintages; three, we plan to be more cautious in these growth originations in the back half of the year, but we also see broadening opportunity to be selective and make loans to high credit borrowers given the wider market of American seeking loans. As a result, our revenue for the second quarter of $118 million grew 39% from the growth in average loan receivables year-over-year despite a slight drop in APR from the increasing portfolio mix of the Today Card. Combined principal loans receivable totaled $532 million as of June 30, 2022, up 33% from $399 million a year ago and up 4% sequentially from where we ended the first quarter. Staying on this slide, revenue for the second quarter was up 39% from the second quarter a year ago due to an increase in the average outstanding loan balance resulting from second half growth experienced in 2021 and the first quarter of 2022, while individual APRs were relatively consistent between the two periods. On a pro forma basis, which assumes the adoption of fair value loan accounting at the beginning of 2021, adjusted EBITDA for the second quarter of 2021 would have been approximately $8 million higher with pro forma adjusted EBITDA of $19 million. On a pro forma basis, which assumes the adoption of fair value loan accounting at the beginning of 2021, pro forma net income of approximately $3 million would have been reported for the second quarter of 2021, an increase of approximately $6 million from reported results. The fair value premium increased approximately 40 basis points to 10.1% at the end of second quarter 2022 from Q1 levels due to a continued shift in the portfolio mix and credit performance of the portfolio, partially offset by a higher discount rate. As a result of the heavier mix of new customer loans during the second half of 2021, our net charge-offs as a percentage of revenue during the second quarter of 2022 were at the top end of our long-term target range of 45% to 55%, but were in line with our expectations. Operating expenses in total for the second quarter were just under $40 million, higher than the second quarter of 2021 by $1.3 million or 3% and versus the first quarter of 2022 by $1.6 million. The company paid down its VPC debt facilities by approximately $25 million in the first quarter, while drawing down a net $12.5 million on its debt facilities in the second quarter of 2022 to fund loan growth."
}