{
    "symbol": "GEO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 16:20:56",
    "content": " In the first quarter of 2022, we reported revenues of $551 million, which is down less than 5% from a year ago despite the nonrenewal of several of our Federal Department of Justice contracts in 2021 and the ongoing challenges of the COVID-19 pandemic. Adjusting for certain noncash items in the first quarter a year ago, our adjusted net income per diluted share this year increased by more than 10% to $0.31 for the first quarter of 2022. Looking at each of our segments in more detail, our Secure Services owned and leased active facilities experienced a sequential increase in compensated occupancy rates of 1%, ending the first quarter of this year at 86% of capacity. As of the first quarter of 2022, we have 1 company-owned facility under direct contract with the BOP, which generates approximately $38 million in annualized revenues and which we expect will not be renewed when the current contract option period expires at the end of September of '22. With respect to our owned and leased reentry services facilities, occupancy rates have continued to be challenged by the impact of COVID-19 and ended the first quarter at approximately 44% of capacity. Since the beginning of the year, we have reduced our net -- since the beginning of 2020, we have reduced our net recourse debt by approximately $330 million, including approximately $80 million during the first quarter of 2022. Adjusting for onetime gains in the first quarter a year ago, our adjusted net income per diluted share increased by approximately 10% to $0.31 on revenues of approximately $551 million for the first quarter of 2022. Our AFFO and adjusted EBITDA for the first quarter of 2022 increased by 5% to $0.64 per diluted share and by 15% to $125 million, respectively. Compared to our first quarter 2022 results, our second quarter 2022 guidance reflects the previously announced discontinuation of our managed only George W. Hill correctional facility contract in Pennsylvania, representing approximately $47 million in annualized revenues. Since the beginning of 2020, we have reduced net recourse debt by approximately $330 million, including approximately $80 million during the first quarter of 2022. Despite a challenging operating environment, we have continued a successful streak of contract renewals with 7 GEO reentry services contracts renewed during the first quarter of 2022. In the first quarter of 2022, our nonresidential reentry compensated mandates increased by 15% year-over-year, with quarterly revenues increasing to $22 million."
}