{
    "symbol": "GEO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 17:05:05",
    "content": " I am pleased to be joined today by our senior management to review our financial results for the second quarter, the trends for our business segments, our increased guidance for 2022 and our recent announcement of proposed transactions to address our debt maturities and strengthen our capital structure. Our quarterly revenues increased by 4% year-over-year to $588 million, which follows revenue declines over the last 2 years due to the COVID pandemic and policy changes that impacted several of our federal contracts. As a result of these efforts, we have been able to provide wage increases for our employees across several states. Since the beginning of 2020, we have reduced our net recourse debt by approximately $375 million, including approximately $130 million during the first half of this year. The proposed transactions will stagger our debt maturities between 2023 and 2028, therefore significantly reducing the total recourse debt that is due between 2023 and 2024 from approximately $2 billion to approximately $600 million. Based on our current projections, we expect to reduce our net recourse debt by approximately $200 million in 2022 ending the year at just under $2 billion in net recourse debt and total net leverage of approximately 3.8x. Assuming consistent performance across our business over the next 2 years, we would expect to be able to reduce net recourse debt by at least $200 million to $250 million annually. For the second quarter of 2022, we reported GAAP net income attributable to GEO of approximately $54 million. Adjusting for a gain on real estate assets, we reported adjusted net income of $0.42 per diluted share on revenues of approximately $588 million for the second quarter of 2022. We reported second quarter 2022 AFFO of $0.69 per diluted share and our adjusted EBITDA increased by 12% to more than $132 million, which represents the highest quarterly run-rate in our history. Since the beginning of 2020, we have reduced our net recourse debt by approximately $375 million, including approximately $130 million during the first half of 2022. Under our current debt maturities, we would have had to address approximately $2 billion in outstanding debt between 2023 and 2024 and approximately $580 million in outstanding debt in 2026. Under the proposed transactions and based on commitments as of July 18 and minimum participation requirements, our revised debt maturities are expected to be approximately $170 million in 2023, approximately $430 million in 2024, approximately $340 million in 2026, approximately $900 million to $960 million in 2027, and approximately $440 million in 2028. We expect to reduce our net recourse debt by a total of approximately $200 million in 2022, which would allow us to end the year with less than $2 billion in net recourse debt and lower our net leverage to around 3.8x. Assuming our financial performance remains consistent over the next 2 years, we expect to be able to further reduce net recourse debt by at least $200 million to $250 million annually. Upon closing of the proposed transactions, based on committed support as of July 18, 2022 and minimum participation requirements, we expect our interest expense to increase by approximately $27 million to $30 million pre-tax in 2022 and by an additional $37 million to $41 million pre-tax in 2023. Through the end of July 2022, we have completed sales transactions involving facility assets, business segment contracts and land totaling approximately $70 million in proceeds. For the third quarter of 2022, we expect net income attributable to GEO to be between $39 million and $42 million on quarterly revenues of $603 million to $608 million. As a result of these efforts, we have been able to provide wage increases for our employees across several states."
}