{
    "symbol": "CLW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 18:43:09",
    "content": " And finally, we repurchased $5 million of shares in 2022, but did not buy back shares in the fourth quarter. Unfortunately, we experienced several setbacks during the outage and startup that resulted in approximately $5 million of negative impact to paperboard adjusted EBITDA versus our expectations. In the fourth quarter 2022, we recorded a net loss of $6 million, net loss per diluted share of $0.34 and adjusted net loss per diluted share was $0.30. Whereas in 2022, we experienced a major maintenance outage impact of $28 million comprised of approximately $8 million in volume and $20 million in cost. While we did not repurchase shares in the fourth quarter, we repurchased 150,000 shares for full year 2022 at an average price just above $33 dollars a share or $5 million We have approximately $25 million remaining on our share repurchase authorization and expect to continue buying back shares in 20 23. In the fourth quarter, we continue to improve our financial flexibility and renewed our ABL credit facility, which extended our maturity to November of 2027 and increased the size to $275 million. The midpoint of that range is $70, which is $42 million higher than the fourth quarter of 2022. The $42 million sequential improvement is primarily driven by the absence of major maintenance outages, as well as operational and weather related issues. Similar to the first quarter outlook, we believe that our operational results will improve by approximately $42 million in 2023, primarily due to lower maintenance outage expenses and improved operating performance. Our Lewiston recovery boiler tube replacement project, which is expected to require a capital expenditure approaching $40 million is expected to occur in early 2024 along with our planned major maintenance outage. So you mentioned that you expect your previously announced price increases and mix to largely offset cost inflation, meaning, I guess, that you're expecting inflation to slightly outpace price mix, whereas last year the price mix more than offset inflation by about $50 million. Thanks so much, Arsen. Just question -- Q4 seemed to come in sort of in line with us on pulp and paper side, but weaker on the tissue side, even given the $2 million hit on the outage at Lewiston. I think there is a blending of discretionary and sustaining, but yes, you're right to say you're spending $8 million on a project in 2024 and 2023, otherwise you're at to slightly above the normalized range that you've put out there. Thanks so much, Arsen."
}