{
    "symbol": "GGB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 23:52:09",
    "content": " Gerdau's net income totaled BRL 4.3 billion in the second quarter of 2022, also an all-time record for the period, representing a year-on-year increase of 27%. Initially, I highlight that the adjusted EBITDA of our North America business operation doubled between April and June in a year-on-near comparison, reaching a record number for a quarter of BRL 2.8 billion, with a record adjusted EBITDA margin of 33.1%. I will now talk about the scenario for long and flat steel in Brazil, whose performance in Q2 reflects a period of continued demand for steel from the different sectors in which we operate at very healthy levels, with shipments of steel from our Brazil business operation up 4% year-on-year between April and June. The sales value of real estate property launches recorded in the second quarter of almost BRL 10 billion represents an increase of 2.4% in the annual comparison, while the number of active construction sites in Brazil continues to grow and reached again its highest number in the 15-year historical series now in July. In the 12-month period, if we analyze how we invested our free cash, even with the -- when -- even net of the effects of exchange rate variations in stock holdings in our joint ventures, we returned to our shareholders 43% of our free cash flow as dividend payouts and share buybacks and invested another 41% of this cash flow in reducing our net debt, as we will see in more detail in a minute. So we've been addressing ESG differently for many years now, but the journey since the origins -- so I would like to stress on this slide that as part of our diversity and inclusion journey, there was an increase in women in leadership positions from 17% in 2019 to 23.6% in 2021, in line with our commitment to reach the level of 30% by 2025. We also understand that in such a cyclic industry -- if you think about 2015, second quarter 2020 and now, second quarter 2022, it is very important to keep our focus not only on relative goals because EBITDA increases, but can also go down, but also have full focus on the amount of net debt and cash available."
}