{
    "symbol": "GGB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 18:33:11",
    "content": " Also last year, we recorded the company's second best adjusted EBITDA, BRL 21.5 billion with an EBITDA margin of 26.1%. I also emphasize the performance of the North America business operation throughout 2022, which posted an adjusted EBITDA of BRL 10 billion with an EBITDA margin of 32%, both historical annual records. Therefore, we ended year 2022 with a record cash flow of BRL 10.5 billion, equivalent to almost 50% of EBITDA for the period and almost BRL 900 million above what we generated as cash flow in 2021, which was also extremely important cash generation year for us. For year 2023, and by the way, we had material information with the guidance showing investment of BRL 5 billion in CapEx with our steel operations, 50% of this amount -- approximately 50% for maintenance and the other 50% in expansion and technological upgrade of our business. I would also like to highlight on this slide that in addition to the BRL 5 billion, exclusively related to our steel operations, CapEx and steel investments, in addition, we also have some disbursements related to Gerdau Next initiatives. I also highlight that we obtained the certification of our second operation as a B Corp. SIDERPERU, the company's steel production operation in Peru, joins Gerdau Summit, our joint venture with a Japanese company Sumitomo Corporation and Japan Steel Works focus on the supply of rolling mill rolls and parts for wind power generation, which now become the first 2 steel producers in the world to be certified as B Corp. As part of our sustainability agenda, this certification recognizes that Gerdau complies with good sustainability practices and that it effectively connects the business with our purpose of empowering people who build the future, leaving a legacy for society. We are investing BRL 800 million more in 2023 in projects to grow -- to provide profitability, other products, other capacities more than we invested in '22, aligned to what Gustavo mentioned, when we talk about maintaining our plants efficient, and we are talking also about gaining costs, expanding product lines that we believe that will be generating more value over time. The disbursement that we forecast for this year, not -- the BRL 5 billion that we mentioned is for steel only as we said, but it's -- for Gerdau Next, the BRL 500 million and BRL 800 million. About CapEx, I think I also mentioned in a previous question by a colleague, the BRL 5 billion are absolutely and exclusively investment in steel, our core business, out of which 50% maintenance and 50% growth and competitiveness, projects with specific returns."
}