{
    "symbol": "HY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 21:40:29",
    "content": " Despite these headwinds and while still reporting a substantial consolidated operating and net loss, our results for the quarters were substantially better than we anticipated in our first quarter earnings release with all 3 segments, particularly the Lift Truck business reporting better-than-expected results. In the second quarter, our consolidated revenues increased 17% to $895.4 million from $765.6 million last year because of improved pricing in our Lift Truck and Bolzoni businesses and higher unit and parts volumes in the Americas and EMEA. Looking at the individual segment results, our Lift Truck business generated an operating loss of $11.7 million in the 2022 second quarter compared with operating profit of $15.4 million in the prior year, primarily due to a decrease in gross profit in all 3 geographic segments, but most significantly in EMEA as well as higher operating expenses in the Americas. Bolzoni's second quarter revenues increased modestly and operating profit improved to $3.4 million from an operating loss of $400,000 last year. As a result of the market decline as well as our focus on accepting only orders with expected sound margins, booking in the second quarter of 2022 decreased substantially from the robust levels of the 2022 first quarter and 2021 second quarter. However, the average booking sales price per unit increased 23.8% in the 2022 second quarter over the first quarter and 43.6% over the prior year quarter because of price increases, a shift in sales mix and our focus on accepting only orders with expected sound margins. Despite the ongoing part shortage and supply chain disruptions which continue to constrain production of our Lift Trucks in the second quarter, we experienced higher shipment levels than in the prior year second quarter and 2022 first quarter because an increase in production rate over prior period levels was facilitated by a moderately reduced impact of component shortages. Nevertheless, with higher shipments and lower bookings than in 2022 first quarter, our high backlog levels with its delivery lead times that remain well above historic norms began to decrease in the second quarter of 2022 for the first time since the beginning of the pandemic. As a result, we have reduced our planned production schedule for the second half of 2022 and in 2023 from what we expected at the time of last quarter's earnings release. Due to the lag between when -- when unit price increase go into effect and when revenue is realized as the units are shipped as we work through our low margin backlog in the second half of 2022 and in early 2023, we expect margins to improve, specifically in the 2022 fourth quarter when the higher-margin already booked trucks are expected to be produced and shipped. However, given our robust backlog and actions put in place to mitigate the impact of supply chain constraints and shortages, we still expect full year 2022 shipments to increase over 2021 despite the normal third quarter plant shutdowns. As a result of these factors, along with our core strategies, increased shipment volume potential of our current backlog and expected bookings during the remainder of 2022 and enhanced prices and the renewal of tariff exclusions, we expect the Lift Truck business to move from a significant operating loss in the first half of 2022 to an operating profit in the fourth quarter. Because of manufacturing and inefficiencies expected in the third quarter due to our normal seasonal plant shutdowns and reductions in production volumes resulting from the continued supply chain constraints as well as unfavorable currency effects, we expect a significant operating loss at the Lift Truck business in the third quarter that is higher than the operating loss in the prior year third quarter. The anticipated operating loss in the second half of 2022 at the Lift Truck business is expected to be significantly lower than the operating loss in the first half, mainly driven by strong operating profits in the fourth quarter of 2022 in the Americas segment. As a result of lower sales and inefficiencies expected from the normal third quarter seasonal plant shutdowns, reduced demand for legacy components for the Lift Truck business and additional material inflation caused by the Russia-Ukraine conflict, we expect Bolzoni to achieve near breakeven results in the third quarter of 2022 with a return to profitability in the fourth quarter as component shortages moderate, efficiencies return and benefits are realized from pricing actions. Generally, results in the second half of the year are expected to be lower than anticipated when the 2022 first quarter earnings release was issued mainly due to the adjustments we made to our production schedule because of continued supply chain constraints. During 2021 and the first half of 2022, our ability to build and ship trucks was significantly constrained by part shortages of certain critical components, while the remaining components needed build trucks were received and added to inventory, causing inventory levels to increase substantially."
}