{
    "symbol": "BJ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 18:03:02",
    "content": " Membership fee income grew by 8% year-over-year, topping $100 million for the first time in any quarter, and we hit our all-time high renewal rate of 90% for the year. Our efforts in improving membership acquisition, loyalty and retention, coupled with our new club growth, have resulted in MFI growing at 9% rate since fiscal 2018 and 10% last year alone. We know that if a member enrolls in the $110 membership or gets a BJ's branded credit card, we will not see just improved renewal rates, but increased spend per year. First, and hopefully, this one you've all seen, we have worked over the past couple of years to blast members with their individual savings, whether it's in the app in personalized videos that we send out multiple times a year and post cards that come around the time of renewal. To put a finer point on the results, our recent new club openings have almost 16% higher tier membership penetration, 60% greater first year sales and 12 points greater first year renewal rates than the clubs we opened prior to the reinvention of our new club playbook. So in the past where we always do the math of sales of the new club less the transfer would be the sales available to support the new club returns, now we can use our data to evaluate the lifetime value gains from existing members, factoring new sales, we are exporting to other clubs in the chain as we enroll new members into the BJ's franchise to evaluate a more holistic view of the payback and the lifetime value we can create. We've seen such tremendous share growth over the past few years on fuel, and we expect that to only accelerate with all the great new benefits of our higher-tier memberships that Tim shared earlier. That being said, we expect MFI to grow 5% to 6% this year as we will benefit from strong renewal rates and membership acquisition from our 9 to 10 new club openings in addition to the two we just opened in February. The building blocks to deliver mid-single-digit total revenue growth are comp sales, new club growth, a gas business that is stable and steadily grows over time and continued strength in our membership base. One, as we thought about our comp sales build for the year, the thing we're most excited about are our membership stack that we've seen and continue to see and the traffic that's showing up in our clubs. So one of the things that we've kind of invested in is like is as we expand into new markets, it's really important that we export our culture in terms of how we open up clubs the right way, how we take in a new market, what will be many team members who don't really know us or haven't known us before."
}