{
    "symbol": "AMP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 15:00:33",
    "content": " We continue to remain in strong client inflows and wealth management and the rise in interest rates, the growth of the bank and the stability of the retirement protection businesses helped to more than offset the effect of depreciating markets and foreign exchange that impacted our asset management business. Total assets under management administration were $1.1 trillion, which is down 9% from a year ago, assets were impacted by the steep decline in both equity and fixed income markets and the strength of the dollar, which affected the foreign exchange rate and our European business. Importantly, I feel like the strength of our businesses and the growth of the bank will allow us to navigate these markets very well and generate a consistent level of free cash flow and good returns for our shareholders. Let's turn to individual segment performance beginning with wealth management on slide 7, wealth management client assets declined 12% to $711 billion as a result of significant market depreciation over the past year, partially offset by our strong organic growth. Second, the bank provides flexibility to optimize the benefits from higher rates by investing in high quality, longer duration securities, creating sustainability of interest earnings, our bank reached nearly $19 billion in the quarter, up from $10 billion a year ago. Total assets under management declined 6% to $546 billion primarily from equity and fixed income market depreciation and unexpected significant negative pound and Euro foreign exchange impact, as I mentioned, the BMO acquisition broaden our geographic diversification with about 35% of the assets in EMEA. And we do see certainly potential to grow, but we will then look for, as I indicated the ability to redeploy in our multiple strategies to ensure the stability of our earnings that we have both garnering the higher yield with the certainly the high the low risk profile that we do and to ensure that so I would say that, you'll see the percentage going over the bank increasing as we've progressed as we feel comfortable, it's all situational driven. And that's why I said, when I said my top points, $3 billion is probably at least $3 billion because we do see in this case, but we reevaluate that there's substantial opportunity to use the bank, not just for the investments we're talking about to grow the capabilities that we have to meet our clients' needs also with deposit projects and hybrid products that they're developing at this stage. Well, it's interesting, because listen, I think, as you look at the amount of free cash flow, we generate in the amount of excess capital we have, and our ability to does not inhibited in any manner, shape or form our ability to continue to grow and invest in a bank to garner the benefits of both and we constantly are making that evaluation accessing our access as it is the situation and the generation that we have. I would say this, what I was saying is there is an increase in crediting rates and they will be as rates continue to be persistent or go up, we will make adjustments again, based on size of accounting, whether it's really a transactional or not in keeping the cash, but as Water said, some of that could be will be offset based on some of the rollover and assets we have in the bank and how to invest as well as what we transfer."
}