{
    "symbol": "NOTE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-28 16:44:06",
    "content": " On today's call, I will review our fourth quarter and full year results for 2022 and offer some perspective on the fundamentals of our business as we build an enduring growth company with compounding subscription revenue growth, strong gross margin and over time, an impressive free cash flow model. For 2022, we grew our GAAP revenue 37% year-on-year to about $114 million, further evidence of our ability to deliver compounding growth even in a difficult macro environment. Our annual recurring revenue which represents 90% of total revenue with $113 million, marking growth of 14% year-over-year and 13% on an organic basis and we increased our net revenue retention to over 100% on a trailing 12-month basis, a strong reflection of our successful cross-sell and upsell model and the must-have mission-critical solutions we deliver for our customers. Further, we also provided guidance for 2023 that indicates another strong year of growth and momentum for FiscalNote with GAAP revenue of $136 million to $141 million, marking growth of 20% to 24% year-over-year. Fourth quarter revenue was $31.4 million, marking growth of 29% year-over-year in total and 18% growth on an organic basis. Full year 2022 revenue was $113.8 million, marking 37% growth year-over-year in total and 15% growth on an organic basis, which excludes the 2021 and 2022 acquisitions and Sunset revenue. Fourth quarter subscription revenue, which makes up almost 90% of our total revenue was $27.3 million, an increase of $6.4 million or about 31% from a year ago and 15% growth on an organic basis. Full year 2022 subscription revenue was over $100 million, an increase of approximately 36% year-over-year in total and 13% growth on an organic basis, which again excludes the 2021 and 2022 acquisitions and Sunset revenue. Our advisory advertising and other revenue was $4.1 million in the fourth quarter and $13.2 million for the year, a growth of 49% year-over-year. We exited 2022 with run rate revenue of $127 million in total, marking 14% year-over-year growth. On an organic basis, run rate revenue was $125 million, also reflecting a 14% growth on a pro forma basis. We expect GAAP revenue of $136 million to $141 million, marking growth of 20% to 24% year-over-year, including the acquisition of Dragonfly -- on an organic basis, in 2023, we expect to deliver another year of mid-teens organic growth. We expect adjusted gross margins to be approximately 80% and adjusted EBITDA loss between $8 million and $6 million for the full year, achieving adjusted EBITDA profitability in Q4. While this level of adjusted EBITDA loss may seem high in light of our full year guidance, Q1 includes $1.5 million of seasonal public company costs, including our first year audit after listing and seasonally low revenue recognition from our nonrecurring revenue. I think about 2023 guidance; I think you mentioned additional at the midpoint, an additional $25 million revenues, 80% margin, so $20 million incremental gross margin and then an incremental 3% to 4% in OpEx kind of on top of your current, I guess, cost basis plus some savings that you had talked about."
}