{
    "symbol": "RPM",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-05 15:23:10",
    "content": " The one outlier segment that did not achieve record second quarter adjusted EBIT was the Construction Products Group, which was most acutely impacted by macroeconomic headwinds, because of its relatively outsized exposure to Europe and to new residential home construction in North America. The result was a 9.3% increase in reported sales to a second quarter record of $1.79 billion, compared to $1.64 billion in the prior year period. Our consolidated adjusted EBIT increased 36.4% to a second quarter record of $214.7 million, compared to $157.3 million reported in the prior year period. Adjusted diluted earnings per share were a second quarter record at $1.10, representing an increase of 39.2%, compared to the $0.79 in the prior year period. Our Construction Products Group generated second quarter record net sales of $634.1 million, an increase of 3.2% compared to the prior year period. These headwinds, along with the negative impact from FX, unfavorable mix and reduced fixed cost leverage at plants, including the Corsicana, Texas facility that was acquired in fiscal 2022 2nd quarter, resulted in adjusted EBIT declining 12% to $80.4 million. As you can see on the next slide, the Performance Coatings Group achieved record fiscal second quarter net sales with revenue of $335.2 million, an increase of 10.8% compared to the second quarter of fiscal 2022. The Specialty Products Group reported record second quarter sales of $212.1 million, an increase of 9.5% compared to the prior year period. SPG generated record second quarter adjusted EBIT of $30 million or an increase of 43.2%, compared to adjusted EBIT of $20.9 million in the prior year period. The Consumer Group grew sales 15.3% to $610.4 million, which is a record for the second quarter. Adjusted EBIT increased 180.3% in the fiscal 2023 second quarter to $94.2 million, which was a second quarter record. The bull up  effect as some customers temporarily moderating purchases to normalize inventory levels as material availability has improved, a strong U.S. dollar compared to the third quarter of fiscal 2022, and lastly, continued year-over-year cost inflation. Consumer sales are expected to increase in the mid single-digit range compared to prior year record results, led by pricing increases in response to year-over-year inflation Additionally, now that our material availability has increased, we have begun implementing new marketing and advertising initiatives, which we expect to benefit growth in the coming quarters. Taking all this into account, we anticipate that third quarter fiscal 2023 adjusted EBIT will be in the range of $75 million to $85 million, compared to the prior year record amount of $80.6 million. Thanks so much, Frank. Thanks so much, Frank."
}