{
    "symbol": "SCS",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-17 13:57:09",
    "content": " Our third quarter results saw very strong order growth, but we continue to be impacted by a significant number of supply chain challenges and inflationary costs in our Americas segment, which impacted our results. 31% growth in EMEA with order levels nearing fiscal year 2020 levels and exceptional growth of over 125% in our Asia Pacific region, with the region's orders exceeding third quarter fiscal 2020 levels by over 40%. Our EMEA segment achieved over $8 million of operating income and nearly a 5% operating margin in the third quarter, which exceeded its highest level of quarter in fiscal 2020, and its confirmation that our strategies to improve profitability in that segment are working. For revenue, the supply chain disruptions in the Americas caused extended lead times, delayed shipments and adjustments to delivery schedules, which we estimate caused at least $35 million of shipments to ship from the third quarter into the fourth quarter. Moving to the outlook for the fourth quarter, we expect to report revenue within a range of $740 million to $765 million, which is approximately 0% to 4% higher than the revenue we've reported in the third quarter, and on an organic basis approximates 9% to 13% growth compared to the prior year, which you'll remember benefited from the temporary global operations shutdown which pushed approximately 60 million of shipments into the fourth quarter. Continued supply chain challenges and related disruption costs similar to our higher -- similar to or higher than the level experienced in the third quarter, unfavorable shifts in business mix compared to the third quarter, lower production and absorption of our fixed cost due to the significant level of finished goods inventory at the end of Q3, the continued effects of supply chain disruptions and some seasonality in Q4. Looking forward to fiscal 2023, while it's difficult to predict the extent to which commodity price increases will moderate and when supply chain challenges could ease, the prospects for next year could include the potential for improved demand driven by a broader return to office and significant gross margin improvements from our pricing actions and some level of improvement in supply chain disruptions. I think customers generally continually -- they consistently say that they believe their people are better when they're together and they're still thinking about and working on hybrid work plans, whether that's different variations of hybrid. There are lots of reasons that customers are reassessing privacy in their offices, whether it's for safety reasons and keeping people maybe more separated from others at times than they would have been previously, but also to support things like video conferencing and hybrid where we know there are different needs for acoustical privacy and other types of privacy. I really do think -- I'm going to give you maybe a broader answer than you're looking for, but I really do believe that we are well positioned to support hybrid work and to be partnered with our customers as they navigate this tremendous change in how their organizations work from a traditional 5-day a week in the office model to something that's different."
}