{
    "symbol": "SCS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-24 14:21:06",
    "content": " Your line is open. New York is actually showing a pretty good pace of return, and you have probably seen some of that data markets, it’s notoriously the slowest right now in San Francisco, the tech sector, a lot of those companies made choices really many months ago is not to bring people back until like well into the latter half of this year, even into next year. Your line is open. Your line is open. Your line is open. So, as Sara mentioned, when people come back to their offices, meetings aren’t going to be the way they were before, because it’s likely that whereas in the past a meeting of 6, 7, 8 people or everybody would be in the room, now you find more and more than one or two people might be working from home that day. And then the finally, ancillary spaces, spaces that use furniture that’s more informal, people are continuing to be interested in those kinds of products, but they are really interested in how those products can support real work, the real work of people meeting with each other solving problems together, brainstorming together and making decisions together. But as we – as our confidence continues to grow about the recovery, I think you’re going to see our spending increase to the level that we’re projecting in Q2 before the land gain and then likely be at or around that same level, plus or minus, let’s say, single-digit millions into the back half of the year. Your line is open. So I think the big difference is in – as people are thinking about offices is, first of all, over the last several years, leading up to pandemic, there was a segment of customers who are always trying to find a way to make their offices the most efficient from a real estate perspective, which means higher and higher levels of density from smaller offices, more open benches. I think collaboration is going to be in the forefront of what a lot of people are talking about because what we’ve learned is that there is certain kind of work that you can do from home, a day a week, a couple of days a week. In fact, you could say, if anything, to work from home surge, which will continue going forward and still be interested in working from home, causes people to value high-performance seating to a greater degree because there is no chair you sit in as much as the chair you sit in at home, if you’re working from home all day long. When our customers are going to change, when they are realizing that it’s time for them to step up and make investments because the nature of work has changed, expectations for the workplace have changed, challenges in attracting and retaining workers which you know probably from the articles you’ve seen that there is a lot of talk about employees looking to change employers."
}