{
    "symbol": "GTEC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 13:43:02",
    "content": " Thank you for standing by, and we warmly welcome you all to the Greenland Technologies Third Quarter 2022 Earnings Conference Call. As a reminder, we are recording today's call. Joining us today are Mr. Raymond Wang, Chief Executive Officer; and Mr. Jing Jin, Chief Financial Officer. The press release is available on the company's Investor Relations website, as well as on Newswire Services. Before we continue, please note that today's discussion will contain forward-looking statements. As such, the company's actual result may be materially different from the expectations expressed today. Also please note that unless otherwise state, all figures mentioned during this conference call are in U.S. dollars. Before I recap the third quarter, I want to thank my team for delivering solid results, despite a continually challenging global environment. To summarize the third quarter, our component business is operating better than it has before and is only held back by lingering pandemic regulations, while our electric HEVI Equipment division is continuing to strengthen its infrastructure, brand, and value proposition, and we are at the tipping point for adoption that will result in significant growth for the company, and our shareholders. Now, diving first into our core components business. We produced and delivered 31,303 drivetrain units, resulting in revenue of $21.8 million. We focused on fulfilling our backlog for clients impacted by pandemic shutdowns in the second quarter, but are now open and actively producing vehicles. Unfortunately, as these territories opened, new territories have been shut down, due to China's zero COVID policy including districts surrounding the Port of Ningbo that have delayed product demand and impacted deliveries to the global market. As a result, we were not able to deliver drivetrains to our full ability, especially outside of China, and has continued to add to our backlog of product sales. I continue to stand by my statement last quarter that these restrictions are a short-term challenge and will not last forever, but caution that they will impact our component business, while they exist, and though we're not able to control what regions get locked down, I want to emphasize that we have been operating strongly in the areas that we can control. Production has never been stronger at Greenland and we are staying ahead of supply chain challenges such as raw material procurement, which has led to increased operation efficiency and higher margins for the business. Shifting to our HEVI electric industrial, HEVI equipment division, we have officially opened our first U.S.-based assembly site outside of Baltimore, Maryland. We expect to roll-out the first unit off the line at this facility in the first quarter of next year and will produce 500 units per year, while creating four to five dozen green jobs in the local community once the site fully ramps up. This site not only strengthens our production capability, but also serves as the first step for heavy to obtain the assembled in the USA label for our product line. As the first company to introduce electric industrial HEVI Equipment, it is our responsibility to educate our audience on the technology and address any concerns to secure market share and ultimately establish the market as a whole. We continue to receive strong interest in our product line, and when we secure our first adopter by a recognizable brand, I'm confident that will lead to a rapid conversion of interest to sales. HEVI, continues to improve the value proposition of our electric product line for prospective customers. This offers security, safety, and easier incorporation of HEVI products into a client's fleet management system. In addition, HEVI is undergoing a campaign to ensure that our products are compatible with every major EV provider in the United States. This testing ensures that HEVI products are compatible with Siemens over 100,000 EV charging station network across the United States. The updates shared thus far are evidence of these funds in use to grow the business and we will continue to invest into inventory, supply chain, marketing, and talent to drive this business line and capture the significant opportunities present. With the forklift market growing at an 8% to 9% compound annual growth rate, and our proven production capabilities, Greenland is well-situated to continue growing its core business and retain our position as market leader in our industry. Furthermore, our electric HEVI equipment division is developing as planned and will generate substantial growth for the Greenland business when we establish the market and pioneer electrification in the HEVI Equipment industry. And with that, let me turn the call over to our CFO, Jing Jin, to provide greater details into our financial performance. Thank you, Raymond, and thank you everyone for joining our call today. We achieved this, despite the long list of headwinds impacting the broader industry, including shutdowns in China, global inflation, supply chain challenge, and higher material cost. In terms of Q3 2022, revenue was US$21.8 million. Excluding foreign exchange impact, revenue in Chinese RMB actually increased by about 2% from the third quarter of 2021. The number of transmission products rose 1% to 31,303 units during the period. We generated gross profit of 4.8 million, compared with 5.1 million in the third quarter of 2021, while maintaining gross margin at 22.1% with our shift in product mix towards higher value and more sophisticated products. The total operating expense decreased 10% to 2.7 million, reflecting our improved operating efficiency by streamlining and simplifying our product lines. We generated 2.1 million in income from operations, up 1% from the prior year. Net income surged 67% to 2.1 million, driven by the combination of improved operating efficiency, increase in grant income, and the lower effective tax rate. Meanwhile, we will continue to manage operating expenses closely as we shift our focus towards ramping up  , capacity and the development capacities. We remain excited above the high level adjustable market in front of the Greenland and look forward to capturing market share, delivering improved results  and to the shareholders. And I'm thinking here of, like trade shows, your experience center, whether you've got a staff people doing outreach about the product. The orders that we received are not orders to be canceled in any way, shape or form, they're just held off and delayed because we provided our clients with flexible terms to account for the volatility of the zero COVID policy right now. Just like what we saw from Q2 to Q3, some of our larger clients that were shut down in Q2, we added to our backlog for Q3, they opened up and then we're able to deliver. With that said, it's very difficult right now to predict the anticipation for what regions are going to be opened and what regions are going to be closed in their timelines. For the HEVI business itself, education is key and critical, and we are focusing our efforts primarily on the Mid-Atlantic region for outreach. For example, next week, HEVI will be exhibiting at the New Jersey municipalities, MUA Expo, which is the largest expo if you're looking to do any sales to the government sector. In addition to that, we've actually increased our sales force already doubled doing outreach to our target markets, and we've expanded our marketing team by about 50% to further establish our brand presence in this sector. I mean, despite the slowdowns and the COVID shutdowns, temporary ones, and inflationary pressures, and some streamlining, you're still posting pretty positive year-over-year units and foreign currency denominated revenues. As we mentioned before, I think in our Chinese sites, especially produce the transmission products. As you mentioned, like, despite of the  ,   facing a little bit of challenge especially in recent Chinese zero COVID policy that is maintained and restricted, our sales to the customer. But in general, I think  have a really good production lines, stream lines, especially for the fuel engine size to the electronic engine driven. So, we are pretty confident in our cost production and also to deliver the relatively competitive products to the customer. But still, as I mentioned, we might face little bit headwinds, especially for the coming quarter. But I'd say within the last four years, we've been going through an effort to standardize our products, which makes â\u0080\u0093 which drives efficiency in our assembly lines. In 2019, for example, we were running over 50 different series of drivetrain components, each with, you know, between   different models amongst them, but now we've actually trimmed that down to about 36, about three dozen different series and a smaller number of models. So, there's less variability in our cost purchasing and faster assembly processes overall because it streamlines them. And just like JJ said, we've also been â\u0080\u0093 that efforts have been also leading towards some of our developments and components for integrated drivetrain, specifically catered towards electric, material handling vehicles and applications. For example, let's say for the national rental industry, most likely the fleet deal itself would manifest as a pilot for adoption in select areas for the rental program for distribution out and ultimate testing. Whereas for the construction industry, we're primarily focused upon large deals in the urban environment for incorporation of our products into the overall bid process as a perfect casing or scenario of the application of our vehicles to not just support the overall businesses return on investments and operations, but also their ability to a secure and win bids and contracts as part of their overall business. Seeing no more questions in the queue, let me turn the call back to Mr. Wang for closing remarks. And again, thank you everyone for joining today's call and listening to today's broadcast. This is a very challenging market for sure, but Greenland has been continuing to execute and produce results for our shareholders and for our loyal investors as well. And I just want to reiterate my personal stance that I still honestly believe Greenland offers a unique position on the street that doesn't exist in many companies today, and we are doing everything in our power to be able to reward our loyal shareholders. The rest of the year is looking to be very strong, pending the challenges that we've already addressed earlier on this call, and we are excited for what the future holds for the Greenland business and growth potential into the future. So, with that, I do want to thank everyone for both supporting the business, staying tuned in, and for all of our hardworking team members working day-in, day-out to make it happen and produce these results."
}