{
    "symbol": "PIPR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 22:53:03",
    "content": " During the second quarter of 2022, we generated adjusted net revenues of $346 million, a 17.5% operating margin and adjusted diluted EPS of $2.47. During the first half of 2022, we recorded adjusted net revenues of $707 million, a 19.2% operating margin and adjusted diluted EPS of $5.59. Advisory revenues of $170 million during the second quarter of 2022, declined 20% sequentially and 32% from the exceptional year ago quarter. Performance during the quarter was led by our Financial Services group, which advised on three of the five largest U.S. bank M&A transactions that closed during the quarter, and we remain the number one adviser to U.S. banks based on the number of announced M&A deals during both the second quarter and the first half of 2022. More broadly, Piper Sandler was the number two adviser for U.S. M&A deals under $1 billion based on the number of announced transactions during both the second quarter and the first half of this year. We generated $35 million of municipal financing revenues, up 29% from the first quarter, reflecting strong absolute and relative performance as weâ\u0080\u0099ve gained market share on a year-to-date basis. For the second quarter of 2022, we generated fixed income revenues of $54 million, down modestly compared to the solid first quarter of this year. We generated net revenues of $346 million for the second quarter of 2022, driven by solid performances across most of our businesses. Net revenues for the first half of 2022 totaled $707 million, down from the first half of last year, which benefited from record corporate financing activity. Turning to operating expenses and margin, our compensation ratio was 62.7% for the second quarter of 2022, 20 basis points higher compared to the sequential quarter, resulting from lower revenues and a continued focus on investing in the platform. Non-compensation expenses, excluding reimbursed deal expenses for the second quarter of 2022, were $60 million, an increase of 9% compared to the first quarter of 2022 and 23% compared to the second quarter of last year. Our adjusted tax rate was 25.2% for the second quarter of 2022 and 24.1% for the first half of the year, which included a $5 million tax benefit related to restricted stock vesting at prices higher than the grant date price. Hey, good morning, everyone. Hey, good morning, everyone. And if I look at last year, the amount of new money raised that issuance, if that stayed flat right now, and last year was a very strong year, and the refinancing stayed similar to levels to where it is right now, you are going to see a pretty â\u0080\u0093 probably a $420 billion overall issuance, which is about double the first half."
}