{
    "symbol": "PIPR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 15:52:02",
    "content": " During the third quarter of 2022, we generated adjusted net revenues of $335 million, a 17.3% operating margin and adjusted diluted EPS of $2.32. We generated $40 million of financing revenues during the third quarter of 2022, an increase of 37% compared to the prior quarter and down 49% from the third quarter of last year. Our equity brokerage business generated record quarterly revenues of $53 million, benefiting from the elevated volumes and the addition of Cornerstone Macro to our platform. For the third quarter of 2022, we generated fixed income revenues of $37 million, down 31% from a strong second quarter this year as market dynamics have significantly muted client activity. We generated net revenues of $335 million for the third quarter of 2022, driven by solid performances across corporate investment banking and equity brokerage. Net revenues for the third quarter of 2022 decreased 24% from the prior year quarter due to lower corporate investment banking revenues as well as lower fixed income and municipal financing activity, offset in part by higher equity brokerage revenues. Our adjusted tax rate was 27.4% for the third quarter of 2022 and 25.1% for the first nine months of the year, which included a $5 million tax benefit related to restricted stock vesting at prices higher than the grant date price. What I would say about the advisory business, it's not like other, you can just look at our results relative -- obviously, relative to last year, our advisory results are down, but look back four, five, six years, I mean, it's still good revenue levels as we built the capacity and we've built this MD count to 159 MDs. But the one other segment of the business that we don't think is sort of a long term run rate is we're -- our ECM business, even though it's at least open with a trickle now and certainly better than the first couple of quarters, it's still way below historical means."
}