{
    "symbol": "ADCT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 12:21:03",
    "content": " This morning, we issued a press release announcing our first quarter 2022 financial results and the business update. On today's call, Chris Martin, Former Chief Executive Officer; Jennifer Herron, Chief Commercial Officer; Joe Camardo, Chief Medical Officer; and Jenn Creel, Chief Financial Officer, will discuss recent business highlights and review our first quarter 2022 financial results before opening the call for questions. For additional information concerning forward-looking statements and factors that could cause actual results to differ materially from those expressed or implied in these statements, we refer you to the section titled Cautionary Statement regarding forward-looking statements and Exhibit 99.3 of our report on Form 6-K filed with the US Securities and Exchange Commission earlier today. Since co-founding ADC Therapeutics in 2011, I've had the privilege of taking our proprietary ADC technology from discovery, to the bench, to the clinic, then to our first FDA approval of ZYNLONTA. We now have over 300 employees, a commercial product on the market in ZYNLONTA, Cami progressing to a BLA submission and five promising solid tumor programs in development. I've had the pleasure of meeting the board and many members of the executive team, and I'm impressed by the company's unwavering commitment to developing novel cancer treatments for patients. In addition, I'm pleased to join a commercial stage company with a differentiated product in ZYNLONTA and its potential to move into earlier lines of therapy. Starting with the ZYNLONTA launch, we delivered $16.5 million in net sales in Q1. Sales in the first quarter were unfavorably impacted by our customers’ modest inventory build at the end of 2021, and there were fewer new patient starts in DLBCL in Q1, which was exacerbated by the Omicron surge. With face to face opportunities trending upwards through Q1, we are confident in our ability to continue to grow ZYNLONTA as we strive to establish ZYNLONTA as a third line standard-of-care for DLBCL. Jennifer Herron, our Chief Commercial Officer, will share more details on the Q1 launch dynamics a bit later in this call. We have our LOTIS-5 clinical trial, which is the ongoing confirmatory Phase 3 study in second line patients who are not eligible for stem cell transplant. In addition, we also plan to initiate LOTIS-9, our first line study in unfit or frail patients later this year. We remain excited about our promising pipeline of solid tumor programs, including three clinical programs, these are; Cami targeting CD25, ADCT-901 targeting KAAG1 and ADCT-601 targeting AXL. Finally, we ended the quarter with a strong cash position of $431 million, which gives us a substantial cash runway to continue investing in the ZYNLONTA launch, lifecycle and our pipeline. Looking to expand our access to patients globally, we are pleased that the Overland ADCT BioPharm joint venture continues to make good progress with the continued enrollment of the pivotal trial. As we mentioned on the Q4 earnings call, we did see a modest customer inventory build at the end of the year, which we believe we have worked through during the first quarter. In addition, there was a decrease in DLBCL new patient starts in Q1 2022 versus the prior quarter. The Omicron surge during the first half of Q1 also impacted face to face interactions, especially with comprehensive cancer centers, academic institutions and integrated healthcare systems. Regarding ZYNLONTA Q1 launch dynamics, we have made significant progress in terms of increasing product awareness, familiarity, trial and adoption. Since launch over 75% of accounts that have ordered ZYNLONTA have reordered, reflecting a positive physician and patient experience. We grew our ordering account base 40% versus 2021 with two thirds of Q1 new accounts coming from the community, and we expect continued new community account acquisition with the full execution of our permanent J-code. With higher volumes of third line plus patients in academic centers, we continue to see about 60% of ZYNLONTA volume through academic accounts. As you will recall in our pivotal Phase 2 trial, nearly half of all patients receiving ZYNLONTA reached a PR or better. Importantly, 25% of patients treated with ZYNLONTA achieved a CR with a median time to CR of six weeks. We have received positive feedback from community practices and importantly, major community oncology networks, representing opportunities for ZYNLONTA growth in the coming quarters. We remain confident in the continued successful launch of ZYNLONTA, as well as its long-term value as the standard of care in third line plus and the cornerstone for DLBCL treatment overall. We look forward to keeping you updated on our progress. This combination offers the opportunity for patients to be treated with a regimen that will be effective, well tolerated and straightforward to administer. Later this year, we will initiate LOTIS-9, a study to evaluate ZYNLONTA in combination with rituximab in first line DLBCL patients who are unfit or frail. For these patients, there have been no specific advances that take advantage of the new drugs, partly because these patients are routinely excluded from clinical trials. We have engaged with physicians and oncology networks who see unfit and frail patients on a regular basis, and there's keen interest to find a new regimen that will be an improvement and an innovation for this population. Based on strong preclinical data and our interest to develop combinations for ZYNLONTA with new drugs, this study will allow multiple combination arms. Overall, we remain very excited about the opportunity to expand the use of ZYNLONTA in first and second lines for DLBCL patients. First, we have our ongoing Cami Phase 1b safety and efficacy dose escalation trial in combination with pembrolizumab in patients with advanced solid tumors. The study was designed to allow for expansion and enrollment of the small number of patients at any dose of which activity was observed, so that's what we did. In addition to our clinical programs, we have two advanced preclinical solid tumor programs, ADCT-701 targeting DLK 1, which we're developing for neuroendocrine malignancies in collaboration with the National Cancer Institute. As you can see, we continue to make great progress with our development and preclinical programs, and we have a robust and active pipeline. As we reported in the press release issued earlier today, ZYNLONTA net sales were $16.5 million for the first quarter 2022. During the first quarter, we received the $30 million upfront from Mitsubishi Tanabe for a ZYNLONTA Japanese license agreement. R&D expense increased for the quarter ended March 31, 2022 as compared to the same quarter in 2021 as a result of our investments in ZYNLONTA trials in earlier lines of treatment and advancing our broad portfolio. G&A expenses increased for the first quarter 2022 as compared to the same quarter and 2021, primarily due to increases in professional fees associated with the Japanese license agreement. Adjusted net loss, a measure that excludes certain items as described in the press release issued earlier today, was $28 million for the first quarter compared to an adjusted net loss of $57 million in the same quarter 2021. In addition, net loss decreased for the first quarter of 2022 as a result of income arising from a cumulative catch up adjustment associated with the valuation of our deferred obligation with Healthcare Royalty partners, partially offset by higher interest expense associated with our Deerfield credit facility and deferred obligation, both of which are excluded from our adjusted net loss. To conclude, in the first quarter, we remain focused on executing on all areas of the business and we are well positioned to achieve our key objectives going forward. This includes driving the ZYNLONTA launch, working to develop ZYNLONTA in other lines of therapy, continuing to expand our geographic reach and advancing our pipeline of differentiated ecological and solid tumor programs. As we've mentioned, the launch environment and both and the third line plus DLBCL market dynamics have been uniquely challenging. But we're pleased with the progress we've made since launch of ZYNLONTA through Q1, which is less than a year on the market. Understanding that over time we'll be able to bring ZYNLONTA to patients in need in the community, as the patient distribution is a little different than in the academic institutions that see a fair number of concentrates, third line plus DLBCL patients. We do appreciate that on a per physician basis, the concentration of third line plus DLBCL patients is less than we see in the academic centers where we do have concentrated third line plus patients. In terms of your question with regard to prior CAR-T, we don't necessarily have patient level data so that we could understand their prior therapies or even their future therapies after they received ZYNLONTA. In the community what we're excited about is the opportunity to offer our differentiated product profile to patients in the community who perhaps are not CAR-T eligible or don't want to make the trip to a CAR-T center, because of our differentiated product profile, which has very robust single agent efficacy, very respectable response rates, including 25% CR with a very fast time to CR in just six weeks. And so for patients that want to stay in the community, we do think ZYNLONTA is the best agent for them in the third line plus setting. So with the J-code, we're excited about bringing ZYNLONTA into the community for patients who need it. We look forward to keeping you updated on our progress."
}