{
    "symbol": "BRP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 17:36:04",
    "content": " As we previously signaled, the launch and ensuing momentum and the distribution of our proprietary homeowners' products had a material positive impact on our second quarter organic growth rate in the MGA and we expect that to continue to be a meaningful contributor to organic growth during the balance of the year and into 2023. First, for the third quarter of 2022, given the strong performance across our business, we expect to generate organic growth in the high-teens. As Trevor mentioned, we are deploying the nearly $50 million investment we discussed on our Q1 earnings call, concentrated at our MGA of the Future and MainStreet businesses, primarily in key colleague additions and technology development, which as you saw in this quarter's results is already paying off. Additionally, we're seeing broad-based strength and performance across all of our segments, which is evidence that the investment program that we made last year and further $50 million of investments that we're making into the business this year are really paying off and driving results. The position of business is in and the reputation we have in the industry is being the premier home for the industry's premier businesses that drive outsized stakeholder value, bring unique incline industry sector and product line capabilities and have all the necessary attributes to continue delivering the double-digit organic growth that we expect of ourselves and our partners. And so there are still quite a few very high-quality businesses out there that we know well that we stay in regular communication with, but weâ\u0080\u0099ve definitely seen somewhat of a lull in the type of assets that we get really excited about from an M&A standpoint relative to underlying organic growth attributes, depth and breadth of specialization and unique capabilities in the way in which they go to market. And what I would tell you is, per the guidance that Brad provided earlier, despite all of the elevated level of investment we're making into the business to drive this growth, we still expect to improve margin for the overall business year-over-year. As you look at kind of the puts and takes there, while we expect home sales activity to come in slightly in the back half of the year, we expect that to be more than overcome by the improvement in capture rates that we're seeing in the business and the underlying rate and exposure expansion that we're getting on the overall book."
}