{
    "symbol": "BRP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 23:25:11",
    "content": " Q1 was a record quarter with broad-based performance across our business, highlighted by organic growth of 16%, the highest first quarter organic growth rate we have achieved since our IPO, supported by double-digit organic growth across all four segments and total revenue growth of 59%. The seasonality does shift year-over-year as a result of partnerships completed during the prior year, which was the primary driver of the margin decrease from Q1 2021 to Q1 2022, as well as an acceleration of certain planned investments into our technology teams and Main Street business in preparation for the transaction closing and integration of the Westwood business into BRP. Currently, we expect revenue for Q2 2022 to be approximately $220 million and for adjusted EBITDA margins for the second quarter to be 100 basis points to 150 basis points higher than the 17% in the second quarter of 2021. For the full year of 2022, on the back of significant investments made in the business last year and into 2022, and despite what we believe may be a recessionary economic environment later this year, we are increasing our expectations for organic growth for the full year to mid- to high-teens. Despite this large investment in new teams and solutions as seen in Q1, we still expect an additional 50 basis points to 100 basis point increase in the adjusted EBITDA margin for the full year above last year’s 20% consistent with the expectation we had on our last call in March. So the decrease you are seeing year-over-year was largely the result of the organic investments in talent technology that we have been speaking about over the prior quarters, as well as the acceleration I mentioned to Elyse in her previous question on margin, in order for us to get online and ready to serve the program administration agreement in conjunction with the closing of Westwood. In the current environment, you have also got a positive rate impact to that renewal trail that is an additional tailwind and while you may see new home starts could slow down as a result of increasing mortgage costs, that we would expect to have a de minimis impact on the overall growth trajectory of the business, as a result of how that flows in relative to renewal revenue and rate to drive ultimate growth. I mean broadly, what I would tell you is that, and the organic growth at the MGA is accelerating and when you look at year-over-year organic growth for the first quarter and the comps that we were going after it’s been really terrific performance, particularly with mastered kind of turning on for the first time in the first quarter of 2021."
}