{
    "symbol": "AGFS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 22:47:08",
    "content": " We posted third quarter operational revenue growth of 3.1% to $47.8 million on a constant currency basis, despite weather-related events in North America that impacted crop size and delayed the harvest season. From a geographical perspective, looking at our performance for the third quarter, our EMEA region generated 23.3% constant currency revenue growth, or an increase of $6.2 million versus the prior year period, which was the largest contributed growth for the quarter growth was led by the early timing of smartphone sales in Europe. Our other 1-MCP category, which represents our continued focus on leveraging our SmartFresh franchise, beyond apples, and into other crops and geographies, and includes key solutions such as our Harvista and Apple blog, grew 6.6% on a constant currency basis and contributed $1.3 million of growth. Our SmartFresh for Apple category increased 5.6% on a constant currency basis in the third quarter versus the prior year period, driven primarily by growth in EMEA and APAC, which was partially offset by the weather-related and timing of sales impacts in North America. For the nine months ended September 30th, 2022, net sales were $113.4 million, an increase of 3% versus the prior year period. Excluding this impact, revenue increased approximately 8.1% driven by leveraging a portfolio of diverse solutions On a constant currency basis, each of the company's diversification categories generated growth in a nine months ended September 30th, 2022, led by anti-microbials and coatings, market penetration and expansion in EMEA. SG&A expenses increased 10.2% to $13.5 million in the third quarter of 2022 as compared to $12.3 million in the prior year period, driven primarily by commercial investment initiatives. For the nine months ended September 30th, 2022, adjusted EBITDA decreased 0.7% to $35.3 million compared to the prior year period. Cash used by operations was $2.8 million for the nine months ended September 30th, 2022 versus cash flow provided by operations of $26 million in a comparable prior year period. Adjusting for the one-time benefit of $14.4 million of litigation proceeds in the prior year period, normalized operating cash flow from operations was approximately $11.6 million for the nine months ended September 30th, 2021, reflecting strong working capital performance."
}