{
    "symbol": "AGFS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 13:37:04",
    "content": " Our diversification strategy continues to drive results, as evidenced by a 21% increase in our diversification revenue in the first half of the year compared to the prior year period, with double-digit growth in each of our diversification product solution categories. In addition to being our engine to drive incremental growth, success and diversification also helps to build a natural hedge against many of the well-known risks in agriculture such as weather, which is visible in our second quarter results as we generated growth on a consolidated basis despite encountering weather headwinds in key markets such as Brazil, thus, diversification across products, platforms, crops, geographies and customers, minimizes the adverse impact that any one of those variables can have on our results. From a geographical perspective, looking at the combined first half performance for the entire season, our Europe, Middle East and Africa region generated 17.9% growth or an increase of $3.4 million versus the prior year period. Our other 1-MCP category, which represents our continued focus on leveraging our SmartFresh franchise beyond apple and into other crops and geographies and includes key solutions such as Harvista and Ethylbloc, grew 10.4% versus the first half of 2021 and contributed $1.6 million of growth. These gains versus the prior year period were partially offset by our SmartFresh for Apple category, which decreased 2.4% in the first half versus the prior year period, primarily due to foreign exchange impact and extreme weather in Brazil that reduced apple production there by 30% compared to 2021, according to the World Apple and Pear Association estimates. For the first half of 2022, Southern Hemisphere season net sales were $65.6 million, an increase of 7.8% versus the prior year period. SG&A expenses increased 5.2% to $14.3 million in the second quarter of 2022, as compared to $13.6 million in the prior year period, driven primarily by commercial investment and the reorganization activities. For the first half of 2022, adjusted EBITDA increased 15.2% to $17.4 million compared to prior year period. And historically, as you know, the history for AgroFresh being much more focused on the apple and pear crop, largely focused geographically in the U.S. in those major apple growing regions like Pacific Northwest, Michigan, and kind of Northeast, kind of New York, Pennsylvania, apple going region, and quite frankly, as we are now fully pushing and leveraging this diversification strategy as the engine growth, we're really excited about the opportunity not only to leverage our regulatory expertise with the leadership we have in 1-MCP in a very convenient sachet that provides much more flexibility to our customers, and quite frankly, really gives us the opportunity to build much greater presence and opportunity to drive growth in the important state of California. So I think your observation is the right one that the first year we had profit growth in dollars of about $1 million, and then we would expect the second half certainly will follow in a proportionally to the sales."
}