{
    "symbol": "SQNS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 11:55:22",
    "content": " All statements other than present and historical facts and conditions contained in this call, including any statements regarding future results of operations and financial positions, business strategy and plans, expectations for future product sale, potential for future strategic licensing deals or other strategic transactions, the impact of the COVID-19 on our supply chain and on customer demand, the impact of component shortages and manufacturing capacity, our ability to convert our pipeline to revenue, and our objectives for future operations, are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Consequently, we achieved non-IFRS operating profit of $1.6 million for the full-year 2022 compared with a non-IFRS operating loss of $13.2 million in 2021. The improvement in gross margin delivered a substantial improvement in our bottom line, improving our net loss by $2.8 million compared to the fourth quarter of 2021. Considering our Massive IoT design win pipeline, we estimate that when all the customer projects are launched, the annualized peak revenue of in-hand design wins will exceed $100 million. This gives us a high level of confidence that despite the level of product shipment we have to-date and the headwinds from excess inventory in the channel; we could attain the $100 million in 2025, just by supporting our current customers to move their projects into production. If in 2023 we can move 50% of advanced design-in projects to design wins, the design win portion of the three-year-life revenue pipeline, KPI would grow to over $500 million by year-end. Our top-line and margin improvements combined with only a 2.7% increase in operating expenses meant that we were able to reduce our IFRS operating loss to $3.8 million, down from $18.3 million in 2021, as well as reduce our IFRS net loss to $9 million from $20.3 million in 2021. On a non-IFRS basis, we achieved operating income of $1.6 million in 2022, compared to an operating loss of $13.2 million in 2021, and we achieved a net loss of $5.4 million in 2022, down from $19.5 million in 2021. IFRS operating expenses were $13 million in the quarter, up 11.7% from $11.6 million in Q3 2022. Year-over-year, IFRS operating expenses increased 8.8%, compared to $11.9 million in Q4 2021. Our net loss compares to the net loss in the fourth quarter of 2021 of $7.7 million or $0.21 per ADS, which included a non-cash loss on the revaluation of the embedded derivatives of $1.2 million. In Q3 2022, we had a net loss of $2.9 million or $0.06 per ADS, which included a non-cash loss on the revaluation of the embedded derivatives totaling $1.2 million as well as income tax expense of $1.6 million. On a non-IFRS basis, our net loss for Q4 was $2.8 million or $0.06 per diluted ADS compared to a non-IFRS net profit of $424,000 or $0.01 per ADS in the third quarter, and a net loss of $3.5 million or $0.09 per diluted ADS in the fourth quarter of 2021. We are targeting revenues of around $12 million, reflecting the impact of excess inventory in the channels, but primarily at one key customer, as well as the delay by our customers in the launch of design wins into mass production. If you take the $700 million by completely with design win and design-in 80% of this is pure Massive IoT, which means Monarch 2 mainly and Calliope 2. And the level of product revenue we have it today and this is really the reason is that the design win, even when we consider this design win, and even if we can go to $100 million there, they're not all in production."
}