{
    "symbol": "REUN",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-14 18:26:05",
    "content": " Based on these data, we are confident our study will likely produce a robust justification for selecting a recommended Phase 2 dose of RE104 to evaluate in our planned postpartum depression clinical trial, which is expected to commence later this year. Based on these interactions, I believe institutional healthcare investors and potential partners are actively following Reunion's progress and believe that we continue to demonstrate safety and efficacy that mirrors that of psilocybin with the addition of patented composition matter out through 2041 and a shorter psychedelic experience, which is roughly half the trip time reported by psilocybin in other studies. As a novel serotonergic psychedelic, single-dose RE104 could potentially provide mothers with fast relief and a quick return to mother-child bonding and breast feeding in an estimated 24 to 48 hours due to RE104's short duration psychoactive experience of less than four hours, durable efficacy and a rapid wash-out period. We also recognized CAD5.7 million and CAD15.3 million in charges for the three and nine months ended December 31, 2022 in recognition of our estimated loss allowance for financial guarantees of certain lease obligations associated with entities that were part of our spin-out of clinic operations and the company's equity share of loss and impairment of its investment in Field Trip Health & Wellness respectively. Clearly, one of our -- in addition to the overlapping safety and efficacy profile that we're seeing at psilocybin, are two key differentiating points for Reunion Neuroscience, continue to be our shorter psychedelic experience time, which we think is about half of what you're seeing in other reports from psilocybin. And that's one thing I actually really love about not only what we're -- our molecule, but the clinical development program that Bob and the team are moving forward with, is our ability to launch a Phase 2 program this year and return to investors a complete Phase 2 data set next year. Yeah, good morning, Antonia. Yeah, good morning, Antonia. Earlier this quarter, we announced interim data from our placebo-controlled Phase 1 study, which demonstrated safety, tolerability, a short duration psychedelic experience in line with our expectations for selection of a recommended Phase 2 dose."
}