{
    "symbol": "ISSC",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-14 18:25:24",
    "content": "  Operator: Greetings, and welcome to the Innovative Solutions and Support, Inc. First Quarter 2023 Earnings Conference Call. I would remind our listeners that certain matters discussed in the conference call today, including information about new products and operational and financial results for future periods are forward-looking statements that are subject to risks and uncertainties that could cause actual results to differ materially, either better or worse from those discussed, including other risks and uncertainties reflected in our company's 10-K, which is on file with the SEC and other public filings. I will begin today with remarks on our performance in the fiscal first quarter of 2023, followed by comments on the upcoming year and our long-term growth strategy. We began the year on solid footing with revenues of $6.5 million, driven by stronger OEM volume and engineering development contract. I'm pleased to announce that during the Q1 2023 period, we received our FAA supplemental type certificate or STC for the King Airs with the G1000 and NXI (ph) flight decks and deliver our first aircraft. As we have stated in the past quarters, our winning formula starts with excellent products in attractive growing markets. This effort is supported by more than 500 cockpit upgrades in 757, 767 and 737 platforms combined with a rapidly growing presence in general aviation. Gross profit in the first quarter was $3.7 million compared to $4 million in the prior year, mainly due to product mix. As a percentage of sales, gross margin was 57.1% compared to 59.3% in the prior year. Turning to product development and beginning with Autothrottle, we continue to invest in additional platforms that benefit from our trusted products, as well as increased functionality that help generate additional revenue. We expect this additional offering on our successful 757, 767 platforms to generate solid revenue for years to come. On the organic side, we continue to expect an expansion of our R&D program in fiscal 2023 to around 13% of sales from 10% in fiscal 2022. The first quarter, our R&D ramp below this level as we are in the process of ramping up our engineering resources. Beyond Autothrottle, we are expanding automation throughout our product portfolio, specifically to other areas that can drive customer value by enhancing safety and reducing operating costs. During the first quarter, we developed an active pipeline and while it is too early to share any details, we now have the ability to identify and execute on attractive product line type acquisitions that complement our existing portfolio. At full capacity, we believe our infrastructure can support a meaningful increase to our operating results and total free cash generation. To conclude, we're off to a good start for the year with a strong outlook as we deliver on our legacy products and new offerings. Thank you for your time and interest, and we look forward to updating you with further details in the upcoming quarters. Revenues declined slightly by 2.7% to $6.5 million in the first quarter versus $6.7 million in the first quarter of fiscal 2022. Decrease was largely due to lower commercial aftermarket revenue, which is partially offset by growth in our general aviation OEM business. New orders in the first quarter were approximately $3.3 million and backlog was $8.5 million as of December 31, 2022. Backlog is up from $6.2 million as of December 31, 2021. Cost of sales increased due to the combination of higher less profitable OEM business, lower product sales and slightly higher direct material costs, which adversely impacted our operating leverage. Total operating expenses were $2.9 million in the first quarter compared to $2.5 million in the prior year first quarter. The growth in operating expenses was offset in part by higher interest income generated from the combination at a larger amount of balance sheet cash, higher interest rates and the reallocation of funds into higher interest yielding investments compared to the same period in the prior year. Our expectation of targeting 13% of revenue for R&D in 2023 is unchanged, and we therefore, expect R&D expenses to gradually rise over the coming quarters. IS&S maintains ample flexibility driven by significant liquidity and a debt-free balance sheet, which enables us to be very well positioned to capitalize on organic and inorganic opportunities. We had $19.4 million of cash on hand as of December 31, 2022, up from $17.3 million at the end of fiscal 2022. Looking at remainder of fiscal 2023, we expect to continue to generate strong cash flows with the maintenance of current gross margin levels and cost control. I was surprised with the general and administration expense, $2.1 million, I believe it was in the quarter. Does that reflect the creation of your team to look for additional opportunities or different products that you may acquire in this -- will you continue to generate that $2.1 million every quarter? And yeah, the actual operating expenses were $2.9 million versus $2.5 million last year. Also some one-time legal fees in there, bringing the company in line with peers as far as corporate governance and other temporary -- more cost for temporary in nature. I would say the run rate will be -- and there are some temporary costs in there, some one-time costs, but they will be lower than what we ran in the first quarter. But I think generally, they will be up from historic run rates just based on our new long-term compensation incentive as well as bonuses as well as investing into the team for future growth. Well, our former founder did own 20% of our shares, and we did -- from time to time, issue special dividends that was effectively -- is long-term compensation plan. So to kind of replace that and offer our current executives and management team a long-term incentive plan, we don't own that percentage of shares, we needed to increase that G&A item. I realize interest rates are higher, and that's why that happened to at least some of it, but I'm surprised that it was this much up -- up as much all of a sudden. But we continue delivering on our 737, 757, 767 cockpits for cargo conversion as well as other airline operators as they're looking to upgrade their cockpits. And we're also putting together replacement for the IS&S system in which is the engine indication on crew alerting, we should augment those cockpits as well as opportunity to go to take a chunk of those 500 airplanes that are out there and offer them an additional upgrade. We get a few years up and then it kind of goes down and it varies between, I guess, $5 million to $7 million a year. Well, air freight rates jumped two years ago, but they're now down to normal levels."
}