{
    "symbol": "SPTN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 10:58:06",
    "content": " Compared to prior year, this past quarter we increased net sales by nearly 8% to $2.3 billion and we achieved adjusted EBITDA of $61.8 million, an impressive 13.7% increase. Jason will go into further detail, but I wanted to call out our adjusted EBITDA range of $227 million to $240 million, which now includes the costs associated with the new merchandising transformation initiative. To review, compared to fiscal 2021, by 2025 we expect to grow net sales by at least 12% to more than $10 billion and we expect to increase adjusted EBITDA by at least 40% to more than $300 million. Additionally, LIFO expense increased $14.9 million, representing a gross profit headwind of 65 basis points compared to the prior year quarter. As a percentage of sales, our reported operating expenses increased 40 basis points from prior year due to higher administrative costs, which included $3.9 million of costs related to shareholder activism and higher incentive compensation expense. Turning to our segments, net sales in food distribution increased $61.8 million or 5.9% to $1.1 billion on the second quarter, driven primarily by the favorable impact of inflation on pricing. Retail sales came in at $672.4 million for the quarter compared to $620 million in the second quarter of 2021, an increase of 8.5%. From a reported operating earnings perspective, the military segment was essentially flat compared to a $3.5 million loss in the prior year quarter. The segmentâ\u0080\u0099s adjusted operating earnings of $5.1 million is up $7.8 million from the 2021 second quarter loss of $2.7 million, which excludes a $3.5 million increase in LIFO expense. Overall, we achieved an impressive 13.7% increase in our second quarter adjusted EBITDA of $61.8 million compared to $54.4 million last year, and our reported net earnings was $5.1 million. Our new full-year net sales range is expected to be between $9.3 billion and $9.6 billion and, as Tony mentioned, our adjusted EBITDA is now expected to range from $227 million to $240 million, which is inclusive of a net incremental investment associated with some merchandising transformation initiatives currently estimated to be between $11 million and $14 million. The new guidance is $227 million to $240 million, so thatâ\u0080\u0099s a guidance raise but also importantly, if you stripped out that new spend on the merchandising transformation, at least the way I think about it is that the range ex that merchandising transformation is $238 million to $254 million, so the bottom end of our new range ex that merchandising transformation is round about the high end of the old range."
}