{
    "symbol": "YUM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 11:25:05",
    "content": " For the full year, system sales were up 8% and core operating profit was up 6%, which includes a 2-point headwind from the removal of Russia profits this year. KFC International delivered a record year, opening approximately 2,400 gross units and nearly 2,000 net new units, translating to 9% unit growth. We finished the year on a high note with system sales growth of 10% in Q4, driven by 6% same-store sales growth and 6% unit growth, contributing to 22% core operating profit growth, which includes a 2-point headwind from the removal of Russia profits this year. KFC full year 2022 system sales grew 9%, driven by 7% unit growth and 4% same-store sales growth. On a global basis, full year system sales grew 11%, driven by 8% same-store sales growth and 5% unit growth. At Taco Bell International, Q4 system sales grew 23%, driven by 29% unit growth and 4% same-store sales growth. It wasn't just our development engine on fire this year, many of our markets reached double-digit same-store sales growth in 2022, including some of our largest markets with India, up 33%; Thailand, up 36%; and Spain, up 20%. Next, at the Pizza Hut division, which accounts for 16% of our divisional operating profit, our full year system sales grew 3%, led by 4% unit growth and flat same-store sales growth. Pizza Hut International, which accounts for 9% of our divisional operating profit, achieved system sales growth of 4%, driven by 6% unit growth and a 1% decline in same-store sales in the fourth quarter. At Pizza Hut U.S., which accounts for 7% of our divisional operating profit, Q4 system sales grew 5%, driven by 4% same-store sales growth and flat unit growth. System sales for the year grew 8%, driven by strong international same-store sales growth for KFC and another stellar performance from Taco Bell. Fourth quarter system sales growth of 10% was in line with the update we shared at our Investor Day, driven by 6% same-store sales growth and 6% unit growth. I'm thrilled to report we crossed the 1,000 Taco Bell unit threshold internationally and we soon expect to have 4 countries that have over 100 units with China joining Spain, India and the U.K.  Lastly, Habit added 33 gross new units in 2022, representing a year-over-year growth rate of 10%. We exited 2022 with record site registrations for new units at Taco Bell U.S., and we have over 80% of 2023 planned units at KFC and Pizza Hut outside of China committed with well-capitalized, growth-ready franchise partners. Navigating such challenges with industry-leading performance affirms the confidence we have to deliver our recently raised long-term growth algorithm of 5% unit growth, 7% system sales growth and at least 8% core operating profit growth. Our Yum China team talked about the great returns they're getting from their new unit development last year, coupled with the top line growth that we're seeing in existing stores, and there's a lot to be excited about as we head into 2023."
}