{
    "symbol": "YUM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 12:59:16",
    "content": " Our first quarter system sales growth of 8%, driven by both unit development and same-store sales growth, is a testament to our iconic brands and the unmatched operating capabilities of our world-class franchise partners. Our continued same-store sales momentum was fueled by our brands executing our Recipe for Growth strategy by providing relevant value, access via new channels, distinctive products and a strong brand voice, all supported by our digital and delivery capabilities. Our digital channels continue to accelerate with digital sales of approximately $6 billion, a new first quarter record, reflecting an increase of 15% year-over-year. We're pleased with the continued momentum in our developed markets as they lap strong results from last year and we're excited about the continued resurgence of emerging markets, with same-store sales excluding China of positive 18% for the quarter. First quarter system sales grew 9%, driven by 8% unit growth and 3% same-store sales growth. First quarter system sales grew 8%, driven by 5% unit growth and 5% same-store sales growth. Taco Bell U.S. system sales grew 7%, driven by 2% unit growth and 5% same-store sales growth. Taco Bell International system sales grew 37%, driven by 26% unit growth and 12% same-store sales growth. Next, the Pizza Hut Division which accounts for 18% of our operating profit, saw first quarter system sales grow 3%, driven by 5% unit growth and flat same-store sales growth. At Pizza Hut International which represents 11% of our operating profit, system sales grew 10%, underpinned by 7% unit growth and 5% same-store sales growth. At Pizza Hut U.S. which represents 7% of our operating profit, system sales declined 6% for the quarter, attributable to a 6% decline in same-store sales and flat unit growth. Lastly, at The Habit Burger Grill, first quarter system sales grew 17%, driven by 13% unit growth and 3% same-store sales growth. Our first quarter system sales grew 8%, driven by 6% unit growth and 3% same-store sales growth, reflecting our continued global momentum. While our system sales and operating profit results shared during today's call excluded the impact of foreign currency, we wanted to provide a brief update on the impact in the quarter and the anticipated impact on both our second quarter and full year results. During the quarter, we opened 997 gross units, resulting in 628 net new units, a Q1 development record for Yum!, contributing to 6% unit growth over the last 12 months. At Taco Bell U.S., we continue to experiment with new and innovative ways to engage with our consumers through LTO programs such as the Taco Lover's Pass which helped fuel growth in loyalty memberships during the quarter and which drove customer frequency. We called out the one primary driver which, on profit, creates a headwind this year which -- going into Q2, Q3, Q4, we're going to lose 3 points of operating profit plus the planned growth in Russia as we exclude those from the results and direct any profits from Russia towards humanitarian efforts. If you look at our 18% same-store sales growth in emerging markets, that's a great sign of recovery and a big important part of our business."
}