{
    "symbol": "YUM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 12:26:02",
    "content": " Additionally, we delivered positive same-store sales growth while lapping last yearâ\u0080\u0099s growth of 23%, the strongest quarter of same-store sales growth in Yum!â\u0080\u0099s history. In fact, same-store sales growth for emerging markets, excluding China, was up 22%, a 4 point acceleration from the prior quarter. Our KFC division, which accounts for 49% of our operating profit, grew system sales 1% this quarter, driven by 3% unit growth and a 1% decline in same-store sales. Adjusting last year for the exclusion of Russia, KFC division system sales growth was 4%, with 7% unit growth. For example, Australia grew system sales 7% as same-store sales growth doubled from the prior quarter. The Latin America market achieved 32% system sales growth, propelled by a well-balanced marketing strategy, including a focus on product innovation and dedication to value offerings, while advancing digital capabilities following the launch of the KFC mobile app and kiosks. Turning to our Taco Bell division, which accounts for 36% of our operating profit, system sales grew 10%, driven by 4% unit growth and 8% same-store sales growth. For Taco Bell U.S., system sales grew 9%, driven by 8% same-store sales growth and 2% unit growth. At Taco Bell International, system sales grew 31%, owing to 27% unit growth and 9% same-store sales growth. Q2 system sales were flat, driven by 4% unit growth and a 3% same-store sales decline. At Pizza Hut International, which represents 8% of our operating profit, system sales grew 3%, led by 7% unit growth and a 2% decline in same-store sales. At Pizza Hut U.S., which represents 7% of our operating profit, system sales declined 3%, driven by flat unit growth and a 4% decline in same-store sales driven in large part by continued operational challenges in our delivery business. Lastly, the Habit Burger Grill grew system sales 10%, driven by 15% unit growth and 4% same-store sales decline. Adjusting last year for the exclusion of Russia in our reported results, system sales grew 5%, underpinned by 6% unit growth and 1% same-store sales growth. For the third consecutive quarter, Taco Bell International Development outpaced Taco Bell U.S. development, opening 46 net new restaurants in Q2 and 67% year-to-date."
}