{
    "symbol": "IEX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 17:02:05",
    "content": " Last night, we issued a press release outlining our company’s financial and operating performance for the 3 months ending March 31, 2022. The press release, along with the presentation slides to be used during today’s webcast, can be accessed on our company website at idexcorp.com. And before we begin, a brief reminder, this call may contain certain forward-looking statements that are subject to the safe harbor language in last night’s press release and in IDEX’s filings with the Securities and Exchange Commission. With that, I’ll now turn this call over to our CEO and President, Eric Ashleman. Overall, the operating environment in the first quarter was much like the fourth quarter of 2021, but our team’s improved their ability to navigate through this challenging environment. Q1 gross margin expanded 70 basis points and adjusted gross margins expanded 60 basis points versus last year at 45.6% driven by favorable volume leverage, operational productivity and favorable price cost, despite rising inflation. This result is driven by higher earnings being more than offset by increases in working capital due to the volume impact on receivables, as well as additional inventory we’ve strategically added to help mitigate some of the longer lead times we are experiencing. We levered well on the volume increase had strong price capture, and our team’s drove operational productivity to offset the profit headwinds we experienced from inflation. With that, I’ll provide a deeper look at our segment performance. FMT adjusted operating margin expanded by 300 basis points versus last year, driven by strong volume leverage and operational productivity, which includes benefits from our energy and Italy site consolidation projects, non-repeat of prior inventory reserve adjustments, and some offset from resource investments. Life sciences continues to experience strong demand due to an overall awarded focused around healthcare in areas such as point-of-care and patient diagnostics, as well as increased next-gen sequencing demand as the market for cell-based therapies expands and applications like cancer research. I’m on Slide 11, which lays out our updated guidance. For the second quarter of 2022, we’re projecting organic revenue growth of 8% to 9% and operating margin between 23% and 23.5%. Given our strong first quarter performance, but potential risk and uncertainty on the back half of the year, we are raising the low-end and holding the high-end of organic growth and adjusted EPS guidance. At this time, we see potential risks that further revenue acceleration may be tempered by the Russia-Ukraine war and supply chain effects related to the China’s Zero-COVID policy. And at this time, we’ll be conducting a question-and-answer session. Please proceed with your question. Hey, good morning, everyone. Obviously, there’s a lot going on the environment here. It’s still pretty healthy underneath the hood for you, I know, you mentioned in the prepared remarks maybe some hesitancy on the larger project side of things. Look, it’s holding pretty steady for us all over the place. I continue to see that, honestly, it’s just a question of resource availability, ability to focus on doing the work, either in the current context or even projecting across the future as people consider all the things that that are on the table there that could disrupt that. That being said, we’ve seen some projects here and there, and places like energy, and certainly a few in the chemical space, some short-term stuff in water that indicates, people are trying to get at capacity just like we are and throughput, so that continues to add to the mix. So I – very, very strong, overall steady, and that’s one thing that makes it pretty easy to navigate. And then, I know, we’ll dive into price cost along the way. But, of course, we’ve done our best there to keep our head above water. That’s a good mix for us overall, and you see it reflected in performance. Please proceed with your question. Just a couple of questions on the guidance to start with, it looks like pretty much your guidance for revenue for the rest of the year, even at the high end relative to the first quarter, the quarterly run rate is up only by about as much as the Nexsight acquisition adds. As we look at, obviously, the team’s ability to increase their output directions we’re taking internally has improved with some of the external events that have happened recently in the unknown longer-term implications just can’t count on significant ramp from our current volumes that we’re at now. Obviously, if things unwind and resolve there’s upside opportunity in the back half, definitely based upon the strong backlog that you’ve highlighted. You guys have certainly stepped up the pace of acquisitions, and how aggressive you’ve been there. Does this change your calculus in how you are thinking about going up there acquisitions in terms of, how you’re de-risking your deal models, risk premiums, that you’re putting on things. Yeah, I’d say, I mean, not a lot in the short-term, again, it come back to kind of the nature of the assets that we’re looking at here. They’re very representative of kind of classic IDEX businesses, high mission critical solutions, risk adverse end markets, I mean, they’re not the kind of businesses that Bob and we’ve a lot in the short-term. So not to say, we’re discounting any of those things, but certainly – particularly in the short-term, it doesn’t really change the view of what we think is favorable for the long-term health of the company. No, I wouldn’t say we’ve seen that that’s often a lagging phenomenon. And again, this – we’re in very high quality waters, with generally long histories that anybody would refer to, and just degrees of health in the future, all positive. Please proceed with your question. When we see record orders, record sales, record backlog, and upside in organic, it’s not sure that you did miss any revenues, because of supply chain. Again, the team’s ability to work through some of the operational output, and then just slight improvements in some of the supply chain areas, a lot less than, I think, we quoted around 3% in the fourth quarter, much lower number kind of a couple of basis points type of framework. And on the cascade on that shows the growth investments in discretionary, I’m always interested in knowing some of the specifics inside there, because, obviously, you could cut-back on growth investments anytime and dress up quarterly earnings, but that’s not what you all do. Yeah, Deane, we’re committed to invest, making these investments and outside of what happens in the short-term, these are things that we’re committed to that are going to drive growth for us long-term. And we’ve got great projects in all 3 segments, either through new product launches, investigating new markets to leverage different applications for our technologies. And then even in the second quarter here, we’ve got some larger trade shows that we’re back in the largest North American trade show for Fire & Rescue that we’re going to launch a couple new products and bring those to market. So a lot of exciting things across the portfolio that we’re committed to investing, as we progress through the year like we talked about, we gave our initial guidance. And then, Eric, anything else you’d want to add. Yeah, I’ll hit it generally, like, Bill kind of fill in the blanks in terms of models and numbers. But, I mean, like we’ve been, as you’d suspect, very, very aggressive on the pricing front and talking about it for a long time, where we think we’re entitled to it, given the differentiation and the problems that we solve out there. We’ve worked at very systematically across the company, I mean, there’s an approach to how we do that. So I would say here, as we’ve talked through last year, we got some ways that the cycle came up, and the velocity of it was in many ways unexpected in the beginning of the year. I think as each month goes by the additional pricing actions we’ve taken, we have seen increased inflation, the teams are doing a much better job getting out in front of it. Please proceed with your question. But I would say, just from what we can see here, it’s just been a consistent story. In many ways, it’s concentrated in certain areas that are more favorable than others, they would love to deploy capital and get at it sometimes at larger scale. But you just see, increasingly, I mean, that the bigger the project, the harder it is to put together, you’ve got to have the people to do it, they’ve got to be familiar with the company, and then you got to be able to marshal all the resources and count on it across a horizon that’s going to be longer than it has been before, so all lead times are much longer than they have been. And so, I think, what we’re seeing and in fact, even some of the things that I look at that we deploy in our own companies, you kind of go to the head of the list and you say, all right, well, where’s the absolute place that we have to put some money to work and you can see the return sitting in front of us, because the demand is pronounced. And if you can do it in a slightly different way maybe it’s a little bit faster, it’s quicker the scale is of a different nature. And it’s kind of it matches the deployment within our own business, which, of course, is sort of a different scale. So, I think, that bigger transformative project stuff that’s out there, it’s just that’s the situations that it face, I don’t know, when that ends, I guess, that’s the open question for all of us. But, I see a lot of that related to, it’s just got to find a way to settle into a very different planning environment that has been this way now for a while. But, I think, if folks had a magic wand, they would like it to go away, and they’d like to put that capital to work. And then just a question on max and neutral in the quarter, just based on the backlog, and it’s certainly the pricing items, but more on the mix side. No material impact on the year-over-year, I think, for us a lot of the margin mix will be just the FMT margin expansion that’ll be more consistent this year relative to other productivity initiatives that we had last year, so more productivity driving the margin expansion versus favorable or unfavorable mix having major impact. Please proceed with your question. Hey, good morning, everyone. So I’m just curious, like obviously with what’s going on in Europe, some major themes around how we transfer energy and food shortages globally. But I like the way you framed it, which is actually anytime there’s disruption, there are problems to solve, and that’s usually healthy for us. So, as things swing around in production goes from one zone to another that means largely the infrastructure might be used in ways that’s more aggressive or higher rates than it has before. We do things like custody transfer on the energy side, if we’re shipping it around the world, or building out ports to do that, that’s places that we play. And so, I think, ultimately, I’d put that in the net favorable for us. Same thing over on food production, I mean, is that becomes a bigger deal and starts to move around in different geographies and things like that, where capital may be or may not be a need to be deployed, we come along with it with the mission critical fluidic solutions that we have in there as well. But I would say just the fact that they’re changing, often presents opportunities for us in the ways that that I described here. What’s your ability to kind of protect what’s there, I assume that the duration of the backlog is long, and it’s longer than it typically is. Yeah, in most of it, Joe, we’ve been able to evolve our terms and conditions over the last 18 months to make sure that we can pass on incremental inflation as it comes into there’s certain contracts that we have that we can’t, but I think we’re well positioned overall. Please proceed with your question. So there’s a number of factors at play, some of which we turned to our advantage here in the quarter. I mean, from an external perspective, I’d say the supply chain environment is basically the same difficult some subjects better, some worse, but that not really markedly different. The labor availability piece, I mean, we’re low labor content, but it is critical, somebody eventually has to put things together, that actually improved for us in the first quarter, mainly from absenteeism. And I’d say labor availability, generally, while it’s a tough market out there for people, I mean, it did get a bit better for us. And we’ve got less kind of open roles, especially in the production side overall. And then a lot of the work that we do, I mentioned in the remarks, it’s tuning 80/20, from beginning to end supply right through the factory, right to the customer base. We’ve kind of always naturally had that orientation and how we produce, the harder part is actually to draw those connections all the way back into the supply chain, and then move them around. And that’s where I’d say, we’ve done the best work here over the last really 6 months, but you saw the benefit in the last 3. So all that simply means is, you’ve got your best supplier making the part, that’s the most critical for our best part of the factory to our best customer set that alignment is in place, we’ve got ways to query that across the company now. Last year, we’re now, those are completely behind us and they’re in parts of the business that have got good order velocity against them. Maybe just one follow-up from me on the capital allocation side, it’s nice to see you deploy some cash to share buybacks. No, Vlad, I’ll take that one. When we think the stocks undervalued, what we consider our intrinsic value of the company, we’re back in buying shares. And, obviously, with the significant decline we’ve seen here, and we think that’s short-term related, a lot of the conversation, Eric’s highlight is we’re really bullish on the next couple years, both from an industrial cycle and our ability to put broader capital work in the M&A space. So we’re taking advantage of where the share price is, and we’re going to continue to buy at the current level, if we’re still at this value here as we progress through the quarter. Please proceed with your question. I mean, it’s a slight step down, I think, we’ve said typically before we’ve been somewhere in the point or two, things we wish we would have been able to get out or otherwise. And I’d say, this is a slightly more favorable tune, or landing position for us, largely for a lot of the work that I just talked through there. I mean, I’d say the one external component is that slight uptick in labor availability for us, recognizing again it’s a relatively small part of kind of our spent in P&L. Scott, maybe I’ll take that one. And as we progress through this year, it’s been pretty consistent. Now, those have kind of normalized to some degree, and we’re back looking at fast growing applications that kind of map to the world we see ahead of us. So we tune that fairly regularly and we’re always looking at what should be up there, which should be – should not, we don’t do that around sort of calendar cycles, we’re continually evaluating that and saying, if we hit a milestone that would suggest something needs to come off, and we’re seeing an opportunity elsewhere. And if I could just squeeze one in on dispensing, fourth quarter, the call you were a little bit of a lot got it on the dispensing outlook for this year, and then it looks like it had a pretty good first quarter. Yeah, Scott, I think that’s a first half versus second half. We continue through the back half of last year to win some larger projects here in North America, that’ll be delivered in the first half, so continued strength here over the second quarter, and then much more difficult comps in the back half of the year. Please proceed with your question. Well, I mean, if I go back to the comments, I had just a few moments ago, where I sort of delineated, the labor impact, which was positive for us, I mean, I would say almost all of that that’s an external situation playing through, coming off the Omicron infection rates and higher absenteeism, and then that moderated as we went through the quarter. So I put that on the external side, that’s a component, the tuning I talked about relative to 80/20, and supply chain, and how we move that through the supply base or resourcing. That’s things we’ve long been doing to try to keep pace with a very, very difficult supply environment. So I don’t know with the exact balance, I would say, but you got some of both coming together there. And then I do want to ask you about China, I know that at this point, it’s a relatively small portion of the footprint. I’m wondering at this juncture in April, given the kinds of lock downs activity we’ve seen there. Well, I think like everybody else were watching the current situation play out, I mean, pretty hard to predict how things are going to go, also hard to imagine that this is a big long-term event, I mean, there’s no doubt be some overhang here. Our approach there is very local, it’s completely local. So we’ve got resources on the ground, we’ve got technologies available, and we’ve got domain expertise to solve local problems from within the economy. And so, that doesn’t insulate it entirely from macro events that happen there, but it does minimize the sort of disruptive things you can get doing lots of cross border, and that’s never really been our model there, it isn’t the model for India as well, we have a similar campus there. And then, I still feel very confident about the investments we’re making to be appropriate given the potential of that economy. Please proceed with your question. I think we’ve covered a lot on the full year outlook, so just wanted to ask a couple on the near-term thoughts here. I mean, it seems like your overall messages demand looks strong and there aren’t any sort of warning signs you’re seeing, but you want to be conservative given the overall macro environment. I guess, I’m curious, just in the second quarter, it seems like you are pointing to some potential for some margin compression. It depending on what your competence, there’s kind of another 50 to 100 basis points, primarily through incremental investments on the discretionary and resource side. As we said, hey, we’re going to have about $20 million, $25 million for each category this year. And then just in terms of capital deployment for the year, so the CapEx guidance for the full year would indicate that you’re sort of accelerating there. Yeah, I think some of the big ones, Eric highlighted, continued investments in facilities in emerging markets are China expansion and India expansion, the CapEx associated with that’ll ramp here over the next few quarters. So we’re invested in that machine tools and equipment to do that, I wouldn’t say within additive emphasis on the automation capabilities that are out there today, that also has a secondary benefit of helping us on the labor front. Please proceed with your question. Yeah, it’s close to 3%. I mean, that’s been very, very healthy. I mean, obviously, there’s a piece of that that’s involved with COVID, or at a minimum the vaccine that therapeutic side of that, lots of interesting things going on with cell-based therapies and other things that are out there. So, I mean, it’s an area of focus for us, we’ve got a nice presence there that has done well, and we continue to stay very interested in it. Please proceed with your question. I’d say from a high level there, none of this really comes back to specific areas of concern that map against where we are and kind of where we intersect the world out there. They’re more general, and they’re pretty close to the same ones that everybody else is thinking about. But there’s a bunch of derivative impacts for us and others, we’ll see how that plays out. But I don’t think we’re looking at it, units of measure that are different than the ones that are on the macro screen for most people. Well, I mean, so like I – it’s kind of hard to do that specifically, because it goes in different businesses and goes in different places, I would just say, very, very strong on both of those categories. On the semi side, I mean, we’re – like we’re involved in different aspects of that we’re involved in some businesses, we kind of come in there on the fab side, when we build out infrastructure, and other places, we’re actually involved in the metrology side, or the inspection of things that are made in that infrastructure. Please proceed with your question. I just wanted to see if you’d round up discussion a little bit on capital deployment and acquisition, where you’ve obviously been successful and steady in the past year, and to this quarter, 1Q and 2Q. Well, I think for a while we’ve been talking about the intentionality of the work, so we resourced it in a different way, put some people on, brought some folks in from the outside, I mentioned, Roopa, in my earlier comments, she brings a lot to the effort as we go. And you can kind of see that if you look at the last few acquisitions in particular, they’re all very close to home to our businesses. And, in fact, we’ve known them for a long, long time. So in some ways, we’re taking advantage of targets that have been out there that we’ve understood with much more focused cultivation, understanding and ability to get the transaction done, and then integrate it successfully in the company. Right next to that, then is broadening that work and starting to think about, well, if you go slightly to the left or to the right, or extend out the time horizon a bit further, what does that suggest about the universe that’s out there, which could be known in some cases isn’t known. And so it’s very, very focused work, it’s process driven. Again, a lot of it is relatively close to home, because we’re looking to leverage the domain expertise that we have the market insight and presence and positioning of current businesses. But it’s coming together in an interesting way, and we long, et cetera, I’d said, ever since I took the seat, I was trying to level loaded a bit. And that’s now happened, it makes that resource base more stable, and makes the work more predictable, and it’s easier to optimize. I mean, we’ve got the – to complete the kind of growth maps that we have for the businesses, we’re going to often want to bring in some technologies and position points that we don’t have today. Please proceed with your question. We didn’t cover a lot of ground, but I thought I’d try and drill into a couple of things. And we have a big broad cross section of different markets, different pressure points, and I wouldn’t be able to pick anything out specifically yet. And then, I think, Bill’s remarks about the paint dispensing market. Yeah, Walt, I think overall, the paint markets strong, obviously, from time to time, there’s large replenishment orders in North America that were coming off of the back of a huge cycle there that’ll be have the tougher comps in the second half of the year. And you still have a lot of especially the Asia side of things is, I mean, it’s just now automating we’re still involved in that cycle, which is a little bit more steady state, less project specific. I’ll now turn the call back over to CEO, Eric Ashleman for closing remarks. Bill and I do our best to simplify the story here makes it seem easy enough, it’s not. And I’m really, really proud of how our teams have come together and made the improvements and progress they have here. It’s reflective our mission and values, and when we do our job as well. So we’re leaning forward, we feel good about where we are and look forward to talking with you, as we go about the progress we’re making. And this concludes today’s conference, and you may disconnect your line at this time."
}