{
    "symbol": "GCMG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 14:52:12",
    "content": " Our private markets verticals continued to grow with Q4 private markets management fees, excluding catch-up fees rising by 10% over the fourth quarter of 2021 and 14% for the full year 2022. Looking ahead, the continued growth of our private markets management fees, combined with our strong fundraising pipeline, including our five private markets specialized funds in market leave us confident that we can compound fee-related earnings in 2023 and beyond at mid-teens rates. For Q1 '23, we expect continued strong private market management fee growth, excluding catch-up fees of 11% to 13% over Q1 of '22, with overall private markets management fee growth, a couple of points below that due to minimal expected fund closings in the quarter. During the last two years, we have grown both private markets fee-paying AUM and management fees by 32% with private market strategies now comprising 63% of our fee-paying AUM, up from 54% just two years ago. The Sponsor Solutions category will be led by a new senior partner and one of our existing senior partners who is moving roles  Last quarter, I discussed the significant value inherent in our customized separate account relationships, which were 74% of assets under management as of year-end. Excluding the impact of catch-up fees, which were $1.6 million in the quarter, private markets management fees increased 10% from the fourth quarter of '21. Given '22 public market impacts and the high watermarks of our ARS funds, our '23 performance fee earnings potential, assuming an 8% growth rate of return for multi-strategy and a 10% growth rate of return for opportunistic investments is approximately $17 million, which compares to $30 million if all portfolios were at high watermark. Nobody's changing kind of - lowering where they want to see alts in their overall balance sheet allocation, you have had - you had a slowdown last year, and it was really related entirely to kind of the macro capital markets environment and importantly, to both the dual factors of denominator on significantly reduced long stock long bond portfolios, and it was related to the reduced transaction levels, which means that cash flows are coming back - from the portfolio are down. Commodities had a great year and last year you're seeing people talk about whether they want to shift capital towards those strategies, you - there's sort of - that space is so diversified in terms of the number of strategies that take place underneath and the ability to have funds and separate accounts that focus on different strategy sets and have different make ups that there's always a level of demand. I do think that when you have an environment like we had last year, you - people will tend to use liquid strategies and liquid portfolios for liquidity that may be is obvious that in terms of saying that, but I do think you see people that can take a little money from ARS to fund some things elsewhere in their alts book that they want to keep funding and want to keep doing, but they're over allocated alts because of the denominator effect."
}