{
    "symbol": "HURN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 21:59:09",
    "content": " On a full year basis, the Healthcare segment achieved record revenues of $535 million, increasing 20% over 2021. In the fourth quarter of 2022, Healthcare segment revenue grew 18% over the prior year quarter to $153 million, reflecting the strong demand for our offerings across our digital capabilities, revenue cycle managed services and performance improvement consulting. In the fourth quarter of 2022, Education segment revenues increased 44% over the prior year quarter to $97 million, driven by the strength in demand for our offerings across the segment. In the fourth quarter of 2022, Commercial segment revenues grew 24% over the prior year quarter to $64 million, primarily attributable to strong demand for our financial advisory and digital offerings. Revenues for the fourth quarter of 2022 were a record $313.7 million, up 26.3% from $248.3 million in the same quarter of 2021. And results for full year 2021, include the aforementioned $23.7 million gain net of tax from the sale of the company's life sciences business in the fourth quarter of 2021. Adjusted EBITDA was $39 million in Q4 2022, or 12.4% of revenues compared to $29.3 million in Q4 2021, or 11.8% of revenues. For full year 2022, adjusted EBITDA as a percentage of revenues increased 80 basis points to 11.6%, compared to 10.8% in 2021. Adjusted net income for the fourth quarter of 2022 was $22.6 million, or $1.12 per diluted share compared to $17.2 million, or $0.80 per diluted share in the fourth quarter of 2021. The Healthcare segment generated 49% of total company revenues during the fourth quarter of 2022 and posted revenues of $153.3 million, up $23.9 million, or 18.5% from the fourth quarter of 2021. Revenues for the fourth quarter of 2022 included $3 million from our acquisition of Perception Health, which was completed in December of 2021. On a full year basis, Healthcare revenue increased 20.3% to $535 million, also driven by strong demand for our digital offerings, as well as our revenue cycle managed services and performance improvement consulting offerings. The Education segment generated 31% of total company revenues during the fourth quarter of 2022 and posted strong revenues of $96.6 million, up $29.3 million or 43.5% from the fourth quarter of 2021. Revenues for the fourth quarter of 2022 included the inorganic contributions of $1.8 million from our acquisition of Whiteboard, which was completed on December 1, 2021. The Commercial segment generated 20% of total company revenues during the fourth quarter of 2022 and posted revenues of $63.8 million, up $12.2 million or 23.7% from the fourth quarter of 2021. On a full year basis, Commercial segment revenues were $237.6 million, and grew 8.8% year-over-year, driven by strong demand for our digital and financial advisory offerings, partially offset by the impact of the divestiture of our life sciences business in the fourth quarter of 2021. On a full year basis, operating income margin was 21.1% compared to 15.7% in 2021, primarily driven by revenue growth that outpaced the increase in compensation-related costs for our revenue-generating professionals and the decrease in restructuring charges."
}