{
    "symbol": "HURN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 01:12:09",
    "content": "  We achieved 27% revenue growth over the third quarter of 2021, primarily reflecting ongoing momentum in our education and healthcare industries and continued growth in our digital capability. Turning to the Commercial segment, in the third quarter of 2022, Commercial segment revenues grew 6% over the prior year quarter, driven by strong demand for our digital offerings, primarily across the financial services and energy and oil and gas industries. The increase in third quarter revenues from our digital offerings in the Commercial segment were partially offset by the divestiture of our Life Sciences business, which we sold in the fourth quarter of 2021 and a decrease in demand for our financial advisory and strategy offerings. Through the third quarter of this year, our digital revenues comprised 45% of total company revenues, spread relatively evenly across all three of our industry reporting segments. The increase in revenues in the quarter was nearly entirely organic and driven by growth across all 3 operating segments, particularly our Education and Healthcare segments and was reflected on the strong demand for our digital offerings across all industries. In addition, revenues reflect continued strong demand for our Consulting and Managed Service offerings within the Education and Healthcare segments, which grew 46% and 17%, respectively, in the third quarter of 2022 over the same period in 2021. The segment posted record revenues of $94.3 million in Q3 2022, up $31.1 million or 49.2% from the third quarter of 2021. Segment posted revenues of $59.7 million in Q3 2022, up $3.6 million or 6.3% from the third quarter of 2021. The increase in revenues reflect continued strong demand for our digital offerings, partially offset by a decline in revenues due to the divestiture of our Life Sciences business in the fourth quarter of 2021 as well as a decrease in demand for our financial advisory and strategy and innovation offerings. Unallocated corporate expenses in the third quarter of 2022 included a $1.3 million reduction of expense related to the decrease in liability to participants in our deferred compensation plan, which is fully offset by the corresponding loss and other income related to the decrease in fair value of the assets used to fund that plan."
}