{
    "symbol": "HURN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 11:25:18",
    "content": " In addition, our digital revenues increased 36% in the first quarter of 2022 over the same period in 2021, reflecting solid demand for improved integration of technology and analytics into our clients' business operations. In the first quarter of 2022, Education segment revenues grew 57% over the prior year quarter, driven by strong broad-based demand across all of our offerings in this segment. In the first quarter of 2022, Commercial segment revenues grew 3% over the prior year quarter, driven by strong demand for our digital and strategy offerings in the commercial industries, particularly in financial services. Our digital offerings in the commercial markets grew 23% in the first quarter of 2022 as compared to the same period a year ago, further demonstrating the strong demand for our technology and analytics-related services. Revenues for the first quarter of 2022 were $260 million, up 28% from $203.2 million in the same quarter of 2021. In addition, revenue within our digital capability increased 36% in the first quarter of 2022 over the same period in 2021, reflecting increased demand across all of our core industries as our clients continue their digital transformation. Adjusted non-GAAP net income was $10.3 million or $0.49 per diluted share in the first quarter of 2022, compared to $7.8 million or $0.35 per diluted share in the same period in 2021. This segment posted revenues of $121.9 million for the first quarter of 2022, up $25.9 million or 27% from the first quarter of 2021. Our consulting and managed services capability within Healthcare grew by 25% year-over-year during the first quarter, primarily reflecting increased demand for our performance improvement offerings. The segment posted record revenues of $80.7 million in Q1 2022, up $29.3 million or 57.1% from the first quarter of 2021. The segment posted revenues of $57.5 million in Q1 2022, up $1.6 million or 2.9% from the first quarter of 2021. The increase in revenues reflects strengthened demand for our digital offerings, partially offset by a decrease in revenues due to the divestiture of our Life Sciences business, which generated $4.7 million in the first quarter of 2021. Unallocated corporate expenses in the first quarter of 2022 included a $2.6 million reduction of expense related to the decrease in liability to participants in our deferred compensation plan, which is fully offset by the corresponding loss and other income related to the decrease in value of the assets used to fund that plan. But in terms of the first quarter, I think it was a demand that we saw strengthening as the quarter progressed and as a result of just good balance really across the different industries as well as the capabilities including a good mix of projects, including some which were larger size, but nothing kind of unusual during the quarter that led to the larger revenue number other than just solid demand. I guess the comment I'd make is if you go back to 2021, one of the things that we discussed was really starting even the second -- so early in the second quarter last year, but certainly in the third and fourth quarter, really the commentary was we feel really good about the growth that's coming in digital based on what we see in the market based on deals we had closed that we knew we're going to be ramping up."
}