{
    "symbol": "NVST",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 19:36:03",
    "content": " At this time, I would like to welcome everyone to the Envista Holdings Corporation's Fourth Quarter 2022 Earnings Results Conference Call. I want to point out that our earnings release, the slide presentation supplementing today's call and the reconciliations and other information required by SEC Regulation G relating to any non-GAAP financial measures provided during the call are all available on the Investors section of our website, www.envistaco.com. As announced on January 3, 2022, we closed the divestiture of our Cabo treatment units instruments business for both 2021 and 2022. All references in these remarks and accompany the presentation to earnings, revenues and other company-specific financial metrics relate only to the continuing operations of Envista's business, except for the cash flow measures. Unless otherwise noted, references in these remarks to company-specific financial metrics relate to the fourth quarter of 2022 and references to period-to-period increases or decreases in financial metrics are year-over-year. During the call, we will be making forward-looking statements within the meaning of the federal securities laws, including statements regarding events or developments that we believe, anticipate or may occur in the future. These forward-looking statements are subject to a number of risks and uncertainties, including those set forth in our SEC filings, and actual results might differ materially from any forward-looking statements that we make today. I'm pleased to report that for the full-year 2022, the Envista team delivered another strong performance. This was expected and primarily related to challenges related to the COVID outbreak in China, the geopolitical issues related to the conflict in Ukraine and continued depressed environment for capital equipment driven by higher interest rates and lingering economic uncertainty. As we reflect on our performance in 2022, as well as our future outlook, I think it is important to provide some context about the underlying demand for dental solutions. As I have shared on previous calls, my leadership team and I have spent a significant amount of our time in the field meeting the dental professionals in their clinics to understand what is happening in real time. It is not an overstatement to say that in 2022, we collectively spent time with over 1,000 clinicians across North America and Europe. While clinicians are confident in the long-term, they remain mindful of the short-term headwinds driven by increased interest rates, the possibility of recession, general economic uncertainties, and global geopolitical risks. So far, patient demand has been resilient, but we do expect continued volatility going into 2023. While the market remains dynamic, I think it's important to point out that Envista continues to deliver, despite the volatile global supply chains, geopolitical challenges and persistent inflation. Our culture underpinned by the Envista Business System, EBS, enables us to continuously deliver for our customers and shareholders. We quickly identify potential risks and opportunities and deploy EBS tools, such as daily management or problem solving process and value stream mapping to ease supply chain uncertainties, improve our operational capabilities, reengineer existing processes, and continuously drive productivity. Our ability to produce results in the face of uncertain times is a direct reflection of our continuous improvement and customer centric culture, our strategic differentiation and the continued transformation of our portfolio. Before I turn it over to Howard to discuss our fourth quarter results in more detail, I want to provide more color on the progress we made in 2022 against our long-term priorities of accelerating our growth, expanding our operating margins, and transforming our portfolio. In 2022, we made significant progress in driving commercial execution across our portfolio. We're pleased to announce that together with our orthodontics partners, we have started over 300,000 Spark cases around the world. In 2022, we nearly doubled the number of active Spark doctors and further improved utilization rates of individual clinicians, leveraging our EBS toolkit to systematically manage our funnel of new clinicians and develop standard work to flawlessly onboard   customers. In addition to Spark, we also saw low single digit core growth in our traditional brackets and wires business in 2022. This growth was despite relatively weaker performance in China and Russia, which normally delivered outsized growth for our traditional brackets and wires. Our Damon Altima product continues to go rapidly by providing orthodontics with more precise finishing capabilities, allowing them to reduce share time and improve office efficiency. With over 40% of our brackets and wires business in emerging markets, it is imperative that we reinforce our position as the partner of choice for new orthodontics professionals in emerging markets. Turning to our solutions for implant-based tooth replacements, we delivered solid mid-single-digit core growth in 2022, despite significant volatility in China and Russia, two normally important growth drivers for this business. Led by strong relative performance in Europe, our premium business continues to perform well. We benefited from our focus on providing comprehensive solutions for implant-based tooth replacements, and as a result, we are seeing strong growth in both digital solutions and regenerative materials. As discussed in 2022, we delivered a 40 basis point of expansion of adjusted EBITDA margins. We achieved these results while making significant investments in our long-term growth and also facing both meaningful inflation, as well as intermittent supply chain disruptions. Each of our businesses are driving improvements in productivity, systematically aligning our prices and driving down operational costs. In addition, we continue to optimize our organizational structure to improve the customer experience while creating more flexibility to deal with uncertainties in the macro environment. During the second half of 2022, we eliminated more than $30 million of structure costs and continue to look for ways to further streamline our organization. In 2022, we benefited from the divestiture of a slower growing, lower profitability treatment unit, and instrument business. This transition both improved our overall growth and profitability, while reducing our exposure to more cyclical segments at the dental market. Given the economic uncertainty, the transformation of our portfolio puts us in a much stronger position as we move forward. In the past year, we closed two strategically important acquisitions that positions us to drive digitization of the dental market, while exposing us to higher growth segments within the industry. As promised, our acquisitions delivered more than   revenue in 2022 and will enable us to accelerate core growth long-term. While we're excited about the strategic moves that we have made today, we see opportunities to further improve our portfolio. On a reported basis, fourth quarter sales increased 1.4% to $660.8 million. Sales in the quarter were negatively impacted by 4%, due to foreign currency exchange rates, while acquisitions contributed 3.1% of growth in the quarter. Our core sales growth was 2.3%, compared to the fourth quarter of 2021. Geographically, our developed markets grew 3.5%, driven by very strong growth in Western Europe, offset by more modest growth in North America. Taken together, China and Russia declined significantly in Q4, while other emerging markets grew low-single-digits. Our fourth quarter adjusted gross margin from continuing operations was 56.2%, a decrease of 90 basis points, compared to the prior year. The decrease in gross margin was driven by a combination of inflation and strong growth of Spark, somewhat offset by pricing. Our adjusted EBITDA margin for the quarter was 20.9%, which is 240 basis points higher than Q4 of 2021. In Q4, we took further actions to streamline our organization to ensure that we can continue to expand margins while investing for growth. Our fourth quarter adjusted EPS was $0.52 from continuing operations, compared to $0.46 in the comparable period of the prior year. Core revenue in our specialty products and technologies increased 4.5%, compared to the fourth quarter of 2021. Within this segment, our orthodontics business grew more than 15% year-over-year in the fourth quarter with Spark continuing to outperform. Our bracket and wires business grew low-single-digits in North America, but was dragged down by double-digit declines in China and a more modest decline in Western Europe. Despite the macro volatility, we are confident that our orthodontics business continues to outperform the market. Outside of Russia and China, we delivered positive low single digit growth led by solid performance in Europe. Our regenerative business, including the newly acquired Osteogenics business continues to accelerate. For the fourth quarter, our Specialty Products and Technology segment had an adjusted operating profit of 20%. This was down 210 basis points versus the same period in the prior year, primarily due to Spark and our continued investment to drive long-term growth, as well as a decrease in sales in China and some currency headwinds. Core sales in Q4 decreased by 0.9%, compared to Q4 of 2021. The lower growth was partially attributable to the strong performance in Q4 of 2021, driven by pent-up demand, as well as macro headwinds, including inflation, rising interest rates, COVID related challenges in China and geopolitical uncertainties. Further, we continue to deemphasize non-strategic geographies and concentrate our efforts in markets where we can build a long-term sustainable competitive advantage. On the consumables side, our Restorative & Endodontics grew more than 7% in Q4 with strong growth in most markets. As expected, our infection prevention business increased double-digits in Q4 of 2022, compared to the softer Q4 of 2021. Equipment and Consumables adjusted operating profit margin was 27.2% in the fourth quarter of 2022, versus 21.4% in Q4 of 2021. Our continued strong margin improvement was driven by a favorable sales mix and improved pricing, as well as our relentless focus on driving productivity. As we move into 2023, the inclusion of our more fully integrated iOS business will further support the growth of our equipment and consumables business, while also positively contributing to our profitability. In the fourth quarter, we generated free cash flow of $95.1 million and we ended the year with over $600 million in cash. For the year, our free cash flow was markedly lower than prior year, due to several factors, including the elimination of cash flows associated with discontinued operations, one-time transaction costs associated with our acquisitions and divestiture, the timing of tax payments and higher capital expenditures to support our long-term growth initiatives. As discussed in our last earnings call, we remain committed to our mid-term goal of delivering free cash flow in excess of net income. We made significant progress in the fourth quarter, driven primarily by sequential improvements in working capital. As we move into 2023, we remain focused on driving free cash flow, while continuing to invest in our long-term growth initiatives. I'll now turn the call over to Amir to provide an update on our 2023 outlook, as well as some closing comments. The dental market is attractive, underpenetrated and has a strong growth trends. Despite the resilience of the dental market, we expect 2023 global demand to be choppy. The geopolitical situation related to the Ukraine conflict and the associated risk of energy crisis in Europe, as well as China's COVID-related uncertainty and the consumer sentiment will create additional volatility. In-light of this macroeconomic background for 2023, we expect to deliver low-single-digit core growth and adjusted EBITDA margins of over 20%. Margins are also anticipated to accelerate throughout 2023 as we benefit from the streamlining of our organization and cost reduction, as well as the shift of our portfolio mix toward higher margin products. Our full-year guidance reflects a balanced view of managing through a more volatile economics and environment, while continuing to invest for long-term growth, expanding our margins, and transforming our portfolio. We will accelerate growth, expand our operating margins, and transform our portfolio through active and disciplined capital deployment. We will further accelerate our growth in implant-based tooth replacement by leveraging our premium implant franchise to provide full solutions across the implant workflow, including regenerative prosthetics offerings by utilizing our premier diagnostics and digital capabilities. Your line is open. Maybe just to start, Amir, it's a pretty dynamic environment right now as you alluded to in your opening remarks, but the dental consumer in the U.S. and I mean most of Europe seems to help you today I think a lot of us were fearing then others in dental might have talked more positively about demand visibility improving. I know it might not be perfect visibility, but you're really close to the end market as you alluded to. Through all the reviews that we have done, visits that we have, what we have seen, the bookings remain the same and on specialty businesses, there is continuity around patient traffic. In large imaging equipment is also â\u0080\u0093 and there's tremendous amount of pressure from investment by large DSOs opening new offices, as well as the interest rate and inflation related. We expect Q1 growth to be muted, but as we go further through the year, we're going to see a faster growth through 2023. Maybe then on â\u0080\u0093 if I pivot over to the part of the guide here, I thought the EBITDA margin guide here was pretty solid guys considering you had the   from VBP. For us, our China business on the specialty side is about 100 â\u0080\u0093 actually a little bit over $175 million, a $100 million or over $100 million in the implant side, and over $75 million on the ortho side. So, as it relates to the outcome of VBP and where we sit today, implants, it's a national program, the bidding is complete, and it's being currently rolled out. And so, we expect that it's going to be reasonably favorable for us as it relates to being a selected vendor, but recognizing of course that the pricing on that side will probably be about a 50% drop. We think that the pricing there is going to be a headwind of about 35%, roughly. Your next question around margins, maybe I'll address the Spark question. Clearly, we're seeing the momentum and are very encouraged by our growth on that business. For the duration of 2023, I think we're going to continue to be in investment mode. Clearly, that business is dilutive to our margins today. We think that longer-term that we can get the margins up above fleet average, but today it is dilutive and will be likely for the duration of 2023 as well. And so, we're continuing to see that improve quarter-over-quarter. I think, you know if you do the math on that, I'm going to say it's roughly about 70 basis points, maybe a little more than that, could be. Your line is open. I know that you just obviously talked about China, but maybe focusing more on North America and Europe. In orthodontics, what we have seen, that continuation of expansion of our Spark business remain consistent. Quarter-to-quarter, let's give you a little bit of a feel, Q4 versus Q3, we had about a 25% step-up. Bracket and wires in North America and Europe continue to perform, but in emerging markets, specifically China and Russia, we haven't seen yet any major trends or change in trajectory as we saw in Q4. Give you a little bit of a feel, China is a double-digit decline for us in Q4, and Russia was very volatile quarter-to-quarter and that hasn't really changed in walking through January. In the implant side, outside those two geographies, we have performed well and continue to perform well and it is getting operational and our commercial execution is getting better. As you recall, if you go back a couple of years later ago, we decided that we have to make some improvement and changes in our go to market activities around commercial execution in Europe. We're doing the same thing in North America and in U.S. And we think with those changes, we're going to see a continued progress as we move forward toward 2023. And last part of our business, we haven't yet seen any change in the imaging side of our business as we walk into the Q1, but I want to highlight a couple of things about imaging. And iOS, as Howard mentioned, we have seen a step-up quarter-after-quarter and that step-up continues throughout Q1. Putting all of that together, what we expect, a slower ramp throughout the year, specifically the front part of the year, and as certainty come into our focus in China, we expect to see higher growth, higher margin as we walk throughout the year. About the sensitivity of the operating margin guidance that you just gave us to the, sort of macro growth. Even when we have softer top line, we're going to continue to EBS and look to improve our efficiencies, productivity as well. As Amir indicated in the prepared comments, we did some pretty substantial actions even on the structural side in the second half and continue to fine tune that in the fourth quarter as well. And so, you can see and expect us to do what we need to operationally still protecting obviously the long-term growth drivers for us. We mentioned that in the context of Spark certainly, but in other areas where we have innovation that will drive growth further in the future. We're going to continue and invest there, but as it relates to operations and ensuring that we get the productivity gains certainly that will be a focus, a fundamental tenant of EBS and one that we continue to deploy year-over-year. Your line is open. One, your Western European growth is strong again. This is second quarter in a row that I think your three-year compound annual growth rate, so not even a stack growth, just your compound annual growth rate over a three-year period now up into the upper single, if not low-double-digits. As you recall, if you go back and I'll walk you through both implant, as well as the ortho part of our business. You mentioned DSO, yes, it is a factor, but it's a lot broader  Western Europe is a lot broader than DSOs. And it wasn't only the product, it's training education after sales support, as well as what we call digital clinical success capabilities that we put in place. We took that model, we went to the next geography, and we replicated from Spain to France and so on and so forth and we're beginning to see that momentum taking shape, geography by geography, and we have a lot more room to go in the European side and specifically on ortho side. On implant side, as you recall, I mentioned that before, about two years ago, we really changed our go to market activities. We consolidated a lot of our order and management contract activities, just to give you a feeling that two-year time period, we had close to about 350 people in   and we built the Envista Prague Center based on continuous improvement, daily management, and standard work, it consolidated with 15 different languages, really changed the model of our customer experience from a low call 1 to 1 to a more of a broader holistic approach. The team has done a great job creating a heat map again using the standards of EBS, take a look at geography by geography, partnering with distributors, understanding dynamic on the market, putting training and supporting place, and we have continued to gain momentum and gain share. So, what you see in Europe is a broad performance across all of our businesses. Hopefully that gives you a little bit of a perspective and our approach, and we're confident when we make those comment about 2025, 2026, we feel confident that push that we're taking is going to pay-off in the long-run. Unless I'm missing something in my checks, I don't think the market's growing nearly that fast. If you look at our traditional consumer business, we didn't have a whole lot of new product to offer. If you look at what we have done in the past six months and what is ahead in next 12 months, it's just a revamp of that business completely. High margin, really well-executed, well-differentiated, we think the consumable business has an opportunity to be a major factor in our growth and margin profile going forward. We did not count on across the board price increases, but we have and continue to see price increases as I mentioned around innovation and then we are differentiated. So, we don't think this is going to be a radical change going forward from what we have seen in the past. Your line is open. So, for Spark, we're talking about a 300 basis point contribution to revenue growth in 2022. As it relates to Spark, what we called out was that our innovation Spark being included in there would generate in excess of 200 basis points. In 2023, we anticipate Spark, as well as some other innovation to help drive over 250 basis points of that growth top line. Keep in mind that when we talk about margin headwinds and things like that, that Spark is again currently dilutive to our fleet average as it relates to margins. As it relates to pricing this year, we had in excess of 150 basis points for the full-year of pricing. Now, of course, that's before VBP and as we indicated earlier, we think that VBP can be upwards of $20 million of impact that obviously would be both the top line and a margin impact. Is your imaging business you're going to focus on, call it some core opportunities, you sort of reset the base maybe 2H 2023 is a good way of thinking about it where the drag, sort of diminishes at that point in time, the back half of 2023, maybe that's a component of the accelerating revenue growth throughout the year and I just got a quicker question? So, we have continued through that process in Q3 and Q4, and we think that you have seen the performance and the margin out of consumable and equipment side, a good part of that is attributed to the changes that we have done and redirecting investment, redirecting our resources to areas that it has higher growth, higher margin over time. But your assumption is correct that we expect this business to, kind of normalize in second half of this year and new base and new starting point in 2024, but I want to add us to â\u0080\u0093 I mentioned that before that one-third of this business is services and annuity business. And then just the second question, admittedly some annoying modeling questions, but when you guys say greater than 20% adjusted EBITDA margin for 2023, I mean I think you did 20.1% in 2022. And first of all, Jon, as you know, I mean when we spun and became a public company, we had committed to 50 basis, 50 basis points to 75 basis points of margin expansion. I think over the three plus years that we've been a public company, we've delivered over 450 basis points. And so, certainly, margin expansion is one of the things that we look at and remain very focused in on. That said, I mean, there's quite a bit here as it relates to unpacking a lot of the macros and the uncertainties going into the year. And so, we did 20%, just north of 20% in 2022. And then maybe at your second question as it relates to core, look, we're going to â\u0080\u0093 we see that our growth is going to accelerate through the year. I mean with all that's going on in China and Russia and the macros, I think that we want to be prudent and say that it will build throughout the year. We see Q2 and Q4 as being the largest revenue quarters of the year, but certainly Q1 is going to be challenging. Your line is open. I'd imagine China is probably a major factor in that, but some of the pressures that we're seeing on equipment, the VBP impact, those take a little bit longer to, kind of annualize. So, if there's any other, kind of specifics that you think you want to highlight in terms of cadence over the course of the year that would be helpful. Nothing that we have seen in the past 12 months really had changed our view that those targets that we communicated in 2026, high-single-digit, 22.5%, north of 22.5%. And momentum that we saw in 2022, specifically with some of the challenges in Q4, despite up all of that coming in producing result that we have produced gives us the confidence that fundamental capabilities that exists in this company around continuous improvement remains alive and well. If we have upside, we will see as we go through the year to see how the market evolves, but based on visibility that we have today, based on the information available today, we think targets are really achievable. We have a year ahead of us, plenty of opportunities to become better in what we do to build a better relationship with our customers, to improve our commercial execution, and to march down the path of long-term strategy of digitizing democratizing, personalizing, this industry, make a meaningful difference and we're committed to it."
}