{
    "symbol": "NVST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 23:33:06",
    "content": " Today, we are pleased to announce that despite a challenging macro environment in this team, has once again delivered a strong quarter with mid-single-digit core growth and over 20% adjusted EBITDA margins. Our culture shift around customer centricity, innovation, respect continuous improvement and leadership, coupled within Envista Business System, EBS, is what drives our performance and allows us to deliver on our long-term objectives of accelerating growth expanding operating margins and transforming our portfolio. Our third quarter adjusted gross margin was 59.2%, increasing by 40 basis points compared to the prior year due to higher volume, pricing actions and productivity improvements partially offset by the impact of inflation and continued investment in our long-term growth initiatives. Our Specialty Products & Technologies segment core revenue increased by 11.3% compared to the third quarter of 2021, driven by strong growth in our premium implant business above-market growth in our core brackets and wires business and continued impressive growth from Spark. Despite the continued challenges in the macro environment, including persistent inflation, continued supply chain issues, geopolitical risk and a potential energy crisis in Europe we are reiterating our guidance for core growth and profitability and expect to deliver mid-single-digit core growth for full year 2022, along with adjusted EBITDA margin of 20% for the full year. In orthodontics, we will continue to provide a differentiated and integrated suite of treatment options, including brackets and wires and clear aligners that empowers the specialists to provide the best personalized treatment for each patient in our implant-based tooth replacement business, we will leverage our diagnostic and digital capabilities to provide clinicians with a complete implant workflow solutions, including regenerative and prosthetic offerings."
}