{
    "symbol": "COE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-24 17:07:03",
    "content": " If we had completed the spin-off transaction on our reference date of April 30, our overseas business equity would have been a positive US$12.8 million. Our Q1 net gross billings have reached US$5.3 million, representing a 79.9% sequential growth. Revenues from overseas business in the first quarter was US$1.9 million, with gross margin of 78%. Our overseas business growth momentum continued into Q1 2022 as Q1 gross billings reached $5.3 million, exceeding the top end of our guidance of $4.6 million. Net revenues for Q1 were $9.5 million, representing a decline of 89.7% from the same quarter last year. Net revenues for the company's overseas business and the Mainland China business were $1.9 million and $7.6 million, respectively. Gross margin for the company's overseas business and the Mainland China business were 77.9% and negative 36.7%, respectively. We did not recognize $48 million noncompliant lesson consumptions as revenues for our China Mainland business, but we still recorded the corresponding cost of revenue of $9.1 million. Q1 operating expenses were $20.6 million, a 59% sequential decrease from $50.2 million for last quarter. Q1 sales and marketing expense were $7.1 million, down 81% sequentially. Sales and marketing expenses for overseas business and Mainland China business were $2.0 million and $5.1 million, respectively. Q1 product development expenses were $2.0 million, down 16% sequentially. Product development expenses for overseas business and Mainland China business were $1.1 million and $0.9 million, respectively. Among which, $2.9 million were VAT related to noncompliant lesson consumptions, $2.8 million were accrued VAT and related penalty and $0.8 million were severance costs. Excluding these onetime items from Mainland China business, Q1 G&A expenses would have been $5.0 million, down 27% sequentially. Q1 operating loss was $21.7 million, where overseas operating loss was $3.5 million and Mainland China operating loss was $18.2 million. Net loss for overseas business and the Mainland China business were $3.4 million and $17.7 million, respectively. The company's total cash, cash equivalent, time deposits, short-term investments and restricted cash were $126 million at the end of first quarter. And among which, $7.7 million were restricted cash, which was advances from students under government supervision. Among which, $6.1 million were for overseas business and $210.5 million were for Mainland China business. Looking forward to the second quarter of 2022, we currently expect net gross billing of overseas business to be between $7.2 million and $7.5 million, representing sequential growth between 36.1% to 41.8%."
}