{
    "symbol": "CEVA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 14:31:03",
    "content": " Forward-looking statements include statements regarding market trends and dynamics, including anticipated growth in the wireless component of the global semiconductor market are and our customer's gain in market share and the future of 5G and Wi-Fi, our market position and strategy, including the strength of our technology offerings and efforts with respect to our co-creation business proposition, impacts of global economic uncertainty and COVID on our business, including royalties, demands for and benefits of our technologies, and expectations and financial guidance regarding future performance, including for the full year and third quarter of 2022. These include the scope and the duration of the pandemic, including continued restrictions in China, the extent and the length of the restrictions associated with the pandemic, and the impact on customers, consumer demand and the global economy generally; the ability of CEVA's IPs for smarter connected devices to continue to be strong growth drivers for us; our success in entering new markets and maintaining our market position in existing markets; the ability of new products incorporating our technologies to achieve market acceptance; the speed and extent of the expansion of the 5G and IoT markets; our ability to execute more base station and IoT license agreements; the effect of enhanced industry competition and consolidation; global chip market trends including supply chain issues as a result of COVID-19 and other factors; and our ability to successfully integrate Intrinsix into our business. Revenue for the second quarter came at $33.2 million, up 9% on a year-over-year basis. The licensing environment continues to be strong, delivering $22.1 million in quarterly revenue at the back of '22 licensing agreement with customers targeting a multitude of wirelessly connected devices, AI-driven sensor, satellite communication and more. Revenue for the second quarter was $33.2 million, up 9% compared to $30.5 million for the same quarter last year. Licensing, NRE related revenue was $22.1 million, reflecting 67% of our total revenue, up 42% as compared to $15.5 million in the second quarter of 2021. Royalty revenue was $11.1 million, reflecting 33% of our total revenues, down 26% from $14.9 million in the second quarter of 2021. After carving out the $3.3 million, royalty revenue for the second quarter of 2022 was down only 4% versus the second quarter of 2021. Base station and IoT royalty revenue contributed $7 million in the quarter, flattish from the first quarter and up 6% year-over-year despite the impact of the lockdown in major cities in China on some of our Chinese customers and the overall challenging macroeconomic environment. Our total operating expenses for the second quarter were $26.6 million, below the low end of our guidance of $27.1 million and the first quarter expenses of $27.5 million, mainly due to improved FX environment and the timing of the Israel Innovation Authority grants received in the second quarter. Our total operating expenses for the second quarter, excluding equity-based compensation, amortization of intangibles, were $22.6 million, also below the low end of our guidance of $23 million and the first quarter expenses of $23.4 million due to the same reason I just stated. GAAP other income included $0.5 million net loss from the remeasurement of a marketable security associated with Cigna following EyeSight Technologies, a leading provider in in-cabin sensing solution in the automotive industry that went public on the Tel Aviv Stock Exchange in the fourth quarter of 2021. SiP units by CEVA's licensees during the second quarter of 2022 were 433 million units, down 18% sequentially and down 4% for the second quarter of 2021 reported shipments. Of the 433 million units shipped, 83 million units or 19% were for handset baseband chips, reflecting a sequential decrease of 17% from 100 million units of handset baseband chips shipped during the first quarter of 2022 and a 40% decrease from 138 million units shipped year-over-year. Our base station and IoT product shipments were $349 million in the quarter, down 19% sequentially and up 11% year-over-year. Our DSO for the second quarter was slightly higher than the last 2 quarters due to the lockdown in China that caused slower collections and came in at 42 days for the quarter compared to 32 days in the prior one During the second quarter, we used $8.1 million of cash from operations. Net interest income is expected to be approximately $0.4 million and the taxes for the third quarter are expected to be similar to the first quarter, approximately 25% to 27% of non-GAAP tax rate or about $1.7 million. But when we added Intrinsix and added both NRE services and the co-creation of licensing both and offering both IPs and services and designs of chips or blocks, it obviously took our margins down from the 90s that we were for many years to the low 80s, anywhere between 80% to 84ish type, 85%, that's where we are in the sweet spot in our understanding of the existing market, and until new royalty payers will come in from that new business model."
}