{
    "symbol": "TTM",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-25 13:20:06",
    "content": " Next slide, if you would, please. Next slide, if you would, please. Next slide, if you would, please. But our fulfilled orders, our retails will start to grow now, we're already seeing that in Q4 in part because of the opening up of China, but I do anticipate in quarter four fulfilled orders to be above new orders and therefore, our order banks to start to taper down towards a level which is more natural maybe towards the 200,000 level over the next three to four months, most of them as we've said before in those three nameplates Range Rover, Range Rover Sport and Defender. Within the segments, I think medium and heavy commercial vehicles have seen a very good growth, almost 50% growth over Q3 of last year, again due to the base effect and even higher growth in the passenger, the passenger segment is back. We'll probably, won't be talking about it by the way, but it's wrapped up within that 200 plus million a month, including some more on utilities lower than it was and including the wage the wage demands that, which hopefully will come down with the interest rate pressures that going to be pull out.0 From an SG&A perspective, we will increase spend, but revenue will increase as well. Yes, on the refinancing, so I think the default or base plan is that we had an expectation of circa Â£750 million, Â£800 million of cash flow in the second half which Adrian already talked about and that would be sufficient to cover on the two bonds we have maturing in February and March for Â£800 million equivalent and it's probably also worth mentioning that in June of this year, we had a Â£600 million equivalent on China bank loan due to mature. We don't see any risk at this point in time or any evidence of this until weakened prices for any of our imported, was in fact, the VME reference back to the previous question, the average VME last quarter, which will be the first sign of that of course, the average VME last quarter was as low as 0.8% across all units imported into China."
}