{
    "symbol": "TTM",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-09 17:57:10",
    "content": " So what youâ\u0080\u0099re seeing there is, both an increase in volume and a substantial increase in mix of volume as a result of our Range Rover and Range Rover Sport vehicles now being presented to the marketplace, thatâ\u0080\u0099s driven an EBIT positive in the quarter for the first time in those comparative two quarters, substantial improvement of more than 5 percentage points. Let me remind you, when I talked to you in July, I was referencing 1,000 units per week, thatâ\u0080\u0099s a substantial increase there, a refocus program continues to be value-generative, GBP 300 million in the quarter, GBP 550 million in the first half of the year, and their liquidity is strong GBP 3.7 billion cash plus the revolving credit facility GBP 5.2 billion in total. We are also gearing up not just operations, but also supply chain for the new set of orders that we have on electric buses also, this is â\u0080\u0093 Iâ\u0080\u0099m referring to the CESL phase one tender, which we had won for around 3,600 numbers is a â\u0080\u0093 thereâ\u0080\u0099s a bit of a change in that likely to happen, but otherwise, we are gearing up for start off supply of these buses from Q1 of next year. Back to you, Balaji. Back to you, Balaji. And therefore, you may see a change as a counterweight to that I think Iâ\u0080\u0099ve already answered, we are going to start to lift some of those costs and some of those expenditures and, of course you know the inflationary pressures in the second half of the year, particularly on employee settlements will start to come in place to lift the cost as well. Weâ\u0080\u0099re seeing cost increases flowing through, of course, you know just to give you a sense of that base energy builds around GBP 200 million a year and therefore, no, thatâ\u0080\u0099s certainly increasing, itâ\u0080\u0099s in part in their first half year."
}