{
    "symbol": "DOCS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-08 21:01:04",
    "content": " As a result, we are raising our annual guidance by 4% to a midpoint of $339.4 million for fiscal 2022 ending March 31, which translates to 64% growth year-on-year with a net revenue retention rate of 171%. Okay, time now to turn to today's announcement that we're acquiring amion.com, a leading physician on-call scheduling site for $53.5 million dollars in cash, plus up to $29 million in earn-outs and equity compensation over the next four years. Excluding Amion, we expect revenue growth in fiscal 2023 to be about 33% to approximately $450 million, which is ahead of expectations after two straight years of very high top line growth. One thing we've seen in this past quarter, and you'll see this in our 10-Q tomorrow is our care heroes business really has been accelerating enough in the past several quarters and it will be reached over 90% growth in Q3, which is something that we're super proud of, I mean we're really optimistic about the future here. Your line is open. Your line is open. Your line is open. But what this has really allowed us to provide even further value to our customers and it helped translate into strong annual buying cycle, where we are working with our clients to really smoothly fold those growing budget dollars into their new programs that we're currently in the process of launching and will run over calendar year 2022, and that's going to convert to revenue at a more even pace. And we're really proud of the fact that we're already at that level and we're well above that level today and we really want to focus on continuing to make prudent investments, focus on continuing to grow our R&D team to support our products to make our products even better for our physicians, continuing to grow our customer success team to support the future growth of our customers and you're going to see us doing that in the next couple of years. Your line is open. Your line is open. Your line is open. Your line is open."
}