{
    "symbol": "DOCS",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-09 20:36:13",
    "content": " Hello, and welcome to Doximity's Fiscal 2022 Second Quarter Earnings Call. A complete disclosure of our results can be found in our press release issued earlier today as well as in our related Form 8-K, all of which are available on our website at investors.doximity.com. As a reminder, today's call is being recorded, and a replay will be available on our website. These statements are based on management's current views, expectations and assumptions and are subject to various risks and uncertainties. Please refer to the risk factors in our S-1, our last quarterly report on Form 10-Q and our other reports and filings with the SEC that may be filed from time to time, including our upcoming filing on Form 10-Q. Our forward-looking statements are based on assumptions that we believe to be reasonable as of today's date, November 9, 2021. Of note, it is Doximity's policy to neither reiterate nor adjust the financial guidance provided on today's call unless it is also done through a public disclosure such as a press release or through the filing of a Form 8-K.  Today, we will discuss certain non-GAAP metrics that we believe aid in the understanding of our financial results. Finally, during the call, we may offer other incremental metrics to provide greater insight into the dynamics of our business. Thanks, Perry, and thank you, everyone, for joining our second quarter earnings call. I'm pleased to report that we delivered $79.4 million in revenue for the second quarter of our fiscal 2022, an increase of 76% over the same quarter last year and 8% above the midpoint of our guidance. We're also raising our annual guidance by 10% to a midpoint of $327.1 million for fiscal 2022, which translates to 58% growth year-on-year. We posted an adjusted EBITDA margin of 41% last quarter or $32.8 million, which was 22% above the midpoint of our guidance. Our vertical sales model continues to deliver strong incremental margins, allowing us to scale efficiently as the strong ROI we deliver for our clients generates low friction upsells. Last but not least, our network continues to grow as hybrid home office work schedules become the new norm for many doctors, we're proud that our mobile workflow tools have been able to help. Our e-signature and fax product usage continued at our Q1 record highs, and we expanded our paid telehealth platform to an additional 50,000 physicians last quarter. Our active telehealth users reached a record high with over 330,000 unique physicians, NPs, PAs and medical students completing a telehealth visit with us in the quarter. For the past decade, it's been our mission at Doximity to help physicians be more productive to provide the best care for their patients. Today, over 80% of all U.S. physicians are members of our platform, using it to video call their patients, sign important paperwork remotely and keep up with medical news. Our interactive platform allows top hospitals and pharmaceutical companies the best brands in medicine to connect efficiently with the right physicians about new treatments, clinical trials and patient referrals. At a high level, there were 2 primary drivers of our growth this past quarter. Of note, this quarter's ROI results were up from our historical median of 10:1 for pharma and 13:1 for hospitals as reported in our S-1. Our clients generally target a 2 to 3x return on their marketing investment, so they're pretty pleased with us at a 14 to 17x return. These existing clients then reinvest with us by adding new brands, modules, audience, months of coverage or all of the above. As a reminder, U.S. health care spent just 28% of its 2020 advertising budgets on digital channels for IDC. That's less than half to 63% share other U.S. industries spent on digital over the same period, pre-marketer. For a recent Accenture study, only 10% of U.S. physicians want to return to the pre-pandemic methods of marketing. More and more, they're closing their doors to sales reps, coming in industry parlance say, \"No see doctor.\" Back in 2008, roughly 1/4 or 23% of all U.S. oncologists were no see. Today, that's grown to 79% or nearly 4 out of 5 oncologists as no see. Across all U.S. physicians, 3 out of 5 are now no see per ZS-Access monitor, an industry report. We believe digital will become the primary channel for industry dialogue, but you'd be amazed at how much is still spent on mail and magazines to these doctors today. Finally, since a few of you have asked us about iOS 14, I'd like to clarify that 0% of our revenue is or ever was based on cookie technologies. In terms of revenue sustainability, we believe we're in the early innings of a decade-long secular shift to digital. Physicians have fundamentally changed the ways that they interact with the industry, and we're leading the way in digitizing these workflows. This quarter, we signed a 6-year extension and expansion of our U.S. news partnership. Second, we're pleased to announce a new partnership with Press Ganey. As many of you know, Press Ganey is the market leader in measuring patient experience, working with over 41,000 health care facilities to complete over 26 million patient surveys so far this year. For example, we found that when doctors used our professional name badge in their video visits, a bottom of screen overlay which shows the doctor's name, credentials, specialty and logo, a bit like a TV news anchor, then their patient quality scores went up by, on average, half a star on a 5-star scale. As a company, we'll continue to develop partnerships, which create win-wins for our physicians and clients. Alongside existing partners like UpToDate, Epic and U.S. News, we're pleased to add Press Ganey this quarter. Second quarter revenue grew 76% year-over-year to $79.4 million, solidly exceeding the high end of our guidance range. This top line result was driven primarily by expansion within our existing customers as they continue to deepen their digital partnerships with us, exemplified by strong upsell success and quicker program launches throughout the quarter. First, we continue to see expansion in the average number of brands and modules per existing customer, which grew 19% and 18%, respectively, versus the prior year period. Second, these customers are also growing their spend through additional upsell vectors, such as increasing audience sizes and extending their programs. As a result of these factors, our net revenue retention rate continued to climb in Q2, reaching a record 173% on a trailing 12-month basis. We ended the quarter with 235 customers contributing at least $100,000 in subscription-based revenue on a trailing 12-month basis, a 53% increase from the 154 customers we had in this cohort a year ago. Similar to last quarter, this increase was split fairly evenly between existing customers that we upsold and new customers to our platform. Also of note, for the first time ever, the average spend per customer in this cohort surpassed $1 million on a trailing 12-month basis. While the majority of our top line growth came from expansion within existing customers, we are also encouraged by the new adoption of our solutions amongst longer-tail pharmaceutical manufacturers and health systems. In addition, we are continuing to attract other customer types like medical device and diagnostic companies, and notably added another 7-figure customer in these newer markets in Q2. Just as we improved with our current customers, we anticipate we'll be able to deliver significant value for these new customers over time which will lead to future cross-sell and upsell opportunities. Turning to our profitability, non-GAAP gross margin in the second quarter was 90% compared to 84% in the prior year period. Going forward, we will continue to invest heavily in our customer success teams, which make up the largest line item in our cost of revenue and have been a key facilitator of this top line strength. Adjusted EBITDA for the second quarter was $32.8 million, and adjusted EBITDA margin was 41% compared to $12.6 million and a 28% margin in the second quarter last year. We ended the second quarter with $742.7 million of cash, cash equivalents and marketable securities. As you consider our free cash flow for this quarter, one thing to note is, historically, the summer months have been the slowest for us from a cash collection perspective as our customers take time off. For the third fiscal quarter of 2022, we expect revenue in the range of $85.8 million to $86.8 million, representing 47% growth at the midpoint. And we expect adjusted EBITDA in the range of $32 million to $33 million, representing a 38% adjusted EBITDA margin. For the full fiscal year 2022, we now expect revenue in the range of $326.1 million to $328.1 million, representing 58% growth at the midpoint. We now expect adjusted EBITDA in the range of $127.6 million to $129.6 million, representing a 39% adjusted EBITDA margin. First, despite some return to in-person marketing activities, the level at which our customers are spending on our high ROI digital platform remains elevated compared with what we initially anticipated at this point in the year. In addition, our customers continue to launch new programs at a faster pace while also adding on to existing programs, which is yielding quicker revenue conversion for us. In summary, we're excited by the momentum in our business, led by the rapid growth amongst our existing customer base. If we look at our largest opportunity and take the top brands at our existing pharmaceutical customers, we estimate that we remain less than 5% penetrated into their U.S. medical professional marketing budgets, and we believe we are uniquely advantaged to gain market share as these budgets continue to shift digital over time. So can you dive into a little bit more detail there on what you think is driving that uptick specifically with pharma, which was a very significant uptick in the ROI from where you've been trending. And yes, it's a great question. I think so just to recap for folks, back in the roadshow for our IPO a few months back, we were very proud to have a 10x return on investment for pharmaceutical clients as a median. And so this trailing 12 months, it's still only at 1 in 14 of those cards that sponsored. So we think we still have a lot of room to grow there before anything becomes noticeable or annoying or in any way, harms, I'd say, the overall health of the network. So I think our pharma clients are just seeing the doctors are paying more attention to us, especially in a world where they're getting together maybe at fewer live conferences and dinners. It's grown to levels much, much higher than our pre-pandemic levels. If we think of maybe one megatrend, we're hearing from all our provider groups as we go across the earnings season, it's workforce burnout, it's turnover, it's challenges in recruiting. And it seems like your platform is well positioned to help with all of those, whether it's workforce improvements in the productivity front, certainly, you have a recruiting platform for hospitals. So on burn out we have had a number of good discussions with health systems and certainly as a physician-centric organization, it's something we care a lot about. We've asked these health care heroes to be heroes for a very long time right now, and it's difficult for everybody. Mayo Clinic has done some things where just getting together with peers that you haven't seen for a while, that maybe you were in the trenches with in residency to have a nice dinner could be very reenergizing for docs. So we're looking at some, I'd say, somewhat simple, but hopefully powerful ways there to help doctors recharge during this incredible pandemic in period. As you recall, about a year ago at the start of the pandemic, we decided to offer more of a white-glove service to our clients and offer them not just our talent finder software tool, but also services to help them actually credential and schedule and actually bring in those physicians. So we acquired a firm in Dallas, it's called Curative. And you'll see that, that business grew 31% year-on-year this past quarter, which is accelerating growth for us. They would rather be talking with us and doing their scheduling, credentialing online directly with the doctors instead of with all this back office that now seems outdated. So first, I'll say, we don't talk about daily active users with our clients. Really, we're focused on delivering them return on investment. And at the end of the day, we're a partner, a marketing partner over these year-long subscription programs to help them get lift. But DAUs, it's really more of an impression kind of model. And again, it's more about finding the referrals and the connections. That said, I know there have been some reports that have been circulating about our overall usage, which is an important long-term metric being flat from pre-pandemic levels. Internally, we split our 3 product teams across 3 different teams that we individually measure called news, network and comms or communications. So some less than 100,000 quarterly active physician callers pre-pandemic to a record of 330,000 physicians, MPs and PAs last quarter. And we're focused on that metric because we've seen that actually heavy telehealth users also tend to be high prescribers and referrers since they hail from specialties like oncology, endocrinology and cardiology, which are particularly good for doing telehealth, quick follow-up visits to help patients titrate their meds. We're proud to have added 50,000 new physicians to our paid telehealth platform this past quarter. And we're going to keep holding our feet to the fire to deliver -- to continue to grow our market share, grow our footprint there of our telehealth platform, which again hit record highs this past quarter. I get that you're being prudent about reopen assumptions, something you can give us more granularity around just puts and takes of the detail and what's factored in, what's not. So I'll start by saying that the shift to digital that we're seeing is certainly a fluid situation, and the market landscape is constantly evolving. Now that said, our pipeline remains robust, and that's reflected in our second half guidance. And then more importantly, what I would focus on and what I would turn your attention to is that we're focusing on building a company that yields long-term sustainable growth. Jeff, on your extension and expansion with U.S. News, now that you're the only source of voting for physicians, what are your expectations around kind of the health system spend as it relates to kind of improving their own standing within those ratings? So it's becoming more and more helpful for patients to find the best care, but the care that's also local to them. It's the top several hundred now, which is terrific. In terms of working with them, I'd say that certainly, hospitals care a lot about what doctors think of them. And we're proud that we've got the statistical coverage for their rigorous analysis to be able to be -- affect the voting booth, the polling booth for covering every geography and every specialty and pulling that together. And the no-see doctors, I'm pleased to hear you following some of these tactics at the mail and magazine's legacy. It's our job to be your marketing partner to deliver your results, not through other lenses. And we understand that delivering good ROI means that they should be willing to pay us more, but it's part of our ongoing partnership. I was wondering, Jeff, can you go into the Press Ganey partnership a little bit more in terms of how you're working with them. So we're excited to cross-sell, frankly, with Press Ganey's access and get more health systems moving on to our telehealth platform. And making it very easy to take this process today that takes usually a couple of days for Press Ganey to call out to the patient and do a survey afterwards, sometimes a little longer and really make that real time. And yes, that will help us grow our health system footprint with our telehealth business. Now that all said, our telehealth business is a small single-digit percentage of our overall revenue right now. So while we expect that can be much, much larger in the future, it's not like we're leaning on this Press Ganey partnership to deliver cross-sells that we need to make our next quarter. That's two quarters in a row, it's sort of been called out as a new initiative, and making some progress there. So first, I just do want to start by saying and reiterating that our message here remains the same as last quarter. And I think the example I gave where we remain less than 5% penetrated into our pharma customers, medical, professional marketing budget is really the perfect proof point for why. Now that said, as you just mentioned, there's also a shift to digital underway in other under-indexed industries, such as med device and diagnostics. With regards to your question specifically around the separate sales force, as of right now, we're able to really utilize our existing sales force, and utilize also our existing modules, which I think is pretty unique to cross-sell to this new industry. But I do want to just reemphasize once again, we don't really expect these newer markets to represent more than a single-digit percentage of our revenue. And so in the near term, we're much more focused on really penetrating our core pharma and health system clients. I have to say I've been surprised that historically, medical devices and specifically have been incredibly sales force focused. And to see them stepping up and paying 7 figures, and coming to us in some cases, it's been gratifying. But in terms of having ways to monetize them, it's been a little harder because again, the medical device firms weren't really into digital marketing. And now that they are, I think that opens up a whole new avenue for us to leverage some of these surgeon relationships that we have that are among our strongest. And then as the author of some of these spooky engagement reports, I'm curious if the data from third-party providers is erroneous, unfounded, inaccurate or whatever, then where would you suggest investors or analysts go to source some of the engagement statistics that might not matter on a short-term basis, but certainly might matter in terms of the health of the network in the long term. And certainly, your report did lead to a lot of, I think, productive constructive discussion on our end. I'd say the biggest issue -- a lot of these third-party trackers are based on free VPN software, which largely hospitals and doctors no one uses. I think the one you did use is based more on app tracking, which Apple's made really hard to track other apps. So Android is a little friendlier, but doctors from our coverage in study, and I think we would know as well as anyone, doctors are 85% iOS or iPhone, only about 15% Android. If anything, I will say, looking at some of the data that we've seen out there, it's interesting, it's picking up some of those health care workers that we opened up to at the start of the pandemic. You may recall at the beginning of the pandemic, we offered a free year of telehealth to all health care workers in the U.S. because we just want to do our small part to help out. Of course, they're missing all the web users, which is a big chunk of what we do, too. Those are largely survey based, but that's where our clients tend to use in addition to just our own actual reports that we provide back to clients after each program. But there's -- yes, unfortunately, not a good sort of -- yes, a Nielsen sort of the space. The implied growth for the March quarter is around 33%, which suggests it's getting closer to kind of your more normalized view of 30% net revenue retention. So when we talk about our net revenue retention, I want to kind of think about that a little bit separately than we think about quarter's year-over-year growth. So if you think about the lens of, it was 85% this past quarter. Now as our TTM growth rate normalizes, which we are predicting to happen in the future, our net revenue retention rate will normalize as well. And so while we once again are kind of not guiding to what this NRR metric will be, we do think it will track pretty closely with our overall trailing 12-month growth rate. And in the medium term, we believe our baseline, which is where we landed in the pre-pandemic years of that range of 130%-plus is likely what we'll see. And once again, that's still very strong NRR. And I'll just add, if you look at our quarter that we just had, the EBITDA beat was entirely driven by our revenue outperformance. And I think we've earned good stripes as just being a company that knows how to manage that hybrid work lifestyle well, and that's allowed us to recruit from a pretty broad base. I think Anna can speak to the contribution, which, again, I think was small, 3% or 4% of our revenue. I think we're really just spreading -- the word is spreading inside the enterprises that have adopted us, and we're becoming the favorite the go-to, the first place that they pick up to go initiate that visit. I'll just add, Sean, since I know you're a student of the game and of the industry here. Is it really appropriate for certain types of urgent care or emergent care visits, given that when the patient presents with a whole host of things, are they getting the highest quality care if it is telehealth and I can't get a full sense of the patient. So a lot of our clients are making the argument that having a pre-existing client relationship is important, I think, for successful telehealth. And again, what we see that it's been really successful and received high patient scores and doctor scores for those follow-up visits with the diabetic patient who would have otherwise had to travel for 1.5 hours in and 1.5 hours back and sit in a waiting room for a half hour, all to have a 10-minute visit to ask how it's going and titrate their meds. I think as evidenced by our user metrics among clinicians, over 330,000 in the last quarter. There's a great network effect here with the rest of our platform, such as checking the news feed between visits. And again, I'd like to thank the entire Doximity team for their incredible dedication and results this past quarter."
}