{
    "symbol": "PYCR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-07 13:14:02",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to Paycor’s Third Quarter Fiscal Year 2022 Earnings Call. Good afternoon, and welcome to Paycor’s earnings call for the third quarter of fiscal year 2022 which ended on March 31. On the call with me today are Raul Villar, Jr., Paycor’s Chief Executive Officer; and Adam Ante, Paycor’s Chief Financial Officer. Today’s call is being recorded, and a replay will be available on our website following the conclusion of the call. Statements made on this call may include forward-looking statements related to our financial results, products, customer demand, operations, and the impact of COVID-19 on our business and other matters. These statements are subject to risks, uncertainties, and assumptions and are based on management’s current expectations as of today and may not be updated in the future. With that, I’ll turn the call over to Raul. Thank you, Rachel, and thank you all for joining us to discuss Paycor’s fiscal third quarter results. We delivered robust revenue growth, up 23% year-over-year, driven by continued client growth. Total revenue was a record $123 million, exceeding the top end of our guidance by 4%. This sustained momentum gives us confidence to once again raise our full year revenue and profitability guidance, which Adam will describe in more detail. Labor market dynamics, such as the Great Resignation and increased regulatory complexity, continue to drive strong demand for modern cloud-based human capital management solutions. Paycor’s open, extensible platform is purpose-built for leaders and configured by industry, and that differentiation continues to win in the market. Our modern SaaS HCM solution automates routine management tasks so frontline leaders can focus on the key elements that drive business performance and employee engagement, such as goal setting, coaching, and talent development. Furthermore, our vertical program resonates with clients as we align human capital management with their industry and provide industry-specific product differentiation, client experience, and community. During the quarter, we continued to make progress against all four strategic growth initiatives that we believe will enable us to deliver long-term sustainable growth. First, our sales teams continued to successfully expand into Tier 1 markets, which we define as the 15 largest cities in America. We are on track to expand seller headcount by 20%-plus this year, which we believe is impressive given the tight and competitive labor market. When we revamped our sales strategy in 2020, we focused our playbook on brokers and established partnerships with five national firms that account for about a quarter of our broker revenue today with significant expansion opportunity. We have supplemented our broker value proposition of benefits administration, platform flexibility, and guided implementation with a portal that provides our partners with thought leadership and co-branded marketing designed to cultivate mutual business expansion. Third, our industry-specific approach is one of the top reasons clients choose Paycor. By understanding the requirements of healthcare, manufacturing, food and beverage, and professional services, we have developed tailored solutions that help solve the most pressing human capital challenges for these industries. Our industry program empowers leaders to develop winning teams through product differentiation, client experience, and community. Our manufacturing customer experience starts with industry-skilled implementation experts and targeted training content, such as how to set up shift differentials, how blended overtime works, and adding a union code, which further enhance our industry client experience. Lastly, we continue to enhance our industry-leading functionality by expanding the breadth and depth of our HCM suite and have increased our PEPM to $42. Our modern software has a seamless user experience, an extensible platform that enables us to rapidly add capabilities and integrate additional partners. This quarter, we released an innovative developer portal to enhance our interoperability, making it even easier for clients and partners to seamlessly integrate and sync data between Paycor and critical third-party tools. While the developer portal is beneficial to all clients, it is especially relevant for our four verticals since they tend to have greater integration needs. In addition, this quarter, we partnered with Equifax to provide automated employment and income verification services to clients at no cost, further reducing leaders’ administrative burden so they can focus on what matters: developing their associates. Furthermore, we recently launched Expense Management, enabling leaders to easily reimburse employee expenses, utilizing the same unified Paycor platform used to pay, hire, onboard, manage, grow, and recognize talent. By streamlining time-consuming and manual tasks like expense management, we empower leaders to invest more time and resources into developing their teams. As a testament to our ongoing product development, we are proud that Nucleus Research highlighted Paycor’s ability to deliver rapid time-to-value for its clients. This year, we improved significantly in usability, which reflects the investments we continue to make to enhance our platform. Calendar year-end is our busiest period, and I would like to thank all Paycor associates for their commitment to our client experience and delivering our strongest year-end on record. Over the last two years, we have made focused investments in technology and resources to enhance our client experience, and we are starting to see the impact. This is the first full quarter our chat tool has been live, and we handled about 10% of our support volume through this new channel. And as a result of these enhancements, we had an 80% improvement year over year in client wait times during the second and third quarters. The best acknowledgment we get about these enhancements is directly from our clients, but we are also excited to share that our Tax Advanced Support Team was recognized for their outstanding customer service with a bronze Stevie Award this quarter. With that, I’ll turn the call over to Adam to discuss our financial results and guidance. Total revenue was $123 million, with 23% recurring revenue growth year-over-year, our fastest recurring revenue growth in more than five years. The year-over-year growth was largely driven by processing employee growth in the low teens and continued high single-digit percentage PEPM expansion, resulting in us exceeding the top end of our revenue guidance by 4% and our adjusted operating income guidance by more than 20%. By quarter end, our customer base had increased 6% year-over-year to nearly 30,000 clients. Consistent with our go-to-market strategy, our target segment of 10 to 1,000 employees is showing accelerating growth close to 10%, and we are demonstrating outsized growth in the 100-plus segment. In contrast, the micro segment of under 10 employees continues to contribute single-digit percentage of revenue while representing nearly 40% of our clients. Overall, the labor market is still below pre-COVID levels, and organic labor market growth remains in the low single digits, consistent with historical averages. Our average customer size has increased to just under 75 employees per customer, an increase of about 10% year-over-year as we continue to shift away from that micro segment and accelerate growth among clients with more than 100 employees. Adjusted gross profit margin was 69%, down slightly from 70.7% a year ago and consistent with our expectations. This change is largely due to increased amortization related to capitalized software and contract acquisition costs, as well as continued investments in our service organization to ensure a great client experience. Taking into consideration the significant amortization associated with our Apax acquisition and recapitalization, adjusted gross margin, excluding depreciation and amortization, was 78% for the quarter, an increase of 13 basis points year-over-year. In both profitability metrics, we have delivered sequential margin improvements for the last three quarters as we continue to scale the business. In line with our aggressive go-to-market strategy, we continue to expand our sales teams and marketing programs, especially in Tier 1 markets. Since this massive market is still in the early stages of transitioning to the cloud and we are consistently generating strong returns on our investments, we will continue to invest to capture market share and drive meaningful value for shareholders. And including capitalized development costs of $8 million, we invested $16 million in R&D or 13% of revenue, similar to the year-ago period and in line with our expectations. Our team continues to build new capabilities that expand our product portfolio and PEPM opportunity, delivering insights for leaders to develop their teams and improve their business. G&A expense was $18 million or 15% of revenue, consistent with the third quarter of 2021. However, our goal is to continue to drive G&A down as a percentage of revenue, and we have done so for three consecutive quarters. Overall, we are driving G&A leverage year-over-year as we anniversary public company expenses and manage strategic investments. This quarter, as we fully embraced our virtual-first model, we recognized a $9 million loss from exiting certain facilities leases. We increased our cash balance by over $20 million, ending the quarter with $134 million in cash and no debt. This quarter, we generated interest income of approximately $410,000 on average client funds of just over $1 billion. Overnight interest rates remain the primary driver of our interest income, and we have yet to see an impact to the rates banks are willing to pay. For the full year, we are raising our revenue guidance to between $421 million to $422 million, or about 20% growth year-over-year at the top end of our range. Following this seasonal peak, we expect our fourth quarter revenue to decline sequentially without the benefit of those year-end revenues. Employment growth has remained steady in that low single digits and as such, we expect marginal benefit from continued labor market growth. And while interest rates continue to rise, we expect little impact to our fiscal year 2022 guidance. To wrap up, we’re pleased with the execution of our go-to-market strategy, expansion of our HCM suite, and early success of our customer experience investments. Our unique focus on leaders and industries continues to meaningfully resonate in our mid-market customers, and we remain excited about our ability to capture market share while improving profitability longer term. And with that, we’ll open the call for questions. So I know last quarter you mentioned that over 90% of client funds are in overnights, and based on your commentary, it sounds like that’s still true. No, it hasn’t really changed. Again, the biggest impact of the overall interest income is going to be the – it’s still going to be the overnight rates. Raul, as you think about your M&A strategy, I know historically it’s been focused on smaller deals. We have historically been focused on small tuck-in acquisitions that would enable us to leverage our vast distribution and sell a broader bundle, and that’s what we’ve been focused on. No, I mean, we focused – the last couple of acquisitions really been advanced scheduling, applicant tracking, and just finding that world-class technology. And then like Raul had mentioned, it’s getting out through our distribution. Yes, with the portal, it’s really indirect monetization. But for us, it’s been about client experience and winning more clients because we have the most open modern platform in HCM. First question I had is just maybe for you, Raul, kind of macro question around recessionary pressures, inflationary pressures. Because I think last quarter, you said healthcare was kind of coming back, and I think you just launched pro services. But no, from a macro perspective, we haven’t seen a big impact on recession or inflation to date. The overall market demand metrics have remained stable throughout the year, so we haven’t seen anything there. Obviously, any of the markets that we deal in that have had more COVID pressures, we experienced that when they close the market or open the market throughout the year. But outside of that, we haven’t seen anything overall in the segment from a demand perspective or delaying decisions based on inflation or a recession. It’s just – this is one of the first products, I think, you have launched kind of net new since you’ve gone public, Expense Management. It’s not just additional products like this, but it’s definitely part of the overall model as we continue to grow that. In terms of demand, I mean, the way that we’ve seen demand work through the year is that the fundamentals of the business continue to remain strong. We see that demand gen continues to be strong for us, and we see that really across our markets as we continue to expand into those Tier 1 markets across industries and our brokers. Those key strategies that we’re driving toward, we continue to see positive momentum. And we’ve been driving toward this 20 to 20-plus in headcount growth for the full year, and we’re still on pace to hit that for the full year, so with the majority of those headcount going into the new markets. And that was my follow-up question actually, just in terms of just that Tier 1 hiring. I mean as we think about adding as many sellers in this year as we are, we’re definitely expecting that the overall productivity on a per seller basis is going to decline slightly relative to the overall portfolio. And so, I’d say it’s still early for the cohort as they’ve come in. But we continue to see the opportunity and the performance across these key measures, including average deal size and the size of the new – the size of the deals that we’re actually selling in and the size of those clients, win rate. Yes, and one thing to interject is when we think about that seller cohort, we really expect them to get to their full ramp by the end of their second year. And as Adam said, we continue to execute against the core levers of growth that we’ve outlined, which is really adding new sellers into Tier 1 markets. We’re on pace to achieve 20-plus percent growth in seller headcount, continuing to leverage the broker channel to win at an outsized rate and leverage industry to be a big differentiator in the marketplace. And they’re all executing very well, and so we feel good about our momentum in the market. And I’d say those year-end fees aren’t back quite to where they were at pre-COVID levels, but they definitely improved beyond where we were anticipating them here for the quarter. And then we continue to see the upside in the client base in terms of the company growth coming in January, as well as continued PEPM expansion. So just across the board, the performance was really just a little bit tighter, a little bit better. Our other partner revenue would be included in that, and it’s a blended number. I think in terms of our actual pricing strategy, we wouldn’t – there are some of those partnerships that we wouldn’t necessarily price to the client. So, it’s a little bit of a mix in terms of how we think about our go-to-market and the overall $42 PEPM suite that we offer, as well as expanding the additional suite of services from partners, specifically like Equifax, creates some additional opportunity. Hey, we’re excited about the growth, and we’ve been really driving toward this 20% sustainable growth. We’ll continue to press in, and we’ll share that guidance in the Q4 close. Yes, we haven’t seen any differences in the market either on who we’re competing with or where we’re winning from. And we take 80% of our wins from the legacy providers, which we define as in-house ADP, Paychex, and regional service bureaus. So that’s been consistent over the past few years, and we haven’t seen any real differences in the go-to-market strategies of any of our competitors. We’re really excited about talent management, and we’re seeing our highest attach rate of any new product. And we’re seeing in the mid-market space upwards of 35% attachment at point-of-sale with talent, and we actually charge for it. And it really demonstrates the value of the product and what we’re trying to accomplish, which is empower leaders to build winning teams. So we’re excited about it, the market is excited about it and we’re going to continue to press in on talent as a differentiator. Raul, I think you had mentioned the strength from the five national partners that now account for about 25% of the partner revenue. Obviously, the five national partners contribute a little over 25% of our overall contribution from the broker channel. And we have over 1,500 partners across the U.S. That we work with, and there’s 14,000-plus opportunities. And it’s really helpful because as we add sellers in the Tier 1 markets, obviously, brokers are located in dense markets, which are akin to our Tier 1 market. We’re excited about the progress we’ve made, and it’s a great channel for Paycor. Yes, I mean, we see wage inflation across the board, I mean, primarily in some of those key roles like development or engineering and implementation, I’d say. But there has been a little bit – I’d say, broadly, it has not impacted or materially impacted our overall business, and it hasn’t impacted our guidance per se. But in fact, it’s – it hasn’t been material just yet. I think the way that I would say it, Mark, is retention is – there’s a really long tail to it. It just takes some more time for it to fully come through, but we’re seeing continued positive trends around the customer experience. So we felt good about coming through the year-end, and you can see it reflected in the overall revenue growth for sure. And it’s about – if you believe in the power of modern APIs, then you believe in the power of a developer portal like we’ve delivered. And so we believe that the most important thing that we can do for our customers is have an open, extensible platform that enables them to manage their business specifically the way they want to. And so being open with the power of the technology that’s available today, without question, is a game changer. Well, I think we see it in our win rates today. And so, as we continue to press in, it supports seller expansion, accelerating bookings, which is driving our accelerated revenue growth. And I think you’re seeing it, and it will continue to drive forward. Obviously, we’re building out a partner ecosystem over the next 12 to 18 months that will continue to help supplement that. So, I think we’re in the early innings, Mark. And so I think what we’re seeing is an expansion of our sales force, so we’re getting more faster in that segment as we’ve expanded significantly over the last few years. And what we’re winning with is a modern HCM platform that has a simple, easy-to-use experience for them. And then the talent component, coupled with industry differentiation, are the reasons why we’re winning. I joined slightly late, please forgive me if you’ve covered any of this. Talent management, which enables us to coach and develop and do one-on-ones and really connect and engage with an employee, is – we’re seeing attach rates between 35% and 40%. We’re also seeing strong attach rates of engagement, whether it be recognition or the ability to chat between each other. And as we think about why customers select Paycor, it’s because we deliver all of these in this unified experience that’s really easy for someone to undertake. And so for us, it’s been a game-changer, very powerful. Yes, I mean, I think – I mean, we had – we got a few wins in the end of the calendar year where clients had to process payroll and we were able to get them started in a week or two. So a lot of those clients may be 5,000 employees and above, which isn’t really where we’re hunting on a day-to-day basis. So, they don’t necessarily come up on a term. It has been our practice to do that annually, and I’m not sure that you’re going to see any significant change in our strategy. And so, we’re going to continue that strategy. Yes, so the way to think about it is they ramp through the first six months, and full productivity comes after the second year. So think about it three months, they start selling and producing and then they increase in productivity throughout the next 21 months."
}