{
    "symbol": "ARHS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 12:28:14",
    "content": " 2022 was another record year for Arhaus as we achieved the milestone of over $1 billion in net revenue, over 50% comp growth for the second consecutive year, and adjusted EBITDA of well over $200 million. Turning to some highlights from the 2022 full year results, net revenue of $1.2 billion was a $432 million increase over 2021 with our showroom channel up 57% and our ecomm channel up 43%, comp growth of 52% and demand comp growth of 14%, net and comprehensive income was up $100 million, and adjusted EBITDA increased by $100 million to $223 million. Key items from our fourth quarter 2022 income statement include: net revenue of $356 million, comp growth of 47% and demand comp growth of 10% on a one-year basis, 27.9% on a two-year stacked basis, and 89.9% on a three-year stacked basis. The fourth quarter net revenue of $356 million and adjusted EBITDA of $74 million resulted in a 700 basis point increase in adjusted EBITDA margin to 21%, demonstrating the fixed cost leverage realized on revenue growth and helping drive our record quarterly earnings and margin. Our full year gross margin increased $195 million to $525 million, driven by our higher net revenue partially offset by higher variable costs related to the increase in net revenue, including product, transportation, and variable rent expense as well as higher credit card fees related to the increased interest rates and demand. Full year 2022 net revenue of $1.2 billion and adjusted EBITDA of $223 million resulted in an 18% adjusted EBITDA margin for the year, an increase of 270 basis points year-over-year. For the full year of 2023, we expect net revenue of $1.24 billion to $1.3 billion, which represents growth of 1% to 6%, comparable growth in the range of negative 4% to positive 1%, net income of $95 million to $110 million, and adjusted EBITDA of $180 million to $195 million. In the second half of 2023, we expect adjusted EBITDA margin to drop approximately 700 to 800 basis points compared to the second half of 2022 primarily from reduced leverage on net revenue declines related to lapping the backlog deliveries in the second half of 2022 and from our growth investments, particularly higher rent or staffing and higher variable compensation from the large number of expected showroom openings and activity, higher year-over-year warehouse expense, and investments in technology systems and omnichannel enhancements that will support our growth. When evaluating new traditional showrooms that average approximately 17,000 square feet, we target minimum net revenue per new showroom of $10 million and an average showroom contribution margin of approximately 32%, each by year three of operations, and with a targeted payback on investment in less than two years. With our smaller new design studio format showrooms that average approximately 5,000 square feet, we target a lower net revenue per new showroom and a higher average showroom contribution margin of approximately 35%, each by year three of operation, also with a targeted payback on investment in under two years. But you know, I think similar to how we approach overall financial spend and being prudent with our cash position and investments, historically prior to today, we had said that five to seven, the annual target was the traditional showrooms, but now we believe holistically looking at every market available to us, we believe five to seven is the right cadence of openings for us, kind of go-forward on an annual basis, so think that the opportunity now is to look and make sure that we are expanding into the right markets and the right locations, so weâ\u0080\u0099ll continue to stick to the five to seven per year and just allocate between traditional and design studios as we evaluate each particular location."
}