{
    "symbol": "ARHS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 09:58:02",
    "content": " Gross margin increased 39% to $98 million in the quarter, driven by our higher net revenue, partially offset by higher product, transportation and variable rent expenses related to the increase in net revenue and credit card fees related to demand. Gross margin as a percent of net revenue decreased 140 basis points to 39.7%, reflecting the expected higher product and transportation costs, as well as higher variable rent expense, partially offset by our ability to leverage our fixed showroom occupancy costs over higher net revenue and leverage on credit card fees related to demand. SG&A expenses increased 27% to $75 million, primarily driven by investments to support the growth of our business, including increased corporate and warehouse expenses as new showrooms open and we expand distribution capacity, as well as public company related costs. Excluding the impact of the prior year derivative expense of $11.5 million, SG&A expenses as a percent of net revenue in the first quarter of 2022 would have increased versus the prior year, driven by the higher corporate and warehouse expenses, as well as public company related costs. Net merchandise inventory was $247 million, an 18% increase from December 31, 2021 as we built inventories in response to strong ongoing client demand and is the value of our inventory increased due to higher freight and product cost. Demand in the second quarter, we’re really pleased with what we're seeing, we have seen it is positive year-over-year and we are seeing some acceleration, but we don't guide to demand and don't want to get into kind of cadence of giving color on that apart from just general. So we're really excited about that and what it means is, we just continue to optimize that onsite experience and then we're starting to see some really positive trends in mobile, which I think that is really exciting anytime you're looking at our digital experience being improvements and conversion and sales on mobile as well. Well, I think I mentioned last time we focused on outdoor products this year as a major collection and expansion that's going to continue throughout this year into next year as well, but we're seeing nice, really nice response to collections between Bender (ph) and upholstery, dining, you name it, all the core product categories that our clients furnishing their homes. And I think just going back to some of the prior questions of our primary focus rather than promotions is that value proposition and so even while we are taking price increases, we're always very conscious to make sure the value and quality and the uniqueness of the product warrants those price increases, so we are focused our attention on very strongly there as well. I think and I don't mean to give you a non-answer here but I think what really works very well for us is the mix and us pulling different levers depending on, like you said which markets we're going in, or what our objectives are, what we're seeing happening within the business obviously  in prior calls, and  prices are going up with all of the privacy elements so that’s affecting some of the efficacy within some digital channels, but we're identifying  channels and opportunities that have proven really effective for us. With regards to the gross margin rate, we don't guide to the gross margin rate, but as you're thinking about that high level as we talked about the price increases and when we will expect to see those flow through, it would be reasonable to assume that there will be benefit from those price increases, starting, as I mentioned in the second and third quarters this year."
}