{
    "symbol": "MSBI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 10:46:03",
    "content": " Despite an increasingly challenging operating environment, we continue to generate improvement in our financial performance as a result of the strategic initiatives we have implemented over the past few years to strengthen our commercial and retail banking teams, increase our focus on higher-growth markets and improve operational efficiencies. This resulted in a stronger quarter with net income of $21.9 million or $0.97 per share, pretax pre-provision earnings of $35.9 million and increases in our ROAA, ROAE and ROATCE relative to the prior quarter as we continue to generate a higher level of performance. Our net interest margin increased 15 basis points in the second quarter on top of the 25 basis point increase in the first quarter as the strong growth in loans resulted in a favorable shift in earning assets, while we also benefited from higher rates on new loan originations. We had $2.8 million in charge-offs in the quarter or 20 basis points of average loans, and we recorded a provision for credit losses on loans of $4.7 million, which was largely related to the growth in total loans and changes in our economic forecast. But with continued loan growth and further expansion in our net interest margin as we benefit from our asset sensitivity, we should continue to see higher levels of revenue, more operating leverage and further increases in pretax pre-provision earnings and returns during the second half of the year. Your line is open. Your line is open. Your line is open. The acquisition side is probably on the lower end of what we're wanting to do, sort of compare this, if you will, to where our commercial banking was two years ago, where we really need to focus on building our sales and business development teams out, energizing our teams with new -- some new leadership and demonstrate to ourselves and to others that we can grow at a higher rate organically and not have the M&A sort of distractions that go on that sort of distract you from those things. Your line is open. Your line is open. Your line is open."
}