{
    "symbol": "APTO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 22:07:09",
    "content": " In the ACTIVATE trial this year, we will enrich certain patient populations to receive monotherapy so that we can collect data to guide our conversations with the FDA to request an accelerated approval path for TUS in patients of high unmet need. In fact, as Dr. Rice mentioned, while we were wrapping up the dose exploration part of the study, we took the prudent step of putting additional patients on the lowest 40 milligram treatment group because of the FDA's project optimist that emphasizes dose exploration during early development of oncology products. Since we lost the 40 milligram dose level late last year, we have achieved two clinical responses in that low dose group, both AML patients with unmutated FLT3, including the most recent harboring a challenging TP53 mutation, one of the most highly adverse somatically mutated genes. The ACTIVATE expansion trial is designed to confirm monotherapy activity to patient enrichment of specific mutation defined AML population, including the TP53-mutant patients, as well as FLT3-mutant patients who have been failed by a prior FLT3 inhibitor, as supported by FDA fast-track designation and a clinically significant response rate to date. As Dr. Rice mentioned, we are including relapse or refractory AML patients with unmated FLT3, what we often call wild-type patients that have other adverse mutations, exploring safety and activity in these patients with Tuspetinib treatment, both as a single agent and in combination with Venetoclax, identifying meaningful activity and other adverse subgroups could lead to other options for accelerated approval. Your line is open. In terms of numbers of patients it's, like I said, it's hard to put an exact number on it, but I would say enrolment has been very good and there certainly will be some, again not breaking too much, maybe tens of patients on the monotherapy arm and hopeful, somewhere between 10 patients and 20 patients on the doublet arm by the time that we read out near the end of the year. Your line is open. We want to make sure that as we go to the FDA, by then, we will have a number of patients that are already on the monotherapy, the APTIVATE trial, make sure that we're doing everything that we should determine if there are additional parameters we need to measure, so that when we go to them with the data later in the year, we'll have everything that we need and hopefully the data will be supportive of going toward a an accelerated approval, whether that's a monotherapy, a doublet, we'll see how those data emerged toward the end of the year and Raf, is there anything else that you wanted to add to that in terms of regulatory? Your line is open. Your line is open. So the ones of interest, I think I mentioned NRAs TP53 FLT3 patients that have exhausted for three inhibitors prior, but there may be others, and it may be combinations of mutations that matter, for example, MPM1 and FLT3 mutations, we've seen a reasonable response rate in that patient population as well. Your line is open."
}