{
    "symbol": "COE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 17:35:02",
    "content": " Hello, everyone, and welcome to the fourth quarter 2022 earnings conference call for 51Talk. As we continue to invest in localization in markets where we see a good population of middle-class families who value education, we expect further penetration into specific markets as well as the identification of new markets to drive growth in the short and the medium term. The combination of tutor and AI will significantly improve user experience and greatly promote personalized education, specifically, adaptive learning or the creation of personalized teaching content and the provision of customized teaching tools for teachers and customized lesson feedback based on students learning situations, among others. Finally, we have continued the trend of positive operating cash flow since May through the third and the fourth quarter, which reflects the strong execution of our sustainable growth strategy. The momentum of our business continues into Q4 as net revenues were $5.1 million, representing 10% sequential growth. Gross billings was $7.5 million, and we will continue on our pathway of sustainable growth and a focus on delivering strong value proposition to our students in the development of the international markets. Q4 operating expenses were $6.2 million, flattish compared to the last quarter. Specifically, this has been driven by Q4 sales and marketing expenses of $4.0 million, a 7% sequential increase from Q3 due to increased branding and localization investments, such as increased local marketing and operations personnel and localized marketing efforts. Q4 product development expenses were $0.4 million, a 31% sequential decrease due to a reduction in research and development projects. Finally, Q4 general and administrative expenses were $1.7 million, a 5% sequential decrease compared to Q3. Overall, Q4 operating loss was $2.2 million, while net loss was $2.0 million, a 29% sequential decrease from Q3. The company's total cash, cash equivalents and time deposits were $23.1 million at the end of the fourth quarter. Looking forward to the first quarter of 2023, we currently expect the net gross billings to be between $8.0 million and $8.2 million. The above outlook is based on our current market conditions and reflects the company's current and preliminary estimates of the market and operating conditions and customer demand, which are all subject to change."
}