{
    "symbol": "EVC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 11:27:02",
    "content": " Net revenue for the third quarter totaled $241 million, up 21% year-over-year. The continued growth of our digital segment, combined with strong political advertising revenue in our television and audio businesses were the main drivers for our third quarter performance. For the 9 months ended September 30, 2022, revenue totaled $659.9 million, up 25% year-over-year. Consolidated adjusted EBITDA totaled $26 million for the third quarter, up 12% year-over-year. Similar to the first two quarters of the year, in the third quarter, we lacked $5.5 million of nonrecurring revenue due to three discontinued Univision affiliations that we had in the prior year same period in our Television segment. Additionally, if we include the $2 million impact of foreign exchange rates during the quarter, adjusted EBITDA on a constant currency basis improved 20% compared to the prior year period. Digital segment revenue represented roughly 78% of consolidated revenue for the third quarter and totaled $188.9 million, up 29% year-over-year. This business delivered solid results for the third quarter with revenue increasing approximately 11% over the prior year period, driven largely by our commercial representation partnerships with Meta and Spotify. In Africa, Entravision 365 Digital revenue in the third quarter increased 151% year-over-year on a pro forma basis. Television revenue was $35.7 million in the third quarter, down 2% compared to the prior year period. Excluding those three affiliate markets, and $6 million in incremental political spend in the third quarter, core television advertising revenue decreased 9%. Following a strong third quarter in which we generated $7.9 million in political ad sales for the company, we now expect full year political ad revenues to be approximately $30 million, up from our prior expectations of $17 million to $19 million for the year. Looking at other ad categories, excluding the three discontinued Univision affiliations, Auto ad revenues were up 3% in the third quarter year-over-year, propelled with a Tier 2 auto segment, which improved by 15% versus the prior year period. Audio revenue totaled approximately $16.5 million for the third quarter, consistent with the prior year period. Excluding incremental political spend of $914,000 in the third quarter of 2022, core audio revenue decreased 6% versus the third quarter of 2021. As Walter discussed, revenue for Q3 2022 totaled $241 million, an increase of 21% from the third quarter of 2021. For our Digital segment, revenue totaled $188.9 million in the third quarter, up 29% year-over-year and up 24% on a pro forma basis as compared to Q3 2021. For our TV segment, total revenue was $35.7 million in the third quarter, down 2% year-over-year. Retransmission consent revenue for the quarter totaled $8.9 million, which was down 2% year-over-year, mainly due to the discontinued Univision affiliates. Lastly, for our Audio segment, revenue totaled $16.5 million in the third quarter, which was flat year-over-year. Operating expenses in the third quarter of 2022 totaled $49.3 million, up 14% from $43.1 million in the prior year period, primarily due to our variable expenses related to revenue growth and increases in salaries. Consolidated adjusted EBITDA totaled $26 million for the third quarter, up 12% from $23.2 million in the prior year period. Given this, if we account for the $2 million impact of foreign exchange rates during the quarter, adjusted EBITDA on a constant currency basis improved 20% compared to the prior year period. Free cash flow, as defined in our earnings release, was $15.4 million compared to $22.4 million in the prior year quarter or a conversion rate of 59% of adjusted EBITDA. Turning to our pacings for the fourth quarter of 2022, as of today, revenue from our digital segment is pacing plus 13% over the prior year."
}