{
    "symbol": "EVC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 22:37:05",
    "content": " Net revenue for the second quarter totaled $221.7 million, up 24% year-over-year. For the six months ended June 30 2022, revenue totaled $418.9 million up 28% year-over-year. What is so impressive about our second quarter EBITDA growth is that we had $5.4 million of non-returning revenue from the prior-year same period, and we still managed to grow EBITDA of 26% in the quarter. Digital segment revenue represented roughly 78% of consolidated revenue in the second quarter and totaled $174.4 million, up 34% year-over-year. Starting in Latin America, Entravision's Cisneros Interactive delivered solid results, with the second quarter with revenue increasing 9% over the prior-year, fueled by our commercial representation partnerships with Meta and Spotify. In Southeast Asia, Entravision MediaDonuts also delivered very strong results with revenue improving for the second quarter 57% year-over-year on a pro forma basis. For the second quarter, Entravision 365 Digital's revenue increased nearly five times that of the prior-year on a pro forma basis. Smadex, our mobile user acquisition programmatic ad tech platform headquartered in Barcelona, Spain, also performed very well during the second quarter, with revenue improving 162% year-over-year. Excluding those three Univision affiliate markets, total television revenue was up 11% year-over-year, excluding those three Univision affiliate markets, and $2.8 million in political spend in the second quarter, core television advertising increased 1%. The auto category continues to face pressures, excluding the three discontinued Univision affiliations, auto ad revenues were down 3% in the second quarter year-over-year. Audio revenue totaled approximately $14.9 million for the second quarter up 6% year-over-year, primarily due to an increase in local advertising revenue, excluding political spend of $620,000. As Walter discussed revenue for Q2 2022 totaled $221.7 million, an increase of 24% from the second quarter of 2021. For our TV segment, total revenue was $32.4 million in the second quarter, down 5% year-over-year, excluding political core advertising revenue was down 20% year-over-year. Retransmission revenue for the quarter totaled $9 million, which was down 3% year-over-year, mainly due to the loss of three Univision affiliates. Lastly, for our audio segment, revenue totaled $14.9 million in the quarter up 6% from the prior year, excluding political core audio revenue was up 2% over Q2 of last year."
}