{
    "symbol": "BVN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 15:19:04",
    "content": " First quarter ‘22 EBITDA from direct operations reached $431.9 million, compared to $39.7 million reported in first quarter ’21, reflecting $300 million resulting from the sale of Buenaventura’s stake in Yanacocha and $45 million from Newmont’s contribution to La Zanja’s future closure costs. First quarter ‘22 EBITDA, including associated company reached $578.7 million compared to $168.8 million in first quarter 2021. First quarter ‘22 exploration at operating units increased to $14 million from $9.3 million in the same period last year, aligned with the company's strategy to focus primarily on exploration. First quarter capital expenditures were $19.9 million, compared to 13 in the same period for 2021. First quarter ‘22 COVID-related expenses were $5.3 million, compared to the $11.7 million reported in the first quarter ’21. 2022 production guidance will be updated in second quarter ‘22 due to a new mine plan in progress for El Brocal, resulting in an expected 1 million to 1.5 million ounce decrease in silver production for the full year 2022. Total revenues during the first quarter were $233 million, which is 27% higher in comparison to the first quarter of 2021. As we mentioned before, our EBITDA from direct operations for the first quarter increased to $432 million in comparison $14 million during the first quarter of last year. Also, our EBITDA including associated company for the first quarter of 2012 reached $579 million in comparison to $163 million for the same period. The CapEx increased to $20 million in the first quarter of ‘22, compared to $13 million in the same quarter last year. Total gold attributable production in the first quarter of 2022 was 49,000 ounces, which is 31% higher than the figure reported the same quarter of the previous year. The silver production of this quarter was 2 million ounces, which shows a decrease of 42% compared to the figure reported on the first quarter of 2021. In the case of lead, equity production was 4,000 metric tonnes in the first quarter of ‘22, which is 3% lower in comparison to the first quarter of 2021. Finally, our copper attributable production for the first quarter of the year was 27,000 metric tonnes, an increase of 13% when we compare with the same period of 2021. The cost applicable to sales for the first quarter of 2022 were as follows: for gold, $1,126 per ounce, which is 30% lower than a year ago; for silver, $15.21 per ounce which is 22% lower than a year ago; for lead, $1,375 per metric tonne, which is 4% higher than a year ago; for copper, $6,631 per metric tonne, which is 19% higher in comparison to the year ago. Regarding the cost, due to this accident, it’s still being assessed, but we believe it will be in the range of $3 million to $4 million of additional expenses on the open pit due to the additional removal of material to shallow the slopes -- the slopes of the wet side of the open pit."
}