{
    "symbol": "KMPH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 19:57:05",
    "content": "  Operator: Good afternoon, and welcome to the KemPharm Second Quarter 2020 Corporate and Financial Results Conference Call. Good afternoon, and thank you for joining our call to discuss KemPharm's second quarter 2022 financial and corporate results. Before we begin, I would like to remind our listeners that remarks made during this call may contain forward-looking statements that involve risks and uncertainties and are subject to changes at any time, including but not limited to, statements about KemPharm's expectations regarding future operating results. For more information regarding forward-looking statements, risks and uncertainties can be found in KemPharm's filings with the SEC, which are available on KemPharm's website under the Investor Relations section. Speaking on today's call will be Travis Mickle, KemPharm's President and CEO; and LaDuane Clifton, CFO. In addition, we are very pleased to have Perry Sternberg President and CEO of Corium Inc. on today's call to provide an update on the commercialization of AZSTARYS. With that it's my pleasure to introduce, Travis. We'll also be providing some product development updates from myself as well as the typical financial update from LaDuane, our CFO. Prior to Corium, Perry served a dual role at Shire as the Head of Commercial for seven therapeutic area business units as well as the Chief Commercial Officer/Head of Neuroscience Division before the acquisition of Shire by Takeda in early 2019. Thank you, Travis for the introduction and for inviting me to provide an update regarding Corium's commercialization of AZSTARYS. I'm pleased to be able to say that over the last few years, Corium has transformed itself from being primarily a contract development and manufacturing organization into an end-to-end pharmaceutical company that develops manufactures and now commercialize innovative CNS products. We have two recently approved CNS products we are commercializing: AZSTARYS, which was approved by the FDA in March 2021 for ADHD; and ADLARITY, a transdermal patch that delivers donepezil, which was approved in March 2022 for dementia of the Alzheimer's type. In terms of AZSTARYS, as I mentioned, it was approved by the FDA in March 2021 for the treatment of ADHD in patients six years of age and older. It is unique when compared to all other ADHD drugs because it contains 70% serdexmethylphenidate, which is a novel prodrug of d-methylphenidate; and 30% of d-methylphenidate resulting in immediate and sustained benefit throughout the day. We have been very strategic in our approach to launching AZSTARYS, applying what we've learned with other product launches with the initial launch in 2021 and early 2022, focusing on geographies with product coverage and we grew the field force to align with our coverage wins. And as a result, as of July of this year, we now have a national footprint with approximately 175 sales representatives and we will -- we had our first ever AZSTARYS national sales meeting last month. Our seasoned market access team has had significant success, with coverage of 145 million patient lives and preferred status for greater than 35 million covered lives. In addition to expanding our launch to be national, we are also increasing our commercial team focus on the significant adult market, particularly influenced by the Vyvanse field force backed by Takeda being pulled back. Thus, we are now focused both on the pediatric and adult markets, which we will prove commercially and importantly provide benefits to the patients and caregivers we serve. To wrap my update on, we are very pleased at Corium with the success we've had in the CNS space and our transformation to an end-to-end pharmaceutical company. Our AZSTARYS launch, has gone as well, if not better than planned, and we are very optimistic about the future of our business. I want to thank Travis for the opportunity, to provide the update on Corium and AZSTARYS and for participating in this call and partnering with KemPharm. Thanks, Perry very much for your time and I appreciate that very detailed and very timely presentation of the update on AZSTARYS and the commercial launch. Just briefly, for those that may be new to the KemPharm story, KemPharm really has gone through what is a remarkable transformation from its initial days as a prodrug drug discovery organization, where we transformed into development and eventually had partners and one you just heard about right there with AZSTARYS. And now today, where we have a late-stage CNS-focused rare disease product. We have mid-stage another opportunity, as well of course revenue opportunity, with our partnerships that are already in place. We have the potential here from any number of these products, to transform the organization again into what would be a commercial organization. So from early-stage drug discovery, all the way through potential commercial launch, commercial company that is a true value proposition and that's what KemPharm brings for us, today. The most recent news I believe that everyone should be very aware of, if you're familiar with the story is the acquisition of arimoclomol. So, here again we went from a product that was just approved in AZSTARYS to a mid-stage asset in what's known as KP1077 for idiopathic hypersomnia and now with a late-stage product with a resubmission of an NDA first quarter of next year. Very exciting news with the growth in sales reps, the growth in coverage which just really leads to the future here for the potential for royalties and milestones. So, with those highlights, I'm going to touch on briefly some of our development-stage assets starting with arimoclomol as the most advanced candidate. Primary symptoms or issues with Niemann-Pick type C are related to neurological symptoms and so that's why we believe those neurological symptoms are something we're very familiar with, with other CNS disorders and something that fits very well within our expertise and our ability to develop. Right now, there's no approved treatments that exist in the United States for NPC. But it also provides an opportunity to highlight our expertise internally, which is in development of assets say that may not be particularly attractive to other organizations or things that have gone through their own development difficulties. Arimoclomol also has a number of early access programs available to it in the U.S., France and Germany primarily in other European countries. Currently under the French EAP system, we estimate, we generate roughly $12 million a year in annual gross revenue under that program. LaDuane will give a few more updates on what that looks like and how that may be used under the financial structure, we used to acquire the asset. Looking now a little forward with arimoclomol, again we have this near-term opportunity to commercialize the asset. So we know literally there's, roughly 300 identified patients. And so it is not terribly difficult to generate the appropriate commercial organization in order to reach all of these patients and of course all the thought leaders, clinicians and everyone involved in those processes. And then as we look outside of U.S. and EU there are other countries, territories and regions that may be of interest to us for various, partnership and licensing opportunities with arimoclomol. That gives you just a brief overview of what our thinking is, when we say arimoclomol can be the opportunity that we've been looking for to transform KemPharm into that next stage of development. Turning now to KP1077, this I've mentioned several times is our treatment option, potential therapeutic treatment for Idiopathic Hypersomnia. They can sleep for 10, 12, 14 hours take multiple naps and continuously believe that they're in a fog. And it's at much higher doses that â\u0080\u0093 we are anticipating it to be at much higher doses to address the fundamental symptoms of idiopathic hypersomnia, which are both severe and completely disabling to these patients. Given that we plan to use a higher dose, we do see that we have to do some work and we started that study last quarter. We believe that we'll actually perform better, which will lead to greater tolerability, allowing for higher and higher doses, which ultimately should show greater effect in this disease state. And just to kind of wrap up, I want to give you a sense for what we believe are the upcoming clinical and regulatory milestones that we think are going to be most relevant for our audience here. Arimoclomol, I mentioned already the Q1 anticipated 2023 refile of the NDA for NPC. But as I mentioned before, we anticipate sometime around Q2, Q3 to be able to have open-label interim results as well as top line data before the end of 2023. Again, we don't -- the same division of the FDA, we want to make sure that they're fully aware, primarily that we're seeking an IH indication and that we're going to use our narcolepsy development program to support the IH approval and subsequent addition of the narcolepsy indication to that label. You have to do them kind of staggered like this, and we think that's why that's generated in that fashion. Certainly, we'll be taking questions later, but I'm going to actually turn it over down to LaDuane to provide us with a financial update. For the quarter, we had net revenue of $1.3 million. That's derived from Arimoclomol product sales, consulting service fees and royalties. And I would just note that as we've talked to you before, we knew that consulting service fees would be reducing as that contract came to an end. We do have a continued sort of smaller scope in that regard, but really not going to be a principal driver of revenue going forward. And then of course, included in the Q2 revenue is only one month of Arimoclomol product sales, so just the month of June since the transaction closed there, just on May 31. So, you can expect then, that you would see increasing impact from that revenue on the go-forward quarters where you'll have a full three months each quarter. When you look at the net loss for Q2, it came in at $24 million or $0.70 per share. But that did include a one-time non-cash expense, which is related to the Arimoclomol asset acquisition. Most of that purchase price ends up being written off on a non-cash basis and I think that's probably good for us in the future, but that's where the accounting guidance led us. If you account for that then you come up with a non-GAAP net loss of only $6.4 million or $0.19 per basic and diluted share, which I think is more relevant if you're looking at net income net loss trends. And as Travis mentioned, we closed the quarter at $114.5 million in cash, very strong. We knew that the R&D spending would be increasing as the 1077 program is underway and so all of the work that Travis mentioned is work that we've begun during Q2, and you see that increase there. But also in future quarters, I think you'll continue to see probably a cash burn rate in the range of $4 million to $6 million a quarter. And again, that's very much within our operating expectations. The actual line of credit, Travis had mentioned that we brought this on really as a novel, really creative way to maintain capital flexibility. Because there is an ongoing revenue stream from the arimoclomol acquisition, we then chose to use a line of credit which can be serviced by that cash flow and then we're able to use our cash reserves in other ways. It gives us flexibility for our operating plan and all the development milestones that we intend to reach, as well as sort of the potential -- if there are opportunities in business development ways, we still have the flexibility of a solid balance sheet for those purposes also. So, we are in a very good position and I think for all of those reasons we're very excited about the future for KemPharm. Could you please break down the $1.3 million among the three line items AZSTARYS, arimoclomol and other non-product category? We'll have to look and see how we break that down in the 10-Q, Jonathan, but I will tell you the -- if I -- the French EAP revenue came in at about $1.4 million and then we show it net of liability we have to owe we may potentially owe if approved. It's still in a very small sort of localized regional setting at the moment, but I don't believe it's near profitability. No, I love the question, because when I put together and take a look at the cash runway I try to do as a very conservative lens for that. So, when I quote that then, I'm looking at sort of our cash runway plus our budgeted R&D, plus the contribution of the French revenue, and that's all I'm including. The upside to that forecast would be royalties, stronger royalties than expected, or royalties in general from AZSTARYS, as well as when they reach those net sales milestones those would also be upside to that forecast. So I'm trying to paint a very realistic picture, but we also find ourselves in this place, where we're kind of generating revenue, but we're also certainly a development company continuing. So there is a point and we hope it's when we get approval of arimoclomol that we will truly become a commercialized entity with meaningful revenue that we get to keep the majority of it, because we'll commercialize directly. Thanks, again, everyone for joining today's call. You've heard us speak about this strategically for the company for about nine months now, moving the organization forward, and thinking about where we sit today, a strong financial position. We have a late-stage asset that already generates revenue and effectively pays for itself, at least, here in the short term and could be cash flow positive. It's just simply amazing that, we sit where we are with all that opportunity. Ladies and gentlemen, this concludes today's KemPharm Second Quarter 2022 Earnings Call and Webcast."
}