{
    "symbol": "ABTX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 16:09:11",
    "content": "  The level of new loan originations in the first quarter of '22 set a new record for our team and also resulted in a record level of core loan growth of $130 million after excluding the impact of our PPP loans, which are declining due to the forgiveness process. Compared to the fourth quarter 2021 when $450 million of new core loans were generated, which funded to a level of $327 million. All in, the overall period-end weighted average rate charged on our funded core loans decreased 3 basis points, ending the first quarter at 4.80% compared to 4.83% as of December 31. Non-accrual loans increased a net $2.2 million during the quarter, from $24.1 million for the fourth quarter 2021 to $26.3 million, primarily due to $7.5 million in additions, which was partially offset by $2.2 million in upgrades placed back on accrual, $1.2 million in payoffs, $1.2 million in payments and $654,000 in charged-off balances. We recorded net interest income of $55.2 million for the first quarter, down from $58.1 million in the fourth quarter, primarily due to a change in the mix of interest-earning assets and a $3.4 million decrease in net PPP fee revenue recognized into interest income. Net interest income was down just slightly from $55.7 million for the first quarter of 2021 primarily due to lower revenue recognized on PPP loans, offset by lower interest expense and increased interest income from securities. Total net fee revenue related to PPP loans recognized into net interest income during the first quarter was $2.5 million compared to $5.9 million in the fourth quarter and $6.9 million for the first quarter of 2021. As we look at our tax equivalent net interest margin, lower PPP net fee income recognition along with lower interest expense in the first quarter and a significant shift in the composition of our earning assets resulted in a margin of 3.3% for the first quarter as compared to 3.57% in the fourth quarter and 4.19% in the year ago quarter. Non-interest income increased to $4 million for the first quarter from $2.5 million in the fourth quarter primarily due to a mix of factors, including $1.3 million in income from SBIC investments."
}