{
    "symbol": "AN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-17 12:37:18",
    "content": " And notwithstanding the fact that we typically add around 300,000 additional customers per year to our database, we know that within our existing customer base, which as I've already pointed out is extensive, there's significant opportunities to grow our business by covering a broader part of the automotive value chain giving us an enhanced opportunity to reactivate inactive customers, improve our retention of new customers significantly and the products and services, we offer increase of frequency within which we interact with our customers. The acquisition expands our range of services and creates meaningful after sales business opportunities, including utilizing another channel to provide service to automation's existing customer base, and introducing additional vehicle owners, who have purchased vehicles outside the AutoNation dealer network. So as I sit and look at this year, I think there's strong potential for new vehicle volume under the right circumstances to be above $15 million, and I think we'll end the year with continued low -- relatively low -- very relatively low, frankly, when you look back at some of the previous yearâ\u0080\u0099s inventory levels on a day's supply basis. And so whether we get to that by the end of this year, I don't know, but to me that would be a nice level that would serve everyone's interest, I think exceptionally well and that's kind of how we're thinking about the business right now. So our approach really is to expand our business, our geographical reach, so that we can continue to add more customers to our base, understand why customers over time become inactive and that's typically, because the ages of the vehicle that they have is beyond seven or eight years and they therefore believe it's the right thing to do for them to move out of a franchise environment or they moved outside of a 25 mile radius of our stores and therefore our penetration in the aftersales part drops off. So when we think about the businesses that we buy, what we're thinking about really is the needs of our existing customers, not even -- if you imagine not even including these -- sometimes of the 300,000 customers that are added to our base each year, so our approach really is to reactivate those customers that are looking for a different type of service that is not traditionally provided by franchise store and we're adding businesses and we're adding open term and growing them as well as buying them. Hey, good morning, guys. Obviously, as a large player in the franchise new vehicle, retail business that's going to help us in terms of our sourcing and that's a competitive advantage against those standalone used car players, which I think has been pointed out most times. The bad news, I don't think it's bad news, because if we see the same net price that we're seeing, net transaction price on new vehicles, a solid used vehicle wholesale and retail price is going to help bridge that balance to pay for our customers. Hey, good morning, guys. It's obviously -- and I say and I don't mean to be flipping it, it's obviously a complex question, but I think there are lots and lots of OEMs have talked about the valuable nature of their dealer body and working together our ambition as partners of our OEMs is to just make sure that the customer journey is as seamless as it can possibly be that it really does represent the brand that the OEMs have spent years and billions of dollars to develop and it's done in a transparent way."
}