{
    "symbol": "J",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-21 14:18:09",
    "content": " During the quarter, net revenue grew 6% year-over-year and grew 11% on a constant currency basis with another quarter of constant currency growth across each line of business. From a full year standpoint, we finished the year within our original guidance range, even when recognizing the translation impact from the strengthening U.S. dollar with double-digit net revenue and operating profit growth on a constant currency basis. I'll begin on Slide 6, discussing our People & Places Solutions business where we achieved strong top and bottom line results with backlog up 8% year-over-year and 12% in constant currency. For example, in FY '22, our advanced facilities operating -- advanced facilities unit operating profit grew by well over 25% and on a constant currency basis due to our scalable multi-geography delivery teams. CMS delivered solid performance in the fourth quarter with backlog remaining strong at $10.6 billion, flat year-over-year, with gross profit in backlog was up 10% year-over-year and 12% in constant currency. Adjusted gross margin in the quarter as a percentage of net revenue was 26% and improved slightly from the third quarter but was approximately down 130 basis points year-over-year, primarily driven by: one, our CMS line of business due to the newly ramped remediation contract; and two, investments in incremental employees in TA in advance of the large wins such as the U.K. MOD award that will ramp over the coming months. We expect gross margins to modestly improve from Q4 levels during fiscal 2023, driven by recent wins in cyber, favorable revenue mix, recent wins in PA Consulting and continued strong performance in our People & Places Solutions business. Jacobs' consolidated Q4 adjusted EBITDA was $350 million and was up 13% year-over-year, representing 10.8% of net revenue. GAAP operating profit was $918 million, up significantly year-over-year, driven by a material decrease in onetime items related to transaction and restructuring as well as solid underlying constant currency growth in the business. GAAP EPS was $4.98 and adjusted EPS was $6.93, up 10% year-over-year and up 13% on a constant currency basis. Starting with CMS; Q4 revenue was up 10% year-over-year and up 12% in constant currency,  contributed approximately $22 million to the fourth quarter revenue. Q4 CMS operating profit was $95 million, down 17% year-over-year and down 14% on a constant currency basis. The P&PS International business, Q4 revenue and operating profit was essentially flat year-over-year on a reported basis but grew double digits in constant currency. Our international business will continue to be materially impacted by FX during fiscal 2023, resulting in flattish reported revenue growth but is poised for full year growth on a constant currency basis. Total P&PS Q4 gross profit and margins were up year-over-year with Q4 operating profit up 31% and operating profit as a percentage of net revenue up 275 basis points, driven by revenue growth and mix as well as lower labor costs during the quarter. Full year People & Places operating profit was up 5.5% on a reported basis and up 10% in constant currency, with operating margins of 13.2%, up 20 basis points versus a year ago. We continue to target double-digit revenue growth on a constant currency basis with operating margins returning to above 20% throughout 2023, driven by improved utilization. As footnote in our earnings release and investor presentation, based on fiscal 2022 average rate, our outlook for fiscal 2023 adjusted EBITDA is $1.465 billion to $1.545 billion and adjusted EPS of $7.60 to $7.90, up 10% and 12%, respectively, at the midpoint. Steve and Bob, congratulations. Steve and Bob, congratulations."
}