{
    "symbol": "BHE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 20:49:05",
    "content": " Referencing Slide 3, revenue in the fourth quarter of $751 million was up 19% year-over-year. Excluding the effects of supply chain premiums, revenue grew 20% year-over-year to approximately $2.6 billion with double digit growth in five of our six sectors. Total Benchmark revenue was $751 million in Q4, which is 3% lower sequentially and 19% higher year-over-year. Medical revenues for the fourth quarter decreased 13% sequentially due to material constraints, but increased 14% year-over-year due to growth with existing customers and new program ramps. A&D revenues for the fourth quarter increased 5% sequentially due to increased demand, but decreased 5% year-over-year as we worked to try to offset continued supply chain constraints. Our GAAP earnings per share for the quarter was $0.60, which represents 71% growth on a year-over-year basis. For Q4, our non-GAAP gross margin of 9.6% improved 100 basis points sequentially, primarily due to a better absorption across our sites and a reduction in supply chain premiums. Non-GAAP ROIC in the fourth quarter was 9.9%, a 10 basis point increase sequentially and 130 basis point improvement year-over-year. For the year, medical revenues increased 28% year-over-year from growth with existing customers and new program ramps. Our GAAP earnings per share for fiscal year 2022 was $1.91, representing 93% growth on a year-over-year basis. Excluding supply chain premiums, our revenue in the fourth quarter was $705 million, a sequential increase of $7 million or 1% growth and a year-over-year increase of $113 million or 19% growth. We expect revenue to range from $640 million to $680 million, which at the midpoint represents a 4% year-over-year growth. In Industrials, 2022 saw revenue increased 24% excluding supply chain premiums on the back of growth from existing customer products and continued momentum and new program wins."
}