{
    "symbol": "LNDC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-01-05 22:50:22",
    "content": " Since the Eat Smart sale occurred subsequent to fiscal second quarter end, we are providing you with a pro forma look at the Curation Foods segment for the first half of fiscal '22, as well as the full year fiscal '21 to add in your modeling the go forward business. The $1.6 million investment in the P&L this fiscal year is focused on sales, marketing and development resources to expand our reach with new customers and to increase our development services which ultimately allow us to continue to expand our pipeline and open new sales channels that expand and complement our existing capabilities. Lifecore had a great fiscal second quarter, the business realized total revenues of $24.9 million or a 7.4% increase versus the prior year period, driven by a 17% increase in CDMO business, partially offset by a 27.8% decrease in its fermentation business, which was a result of timing of shipments within the fiscal year. This compares to net bank debt at the end of fiscal '21 of $192.6 million, an improvement of nearly 50% or $100 million in the year-to-date period, which reflects the sale of our Windset investment in the first quarter, and the Eat Smart disposition in December. And if we do will be all over it, since we talk very frequently with our customers on the inventory planning side of things, but it's worked through, you should start seeing the HA side of the business start picking back up in the second half, we're happy with where that's headed, and things are on track, as we laid out the fiscal year. Currently, we're staffed and ancillary equipment to handle 10 million units, we typically try to keep our capacity ahead of demand and don't like demand ever to reach more than 80% of capacity if we can help it to handle fluctuations in demand, especially on the upside, so this fiscal year, with everything we got running through from a commercial standpoint, and later phase development, fills are doing approximately 8 million units. It's relatively pretty even breakout from about 30%, 35% or so of our capital spend this year fills out that 22 million units, we'll need to continue to spend capital over the next few years to continue to fill that all in, like I talked about when we don't, if lead times on equipment like lab equipment, or mixers, or filters or things like that are a lot shorter lead time, so we don't spend the money till we need it. Yes, I mean, in general, Lifecore, we had a strong margin performance in Q2, related to shifting of some of the development work into that quarter, but overall, we still manage the overall blend of the business in the margins to be in the upper 30s where we've historically done and that's where we should come out this fiscal year as well."
}