{
    "symbol": "LNDC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-10 20:06:03",
    "content": " Lifecore finished fiscal 2022 on a high note, delivering a strong fiscal fourth quarter that helped us exceed our guidance, achieving full year revenue growth over 11% to $109.3 million and adjusted EBITDA growth of 18% to $28.9 million. We continue to feel confident about delivering a multiyear acceleration in our revenue growth trajectory, which is supported by known projects within our existing project portfolio and will be further enhanced by new opportunities with prospective projects in our development pipeline. For the fiscal fourth quarter of 2022, Lifecore total revenues increased 6.9% to $27.6 million, driven by a 2% increase in our CDMO business and a 34.1% increase in our fermentation business which was above our expectations and drove upside to our guidance. Lifecore gross profit increased 19% to $13.4 million for the fourth quarter of $22 million representing a gross margin of 48.4%, which compares to 58.9% in the prior year period. For the second half of fiscal year 2022, gross profit grew 15.2% to $26.3 million with a gross margin of 42.1%, as compared to 43% in the prior year second half. Lifecore adjusted EBITDA increased 15.9% to $8.9 million for the fourth quarter of 2022, with an adjusted EBITDA margin of 32.3% and as compared to 29.8% in the prior year fourth quarter. For the second half of 2022, adjusted EBITDA grew 10.8% to $17.5 million with an adjusted EBITDA margin of 28% as compared to 30% in the prior year second half. As Jim noted, Lifecore exceeded its full year '22 guidance on both revenue and adjusted EBITDA delivering revenue growth of 11% to $109.3 million and adjusted EBITDA growth of 18% to $28.9 million. Shifting to our fiscal '23 outlook for our Lifecore segment, we are introducing revenue guidance in the range of $122 million to $126 million which implies growth in the range of 12% to 15% and adjusted EBITDA guidance in the range of $31 million to $32.5 million which implies growth in the range of 7% to 12%."
}