{
    "symbol": "AMCR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-18 02:28:07",
    "content": " The business finished the year with good momentum, more than offsetting any external headwinds so that Q4 was our strongest quarter of sales and EBIT growth, and full year EPS growth of 11% was at the top end of our guidance range. Focusing on the strong June quarter, net sales growth was 13% and this included approximately $1.7 billion of incremental price increases on an annualized basis related to the pass through of higher raw material costs. Excluding this pass through, organic sales growth accelerated through the year reaching 6% for the June quarter in both the flexibles and rigid packaging segments, and our strong performance reflects good work by our teams to recover broader and higher levels of general inflation, mostly through the second half of the year. This top line growth converted into adjusted EBIT growth of 9% in the June quarter and it's worth noting that this high single digit earnings growth was achieved in a quarter which clearly no longer benefited from any synergies, and while we continue to experience significant inflation and an unfavorable price cost lag related to raw materials. Year-to-date sales of 1.2 billion includes significant recoveries of high raw material costs of 1.1 billion, the overall price cost impact has remained a manageable headwind through this inflationary cycle given the diversity of raw materials we buy, the multiple reasons in which we consume those materials and the leverage we get from our well developed and deeply embedded capabilities which have enabled us to implement a range of pricing actions across the business in a timely manner. In terms of earnings, adjusted EBIT growth of 9% on a year-to-date basis and 11% for the June quarter reflects strong price mix benefits and favorable cost performance. In North America, year-to-date beverage volumes were up 1%, hot fill container volumes increased by 2% for the year against the strong comparative period of double digit growth and were up 4% in the June quarter, reflecting continued strength in categories like isotonics and juice. By leveraging Amcor's highly differentiated technology, design and PCR handling capabilities, we are well differentiated in adding significant value for our customers in the hot fill segment, which over a multiyear period has resulted in compound volume growth of around 5%, helping drive consistent mixed benefits. In terms of cash flow, we expect to continue to generate significant adjusted free cash flow for the year of approximately 1 billion to 1.1 billion, even as we fund a further 15% increase in capital investment to capture organic growth opportunities. So in summary for me today, the business has delivered another strong year of organic growth as we remain focused on executing for our customers, recovering inflation and higher raw material costs and increasing earnings leverage by managing mix. Organic growth has accelerated over the last three years, and as Michael mentioned, we're stepping up CapEx to around 4% to 5% of sales on an ongoing basis to maintain that momentum. We expect to deliver another year of strong growth in the underlying business in FY '23, and we're committed to continuing delivering for shareholders by increasing investments in the business and returning value through a compelling dividend and ongoing share repurchases. Your line is open. If we look back over the last five, six, seven years, we've had about 2% total beverage growth, but the hot fill space has grown closer to 3% to 4% and that's what we'd expect going forward. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. But I think what's exciting to us is that we're -- we see enough line of sight to good organic growth in some of the priority segments that we've referred to and some of the innovation platforms, which do have sustainability attributes that we can deploy more capital to drive higher levels of growth. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}