{
    "symbol": "AMCR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-03 19:23:06",
    "content": " First, the business delivered another strong result with the March quarter representing our strongest period of sales and earnings growth for the fiscal year so far. As you see on the bottom of the slide this strong March quarter builds on a solid first half, so that on a year-to-date basis, net sales have increased 13%, adjusted EBIT has increased 6% and adjusted EPS is up 11%. This includes significant recoveries of higher raw material costs which increased to $330 million in the March quarter, representing 13% of growth and $1.3 billion on an annualized basis. And as Ron mentioned, this performance reflects our continued focus on managing mix to drive growth, particularly in priority segments like health care pet food and premium coffee where we have seen mid-single-digit growth year-to-date. In terms of earnings adjusted EBIT growth of 8% on a year-to-date basis and 10% for the March quarter, reflects strong price/mix benefits and favorable cost performance. Year-to-date, sales grew by 19%, which includes favorable pricing to recover higher raw material costs of 14% and organic sales growth reflects 3% higher volumes and price/mix benefits of 2%. Hot fill container volumes increased 6% in the March quarter and 2% on a year-to-date basis, which reflects continued growth in key categories like isotonics and juice. On a year-to-date basis, cash flow of $263 million is below last year, primarily due to unfavorable working capital outflows, relating to higher raw material costs, as well as some planned inventory increases across the business. Given our strong March quarter and year-to-date performance, we are raising our outlook for adjusted EPS growth to 9.5% to 11% on a comparable constant currency basis. As a reminder the four sites in Ukraine and Russia combined represent approximately 2% to 3% of Amcor's annual sales, approximately 4% to 5% of annual EBIT and approximately US$200 million to US$300 million on the balance sheet. We've been stepping up CapEx by around 15% per year including in the current 2022 fiscal year, as Michael mentioned and we expect this will take our CapEx to sales ratio from the 3% to 4% range historically to 4% to 5% on an ongoing basis."
}