{
    "symbol": "IX",
    "quarter": 3,
    "year": 2021,
    "date": "2021-02-08 07:57:05",
    "content": "  Operator: Good evening, ladies and gentlemen, and thank you for joining us for this telephone conference of ORIX Corporation for the third quarter consolidated financial results for the ninth month period ended December 31, 2020. Today's attendee of this conference is Executive Officer, Head of Treasury and Accounting Headquarters, Mr. Yano. As we begin this conference, we'd like to ask the participants to make sure that you would turn off your mobile phone or put it away from the telephone in order to avoid acoustic feedback. If we experience severe acoustic feedback during the meeting, we may have to discontinue the meeting for a while and ask the participant to help us. I am Yano, Head of Treasury and Accounting Headquarters. Without further ado, I'd like to begin. The year-to-date net income of the third quarter of FY 2021 was down Y-o-Y or year over year by 42%, ¥142 billion, with annualized ROI of 6.4%. The net income for the third quarter was ¥48.2 billion, which is an increase of 10% as compared to the second quarter. This indicates a progress of 75% vis-à-vis the target of ¥190 billion for the whole year, which we shared at the time of the interim results announcement. On November 2 of last year, we announced the share buyback program of ¥44.2 billion. As of January 8 of this year, we have completed the execution of the program by 100%. While we would like to use some proportion of retained earnings for new investment, our policy of not retaining any unnecessary capital remains unchanged. As to the surplus capital, we intend to return them to our shareholders through stable dividend and flexible and agile share buyback program. Despite of COVID-19 pandemic, ORIX remained active in making new investment, while being very selective in choosing the target. At the time of the second quarter announcement, we shared our expectation of ¥200 billion worth of new investment. However, the new deals continued to increase and have so far made an announcement of approximately ¥400 billion worth of new investment. We will continue to deploy our investment capability widely, with focus on renewable energy and asset management. As for credit rating, we maintained single-A or higher, with Fitch keeping their rating as at this third quarter. So, Kobayashi Kako, first of all, we are terribly sorry. And so, as to the PE investment, we, in fact, post the result three months after the accounting, closure of the accounting. So, in terms of the impact, any impairment or appropriation of reserves would have to be considered. So, at this point in time, we don't know – it is yet to be known, the magnitude of the impact comes from this incident. But as of now, we don't regard to be material, the impact would be. So, the basic investment amount if I could refer to the amount that was the amount of investment that was made, it was a fairly sizable, relatively speaking, but it was in tens of billions of yen. So, we would like to, of course, fulfill our accountability and self-responsibility within the limit of the investment that we have made. Mitsubishi UFJ Morgan Stanley, Ms. Park. This is Park, Mitsubishi UFJ. For the first six months close, you mentioned that you think that you'd have to do this on a continual basis. Or one year ago, on year before or two years before, you could, for example, say that you want to see the results of the first half in order to make the decision. But unfortunately, at this point in time, I can't really say what's next. In the second quarter, we made the announcement and share buyback was completed – was going to be completed in March and it was completed. So, I don't have anything additional to announce at this point in time. Going forward, we will respond to the situations. So, in the second quarter or the final year closing, we tend to talk about our capital policy. So, depending on the performance, investment, as well as dividend policies, we have to take a balanced view. And hopefully, we can talk about share buyback like that in the future. I'm sorry, I don't have anything specific I can share with you today. Anyway, that is the plan. The next question is from SMBC Nikko Securities, Muraki san, please. As to the outlook, I'd like you to share with us your expectations. So, there wasn't much investment gains, but the share price is remaining to be at a high level. So, taking those into account, the investment gains, on the other hand, there could perhaps be a possibility of some impairment gains in some segments, I suppose. For this fiscal period, as to the investment gains, there isn't much that we have planned. So, I would imagine that the amount will be around ¥100 billion or so. So, this year would be around that amount. So, there will be certain amount of investment gains for sure. As to the impairment, in the third quarter, there was a small amount of impairment that was posted. Unfortunately, we had to accommodate this impairment. However, it was not sizable. And after the credit, as to the appropriation of the reserves, in the fourth quarter, we do not foresee any major impairment. Kobayashi Kako, as we have said, we're going to be taking an adequate and appropriate, of course, actions within the limit of our investment size. And as to the fourth quarter, I think I have to refrain from sharing my personal expectations. But unless there is an acute change that may take place in the market, I would imagine that the current trend may be sustained. So, that's all I can share with you. As to the aircraft leasing businesses, you have given us a comment that you remain to be cautious. But of course, we will be carrying out the stress test and also the impairment test with, of course, the accounting auditing firm checking against it. But as of now, we are not planning any impairment as of now. Next from JPMorgan Asset Management, Mr. Ateo  please. With regard to HNA, it's called bankruptcy, but it's actually more like rehabilitation – civil rehabilitation. And within this rehabilitation program, Bohai is not included. In other words, Bohai has clearly been severed. So, Hainan Group as a shareholder, everything's now clean. In other words, it would have a positive impact. ORIX excluding Avolon has very small exposure, minimal exposure. We do have exposure, but it's nothing to speak of. Avolon itself, I think, discloses this information. However, if you carefully read Avolon's earnings announcement, you will find this information. This uncollected amount is approximately ¥200 million, roughly speaking, and there is also the dividend reserve, which is about the same amount. So, once these accounts are settled, the amount that is yet to be collected is quite small. GS securities, Nakamura san, please. Yes, we did receive some kind of impact. So, the impact was not as major as you may have expect. So, in the fourth quarter – that is inclusive of the fourth quarter, not just the third quarter. There were none in the third quarter, and there will be some impact given to us in the fourth quarter. But in the flow of things, it is almost negligible. Next, Sasaki san, BofA. I believe that the business plan, the budget for next fiscal year, is probably discussed now. After the announcement of the third quarter performance, I think you usually provide some explanation about the outlook of next year's performance – or budget. So, based on what's happened so far. But basically, no big change from the second quarter. To this date, it's ¥300 billion after tax profit. And as you have rightly estimated, we are formulating the budget as we speak, and hopefully, we can share more information with you at the time of the full-year announcement. The next is Mizuho Securities, Sato san, please. So, after the closing, at the time of the result announcement, you had talked about the two . Well, it will be determined by METI, the Ministry of Economics and Trade and Industry. But as to the possibility, Inoue had shared his own idea. But whether it is moving towards the correct – the right kind of direction, I wonder, because as of now, I don't think we have any kind of pessimistic or optimistic view to that. The risk, in fact, . We had touched upon the possibility of some risk, but it is not zero in – the view of the risk being not zero remains unchanged. So, that's all I can say for now. JPMorgan, Mr. Otsuka, please. I have a question about page 18, renewable energy. Up until now, similar to your regular or average business, you have a lead in profit and the future growth potential. And based on that, the renewable energy business will also face portfolio turnover. And we believe that it's effective as business, but also it leads to sustainability as well. So, we want to actively increase such business. However, it doesn't mean that they will not face any turnovers. If we can make a big investment and if there is good timing, maybe we will decide to sell some of the assets and maybe try to grow the overall size of the renewable energy portfolio. So, it's not as if we don't plan to sell anything in the future, but we want to expand. The next person is from Citigroup Securities, Niwa san please. As to the new investment, I have a question. If at all possible, I would like you to share with us your three views. So, if you could comment on that so far as you're allowed to. As at the third quarter, so we think that we did a pretty good job as of the third quarter. But the reason why I say that – we may have made a mention or it was Mr. Inoue, the CEO, who had made the mention at the time of the second quarter. So, the views that was on our table already, due diligence was already progressing quite smoothly, but there was some deals that were suspended as a result of COVID-19. So, we had resumed the due diligence. So, therefore, we were able to make a quicker decision, I think, as at the third quarter. So, due diligence is something that we cannot, of course, avoid. Even despite of the pandemic, I think we can do a pretty good job of due diligence work for sure. So, of course, taking into account what could – of course, how things would develop, but we're not going to be relaxing our speed and we'll make sure that we will do whatever we need to. And has there been any change to the pipeline, I think was one of your questions. I will not be able to, of course, mention any specific names when it comes to the deals in the pipeline, but there have been, of course, internal analysis of the deals. Mitsubishi UFJ Morgan Stanley, Mr. Tsujino please. In terms of renewable energy, you had two deals overseas. With these two deals, I think they will take time before you can really see that they're generating a lot of profits. As you can see on page 18, we have some existing deals, projects, some in construction. Therefore, I would say it would take maybe two to three years for us to expand this. Of course, we are looking at double-digit of IRR, that's what we're looking for. I'm sorry, my answer is vague, but please give us some time. Greenko and Elawan, of course, will be generating some level of profit from the beginning. And going back to what I said earlier, Greenko and Elawan may not be sold halfway through. However, they may have different plans and project, and we may exit from those individual plans or projects. So, I'd like to invite Mr. Yano to make the closing remarks. So far as I understand, I'm sorry that my answer was too quick and brief perhaps. So, we are going to be finishing earlier. But in any case, if you have any follow-up questions, please do not hesitate to contact us. So, we'd like to conclude the session for now."
}