{
    "symbol": "AVO",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-09 23:26:08",
    "content": " However, with these higher industry volumes, the pricing environment reversed, decreasing 27% ultimately outpacing the volume growth we had realized, although the velocity of the price deceleration created unfavorable circumstances to drive per unit margin, the market has since found some pricing stability, which is more conducive to generating improved profitability and looking ahead to the balance of the year we believe conditions exist that make for a more constructive pricing outlook as our fruit season comes online. However, note that the first quarter was advantaged by approximately $30 million due to the Blueberry consolidation that took place beginning in the fiscal third quarter of last year, but isn't yet reflected in the comparable prior year first quarter period. Thus, when looking at the drivers of our lower avocado revenue within the marketing and distribution segment, it was largely a function of a 27% decrease in average per unit avocado sales prices, being partially offset by an increase in avocado volumes sold to 14%, both of which were driven by higher industry supply out of Mexico during the quarter. In addition, our Blueberry segment experienced negative gross margin of approximately $3 million during the first quarter as a result of weak sales prices within the European and U.S. markets driven by strong industry supply as well as the amortization of purchase accounting adjustments associated with the business combination of Maruga during fiscal 2022. SG&A expense for the first quarter of fiscal 2023 increased $0.4 million, or 2% compared to the same period last year, primarily due to the consolidation of Maruga, which added approximately $1.6 million of expense. Adjusted net loss for the first quarter of fiscal 2023 was $5 million, or $0.07 per diluted share, compared to $12.2 million, or $0.17 per diluted share, for the same period last year. And adjusted EBITDA was $2.3 million for the first quarter of fiscal 2023, compared to a loss of $10.4 million for the same period last year. With this in mind, total segment sales in the international farming segment increased 73% to $5.7 million for the quarter compared to the same period last year due primarily to higher packing and cooling service revenue for Blueberries. The industry is expecting volumes to be higher in the fiscal 2023 second quarter versus the prior year period, primarily due to continued expectations for a larger Mexican harvest. We believe pricing will be higher on a sequential basis, but lower on a year-over-year basis by 30% to 35%, compared to the $2.04 per pound average experienced in the second quarter of fiscal 2022."
}