{
    "symbol": "KMX",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-29 12:55:26",
    "content": " For the second quarter of FY'23, our diversified business model delivered total sales of $8.1 billion dollars, up 2% compared with last year's second quarter, driven by growth in average selling prices, partially offset by lower retail and wholesale volume. In our retail business, total unit sales in the second quarter declined 6.4%, and used unit comps were down 8.3% versus the second quarter last year. Wholesale unit sales were down 15.1% versus the second quarter last year, partially as a result of our deliberate decision to reallocate some older vehicles from wholesale to retail to meet consumer demand for lower-priced vehicles. While down 8% versus last year's period, this was up approximately 50% from the second quarter of FY'21, and reflects customers' responsiveness to both our nation-wide online instant offer tool and our offers. In regard to our second quarter online metrics, approximately 11% of retail unit sales were online, up from 9% in the prior year's quarter. Total gross profit was $737 million, down 9.6% from last year's second quarter. Other gross profit was $102 million, down 15% from last year's second quarter. As was seen last quarter, our provision headwind was significantly offset by our total interest margin, which grew $31 million year-over-year, our margin of 7.29% was up 11 basis points from last year's second quarter, and it was supported by a $9.4 million benefit from our hedging strategy. I think if you look at recent performance, let's call -- certainly last year, I think every quarter last year on GPU standpoint for wholesale was over $1000. Got it, got it. Got it, got it. Yes, as I said in my prepared remarks, I was extremely pleased with the penetration we had, it did show that we were able to pass along some of the increases on to our customers, yet still manage the elasticity, capture the volume that we could again, three things we're trying to manage here is stay highly competitive for our consumers from our offers standpoint, manage that margin, and then make sure that we can capture the right amount of sales and it's a delicate balance, but I think we've done a great job and I think we'll continue to do that."
}