{
    "symbol": "KMX",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-24 13:23:08",
    "content": " For the first quarter of FY'23, our diversified business model delivered total sales of $9.3 billion, up 21% compared with last year's first quarter, driven by growth in average selling prices and wholesale volume gains, partially offset by a decline in retail used units sold. Across our retail, wholesale channels, we sold approximately 427,000 cars in total during the first quarter, down 5.5% versus last year's period. We bought approximately 362,000 vehicles from consumers and dealers during the first quarter, up 6% versus last year's period. We continue to be the nation's largest buyer of vehicles from consumers purchasing approximately 345,000 cars in the quarter, up 3% versus last year's record results. Total gross profit was $875 million, down 5% from last year's first quarter. Other gross profit was $120 million, down 15% from last year's first quarter. While penetration was stable at approximately 61%, this year's first quarter also reflected a $2.3 million unfavorable shift in the return reserve adjustments versus last year's period. On the SG&A front, expenses for the first quarter increased to $657 million, up 19% from the prior year's quarter due to an increase in staffing costs and marketing, the continued investment in our strategic initiatives, growth costs related to the increase in appraisal buys and used stores and the consolidation of Edmunds. First, a $61 million increase in compensation and benefits, excluding share-based compensation, driven by the annualization of the strong growth in staffing we experienced in the back half of last year, inclusion of Edmunds payroll this quarter versus a year ago, wage pressures and the ramp in field staffing in anticipation of a stronger tax season. Now, I would tell you the further we've gotten from lapping the stimulus, obviously, the better we performed as I noted in my opening remarks, we got sequentially better on comps throughout the quarter, which is encouraging, but that being said, I think the consumer softer, but there is still some demand out there and I think that's what we're trying to really maximize on and we're taking several steps to take advantage of that. As far as the concerns about what may manifest in the future with the consumer, where the consumer is going, Sharon, we've been through this several times in the past and whether it's â\u0080\u009908, â\u0080\u009809 recession, whether it's the depths of COVID, we've been able to navigate it profitably both times and we have lots of levers, we've shown that we've been able to pull those levers whether they're expense levers and you think about, you can slow down some of your growth, you can slow down some of your initiatives, you can pull back on advertising, your variable will adjust or if it's just you know if you want to secure cash, you can modify your stock buyback, you can start on some of your capital expenditures or delayed. If you look at the average APR, we charge for our customers last quarter, it was 8.2% this quarter, itâ\u0080\u0099s 9% largely coming from us passing along our increased costs under the consumer, it's always a delicate balance, you're trying to figure out managing, making sure you're highly competitive to your customer. It just gives us a lot of that inventory, you know, I talked a little bit about those over six, but it really doesn't matter if you break it down zero to four, you know, that's generally like a year ago at 66% of our sales or so this quarter is about 50% five to seven year old vehicles again it's 20% to 25%, now it's 30% to 35%, 8%-plus, itâ\u0080\u0099s like 15%, it across the board. And I think way that we will continue to go forward is with the guidance that we originally gave, which was really more in the ballpark of let's call it the $350 per unit, a little bit higher this quarter, but I think that's a good -- kind of a good thing to -- good way to think about it as we go forward."
}