{
    "symbol": "DXCM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 20:21:05",
    "content": " Our agenda begins with Kevin Sayer, DexComâ\u0080\u0099s Chairman, President and CEO, who will summarize our recent highlights and ongoing strategic initiatives, followed by a financial review and outlook from Jereme Sylvain, our Chief Financial Officer. At that time we ask analysts to limit themselves to one question, so we can provide an opportunity for everyone participating today. These statements reflect managementâ\u0080\u0099s intentions, beliefs and expectations about future events, strategies, competition, products, operating plans and performance. The factors that could cause actual results to differ materially from those expressed or implied by any of these forward-looking statements are detailed in DexComâ\u0080\u0099s annual report on Form 10-K, most recent quarterly report on Form 10-Q and other filings with the Securities and Exchange Commission. Following some disruption early in the year related to the Omicron wave, office access has continued to improve and we experienced a return to a more normalized customer journey, which helped us deliver this record. Our own customers value the differentiated experience at DexCom provides with consistent praise for our real-world accuracy, connectivity, actionable features and customer support. Product performance has been a hallmark for DexCom throughout our history, customers and caretakers alike rely upon the accuracy of DexComâ\u0080\u0099s CGM and can be confident performance across all aspects of glucose management backed by numerous clinical trials and borne out by real-world experience. We have long viewed software as an avenue to differentiate enabling unique user experiences, supporting greater connectivity and enhancing our ability to move more seamlessly into new markets. In support of this vision, we have invested significantly in building our software infrastructure in recent years and now spend more of our R&D budget on software than hardware, a tangible example of this can be found in our rollout of DexCom ONE. By using software to provide a different experience in our G series systems, this has allowed us to meaningfully expand our market presence in recent months. Entering new markets and winning tenders internationally that were previously not available to our G Series product, this is just the beginning of our journey of leveraging software to create products that meet the needs of our end users. Our list of real-time API partners continues to grow, as we are the only company that can provide partners real-time CGM data in an FDA regulated solution, our software capabilities are also laying the foundation for our success beyond the intensively managed population. For example, two partners focused on the use of CGM for weight management and metabolic health signals and levels helped have clinical trials underway that are leveraging our real-time API capabilities. The excitement continues to grow for our portfolio of CGM systems G6, G7 and DexCom ONE, and we have made significant strides in both direct and distributor markets to broaden access to our technology. We launched DexCom ONE in both Spain and the U.K., and have secured reimbursement for key segments of the population. In Australia, the government recently committed to providing subsidized access to our G6 system for all people living with Type 1 diabetes, which is a significant improvement in coverage and a great win for Australians deserving access to CGM technology. Our limited launch of G7 in the U.K. continues to be met with significant enthusiasm from our customers, who provided consistently positive feedback on product size, ease-of-use, the shorter warm up time, the app experience and more. The period has proven to be incredibly valuable, allowing us to assess the functionality of the sensor, adapting a real-world setting, and providing feedback on ways to refine our support system to make the broader rollout as streamlined as possible. As part of this process, we are making a subtle change to the G7 software based on feedback from the FDA slightly delaying our expected timelines for clearance and U.S. launch. They understand what this product will mean for our customers and people with diabetes broadly, giving us increasing confidence in the ability to ramp up commercial coverage quickly. Finally, we were very proud to showcase our expanded CGM portfolio two of the largest diabetes conferences of the year TBD in Barcelona and ADA in New Orleans. These events provide us an opportunity to connect with thought leaders across the diabetes space and we continue to see a clear consensus on real-time CGM being the standard-of-care in diabetes management and a growing appreciation of the health and economic benefits of extending the use of this technology beyond the intensively managed population, including the broader Type 2 population and use in the hospital. As I look back even two years or three years ago, these types of conversations around the broad potential of CGM were non-existent. For the second quarter of 2022, we reported worldwide revenue of $696 million, which included $12 million of unfavorable foreign currency impact. This is compared to $595 million for the second quarter of 2021, which represents growth of 16% on an organic basis. U.S. revenue totaled $511 million for the second quarter compared to 462 million in the second quarter of 2021, representing a growth of 11%. Customer demand remained strong in the U.S. and our unit volume growth continued to grow at a very healthy clip this quarter, relatively in line with recent quarters. But as discussed previously, we believe this will ultimately set us up to serve meaningful, more customers over time. International revenue grew 39%, totaling $185 million in the second quarter. In addition to the DexCom ONE new market wins Kevin highlighted before, we also continue to drive greater reimbursement in our initial launch countries in Eastern Europe this quarter. While we previously announced that patient reimbursement in Bulgaria and Estonia, Latvia and Lithuania have now established full or partial reimbursement for individuals with Type 1 diabetes. Through new product launches and reimbursement efforts over the past 18 months, we are happy to share that we have increased the reimbursed access to our product by more than 3 million customers and look forward to getting this much needed technology in the hands of as many people as possible. Our second quarter gross profit was $449.5 million or 64.6% of revenue, compared to 70.1% of revenue in the second quarter of 2021. Given the initial launch of G7 in the U.K., this is the first quarter where G7 development costs started to flow through COGS, accounting for some of the expected year-over-year step down in gross margin. Additionally, there were greater than 50 basis points of impact from currency in the quarter. Operating expenses were $347.6 million for Q2 of 2022, compared to $315 million in Q2 of 2021. Similar to last quarter, we generated meaningful operating expense leverage despite incremental investment to support the G7 launch. We saw OpEx as a percentage of sales this quarter drop by 310 basis points year-over-year, as we continue to leverage our R&D and G&A expense lines. Operating income was $101.9 million or 14.6% of revenue in the second quarter of 2022, compared to $101.5 million or 17.1% of revenue in the same quarter of 2021, as a tough year-over-year gross margin comp was partially offset by operating leverage in the quarter. Adjusted EBITDA was $175.5 million or 25.2% of revenue for the second quarter, compared to $156.6 million or 26.3% of revenue for the second quarter of 2021. We remain in a great financial position, closing the quarter with approximately $2.8 billion worth of cash and cash equivalents. This provides us the flexibility to continue to invest in our organic growth opportunity, including the ongoing build-out this year of our Malaysia manufacturing facility and to assess any compelling strategic investments that present themselves. Along those lines, we announced today, a $700 million share repurchase program, which will allow us to offset the dilutive impact from our 2023 convertible notes. We are always assessing the best uses of our capital and given the recent market pressure, we view this as a great time to invest in our own business, as we remain incredibly bullish on the sizable opportunity ahead for DexCom. Turning to guidance, we are updating our full year 2022 revenue guidance to a range of $2.86 billion to $2.91 billion. For margins, we are reaffirming our prior full year guidance of gross profit margins of approximately 65%, operating margins of approximately 16% and adjusted EBITDA margins of approximately 25%. We experienced another quarter of solid volume growth, achieved worldwide record new customer starts, recorded our highest ever customer satisfaction rating. These results were before any material contribution from G7, which we expect to improve the customer experience in every way. We advanced our CGM portfolio outside the United States with a wider rollout of DexCom ONE, helping us reach more reimbursed lives and serving more new customers. For G7, the feedback from our limited launch in the U.K. has been fantastic, leaving us incredibly excited for a broader global launch in the coming weeks. And in the U.S., we now have clear visibility to the finish line on G7 clearance and our preliminary payer discussions are setting the stage for a big launch early next year. Despite all the macroeconomic challenges that exist today, runaway inflation, supply chain challenges, FX headwinds, we reiterated our margin guidance, continue to have no delivery delays across our business and remain committed to driving additional operating leverage in the coming years. We discussed several options that we had, we decided the best option at this time was to revise the software and file it differently and we have added a few other features to it as well based on our discussions with them. We are not done with it yet, but we are working very quickly to get done with that and thatâ\u0080\u0099s really our big major issue we talked through everything else. We changed every manufacturing procedure that we have and completely rewrote the entire app and the software experience, which is a lot for them to digest and a lot for us to submit. If I look at learnings for us over time, I think we will probably do things a little more incrementally going forward, rather as big as this one was and we can get things through faster. We have a lot of clarity as to where we need to go going forward and I will let Robbie handle the growth issues regarding G6, because we are still doing extremely well with that product, not Robbie, Jereme, go ahead. So in the U.S., look, the quarter here, we had about 11% growth. Thatâ\u0080\u0099s generally due to some of what we talked about in prior quarters, us getting into physiciansâ\u0080\u0099 offices and as those new patients didnâ\u0080\u0099t hit those record levels, you ultimately see that recur on a recurring business model such as ours it plays through. We do expect strength for the rest of the year to the point where we expect the U.S. growth rates to accelerate in Q3 and Q4, as we come off of this quarter where we see these record new patient starts. And quite frankly, we expect to have record new patient starts going forward for the balance of the year, even without G7. We are very confident in G6, and obviously, we are even more confident in G7 once that launches. So it sounds like to me you are still in the process of that, but I think you also said in your prepared remarks that you were comfortable, that you would still have a limited launch in the fourth quarter and a fuller launch in the first quarter of 2023 in the U.S. We have talked through all the other questions and things that we have discussed and we are very, very comfortable with that. And yes, what I did say is we are anticipating a limited launch in the fourth quarter in the U.S. and then the full-on rollout in -- early in the year in 2023. One of the things I said in my prepared remarks is we are very bullish about the progress we have made with the payers as far as getting the G7 reimbursed, because they can see how important itâ\u0080\u0099s going to be for our patient base. So, on the one hand, while we have the delay in the approval and the launch that, look, none of us -- we donâ\u0080\u0099t like to be faster. The other thing we are seeing on the other side is a lot of cooperation in the payer community and just in the channel in getting this thing positioned for reimbursement very quickly after approval, so we can get the launch out and not too different of a time frame on a reimbursed basis from what we expected in the beginning. Thanks for taking the question. What we saw, and I think, this is -- we have really talked about it is, we found our folks are most effective when they are able to get into physiciansâ\u0080\u0099 offices. But the predominance of where our new patient adds are coming, if you want to kind of see what the more accelerate is, itâ\u0080\u0099s really in the Type 2 intensive space. As we get into more primary care physicianâ\u0080\u0099s offices, these are folks we have called on really for the first time as we have expanded our sales force in 2021, getting their in-person has really unlocked that market and thatâ\u0080\u0099s what you continue to see. And so now our focus is and we talked about it a little bit in the prepared remarks, now that we are in these offices, a record new patient quarter this quarter, certainly, thatâ\u0080\u0099s encouraging. But we are also seeing that all of these tools that have been put in place means every call, every visit, every time we are in the office, we are able to be more effective about what might be the prescribersâ\u0080\u0099 decision making around that particular patient. And through doing that, whether itâ\u0080\u0099s debunking myths around co-pays and what the out-of-pocket is and making sure folks understand the cost, whether itâ\u0080\u0099s the ease-of-use in showing folks that a majority of our patients are able to put it on and use either training online or simple training in the box to ultimately put it on their body. So we are going to continue to do that over time and we are seeing that continue to play out as better prescriber patterns, more prescriptions per provider and more providers coming over to prescribing DexCom. So all of those are playing out, which is what gives us confidence for acceleration in the U.S. in the back half of the year. And as we continue to show how CGM can improve patient outcomes, itâ\u0080\u0099s becoming very clear that prior authorizations, we see payers starting to pull those down over time, a better way to put it. Thanks for taking the question. Can we just -- as I look at the stock down 18% in the aftermarket, that $6 billion in lost market cap, even a little bit more than that. So I think it would be helpful, I donâ\u0080\u0099t know if the reduction of the topline guidance from 2020 down to 2019 or maybe itâ\u0080\u0099s a little bit more is largely because of G7. But I am thinking itâ\u0080\u0099s like a $60 million headwind, maybe something like that this year versus not getting the approval. So as you look at where we are going and where we pulled that down, currency has, especially outside the U.S., has played a large impact on reported growth rates and thatâ\u0080\u0099s one of the reasons why we have shifted and how we talk about organic growth. As you zoom back into the U.S., the G7 delay does have a little bit of an impact on guidance, and so, certainly, we would recognize that we had some impact in there and assumed it would launch. And so what we believe is by working alongside our coverage teams and trying to get access as fast as possible, and while we are working through getting formal approvals, partnering with folks to get quicker access and quicker coverage, we believe we can work on getting those patients back in quicker and faster to where we donâ\u0080\u0099t believe itâ\u0080\u0099s going to be a material impact on 2023 and beyond. And so a little bit in 2022, certainly it could have a little bit of tick in 2023, but for the most part, we are doing all the work now to make sure that we have a major launch or it doesnâ\u0080\u0099t impact longer term growth rates. Just a clarification, I get the sense that it was a record for new patient starts in both the U.S. and worldwide, if you could just confirm that? And then the second question is, you mentioned expanding the G7 launch in Europe over the coming weeks and I wasnâ\u0080\u0099t clear whether you are going into new countries or is this just more expansive in the U.K.? It was record new patients OUS and in our U.S. markets as well, both teams had new patient add records during this quarter. With respect to the rollout of G7 in Europe, what we had indicated was our first rollout will be in the U.K. and we expect we will add other geographies before the end of the year. Thanks for taking the question. One quick clarification, the pricing mix versus volume growth this quarter and then as you look ahead to next year, well, we start to see volume and revenue growth to start to match up a bit more. In terms of pricing, and what Iâ\u0080\u0099d say is, more channel mix, but the delta between the two, it was about the same this quarter as it was in prior quarter, which is what we had signaled at the start of the year. It have to make sense for us for both the returns that we would expect on our performance, as well as for our shareholders. I wanted to go back to something Kevin said earlier about the new software and app experience for the patient with G7 in the U.S. Can you give us a hint of how meaningful that new app experience might be for patient willingness to try the G7, to switch to the G7, what it might do for patient demand? From the very beginning, when you start, it is much easier to fire it up and get on the system and understand what CGM is going to do for you and how itâ\u0080\u0099s going to work. So for a new user, this is a much, much easier experience and much, much easier start. The other thing thatâ\u0080\u0099s very obvious in the software is another feature that our patients love, itâ\u0080\u0099s a 30-minute warm up that actually ends up being about 25 minutes once you put the sensor on. But the software itself in addition to the typical graph in the sense of reading in the arrows, we also have clarity data built into the app that gives you feedback about how you are doing over one day, three days, seven days or even a month. So someone can go down and look and see exactly how they are doing and what their trends are, how much time they are spending in range. The other thing with the app, itâ\u0080\u0099s not really on the app, but itâ\u0080\u0099s a feature of this product thatâ\u0080\u0099s been very well accepted as well. And while I figured when we went to the phone in the beginning, everybody would immediately migrate to the phone, thereâ\u0080\u0099s a very large percentage of our customers who use that receiver. And on the good news front as well, that new receiver while a better experience is a much lower cost offering. We can absolutely answer that and itâ\u0080\u0099s interesting, DexCom ONE and G7 really havenâ\u0080\u0099t contributed all that much to this point. So, certainly, itâ\u0080\u0099s an exciting future contributor and we are very, very bullish on both G7 and the opportunity in DexCom ONE. DexCom ONE really is in the bell countries and hasnâ\u0080\u0099t contributed all that much, and G7 was limited launch. So what you saw in Q2 was really a continuation of our access and going deeper into countries where we had our G Series and really it was broad-based and itâ\u0080\u0099s a continuation of broad-based performance outside the U.S., really across all of our countries, including Germany, where we do go head-to-head with Libre 3. And like I said, in countries where we are going up head-to-head with our competitorâ\u0080\u0099s most recent product, we continue to do very well and take share. Are you currently seeking or planning to seek CE Mark approval for the software changes you are making in the U.S., and if so, could you share the projected timeline there? Thanks for taking the question. And if we feel the need to in some period of time, we can implement those changes into the other software and upgrade patientâ\u0080\u0099s apps on the phone, but not immediately, no. As you are moving G7 to full launch in the U.K., where you now also have DexCom ONE, just wondering how will those two offerings be marketed relative to each other. Should we assume that over time, they sort of merge and with G7 becoming the primary hardware there, obviously, thatâ\u0080\u0099s going to happen in more and more countries over time. Our G Series or our G6 and G7 products are regarded as very high end sensors for intensive insulin management, integration with insulin pumps. In the UK, for example, our DexCom ONE system will literally be -- will go through the pharmacy channel for broad-based distribution and broad-based accessibility for everybody, whereas our G Series, it requires more documentation, more approval and very specific conditions. As we look at these geographies, we think we have an opportunity with DexCom ONE to sell a different product and a different system with different features that really wonâ\u0080\u0099t step over onto our G Series that is fully integrated with other systems and offers all these other features. Ultimately, as I said on the call, we want our DexCom ONE product to be on the G7 platform as well as we simplify our operating structure over time, but that will take a little while. The software for DexCom ONE, I would also add, has been designed on the same platform as the G7 software. As long as there are two reimbursement categories, we do not see these two products coming together from a reimbursement perspective. They might look more like physically and be on the same platform once we get G7 enough capacity to transfer to the other DexCom under that platform, but they wonâ\u0080\u0099t be the same experience, it wonâ\u0080\u0099t be reimbursed at the same rates. In terms of the back half of the year, typically, what happens is, as we go typical seasonality as we go through the course of the year and part of this has to do with whoâ\u0080\u0099s ultimately purchasing the product, margins typically get better. So what you are finding is, is for the first half of the year, we obviously had a few different unique items that impacted margins. What you are really finding is the run rate for our margin for the first half of the year, absent these was just below 65%. Back half of the year, we expect it to be just the opposite, just north of 65% as we hit that typical seasonality. And the reason to tick up in the back half of the year in some ways is due to with the G7 launch in a meaningful way outside -- inside the U.S. sliding into Q1 of next year, you do see that performance on that G6 platform, which continues to have nice margins play through over the course of the rest of the year."
}