{
    "symbol": "PINC",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-02 10:50:05",
    "content": " 03:12 Compared with the first quarter of last year, total net revenue grew five percent with a nine percent increase in supply chain services segment revenue, resulting from strong execution in our GPO and direct sourcing businesses as we continue to help our members manage through the pandemic and a five percent decrease in Performance Services segment revenue due to the timing of revenue related to enterprise analytics license agreements in the quarter. Based on our first quarter performance and outlook for the remainder of the year, we believe we remain on track to achieve our fiscal twenty twenty two guidance and deliver long term sustainable growth. For the first quarter of twenty twenty two and as compared with the year ago first quarter, total net revenue was three hundred and sixty five point one million, an increase of five percent. 10:39 In our Supply Chain Services segment, net administrative fees revenue increased thirteen percent, compared with the first quarter of fiscal twenty twenty one to the current year growth as well as a less significant impact from the COVID-nineteen pandemic compared with the first quarter of last year. 12:25 Overall, we believe we remain on track to achieve our initial expectations for Performance Services fiscal twenty twenty two segment net revenue of three ninety five million to four twenty million with low to mid single digit growth in our healthcare provider revenues and approximately twenty five percent year over year growth in our adjacent market. Adjusted EBITDA of one hundred and twenty one point seven million in the first quarter, increased ten percent from the same quarter a year ago as a result of the following. 13:09 Supply chain services adjusted EBITDA of one hundred and twenty nine point three million increased quarter over quarter, primarily due to increased net administrative fees revenue, as well as increased revenue and profitability in our direct sourcing products business. 13:26 Performance Services segment adjusted EBITDA of twenty three point seven million decreased from the prior year quarter, due to the decrease in revenue, as well as increased selling, general and administrative expense, primarily related to additional headcount to support growth in Contigo Health. 13:45 Compared with the year ago quarter, adjusted net income increased thirteen percent to seventy nine point one million and adjusted earnings per share increased twelve percent to zero point six four dollars. 13:59 From a liquidity and balance sheet perspective, cash flows from operations for the three months ended September thirty, twenty twenty one was fifty five point two million, compared with thirty point eight million for the prior year. The twenty point four million dollars increase in operating cash flows was mainly due to a fourteen point three million dollars increase in cash received as a result of higher revenue, primarily attributable to net administrative fees in the current period, and a decrease of seventy one million dollars in costs, primarily driven by higher demand of PPE in the prior year period as a result of the COVID-nineteen pandemic. 14:56 Free cash flow for the three months ended September thirty, twenty twenty one was eleven point two million, compared with a negative twenty eight point four million for the same period a year ago. 16:52 During the first quarter, we repurchased approximately one point one million shares of our common stock for a total of forty two point six million dollars and paid quarterly dividends to stockholders totaling twenty four point nine million. 17:20 With respect to our fiscal twenty twenty two guidance, based on our first quarter performance and outlook for the remainder of this year, we continue to expect total net revenue to be in the range of one point three two billion to one point four three billion and adjusted EBITDA to be in the range of four eighty three million to five hundred million. We would still expect adjusted EBITDA margins to be in that mid-thirties range, which is what we've traditionally talked about that segment performing at, obviously due to the revenue shortfall, the margin was lower in Q1, but we would expect that to sort of ramp back up and be relatively consistent across the remaining quarters of fiscal twenty twenty two. Trying to reconcile fiscal Q1 net admin fees revenue of around one hundred fifty million and the guidance is five hundred seventy million to five ninety million for the whole full year, based on historical trends, fiscal Q1 is generally the seasonally weakest quarter for you guys from net admin fees point of view. What that means in terms of the full year performance, as I mentioned earlier is relatively stable performance quarter to quarter throughout the full year with a little bit of a small amount of moderation as described by our overall guidance range relative to our first quarter performance, but it's hard for me to say it was x million was this, y million was this z million was this. 49:56 In the Performance Services business, we expect mid to high single digit growth that as we've talked about will be a combination of likely low to mid single digit growth in the, kind of core historical provider footprint and then the emerging growth that we continue to see the approximately twenty five percent growth that we guided to for this year in those adjacent markets."
}