{
    "symbol": "PINC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-16 10:49:30",
    "content": " In our Performance Services segment, revenue increased 18% in the fourth quarter of fiscal 2022, compared with last year's fourth quarter. As Mike discussed in fiscal 2022, our adjacent markets businesses grew nearly 30% over fiscal 2021 to more than $83 million in revenue. First, Performance Services segment adjusted EBITDA of 37.7 million, increased from the prior year quarter, primarily due to an increase in revenue that was partially offset by higher selling, general and administrative expense, mainly related to additional headcount to support growth in our adjacent market businesses. Second, Supply Chain Services adjusted EBITDA of 119.3 million decreased quarter-over-quarter, primarily due to a decline in products revenue, which was mainly driven by lower demand in pricing for PPE, as well as increased freight costs and impacting margins in our direct sourcing business. Free cash flow for fiscal 2022 was $260.8 million or approximately 52% of adjusted EBITDA, compared with $240.3 million for the same period a year ago. In our Performance Services business, we anticipate that our continued investments in an expansion of our adjacent markets businesses will produce approximately 30% to 40% revenue growth over fiscal 2022. As we look ahead and adjusted for the impact of the COVID-19 pandemic on our direct sourcing business, we remain and believe we are on track to achieve our targeted compound annual growth rates from fiscal year 2021 through fiscal year 2024 of mid-to-high single-digits for total net revenue, adjusted EBITDA, and adjusted earnings per share as we provided at our Investor Day last year. So, I feel good about the visibility going into 2023 relative to our Performance Services business, but clearly there continues to be new business we'll need to sell and ramp that would also include Contigo Health where we look to continue to add new participants to the platform as we indicated expectations of, sort of that 30% to 40% growth that we're talking about broadly for the adjacent markets. It's definitely to support this year's growth given the 30% to 40% revenue growth that we're looking to deliver, but then also contributes to future year performance, but it is impacting the current year in terms of profitability of those businesses as we continue to ramp them up."
}