{
    "symbol": "PINC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-01 12:17:07",
    "content": " In our Supply Chain Services segment, net administrative fees revenue increased 3% from the year ago quarter, due to further penetration of new and existing member spend during the quarter and a less significant impact from the COVID-19 pandemic compared with the second quarter of last year. Supply Chain Services adjusted EBITDA of $134.3 million increased quarter-over-quarter, primarily due to increased net administrative fees revenue as well as an increase in favorable product mix in our direct sourcing products business. 17:00 In Performance Services segment, adjusted EBITDA of $39 million increased from the prior year quarter, due to the increase in revenue which was partially offset by higher selling, general and administrative expense primarily related to additional headcount to support growth in our Contigo Health and REMITRA businesses. Based on our first half performance and outlook for the remainder of this year, we are increasing Supply Chain Services segment net revenue guidance to be in the range of $1 billion to $1.02 billion, as a result of net administrative fees revenue that we anticipate will be in a range of $580 million to $600 million, and direct sourcing products revenue that we now expect to be in the range of $370 million to $390 million for the year. And in supply chain, it's really helping our healthcare systems identify all the spend, so hence that investment Michael, to be very specific in IDS/the rebranding to REMITRA, you're going to see us double down in that area because it's all about the e-invoicing and e-payables and we believe there is a huge opportunity to identify spend that historically, we've not been able to get our arms around or our healthcare systems have their ability to get their arms around. We are, as Craig said, just in terms of the impact on our business, it has a negligible impact on the overall business, primarily due to us having firm pricing agreements, and that we have a very, very tight process and I think this was, your question in terms of getting approvals for price increases, so they obviously come through -- many of them come through Premier sometimes they get sort of filtered up from the healthcare systems' executives as well. Generally speaking in terms of volume and I think we may have references this in the past, but it's not that there are a significant number of enterprise license agreements in any particular quarter it tends to be maybe one perhaps two, but generally sort of one these are multi-million dollar engagements so it's not that there would be five to 10 of them in the back half of the year as you articulated -- a question about, so that's the first-half. So to kind of answer your first question, there is not a tremendous number of switching that occurs in any typical year, which I think if you go back and look at history, there are a small number that actually make a decision and it typically relates to some leadership changes or M&A type activity in some cases, there can be, if you're not servicing a customer approximately either us or competitor that they may go look, but generally speaking, there's not a tremendous amount of health care providers that are looking to switch on a routine and regular basis given the complexity on that."
}