{
    "symbol": "PINC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-03 12:24:12",
    "content": " As we expected, our Supply Chain Services segment and total net revenue declined from the third quarter of last year, as we continue to return to a more normalized pre-COVID-19 pandemic level in our direct sourcing products business. In our Supply Chain Services segment, net administrative fees revenue increased 1% from the year ago quarter, primarily due to further penetration of member spend, which was partially offset by the impact from a small number of members that did not amend and extend their GPO agreements as part of our August 2020 restructure, as previously communicated. Adjusted EBITDA of $112.2 million in the third quarter decreased 7% from the same quarter a year ago as a result of the following, Supply Chain Services adjusted EBITDA of $118 million was relatively flat quarter-over-quarter, primarily due to a slight increase in net administrative fees revenue that was partially offset by increased freight costs in our direct sourcing business. Compared with the year ago quarter, adjusted net income decreased 13% to $68.1 million and adjusted earnings per share decreased 11% to $0.57 due to adjusted EBITDA performance and the increase in our effective tax rate in the third quarter of this year compared with the prior year quarter. This was partially offset by a decrease in cash received as a result of lower normalized revenue in our direct sourcing business, the impact of higher administrative fee share payments to members in the current year compared with the prior year and an increase in cash outflows for payments related to operational investments to support growth in our adjacent markets businesses. We have an advisory services business that's spinout  working with our health care systems and building out plans and performance improvement engagements to really help them optimize the later labor to ensure that, that labor is being utilized the most efficiently. And then we also have supply chain co-management capabilities, where we actually augment staff in the supply chain and our health systems, and that is an area that we're focused on and are seeing growth, as some of our health care providers need some assistance given what's happening in the marketplace. And then finally, as I spoke a little bit about in life sciences, we think we have some really, really unique capabilities not only doing real-world evidence in terms of helping our health care systems - I'm sorry, in terms of supporting life sciences organizations and our health care systems, but we also think the opportunity to identify patients using our advanced technology, our machine learning and our natural language processing at the point of care is going to be something that's going to be, we think, really differentiating for our life sciences segments or sub-segments. And the only color I would add, Michael, is that - and we talked about this at our Investor Day last November, but it really is the balance Mike's talking about, of the core provider business in Performance Services growing at sort of a mid single digit kind of growth rate and then leveraging those capabilities to drive a much higher 30% to 40% growth in those adjacent markets that Mike talked about, clinical decision, support of life sciences, working with payers and then employers through Contigo . I think as you've seen throughout the year, the thing that's a little difficult to precisely predict is this normalization that's been happening on the direct sourcing side of the business and then the utilization impacts due to either labor challenges or kind of what's been happening from overall resumption of services and hospitals as we talked about earlier."
}