{
    "symbol": "WB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 13:23:06",
    "content": " Welcome to Weibo's Third Quarter 2022 Earnings Conference Call. Hello, everyone, and welcome to Weibo's Third Quarter 2022 Earnings Conference Call. On today's call, I will share with you highlights of Weibo's user, product and monetization in the third quarter of 2022. On the user front, Weibo's MAUs reached 584 million, and average DAUs reached 253 million in September 2022, adding approximately 11 million and 5 million users year-over-year, respectively. In the third quarter, our total revenues reached $453.6 million, a decrease of 25% year-over-year and an increase of 1% quarter-over-quarter. Excluding the foreign exchange impact, our total revenues decreased 20% year-over-year and increased 5% quarter-over-quarter as revenues reached $393.4 million this quarter and 95% of our ad revenues came from mobile. In the third quarter, our non-GAAP operating income reached $162.1 million, representing a non-GAAP operating margin of 36%, up from 32% last quarter. Our target on product operations still focused on strengthening the platform's competitiveness through improving operating efficiency, maintaining large user scale and enhancing user engagement. In September, the number of our hot trends users from domestic handsets increased 30% quarter-over-quarter. Next we will continue to deepen our cooperation with handset manufacturers to focus on long-term mutual benefits, expand cooperation to more app use Weibo's core products and content and increase Weibo's user scale through handset tech channels. On social attributes, this quarter, we continue to enhance social features of our products and increase the scale and engagement of our core users on relationship-based feed while maintaining user traffic. In July and August, which is the peak season of traffic due to the summer holiday, Weibo's content generation largely increased, particularly for verticals such as celebrities, TV series, variety shows and games et cetera. In September, traffic generated from community-based content distributors in the relationship-based feed and the number of users who made interactions through community contents have increased more than 50% quarter-over-quarter, which further facilitates users' relationship building and interaction efficiency in a relationship-based feed. In the third quarter, we continued to beef up our investments in community products to strengthen the perception of community products by all users. On one hand, with the independent tab of super topic at the bottom of main page launched in June, we are able to improve new users' willingness to revisit the tab through prioritizing traffic distribution for quality community content, coupled with our effective user recall strategy. In September, the DAU's Super Topic tab increased by more than 50% compared to that of June, half of which were new users for community products. Now only has the scale of users growing, users consumption stickiness increased significantly with capital consumption of community-related contents increased by 40% from June. On the other hand, we further enhanced functions and mechanism of the community products, such as new functions of posting and interaction that launched in the third quarter. We believe that the constant building of our community products has strengthened the social stickiness of Weibo users, boding well for the long-term healthy development of the platform. On the content front, our strategy this year is to focus on developing social accounts in key verticals to constantly solidify our advantages in key content verticals as well as high quality accounts. In third quarter, the daily number of posts by eSport players has increased by 50% quarter-over-quarter with both traffic and interactions doubled. In third quarter, the traffic and the interaction of TV and variety shows continued to trend up compared to that of the last summer holiday. TV shows Love Like the Galaxy and the Love Between Fairy and Devil have generated over 40 billion topic views and 28 million discussions, reinforcing Weibo's position as a designated platform for show launching and promoting. For example, in auto industry, thanks to positive support for new energy vehicles industry and the enhanced market recognition for Weibo's integrated new car launching marketing solution for automakers over the past 2 quarters. On top of regular brand exposure, leveraging the combo of media, vertical KOLs and hot trends, Weibo has successfully expanded its market share in new car launches, leading to sustained double-digit year-over-year growth in ad revenue from auto industry in the third quarter. As for the luxury sector, ad revenues also booked significant year-over-year growth due to the intensive launch of new lines and shows in the third quarter. Even though the new games approval this year has shrunk, we have effectively helped these game developers improve user ARPU and lifecycle, leveraging cooperation around contents with our top-tier game clients and event-based marketing products and services. Talking about outlook, overall advertising business for the fourth quarter and the first half of next year. In third quarter, we focused on conforming our algorithm to accurately fulfill the marketing needs of e-commerce platforms on the ad product front and expect to gradually capture certain advertising budgets in the fourth quarter. Meanwhile, the fourth quarter is also a key season for new product launches in the handset sector with all major handset manufacturers launching key models in their pipeline. As such, we are actively working with our clients to develop constant marketing plans to further deep up Weibo's market share in new phone launches. In the third quarter, we delivered a non-GAAP operating margin of 36%, up nearly 4 percentage points versus 32% in the second quarter, benefiting from solid execution of disciplined spending strategy to further improve operating efficiency. On the product operations front, we deepened the strategic cooperation with our content partners focused on social products and strengthen our advantages in hot trends and key verticals such as eSports and sports. Despite potential costs incurred in the short run, we could significantly enhance our competitiveness in content operations and improved the operating efficiency of the platform's traffic. Looking into the fourth quarter, we will continue to execute against our strategy of reducing costs and improving efficiency with more focus on adjusting our cost structure and optimizing resource allocation to ensure efficient operation of our company on the high uncertainty of macro environment and solidify our long-term competitiveness. Welcome to Weibo's Third Quarter 2022 Earnings Conference Call. In September 2022, Weibo's MAUs and average DAUs reached 584 million and 253 million, respectively, representing a net addition of 11 million and a 5 million users, respectively, on a year-over-year basis. We are pleased to see healthy engagement trends and video consumption despite the back-to-school seasonality and ongoing disciplined channel marketing strategy, demonstrating Weibo's scored by the proposition to users. Weibo's third quarter 2022 net revenue was $453.6 million, a decrease of 25% or 30% on a constant currency basis. Net income attributable to Weibo reached around $519 million, representing a net margin of 36%. Weibo's advertising and marketing revenues for the third quarter 2022 reached $383.4 million, a decrease of 27% or 21% on a constant currency basis, reflecting a caveat of marketing advertising market as we expected. With COVID resurgence and  mainly on the overall demand side, our advertising business continued on descending trajectory year-over-year, while booking a moderate sequential growth during the quarter. Ad revenues from Alibaba for the third quarter was $15 million, a decrease of 28% or 22% on a constant currency basis, which is generally in line with our overall advertising business performance. Value-added service, VAS revenues were $16.1 million in the third quarter, a decrease of 14% or 8% on a constant currency basis. Total cost and expenses for the third quarter were $291.5 million, a decrease of 19% as we implemented our efficiency initiatives to stabilize earnings. Operating income in the third quarter was $102.1 million, representing operating margin of 36%, improved from 32% in the second quarter. Under GAAP measure, income tax expense for the third quarter was $19.8 million compared to $31.4 million last year. Net income attributable to Weibo in the third quarter was $19 million, representing a net margin of 36% compared to 34% last year. As of September 30, 2022, Weibo's cash, cash equivalents and short-term investments totaled $3 billion compared to $3.1 billion as of December 31, 2021. In the third quarter of 2022, cash provided by operating activities was $74 million. Ended up to first $500 million share repurchase program authorized in March this year, we have repurchased a total of approximately 3.1 million ADS for a total cost of $157.7 million as of September 30, 2022, as means to return value to shareholders amid the turmoil market. I have a question related to the advertising outlook and sentiment in the fourth quarter as well as into the 2023, given the strict of COVID policy and also the weakness in the macro. However, you can see that talking about the e-commerce, they had actually great improvements because of the Double 11 shopping festival and also the Double 12 shopping festival as well, so that especially talking about the FMCGs. Like, for example, if we are talking about the new control COVID-control policy, especially the new 20 items that are issued by the government in controlling the COVID and also some of the similar policies towards the release industry, we are able to see a very good recovery of the consumption side. And also, lastly, I would like to say that if youâ\u0080\u0099re talking about the next year, so you can see that more people and also more customers are going to act their budget, especially on the performance-based ads. And also, even if we are seeing the slowdown of the new product launch, but still, we are seeing that more customers are actually choosing our platform as their kind of platform to launch the report and also the new product launch of percentage against the rest of the other budget is increasing, especially that itâ\u0080\u0099s quite obvious in the industry of luxury products and also the automotives as well. So third point is that in the next several quarters and also in the next year, weâ\u0080\u0099re going to still focus on the cost reduction as well as the efficiency improvement. That is to say that in Q3, weâ\u0080\u0099ve been keeping optimizing some of the expenses, for example, marketing and related to R&D and also operation as well. And also in Q2 and Q3 due to the COVID management and control policy, a lot of our offline events actually did not have or did not successfully hold. So also, if youâ\u0080\u0099re talking about the next year and also Q4 as well. So especially in the first half of next year so that, of course, weâ\u0080\u0099re going to further reduce the cost and also optimize the cost as well as improve the operational efficiency and also do a lot of work in terms of the optimization of our cost structure. For example, weâ\u0080\u0099re going to further concentrate and also doing more optimization works related to the expenses of marketing and also labor and human resources as well, so that weâ\u0080\u0099re going to improve our core competence by doing that. And also, if youâ\u0080\u0099re a very senior investors and following Weibo for a very long time, you should be nearing the story about 5 years before. So from 2017 to 2020, we had about the operational cost which was about 60% against our revenue and also in 2020, because of launch of new operational events and also businesses. And also in 2022 first half, because of the reduction of the revenue, this figure is going up further. So in the future, weâ\u0080\u0099re going to really focus on advantages and also the key characteristics as well as further improve our core competence and then having a better situation by doing a lot of further more work on the optimization of our costs and also cost structure, so as to improve our operational efficiency further. And also in 2023, of course, weâ\u0080\u0099re going to have a very stable plan for the growth of our operational margin and also really emphasize more, of course, on the investments to improve our core competency as well as launch most of our new businesses. And also, in the long run, while the market is fluctuating and also uncertain, definitely speaking, we have to keep a very good balance in terms of our development and also investment as well and also generate quite robust cash through all those means and also having a very good flexibility on our financial performance. But if youâ\u0080\u0099re talking about the first of all, the positioning and also the market influence also Weibo as a big social media platform. And also because of the importance and also the product of advertisement itself as a kind of a necessity or necessary product for the customers to actually launch the new products, we can see that the efficiency of the monetization by using the advertisement is actually the highest. And also, of course, that still, if youâ\u0080\u0099re talking about a fluctuated market, still, we do see a lot of pressure on the pricing of this particular advertisement. So second thing, in terms of our e-commerce and also the mini shop of Weibo, so actually, we are having a model of combining the platform with the product. And also, we can see that this is especially important for us to leverage the capability and also the advantage of Weibo as a platform and especially helping those offline organizations to actually have a very good select of the merchant and also helping to improve the quality of the users by guaranteeing a very good model of placing order within this particular station and also having to guarantee a very good agreement ulfilment and also the performance. And also, this is very good for us to actually bring a lot of monetization capabilities and opportunities for those content creators as well. And also, previously, in the last year, we had a lot of restrictions from the entertainment industry, and also that was a little bit impactful to our total business. But actually, you can see that while we are upgrading the benefits that we are providing to the users and also the members in specific, in Q3, we have seen that the revenues and also the loyalty of the numbers actually improved in Q3. And also, if you are sharing some of the colors on the V plus membership system, so we are having a kind of a year-over-year growth on this area and especially in the area of health care, Internet and also the other segment, we are keeping a very good growth year-over-year. So in the future, we are going to further enhance more functions and also dedicating ourselves into, for example, first of all, SVIP and also second is the V plus system, which is targeting in specifics, those are content creators. So this is a very good way for us to improve the monetization and also the revenue of the content creators, and also, this is going to be very beneficial to Weibo in the long run as well."
}