{
    "symbol": "AB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 15:45:29",
    "content": " Fourth quarter gross sales of $30.9 billion, declined by $9 billion or 22% from a year ago. For the full year, gross sales of $115.6 billion, were down 23% from the record prior year. Fourth quarter average AUM of $636 billion, was down 16% versus the prior year, while full year average AUM of $686 billion declined by 6%. In a challenging year for active managers, gross sales of $116 billion led to firm-wide net inflows of $900 million excluding AXA redemptions. US equity markets advanced during the fourth quarter with the S&P 500 up 7.6%, lessening the full year's 18% loss. Fourth quarter net outflows were $3.4 billion, contributing to full year net outflows of $11 billion, the latter driven primarily by taxable fixed income, a dynamic seen industry-wide. Part of their $10 billion permanent capital commitment to improve the returns while growing our higher fee longer duration private markets business, for which well-over half of the $10 billion has been deployed in our strategies at year-end. Full year gross sales of $17.5 billion, declined just 4% versus a strong prior year, with productivity remaining historically elevated down 2% year-over-year. Despite slight net outflows in the fourth quarter, the full year saw net inflows of $1.7 billion the second year in a row of organic growth, in the fifth and the last seven. For the full year, commitments of $1.8 billion to private alternative products were up 10%, which included the launch of Bernstein Impact Alternatives, a new third-party partnership. Fourth quarter Bernstein Research revenues of $100 million, decreased by 12% year-over-year and were up 10% sequentially. With the support of our strategic partner Equitable, we launched our active ETF business and closed on the CarVal transaction, which significantly enhanced diversification of our $56 billion private markets business, up 57% year-over-year. For the full year, GAAP net revenues of $4.1 billion decreased 9%, operating income of $815 million declined 33% and operating margin of 21.5% decreased by 580 basis points. Fourth quarter performance fees of $18 million declined by $116 million from the robust prior year quarter, primarily driven by lower fees of financial services opportunities, AB Arya partners and real estate equity. Full year performance fees of $91 million were down $131 million from the prior year, driven by lower fees of financial services opportunities US Select Equity Long/Short, AB Arya partners and private credit services. Full year revenues of $416 million, declined by 8% reflecting lower trading activity in Europe and Asia due to local market conditions. All-in our total fourth quarter operating expenses of $570 million decreased by 9% year-over-year, while full year operating expenses of $2.4 billion were flat with the prior year. Fourth quarter total compensation and benefits expenses declined by 13% from the prior year period, reflecting lower AUM-driven revenues and lower performance fees offset by a higher compensation ratio of 46.4% of adjusted net revenues as compared with 41.7% in the prior year period."
}