{
    "symbol": "ZS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-24 19:19:10",
    "content": " I'd like to remind you that today's discussion will contain forward-looking statements, including but not limited to the company's anticipated future revenue, calculated billings, operating performance, gross margin, operating expenses, operating income, net income, free cash flow, dollar-based net retention rate, future hiring decisions, remaining performance obligations, income taxes, earnings per share, our market share, and market opportunity. In a new logo win a Fortune 50 insurance customer signed a full year commitment for ZIA, ZPA and ZDX to securely enable 65,000 employees working from anywhere or comprehensive cyber and data protection, they purchased the high-end transformation bundle plus CASB, advanced DLP and SSBM or SaaS security portal management which is like CSPM for SaaS. In an upsell deal diversified industrial conglomerate with over 20 operating companies that previously purchased ZIA Transformation Bundle added ZPA for 16000 users to accelerate M&A integration and reduce business risk without having to connect two corporate networks with legacy firewalls, which could have taken 14 months or more our Zero Trust Exchange provided secure access to applications across both companies in weeks saving time and money. Our Zero Trust Exchange processes over 210 billion transactions in line and prevents more than seven billion security and policy violations per day, providing our customers an unmatched network effect for superior security to flawlessly run the world's largest security cloud with five 9s  of availability requires more than security expertise. For the full year fiscal 2022, we are increasing our revenue guidance to a range of $1.045 billion to $1.05 billion or year-over-year growth of 55% to 56% increasing calculated billings to a range of $1.365 billion to $1.37 billion or year-over-year growth of 46% to 47%, increasing our operating profit to a range of $95 million to $98 million, increasing our earnings per share to a range of $0.54 to $0.56 assuming approximately 149 million to 150 million fully diluted shares. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}