{
    "symbol": "VIV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 15:22:13",
    "content": " Now going to slide four, we had a very positive result in the first quarter 22 richly impressive mice on a 100 million axis, the largest ever in our history, and our postpaid customer base total 51 million axes in the quarter after growing 11% year over year, while our FTTH homes connected continue to grow remarkably 29% year over year. Such strong performance drove our top line to grow 4.6% year over year, the best and revolution we had since 2015, with mobile service revenues up 5.7%, while our fixed business expanded 1.9%, confirming the positive trends seem over the past couple of quarters. The goal here is to acquire a 10% to 20% stake in up to 20 growth stage startups with pre money valuation of over 100 million reais, which must be focused on providing innovative solutions related to entertainment, smart home, financial services, education, health, or another segments that have relevant cross sell potential with our current value proposition. On a lighter level, we present our topics evolution for the quarter, which was up 7% year over year, our cost of service and goods sold that represent 31% of our total expenditure grew 10% year over year, as we expand our exposure to high growth services, such as a digital solution being offered by B2B and b2c. Hi, good morning, everyone. So we understand that sort of in discussing the best network in the Northeast mainly where we are getting 12 points most of the 12 point 5 million customers where we have not only the best internet, mobile network but also the best channels, both offline and online and all the other assets that Vivo can leverage to offer to this customers, it's a lot to. Hi, good morning, everyone. So there are some price increase, still to be done in hybrid pure possibly this year, that may impact the total revenues, but we are very positive our commercial attractiveness and the ability to capture more customers, and also migrate customers from prepaid to postpaid."
}