{
    "symbol": "ADSK",
    "quarter": 4,
    "year": 2023,
    "date": "2023-02-23 20:32:05",
    "content": " While we fell short of the fiscal â\u0080\u009823 goals we set in 2016, our resilient business model and geographic, product, and customer diversification enabled us to deliver strong growth and report record fourth quarter and full-year revenue, GAAP and non-GAAP operating margin, and free cash flow. As weâ\u0080\u0099ve highlighted before, most recently on our Q3 earnings call, the switch from up-front to annual billings for most multi-year customers creates a significant headwind for free cash flow in fiscal â\u0080\u009824 and a smaller headwind in fiscal â\u0080\u009825. The transition will also affect the linearity of free cash flow during the year, with Q1 fiscal â\u0080\u009824 free cash flow benefiting from the strong billings in Q4 fiscal â\u0080\u009823, and our largest billings quarters in the second half of the year proportionately more impacted by the switch to annual billings. As I outlined earlier, the key drivers of that reduction are: changes in long-term deferred revenue as a result of the shift to annual billings for multi-year customers and a smaller multi-year renewal cohort, FX, and our cash tax rate. With all this in mind, our target planning parameters over the next several years will be to grow revenue in the 10% to 15% range and generate free cash flow margins in the 30% to 35% range with a goal of reaching a \"Rule of 40\" ratio of 45% or more over time. While macroeconomic and FX headwinds, along with sustained but disciplined investment in our products and platforms, will slow the rate of margin improvement, we continue to expect non-GAAP operating margins to be in the 38% to 40% range by fiscal â\u0080\u009826, albeit more likely now in the lower half of that range. As we look ahead, we're focused on managing the business to a Rule of 45 ratio or better, which after we get through this multiyear to annual billings transition, we think strikes the right balance between driving top line growth and delivering on disciplined profit and cash flow. So what I said was we have target planning parameters of 10% to 15% revenue growth and 30% to 35% free cash flow margin, all in pursuit of our goal of achieving a rule of 45-plus ratio over time."
}