{
    "symbol": "PTLO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 16:42:05",
    "content": " I would now like to turn the conference over to Barbara Noverini, Director of Investor Relations at Portillo's, to begin. Good morning, everyone, and welcome to our fiscal first quarter 2022 earnings call, which is also my first call as Portillo's new Director of Investor Relations. With me on the call today is Michael Osanloo, President and Chief Executive Officer; and Michelle Hook, the company's Chief Financial Officer. And before we begin our formal remarks, let me remind everyone that part of today's discussion will include forward-looking statements. Finally, after we deliver our prepared remarks, we will open the lines for your questions. Let me now turn the call over to Michael Osanloo, President and Chief Executive Officer. Thank you, Barb, and welcome to the Portillo's family. Barb is also a lifelong Chicagoan, so she's going to be a great resource to help our analysts and our shareholders better understand Portillo's and our growth journey. Same restaurant sales grew 8.2%, which reflects strong demand for Portillo's, demand that comes from our continued focus on delivering a great experience and amazing food at an unbelievable value. We continue to produce healthy profitability, generating almost 21% restaurant level EBITDA margins, which puts us in a unique class in the restaurant industry. We've got the runway to sustain long-term adjusted EBITDA growth and, more importantly, we're a growth company. While we may be new to the public markets, we're a 59-year-old brand with a long history of success and a solid foundation upon which we'll continue to build. Our first Portillo's pickup location in Joliet, Illinois just celebrated its 3-month anniversary and continues to perform above our expectations. We also recently celebrated the opening of a beautiful restaurant in St. Petersburg, Florida. It's early, but we're thrilled about how this restaurant is performing and how guests in St. Pete have responded to us. Similar to Joliet, it's also performing above our underwriting expectations. We now have 4 restaurants in Central Florida, and we'll continue to build that market in '22 and beyond. We're scaling operations in Arizona with another restaurant in the Phoenix suburb of Gilbert and our first entry into Tucson, both slated to open later this year. And of course, we can't wait to open in Texas at Grandscape in The Colony. That's the name of the town, The Colony. We've already identified some of our next sites and, even more importantly, we've identified the operators who will grow and build that market for us. And you may have noticed recently that we've announced openings in the Orlando suburb of Kissimmee and Schererville, Indiana. That will take us to 7 restaurants this year, meeting our 10% commitment. I can't talk about our exciting development pipeline without sending my thanks to Sherri Abruscato, our inspiring Chief Development and Supply Chain Officer who's retiring this summer after 44 years of service. Sherri started with Portillo’s as a teenager and her hard work, dedication and ambition led her to the C-suite. To fill her shoes, we're actively searching for a Chief Development Officer who will execute our rapid growth pipeline with the same unwavering commitment to our values. It's those values, family, greatness, energy and fun, that allow us to be this confident about our growth trajectory. People are the heart of Portillo’s, and we know they're the linchpin to our success so we prioritize our team members' experience. We know that our teams are more engaged when in a fun, supportive and efficient work environment. We're creating unrivaled team member experiences, treating them like family and it's working. Today, I want to highlight 3 main points about our resilience both as a company and as a high-growth restaurant concept. First, we have very attractive profitability predicated on great revenue. That revenue drives plus-sized profitability, which gives us the financial flexibility we need to continue investing for growth. As experienced restaurant operators, we're able to categorize cost pressures into those we see as transient versus those that are likely more permanent. Our response is to continue to limit the magnitude, duration and timing of input cost increases through fixed-price contracts. Occasionally, we do see a stair step change in cost that signals a more permanent change. And as you know, wages in the restaurant industry are resetting to reflect the more demanding, competitive labor environment, and that's not changing anytime soon. So again, focusing on what we can control, we ensure that as a company, one, we offer our team members a compelling opportunity they can only get a Portillo’s; and two, our team members are as productive as possible. In fact, we've implemented some operational efficiencies this year that have had a measurable impact. Third, we don't wait until times are tough to look for efficiencies across our business. By upgrading the user interface, guests who order through our app or website can now customize their orders in just a few clicks. Bottom line, this translates into more digital sales and this improvement is holding. And finally, as I mentioned in the past, the commitment to our Portillo's family is why our turnover continues to trend better than the industry average. At the start of the first quarter, we were still understaffed at a few locations. Now, we're very proud to say that we're back to pre-COVID staffing levels. We see better order accuracy, speed of service and overall satisfaction. When you have a good experience, you'll be back. In March, we achieved the highest order accuracy and the highest customer satisfaction scores that we've seen in the past 24 months. On last quarter's call, we talked about being an oasis for our guests. We want to be that respite even in the face of high inflation, high gas prices and increased concern over global volatility. We will remain that fun, welcoming place that our guests can take their family for a convenient, delicious, high-quality meal at a great price point. While we've raised prices to counteract some of the input cost pressures we've seen, we're still mindful of preserving value for our guests. That said, when we have taken price, there's been little to no resistance or elasticity effect. At the end of the day, we're on track. It's going to have its ups and downs, but we know how to manage our business for that. With that, I'll hand it off to Michelle to share more details of the quarter. Thank you, Michael, and good morning, everyone. During the first quarter, we saw strong top line growth, but cost pressures did impact our bottom line. However, we remain confident in the fundamentals of our business model and remain committed to our long-term strategy. Revenues were $134.5 million, reflecting an increase of $17.2 million or 14.6% compared to the first quarter of '21. This was driven by an 8.2% increase in same-restaurant sales, combined with the opening of new restaurants in '22 and '21. As previously mentioned on our last call, we did see a negative impact on our sales during the first several weeks of January as a result of Omicron. In March, our same-restaurant sales grew 2.5% as we began to roll over a tougher comp of 24.6% in March of '21. When you look at our first quarter cap on a 3-year stack basis, we grew 6.8%, which is in line with our long-term target and speaks to the consistency and durability of our brand. This increase was largely driven by a 15.7% average increase across all commodity prices with higher impacts in pork, chicken and beef prices. Additionally, cost of goods sold was negatively impacted by 1.9%, resulting from the change in recording third-party delivery pricing. As Michael stated earlier, we ultimately view commodity market volatility as transient, but we are taking measures to limit the magnitude, duration and timing of cost increases in key input categories. We have locked in pricing on almost 80% of our beef flats, and we continue to actively look to fix pricing in other areas when opportunities arise. As of today, we have almost 55% of our commodity basket locked in for '22. As a reminder, in March, I provided a range of 13% to 15% expected increase in our commodity basket in '22, and we are currently forecasting to be at the higher end of that range in the second quarter and for the full fiscal year. All told, we are doing a lot to mitigate the more permanent labor cost pressures that Michael described earlier. Labor does continue to be more productive versus pre-COVID levels, and more recently, we have put additional efficiencies in place to further optimize our labor. Other operating expenses increased $0.5 million or 3.1% in the first quarter of '22, and occupancy expenses increased $1 million or 14.3%, both the result of new restaurant openings in '21 and '22. The decrease of 460 basis points was driven by the impact of increased commodity costs, which we believe to be transient and, to a lesser extent, labor inflation. To combat these headwinds, during the first quarter, we increased menu prices approximately 1.5%, and we expect additional menu price increases during the second quarter of '22. As you may recall, we had taken 2.5% of price last April. And if we did nothing in Q2, we would be at approximately 4.5% pricing for most of Q2, which in this environment, does not meet our objectives. The majority of our G&A increase was due to these specific items, and we are carefully managing underlying expenses in this inflationary environment. All this led to adjusted EBITDA of $17.6 million in the first quarter of '22 versus $18.5 million in the first quarter of '21, a decrease of 4.9%. Below the EBITDA line, interest expense was $6.1 million in the first quarter of '22, a decrease of $4.6 million from the first quarter of '21. So like Michael said, we're on track. The structure of our business allows us to grow same-restaurant sales by low single digits on average, check. Our solid development pipeline is on track to deliver 10% unit growth this year, check. Our revenue growth is in the high single to low double digits, check. And while our EBITDA performance is a bit wonky this year and is under some industry-wide pressures, we haven't had to slow down and we certainly feel confident in our long-term growth algorithm. And with that, I'll turn it back to Michael. Before we open for questions, I just want to revisit our commitment to our guests. As experienced operators, we understand what it takes to build and sustain an obsessed fan base. We know it's crucial to deliver our delicious menu, our value-driven price point and our unrivaled experience. This foundation has allowed Portillo's to be a success for the last 59 years through multiple recessions, oil embargo, the dot-com bust, 9/11, housing market crashes, wars, pandemics, et cetera. Like we said in March, we have demand. And with that, let's turn it over to the operator for questions. Let me -- I'll give you some overview, John, and I'll let Michelle give you a little bit more detail. In general, I'd tell you we're very, very happy with all of our openings. So even opening in the winter, out of season in Westfield, we're very happy with that restaurant. We -- as I think you know, we changed dramatically the way we open new restaurants to make sure that we are aggressively training management at those new restaurants so they know the Portillo's way, they know what our guests expect. We will do $5,000, $6,000 hours which, in some businesses, is a good day. We handled enormous volumes with grace, and that business is really doing well for us. And it's important because, as you know, Central Florida is a big growth opportunity. So every time we open successfully, we continue to enhance our brand and continue to expand our opportunities. Yes, John, just to add on to what Michael was saying. So in terms of Westfield, West Madison and Joliet, when you think about when those restaurants opened during the winter months and given the locations, there's definitely some seasonality we saw during the first part of those openings. But to Michael's point, what I will tell you is that they are performing above our underwriting expectations and we feel really good about that. With St. Pete, having their grand opening on April 5, early indications are very good there as well. And Michelle, just on wages, I understand there's pressure industry-wide. You took a big step up last year, though. But to your point, we put substantial increases in place in June of last year. And so I do expect, as you look at the comparability year-over-year when you get towards that back half of the year for that comparability to ease some. But we do expect to put in some more rate increases this year, but not to the extent that we had to do in June of last year. It's actually a great insight on your part, so we will do that. But anecdotally, I can tell you it's exactly what you described. When we have fully staffed restaurants, we see that the guest satisfaction measurements, things like order accuracy, speed of service, all of those metrics tick up, which in turn yields better comp sales and better profitability. So your intuition is 100% right, and we will certainly look that number up. I know it's kind of detailed, so thanks. The reason why I wanted to make sure to call out a 3-year stack was because if you go back and even look sequentially, when you look at what the 3-year stack was in '21, I think you truly do see the consistency of our performance on a 3-year stack basis. So for me, I'm going to continue to look at all metrics, Nicole. We're going to look at, obviously, the cap, the 2-year stack to 3-year stack. But yes, I think that, for me, is a good metric that kind of removes some of that noise, and to me, looks at what we want to deliver on a long-term comp basis and us being able to do that and deliver that. Price in the first quarter, we were up 7.1%, and the next was 0.4%, Nicole. Michelle, just kind of revisiting the commentary on the 3-year comps. Our math would indicate it might have been a little lower than the full quarter on a 3-year comp, but I know there's all kinds of wonky comparisons. I definitely wanted to make sure, David, that on a 3-year stack basis, right, that -- to the point I made with Nicole earlier, that we made sure you guys understood that consistency. And then March, the point I wanted to get across there was when you look at the comparison on what we were rolling over, we started to comp over a tougher comp compares starting in March, which is going to continue in Q2. But to your point, like if you just were to look at March alone, the 3-year stack is very healthy, if you just were to isolate March alone. It would be roughly around 9%, David. And then -- and is that -- I guess, the second question I have -- that helps very much. And then the second question I have is just on the pricing, I don't think you mentioned the amount that you're planning to take in the second quarter. I think, David, we didn't give the Q2 pricing because it's still TBD at this point. So obviously, I'll let you guys know what that is next quarter. We want to definitely continue to price at or below inflation, and so that's how we're thinking about it. But like I said, if we did nothing, right, we would be at about 4.5% pricing when you look -- when that pricing started to roll off. And so we want to make sure we get back up to the levels that we were at before, and again, with the guiding principle that we want to be at or below inflation. And just a couple of clarifying questions, please. But just trying to understand the idea of kind of negative traffic in the quarter, given that Omicron, I think, was primarily dissipated by the middle of January. So that's the first clarifying question, and then I just have a quick question about labor, please. Well, thank you for answering your own question because you're 100% right, Sara, that it is -- it's still an order aggregation thing. And so I think that the transaction noise is exactly what you were implying, which is that when people go through the drive-through, it tends to be you're feeding more people per transaction. When people come into our restaurant, it tends to be you're feeding fewer people per transaction. I look at that number of 1.7% up on entree, sandwiches, salads, et cetera, and that gives me solace to know that we're feeding more people. And then just on labor, Michelle, can you just help me think through, like going forward, if I look at the change in your labor as a percentage of sales, it kind of looks like exactly what I would expect in terms of high single-digit pricing and low double-digit labor inflation. No, Sara, we started to put things in place in March and started to see in March some, what I would describe as meaningful improvement in labor efficiencies. And so I would expect us to continue to see those trends within Q2 and beyond, but understand too that, like I mentioned before, there are additional rate increases that we do have to put in place yet this year. But we are definitely seeing improvements in labor through the efficiencies we put in, in March. Just wanted to check, I appreciate the deck that you put out with the quarter. Yes, that's exactly right. Municipalities have been slow to rebound, and so that's what's slowing us down. So we're either -- got shovels in the ground, actively building the other 5 still, Andy. And I think what Michelle shared, which I think is important to recall, is that we're lapping some lofty numbers. We're confident about the consumer demand that we have, but you got to be cognizant of the fact that we have some big numbers we're lapping. And Andy, I mentioned lapping the 25% in Q2. April alone, we were lapping a 34-plus comp. So as Michael said, we're going to keep that elephant in the room but want you all to be mindful of those tougher laps in Q2. We had a little bit of that in there, Andy, that did impact us in terms of some labor pressures in Q1. Here's what I'd say, Chris, is we are -- we want to take wage off the table for employees as they make decisions on where to work. And we see pockets in our system where we might be a hair behind some of our competitors, and so we are going to make some investments. The key to our success, our algorithm when it comes to labor is take wage off the table as they come in and then provide fantastic culture, training and development so that our turnover is lower than everybody else's in the industry. When you have turnover that's just higher than average, you're spending a lot of money to recruit, train, bring in new people. There are some pockets where we have to make some small investments and then train the heck out of people, make sure that they are loved and appreciated and are enjoying their experiences at Portillo’s. And then, Michael, you mentioned measurable efficiency improvements. I'll give you one example, and I give a ton of credit to our operators because this is something that they found. On the long part of the L is the traditional sandwiches, burgers, hotdogs, beef, et cetera. On the short side, we had what we call our salad bowl, where we assemble salads -- scratch salads, and they're amazing. Our team members said, \"You know what, we would be a lot more efficient if we could move the salad bowl over to the main part of the L. There's some space in the back near where the drive-through lanes are. And we took the salad bowl area, we moved it to the back of the line in a bunch of restaurants. It creates labor efficiencies because if those folks are slow, they can slide over and work on another station. It creates guest efficiencies because in a traditional Portillo’s, if you ordered a burger and a salad, you actually had to pick it up in 2 separate places. And then if I look at 2018 and 2019 before the pandemic, typically, you would seasonally see a couple of hundred basis points or more lifts second quarter relative to first quarter. Yes, Sharon, I don't want to get into intra-period margins, so I'll -- I'm going to punt on that one. But I will say to you, when you look at the trends -- and I think you hit it. When you look at our Q2 trends and you look at higher revenues traditionally in Q2 and Q4, in those periods for us, you start to leverage a little bit more. I think when you look at that and given some of the things Michael just mentioned, from a labor efficiency standpoint, my expectation would be, again, and not getting into detailed numbers, that we would see improvement in margins in Q2. I think the --\n Sorry, go ahead. The trend -- you were asking about what's happened in Chicagoland with the lifting of the vax mandate, et cetera. In Q1, what we saw is that our inside sales came up to 40% of our mix. And that was in the 20s, a year ago. It's not back up to the low 50s that it used to be, but it's improved. And so we're cautiously optimistic that there's more improvement, more people coming into the restaurants. So we're cautiously optimistic, but I would -- I'm hesitant to bank on it or plan for it. On the G&A line, Michelle, you had originally, I think, expected $70 million to $75 million this year. I'm not going off of that yet, Sharon, because we do have investments. Remember, we're definitely in growth mode. So if we are -- if we continue to trend at those levels, and we're definitely carefully managing that line like I mentioned, I'll update you all next quarter. But to your point, we're trending more lower than that, but I still believe for the full year that's a good range. Michael or Michelle, I'm curious if you could touch a bit on kind of what you're seeing from customers of late. I know, Michael, you mentioned no pushback on the pricing at all. I assume customers can't do without their cake shakes, but if there's anything notable that you would mention of late, be interested there. I would say overall, there is very little change in mix and sales patterns, et cetera. We are seeing a slight -- very slight uptick where people are going from a regular beef sandwich to a big beef sandwich, from a regular burger to a double burger. But the underlying consumer demand, the frequency with which they visit, how much they're eating, all that's pretty stable, Dennis. And I know last quarter, I think we talked about the higher build costs that you and the industry are seeing, and despite all that, your ability to kind of continue to see those solid returns. So I'm just curious, as we think about the strength, early days that you're seeing in Joliet and St. Petersburg, is it sort of stronger sales? But I think Joliet certainly was on the low end, given its size. Joliet, as I think everyone knows, is a drive-through-only concept for us. And so it is a bit of a pilot and experiment, and it's been fantastic so far. As a class, they're performing very, very well. And I would say, as a class, they're performing above our underwriting expectations. But as a class, we're very, very excited by the classes of 2021 and the early '22s. So obviously, turnover in the restaurant industry are some lofty numbers. You see some restaurant companies, very, very high turnover levels approaching 200%. We're still in the low 100%, which in this industry and at this time, represents a 20 to 30 percentage point benefit versus others. Just on the hedging, Michelle, that you mentioned, I think it was -- you were 50% for the rest of the year. And Greg, just to be clear, so for the full year, we're locked in at that almost 55% market basket. And so -- and I will tell you that our biggest concentration, which I mentioned being the beef, we're locked in at a rate that was below our own internal budgeted projections. And obviously, when you look at the other commodities, most of those are locked in, in Q2. And when we look at the Q3, Q4 locks on those, you obviously weigh what the cost is of locking in at that given certain prices. And so like I said, when opportunities arise, we're going to lock in. But I think when you look -- to your question on forward projections, right, that's where I'm not going to lock ourselves into something now knowing that there could be opportunities in the future. Because, as you know, when you look at forward projections, we do expect some easing. And like we said, we know these pressures are more transient. So we're not locking into really longer-term numbers because we do think, as you look into '23 and '24 that, again, we would expect and hope to be some easing there. And with that, we will conclude today's conference call."
}