{
    "symbol": "PTLO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 14:58:06",
    "content": " During the fourth quarter, revenues were up $150.9 million reflecting an increase of $12 million or 8.6% compared to last year, driven by 6% increase in same restaurant sales combined with the opening of five new restaurants since the beginning of the fourth quarter of 2021. Other operating expenses increased $3 million or 20% in the fourth quarter of 2022, which was primarily driven by new restaurant openings in 2021 and 2022, as well as increases in repairs and maintenance expenses. I would just add on to what Michael's saying in terms of the pricing and the margins with the pricing that we put out there with the 2% we took in Q1, we'll be at around 9%-ish in the first quarter of '23, and then we'll be then lapping a price increase in mid-May. I know you mentioned it's going to drop off as the year goes on and it would be lower than the fourth quarter sequentially in the first quarter, but there's a lot of room to be lower than 14.5%. But keep in mind, when we open a new restaurant, it's -- I would really be hesitant to draw any conclusions about margin in the first couple of quarters because we have a new restaurant opening team helping out. You can -- when you're first in market, you're at a new restaurant, it's really important to provide a great experience or you're going to chase people away for a long time. But I think that when you think about the overall margin profile of Portillo's, as Michael mentioned in his prepared remarks, we're committed to improving that despite the restaurant openings in '23, because we know, and we've talked about that we purposefully had margin degradation in '22 because of our price laggard approach and so that is what we're looking to do in '23, despite the openings. I don't like the word cheaper, so it's got to be lower cost for still a gorgeous inviting, engaging and we have to be thoughtful that the restaurants that we're signing up for that the revenue will still greatly achieve all of our aspirations for returns. Can you talk just a little bit about the recent sales trends you're seeing to start one 1Q, particularly January number is really strong and I think the whole industry's had a little bit of a pickup, but the industry may have easier comparisons, and I think you guys have topper comparisons."
}