{
    "symbol": "ALLO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 22:48:02",
    "content": " Just last month, the first autologous CAR-T therapy was approved by the FDA as a second line treatment for adults with large B celll lymphoma that is resistant to initial therapy or relapsed within one year of the start of the frontline treatment. Based on our experience with ALLO-501A, we project that at scale we can manufacture approximately 20,000 patient doses annually and reduce the number of required manufacturing runs hundred fold as compared to autologous CAR-T therapies, while importantly, delivering this product on demand to any eligible patient in need. Our clinical teams have been incredibly engaged with clinical trial sites and investigators as we enroll patients across four active studies, UNIVERSAL for ALLO-715 and IGNITE ALLO-605 in relapse or refractory multiple myeloma, TRAVERSE for ALLO-316 in renal cell carcinoma and the extended Phase 1 portion of the Alpha 2 trial for ALLO-501 in relapse or refractory large B cell lymphoma. Notably, in March, we announced the publication of preclinical results in cancer research communications, which demonstrated strong evidence of the superior long-term myeloma killing activity of allogeneic anti BCMA CAR-T cells manufacturing from healthy donors compared with anti BCMA CAR-T cells from patients with multiple myeloma. Last month, we presented preclinical data, the 2022 American Association for Cancer Research Annual Meeting, which supports the clinical evaluation of ALLO-316 for the treatment of patients with renal cell carcinoma and other CD-70 expressing tumors. We actually are very pleased by the pace of our BCMA program, you know about our data at ASH, which resemble very much the data with Abecma, we’re using 320 million cells where we had over 20 patients worth of data with responses upwards of 70% and VGPR+ in the 46% range, and this was relatively early data. I mean, this is of course many different -- in different aspect of manufacturing, not just manufacturing the cells but analytic assay development and deployment, continuously improving the manufacturing process and also taking care of all the supply chain issues, including distribution of AlloCAR T products to multiple clinical sites."
}