{
    "symbol": "INNV",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-13 21:42:02",
    "content": " Revenue grew 9.5% to $698.6 million for fiscal year 2022, primarily driven by member month growth and a mid-single-digit increase in both Medicare and Medicaid rates. Fourth quarter revenue decreased by 2.5% to $172.9 million compared to the previous quarter, primarily due to decreased member months as a result of the ongoing enrollment sanctions in Colorado and Sacramento. External provider costs for the full year were $383 million, 23.8% higher than the prior year, and $98.7 million for the fourth quarter, a decrease of 4.4% compared to the fiscal third quarter of 2022. The cost per participant drivers include: one, the lingering effects of COVID from the third quarter kept inpatient costs elevated associated with higher acuity and drove greater post-acute care utilization; two, increased housing utilization in assisted living and nursing facilities; three, increased permanent housing rates as mandated by certain states. During the quarter, external provider costs declined 4.4% from the fiscal third quarter of 2022, due to a decline in post-acute utilization, as the impact of increased utilization in the third quarter, particularly from COVID began to subside. Our cost of care, excluding depreciation and amortization of $180.2 million was 16.7% higher year-over-year, driven by an increase in member months and the overall cost per participant. The primary cost drivers include increased headcount as we continue to make progress filling vacancies, adding approximately 150 new employees over the last six months, higher wage rates and temporary labor associated with the ongoing competitive labor market, the financial impact on operations as a result of all centers being opened for a full year, and preopening losses associated with new de novo locations. Sequentially, cost of care increased 9.5% to $50.5 million due to increased headcount as we continue to fill vacancies and increased labor costs associated with ongoing audit remediation and compliance efforts, some of which will be temporary in nature. Center level contribution margin, which we define as revenue, less external provider costs and cost of care, excluding depreciation and amortization, was $135.4 million for the fiscal year ended June 30, 2022, compared to $174.1 million in the prior year. Sales and marketing expense was $24.2 million for the fiscal year ended June 30, 2022, increasing 8.8% year-over-year, primarily due to an increase in headcount and costs associated with organizational realignment. For the fourth quarter, sales and marketing expense of $5.1 million decreased approximately $1.1 million, or 17.2%, compared to the third quarter, primarily due to lower marketing spend as a result of the sanctions. Adjusted EBITDA, which we calculate by adding interest, taxes, depreciation and amortization and onetime adjustments for transaction and offering related costs, and other nonrecurring or exceptional costs to net income, was $34.3 million for the fiscal year ended June 30, 2022, compared to $85.3 million in fiscal year 2021. The decrease to adjusted EBITDA compared to the third quarter was due to elevated inpatient costs as a result of higher acuity, increased housing costs, additional costs associated with audit remediation and compliance efforts, higher cost of care due to a competitive labor market and increased headcount. For fiscal year 2023, we are expecting a combined net mid-single digit rate increase comprised of the following: A low single digit Medicare Part C increase partially as a result of sequestration fully resuming in July; a mid-single digit Medicare Part D increase; and for Medicaid, a mid-single digit rate increase inclusive of 10% in Colorado, which includes go-forward funding effective July 1 that offsets the increase in assisted living facility rates that went into effect in January; 5% in Virginia; 3% in Pennsylvania, effective January; no rate increase in fiscal year 2023 in New Mexico; and as previously disclosed, a mid-single digit rate decrease in California effective January 1, 2022. We expect external provider costs to remain elevated compared to historical levels, in part due to the post COVID acuity effect on our participants, although tapering in the near-term relative to the second half of fiscal year 2022."
}