{
    "symbol": "INNV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-15 00:40:03",
    "content": " They include: first, creating operational excellence as a provider by formalizing a repeatable blueprint to deliver personalized, integrated, yet distributed care in our centers virtually and in home; second, expanding our payer capabilities to ensure we’re effectively managing the total cost and quality of care, and that our revenue accurately reflects the acuity of the populations we serve; third, strengthening enterprise functions to enable our centers to reach their full potential through robust talent management, data analytics, sales and marketing, and government relations, underpinned by a uniform way of working and success metrics. To elaborate, I’ve established eight initiatives that are intended to support the remediation of audit identified deficiencies, and earn back the trust of all stakeholders: one, filling critical personnel gaps at each of the centers, it all begins here; two, standardizing the process of our interdisciplinary care teams who plan and coordinate and deliver care; three, strengthening our home care network and reliability; four, improving timeliness of scheduling and coordinating care with providers outside the centers; five, improving our telephonic channel response times and closing critical communication loops; six, improving the efficiency and reliability of transportation for our participants; seven, standardizing our wound care program across the enterprise; and eight, reducing documentation outside of the EMR. External provider costs in the third quarter were $103.3 million, a 37% increase compared to the third quarter of fiscal year 2021. While some of this variance is due to census growth, the main drivers of the increase are: one, an increase in inpatient and medical respite utilization and acuity as a result of the Omicron surge; two, increased housing utilization; and three, increased housing rates as mandated by certain states, including an ARPA funded public policy adjustment in Colorado that increased assisted living rates by more than 30% effective January 1, 2022. Our cost of care, excluding depreciation and amortization, was $46.1 million for the third quarter, a 16.5% increase over the third quarter of fiscal year 2021, driven by an increase in census and an increase in the overall cost per participant. The 12.7% per member per month increase is primarily due to: one, higher wage rates associated with a competitive labor market; two, additional labor cost associated with ongoing audit remediation and compliance; three, greater operational costs due to the reopening of our centers that were closed during the pandemic; and four, pre-opening losses associated with de novo locations. Cost of care increased by 7.4% over the second quarter of fiscal 2022 primarily due to additional labor costs associated with ongoing audit remediation and compliance, one-time cost of approximately $400,000 associated with organizational redesign in increased headcount as we make significant progress in filling vacancies, and costs associated with the annual reset of employee benefits and taxes. Center level contribution margin, which we define as total revenue less external provider costs and cost of care, excluding depreciation and amortization, was $28.0 million for the third quarter compared to $41.4 million in the third quarter of fiscal 2021, and $41.4 million in the previous quarter of fiscal 2022. Sales and marketing expense for the third quarter was $6.1 million, an increase of approximately $600,000 compared to the third quarter of fiscal 2021, and was primarily due to increased headcount over the prior year, coupled with one-time cost related to organizational realignment, partially offset by a reduction in marketing spend associated with the ongoing enrollment sanctions. Adjusted EBITDA, which we calculate by adding interest, taxes, depreciation and amortization, one-time adjustments for transaction and offering related costs and other non-recurring or exceptional costs to net income, was $1.9 million for the third quarter compared to $20.3 million in the third quarter of fiscal year 2021 and $14.8 million in the previous quarter of fiscal year 2022. The quarter-over-quarter change in adjusted EBITDA and adjusted EBITDA margin is primarily a function of increased external provider costs and increased cost of care, offset by reduced marketing spend and lower corporate general and administrative expense as a result of one-time cost associated with leadership changes in the second quarter. Your line is now open. Your line is now open. Your line is now open. Your line is now open. That’s really helpful, Patrick. That’s really helpful, Patrick. Your line is now open."
}