{
    "symbol": "LAZR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 21:35:22",
    "content": " That scale now, obviously that's like in years from now here, but I think that it makes a lot of sense now, obviously there's a significant software value that's contributed on top of that too, that arguably you could say the cumulative value that you're providing for this -- with the hope between hardware and software is into the thousands even in a standardized case. And -- but I think this is one of those things that is just so fundamental that partner is great, but let's continue to be able to industrialize this stuff because one other aspect is you have to be able to make sure that you can actually have auto grade components for a series production product. And this is obviously a fundamental differentiator versus everyone that's historically use the same low performance off-the-shelf components that are available readily from the existing components suppliers that are around for decades, which just doesn't get you anything close to the level of performance capability that you need, or the economics needed to be able to truly deliver this in series production for what's needed. I think it's fair to say that for our nearly a dozen major commercial wins that, nearly all of them either have identified, either the lead programs that we have been working with them on for some time or have certain or developing on a specific platform as part of something that they are still figuring out the details for what specific models and that they'll launch and everything. That's not to say that there won't be more in the future as part of this than there will be, but would say when it comes -- this is all enabled by the fundamentals of these core components from the companies that we've acquired from the design direction of everything that we've had within Luminar from the -- LiDAR engineering experts. And that's why people were so shocked to see folks like and folks in the industry like Nissan as mass market folks starting to adopt this\n And David, one unexpected benefit that we're starting to see and look at still early innings is now that we have the BFE optic ration and freedom teams, all on the same side and wearing the same Jersey in kind of our R&D work, just having all those bright individuals sitting at the same table and brainstorming on where to take the next generation of the product. But yes, in terms of additional opportunities, I mean, absolutely, like it's the same kind of thing of when we were, I mean -- when we were first talking to OEMs about dynamic pricing models and subscription pricing models and all these other things there, people are now taking a page out of a book to be able to actually implement these things all the way down to the consumer level in some cases."
}