{
    "symbol": "LAZR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 21:49:04",
    "content": " But I think starting off at Luminar Day there, too, we are going to get and when the facility comes online, we will probably get into a little bit more detail or at least I am talking with the finance team, how do we get more detailed metrics around the specific unit economics and other kinds of things in terms of the things that we can do. Some of this development -- program development revenue, the cash payments associated with those tend to happen at the end of the year, whether thatâ\u0080\u0099s December or January is going to determine -- itâ\u0080\u0099s probably going to be the biggest contributor on what Q4 is going to look like, but I think ultimately, itâ\u0080\u0099s going to look like Q2 and Q3. And then, ultimately, once we get to that ramp up in scale in the second half of the year when the new facility comes online, I think, that thatâ\u0080\u0099s when you are going to start to see some real improvements as opposed to step function increases and what our current cash spend rate. But maybe help me think through or sort of the roadmap from thereon, like, what are the key metrics you are trying to improve to drive higher confidence to get that software from where you are maybe showing us the improvements at CES to automakers signing off and saying, okay, highway autonomy is good to go on the road, like, what are those key sort of portions of the software stack you are really trying to improve in terms of metrics and any insights there would be helpful to get us more confident about that eventually getting a larger sort of relevance with the automaker customers as well. And I think the most important thing, though, too, is just at the fundamental level, people can mix up terms of, like, when it comes to, like, these autonomous vehicle companies out there that when people associate autonomy and they are like, oh, itâ\u0080\u0099s not happening, nothing is here, all this stuff and all this skepticism, itâ\u0080\u0099s really around the robotaxi like Waymo, Cruise, Argo, Aurora, Zoox, Motional, like all those companies who kind of bucket into there like. Itâ\u0080\u0099s also a strategy question as well where most of the divisions of the software divisions have just fundamentally taken a wrong term strategy in the broader industry there, too, and thatâ\u0080\u0099s why you see like dramatic blow-ups and shutdowns, because itâ\u0080\u0099s not like you can just like pivot the code to like go towards consumer cars in a completely different application. One is it increases the value in the ASPs when it comes to like a fundamental LiDAR standpoint in terms of what you can do and what you can enable and thatâ\u0080\u0099s why, I think, itâ\u0080\u0099s probably -- I think itâ\u0080\u0099s kind of a surprise to many in terms of like the kinds of ASPs that we get already for products as it stands now and the relative share of value that we have from an OEM standpoint going into market. Well, I think, itâ\u0080\u0099s fair to say, like, for anyone that is on sort of what we call, like, fishing expeditions of things like they are not really serious about doing something, then you are probably going to think twice around investing billions of dollars more immediately. So, I think, thereâ\u0080\u0099s different parts of each of these things in general, when we look at some of the vertical integration that we have done, whether itâ\u0080\u0099s with Black Forest Engineering, OptoGration or more recently Freedom, which by the way, we will take an opportunity to talk about the bigger picture strategy with all this coming Luminar Day in the first quarter of next year. If you take a look at kind of the five-year view, there is stuff that we are already doing today thatâ\u0080\u0099s getting integrated and then there is stuff that gets implemented for next generation of products and thatâ\u0080\u0099s where you continue to see that exponential benefit when it comes to both a not as a performance standpoint, but even in an economic standpoint, as well as we vertically integrate across the Board."
}