{
    "symbol": "LSEA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 19:24:03",
    "content": " Landsea Homes reported net income of $13 million or earnings of $0.28 per diluted share in the first quarter of 2022, a significant improvement over the net loss of $7 million or $0.16 per diluted share we reported in the first quarter of 2021. On an adjusted basis, which excludes the impact of purchase price, accounting for acquired inventory and losses associated with the remeasurement of warrant liability, net income for the quarter was $32.1 million or $0.71 per diluted share. We also ended the quarter with 1,605 homes in backlog with dollar value of $930 million, putting us in a great position to deliver on our goals for the remainder of the year. 2022 is off to a great start for Landsea Homes as we exceeded our stated guidance for new home closings and average sales prices in the first quarter, achieved solid profitability and generated strong orders that resulted in a company record backlog both in terms of units and value. In total, our community sold 637 homes during the quarter at an average selling price of $650,000 for a total of $414 million and enjoyed a monthly absorption rate of 3.9 per community. The team delivered 552 homes at an average selling price of $540,000 for home building revenue of $298 million during the quarter, a 93% improvement over the same period last year. On an adjusted basis, excluding the effects of purchase price accounting and interest in cost of home sales, our home sales gross margin increased to 29%, reflecting that the team continues to have the ability to increase pricing more than offset the cost pressures we have been experiencing. We ended the quarter with 1,605 homes in backlog with a total dollar value of $930.4 million at an average sales price of $580,000. For the full year 2022, we are reiterating our previous guidance of new home deliveries to be in the range of 2,700 to 2,900 homes; selivery ASPs to be in the range of $500,000 to $515,000; and home sales gross margin to be in a range of 20% to 22% on a GAAP basis, or 22% to 24% on an adjusted basis."
}