{
    "symbol": "SCS",
    "quarter": 4,
    "year": 2023,
    "date": "2023-03-23 11:22:05",
    "content": " As it relates to volume, we expect a decline from large corporate customers, which is being driven by our lower beginning backlog, but is expected to improve over the course of the year and we expect this decline to be partially offset by volume growth across the customer segments of education, health and small to mid-sized corporate companies. We believe volume growth across our education, health and mid-market segments will help offset some of the expected decline from large corporate customers and we believe the tide is turning and return to office for our larger customers, which will help drive increased investment in their workspaces over the course of the year. We've been waiting for it to start to show up in orders and it feels like it is starting to show up a bit more significantly, not only did we see improvement in our order patterns for the first three weeks of March, which is not a month, and is not a quarter of orders, but more importantly we saw in December, some of that project activity start showing up in our order patterns from our larger corporate customers. I mean it's really spread across a number of the things I talked about our commitment to staying invested in product innovation, to solve our customers' most pressing workplace needs, our continued investments in the diversification strategy, and helping support, initiatives like our mid-market initiative or our education business continue to grow, it's really kind of across the board in terms of those three pillars. So having more informal collaboration social kind of spaces that are a draw for people to come back to the office as well as creating the opportunity for people to come together in different kinds of ways within in office and I think on both those fronts, privacy and social spaces, we've done a lot of work over the past couple of years, both through acquisitions and our own product development, as well as the partnerships we've developed to give us a I think a pretty competitive portfolio to allow us to be successful. I'll say tests of new space idea, but I think more recently we've seen more energy, more interest, and more actual orders that tie it to true action where customers, at least some customers are making bigger investments to renovate an entire building or to move into a new location and obviously just kind of the scale of those types of projects, generates higher revenue for us because they're bigger. Privacy and collaboration are big deal, which is great I think for the industry for the next couple of years as the offices -- as our clients deal with what it's going to mean to have people back in the office more significantly and living on video, they're going to need to facilitate collaboration and privacy, and that's going to be change and change is good for us in the industry."
}