{
    "symbol": "SCS",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-23 11:26:02",
    "content": " For revenue, we recorded organic growth of 35%, compared to the prior year, which included both volume growth and benefits from increased pricing in response to the rapidly increasing inflation over the last several quarters. And in the prior year, inflation net of pricing benefits was $7 million higher than the first quarter of fiscal 2021, so on a two-year stack basis, the total negative impact approximates $19 million. Excluding stock compensation expense and restructuring costs, adjusted EBITDA of $27 million in the first quarter, represents a sequential decrease of $2 million as the impact of lower revenue due to seasonal demand patterns and moderately higher spending was mostly offset by a small land gain recorded in the first quarter and higher net pricing benefits, as the sequential increase in pricing benefits from previous adjustments outpaced the sequential increase in inflation. On a sequential basis, first quarter orders grew 19%, compared to the fourth quarter of fiscal 2022, driven by additional benefits from our pricing actions and seasonal demand patterns, including at Smith System. Consolidated backlog at the start of the second quarter totaled $927 million, which was 52% higher than the prior year and continued to include a higher-than-normal amount of orders expected to ship beyond the next quarter. As a result, we expect to report revenue within a range of $875 million to $900 million for the second quarter, which represents year-over-year organic growth of 20% to 24% and a sequential increase of 18% to 22%, compared to the first quarter. We expect the sequential increase in revenue to be driven by the strong backlog at the start of the quarter and continued order growth, normal business seasonality, which includes Smith System and other education projects that shipped in the second quarter and revenue from HALCON, which will be included in our consolidated results for most of the second quarter. The earnings estimate reflects the impact from the expected increase in revenue, as well as our projections of pricing benefits, net of inflation of approximately $10 million, when compared to the prior year, which would begin to reduce the cumulative negative impact of inflation, which has been ahead of our pricing actions by approximately $20 million in Q2 of the prior year. We expect order growth to continue in the second quarter, and I would expect that we will have a particularly strong surge in orders in advance of the price adjustment and surcharge effective dates of mid-July, which will sit in backlog for at the end of the quarter, most likely, given our average lead times are not what they normally have been."
}