{
    "symbol": "SCS",
    "quarter": 2,
    "year": 2023,
    "date": "2022-09-22 12:11:05",
    "content": " Our win rates in the Americas were strong in Q2 and customer visits to Grand Rapids are almost fully booked through the end of the calendar year; however, orders in our Americas core business seemed to reflect as softening in demand patterns in the second quarter compared to the last several quarters, and this appears consistent with the latest industry data published by BIFMA for June and July. Moving to the outlook, consolidated backlog of approximately $946 million at the end of the second quarter was 38% higher than prior year and continued to include a higher than normal percentage of orders expected to ship beyond the next quarter. We expect gross margin of between 29.0% to 29.5% driven by pricing benefits net of inflation of approximately $55 million when compared to the prior year, sequentially unfavorable business mix due to the summer strength of Smith System, and lower manufacturing efficiency due to decreased production volumes in the third quarter. We also expect operating expenses of $215 million to $220 million, which includes $7 million of amortization expense related to purchased intangible assets and an expected $7 million gain on the sale of an under-utilized facility and adjacent land, as well as some prioritized investments in marketing and product development, higher spending in a few corporate functions, and continued investments in our employees. Over the next few quarters, we should, because of the timing assuming inflation levels, which is sort of our best estimate at this point, we would expect to start to offset that more fully; but even in another couple quarters, weâ\u0080\u0099ll still be behind cumulatively, even though weâ\u0080\u0099ll start to post some good year-over-year tailwind improvement, so weâ\u0080\u0099re going to--we need to continue the pricing actions in order to kind of make up for the hole weâ\u0080\u0099re in, even though weâ\u0080\u0099ll start to see some benefits on a year-over-year basis. But I think the diversification is an acknowledgment of the fact that weâ\u0080\u0099ve also seen really nice traction and growth and weâ\u0080\u0099ve been investing and will continue to invest in other opportunities, whether that be healthcare, whether that be the mid-market business model that weâ\u0080\u0099re building around AMQ or things like consumer or retail or healthcare. We borrowed to fund the acquisition of Halcon, but we also borrowed because we have a significant amount of incremental inventory in response to the supply chain disruptions that we have, so I hope that we will continue to see improvement in the supply chain disruption and that our operations team will be able to continue to pull inventory levels back to a more level, and if that happens and our earnings trajectory remains relatively consistent or better than what we did in the second quarter, then I think youâ\u0080\u0099ll see that credit facility paid off by the end of the year."
}