{
    "symbol": "NVTA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 21:06:04",
    "content": " Before we begin, I’d like to remind you that various remarks that we make on this call that are not historical, including those about our vision and business model, future financial and operating results, expectations of future growth, reduction in burn rate, future product services, our product pipeline and their timing and investments in our infrastructure and operations constitute forward-looking statements within the meaning of the safe harbor provisions of the Private Securities Litigation Reform Act. And that’s where we -- as we said today, if we look out to the end of the year, taking into account the new sales reps, taking account of new products and looking at the cadence of the year, it looks to us as a 15% to 20% lift into Q2 will get us on track, keep us there. We’ve got -- I would say, as we looked at the guidance and looked at the year, with the new sales reps, that’s a formula we kind of know and based on past years, tends to -- given the amount tends to push back-half weight. It actually is one of -- as I kind of mentioned in my remarks, we’ve really spent the last couple of years trying to get our new product velocity going. Within leads to the data, patient identification data and services where this quarter was softer, that, especially with our citizen patient network business, that can be lumpy given the contracts and revenue recognition, and that’s what we’re expecting there is to continue that -- accelerate that effort, grow that effort, get the top line synergies going here this year. So, those are the -- if you go down to the product areas, that’s what I would -- that’s what we are expecting to see manifest in Q2, which will then contribute, like I said, if we see a 15%, 20% Q-o-Q growth, get an improvement in margin toward our year-end target, we’re going to be feeling better about it. And then, I think something which, again, given the time, probably not something we want to spend a whole lot of time on, but if -- in case that part of the question is looking out beyond that, speaking of cash burn, pushing out cash runway, we do expect actually some of the higher margin products and particularly our revenue from the data side of things to start allowing us to think about margin above 50%."
}