{
    "symbol": "POST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-05 15:18:05",
    "content": " Hosting the call today from Post are Rob Vitale, President and Chief Executive Officer; and Jeff Zadoks, Chief Financial Officer. Before we continue, Iâ\u0080\u0099d like to remind you that this call will contain forward-looking statements, which are subject to risks and uncertainties that should be carefully considered by investors as actual results could differ materially from these statements. Within foodservice, EBITDA per pound grew nicely and is now on par with pre-pandemic levels. The mix shift results from acquisitions that contribute on average lower margins, a shift to value within cereal and the increase in foodservice as a percentage of total Post revenue. As and in this case leased, we do continue to see elevated costs in our supply chain. With respect to our supply chains, the bad news is that they remain under stress. As a result, we expect supply chain improvement to be more steady and gradual, ultimately leading to better volumes as reliability improves and expanding margin as controllable cost management and productivity improves. Our branded share reached 20%, and total private label reached 6.7%. Recall, we are by far the largest provider of private label ready-to-eat cereal. On the other hand, our Refrigerated Retail platform was hurt by AI as AI cost increases could not be passed through quickly enough. Recall that last year, our supply chain limitations left us unable to build inventory ahead of the key holiday season. Leveraging third-party manufacturers comes with some margin pressure, and we expect that to reverse as we use internal capacity to support the growth of the franchise. This quarter, our side dish products grew volume over 10%. We continue to aggressively pursue M&A and in the last 2 years, have completed 6 tuck-in acquisitions. And lastly, recall that Post owns 19.4 million shares of BellRing Brands, which we expect to monetize within the next 6 months. Before turning the call over to Jeff, I want to reiterate how encouraged I am with the sequential and the year-over-year progression of our business during 2022. Third quarter consolidated net sales were $1.5 billion, and adjusted EBITDA was $251 million. Net sales increased 22% and benefited from approximately $63 million of incremental sales from recent acquisitions, pricing actions in each segment and volume demand recovery in the foodservice segment. Internal and external labor shortages and supply chain disruptions continued this quarter, causing our per unit product costs to remain elevated. Net sales and volumes increased 23% and 14%, respectively. Excluding the benefit from the private label cereal acquisition, net sales and volumes grew 16% and 7%, respectively. Branded and legacy private label cereal average net pricing increased 8.8%, driven by pricing actions, partially offset by unfavorable product mix. Pebbles and Bunches of Oats, MOM bags, Peter Pan and legacy private label cereal drove the volume increase. Weetabix net sales increased 1% despite a significantly stronger U.S. dollar against the British pound, which caused a foreign currency translation headwind of nearly 1,100 basis points. Excluding the benefit from the UFIT acquisition, volumes declined 6% as growth from private label distribution gains and new products was not enough to offset declines in other products. Supply chain disruptions, most notably in packaging, transportation availability and equipment reliability, continue to suppress volumes and pressure segment profit. Foodservice business saw net sales and volume growth of 33% and 6%, respectively, lifted by distribution gains and higher away-from-home demand. Although we saw year-over-year growth this quarter, total segment volumes remained below pre pandemic levels. Adjusted EBITDA grew 45%, benefiting from the volume recovery and improved average net pricing, which combined, mitigated the impact of higher cost to produce. Refrigerated Retail net sales increased 12%, while volumes decreased 3%. Excluding the Egg Beaters and Almark acquisitions and the divested Willamette Egg Farms business, net sales and volumes increased 10% and 2%, respectively. Side dish and sausage volumes grew 10% and 4%, respectively, while volumes in other product categories declined. Retail egg product volumes, in particular, declined from supply reduction from the impact of avian influenza. Adjusted EBITDA decreased to $30 million and was pressured significantly by dairy costs and costs due to avian influenza, higher manufacturing costs and increased freight. In the third quarter, we purchased approximately 1.9 million of our shares at an average price of $76.43 per share. Through the end of the third quarter, we completed a modified Dutch Auction to purchase approximately $140 million in principal amount of our 4.625% senior notes due April 2030 and approximately $382 million in principal amount of our 4.5% senior notes due September 2031. Net leverage at the end of the third quarter, as measured by our credit facility, was approximately 6.2x. On this basis, we expect to reduce leverage by approximately half a turn once we fully execute the intended debt for equity exchange of our retained ownership of 19.4 million shares of BellRing. With that, Iâ\u0080\u0099d like to turn the call back to the operator for questions. First off, just with PCB, obviously, organic growth in the quarter, very strong and ahead of the category growth rate. Well, obviously, pricing is a big component, but weâ\u0080\u0099re also seeing good volume growth across our value portfolio with additional distribution in our MOM franchise as well as gains in private label. So weâ\u0080\u0099ve been talking about this eventual turn for some time, and it feels like itâ\u0080\u0099s here, stable and potentially building some momentum. Now the inhibitor, of course, is supply chain execution because we could do more if we had more effective throughput. I think previously, though, it seemed like we could basically take the second half run rate of this year, annualize that and then maybe add a little bit to get to sort of a preliminary look at what â\u0080\u009823 could sort of look like. There is no reason to believe different than you articulated, but the hesitation that I would have would be we have not gone through our planning and we want to make sure where we need to be on inventory and productive capacity as we â\u0080\u0093 which we obviously have just done and anticipate doing in the second half of the year. Iâ\u0080\u0099d like to start first, if I could, with the Foodservice division, and the profit came through at a very nice rate in the quarter. And then you made a comment about maybe having a little better run rate out of â\u0080\u009822 for Foodservice, just to get a sense of like what youâ\u0080\u0099re thinking there in terms of the benefit to profitability, I guess, from the pricing initiatives and this recovery in volume. And if you go back to where we had expected to see the second half shape, our EBITDA expectation was about 48-52 third quarter to fourth quarter, and the effect of that is going to make it more like 50-50. We see stabilizing pricing, very effective work within our organization to get inflation passed through as well as decent demand despite some potential consumer weakness. And then one area that was kind of different from what I had expected, especially given some of the dialogue last quarter, Refrigerated Retail division. And it sounds you had a relatively optimistic or bullish outlook on the business, and certainly, side dish volumes are very strong, but the EBITDA has been challenged. One is I think the estimates were a bit on the high side and not reflective of the third quarter, fourth quarter delta. So, the â\u0080\u0093 from our perspective, from an internal estimate perspective, there was a bit of a miss, but it was almost entirely attributable to AI costs being incurred at Refrigerated Retail from our foodservice business. In terms of the overall margin structure, I commented in my prepared remarks that as we seek to fix our supply chain, we have leveraged more third-parties, and that has a temporary cost or a temporary percentage cost as we will now circle back and use internal capacity to support growth. The other aspect, of course, is that we focus a lot on side dishes because thatâ\u0080\u0099s the real gem of the franchise, but that segment also contains our sausage business, which has more commodity volatility tied to sow pricing. We have done a nice job of bringing some more sophisticated pricing mechanisms to that market, but it is still a market that has some margin volatility, albeit â\u0080\u0093 itâ\u0080\u0099s a small piece of the total business, but it can magnify some of the market volatility within that segment. And then if you can break it out, thinking about supply chain friction cost that you might have incurred last year that maybe would be getting a little bit better by then. Well, I would expect by the time we get to the beginning of â\u0080\u009823, we would have priced knowing inflation. And who knows what that will be, but I think what we have demonstrated is an ability to price what comes at us with ingredient input inflation. With respect to supply chain progress, I am largely going to echo what I said in my prepared remarks, is that rather than it being a binary event that we are solved, itâ\u0080\u0099s going to be a more gradual process of grinding it out quarter-to-quarter. And with regard to the Post Consumer Brands business, you mentioned that there were some compensation impact as well as supply chain. Can you just sort of quantify â\u0080\u0093 I would have expected a little bit better margins given the volumes that you are having there, but maybe you can give us a sense as to why â\u0080\u0093 what was driving the magnitude of the margin headwinds given the strong volume?. Mix is a big component of the PCB volume because as we shift from the â\u0080\u0093 from branded to more private label and value, while again, itâ\u0080\u0099s profit accretive, it is margin dilutive. I think in the third quarter of last year, we didnâ\u0080\u0099t achieve some of our incentive targets, and in the third quarter of this year, they were achieved. We have been talking supply chain challenges, I think every quarter for a very long time here. And you said today, like some of these challenges appear to be labor in nature where you see like structural changes to the workforce, suggesting that you need to evolve your supply chain. I think we are not going to require a surge in CapEx, but we may have a materially different mix of our CapEx from trying to be a bit more experimental to being very focused on asset reliability, maintenance, more â\u0080\u0093 shift some of that mix from what has historically been combination of growth and maintenance to a couple of years where we are highly focused on maintenance and asset reliability. And then longer term, I think we then have the question of how do you think about productivity initiatives, which could tie back to your capital question. I would now like to formally close the call, and we thank you for your participation."
}