{
    "symbol": "ILMN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 18:55:04",
    "content": " Illumina delivered revenues of $1.16 billion in the second quarter, up 3% year-over-year or 5% on a constant currency basis. While sequencing activity across our markets was robust in the second quarter, with sequencing runs on our connected high and mid-throughput platforms growing more than 15% year-over-year and clinical growing even faster, our second quarter results were impacted by macroeconomic challenges that we expect to play out over the next couple of quarters. Core Illumina sequencing consumables grew 6% year-over-year to $744 million, driven by almost 20% growth in oncology testing. Sequencing instruments revenue for core Illumina grew 1% year-over-year to $119 million, driven by 23% growth in NovaSeq shipments, offset by a 14% decrease in the mid-throughput shipments year-over-year. During the second quarter, COVID surveillance contributed approximately $25 million in sequencing consumables revenue and $2 million in incremental instruments revenue, representing a decline of 55% year-over-year. Core Illumina sequencing service and other revenue of $125 million was down 2% year-over-year driven by $20 million of one-time revenue recognized in 2021 from NIPT royalties received related to a patent litigation settlement, partially offset by increased instrument service contracts and contributions from oncology co-development partnerships. Revenue for the Americas region was $633 million, up 7% year-over-year, primarily due to NovaSeq strength with continued demand from oncology testing customers, driving instrument placements, and consumables grow. For Illumina non-GAAP gross margin of 69.8% decreased 200 basis points year-over-year, primarily due to less fixed cost leverage on lower manufacturing volumes, margin impact from one-time revenue from a patent litigation settlement in 2021 and increased freight costs attributable to broader global supply chain pressures. Core Illumina non-GAAP operating expenses of $519 million were up $48 million year-over-year, due primarily to headcount growth and investments we're making in R&D to support the continued advancements of our innovation road map. We now expect full year 2022 consolidated revenue to grow in the range of 4% to 5%, including core Illumina revenue growth in the range of 3.5% to 4.5%, and GRAIL revenue of $50 million to $70 million. Within core Illumina sequencing revenue, we now expect instrument growth of 1.5% and consumables growth of 5%, which reflects NovaSeq pull-through in the range of $1.1 million to $1.2 million for a system for 2022. However, as we look forward, given the strong number of runs growth that our instruments are seeing across a broad range of our high throughput customers, and given the strong market factors that are very intensive in sequencing, like MRD, like oncology testing, and things like spatial and proteomics, we do expect that in the long run, this number will continue to grow."
}