{
    "symbol": "ILMN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 21:59:19",
    "content": " Illumina delivered revenue of $1.1 billion in the third quarter, up 1% year-over-year and 3% on a constant currency basis and in line with our expectations despite deepening macroeconomic challenges. Oncology testing consumables grew 9% year-over-year as our larger customers continue to shift towards high-throughput applications, our decentralized clinical testing customers ramped up business and new customers came online. Core Illumina revenue of $1.1 billion was approximately flat year-over-year or up 3% on a constant currency basis, net of the effects of hedging. As expected, growth driven by the increased installed base was muted by the year-over-year impact of customer inventory and cash management, headwinds from foreign exchange rates, the conclusion of the U.K. Biobank project in quarter 3 of 2021 and the anticipated decrease in COVID surveillance revenue. This decline was partially offset by record NextSeq 1K, 2K shipments which grew 40% year-over-year as we continue to see strong adoption by new to Illumina customers. This was in line with our expectations and down nearly 50% year-over-year, driven by lower testing samples and a decline in instrument shipments as COVID surveillance capacity was largely established in 2021. Core Illumina sequencing service and other revenue of $123 million was up 12% year-over-year, driven primarily by higher instrument service contract revenue on a growing installed base and an increase in core licensing revenue. Revenue for the Americas was $592 million, up 2% year-over-year primarily driven by NovaSeq consumables growth due to demand from genetic testing, oncology testing and cancer research customers. Core Illumina non-GAAP gross margin of 68.9% decreased 240 basis points year-over-year, primarily due to less fixed cost leverage on lower manufacturing volumes and higher freight costs, partially offset by favorable product mix. We now expect full year 2022 consolidated revenue to be flat to up 1% year-over-year, including approximately flat core Illumina revenue compared to 2021 and GRAIL revenue in the range of $55 million to $65 million. Within core Illumina sequencing revenue, we now expect instrument revenue to be down slightly year-over-year and consumables revenue slightly below our guidance range of $1.1 million to $1.2 million per system for 2022, primarily driven by recruitment challenges at some large research and PopGen customers. For full year 2022, we now expect consolidated non-GAAP operating margin in the range of 9.5% to 10% and core Illumina non-GAAP operating margin of approximately 23%, reflecting our lower revenue outlook."
}