{
    "symbol": "ILMN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 21:22:03",
    "content": " Our record first quarter revenue of $1.223 billion grew 12% year-over-year, with core Illumina sequencing instruments growing at 20% and sequencing consumables growing at 13%. Core Illumina sequencing consumables revenue grew 13% year-over-year to $784 million, driven by the growing NovaSeq installed base across clinical and research markets. EMEA delivered revenue of $316 million, representing 4% growth year-over-year, driven by strength across both clinical end markets and emerging markets, partially offset by the conclusion of the UK Biobank program in the third quarter of 2021 as expected. Finally, APJ revenue of $132 million grew 33% year-over-year with stronger than expected growth from large-scale research projects, oncology and genetic disease testing and pathogen surveillance initiatives. We continue to expect consolidated revenue growth of 14% to 16% for 2022, including core Illumina revenue growth of 13% to 15% and GRAIL revenue of $70 million to $90 million. We expect consolidated non-GAAP operating margin to be approximately 10%, with the sequential decrease from Q1 2022, driven primarily by a $60 million increase in core Illumina operating expenses and the $25 million increase in GRAIL operating expenses. The continued growth in our installed base, our record backlog exiting Q1 and the increasing volumes we're seeing as customers pursue higher intensity sequencing applications all bode well for future growth, especially in the second half of this year. Your line is now open. Your line is now open. As we get more and more installed base expansion and we get more shipments into NovaSeq, as you know, it's going to take -- usually, it takes about a quarter or two for those customers to ramp up to their usual pull-through, but we have every confidence that we're still going to be in the -- in that 1.2 to 1.3 pull-through range for the year. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And if you look at a number of our metrics, whether it's the consumables that are being pulled into that market or even the NovaSeq, we saw, for example, I think it was about 40% of our NovaSeqs that were shipped in Q1 went to oncology testing customers. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}