{
    "symbol": "AFCG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 13:29:05",
    "content": " In the first quarter of 2022, AFC Gamma generated distributable earnings of $0.62 per weighted average share of common stock. Since going public, we have generated distributable earnings well in excess of our dividend each quarter and currently have rollover income of approximately $3.1 million or $0.16 per share. Subsequent to quarter end, we continue to blend down AFC Capitals -- AFC Gamma's cost of capital by entering into a third-party $60 million senior secured revolving credit facility from two FDIC insured banks at a very attractive rate of prime plus 1.5%. For the quarter ended March 31st, 2022, we recorded GAAP net income of $10.2 million or earnings of $0.53 per basic weighted average common share. For the first quarter of 2022, we generated net interest income of $16.9 million and distributable earnings of $11.9 million or $0.62 per basic weighted average common share compared to net interest income of $13 million and distributable earnings of $8.5 million or $0.52 per basic weighted average common share for the fourth quarter of 2021. As of March 31, 2022, AFC Gamma's portfolio consisted of $420.1 million of current commitments with $370.6 million funded across our 13 borrowers. On April 15, 2022, AFC Gamma paid a dividend of $0.55 per common share for the first quarter to shareholders of record as of March 31, 2022, an increase of 10% from the $0.50 dividend paid in the fourth quarter period -- for the fourth quarter period. At the end of the first quarter, our total stockholders' equity was $336.5 million, and our book value per share was $17.04 as compared to $16.61 as of December 31, 2021. Subsequent to the first quarter, AFC Gamma entered into a senior secured revolving credit facility with $60 million of current commitments from two FDIC-insured banks and the ability to increase the facility to $100 million. I think if the stock traded at a level that allowed us to do equity offerings that added to book value for our shareholders, I think, the same plan we outlined last quarter and maybe the same indication the quarter before holds where I think we could do $500 million to $700 million of gross originations."
}