{
    "symbol": "SKIL",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-08 19:29:01",
    "content": " Today's call will contain forward-looking statements about the company's business outlook and expectations including statements concerning financial and business trends, our expected future business and financial performance, financial condition and outlook. These forward-looking statements and all statements that are not historical facts reflect management's beliefs and predictions as of today, and therefore are subject to risks and uncertainties that could cause actual results to differ materially from expectations. For a discussion of the material risks and other important factors that could affect our actual results, please refer to the risks described in the safe harbor discussion found in the company's SEC filings. In addition, Global Knowledge activity is only reflected in the GAAP financial statements after June 11th. For all non-GAAP measures in the supplemental materials and in today's commentary, the Company is providing normalized results as if Skillsoft and Global Knowledge had been combined for all periods presented, which we believe is useful to investors to show the trends of the go-forward Company. This is the four consecutive quarter of growth in this segment and the first quarter of double-digit growth under the leadership of our new management team, which stepped in with our return to public markets a year ago. The Skillsoft content segment, which includes the Percipio platform is almost entirely subscription in nature and high margin and we expect it to be the main driver of future value creation for the company. On this call, I'll discuss the acquisition of Codecademy, which greatly enhances our tech and dev offering and a number of important product enhancements made in the quarter. Finally, I'll talk to actions we are taking to improve our global knowledge instructor-led training business and our longer-term strategy to further transition the business to subscription revenue. This combination nearly doubles our reach, creating one of the world's largest communities of learners, totaling more than 90 million people across more than 160 countries. When combined with Skillsoft’s existing tech and dev offerings enterprise customer reach and Percipio learning platform, we have created an industry leader in tech and dev and an important driver of future growth. We've also developed sales enablement programs and have begun working with more than 50 enterprise customers, who have expressed interest in Codecademy, including some of the world's largest banks, health care companies and professional services firms. As employees make new demands on their employers, labor and skills gaps have emerged as the number one threat to business according the fortunes recently released survey of Fortune 500 CEOs. Skillsoft is uniquely positioned to help organizations address this enormous challenge, while others approach learning from a primarily consumer perspective we've long operated at the intersection across the organization and its employees, propelling organizations and people to grow together through transformative learning experiences. Experiences that are absorbing trusted, connected and they deliver exponential results to our 17,000 business customers and community of 90 million learners. As already mentioned, we recently completed the first phase of the technical integration of Codecademy into Percipio, our immersive AI-driven learning platform. As we advance our integration, we are blending Skillsoft micro videos, Codecademy hands on learning, the coaching solution we acquired with Pluma and instructor-led training from Global Knowledge to create more absorbing an immersive learning journeys. During the quarter, we also launched Skills benchmarks, which is objective standards to officially profile learners knowledge in particular areas and recommend personalized AI curated learning journeys. We've also made our transformative learning experiences more absorbing with gamification features, including our recently launched digital flash cards that reinforce learning and recall on the go. We've made our learning experiences more connected with new social features, including the addition of shared playlists and we've kept a sharp focus on enhancing customer ROI with the addition of goals and reminders, propelling organizations and their learners forward towards a set of shared learning objectives. Our migration to Percipio has also been a big driver of this transition to growth, lifting our content dollar retention rate above 101%, a 10 percentage point increase over last year. And that we are seeing a number of encouraging metrics, including 31% growth in new business, a 13% increase in new logos and a 16% increase in average deal size. Global Knowledge is transactional in nature and more sensitive to macroeconomic headwinds, including customer investment in new major IT projects; investment from our partners and training their customers; and our ability to maintain full staffing and entry level inside sales. For example, we've launched new products and initiatives with our technology partners to train their customers, supplemented hard to fill inside sales positions with outside resources and implemented targeted increases and go-to-market spend. We recently announced initiative with iamtheCODE, whose mission is to train 1 million young women and girls and marginalized communities to code by 2030. iamtheCODE will be launching its digital learning platform powered by Skillsoft’s Percipio and some of Africa's largest refugee camps where 10s of thousands will have access to the curriculum. We're also partnering with our longstanding customer Adecco to help train Ukrainian refugees much needed soft skills, so if they can find new jobs as they rebuild their lives. In summary, we're pleased with the progress we've made, putting our higher margin content subscription business on a solid growth trajectory. Bookings for the total company for the first quarter were $125 million, down 5%, compared to the prior year. This was driven by significant growth in the content segment of 22% offset by a 15% decline in the Global Knowledge segment, which is the larger of the two segments in Q1. Turning to revenue, combined GAAP revenue was $164 million in the quarter. Adjusted revenue in the quarter was $170 million, up 1% over the prior year. Q1 adjusted EBITDA was $3 million down $4 million, a decrease of 12%, compared to last year. As I mentioned on the last call, when comparing adjusted EBITDA year-over-year you need to also consider the increases in public company costs as we move through the first full-year as a public company. In addition, Q1 adjusted EBITDA and margin significantly outperform the expectations we provided on our last call. This was partially due to slightly higher revenue than anticipated, but primarily driven by the fact that our higher margin content segment outperformed expectations, while the lower margin Global Knowledge segment underperformed expectations. The decrease in cash balance was due to the acquisition of Codecademy at the beginning of the quarter, as well as the $47 million decrease in borrowings on our accounts receivable facility. At quarter end, net leverage was 4.1 times, due to the lower cash balance and EBITDA from this quarter was below prior year Q1 EBITDA, due to increased public company costs, as well as the inclusion of the Codecademy acquisition. Bookings for the Content segment in Q1 were $51 million, an increase of $9 million or 22% year-over-year. This growth was driven by contributions from the Pluma acquisition, new customers and DRR or dollar retention rate of 101% versus 91% in the year ago period. Adjusted revenue for Skillsoft content in Q1 was $90 million, up $5 million or 5% year-over-year. Bookings for Global Knowledge in Q1 were $56 million, a decrease of $10 million or 15% year-over-year. Q1 adjusted revenue for Global Knowledge was $51 million, a decrease of $3 million or 6% year-over-year. The decline was largely due to lower in quarter bookings, which typically convert to revenue within two quarters. Q1 bookings were $19 million, a decrease of $7 million or 26%, due mainly to a large contract loss in the legacy payroll business. In terms of outlook, we continue to feel good about our content subscription segment performing well throughout the remainder of the year. However, we are now tracking towards the low end of our bookings and revenue outlook, due to the primarily transactional Global Knowledge segment, which is starting off the year slower-than-planned. However, we are also taking actions to deliver our adjusted EBITDA outlook of approximately $167 million, even if Global Knowledge does not see improving results in the second half. This is in part aided by the strength within our higher margin content business and Global Knowledge being our lowest margin business and therefore, having a smaller impact on total company profitability. Now focusing on the more immediate future, while we are very pleased with the 22% growth in the Content segment in Q1, it is by far the smallest quarter of the year for content bookings. In addition, Q2 last year was our strongest growth quarter with total bookings growth of 18% and Content bookings growth of 9%, making it a tough comp. More specifically for Q2 we would expect bookings and revenue to approximate or be slightly down to prior year, as the continued growth in the content segment in Q2 is not expected to make up for the near-term decline in Global Knowledge segment. Bringing the company public, forming a new management team, completing three acquisitions and returning our subscription business to growth as required tremendous dedication and sacrifice from our more than 3,000 employees. Please proceed with your question. And can you speak up little bit too, I know its transaction focus, but since we're going back like some companies in our space have said is like no impact and there is a little bit impacted and some other impact and a little bit of impact in Europe. And then the third question is on Codecademy, you've talked about a little bit of the -- a little bit around the cross-sell opportunity into enterprise. Could you speak to that in terms of like how clients are taking that up is that like a blanket contract to enable people, what's the -- and what's the cadence in terms of uptick that you're expecting them. It's in a few ways, first of all, Global Knowledge is sold in bulk when customers undertake new big IT projects. So if new big IT projects start that's when you need to start training your employees, and when those get move to the right by customers purchases of Global Knowledge slowdown. Last year 20% of the business was in the Legacy Human Capital Management modules, payroll being one of them, time management being another, those are core to the learning management system part of the business. So that helps you size the pressure that we could see over time that pressure which show up in the legacy business, but the Learning Management the LMS business is actually quite slow. But in terms of -- it's an add-on to our subscription product, so it's add an additional charge. It addresses really critical Skills gaps in the enterprise in the area of data science and coding and while it's early at the end of the quarter, we were only one month end, we're seeing really strong interest from our customers in the Codecademy offering as we expected. Please proceed with your question. I guess, first off, you sort of answered this, but where would you say the Global content -- I'm sorry, the Global Knowledge reaching was focused, you said those European exposure for sure. So first of all I can say we're not impacted significantly directly by the war, we really have negligible exposure to Ukraine and Russia, it's more in Europe about ForEx and the economy in general. And globally, it's really just about I guess some of the pressure we've all seen as some of the large hardware and software vendors have reported that we're just not seeing as much growth as we were seeing in IT spending. I think the other key factor to keep in mind is the first half was very strong in Global Knowledge, last year. We had really strong bounce back from COVID, we also -- we believe in hindsight benefited from some delayed spending in IT, as the world started to open back up. And I think you see the impact of that on the subscription business, which is really performing very strongly. It's the highest margin part of our business, it's where we placed a lot of focus, because we see it as the most important part of our future, not that the other components aren't important, but we are trying to migrate the business to subscriptions as we talked about with Global Knowledge, we see -- we've been moving some of that content into subscription offerings. You’re right, that the hire you were talking about was the inside sales team and people like that where it was slower and we had been --\n Yes, it's very focused, it's the inside sales for Global Knowledge in particular. So in terms of Workday there are important learning management system provider or human capital management system providers are having that, that connector in general availability is really important to our customers. In terms of the migration to Percipio, we feel really good about the progress, I think you see that in the retention rate that's now over 100%. And what we're actually seeing is the retention rates on SkillPort are way up, and the reason for that is the customers who are still on SkillPort are really sticky. Please proceed with your question. Cal I go back to -- can we go back to the Global Knowledge, the decline in revenues year-on-year and sort of the outlook is impacting your guidance. And then if you can give more color on that, I know you said that industries or geographies were equally impacted or and also, how are you feeling confident that you this -- that you'd be able to reverse this Global Knowledge decline, and then I have a couple of more questions. So in terms of quantifying Raj, how much of the Global Knowledge shortfall is macro. I -- we've quantified it as about 50% macro and that's multiple large projects, that's not just one large project and about 50% of it, we believe is due to staffing in our inside sales organization. So logically that the staffing piece of it is easier to address the economy is not obviously not in our control, although we are working to launch new products with partners that are better suited to the market that we're in today. In terms of industry, geography, last year our business in Europe delivered very strong growth in GK as it bounced back from Europe. And bounce back in COVID and this year we're not seeing Europe as a driver of growth, at least so far in the year. But I have less visibility into IT spending, customer spending, end-products that's why we're pointing people to the lower end of our guidance. And it's not even a full month, so we're talking less than $1 million in the numbers. And when you look at the pro forma numbers it's half-half, it’s growing from that by 24%, but its impact in the content business that 22% would basically 22% whether code was in there or not. And then are you going to break out the Codecademy numbers going forward or they going to be lumped up -- lumped in into --\n The plan is to have it in content, we’ll give color when it makes sense. But the way it's being sold everything, it’s just part of the content business. And one of the metrics I'm super pleased with is the number of blockchain-based digital badges that we issued, its press -- it's pushing up against 30 million blockchain based digital badges that's a huge number and really important, because those digital badges are transferable, they are portable they move with the learner. The second part of your question, if you could just remind me what that -- you're looking at --\n Yes, just the federal agencies that you were looking to it at some point, right the adoption by federal agencies to be -- to ramp up significantly, I think your overall to 100%, yes. Please proceed with your question. The single biggest -- the only real change is that users of Percipio can now access Codecademy through Percipio, and that's an important first step in cross-selling Codecademy to our enterprise customers. In terms of integration, I think it's a -- I can start by sharing first of all Codecademy runs as a Zach -- Zach Sims reports directly to me running the Codecademy business, so that hasn't changed. From an enterprise sales perspective, we brought enterprise sales for Global Knowledge, Skillsoft tech and dev and Codecademy together under one leader, it's focused on tech and dev sales globally. Now within that there are individual teams, there's enterprise teams that are focused on enterprise customers and for the most part the enterprise teams sell the full suite of offerings. So that inside sales team selling Global Knowledge is dedicated to Global Knowledge, and so that's how we integrated sales for our tech and dev offerings. That includes Skillsoft -- and the Skillsoft business that sits on Percipio, it includes Codecademy, which is entirely subscription and that's what we're seeing the growth. And look for our sales teams, who are dealing with our enterprise customers, supporting our enterprise customers look for them, so move dollars from transaction business to subscription business, which is where the margin is and where we believe the value creation set. So over time I look to -- for that subscription business to grow faster than transaction and that should drive transaction say, below 20% as a percentage of revenue. And just one last question from what I recall, you know, Global Knowledge acquisition was done maybe right before, kind of, of these SPAC transaction. And given that it's relatively new is this sort of like, you know, have things played out as per your expectation. It outperformed our expectations last year and while we're early in the year at this point, I'd say it's underperformed our expectations this year."
}