{
    "symbol": "RLJ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 14:48:06",
    "content": " We are particularly encouraged by the step-up in trends we saw in September, which outperformed our expectations and enabled us to achieve a new peak relative to 2019 RevPAR at 98%, driven primarily by the rebound in our urban markets. With respect to our operating performance, our hotels achieved 94% of 2019 RevPAR levels during the third quarter, a new high relative to 2019, led by our ability to continue to drive ADR, which achieved 105% of 2019 levels. This enabled our group revenues to achieve 2019 levels during the third quarter, representing a 900 basis point improvement from the second quarter, and we were able to drive ADR to 108% of 2019, a 500 basis point improvement. We are continuing to benefit from strong leisure pricing power as our third quarter leisure ADR achieved a 118% of 2019 levels, with September achieving 121% on the strength of urban leisure. Against this overall backdrop, RLJ is especially well-positioned with multiple channels to drive incremental growth, including contributions from our recent conversions, the continuing ramp-up at our recent acquisitions, the ongoing ramp-up of our urban markets, our ability to capture the strong emerging small group trends and the ability of our portfolio to generate significant free cash flow. Our third quarter portfolio occupancy was 72.7%, which was 90% of 2019 levels, an average daily rate was $189, exceeding pre-pandemic levels at 105% of 2019, representing 200 basis points of improvement from the second quarter. In September, our total portfolio generated occupancy of approximately 75% and ADR of $196, resulting in September RevPAR of $142 representing 98% of 2019 levels, an 800 basis point improvement from August. Specifically, our September growth was strongest in our urban markets with ADR achieving 106% of 2019 as these markets benefited from pricing power throughout the quarter. Our third quarter leisure revenues remained above 2019 levels and were driven by continued pricing power that led to our resorts achieving 113% of 2019 RevPAR, representing a 300 basis point improvement from the second quarter. Finally, our portfolio benefited from the continued recovery of business transient revenues as evidenced by moving 300 basis points closer to 2019 compared to the second quarter and our weekday RevPAR achieving nearly 90% of third quarter 2019, representing an improvement of 400 basis points from the second quarter. The healthy operating trends during the third quarter led our portfolio to achieve hotel EBITDA of $100 million, which represented 91% of 2019 levels. So when we think about the room revenue picture, we think we're set up positively as the occupancy starts to come back that we're going to have a higher rate of BT, the proper group that's going to be coming in and set us up to have those metrics as you think about occupancy growth that's going to happen with the BT at the higher rates on the national account basis."
}