{
    "symbol": "RLJ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 18:19:02",
    "content": " Our RevPAR rapidly improved from 64% of 2019 in January to 84% in March, which was driven by robust growth in business and group demand, leading to increased pricing power, with our ADR in March achieving 96% of 2019 levels. We also benefited from citywides being held as in-person events with attendance levels holding, all of which drove a meaningful increase in our in-the-quarter, for-the-quarter group revenues, with March RevPAR achieving 74% of 2019, which was also driven by ADR increasing to 95% of 2019. Overall, we are encouraged by the strengthening fundamentals and our unique position to create significant value given our embedded growth drivers, which include returns from our conversions, revenue enhancement and margin expansion initiatives, the continuing ramp from our recent acquisitions, our ability to better capture post-pandemic industry margin expansion given our lean operating model, smaller footprint, fewer FTEs and longer length of stay, our well-located urban focused portfolio and our strong balance sheet with significant liquidity that will allow us to pursue multiple capital allocation opportunities. Despite January being impacted by Omicron, our first quarter RevPAR was approximately 74% of 2019 levels and was stronger than we had expected at the beginning of the quarter and accelerated throughout the quarter to 84% in March. While leisure remained strong and achieved 85% of 2019 revenues during the first quarter, our group revenues relative to 2019 grew over 400 basis points from the fourth quarter to 63%, with March revenues at 98% of 2019 levels. Finally, while the growth of business transient within the quarter was encouraging, first quarter BT revenues were at 46% of 2019 levels, which underscores the remaining growth runway as business transient revenues return to 2019 levels. The improving operating trends during the first quarter led our entire portfolio to achieve hotel EBITDA of $63.2 million, which represented 61% of 2019 levels. Our hotel EBITDA improved as demand increased throughout the quarter and was $35.6 million in March, representing 78% of 2019 levels and generated hotel EBITDA margins of 34.4%, which represented the highest margin since the start of the pandemic. For April, our portfolio would generate occupancy of approximately 75% and ADR of approximately $192, resulting in April RevPAR achieving 91% of 2019 levels, which represents a 7 percentage point improvement from March. That number is the number of FTEs that we expect to put back in the business, which will be -- and what we've seen from markets and hotels that have reached prior peak levels of occupancy is that that's sort of a level that we think is a stabilized level and that our hotels can operate within."
}