{
    "symbol": "RLJ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 15:50:27",
    "content": " Against an overall positive industry backdrop, our portfolios recovery to 2019 was significantly better than expected throughout the quarter with June RevPAR achieving 94% of 2019 levels. Accelerating demand across all of our markets led to strong pricing power, as our second quarter ADR surpass 2019 levels, sequentially improving each month with June ADR achieving 105% of 2019. This allowed our business transient revenues during the second quarter, to increase significantly by over 50% from the first quarter, which accelerated each month with June achieving 71% of 2019 a new high watermark. Group demand also accelerated during the second quarter, with group revenues increasing materially by 50% from the first quarter driven by ADR which exceeded 2019 levels. As demand improved materially throughout the second quarter, we maintain tight operational controls, despite current inflationary headwinds, which enabled our portfolio to achieve 91% of 2019 hotel EBITDA and EBITDA on margins, which were only 60 basis points below 2019. Our third quarter group booking pace is currently tracking at 90% of 2019 levels, with the recent in the quarter, for the quarter booking trends providing us with confidence that their recovery in groups should continue to improve for the remainder of the year. Finally, we are increasingly encouraged by the growth of business transient, with second quarter BT revenues achieving 64% of 2019 levels, which represents an 1,800 basis point improvement from the first quarter. The improving operating trends during the second quarter led our portfolio to achieve hotel EBITDA of $118.6 million, which represented 91% of 2019 levels. Our hotel EBITDA improved throughout the quarter and was $38.5 million in April, $39.1 million in May, and $40.9 million in June, which represented 94% of 2019 levels and generated hotel EBITDA margins of 36.9%, which represented the highest profitability and margin of the pandemic. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question."
}