{
    "symbol": "RGS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-23 16:50:28",
    "content": " By converting our existing debt to a term loan, extending our maturity by a meaningful two and a half years through August 2025 from the original maturity date of March 2023, securing a $55 million revolver, and lowering our minimum liquidity requirements, we have the runway and capital required to continue the turnaround of our business, and can now fully focus on the underlying fundamentals. Combined, these businesses contributed an EBITDA loss of $12.4 million in fiscal year â\u0080\u009822, compared to a loss of $46.6 million in fiscal 2021, a significant improvement of $34 million, and we expect further improvement as we move into fiscal year 2023. Our fourth quarter adjusted EBITDA, excluding the effects of salon sales, came in at $1.1 million, versus a loss of $14.5 million in Q4 2021. We ended the year with positive adjusted EBITDA, excluding the effects of salon sales, of $0.5 million, versus a loss of $60.2 million in fiscal 2021. I want to point out in my earlier comments of winding down our legacy businesses, that our fiscal year 2022 results included an EBITDA loss of 12.4 million from our product business and our company-owned salons, which continue to be winding down. Excluding the loss associated with selling our salons to franchisees, we recorded positive adjusted EBITDA in fiscal â\u0080\u009822 of $1 million, versus a loss of $60 million on a comparable basis. Our core franchise business posted adjusted EBITDA of $3 million in the quarter, a $12 million improvement compared to a loss of $9 million in the prior year quarter. The company-owned segment recorded an adjusted EBITDA loss of approximately $2 million in the quarter, which is a $12 million improvement from the same period last year. The remaining purchase price of our OSP platform of up to $26 million, will be recorded as a gain in discontinued operations when the cash is received, which we expect the majority to be received in fiscal year 2023."
}