{
    "symbol": "RGS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-06 03:11:04",
    "content": " Joining Felipe and Kersten on this call, we have Matt Doctor, Executive Vice President and Chief Strategy Officer; Amanda Rusin, our General Counsel; and Jim Lain, our President of Franchise Operations. Before turning the call over to Felipe, I would like to remind everyone that the language on forward-looking statements included in our earnings release and 8-K filing also apply to our comments made on the call today. Before getting into our results for the quarter, I want to address a few key liquidity and profitability initiatives we undertook to ensure Regis is in a strong financial position. During the quarter, we utilize our at the market or ATM program and raised $37.2 million in unrestricted cash. Our initial ATM was registered for up to $50 million, so we still have capacity to issue more shares under the program and we will assess the merits of doing so going forward. We also took another look at our organizational structure and realigned our business to decrease costs, while optimizing the support for our brands and franchisees. Jim now leads all Regis brands from operational excellence and execution to franchisee relationships, business performance and strategies to build traffic and drive customer satisfaction and loyalty. As we continue to navigate the current environment and sales recovery, we look to pull the levers within our control to ensure Regis is in a healthy financial position. Not only are staffing hours down during normal business hours, but the shortage in labor is also driving salon closures during periods when they would have been historically open, such as Sundays and Mondays. Given the importance of labor to our business in revenue generation capabilities, we have made it our top priority to work with our franchisees to recruit stylists. At the same time, most beauty schools are back to pre-pandemic operating models, so we can expect the level of graduates to return to pre-COVID levels around June of 2022. The hiring of John Davi, our new CTO, marks a new milestone in our OSP strategy, which is to ensure the capabilities of our software match or exceeds the capabilities of global competing store management and digital services as we continue to strive for both an unparalleled franchisee experience and for commercialization beyond our own industry and brands. Before I turn the call over to Kersten, I’d like to reemphasize Regis’ position as the largest hair salon network in the world. We are a fully franchised business model, with the most comprehensive service offering that’s the largest combined scale versus competitors, which means we offer the greatest opportunity for franchise investment. Our revamped management team is a mix of tenured Regis leaders and executives from other companies with complementary expertise and franchise, operations, marketing, development, international growth, finance and technology. We see these pillars as fundamental sources of strength that coupled with our new G&A structure and full migration to an asset light model, position us well for growth and sustained profitability as we emerge from the pandemic. As we continue through fiscal 2022, our focus remains locked in on sales for which the main lever is currently in the form of stylist recruiting, OSP adoption, bolstering franchisee base to drive growth and a healthy balance sheet. Yesterday, we reported on a consolidated basis first quarter revenues of $78 million, which represented a $34 million increase from the prior year. While comps historically have been the key indicator of the health of the business, due to the pandemic, I want to focus on total system sales. We reported an operating loss of $6 million during the quarter, compared to an operating loss of $32 million in the prior quarter. First quarter consolidated adjusted EBITDA loss was $6 million, compared to a loss of $23 million in Q4 2021. As we are nearing the end of our transformation, I want to call out some losses that we incurred in the quarter that we expect to eliminate or reduce by the end of the fiscal year. Our franchise product sales business and company-owned salons contributed losses of approximately $3 million and $1.6 million, respectively, both of which are not part of our go-forward business. With the recent G&A changes, we now expect our end state run rate G&A to be in the range of $65 million to $70 million annually. Turning to liquidity, as of September 30th, we had $148 million of liquidity, including $82 million of available revolver capacity and $46 million of cash. Our net available liquidity as of September 30th was $73 million, which reflects our minimum liquidity covenant requirements and the permitted add-back of the shortfall in certain refranchising proceeds in accordance with our credit agreement. We raised $37 million in total, of which $32 million settled in September and $5 million settled in October. In the first quarter, we used $12 million of cash from operations, which is approximately $8 million less than our fourth quarter cash use of $20 million, driven in part by continued improving comp. Removing $2 million of cash used on one-time items, our cash used was $10 million in the first quarter. To reiterate Felipe’s closing comment, we believe we are well-positioned for growth and sustained profitability as we emerge from the pandemic and look forward to continued recovery as we head into the holiday season."
}