{
    "symbol": "TTM",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-01 16:01:09",
    "content": " I’m joined today by Mr. Thierry Bolloré, CEO, Jaguar Land Rover; Mr. P B Balaji, Group CFO, Tata Motors; Mr. Adrian Mardell, CFO Jaguar Land Rover; Mr. Girish Wagh, Executive Director, Tata Motors; Mr. Shailesh Chandra, President, Passenger and Electric Vehicle Business, Tata Motors; and my colleagues from the Investor Relations team. As a reminder, all participant lines are in listen-only mode, and we will be taking questions via the Team’s platform, which is already open for you to submit your questions. I want to pause here for a minute, draw your attention to the top right hand corner where how we have accounted for passenger vehicles business in this particular quarter. Since we have received the honorable NCLT’s approval for subsidiarizing the PV business, accounting will force us to actually take business as a discontinued operation in our standalone accounts. And it’s our intention to work on this in the next two, three months to ensure that the first tranche gets drawn down. And, of course, in passenger vehicles -- in commercial vehicles, you had a reveal of almost 21 vehicles last Thursday, and, of course, a huge slew of variants, both in petrol, CNG variants coming through, as well as the X-press version of EV going into the market. As far as JLR is concerned, I’ll not spend time on the JD Power numbers. And, of course, the new Range Rover was revealed and has received great reviews on that, which again I’m sure Adrian is going to talk about. Numbers, we ended the quarter at revenue of INR 61,400 crores and EBITDA of 8.4% and PBT before exceptional item of INR 3,500 crores negative. Basically, we had a significant improvement in India in some of our other operations which I’ll talk about and the semiconductor shortages, which we’ve called out, as far as JLR is concerned, affected its performance, but performance better than what we originally indicated. The business ended up with a PBT before exceptional items I talked about as INR 3,500 negative, EBITDA down 210 bps, EBIT down 150 bps and free cash flows negative INR 3,200 crores. Peeling this growth a little bit, bulk of it driven by volume and price, the volume going the other way at 5.7% -- volume and mix, price coming at 11.4%, translation of 2.4%. And if I look at the profitability and spend a little bit of time there, EBIT moved from 0.1% to minus 1.5%, the 150 bps delta, but JLR contributed 330 bps negative. Tata Motors standalone went up by 70 bps, and others, which is basically three entities, Tata Motors Finance, Tata Technologies and Tata Daewoo coming strong, and therefore that improved the profitability there another 100 bps at an overall level. We did say and we’ll take you through later, the pipeline, both of our units and of dealer units have fallen dramatically over the period as supply has been the constraint. We came in a little higher at £3.87 billion in the quarter, because the wholesales were up 4,000 units versus our lower range. I’ll take you through later, our breakeven point continues to fall. And therefore, we believe, in the quarter, our underlying breakeven position was between 80,000 and 85,000 units, down from 100,000 at the end of last year. So, I’ve mentioned a lot of those, two things that I didn’t mention from this page. And I’m sure you’re aware, we did a -- simply did upgrade us notch within the quarter also. We had a slower pickup last year in FY21 in the overseas regions, and therefore, we’re doing better this quarter than the equivalent quarter last year. You’ll remember, we launched Defender in Q1 last fiscal year, and you can see the impact last year was partially growing. And you also know that Defender is selling incredibly well in the marketplace, baseline of 5,000 units and even in a supply-constrained position, which we’ve had over the last few months. Electrification continues to increase up to 66% in this quarter versus 55% in the full year, first half. But I think it’s important to note that our electrification would be higher, particularly PHEVs, if we could have built the vehicles that our customers are looking for. The bottom line, our owned inventory, the units we haven’t yet passed over to dealers and to importers. You can see that inventory level is 20,000 units, very close to the lows of last year. And if I remind you, last year, we didn’t build units for 8 weeks. So, that’s how sharp the pipeline currently is. And our dealers, even more so, the lowest level of dealer, which we’ve had going back a long time in history books, just 27,000 units. So, it’s reasonable for you to assume that about 160,000 vehicles waited to be handed over to customers, to our dealers once we can build more cars. That’s the highest level of handover and for a long, long time, probably in the history of our company. I’ve told you, we lost £302 million in the quarter. So, we’re very transparent as normal about what’s happening here. Even though we have a compliant demand, we’re not able to build those cars. So, you should assume during this supply constraint, VME will continue around the 2% level that we remind you in the second half last year, it was above 5%. And contribution costs, as you can see there, warranty continues to be lower, even though we did actually have to book some early model year campaigns within the data. But as I’ve explained before, over the foreseeable future, we’ve got hedges in place which offset most of those costs. Capitalization of engineering costs, I’ll show you that investment in a moment. Now, we’ve gone through ‘21 model year vehicles. And if you remember from 2018 model year onwards, we’ve delayed the capitalization point on those. We’ll give you a full breakout of that, which you’ll be able to see from the balance sheet anyway. Simply put, we’re building a lot fewer cars at the end of Q2 than we were at the same point in the previous quarter. We’ve done the first half year for you, the £1.66 billion cash loss, £1.4 billion of that is working capital. That means that cash breakeven point in the first half of the year was lower than 85,000 units a quarter. And what you should be hearing here is, once we resupply and we build more cars, that working capital will come back very, very quickly and underlying cash positive will trigger, once we get above 80,000 units. But importantly, look at the capitalized R&D versus last year, just over half the amount we were capitalizing and therefore, we’re expensing a lot more than R&D for the reason I said. And if you extend that thought for distances beyond that range, the first 100 kilometers will be electrified, fully electrified miles as well, which basically means if you wish to, 85% of the miles you do in this vehicle will be all full electric. That’s why the emissions below 30 grams per kilometer, you see that there. There will be an opportunity just about two years later than the issue of this vehicle next year to actually buy that 100% BEV option, the BEV vehicle. But, this beautiful modern luxury, gorgeous design will actually be in its purified offering in just over two years’ time. And if not, maybe you’re 1 of the 3 million people that went onto the website afterwards just because this gorgeous, gorgeous vehicle has been revealed. We have teams who will independently corroborate this data, and you’ll see it in our year-over-year data, we only measure by things you can see on a year-over-year basis. So, we’re very confident of the £ 1 billion we’ve actually committed this year. And I won’t read that, but there’s a lot of detail for you to read there, which shows the holistic nature of the program. We’re very, very proud of the work we’ve done in the first few quarters of this program, and it will grow and become more valuable going forward, of course. You know we’ve been focused heavily on two things inside, came into this job 10 quarters ago, improving VME and improving quality. They were two big themes from my first communication yet, and I’m super proud of the work that the teams have actually done beyond the optical data that I normally talk to in so many areas corroborated, of course, by the best in the business, J.D. Combined, we’re most improved, up from 15 to 13th place. I won’t read the rest of it, although don’t miss the Defender the first place in the Midsize, please. We did say to you, this year, we are targeting less than 3.5% on average, for the last four quarters have been down to 3.2% underlying. We did have to book more money on some old model year data, 2011 to 2016 data on a couple of campaigns, which optically moved up to 4%. So, our next job is to get the underlying below 3%, and we’re very focused on that over the next four quarters. However, because of semiconductors, we’re unable to build those units today. Plan B was to actually join other OEMs in terms of a pooling arrangement, which we’ve now done in UK and in Europe and the amount of reserves we have on our books, ultimately will be decided by the amended credits we need to buy. Obviously, in those markets, we wouldn’t have a compliant portfolio because they are less PHEV markets. All right, semiconductors, I’m sure there’s lots of questions around this. Look, we’re making progress, a lot of progress, although we significantly reduced the performance in quarter two because of the challenges we have. So ultimately, that was the reason why we didn’t build more cars and wholesale more cars into quarter two. So, you will see the data in terms of average gross vehicle revenue much higher this quarter than other quarters for that reason, where we could, we did that. And we’ve done a lot of work with the Refocus program, particularly the data analysis and scaled up in digital team. We have more than 200 people in that team now, up from 100 earlier in the year, but we’re targeting not only which cars we should build, but the full end-to-end pipeline write-back to the several sources of chip manufacturer. And there’s been a great leadership from our CEO, who’s had direct dialogue with the CEOs of both the major first-tier suppliers to us who weren’t able to supply the part we’d ask for and right back to the source to the actual semiconductor providers. So, everybody is super clear what we need, and we’ve given you a sense earlier what we need. So, we’re in a much better place to handle this challenge going forward, although it will continue to impact us in the second half of the year, particularly in our Q3 data. It’s dropped again actually around the quarter two data, around 85,000 units. Optically, the data will be lower than 85,000 units in half 2, given the portfolio we will build, but I’m giving you the underlying data actually going forward. So, one thing we will benefit from this crisis, we’ve taken the opportunity for the foreseeable future to reduce our breakeven point from 400,000 units a year to below 350,000 units. So, we haven’t wasted the difficulties we’ve had. I won’t read all this out, but I will refer to the key priorities. By the way, we’re increasingly confident if you link that last slide in terms of our breakeven point low, and we’re increasingly confident about EBIT returns going forward and cash generative. After the Range Rover, Refocused program, I’ve talked a lot about really scaling up to be a significant value-generative holistic transformation program. We’ll be cash and EBIT margin positive in H2, cash positive before the restructuring costs, and we’re pushing to be cash positive, including the restructuring costs, but the data isn’t there with confidence yet. We ended the Q2 with the revenue of INR 18,000 crores, EBITDA of 3.9%, PBT of INR 800 crores negative and a positive free cash flow. And the reversal, what Adrian alluded to in terms of working capital coming back, you’re already seeing that with growth coming in Tata Motors is fully identical, just as the growth came in earlier here. And hence, you’re seeing the free cash flow turn positive here, and I’ll touch upon our data. Key call-outs if I had to put out other than what you saw in the earlier slide, commercial vehicles grew 97%, passenger vehicles 83%, a very strong order book, and EV, in particular, growing very strong. This is despite the commodity pressures, and I’ll talk about it in a little while. And commercial vehicles at 3.1% is basically, the impact thing is this commodity inflation that’s costing the pain. PV has been a standard performer this quarter with EBITDA improving once again to 5.2%, and we are now starting to see almost near EBIT breakeven in this business, which I’ll covered in a while. And working capital improved by another -- by INR 3,800 crores, , and we’ll expect to see this going forward improve as well. Just a flavor of where the numbers move from, I’ll call out in the brackets that you see below. Fixed cost, the investments are not too stressed about, because these are all growth-led investments, higher SMEs because we had IP  in the second half of the year compared to last quarter and depreciation, amortization and product development, basically the new cars coming in is giving you that. Free cash flow, the operating cash, cash profit after tax less investment is positive for this quarter as well as positive on a half year basis, which means despite COVID, this business is now standing on its own feet. And what is basically causing is working capital, which is reversed almost 50% this quarter. CapEx, I won’t touch upon it, in line with what our plan for the year is. If you see, we have grown -- the good part of this quarter has been we’ve grown -- we have gained share in all four segments. On a full quarter -- on a half year basis, we’re now at 44.6% this quarter, was almost 47% plus when Q2 when it ended, so was it in October month as well. M&HCV at 61.6%; ILCV at 49.4%; and small commercial vehicles also starting to grow share means that overall, we are this portfolio is starting to look good, and October has only strengthened it further, which Girish will talk about in a while. Financials on commercial vehicles, wholesale and retail’s growth growing at almost solid, retail 100% kind of a growth. Revenue, up 97% and EBITDA -- and the connection between wholesale and revenues, you see that shows in the magnitude of pricing that has gone into the market. And EBITDA broadly flat at 3.1%, despite this volume growth, as the headwind on inflation that we are seeing, the 480 bps I referred to earlier. So, the volumes were 51% up from the first quarter and almost 84% -- 84% over quarter 1 and 51% over Q2 of last year. And as Balaji mentioned, we’ve gained market share across all four segments in Q2 with the total increase over the last year’s exit being 220 bps. And as you would have seen, I think there is a further potential upside with the mix changing as we get into the second half. We’ve taken a price increase on 1st April, 1st July and 1st October, but the pass-through has not been full. And with the transporters’ profitability is still being under pressure as compared to Q4 of last year, I think there is a limit to which the price increase is getting through. I’m also pleased to tell you that our fixed cost, other expenses do remain under control, therefore, helping the breakeven to that extent. So, that’s the kind of swing which will happen. So, the good things, as I said, there has been a sequential improvement in fleet utilization and is led by cargo -- by agriculture, FMCG, e-commerce essentially, but also, we see a good uptick happening in construction activities generally as well as infrastructure projects. The small commercial vehicle demand kind of continues to be resilient, but I think the impact has been seen due to the semiconductor shortage here. So, it’s this segment where the semiconductor shortage has been hitting us. But overall, I think a very good demand in ILCV and early signs of recovery in M&HCV, I would say, I think, still not there because bulk of the buyers are still institutional customers, fleet owners. Our internal metric, which is trucker’s sentiment index, has seen a very good recovery on both, medium and heavies and intermediate and light in Q2, and this is despite it was done in -- towards the middle of the second wave. Even last year, we had seen that the second half had good volume increase compared to the first half. And in terms of buses now, we’ve started seeing some inquiries happening from skews as well as stage carriage a well as employee transportation as employees start coming back to office. But, I’m sure with the increasing freight availability, the freight rates can go up and the profitability will come back. So, that in summary is what you’ve seen in quarter two for commercial vehicles. Moving on to passenger vehicles, a standout quarter -- next slide please, where market shares went up to 11% and increased further in October. The industry grew 2%, Tata Motors PV grew 53% and EVs grew 190% this quarter. And the full New Forever range of products were really received well, and Tata Punch is now adding to the momentum of this business. And of course, October has only made it even stronger, which I’m sure Shailesh is going to talk about subsequently in the Q&A. This obviously translates -- sorry, specifically on EV’s market share of 71% when we ended the -- in September and the real piece that we’re seeing is an expanding of the booking versus retail. And that’s something which we don’t like, but we are trying to ensure that we service the customer demand. This INR 7,400 crores of revenue the highest we’ve seen in the quarter for Tata Motors. In terms of demand generation, we are continuing to work on standard sales lever as well as micro market-specific actions, in about 20 to 25 micro markets that we have identified and also expanding ourselves in the rural areas. And also, there has been work which has been done in enhancing the working capital of our dealers to support the steep growth that we have been witnessing in the last 18 months. And also, there has been nearly 25% increase in the manpower also at the dealers, which is now sufficient to support the growth that we have planned for in this financial year. On the demand fulfillment side, semiconductor supply situation continues to remain precarious in Q3 also, even though I think it will be better than Q2, and we are taking various actions to minimize any adverse impact. Also, over the last 18 months, we have been taking various actions to debottleneck capacities, especially for the high demand models and various aggregates like engine. Also, in the last quarter, we have launched one new EV, which was Tigor EV and then Tata Punch in this -- in October. I’m very happy to inform that Tigor EV has also qualified for FAME and therefore, it is eligible for various state incentives, which we are seeing the last one, we post we got the FAME certificate. So, I think with all these actions, it’s going to help us further strengthen our sales and financial performance. And for Tata Motors, you see on the right-hand side, for CV, the agenda remains continued market share improvement and protecting margins in an inflationary environment; for PV, to step up the profitability and the sales momentum while continuing to reach the EBIT breakeven month rather they want to. So, that’s what our plan for the quarter is. Once again, request you feel free to type in your questions in the questions’ tab that you have, and we’ll pick it up from here. So, let me then read out the question that’s coming in, the first one coming in from Pramod Amthe, InCred. So our metrics, we took you before through, in China significantly improved in the import business, particularly as a result of quality of sales over the last two years. I think, the dealer inventory levels, the dealer profitability levels, which did improve dramatically actually in Q2 in BEV, particularly on the import business, by far, the most important metrics for us here. So, I do see quite a fast pickup and value-driven pickup in China, once we’re able to increase supply in the second half of the year. I think, Jay, I think we must keep in mind that JLR has announced a Reimagine strategy, which is basically looking at converting the entire Jaguar portfolio into an electric-only portfolio starting FY24, and, of course, 6 Land Rover BEVs coming in as well. Second, as far as funding itself is concerned, Adrian has already referred to the breakeven of the business coming down. Thirdly, the £2.5 billion that we put out as far as CapEx plan is concerned, it’s sufficient for us to manage the Reimagine transformation. I think that it’s worth mentioning, of course, the fact that JLR was the first to have full electric, real top premium car put on the market, which is the high pace, which is an excellent car and successful car. At the same time that the electrification was massively increased in the past years, and you could see the figure of Q2, which is 66% electrified output with PHEV, MHEV and BEV together. And third, I think what is key is to be on time against -- including the evolution of the ecosystem to make it such that when you are really looking for big BEV figures, you get it because the ecosystem is also in place. And that’s the reason that we intend to drive with our next generation of BEV cars, whether it be -- of course, the Jaguars we announced in Reimagine, with the portfolio of BEV only new Jaguars and also with Land Rover because all models will be proposed with a BEV version. Look, you haven’t seen the full benefit of the mix improvement yet within our data. We’ve got order banks, and we have to be responsible in terms of the orders we already have. We’re just starting to see the data at the end of Q2, which is why you saw the average gross revenue increase above 60,000. And then, don’t forget, we’re then going through a series of change for our most profitable and valuable units, Range Rovers and then Range Rover Sports. So, quarter four and quarter one next year, as we start to change those programs on, you’ll see a moderation of that mix. Once we have those new vehicles and the supply issues overcome, I think you’ll see a new norm for us in quarter two next year, and that will walk towards that 7%-plus EBIT I’ve mentioned to you previously. So, you will see it originally before it normalizes out in terms of our mix over the next one to two quarters, I would expect. We do have hedges in place, as we’ve explained to you before, particularly over the next 4 to 6 quarters. We didn’t talk too much today about it, and ignite material cost side, expect all commodities to be offset and even more by material cost reductions on our vehicles up to £1,000 has already been identified and a lot of that will be coming through as we go through the ‘22 and the ‘23 model year vehicles. So, I’ll repeat again, there are pressures not only on commodities, on wages, on transport and inflationary pressures, but the refocused program is there not only to offset those to increase our efficiency. In a normal environment, when we’re producing 10,000-plus cars a week, we thought VME levels were 4.5% to 5%. Whether the new norm is exactly at that level, a little bit less, I’m not certain yet. So, we’ll grow back, but don’t forget, we’ve got a staffed pipeline. We’re also, of course, choosing to only to allow some higher derivatives for a period of time. So, I’ll say 4% to 5%, but it won’t happen as quickly as resupply. But excluding campaigns, we believe we’re at 3.2%. The last one, Jinesh, I can tell you right away, that’s something we’ll obviously see as we go along. So, we don’t reveal the numbers as far as bookings and inquiries are concerned. So, in certain models now, the waiting period of Punch would have increased to 7 to 8 weeks, and in certain models where the demand is very high, it has also gone up to 4 to 5 months. And we have identified certain white spaces where we would like to be present, and we’ll be able to reveal at the right point in time. You will see more action in the next few years, as we have already mentioned, 10 products in the EV, which would mean that one or two products we would launch every year. So, you’ll see action, both on the -- more on the EV and then a few new products as far as the passenger vehicle ICE business is concerned. So, we’ll be able to reveal at the right time. But you can expect that in the next three to four years, you will have more additional new products coming in those segments where the growth is going to be high in future, which is going to be relevant in future and where the size is going to grow. So, Priya Ranjan, it’s a mix of 2 things. So, that’s the first reason, which is hitting the contribution margin. And within that, we will see that as compared to a regular year, our product mix still has a headroom to improve in the sense the percentage of M&HCV in the overall volume, then there is a scope for improvement in customer mix. But I think as we go ahead and as the demand improves, we see the realizations going up as also, I think the fixed costs coming under better control leading to the for improvement in the EBIT. And just to add to that, Priya Ranjan, if you notice the slide on the movement, we have called out almost 480 bps of profitability getting impacted and because of our inability to price the kind of commodity inflation that we are having .The savings program picking up as well as some of these things trending now and more and more cost being -- price being landed in the market, this should start improving from here on. Next question, I think, I’ll probably address it to Thierry and then to Shailesh to amplify thereafter. But for me, it’s a strategical question more than tactical one. And by the way, you can see that with the customer satisfaction data from our model year ‘21. But, what we are preparing is not a follow-up, it’s a real leapfrog in order to be better to the -- compared to the OEM that you are mentioning implicitly in that question. And it is very true that it’s going to have an impact on our strategy concerning semiconductor, hope it gets together. And it is also part, by the way, of an anticipation from the team, but it’s a part also of the crisis that we are experimenting at the moment, which is completely changing the paradigm of our connection to the supply chain -- to the semiconductor manufacturers. So, it’s a great question. And yes, we go in that direction with a lot of enthusiasm, I can say, because it’s a key part of transforming our business from a classical OEM to a tech industry. No, Thierry has answered, and there’s a lot of collaborative work that we are doing along with JLR, also to cross leverage each other’s expertise. So, there’s a work which is being done on the future generation of electrical and electronics architecture together. As far as semiconductor strategy, especially in the light of the crisis that we can potentially see going forward, especially when it comes to electric vehicles, there are multiple initiatives, and we have successfully done in certain cases where in critical items, we are bringing down the use of chip by going with all in one strategy, many a times the components have been different, and we have been able to optimize the number of semiconductors that we use and exposure to a number of semiconductor suppliers. So, I think going forward also, we are going to go for a lot of optimization and the expertise to handle this is a focus area where we are working on. Yes, I think we can extend the answer to that great question to also what’s happening in the way to enhance the synergies between the Tata companies. Of course, Tata Motors and JLR, I think Shailesh answered perfectly well, we are together on the same boat to build what’s next. And that’s extremely promising for all, including in terms of competitiveness. But I think it’s also a great example where already with TCS and other Tata companies we have had fantastic cooperation, especially on the software side, but not only. So, it’s a great question. Next question, I’ll take the question. And do keep in mind that the VME levels in order to land the price also, we have -- whatever price hike we take start transferring into realization become increased VME to that extent. So, we’re hoping that all these will start tempering down going forward. Look, we’ve been working hard to make sure that those order books are not growing even further in Defender. I know the question does say excluding Defender, but we’re somewhere between 5 and 7 months worth of orders, depending on how many units we’re able to pass out of about 34,000 of the 128,000 orders of Defenders. So, we’re not worried about order cancellations. If others can build cars more than we can, it could have an impact, but it won’t take away our desire to hold on to an order book, which is several months in duration. So, that gives you a sense of what’s expected to happen. But obviously, we won’t build those pipelines until we’ve started to remove some of those orders. So, the -- I’ll go back to that build of 30,000 to 40,000 units across the total pipeline. And you’ll see the 2.5 billion inventory on our books grow by a few hundred million, once we’ve added that back. That’s the answer to that, Balaji. So therefore, let’s -- I would rather wait and see every quarter how sequentially things are improving. So I think not just Q4, even Q3 will be a test because last year’s H2 volumes, while they were high, they were high compared with H1 of last year. So I think, in CNG in small commercial vehicles is now around 15%, but this is limited by supply side and not so much from the demand side. So here, in these states, I think, to a large extent, we’ve seen migration happening towards CNG. Question, Adrian, first one coming your way, and second I think is for Thierry question. So, the crossover period going to be quarter four, because of the supply challenges, the rundown of the old Range Rover. That’s very orderly, probably the most orderly run out of the vehicle in the history of automotive, let alone in the history of Jaguar Land Rover. So, we’re very confident on the run out. If you look at your Defender data, last year, you’ll see the first quarter is less than the second quarter, which is less than the third quarter. And Thierry, I’m sure you’re going to jump on to this question. When you listen to the feedback of -- the millions of feedback that we’ve got already from the people who have seen the new Range Rover, it looks like they will not say what is in the question. They really discovered the Range Rover as an absolute new oven, even though again the silhouette family-wise is still there, fortunately, because it’s part of the success, it’s part of the proportion, which are the trademark of Range Rover. And here again, it’s a complete new story. Yes, Balaji, I’ll take this. And these actions, while have been some of the actions, which also got presented in JLR, which was working closely with the semiconductor suppliers as well as the Tier 1 electronic component suppliers, but also, trying to see where we can convert very application-specific chips to more standard chips. And we have also gone for optimization of chips, which was about reducing the usage of chips and evaluating them in a very short period of time, which unleashed potential of available because allocation from the Tier 1 suppliers are very rule-based and therefore we cannot get any allocation more than what comes as per the formula that they have. And we deal with the situation, and it’s given. I mean, we have to consider this as a given situation and we have to continuously work every month to see how we can take all kind of mitigation steps to avoid that, and we’ll continue to do that. And hopefully, we’ll continue to perform better than the industry. And this will be -- we’ll be working consistently on each of these levers, and I’m very hopeful that we -- in the next few years, we should be touching the double digit EBITDA. And the second question coming in -- Adrian, why don’t you take this one, and then I’ll cover the next question on the same point. So no, it doesn’t imply either of those things, actually. So, I’m not going to give you a volume number at this point for sure. I think BMW probably are outlier at the moment, Daimler dealership, you won’t find many vehicles either. So, it’s not just us. I’ve mentioned the cancellation point, very, very few. I’ve mentioned the VME levels that we’re closing existing deals on, the lowest generation. So, all of the information sets that we have doesn’t give us a concern about order cancellation. So, I wouldn’t try and overthink this. There’s a chronic supply shortage to all industries, including automotive. That’s what’s happening, and that’s what will continue to happen over the next several quarters. In the meantime, we’re reducing our breakeven point. So, we’ll be profitable sooner and strongly profitable afterwards after supply has returned. So, it’s an aberration. Don’t forget quarter two last year, we were just building back. And this year’s data, and again, if you’re looking for corroboratory evidence, the average GVR this quarter was 61,000, above 61,000, a rich mix. So hence, why we’re saying our breakeven points are lower and lowering in quarter three. Thierry, maybe I’ll wait for this question. At the moment, we don’t have all data. And it’s very clear that the level of success and the reception of the car, which is just extraordinary, I can tell you, even superior according to our team to Defender is giving us a lot of confidence that this new Range Rover is going to be much better than the actual one, which is already a bestseller till the end of its life. So, we are absolutely confident that we are going to perform much better than we had envisioned, thanks to the welcoming and the success we can already see of the new Range Rover. You already had an answer on the volumes for the second half, which you said you’re not going to comment on volumes. So, I’m very, very confident that there has -- there will be a significant increase in market share, to the extent of 200 bps. And despite a significant price increase when we migrated from BS-IV to BS-VI, from 1st October of last year, we have been consistently taking a price increase every quarter. And while the past 2 has not been completed as of now, I think as we see the demand improving going ahead, we will see the realizations also improving. And at the same time, I think if the commodity pressures continue, we’ll continue to increase the prices, number one. Number two, in terms of margins, see, I think we should see better EBITDA margins for given contributions as we go ahead with respect to the previous peaks, because the realization per vehicle has gone up significantly in the BS-VI era. So, that’s what we see going ahead. Therefore, we will need to continue to buy credit offsets, which we’ll be working with other OEMs in those markets to do so. And once we reach there, we’ll reassess it. CJLR, we’re now operating in the way we are operating in broader JLR over the last two years. So, it’s a two-pronged strategy. They’re still higher than import business, but they’re down to 22.5%, 23% today. And beyond that, I think I’ve mentioned on earlier calls, we did formally introduce the Charge program to CJLR at the back end of our quarter four. So, they’re 12 to 18 months behind the import business and the broad GLR business, but those tools in operations are now being used in the local business also. The reason why we don’t want to put a number on this is that was a very sharp correction we had to do, and therefore, we put a number out there. But going into the third quarter, definitely, both production wholesales will definitely be better than what we see in the second quarter."
}