{
    "symbol": "TTM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-13 10:10:22",
    "content": " I'm joined today by Mr. Thierry Bollore, CEO, Jaguar Land Rover; Mr. PB Balaji, Group CFO, Tata Motors; Mr. Girish Wagh, Executive Director, Tata Motors; Mr. Shailesh Chandra, MD, Tata Motors Passenger Vehicle Limited and Tata Passenger Electric Mobility Limited; Mr. Adrian Mardell, CFO, Jaguar Land Rover; and then colleagues from the Investor Relations team. I want to take a minute on this to explain of a few changes that we have put through in the way we are presenting our numbers post the subsidiary election of the -- sorry, passenger vehicle and the electric vehicle business in India. Due to this change, the stand-alone business, which earlier had the PV and the CV businesses, now has just the CV business and all the debt that is there. So as such, other than for dividend reporting purposes, it doesn't have much of a relevance in the overall scheme of things. So accordingly, we have 2 segments in the consolidated results, one is the automotive segment and others. And within the automotive business, if you read through our annual report, we would have talked about at Tata-branded Commercial Vehicles, which includes all businesses that do commercial vehicle business in the world. And then we have Tata-branded Passenger Vehicles, which includes all the PV,  businesses as well as our design centers, TMETC, Trilix as well as the joint operation that we have at Seattle. And then, of course, Jaguar Land Rover no change. And to help you understand our numbers as part of the bigger brand, you'll also have the comparative numbers of the past also being given in the same format so that you will be able to track ourselves better. So this is a significant shift that we're doing in our reporting, but it is just, again, the whole thing viewed as consolidated downwards rather than the individual business upwards. Most of them are in the press, and there's a hell of a lot of activity that has happened in Tata Motors, on the electrification journey as well as the product launches that have been very, very intensive. And again, all other actions are all in the press you've seen. So if I were to summarize the entire performance of the business, we had committed to a sequential recovery in the business despite semiconductor and inflation challenge, that's exactly what we have delivered in this particular quarter. The business declined by 11.5% compared to last year, but at the same time, sequentially improved. The cash positive delivery in the year, in the quarter at INR 7,900 crores. And of course, we delivered an EBIT of 3.2%, which again sequentially improved. The drivers for this particular performance, you would notice from last year than this year, the big drop is volume and mix. And as far as profitability decline is concerned, JLR, we are well aware of the challenges on semiconductors that we have had. But the big call out I want to leave you with Tata Passenger Vehicles, where I think this business has now delivered EBIT-positive, PBT-positive quarter, which is a big shift in the performance of our business. I think again, we had committed to, but I think we have deliberated it much earlier than what even we had originally planned. And net debt, of course, comes down to INR 48,000 crores, of which more than INR 10,000 crores -- almost INR 10,000 crores is just working capital related, which would reverse once the growth comes back in JLR, almost entirely that is JLR. So let me now hand this over to Adrian to take us through the performance of the business, starting off with the fabulous Range Rover Sport that you see in front of you. Next slide, if you would do, please. We get into the details later next slide, if you would, please. We've taken our breakeven down to about 70,000 units in the quarter, underlying about 75,000, 300,000 a year. Order bank's grown again to 168,000 units, increases in Range Rover and Defender once again. It's worth being aware that within there, we have very few Range Rover Sports within that order bank. EBIT was 2% as we said in the quarter, free cash flow, GBP 340 million, up from the GBP 164 million in quarter 3. Liquidity is strong at GBP 6.4 billion, including GBP 4.4 billion cash on hand. Next slide, if you would, please. Go to the right of the page, you can see there, 1% down on quarter 3. When you look at the model families, it's really important to understand that the runout of our Range Rover provided in quarter 4 is significantly impacting those Range Rover family volumes. You can see it there in the header, 5,000 units down. But again, the cause is either model runout on Range Rover or supply. On a full year basis, down in all areas, apart from the Defender family again, which again is supply-related in those areas. By region, this one, so it actually shows the regional breakdowns within the quarter. U.K., North American and overseas were up versus the 3 quarter. But again, all of these numbers are impacted by supply constraints. Electrified units for the full year, 66% from 51%, 12 months ago. And again, those units, of course are constrained also. I mean, broadly speaking, the EBIT number is flat, GBP 9 million loss in Q3, GBP 9 million profit in quarter 4. Our guidance were higher, 11%, in quarter 4 versus quarter 3 on a wholesale basis. But I've mentioned the Range Rover being down, and that significantly impacts our mix quarter-over-quarter. You can see there, almost GBP 200 million. VME continues to be very low, again, a symptom of where we actually are in terms of demand being much higher than supply has continued to drop. Quarter-by-quarter, we probably met another level, it's going to be until supply lifts. Material costs, increases on commodities are starting to actually impact in quarter 4, but you see on the far right, the commodity hedges are offsetting it temporarily. G&A is higher as a result of introduction of the Range Rover, but we've offset that with efficiencies, building more cars within the plunge you see there within inventory. And the other big callout on this page is not EBIT, but the revaluation of our dollar-denominated loans, obviously, is bad news there, minus 85. That will continue with the strength of the dollar into the first quarter, of course. It does ignore GBP 43 million exceptional item, which we'll reference later. And again, given the message we've given you all year, this should be instinctive. Volumes are down significantly, but we have a mix managed where we could and where it was possible to do so into our most valuable products, you see significantly higher. And then the contribution costs from a material cost perspective, that's a cumulative amount as a result of the challenges in the marketplace now, inflationary pressures and commodity costs increasing. And before we actually get to maturity on a new reimagined architectures, EMA, of course, and Jaguar. And I mentioned that revaluation number with the depreciation of sterling and the impact on our balance sheet, mostly on the loans, which is  year-over-year. The GBP 43 million, which is actually a position we've taken on Russia at the end of March would have made an absolute loss PBT, GBP 455 million. In the next slide, if you would do. Look, our Refocus program continues to mature. Our half 2 FY '22, this is underlying. It's actually 300,000 units. We also expect it to grow because we will consciously now begin to invest more in the value generative side of our business, IT changes and in digital changes. And we also were at very low point in our marketing costs, FX, marketing costs because of the order bank position. As soon as we start to build more cars, we will generate more sales or more marketing. So you should really think about this as our underlying, when conditions start to return to normality, will be 350,000 units or above. You can see in the middle there, look, these are things we've been talking about for 3 years. You can see we're underlying cash positive for the year by about GBP 190 million on just 294,000 wholesales. That's why our underlying cash position is sub-300,000 today. With the working capital full year is minus EUR 1.3 billion, which was greater than the free cash loss, GBP 1.1 billion. You can start to see as we are building more cars in Q4, that working capital will come back to us. We are at the low in our investment cycle, just GBP 469 million in the quarter. We do need to spend more here as well, and we do need to speed up those investments. We do need to cash back a little bit from FY '22, so we'll monitor that going forward, but we have no anticipation will be at these levels for following quarters. Our guidance for next year is still GBP 2.5 billion, and we expect actually -- now the engineers are moving on to those new programs. Look at the top of this page, you should be able to see pretty much anywhere in terms of the outlook for not only within this industry, but we're across industries. Supply, mostly chips, but generally supply, COVID lockdowns in China, inflationary pressures in Ukraine, pretty much any company if they will give you a business environment would use those those 4 icons at this point as yet, which is really good because historically, we used icons, particular to us, like Brexit. What you won't see is the brilliance of the products that we actually have in the bottom there, the Range Rover Sport, the back view, we'll show you the front view in a moment. Hopefully, you took the time to see the reveal on Tuesday night, the 10th of May. We got so much good to happen in the bottom, just no room for the new Range Rover. Our opportunity, if inflation continues because of the strength we have in our brands, Range Rover and Defender will be to do pricing, but our offset for that is really the Refocus program, holistic program, I've talked you about that lot. We've talked quarter-over-quarter, that would happen. Production was actually 82,000 units in the quarter. We do have additional challenges in Q1, of course, with China and COVID, which we're monitoring very, very carefully. We have almost 70 employees actually within Russia, very loyal employees to Jaguar Land Rover, of course. And we've also given some Defender units, which, of course, are built within that plant to the humanitarian aid federations, Red Cross, in particular. We have taken a position on our Russian NSC, and that was the exceptional GBP 43 million loss. Limited impact on supply chain for Ukraine, where there's impacts we're seeing. We are looking to actually look for alternative sources for those parts, given that it doesn't seem to be an age to this terribly sad position in the foreseeable future. We haven't talked to you a lot about China of late, and that's because China has been doing better. But given the China COVID, we felt there might be some questions around China today, so we included the slide today. And what we would have shown you 12 months ago, they improved to 11% while they just continue to get better. There's still a starvation of supply and an excess demand in China, and sales quality continues to fall. Dealer stocks actually -- retailer stocks have stayed about flat over the last 2 years, an improvement up from a very high level on registrations, which again means locally, sales are happening, which is really positive and really strong profitability just on the vehicle sales here at 2.7%. So every one of the key metrics we show in China, these are the same key metrics we will show when China was bad. So the health of our China business is very, very strong. And yes, obviously, it's been impacted by shortages of supply. And we in the U.K. and in China are impacted by shutdowns in terms of the supply of cars produced in China, which was the care point I mentioned earlier through quarter 1. The beautiful Range Rover, we finally find space for it within the presentation, 46,000 units, that will increase 41,000 on Defender. Very few Range Rover Sport, old ones in that database. That 168,000 is going to grow as we go through quarter 1. As I say, hopefully, you did have the opportunity to see the reveal on Tuesday. The -- obviously, of the MLA platform. The picture looks good, but you see that up close, it is just fantastic. We've talked about electrification of our Land Rover products from 2024, including this connectivity, improved capability of our EVA architecture in terms of connectivity. We see that within the warranty data as well, built locally to us in the U.K. The wonderful Refocus program, GBP 1.5 billion in FY '22 across pretty much all of the areas you'd expect us to focus on. A lot of activity in market performance continued into quarter 4 and will continue into quarter 1 and quarter 2, particularly that's the antidote to shortages of supply, of course. We've got a lot of work to do on cost, including now mitigating inflationary pressures. The teams are very, very focused on mitigating those pressures and to help us, the digital transformation program, on both market performance and cost. We are tough on nonproduct investment in the criteria, but we do need to spend more, and we will spend more towards the target going forward. So one of the questions, I'm sure, is inflation. We try to be helpful here again as well, GBP 12.5 billion worth of cost last year. We've identified the key areas of cost that we think is going to be subject to inflation, commodities, to semiconductors, energy, labor. You can see it there, it's about 20% of our total cost. Obviously, we're trying to mitigate those claims, but also that's why the Refocus program, in a sense, is there. It's for efficiency capability, value generation, sustainable solutions, all of those things and the program is mature, and we're confident over the course of a full year, we will offset those inflationary claims. But over the course of this 12-month period, we're very confident Refocus will offset the inflationary claims we're actually seeing. Next slide, if you would, please. Ongoing supply challenges, of course, compounded by the conflict in Ukraine and in China, mentioned commodity inflation. Volumes will, we think, grow particularly as we get through the launches, you shouldn't underestimate, bring in a runner, out of a Range Rover and run in and run out of Range Rover Sport and run in, would in itself mean a slowdown of volume until we are ramping those later in quarter 2. I think that's the last slide, Balaji. This, again, just to reclarify, this includes the Tata Commercial -- all Tata-branded Commercial Vehicles than you have in the world as well. I'll draw your attention to the powertrain mix, a particular callout as the penetration of CNG and EV that you are seeing in the portfolio with ILCV at . SCV commercial vehicle running at 38 buses almost entirely -- I mean, actually, EV plus PV there as well. Really happy to report back that we are now increasing market shares across all segments, and that's happening up for a long time. Financially, I think this is the performance of the overall CV. And basically, I'll call out here is if you look at the revenue growth at 29%, significantly higher than the volume growth led by improved mix and pricing. Sorry, we have been increasing market shares and increasing price and improving sequentially the profitability. Obviously, the biggest challenges remain commodity prices. And therefore, that's something we should keep a close watch on. This is the walk that is there, the big investment that you're seeing in terms of fixed costs are all related to driving the growth of the business as we see that coming back as well. If you recollect sometime back, we used to be calling out this or that 540 bps of negative unrecovered price that has come down. So while the industry grew by 26% last year, we were able to outperform with a 33% growth. So we grew our market share by 250 bps, and the good point is I think we were able to gain market share across all the segments, whether it is medium and heavy, intermediate and light, small commercial vehicles as well as the passenger segment. And after that, towards the end of Q3 and Q4, we have been continuously improving with our comprehensive margin improvement plan and got a 510 bps improvement, both due to the margin improvement plan as well as the operating leverage. Delighted to tell you that we've been able to grow our spares and service penetration consistently, and the penetration has grown almost 2x in last 4 years. So launched more than 18 new products last year, has also 120 variants that you will recollect in the month of October. We, in fact, launched 21 products together, which was received very well in the market. I think the truckers' sentiment index, internal metric that we continue to track every quarter, is doing pretty well. In fact, both in medium and heavies and intermediate and light commercial vehicles, over the last 3 years, it is at the high now. And even in intermediate and light commercial vehicle, it does seem well due to growth in manufacturing sector as well as e-commerce sector. As far as finance availability for medium and heavy retail customers, it is improving consistently. And in quarter 4, we have now seen the retail customers coming back into the market. I think the good point, they have started coming back, and that's one of the reasons that the demand has firmed up in quarter 4. Also a good point, CV passenger, which is the buses and vans, have been doing very bad, so to say, for last 2 years. I think in Q4, the demand has started picking up, and we also see the trend continuing in Q1 of this year. Some of the challenges, we would like to call out inflation as one of the challenges to be addressed. In fact, one has seen the freight rates go up consistently during Q4. But otherwise, overall, I think the trend has been good because of fleet utilizations and freight availability has been going up. So we are watching the situation on overall inflation in terms of fuel price increases and rate hikes, closely watching it. I must say that the pipeline for customers has not yet been impacted, and we see good pipeline in place even in the month of May. I mean we have had, of course, reduced impact in Q1 of this financial year, but in Q4, we had to give a good increase in the steel prices as also precious metal. But to address this, I think we do have a comprehensive margin improvement plan now in place, and we see a consistent improvement happening in the margins. On the supply constraints, semiconductor still continues to be a concern in a few products, in some of our diesel-powered vehicles as well as CNG-powered vehicles. We haven't debottleneck it by looking at various levers, various alternates and by also building some strategic inventory. And we think that, I think, towards the end of H1 of this year, it appears that we should be able to address this to a large extent. So we've taken another price increase on 1st of April in Q1 of this year, and there has been a lot of push in the market to establish these new prices. This time, I would also like to take a few minutes to explain some of the new areas that we have been pushing in the commercial vehicles. And within this, I think we operationalize more than 250 electric buses in last financial year, mostly in Mumbai, West and . And now cumulative, we have more than 645 buses running on Indian roads with cumulative kilometers covered more than 35 million. We also have received the fuel cell electric vehicle Bus order from IOCL this is for 15 buses, and the buses will be delivered over the next 2 years. Lastly, in electric mobility, apart from buses, we've also forayed into cargo e-mobility now with the launch of the Ace electric vehicle just a week back, and very encouraging response. I'm delighted to tell you that on the same day of launch, we actually were able to sign a memorandum of understanding with quite a few e-commerce customers and their logistics service providers, amounting to almost 39,000 units on the same day. So as mentioned, we have strengthened our play in the electric buses with own or maintain and operate model. And also delighted to let you know that we have emerged as L1 in the tender, which was quoted recently by CSL with a total quantity of more than 5,000 buses. So developing capabilities towards flawless exhibition, depot management, and also digital capabilities to ensure that we are delivering the best operating efficiencies to the customers. In addition to this, Balaji and team are working on what will be the right financial structuring for this business as we go ahead. But we do see a very, very promising business opportunity in this area. So fleet edge is our connected vehicle platform in commercial vehicles, with an intent of enabling customers to manage their operations efficiently, bring down their cost, improve their asset productivity and finally, help them focus on their customers better. To date, we have more than 200,000 vehicles on this platform and 90,000 customers with an average engagement time of around 9 minutes. And the fleet edge data is now being used by our team, Tata Motors team, to offer insights on fuel efficiency to the customers. And therefore, this actually becomes a very good consulting, so to say, advice to the customers to improve their fuel efficiency and, therefore, operating economics as also manage, maintenance and, therefore, fleet uptime in better. So we have come up with 2 new value-added services, which is fuel efficiency management program as well as uptime guarantee, wherein we are leveraging all this data to provide this value-added services. We also see that more than 100,000 downloads have been there from Google Play Store and a rating of more than 4 from the customers who have downloaded and are using this. And I'm also pleased to tell you that Fleet edge now has the highest number of BS VI vehicles on the platform, way ahead of anyone else in the country. In addition to this, we've also launched E-dukan, which is our digital storefront for spare parts during last year. So delighted to tell you that in the first year itself, with cost revenue of INR 100 crores, and we have very aspirational targets even for this business. Here, again, the numbers you have seen -- draw your attention to 2 data points here. One is the domestic market share in the last quarter, touching now 13.4%, consistently increasing. The other is the fuel of the powertrain mix that you see, where CNG's penetration now increased to 9% and electric penetration now sitting at 7.4%, substantial shifts that you're seeing in this one. Here, again, the EV market shares 87% for the full year, 94% for the current quarter. Charging infra is an area where the numbers are starting to move quite rapidly, and we'll continue to keep pushing this higher and higher. I think one of the key messages I want to leave you with is, this business has done a very strong turnaround. EBITDA breakevens now,  very strong, moved away from the  6.9% kind of EBITDA. And it's now an EBIT breakeven business, and we also managed to do a PBT breakeven and cash breakeven this quarter. And this needs to be seen in the context of still significant challenges on contribution margins, given the commodity price increases that we have. This you've seen, I'm not going to talk about. That's the only reason that -- otherwise, nothing new in this slide. I think quickly, we have first a flavor of what the industry was in Q4. SUV, as a trend, have been seeing continuous increase as a percentage of their share of TIV. And it increased by 8% and of 14% on the back of some new launches also, which happened during the year. As far as Tata Motors is concerned, but as we already presented that last quarter, we increased our market share to 13.4%. And also, it was the highest ever sales both at a quarter level as well as for the full year of FY '22 in our history of 22 years of being in PV business. We also emerged as the #1 SUV manufacturer in Q4 FY '22 on the back of full strong products, Punch, Nexon, Harrier and Safari. And Nexon for the first time in the full financial year FY '22, emerged as the #1 SUV among 45 models that we have today. In Q4, EV sales touched 9,000 units, which was the penetration actually in quarter 4 of roughly 8%. Talk about FY '23, on the  predictions that we have seen from various agencies in our estimates follow towards a possibility of the industry, surpassing the peak that we have seen in FY '19 of 3.4 million. And this is on the basis that we had over the last 2 years, quarter 1 of both the financial years, FY '21, FY '22, we lost volumes because of COVID disruptions. And also semiconductor, the situation might start easing out and it is on the basis of that assumption. Demand for EVs and CNG models are set to increase, and we are already seeing increased interest of customers in these 2 powertrains, primarily driven by, I would say, increase in petrol prices. As far as Tata Motors is concerned, we have a very robust booking pipeline. Strong response we have seen for SUVs, the 4 SUVs I talked about. In CNG, what we launched in Jan '22 has also got some very strong bookings and is really all poised to grow well. And EV demand remains very strong, and we are fast ramping up the supplies to really catch up with the demand, which is going exceptionally high. And in the last 6 months, we have already ramped up our supplies by obviously nearly 3.5x. Girish also covered, the semiconductor situation is what is still very uncertain and is restricting us to tap the full demand potential that we have. Commodity price increase, there's also one factor, which might impact the profitability. So as far as Tata Motors is concerned, certain electronic components will remain a challenge, but we are taking multiple actions to mitigate this risk in terms of creating alternatives, additional resources, lost formation on semiconductor suppliers and at times, open market price also. And as far as cost is concerned, we will continue to innovate, focus on value engineering. You would notice that the operating cash flows, the cash profit after taxes, ahead of the investment cycle and the investment plans and, therefore, well-funded internally. And we'll also look at the amount of negative working capital that we can tighten that a bit, so that we are able to release some of that. The only callout I have is we will be stepping up investments further between CV, PV and EV, both of them and EV for CV as well. And therefore, we expect to see anywhere between -- close to about INR 6,000 crores of CapEx is what we'll be spending in. It is deploying funds more or the growth coming back, we'll be able to deploy it better. The good news is that the collections are starting to improve significantly, and we are compliant with RBI PCA norms from corrective action. And we are -- having said that, the ROEs at 5.4% is not something that we like. And therefore, we will be continuing to work on improving the market -- the ROEs better by focusing on maintaining our market share of around 30%, reducing GNPA/NNPA aggressively for which the connection strategy is being recalibrated, in line with the new norms that are coming in from RBI from October onwards. So the business is clearly on message and delivering on the strategy that they have, and we will accelerate that going forward as well. And given the strong order book, both in CV, JLR as well as PV, and Girish explained eloquently, the demand situation in CV as well, we do not see concerns there at this point in time. Supply situation is improving, albeit, gradually and commodity inflation is something that we need to raise likely to remain at elevated levels, it will be sticky. And as far as FY '23 is concerned, the immediate first quarter, Q1 will, obviously, have the impact of the COVID-related China lockdown that are there. And this is something once that is behind us, the performance will improve through the year like what we have promised sequentially, it should start continuing to improve there as well. And of course, individual trust area is out there for all of you to see. Let me now first start with the most obvious question, Jinesh Gandhi from Motilal Oswal. Jinesh, I think we are moving to a consolidated down because it is not -- it is meaningless to look at the stand-alone number or just a CV minus interest rate. And therefore, I wouldn't want to do a pro forma. And from a materiality perspective, the CV business in India is something which is quite -- it is the dominant segment there, and PV is almost entirely in India. Therefore, it is pretty comparable to what it used to be in the past. So we do expect volumes to increase, particularly as our Range Rover and Range Rover Sport products come through. You won't see a full year number this year, which is as strong as we run out the year. But I can model 5% in 1 billion cash flow on a series of volumes because we will actually target the volumes, which is highest value. So it will be higher after quarter 1, quarter by quarter towards the end of the year. I'm not going to give you a number because actually, I don't know when COVID is going to close in China, and I don't know when the semiconductor is going to improve. But let me reassure you, there's a variety of volumes the way we're doing this, which will enable us to get to 5% EBIT and free cash flow of GBP 1 billion going forward, but it would need to lift in the second half of the year. No, I do not. No, I do not. That's a phase-in, phase-out and expect the phase-in, phase-out period to be half 1, quicker on Range Rover, slower on Range Rover Sport. And hopefully by then, the China position is closed down and our semiconductor position has eased as well. I did say to you in February '21, it's 18 months before we saw a version of normality. We are seeing anyway, the 3 ways in which we intend to look at our cash cost, primarily being NCF. Second is monetizing in noncore and any residual equity, thereafter, we need, we look at it. Obviously, we fundamentally weighted towards free cash flows. And you would notice even this year, the free cash flow is basically working capital. And as growth comes back sooner to Tata Motors, we do expect to see JLR to restore its numbers as well. And as growth picks up, that numbers will pick up even further. So we are quite comfortable that this plan that we have put out there, that's the reason we are reiterating it. EU March quarter BEV plus 3% was minus 5% of PFs and regulators scaling back support, with Germany phasing out incentives and Shanghai imposing license restrictions. Look, PF in BEV total in Q4 was 14%. So we do actually see, and we do have a lot more demand than that order bank for PF units. There's a mixture of reasons why the GBP 500 million is down, as I say, some was an undefined spend. Whether that means we've reached $2.5 billion within that catch-up in FY '23 or in FY '24, I'm not certain yet. But there is a sum of that cash back, which we actually need to do. Question to Girish, \"Recently, Tata Motors was L1 in the CES in tender. So Prateek, I mean, I would like to give some context. And many of these buses have covered more than 0.7 million kilometers, but we still operate with 95% uptime on a daily basis. So we have a huge amount of experience over these 10 years under our belt, which we have instilled into -- instilled amongst the people. So when this -- in addition to this, I think we have been into this electric bus market now almost for 2, 2.5 years with buses being run over 6 cities. All this experience has been put together, and we actually assembled a team of almost 100 professionals, and they look at each and every cost element, which goes into forming the rate of rupees per kilometer. And then finally, we'll be able to come to the most efficient kind of a number, which we have quoted. And we are quite confident to not just deliver on this, but also to make money at the rates at which we have quoted. Next question, Thierry, this is coming your way. Concerning the first point, I think we -- of course, the uncertainty runs is quite big. At the same time, we can see gradual improvements quarter after quarter even if the speed is actually not the one we would expect, the reality of the actions that we are performing better and better is giving us the confidence that we will continue on that trend and hopefully accelerate. And concerning the robustness of the -- with our bank, I would say, that the desirability of our products is such that cancellations almost nonsignificant as a fact. \"From December into March, we have seen an increase in JLR inventory as well as retailer inventory. Look, I see this as a really healthy sign because we've got several things we need to do here. And over the last 6 months, we fill it about 15,000 units back into the pipeline. Once we start getting up in total from the 66,000 units today, 30,000 we own, 36,000 the dealers own to around 90,000, then the health of our pipeline would have been rebuilt. It's going to take a few quarters and along with that sum, resupply position we've talked several times, but this is a good and a healthy sign. So therefore, actually generates cash as working capital as business growth comes in. EBIT margin's target for '23, '24, '25, you've talked about '24 and '26 and FY '23, you've have talked about 5%, so most of the numbers are there for you from that perspective. No, quarter 1 is going to be a difficult quarter because of China. But the big things, again at Range Rover changeover, Range Rover Sport changeover, China COVID, a little bit of Ukraine for us and then the semiconductor pieces. And as they start to lift, you will start to see the volumes lift in our order bank stabilize. It's very difficult to really assess what will be the change in ASP, especially because of how the commodity situation is going to play out. And therefore, the extent of price increase that we are going to take. But from a mix perspective, I would say, it would be pretty much in line with the mix that we have seen in Q4 and the realizations that we had. As far as order book and monthly order inflow is concerned for -- it's EV and overall, okay, so for overall, I would say it would be about 3 to 3.5x of our monthly supply rate. For EVs, it would be about 5 months is -- I cannot give you the exact number of volume for sensitivity reasons. Not trying to talk about lean, but as far as April is concerned, I would say that we have been growing. We have -- if you see month-on-month, we have been growing as far as our supplies are concerned, and we were able to still hit the number of 41,000 to 42,000. But in terms of what we could have produced, based on the capacity and the order book that we had, I would say it would be still a 10% loss, which would have 10% to 15% loss that we would have incurred in terms of the supply constraints that increased in April. We have already mentioned that in the next 5 years, we are going to launch 10 products. So you can expect 2 products, at least, in every financial year is what I can say. Well, I think the -- it is clear that we are impacted more than some of our competition for many reasons that we have also developed -- I remember in some of the previous meeting we had together. And we are mitigating that with a big array of actions, especially in some long-term strategic agreements, which are helping to make it such that we have a much better allocation. So that's why gradually, we are improving the situation. At the same time, the impact on the brand is maybe the contrary, higher desirability because scarcity is creating that desirability to be even higher to an extent, which are sometimes a little bit incredible, but we are even surprised. We should maybe not, but we are because of the incredible appetite of the customers and clients for our products, and we cannot supply enough. So the brand to a certain extent, is even boosted towards modern luxury at higher level than we expected and faster. Clearly, maybe the next question also to you, coming in from Sonal Gupta, L&T Mutual Fund. We are already working hard on that angle as well along with, as you understood, with the creation of an incredible intense and fruitful dialogue with our suppliers. Not only to one, but of course, even more with our chip suppliers, so for the level of attraction that we are creating for us, especially now that we are sourcing new businesses is making such that we are as well improving the short-term supply just because of the huge interest that we are creating for them. Again from Sonal to -- Girish, this is coming your way. So Sonal, I think on CNG, the balance has to be done between the range and the  because for higher range, I mean, generally heavy commercial vehicles are meant for longer-range use, and therefore, they need longer range. And knowing the retail infrastructure of CNG, I think you essentially you need longer range. So you would have seen small commercial vehicles, mostly used for intra-city applications. Also, intra and to some extent, inter-cities, so there, we have seen a very good penetration of CNG. We are certainly looking at some applications even in medium and heavy commercial vehicles, where it makes sense to move towards CNG and sufficient range is available without compromising on the payload. \"Can you give a production range that you can achieve in Q1 and Q2 based on current visibility, acknowledging that it can change.\" So I'll go back to what I've said before, actually, rather than give you any numbers. Quarter 1, it's going to be difficult to lift quarter 1 because of the China position, the Range Rover position and the Range Rover Sport position. We do expect some of those things, particularly our Range Rover to actually increase production as we go out of quarter. One, Range Rover Sport, new one start production at the end of quarter 1, so it's reasonable to assume Q2 will be stronger, standing down developments in China, of course. And as an extension, can we expect normalized volumes of  quarter for Range Rover. There's only 5,000 in Q4, impacting ASP. So rundown is Q1, ramp-up is Q2, will impact both quarters and the first half of Range Rover Sport. On the Range Rover, I'll say to you what I said 2 years ago on Defender. I said then 5,000 units a month is a healthy benchmark for us. So on Range Rover, I'm going to say, yes, you're probably right, 5,000 a month is a healthy baseline for us. And if you then back load that into 50,000 orders that we have today, that would suggest we were flat out on the planet, sold out for 10 months. So maybe JLR, I'll pass it to you, Adrian; and Girish, CV coming your way. Look, all of the things you've listed here are the things that you would expect -- you expect us to impact this year's results. I'll reference what I said earlier on inflation, we think that Refocus program is strong enough to eliminate that and across all of the headers that we actually have. So yes, inflation will impact, but we expect the offsets to actually be in place and  that problem for us this year. You saw that in China but across the piece, EVP will be strong again in FY '23. Yes, so in the commercial vehicles, let's look at the customer profitability first and then the company margins. As far as customer profitability is concerned, I think more than interest rate, it is the fuel price, which has a bigger impact. So if you see the operating economics of a transporter, the impact of fuel price is almost 2x to 4x that of the interest rate hike. So we'll be more concerned about the fuel price hike and then followed by, of course, the interest rate hikes. As of now, we see good tailwinds in terms of availability of freight for transportation. And therefore, until now at least, whatever headwinds have been there in terms of fuel price and interest rate hike seems to have been overcome with rated increase. Now coming to our profitability, I think we have spoken often that steel price increase is -- has the largest impact on the CV profitability. The next one is from Amyn Pirani, JPMorgan, on China. And on the premium side, it's even more than 50% decrease for all brands included. The situation in which part of the country, but a significant part of the country is such that, I think, people are thinking about other things than buying a new car at the moment. However, as soon as the situation is going to come back to normal, the appetite to catch up, and we can see that with all the contacts we have and all the insights we have in the country is absolutely massive. And by the way, it's happening in many countries. \"Tata Motors has a significant volume rack of plans for EVs, for PVs, for buses, for CVs. Fleet as well as the passenger segment, and we are trying to see where the potential synergies can be in the area of motor as well as in the area of batteries. Batteries, especially the chemistry that we would like to choose, the form factors as well as the C rating because of the fast-charging capability and all. This industry has certain areas where we have seen convergence, especially, let's say, for example, as CVs and the fleet segment and PV where there are certain commonalities that we have seen in the low-voltage category. And over a period of time, we have taken a view of next 4, 5 years. We are expanding different segments, require different kind of choices to be made, different power ratings, and therefore, there are areas of synergies, but also areas where we have to be different. As we had indicated earlier, I think there's clearly a plan for -- from a Tata Group perspective to look at setting up battery facilities. In the meanwhile, there are clear plan -- or in the intermediate period now and until the time the factory comes up, traditional battery sourcing strategies are being implemented. See, earlier when we had started our EV business, we had an off-line arrangement of fitting the EV powertrain. As far as certain supplier capacity and certain component capacity is concerned, we have enough headroom than what we are supplying right now. We have also come with a very comprehensive and based on the volume projections that we have to add new lines in the area of battery packs, the right line and power electronics items. So as far as capacity is concerned, we are absolutely on track, something which is really stopping also restricting us to unleash the full potential of demand that is out there is the issue of semiconductors. The material cost was down GBP 80 million quarter-over-quarter, and our hedges were up GBP 82 million, but those hedges are running off. And I think over the course of the next 12 months, we have about 25% of that hedge. So if this continues into the second half of the year, we will certainly be more exposed. We expect the Refocus program to offset all of our inflation across, including the increases in commodity costs in FY '23, may not land evenly by quarter. But we certainly, over the course year, will offset all of these costs. So on Jaguar Land Rover, the 1%, look, that is the low supply number, 1%. As we resupply, that number will increase during the course of the year. When we do resupply, the products that are -- the biggest order banks and the biggest demand will have the lowest VME, Range Rover, Range Rover Sport and Defender. So actually, I see us being in quite a healthy position in the foreseeable future because of resupply -- so as to resupply and then those products are very, very sought after. I think the next question, Girish, this is about CV business. \"Can you talk about fleet operator economics,\" and Girish covered it quite extensively, so we'll skip that. So I think the -- last year, we had 2 COVID waves, first one was in Q1 and the next one, a minor one was in Q3. And we know whenever the demand goes down, I think the OEMs keep on fighting for lower volume, which is available in the market. But I think we should also keep one thing in mind that there has been significant price increase, which has happened during the last year due to the commodity price increases. And the pass-through within that has not been full, has been part of that, which is, therefore, led to increase in discount in absolute terms. But if you look at the movement from first January of this calendar year to now, I think gradually, the market operating prices are going up, which is, therefore, helping us to improve our realizations. And we have seen on the operator side, in terms of their economy, I think the freight rates have also been going up. So overall, we see improvement in their economics. And just to amplify that point, if you noticed the waterfall that we had. Earlier, we used to be having under toward pricing of almost 500, 600 bps in the -- that we used to call out, that is now down to 200 bps. Thierry, I think it's probably coming your way. Also, we are entering with,\" -- let me do a stop there and then go to the next question. Well, the partnership we have with NVIDIA is really going to be visible in the next generation of cars, the EV cars, you're absolutely right. And on all our products, actually, with state-of-the-art capabilities in terms of ADAS and autonomous driving. The next question, also to you. We want to reinvent completely our brand, of course, using the best of its legacies, but preparing and you wish that copy of nothing. But a copy of nothing means also -- and because of the legacies, the great legacies of our brand, making such that we are agreeing to demonstrate an absolute technology superiority. And this is where in the EV world, what we are performing with e-racing is absolutely fantastic when you see the magnitude of what we can translate from truck to road. So far, we can have the ultimate] technologies in terms of electric draft train and, of course, specific controls, might that be battery management systems or electronic architecture and so forth. Next question, Shailesh, this is coming your way. So as far as hiring in R&D is concerned, of course, we are going for major hiring, especially this year, but there is also another area, which we have looked into very deeply is upskilling, the current engineers within our R&D. And that's going to be also a big component of how we are going to really expand our R&D base as far as our EV is concerned and also to a great extent on the CV, EV side. There are many areas where we are starting to develop these capabilities, whether it is in the area of battery trap, BMS, motor design, new architecture, especially the pure EV as we have shown in the concept of AVINYA as well being from the area of electrical architecture. And there's a lot of collaboration work, which will also happen with various Tata companies, JLR. So capabilities will not be only, I want to say limited to within Tata Motors, but also seeing the opportunities of synergies with JLR as well as few other Tata companies, which are going -- which have a lot of capability in the software. See, I would not like to preempt this at this stage when it is in the stage of onset development and engineering feasibility. But I would like to say that our choice of voltage architecture, which right now is in the range of 300 to 400 volt for Gen 1 and Gen 2, will depend on how the charging infra we are seeing are going to pan out, at what voltage levels and the state of grid as far as India is concerned. And also more importantly, the choices that we have as far as aggregates and subsystems are concerned for different voltage levels. But right now in India, we see for quite some time that this will be in the zone of 300 to 400, where we get the sweet spot. So right now, as far as AVINYA is concerned, I'm not confirming that it is going to 300 to 400 volt, but these are the considerations that we are taking into account. I would maybe just complement with a -- and I'm going to  the one first of the incredible change in the value chain of this e-mobility compared to the previous ones, of course. Because we need to really master some control holes -- you mentioned the sales, Balaji. We could mention the semiconductors, the strategic semiconductors, which are part of this new value chain. And it's clear that mastering, controlling the value chain, which is not excluding from partnership is absolutely critical in order to manage not only the technological security, but also and even ultimately the customer satisfaction and . So we are, of course, actually the people, that's no doubt. It is absolutely true that the second point in my view is the way we can enhance and embrace the full ecosystem, which goes along with e-mobility, with the technological advanced capabilities that we have in order to manage not only the product, but also the services, but also a seamless experience, for example, when you are charging. And all that is very much part of everything we can share with the Tata Group, and one of the key point being, of course, software as you have rightly mentioned, Shailesh. I think with this, we come to the end of the questions that are there. But if, in any case, you believe that you would love to take a clarification on something else, feel free to reach out to our Investor Relations team, and we'll be more than happy to address you on that one."
}