{
    "symbol": "TTM",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-27 12:46:05",
    "content": "  Operator: Ladies and gentlemen, good day and welcome to the Tata Motors Q1 Earnings Conference Call. Thank you and good evening, everyone. On behalf of Tata Motors, I would like to welcome you all to our Q1 FY 2022 results conference call. Today, we have with us Mr. Thierry Bolloré, CEO, Jaguar Land Rover; Mr. PB Balaji, Group CFO, Tata Motors; Mr. Adrian Mardell, CFO, Jaguar Land Rover; Mr. Girish Wagh, Executive Director, Tata Motors; Mr. Shailesh Chandra, President, Passenger and Electric Vehicle Business, Tata Motors; and our colleagues from the Investor Relations team. And as is customary, we'll probably spend about 30 minutes going through the deck at speed and pausing on the areas that where you'd want to amplify and there after open up for Q&A as we want. And the key ones I'd call out here in Tata Motors is in the passenger vehicle side, the launch of the #Dark editions, of course, the Altroz, Harrier and the Nexon. And in JLR, of course, Reimagine program continues apace, and we launched the long wheelbase of Range Rover Evoque and, of course, a record order banks that have got 110,000 units, close to about 29,000 of them is just Defender. It's fair to say that this has been a challenge quarter for us, having seen a solid recovery through the pandemic and coming out of the pandemic. But this quarter had to contend with semiconductor shortages as well as the second wave lockdowns in India and, of course, issues of wave two elsewhere in the world as well. On a year-on-year basis, the numbers are flattering because of a very low base. Therefore, we have given also the Q4 numbers for context. And therefore, you would notice that growth of about 132%, obviously, lower than the  last quarter, Revenue of about ₹66,000 crores lower as compared to the ₹88,000 crores last quarter, about 107% on a year-on-year and a PBT before exceptional items over ₹2,600 crore loss. EBITDA of 8.3% and EBIT of minus 1.8%, basically showing the operating deleverage coming in because of the volumes coming off on a quarter-on-quarter basis. Free cash outflow of about ₹18,000 crores, most of it coming out of working capital underlying because of the volumes coming off. We will see growth coming across all factors, be it volume, price, translation and others. And on a profitability basis, we did see significant improvement in JLR, TML and Others is basically Tata Motors Finance which I'll talk about towards the end. And on a net automotive debt basis, the underlying debt was about ₹34,000 crores when we ended last year. This quarter, it did deteriorate, almost ₹16,000 crores of it is coming from working capital change as it unwound and the business, of course, delivering about ₹37,700 crores. To the points he made, we've included this quarter four FY 2021. And I remind you, in our view, that was a really good representative quarter for us  concerns which is why it's a really good comparator. So, it just reinforces the retail level we have in the marketplace today, pending supply issues, is very strong. Obviously, our revenue is determined by wholesalers, not retailers. You can see already an impact on revenue in Q1, which of course will continue into Q2. EBITDA 9%, obviously, suppressed by the volume levels as well. And the free cash flow was the £1 billion outflow within £4 million, the numbers which we announced on the July 6. So, most of that I've already said, I think the thing that I didn't say was the order bank. Just a reminder, that's 110,000 units at the end of June. So, these are the quarter one retails, 124,000 units by major region. Of course, this time quarter one last year was significantly impacted by the dealer closures and the isolation of our buying public along with the rest of us. China, of course, returned to normal much sooner than other regions last year. But even in China, on a year-on-year basis, we were 14% higher. Overall, 68% higher at 124,500 units. Of course, these will be impacted sooner as we only have a pipeline before we hand over to our dealers and importers. And the important point, that wholesale increase of 73,000 units was dramatically lower than retails. Normally, the only difference should be CJLR, the joint venture, of course, where you'd expect retails of about 15,000 units in this quarter. So, here we see a big fall off in wholesales. And I think the key point to take away from this slide, as pipelines and dealer stocks are falling, you will begin to see falls in retail sales from quarter two. The numbers of – underlying numbers of H2 gives us the confidence that, from an EBIT margin perspective, we are clocking at the right level. So, as and when the current semiconductor issue gets resolved, things start improving. And, of course, from a cash flow perspective as well because of a big one there because second half year we did almost £1.2 billion of cash and that will also feed through in our – as the years progress, from second half of this quarter onwards. So, let's then move on to Tata Motors. And therefore, that resulted in wholesales coming off from 195,000 units to about 114,000 units, so a sharp drop there. And that translated into revenues also coming off from ₹20,000 crores to about ₹11,000 crores. Year-on-year flattering, I won't cover that. An overall, EBITDA margin of 1.8% compared to the 7.8% we did earlier. The key call-outs as far as the volume and revenue, we'll talk about a little bit of market shares in a while, and passenger vehicles as well. The highlight standout for us is PVs orderbook of about 53,000 units, going strong. And highest ever quarterly sales of 1,700 units and moving on stronger. Profitability, the CV EBITDA was breakeven, with the volumes being impacted since operating leverage as well as inflation playing out there. And on PV, the 4.1% is a continuing progress that we see. Cash flows almost entirely explained by working capital, with a very strong liquidity of ₹5,800 crores. And there, you can see the deterioration of the variable costs, with the commodity inflation, particularly in PV, being greater as well as all the precious metals cost increase. On fixed costs, this is a lockdown unlike last time. And it also resulted in  picking up, but that was needed to ensure that we service demand subsequently. So, this time, it was a business agility plan and hence these things were kept going unlike last time. Cash profit after tax and investment, if you just add the two, broadly there. And therefore, even at these low levels of volume, this business is now able to hit cash breakeven, which is a good news. And everything explained as working capital and combination of payables, trade receivables and inventory, all of them going the other way. And inventories, in particular, we have consciously built up, first of all, to ensure that the semiconductor, whatever is coming our way via manufacturing cost, demand is going to come, and payables just absolute volumes being low. Investment spending on track, around ₹3,000 crores to ₹3,500 crores is where we'll expect to land, somewhere in that range, more towards the lower end, then see where we land. Moving on to the commercial vehicle business, the market share is the key measure there. So, now is the third year in a row market shares have been increasing. And this quarter, we picked it up further to about 62.7%. And IL series as well, we have now started to increase market shares and we're consistently picking that up. Draw your attention to the graph on the right hand side top corner where, if you look at the SCV salience, it used to be only about 50% of the business, now almost at 65% of the business given the current economic conditions. And there, when you're losing shares and also at a lower level, it has impacted the overall market share, the 40.5%. And at the same time this year, we'd want to really go ahead of that. Buses remains the sectors where the sales has almost evaporated and we hope and pray that, come second half of this year, buses will come back again as schools start opening. Hence EBITDA breakeven, which is disappointing because this business was very comfortably coasting towards the double-digit EBITDA margins, so combination of lower volumes and commodity inflation did cause grief, and hopefully this will start recovering from this quarter onwards. EBIT, of course, just a factor of operating leverage. So, first quarter of this financial year was going up and down. And then further in the month of May, there was another drop of 50%. So, from March to May, the volumes actually dropped by almost 75%. But the good thing is, in the month of June, the volume started picking up especially in the second fortnight, and one saw almost 94% growth over May, which means that volumes in June came back to April level. At an overall level, Q1 volumes were 56% lower than Q4, but at a very good level as compared to the previous Q1 of FY 2021 when we had almost a complete lockdown. So, localized lockdowns across the country have actually helped the economy to continue and we were able to sell volumes almost 4.5 times of last Q1. As Balaji mentioned, I think MHCV and ILCV market share momentum has continued, and which augurs well for us. I think the focus now is on SCV and pickups, as Balaji mentioned. At an overall level, I think the freight has started improving towards the second fortnight of June, with the e-way bills increasing, diesel consumption increasing, our internal metric of workshop job parts also recovering. As far as freight rates are concerned, I think they are also improving from the low that they need in the month of May. In terms of commodity inflation, I think this is something which we keep on fighting. And as a result of this, we had to take two back-to-back price increases, 2.5% in April and almost up to 2.5 even on July 1. This is in addition to the cost reduction efforts that we've started, accelerating further basis the steel inflation and also some inflation in the precious metals. With the increasing prices of diesel and gasoline, one has also seen an increase in penetration of CNG. So, CNG penetration is not limited to a few pockets in the country, with the CNG infrastructure also improving. Because of this, profitability of the transporters under stress, one saw the sentiment index of transporters also going down in Q1. So, satisfaction with the current conditions were actually negative, which means the transporters were completely dissatisfied with the current state in Q1. But the good part there was they were optimistic about the future, going ahead in Q2 and H2. And this is driving the demand in tippers and also in segments like cement, steel and minerals. We also see the e-commerce continuing to do well, which is for both hub to hub as well as last mile distribution. In terms of availability of credit, I think financial collection ratios have started to improve towards the end of Q2 and after a good fall in April and May, and this has also, therefore, led to increase in availability of credit and convergence in the month of June. Going ahead, I think with the diesel prices as well as where we are on the freight rates, the transporter profitability is still a concern. It is still below the levels of March, but the freight rates are continuously increasing with the demand increasing and the demand/supply balance being restored. So, one therefore looks at the transporters' profitability improving as we go ahead. Semiconductor availability continues to be a focus area, so we are managing it from a war room perspective. And we are looking at almost every component where semiconductor goes in and tracking it on a daily, weekly, fortnightly, monthly basis depending upon how important that part is or what is the inventory with us. So, we have taken multiple steps here, like engaging directly with the semiconductor suppliers, spot buying of semiconductors from the open market. We're also developing alternate sources to ensure that at least towards the latter half of the year, we are in a better position. And also, parallelly, we are looking at design interventions to optimize the semiconductor consumption or the footprint in the overall vehicle. So, these are all the steps which have been taken, and therefore, in Q1 where we were placed better, of course, the demand had also gone down. And with the current visibility of demand for Q2, we seem to be placed better, but as I said, this is something which is being tracked almost on a daily basis. Coming to the next challenge, the inflationary pressure, especially on steel and precious materials, continued and more so on steel in commercial vehicles. And therefore, we are having a significant drive towards cost reduction by repurposing a lot of our teams to ensure that we are able to pull out whatever amount of steel consumption is possible and, therefore, reduce the cost. And finally, I think the CV passenger area, buses still continue to have a very, very muted demand. There has been good pull to some extent in ambulances, but otherwise all other buses continue to do very, very low. So, employee transportation for manufacturing sector seems to be doing well. But all other segments, whether it is employee transportation for IT sector, school buses, even intercity transport is something which remains muted. But I think, gradually, the things are improving as we had also seen last year where the Q4 was comparatively better. So, that's, in a nutshell, summary for CV business. Balaji, back to you. Moving on to passenger vehicles, market share of 10% remains the high and the penetration of EVs is also starting to touch 3% for the quarter. And even within that, I think we are now seeing all our segments starting to do well, particularly market shares for midsize SUV segment was up almost 800 bps, the strong response coming from Nexon, Harrier and the Safari. What we are noticing on the EV side is highest-ever quarterly sale of the portfolio of 1,700 units and market share now  77% for this quarter. So, good momentum building up on the passenger vehicle business, and continues that way. So, we intend to keep it around these levels at this point in time. And we'd like to, obviously, make sure that doesn't go too much out of control. And profitability, of course, continues to do well. So, this business is very much on a turnaround and should improve performance even further as we go ahead. As Balaji has already spoken about the last quarter performance, I'll share with you the actions that we are planning for in Q2 as we witness progressive recovery in July and expect the quarter to be reasonably better than the same quarter that we had seen last year and also versus Q1 of this financial year. So, on the demand generation side, we have identified certain micro markets where we are systematically working on focused levers to drive growth and also working on certain supporting interventions to recover in product segments and geographies which were impacted in Q1. And to make the most out of it, we have planned for festive campaigns and also our presence will be felt in IPL which restarts in September to provide better visibility to our products ahead of the festive season, October and November also. The hashtag #Dark is what we launched this month is one such example, I would say, and this is getting excellent response. So, there are going to be more such interventions in this quarter also. Our network is key to our growth and we are systematically strengthening it in terms of reach, in terms of dealer customer experience processes and also channel health. On the demand fulfillment, we have progressively enhanced our capacity in the last two quarters, and we should be able to now realize the gains on the back of the strong demand that Balaji also mentioned about. We have new product lined up, and we are trying to accelerate the work on the same, especially those variants which are witnessing high demand. Example, CNG and also EV is now really moving very fast. Given the supply side risks due to various uncertainties in the environment, we are also building strategic inventory for the identified components. As far as profitability is concerned, we are keeping strict control on cost as per the business agility plan that we have developed. In a supply constrained environment and where certain product segments are facing pressure, we are also trying to best optimize the mix to drive better profitability. In the last quarter, we did – involving more than 1,000 employees to drive cost erosion ideas. Finally, given the continued pressure of the rising commodity prices, we will be taking price increase to potentially offset – partially offset the same. So, this was a quick update on the actions that PV business has planned for in Q2. So, moving on to Tata Motors Finance, I want to take a minute on this one. And unlike last time, here, we had our collection infrastructure people getting impacted by the pandemic and more than 1,400 people were impacted by COVID. And so, we had consciously taken a call to slow down  visits to various places to protect our people. And that did cause grief in terms of collection efficiencies clearly dropping, as you see in the line chart below. And in July, we are already seeing 101% collection efficiency coming back again. And this meant that the NPAs shot through the roof, 5.3% to 12.3%. During the last time same time, there a moratorium of three months on and clocked had stopped ticking on the NPAs. So, we have done our best in terms of protecting our people. And we now expect to see a significant reversal on GNPA provisions in the current quarter as collection efficiencies pick up, but this has been a – from an overall perspective, this quarter was a very, very tough one for the Tata Motors Finance team. So, overall outlook, to summarize, the demand situation, we see continued improvement as vaccination rates pick up. Supply situation, of course, is going to be challenging between semiconductor issues, commodity inflation and intermittent stoppages due to lockdowns. For JLR, Adrian has already covered it, but we do intend to manage all the supply chain risks. As things pickup, achieving a positive EBIT margin and positive free cash flow for H2 is a key priority at an overall level. For Tata Motors, I think commercial vehicles growth – it's continuing to grow market shares across segments, and SCV in particular is a key one. And for PV segment, we've accelerated the sales momentum that we're seeing. And in CVs, we would want to drive up penetration even further and accelerate  setting up of the charging infrastructure on priority. I think the first one from Aditya Makharia, HDFC Securities. The first point, of course, is there is a peak selling period in China. Last year, it was basically Singles Day in China. So, it's the Chinese New Year. So, you might be referencing a normal in-market fall off after China New Year, i.e. If I give you the data sets in quarter one, even though China, for us, as pretty much returned to normal last year, we were up 14%. So, in a like-for-like period, taking out premium selling periods in the market – in a particular marketplace, like-for-like, we were better in China. Last point to make, our China volumes will start to reduce in Q2 alongside other regions for the reasons said, i.e. And second related question, we've seen the material benefits of staff cost reduction due to restructuring as well as depreciation due to impairments. And then, I have a question for PV, which I'll take it subsequently. And even though commodities are increasing, if I give you a value in the quarter, it will give you a sense of that. If I compare that to the £243 million improvement year-over-year in VME, you can see relative to verbal marketing and the health of sale, it's a small impact. And we expect it to be an increasing impact, but relatively a small impact going forward also. So please, it's not commodity prices that are going to influence and impact what we do in performing going forward. The VME pieces are much more impactful, along with warranty, which is why I've consistently called those out over the last two years. Well, we've got a slide in the deck. You'll see our absolute costs in quarter one last year, which we had the furlough monies in there. We called out that number, £115 million improvement year-over-year last year compared to this year. I keep saying to you, quarter four is your reference quarter here. So, when you look at the impact of staff costs, they have gone down versus quarter four. Again, when you look at that slide, when you have chance to look at page 38, you will see that our D&A did drop actually versus prior quarter a little bit. And the point of MLA mid, of course, is those assets are on the balance sheet, not yet being depreciated. So, the saving for MLA mid, which you may be referencing here, was actually a cost that hadn't then, at that point, come through to our income statement, but would have if we had brought those vehicles to the marketplace. So, there's a small reduction on D&A. Going forward, you won't see a reduction. So, I will not get into the numbers in terms of capacity because it's slightly complicated from a shop to shop when we go. But broadly, if I have to give you the capacity utilization of the three locations in which we operate, I would say Pune and Sanand would be operating somewhere around 65% to 70% now. And Pune is going to go upwards from here because of the new launches, which is slated , which, as you know, is going to get launched in the coming months. As far as Ranjangaon is concerned, which is the CEAT joint venture factory that we have, the capacity utilization would be greater than 90%. And our engine and transmission, which is powertrain capacity utilization, would also be upwards of 90% is what I would say. On the price increase so far in May, we have taken about 1.8% price increase in PV. If we took a price increase on April 1, it was about around 2.5% across the range. And looking at the steel price increases, we have taken another price increase of around 1% to 2.5% starting July 1. So, those are the kind of price increases we have taken. I think in both business units, it's not that easy to pass on. And our focus also, therefore, has been to look at what we can do on cost reductions first. Balaji, back to you. Because inventory is very tight, all OEMs are seeing pricing and mix improvements during the period. However, I'm curious as to the ability to upsell customers with more marketing  being done online. You're starting to see the first impact in that, then our verbal marketing. Obviously, that's the money we use to close deals. And the verbal marketing support is starting to fall quite dramatically, actually. So, you will see already in quarter one, as a result of the pressure on supply, that the deals we actually did with customers were more valuable to us. Now, that was quarter one. in addition to that, we will also – and also to control our order banks, of course, we don't want order banks of four, five, six, seven months on average sales. So, those are two things, one already happening. And now, we're going on to the next stage of taking away the lowest value derivatives within a nameplate. So, customers, if they wish those cars, we'll need to up-specify their vehicles for us to be able to deliver that to them in the marketplace. Most of the second piece will start to impact in the second half of the year, not the first half of the year because, of course, our obligation is to fulfill the orders we've received already in the order banks, those 100,000-plus units. And second, China JV's repeated slip into losses is a concern. So, inventory at March, it was globally at £3 billion level. Let we remind you, two years earlier, it was £4.4 billion. So, we've not only been impacted by the supply shortage, we'd already drastically reduced inventory just over 30% across all nameplates, all markets, all regions. If anything, on a number of nameplates in a number of markets, we now have too low inventory, and that would impact when – at this level, that is starting to impact the number of customer orders we can close out. Hence, the retail levels will be suppressed in quarter two. So, what you'll find is it will continue to drop, but there is no drop to an unnaturally low level and we do need to bring it back appropriately actually to levels we were seeing closer to February time, I'd say, rather than March time actually, February last year time as we normalize this position. Any medium-term fix – well, don't forget the China JV has been impacted by the semiconductor supply as well. I did say to you, I think at the year-end, we formally kicked off a charge improvement, structural cost program in China. Our breakeven point going into the start of the year was above 70,000 units. We're challenging ourselves to get down to 65,000, a 10% structural cost improvement and then below that. And the other key metric in China is that you wouldn't see, obviously, our quality of sales – this is for local cars, of course. And the health of sale, there were 30% discounts on a number of our products. There had been oversupply, inventory at the dealers were 2.5 months. And don't forget, finally, of course, we're replacing two of the products – Range Rover Evoque extended wheelbase is now new in the marketplace and the XF Long as well. So, mixture of all of those actions we've taken and taken on structural costs, together with supply, we think, will improve the position in our China JV considerably. And very clearly, we see excitement in the EV portfolio and we know that as and when charging infrastructure comes in, you are able to break one of the barriers to the adoption and we are working closely with Tata Power on this one and we definitely want to play a role in capitalizing charging infrastructure, as I called out even in the outlook slide as well. And our job is to definitely come in in terms of being technology providers for that, working with the world-class leaders in scrapping, whom we're already getting into conversations with. And the ecosystem partners will be the ones who are doing the investment, operate it and also make the profits out of it. And we are able to ensure standards in terms of how staffing is done, how recycling is done, how reuse is done, and ensure that this is sustainable and it is world-class in terms of what we bring as traffic. Pricing-wise, we have said at least we'd want to bring – we already have intense conversations with our ecosystem partners. And over a period of time, we want to get up to at least 10, if not more. So, that's the work on this. So, the current supply rate, whatever we have been supplying in the last two to three months, if I have to take that as the basis, then our order book would be anywhere between 14 weeks to 16 weeks, I would say. But in the last one or two months, this has really shot up. Back to you, Balaji. Adrian, continuing on the JLR question, chip shortages. And then if I may, I will ask Thierry, actually, to – he's leading this from the front. In terms of the tier 2, what we would specifically have had in mind as we wrote that with a couple of significant issues we brought to your attention previously, i.e., the Renesas plant fire in Japan, which happened in the middle of March, and yes, production is now back and being built back towards the 100% level. So, we do expect that to increasingly improve as we go through Q2 into quarter 3. And another one would have been the Texas snowstorms, which, again, were around that same period in late February, early March also. And similarly, we would expect those facilities to be coming back onstream progressively as we go through Q2 into Q3. We expect it to be better than the 90,000 units by the time we get there marginally, but we just don't have those confirmations from suppliers yet. So, once we get to a point where we get those confirmations, if it's significantly different to what we've communicated, then we will communicate that to you. However, I would like to hand over to Thierry if he's able to hear me. He has a first-hand flavor of this, and I'm certain there are things that I would have missed from that response. Well, I th ink what is very key in this very severe crisis that all OEMs have at the moment with the chip supplier is that we are – let's say, we are learning and we are learning very fast about the way our chip suppliers are working. That means, for example, having long-term contracts with them with take-or-pay approach so far the capacity is there, whatsoever. And the good news is that we are getting doubt , and we are doing that with our key offender at the moment, we speak. And JLR is well-positioned to a certain extent because our size is considered to be quite small compared to some of the big customers, especially outside the OEM world. And as such, it's also a very interesting approach that we are following at the moment with the chip suppliers and with our tier 1. Back to you, Balaji. I think as Thierry and Adrian just referred, things are too fluid at this point in time. And obviously, as clarity emerges, we'll put it back again. Let me remind you, each time I communicate this, the timeline gets shorter. We expect some of that new product now to be in the marketplace within nine months, which is really good, the Range Rover, and then the Range Rover Sport six months later than that. We don't plan to, in any way, slow down the launch of these vehicles. Whether we find, as we launch, that some of those semiconductors are a problem on the new vehicle or not, we haven't got to that point yet, of course, because we're not yet clear enough on Q3 supply. So, our intention is to absolutely push ahead in delivering those wonderful new vehicles to the marketplace when they're ready, and that's likely to be in around nine months' time. I think maybe if I may, Balaji, add something and complement the answer from Adrian. And the fact that we are under tension because of supply doesn't change, at the contrary, but intensify all efforts in order to grow faster in our plan of progress. So, which means that the company is getting more muscular, is getting faster, it's getting better synchronized. And as far as CV is concerned, they are saying annual demand is coming back . VME, I'm going to interpret midterm post supply shortages rather than during supply shortages. So, once we get to a normalized marketplace, assuming there isn't a permanent correction here, then I would anticipate that that guidance is still good guidance. From an emissions-related penalty perspective, I've mentioned to you today the quarter one data. So, at that level, it's actually non-compliant. So, we would need that number to grow through to double digits. Let me say, in total, about 12% goes to get to a compliance portfolio. We know when we look at the order banks from our customers, we are at that level with a strong requested demand for our PHEV units. So, again, it's about 12%, not the 8.5%. And we can see that, within our customer order banks, it's just our ability to build those cars today, which is holding us back and penalizing us from a potential fines perspective. Again, I think you're asking me beyond the chips piece. I think there's two levels here, actually. I do believe the actions we've taken, trying to moderate the increase of the order banks, trying to reduce the lower derivatives within nameplates, of course, that's going to have a natural impact to reaching those average selling prices and improve even more the net transacting prices because of the lower VME. So, I see those two items actually increasing over the second half of the year once we've supported the orders that have been put in place. Again, as we normalize post-crisis, it's more difficult, but don't forget and listen to Thierry's words. And we're very focused within that program for all regions improving health and quality of sale, and you will see that coming back as increased transacting prices, net transaction prices. Those transacting prices, like-for-like on exchange rates, of course, will continue to be strong, if not improving going forward. Nishant, I think the way I would like to look at it is this is the plan and aspiration we're after. And particularly with rising fuel prices and charging infrastructure starting to come together, the barriers also falling. And therefore, we believe the customer needs to be given choice. And we're just quantifying it, so that we're able to put some meat to the bone that we have. So, the 10 new launches is definitely built as a part of the plan by 2025, reasonably well spread out. And we wouldn't want to put out any specific target segments other than saying wherever the customer is going, that is where we want to be. Otherwise, we wouldn't be an OEM to begin with. And obviously, the back end isn't yet fully integrated to ensure that . At this point in time, this is what we'll be able to share. And rest assured that as and when we get closer to it, more and more color would be provided as we normally do. I think the point to be made is that, at this point in time, out of the ₹18,000 crores outflow that we saw, more than ₹16,500 crores is just working capital. And therefore, at this point in time, wouldn't want to comment where the year-end debt would be. We have made it very clear that as far as Tata Motors is concerned, we will be cash positive in the year, free cash flow positive. And JLR on a full-year basis, work is still underway to actually figure out where exactly we would land. And we have clarified – Adrian has said it many times today, saying that we see improvement in second half. How big, how far, how much revenue, how much profitability, all that depends on how far the recovery on the semiconductor side comes through. So, wouldn't want to hazard a guess on where we would land up on a full-year basis. But do keep in mind that the deterioration of this quarter, most of it is working capital and we will obviously see a significant unwind of the working capital when volumes start picking up. Therefore, I must admit that I didn't understand your question too much. Adrian, unless you can figure out what he's trying to say. If I may, Balaji, I think the question has misunderstood the outlook slide because the 6% – I think this is where I did drop off. So, the two numbers both relate to last year. Binay, I hope that's clear for you. If I take you to the first piece of your question, if we have a profile in Q3 similar to Q1, I think it's reasonable to assume it won't be a compliant profile. So, we would need to increase volumes above that quarter 1 level, in my view, for us to actually see the full power for that compliant portfolio. So, we would need to get closer to a normal level of supply, if not to the supply we could – the demand we have for us to be compliant in any given quarter. I do not expect this to be compliant in Q2 with that 65,000-unit volume number we've indicated. CJLR, I think it's reasonable to assume the pattern is the same, i.e., they will be impacted by semiconductor shortages similar to ourselves for the foreseeable future. And I did mention on one of the previous questions, we are absolutely working on reducing our breakeven point at CJLR. And of course, that will be twofold, health of sale, quality of sale, reduction to incentives given, i.e. VME, but also structural cost reductions as well. They obviously have a much lower cost base than here, and therefore, the absolute numbers will be nowhere near as big as the reductions we've made in the core business, but I do expect breakeven to reduce below 70,000 units for those two reasons, yes. As I mentioned, we have taken a price increase beginning of January and then again in April. So, generally, when we take these price increases, these price increases get accepted as we go ahead in the quarter. So by middle of the quarter or second month, I think, generally, these price increases get accepted. So, I would say in terms of realizations, toward the end of the quarter we are back to the levels that we were in the previous quarter. And similarly, Shailesh, for you in PV and Adrian for you in JLR. On CV, we don't want to keep – there is no need to keep inventory of finished vehicles. As I mentioned in my presentation, we are keeping strategic inventory of either semiconductor or semiconductor parts at part level. Balaji, back to you. Given that we are always operating at the peak capacity of certain items, in the low industry volume months, we are keeping some finished good inventory also because of the uncertainties that we see on the supply side, given different kind of disruptions that we have been facing, but this is limited to just 10% or so of monthly volume is what I would say. Back to you, Balaji. We actually had just over 7,000 cars in what we would call work in progress or, in your words, retrofit. Normally, at this time of year, we would expect less than 3,000 units. So, we almost trebled the inventory at the end of June, exactly to do what you're suggesting here. What I don't know is where we will end the quarter because, obviously, we'll make our decisions around September, what we retrofit build versus what we don't build as we go through the next three to four weeks post our shutdown period. So, that's something you already covered, Adrian. We've got another three minutes, so I'll take the next question. Two questions, particularly with respect – something we haven't covered, so I just want to take that first. Nitij, I think we've always maintained to look at ETR on a full-year basis. We think that contributed to the deferred tax asset that's not being recognized, one being the continued losses, the loss for the quarter could not be recognized. Therefore, there again, we couldn't recognize the tax loss there . Thirdly, both on pension asset as well as on hedging reserves, which go through OCI, as well as OCI has to be restated because the tax rates have gone up from 19% to 25%, we should rightly be recognizing a DTA for that, which given the current tax loss position, we have not. And these obviously mean that as and when the business becomes profitable, you are getting back into recognizing . Just the one point, I think, Balaji. So, it's accounting regulations rather than cash payments. At the point where we become sustainably profitable, this deferred-tax asset will be created. This one, again, the JLR semiconductor issue, which you have already covered. The other is on the EV launches, what is the CapEx plan for India PV business and be subject to the JV partnership with a strategic partner. But obviously, this imperative will be implemented as part of our plan. And as the business is starting to do well and we'll be able to turn around, that also gives us more degrees of freedom. So, I think with this, we have come to the end of the session, 8 'o clock right now at my time."
}