{
    "symbol": "TTM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-31 15:18:04",
    "content": " And the two commitments we have actually called out in October EBIT positive for the second half, we said while actually we were EBIT positive in quarter three 1.4% and cash flow positive in half two, also, while we were cash flow positive in quarter three £164 million. Next slide, if you would, please. Next slide if you would please. I'm going to take you to wholesales first bottom of the page, up 8%, 69,000 units slightly ahead in the UK of previous quarter also in North America and also in Europe and China just a little bit lower in the overseas markets. Liquefaction on the far right, up to 69% of our vehicles were electrified that was up three percentage points from quarter two with 66% and significantly higher than last year. Next slide if you would please. So you can see quarter two we lost just over $300 million and in the volume and mix volumes were higher, 8% higher, £106 million pounds positive because of that a significant shift as I mentioned early in the production of the vehicles to the Range Rover family drove us significantly more value in Q3 than over Q2. Look, we're capitalizing more than £100 million less in the quarter than we were last year and that's the difference between being the high points of the cycle and the low point of the cycle as those engineers come up our MLA high platform and move on to other platforms EMA, which we've talked about, of course, apart re-imagined and Panthera or Jaguar electrification. Next slide, if you would, please. Next slide if you would please. Next slide if you would please. Next slide if you would please. You can see over the last five quarters, and 3.5% is pretty close actually because the gray line for most of those quarters were three of them anyway been below the underlying level, as we release campaign reserves for the period through quarter three through to quarter one you see all the gray lines less than that. Next slide if you would please. Next slide if you would please. That would be the full year position that would result off the back of that revenue, of course down around breakeven EBIT margin slightly shorter as I see the data today, but there's a lot of time to go investments around that £2.2 billion and negative full year cash flow, all of which will be working capital, all of which will come back to us as we build more cars. So highlights for the quarter gone by the volumes increased by around 15% over quarter two and around 19% over the last quarter and as we saw the Omicron third wave on the horizon, we also pulled back some of the production and uptake and therefore retail was marginally ahead. In terms of the points around the breakeven look, don't look at FY ‘23 as a specific actually it says FY ‘23 plus if you go back to that slide and what we're really saying once we move towards a more normal environment and when we move towards a more normal environment we won't continue out to buy us particularly run out vehicles like Range Rover. I saw that, well I think all I'll say is at lowest levels of production, and volumes, you would expect to have breakeven points to be lower for the reasons we've just articulated and explained in quarter three which is why I pulled those reasons out. If you think about this in blocks of capitalization, 30% to 40%, 40% to 50%, 50% to 60%, they're the three blocks that you should have in mind when vehicles come up to maturity will be in the 50% to 60% range when they are earlier in their stages and the 30% to 40%, you should expect the 30% to 40% range to be predominant over the next quarter to two. For the industry, this would be say 7% to 8% penetration and three to five years and CNG would definitely be a bigger portion, which is 25% because I say this is mainly going to cannibalize the petrol and to some extent diesel will come down from current industry level 18%, 20% kind of a level to 8% to 10%."
}