{
    "symbol": "MMC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 14:01:05",
    "content": " These results also came on top of 24% growth in 2021, and we delivered significant capital return to shareholders raising our dividend by 10% and completing $1.9 billion of share repurchases the largest annual amount in our history. Overall the fourth quarter saw adjusted operating income growth of 13%, and our adjusted operating margin expanded 160 basis points year-over-year. For the year, revenue in RIS was $12.6 billion and increase of 5% with underlying growth of 9%. Adjusted operating income growth for the year was impressive at 15%, our adjusted operating margin in RIS increased 130 basis points to 29.8%. For the full year revenue at Marsh was $10.5 billion, an increase of 3% or 8% on an underlying basis. For the full year Consulting revenue was $8.1 billion, an increase of 8% on an underlying basis. Adjusted operating income for the year increased 4% to $1.5 billion, while our adjusted operating margin decreased 10 basis points to 19.7%. Mercer's revenue was $1.3 billion in the quarter, up 5% on an underlying basis. Our assets under management were $345 billion at the end of the fourth quarter, up 9% sequentially, but down 17% from the fourth quarter of last year due to market declines in foreign exchange, which more than offset strong positive net flows. For the year revenue at Mercer was $5.3 billion, an increase of 6% on an underlying basis, the highest result since 2008. Oliver Wyman's revenue in the fourth quarter was $765 million, an increase of 8% on an underlying basis, a solid result considering a tough comparison to 22% growth in the fourth quarter of 2021. For the full year, Oliver Wyman's revenue was $2.8 billion, an increase of 13% on an underlying basis, building on the 21% growth in 2021. Andrew, next question please? Andrew, next question please? Andrew, next question please? We think but for that, we would have been posting underlying growth in the region of 8% for the U.S. and Canada, so very strong results there and we feel bullish that as that normalizes in the first quarter of next year, we're going to see an uptick. Andrew, next question please?"
}