{
    "symbol": "HLT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 15:29:08",
    "content": " Coupled with the resiliency of our asset-light fee-based business model, these accomplishments enabled us to deliver EBITDA 10% higher than the second quarter of 2019, with margins of nearly 70%, up more than 800 basis points above 2019 levels. Business transient demand continued to improve throughout the quarter, driving weekday occupancy up 6 points from April to June, weekday RevPAR was 95% of 2019 levels, with ADR exceeding prior peaks. We see as Kevin and I both said in our prepared comments, continued strength in leisure, we expect to see that continue into the fall and higher rates than normal, I mean, lower rates than summer, like always, but higher rates than you would have typically seen pre-COVID, just because of increased leisure business, business transient continues to recover, led by recovery in the big corporates, which are not back to where they are, but they are back to sort of 80% of where they were. I mean, in the second half of the year, based on the trends we have been seeing, our expectation is business transient is going to be sort of on a revenue basis equal to 2019 levels. So everything we are seeing sort of real-time, everything we have in terms of sightlines into the future, all feel pretty good, recognizing itâ\u0080\u0099s â\u0080\u0093 there is a lot of macro uncertainty and recognizing that our booking windows and sightlines are not that far out, I think what is causing it like sort of as you see other industries sort of being impacted everyday, including today is a big reporting day, again, I think a lot of what you see coming, sort of going the wrong way are industries that were at crazy peaks, because they were huge beneficiaries, many of them of COVID and the pandemic, we were obviously not a big beneficiary. I mean just like in Q2, by way of example, if you look at the segments compared to 2019, 55% â\u0080\u0093 in 2019, 55% of our overall system revenue came from business transient, 25% from leisure transient and 20% from group."
}