{
    "symbol": "MBT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 13:24:07",
    "content": " For those, who do not know me, I am Polina Ugryumova, Iâ\u0080\u0099m Director of Investor Relations here at MTS. And today, MTS is happy to disclose its Operational and Financial Results for Q2 2022. MTS is one of the few original companies, who keep telling about their financial results, and we are almost the only company â\u0080\u0093 have decided to resume its outreach to the market after a certain break. For me, this speaks for the fact that, rates that we maintain top-notch transparency corporate governance and openness, everything our investors long as for. Today, to remind you the management of the company may make certain forward-looking statements. And in our today's materials and on our website, it is stated that actual situation may differ from the one implied such forward-looking statements, because of external influence. Today, we have a wide audience, Russian institutional investors, international investors, today for the first time we have Russian retail investors, welcome. And also on our call, we have a journalist from leading mass media. During the presentation, after the presentation, you're welcome to ask your questions in the chat that you can see on your screens. Myself and my colleague,  Director, who's recently joined our team. Vyacheslav Nikolaev, our CEO; and Andrey Kamensky, our CFO. Also on the call, we have Alexey Barsegian, VP for Corporate & Legal Affairs, who will probably join us on the Q&A session, if need be in case we require some legal support, so to speak. Now I'm happy to hand it over to Vyacheslav Nikolaev, our President of MTS. I'm really happy to welcome you, indeed, Q2 has been a challenge in Russia's economy and due to this fact quite a few companies stopped disclosing their results. Polina is totally right, saying that, we believe that we must not depart from standards of corporate governance and transparency that have been established in our company for a long time. We've decided to also address some technical questions in particular, related to the situation with the termination of MTS ADR program, and we'll focus on it as much as we can. Now Q2, I believe Q2 maybe called for any company, maybe called, maybe referred to as a resilience test in the period of adapting to the new market environment. And I can tell you that MTS has accomplished this test, pretty successfully. The most affected to some extent are Retail and Fintech domains of our business, Fintech, including our MTS Bank. In retail, obvious, come in -- we just had supply disruptions hence price hikes. However, running a bit ahead, I would like to say that this has not all led to a reduction of our real free cash flow. It's obvious that when the key rate hiked to 20% the lending market, new-loan origination markets virtually reduced to nil, on the one hand. So technically, this reduced net income of the bank in our group and also it affected OIBDA and net income of the group as a whole. However, this has not had an impact on our free cash flow because this was driven by additional provision, and we are pretty optimistic about the outlook of the situation going forward. So telecom is capable of keeping, delivering its humanitarian function so to speak because telecom is different from quite a few processes meaning that telecom connects people, which is especially important amidst economic crisis. In March, when we had an opportunity, we made massive procurement -- hardware procurement, especially and in terms of hardware, we addressed our needs for at least a year ahead, and we keep swap and equipment in the regions and our do list. On the one hand, improving quality in the regions and on the other hand, releasing older equipment that we can redirect to other regions, which also helps us, you know, which helps us -- which makes us more optimistic about Telecom's future, Now to remind you, at the beginning of the COVID pandemic a couple of years ago, traffic skyrocketed and redistributed a lot. And in 2020 and 2021, we made a massive upgrade of our network. But now we are even better prepared thanks to that massive upgrade exercise so now this makes us even more confident of the future because now in spring 2022, traffic reduced a bit, unlike at the beginning of the pandemic. And now traffic has started getting back to normal, but the overall activity has shown a certain decline, and this is something that can be seen in example of a few telecom metrics, I will mention a little bit later today. Now, we are not making any detailed guidance to tie on possible results of the company this year. But in terms of CapEx, I can tell you upfront that we promised to the market that 2021 would be a peak year, and now we can see that in 2022, MTS CapEx will be lower than it was last year in 2021, so we live up to our promise. Also, let me emphasize on the additional role of rules and regulations amidst the current environment and the government and the site open as a lot, for example, the transferred for next year, our commitment on LTE coverage of federal highways, which helped us streamline our CapEx, but if you believe this year, we are working to fix some technical issues now. I'm sure you can see at the relevant part of the presentation, let me give -- tell you my story. Now, connectivity revenue was up 4.2% and this is indeed great. This is great news, because according to our market research, we can see that -- in the market, we can see some reductions in volume terms, I mean, in the number of customers making actual calls. So on the volume terms, there is a certain decline in the market. And competitively, MTS has proven to be more resilient than the others. And this has certainly been supported by the indexation exercise we did earlier in the year, and also we have proven to be resilient in terms of the number of subscribes, number of customers. The MTS market as service has post an double-digit growth rate in cloud services, but also follow on showcase double-digit growth. Telecom is showing its traditional top-notch resilience among the other business domains, especially amidst challenging environment. And this reporting period, we've had a few M&As, let me tell you about a couple of them. This is a well-established company in this marketplace, the sales in private real estate securities shares, but also this has been developing and growing actively in smart home solutions. And we believe the competencies and the assets that we've acquired may form great synergies with some established assets and competencies that MTS has already had under its belt, including IoT, video analytics and cloud solutions. So we have decided to focus our smart home developments on Gulfstream that we've recently acquired and hopefully, you'll soon see a new product in the market that the company is currently working to develop. Also, we have acquired the company called Webinar dealing in video conferences and understand as we speak, we are actually delivering our talk on Webinars solutions. And this may form quite a good replacement, quite a few services established in the market because a few solutions have started to share in suboptimal reliability. Let me tell you that, what you currently see on the screen does prove that our ecosystem strategy is highly relevant. First, double-digit growth rates in the number of ecosystem customers taken alone, this maybe not that impressive, unless you check out the CLV chart metric. This is a pretty precise -- a metric, a pretty precisely estimated metric. This is why, this great performance in telecom because with ecosystem customers, the churn rate is way lower than with customers using just one service. This recent quarter, we've seen business of -- great development of our businesses beyond telecom because before telecom used to be the core, which are source of ecosystem customers, who originally -- originating from telecom and then we're adding their second and third products. This was predictable and natural, but now, we are starting getting ecosystem customers from other verticals of our business. First of all, this is the case with our media vertical and with our banking business. Please check out the numbers, great growth rates. KION is posting really great results in terms of the number of users, the hours viewed and in other metrics, the streaming service, that look great. Apart from that, I would like to say that it's especially important that our original content is rated really well. However, this has not had an impact on OIBDA. By the way, in the first half year, we already achieved our standalone OIBDA breakeven run rate, including leases, and our initial plan was to achieve this target towards the year-end. So to sum it up, here we put our habitual title, steady evolution of revenue. This is not that stable, because our habitual growth plays is set at high. But here you can see that the most negative impact on our revenue has come from retail, but this has not reduced our real free cash flow, which makes us pretty calm, looking at the numbers, and we believe pretty soon things will get to normal and will get back to metrics, which are more habitual to us. The same can be said about OIBDA and net income, the core interim pressure on OIBDA has been exerted by FinTech, as you can see from the middle of this chart and Iâ\u0080\u0099ve already said that this has been driven by a non-cash item, which is additional provisioning, which we have to have due to a key rate hike, and this will make sure we get back to normal going forward. I'm done here, and now I'm happy to hand it over to our CFO, Andrey Kamensky. Slava has mentioned quite if you keep metrics of our company revenue and OIBDA, let me summarize it. This peaked in Q2, as you can see on the chart, so the provisions that were accrued. On the other hand, a result of a solid large loan portfolio accumulated with the bank and the loan portfolio itself practically did not grow in the first half year, and this is indeed another reflection of the overall situation in the country. Now, looking a bit ahead, I mean July and August, the situation is more optimistic. As you may know, the recent guidance by Central Bank implied greater optimism in terms of demand recovery for loans, for credit. The peak of key rate that we saw in Q1 or in the first half year affected as pretty significantly, just like every company in the market. Talking about net income, this has been one of the drivers why net income reduced year-on-year. This has been spearheaded by high interest expense, and by higher key rates. Even in Q2, you can see that the situation starts stabilizing. Rates were lower than Q1, but these rates at the end of the quarter. During the quarter, they were certainly higher. Where we could, we did use this instrument. Talking about our investments, our CapEx. Here, we've shown the trend for the recent three years. We actually addressed our equipment needs for year ahead, so we are just come and act continuing our construction of the network. You can see that it got reduced RUB 20 billion, the key drivers of increased interest expenses, higher CapEx. However, talking about CapEx, we already mentioned that 2021 was a peak year and for this year, we have planned smaller amounts, and we can now reiterate our expectation, our guidance that the 2022 CapEx will be lower than in 2021. Also, Slava has mentioned about M&I. These Gulfstream and VisionLabs, also, our free cash flow has been impacted by our imports reduced, payment conditions, settlement conditions changed. Now, dividend, in June, our shareholders have approved a dividend payout at the tune of RUB 33.85 per share. In fact, the payout amount equaled RUB 48.2 billion, including quasi-treasury shares, and this was completed in mid-August. At the beginning of the year, however, due to the current environment, we have postponed the approval of a new dividend policy. Now, a separate talk on our ADR program. Our initial idea was to focus separately on the ADR matter, because this is a hot topic these days. So we just wanted to share more information with you in case there are questions, we'll be happy to address them. You know that The Delisting Law came into effect, so we relevantly applied with the governmental commission and the ADR program -- the governmental commission decided to maintain our ADR program until July. In the -- since that time, the termination of ADR program started. The deadline is the 12th of January, which is the last time for the conversion of MTS ADRs into the underlying ordinary shares, subject to the standard Deposit Agreement. Within this period of time, MTS received a delisting notice from NYSE. Also, in August, we notified the depository about automatic conversion of ADRs capped with Russian depositories. According to our estimates, the date when the automatic conversion must end is the 5th of September. So the 11th of October is the deadline, the last day for requested submission for force conversion, there were differences between the first conversion and automatic conversion and this difference is actually commented upon on the next slide. So three branches, three cases or scenarios depending on where ADRs may be held in different scenarios, different processes. The first case where ADRs are held with a Russian broker in Russia and the chain of custody, the chain of holders include the National Settlement Depository. In this case, automatic conversion applies, which has been already triggered by the current regulation. And this is exactly what I've mentioned on the 16th of the August, we've notified our depository bank of automatic conversion. We, as the issuer, have initiated that. So automatic conversion has been launched already, but this is only the case where the ADRs held in Russia and a Russian broker. The case number two, where ADRs are held internationally, abroad. In here, there are two subcases. Subcase number one, where blocking measures apply to a willing participant of the chain of custody. This triggers force conversion, not automatic conversion difference is the following. For automatic conversion is enough to -- but to have initiation from us is the issue whereas for forced conversion, the confirmation from the hold is needed. First, they have got to confirm that they held the ADRs is at a certain date also a notice is necessary from a depository bank, JPMorgan Bank. So this is the Forced conversion case, which preciposes active actions on the part of the ADR holder, unlike in case 1. Now stop case number two, unless there are block on restricted measures, in this case, the standard conversion process applies. First, type C accounts, the nonresidents of the Russian Federation when converting the ADRs receive their shares in a type C depot account. Now sales limit post conversion, shares resulting from conversion of ADRs acquired after the 27th of April 2020 are subject to a sale restrictions. And just in terms of payment dividends, well, here, I must say that starting July 13, until the conversion of ADRs, no dividends will be paid on the ADRs to their holders, post conversion, the shareholders will have the right to claim unpaid dividends within three years from the date of dividend payout decision. Andrey, thank you, Slava. This ends our presentation, and we are start our Q&A session now. We have investors, analysts and journalists. We already see quite a few questions in the chart, and we'll articulate the questions. I mean myself and , we'll do that in Russian with simultaneous interpretation. Slava, the question from Interfax, Anastasia Buchavesky . I mean, MTS shares are one of the most exciting, most attractive shares in the Russian market, and you can see it by the share price evolution as well. We -- by the way, have quite a few business lines, business domains. We'll be able to gain a foothold on new venues separately, independently. Well, let me be brief. First, the establishment of the very company. Now a while ago, we realized that development â\u0080\u0093 so many businesses with an monoliner, within one the same MTS company becomes inefficient at a point, so this is part of our strategy. We are migrating to a holding structure so to speak, rather not a financial holding company, but a customer-centric holding company. So we are developing several our businesses in separate companies, where local management is incentivized for the performance, which have been goals and objectives of companies and then the management is incentivized for taking those companies public through auction and so on. Cybersecurity is a very exciting fair, which is in my opinion undervalued in the Russian market, especially on the one hand. And on the other hand, this is really close to our capabilities to our competencies that have already been established with our company. This is pretty much like banking sector and you know, quite a few banks who also established their own cybersecurity arms. Now, talking about investments, I will not give you a number to die, but this is a pretty serious stake. So, investments will come and we expect the investment to pay off quite soon because this is new economics, not old economics. Another question from Interfax. However, there is a counter trend, so to speak. So, if an exciting offer comes which is beneficial to MTS, we'll continue this movement. As we speak, we are not working on a sale. So, we are taken required corporate actions and we'll be happy to resume negotiations. Well, let me answer that. As I said, this is a regulatorily driven measure. This situation cannot be flat across the board, but the NPL that we've seen recently in July and August are really minor, so the additional provisions established do not reflect the minor NPL numbers that we've seen. Before we used to split the dividend payout, but now amidst this uncertainty, we decided to make a one-off dividend payments -- the onetime payments. So this year, we are not going to pay any more dividend. So we cannot disclose any parameters, but let me put it the following way. So in the future, we -- I hope we'll not make anyone unhappy. Now talking about total cash distribution to shareholders, these have been reduced in 2020 100 even then 2022, it's 66, and we effectively paid out a bit less. Our dividend policy used to precipose a certain dividend payout, as a minimum level, a certain number of rubles per share. For example, in 2021, there was a payout related to the Ukraine sale. So this year, we're only talking about dividend payout. Another question from Interfax. In Sprint, the Board of Directors has approved a new MTS strategy for 2022 and 2020. Well, Interfax must have an exclusive access to . Well, that's a good question for half an hour talk, but let me cut this long story short. In general, our overall strategy has not changed and we mentioned this in our previous occasions. And regardless of the current challenges, we believe these companies will answer within market on their own independently. And in this new strategy, we emphasized the importance of IT transformation, which is continuing in the company, and this is a facilitator of turning the solid company of MTS in a holding company united around an ecosystem or united by a customer-focused policy, which makes us optimistic about the future of our telecom backbone and of our other businesses. I'm not sure that it's huge, but anyway, that's negative under the IFRS. Now, in terms of dividend, the key driver is the net income that we generate, yet and that the evolution that we have mentioned, there is a quarterly evolution, quarterly trend, and we feel pretty well in terms of net income and free cash flow. Talking about equity, this is a function of the buyback that we've been doing over the recent three to four years. And in terms of financial statements, this does affect equity, but this is not an issue. This is one of the reasons that we articulated before why we could not and would not like to redeem treasury shares because under the Russian legislation, this would restrict us in dividend payouts even regardless of the high free cash flow generated. Could you please tell me what's the driver of cost growth in Q1 and Q2 this year, in absolute numbers were RUB5.9 billion I mean this is the operating income. In OIBDA and operating income, this is mostly the reflection of the provisions established at MTS Bank, and the key growth is quarter-on-quarter. But year-on-year, there are no sharp moves. The SIM-card distribution retail chains have always been large, especially with the case of Russia, a lot of SIM-cards were sold not all of them live for long, it could be referred as a washing machine and that's constantly spins that does not add great value. So now, that the cost of SIM-cards with some operators has grown exponentially. So in terms of SIM-card sales, it seems to me that the volume of sales may not be reduced, but it's time to reduce it. What's more, with MTS, we have benefits from ecosystem effects to reduce churn rates. And so the reduction of brick-and-mortar stores, greater migration ties towards online lower SIM-card sales it will help us to reduce our own points-of-sale in telecom. I'm not saying that, one must deviate from retail. It depends on a specific company, strategies may differ. But in terms of telecom, I think this is a very relevant question. I hope our market peers will not lag behind, because this is indeed became increasingly expensive, costly and not that efficient. Well, I cannot give you the details off the top of my head. Procurement is underway, vendor policies for Russia deferred. On the other hand, we now see increase in numbers and some ranges of smartphones especially from new brands that used to be not that popular in Russia but that I get an increase and the popular. And this is high-time to update this sales mix, because people usually change brands very carefully. Now, next question is for Andrey, from Russian and International Investors. The Eurobond coupon situation, we've settled our coupon payment obligations on-time, in due time as per the requirements that apply. In fact, we transferred the money to the payment agent. The money was accrued on the payment agentâ\u0080\u0099s account, but due to the current situation the money did not follow through. The situation is really challenging, and this is not just the case with us. Talking about the next payment, coupon payment that is scheduled in November. But again, let me repeat the situation with us is actually pretty much the same as with all the other Russian issuers. Companies chose a specific way, but for now, we do not know about any 100% successful cases. There are some technical swap cases, but for now the situation is what I've said, November will come pretty soon. Well, quite a while ago, we already established the best analytics system, not just in Russia, but also internationally, which helps us know where the next base station must be put across Russia, and the same is the case with upgrades. So this is not a matter of specific regions, we are running our swap program where equipment from one vendor is swapped -- equipment from another vendor, because the former equipment is audited, and this is beneficial for us to install the latter equipment, and the equipment -- the older equipment released will be redirect to another region where it's needed. And I think, we have already experienced this good increases in quality archive  Full HD movers can be viewed across most commercial. We are now active, making quite a few developments across a variety of IT streams. And it seems to me that an app store may be quite an exciting ed ition, quite an exciting opportunity, especially if this is merged with payment, agent capabilities. So the plans are relevant, and these are quite quick so to speak, and the results will come soon. I cannot give you the details off the top of my head, but these do not sum, these do not add up. And first, this is a few billion, not tens of billions. And the government has acted as a facilitator in this process, saying to operators that guys, it's more beneficial. It's more efficient for you to address it collectively together as soon as the program is finalized, we'll know the ultimate number, but this will not make us exceed our CapEx plan. They now form our obligation, our liability. This has stayed in our books, but this is recognized as a liability. So, when our ADRs are converted into ordinary shares, the holders will have the right to claim the unpaid dividend within three years, and we will be transferring the unpaid portion. Obviously, this invest holds our ADRs through international structure. I'm not sure if you see this relevant slide of the presentation, but type C accounts are subject to a few restrictions. But again, this happens post conversion. So when you have converted ADRs in ordinary shares, you start getting dividends for ordinary shares. I mean, in case there are specific washers, we'll be happy to address them, but currently, there is quite a big regulatory base that describes in detail how type C accounts works. A question from Forbes, how has the current situation impacted MTS Startup Hub, will continue your venture investments, or will you invest at later stages searching for greater reliability. People are active, people work, and we will continue working in this direction. And also, I've said that recently, we've seen our IT domain activated. Well, I just cannot see questions that we have not addressed. There are a few really technical questions related to ADR conversion, in particular, from international investors. By the way, some questions will be posted in a Q&A session. Yeah, by the way we have already posted the first portion of how to instructions to have ADR unpacked. What you did to have your ADRs unpacked, if you're a non-resident. We will update the post to the effect of the recent regulatory changes and will post also information on automatic and forced conversion with voice, e-mailer at ir@mts.ru, and we'll take you through the difficult mechanics of the processes."
}