{
    "symbol": "MU",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-29 19:50:06",
    "content": " In fiscal Q4, our automotive business delivered another record revenue quarter and fiscal 2022 auto revenues grew 30% year-over-year, setting a new all-time high. We made significant reductions to CapEx and now expect fiscal 2023 CapEx to be around $8 billion, down more than 30% year-over-year. Fiscal Q4 capped off a strong fiscal year in which we set a record for total revenue, generated substantial free cash flow and returned $2.9 billion to shareholders. Total fiscal Q4 revenue was $6.6 billion, down 23% sequentially and down 20% year-over-year. Fiscal 2022 total revenue was a record at $30.8 billion, up 11% year-over-year. For the fiscal year, DRAM revenue increased 12% year-over-year to $22.4 billion, representing 73% of total fiscal year revenue. Fiscal Q4 NAND revenue was $1.7 billion, representing 25% of Micron's total revenue. For the fiscal year, NAND revenue increased 11% year-over-year to a record $7.8 billion, representing 25% of total fiscal year revenue. Turning to our fiscal Q4 revenue trends by business unit, revenue for the Compute and Networking Business Unit was $2.9 billion, down 25% sequentially and down 23% year-over-year. Fiscal Q4 operating income was $1.7 billion, resulting in an operating margin of 25%, down approximately 11 percentage points sequentially and down 12 points from the prior year. Fiscal 2022, operating income was $10.3 billion, resulting in an operating margin of 33.4%, up approximately 6 percentage points from the prior year. For the fiscal year, we generated $15.2 billion of cash from operations, representing 49% of revenue. As Sanjay mentioned, we expect our fiscal 2023 capital spending to be around $8 billion, down more than 30% year-over-year, driven by a near 50% decline in wafer fab equipment CapEx. Beyond fiscal 2023, a year starting out with a challenging set of external events, we are confident in our ability to deliver financial performance consistent with our long-term cross cycle financial model, including revenue growth of high-single digits, operating margins of 30% and free cash flow margin of over 10%. So I think what's important is that the supply growth will be less, while the demand growth once inventory adjustments at customers have normalized or have substantially improved by our second fiscal second half, then demand will go up from customers and we expect that the DRAM demand will be in mid-teens supported by inventory, but the supply growth will be meaningfully less than demand growth and that's what will brings an improving trajectory  of industry supply-demand balance in improving fundamentals for our business as we go through calendar year '23."
}