{
    "symbol": "MU",
    "quarter": 1,
    "year": 2022,
    "date": "2021-12-20 20:17:08",
    "content": " The secular demand for memory and storage, along with Micron's focus on building our technology and product leadership and deepening our customer relationships, continues to strongly position us to create significant shareholder value in fiscal year '22 and beyond. While PC end demand remains strong, our clients revenue declined sequentially due to the PC production impact from ongoing non-memory component shortages and related customer inventory adjustments of DRAM and NAND products. We expect calendar 2022 industry bit demand growth to be in the mid to high teens for DRAM and approximately 30% for NAND, in line with our view of the long-term bit demand growth CAGRs for each. The stronger second half bit shipments will be aided by the easing impact of non-memory component shortages on our supply and on customer demand, together with additional product qualifications of our 1-alpha DRAM and 176-layer NAND-based products. You may proceed with your question. So overall, we believe we are well positioned to deliver a strong second half based on all the demand aspects as well as supply aspects that I just described here as well as a strong profitability for record fiscal year '22 revenue and robust profitability. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. I would just reiterate Sanjay's comments that we see a healthy supply/demand dynamic for the fiscal year for both DRAM and NAND, and we continue to ramp 176-layer and 1-alpha, which gives us a good cost structure going forward. You may proceed with your question. You may proceed with your question. We expect the -- overall, if you look at DRAM content CAGR in the automotive market, that's approximately 40% over the course of next three years, NAND CAGR in the automotive power kit, above 50% as well over the course of next three years. You may proceed with your question."
}