{
    "symbol": "NBN",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-01 21:36:03",
    "content": " For the quarter, net income was $8.3 million; EPS was $1.12 diluted; ROE was 13.07%; ROA was 2.03%; Tangible book value was $33.57; and during the quarter we repurchased 108,000 shares at an average price of $37.88. So the linked quarter was -- the current quarter was $8.3 million, which is down $2 million from the linked quarter, meaning June 30, which has net income of $10.3 million. First, we had record originations of $181.7 million with a yield of 7.85% on our originated loan portfolio, represented national loan portfolio, which benefited from both increases in the prime rate and increased interest in fees collected upon payoff of some lows. And if we go back and look at the average for the prior 14 quarters, it was about 8%, so we had substantially less payoffs, which generated as I've explained less transactional income, but our loan book is growing because those loans weren't paid up. In terms of the loan portfolio, national lending portfolio growth, if we look at the linked quarter, in our national loan portfolio, it increased $167 million or 13.5% increase from June 30, 2022. If we go back and look a year ago, loans increased international loan portfolio by $412 million or a 41.6% increase in our loan book over the last year. First, our base net interest income and by that, I mean our interest income before any -- what we call transactional income or accelerated accretion or those things was for the quarter $22.6 million compared with $20.1 million for the linked quarter. Delinquencies were $14 million or a little bit less than 1% of total loans and non-accrual loans were $13.7 million and that was 93 basis points, -- 0.93% I should say of total loans. And then finally, I think the biggest news to come out of all of this, which occurred in September, where we disclosed that in the month of October, we purchased in multiple transactions, a total of $303.6 million of UPB of loans which will increase -- obviously increase our loan book from October or the end of October, we just recently closed on it going forward, which will be a benefit in subsequent quarters. But at one point, when we went through kind of the funnel in particular quarter, not this quarter that we just -- we may wind up buying something like 15% to 20% of the stuff we look at or less, because there's a lot of loans that come over the  so to speak that we don't bid on."
}