{
    "symbol": "LAZY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 13:35:08",
    "content": " In our preliminary first quarter results, which released on April 20th of 2022, we indicated an expectation of reporting revenue of $376 million adjusted EBITDA of $44.8 million and net income of $27.5 million. Today, we're announcing revenue of $376.2 million, adjusted EBITDA of $44.8 million and net income of $28.3 million each in line with our earlier expressed expectations. Revenue for the quarter from the sale of recreational vehicles or RVs was $340.5 million, up $95.6 million or 39%. In total, revenue from these other lines of business was $35.7 million, up $9.6 million or 36.7% compared to 2021. The increase was driven by an F&I revenue increase of $7 million or 48.1% to $21.6 million, and a parts and service revenue increase of $2.4 million or 23.4%, $12.7 million. Q1 gross profit excluding non-cash, last in first out or LIFO adjustments was a $101.6 million, up $35.6 million versus 2021 gross margin excluding LIFO adjustments increased between the two periods to 27% compared to 24.4% in 2021. With the change driven by increase in the units sold and average selling price, including non-cash LIFO adjustments, which had a net unfavorable swing between periods of $0.6 million compared to prior year. Excluding transaction costs, stock-based compensation and depreciation and amortization, SG&A for the quarter was $55.9 million up $18.2 million compared to prior year. Now, turning to the March 31st balance sheet and our financial position, we had cash on hand of $89.6 million and net working capital of a $112.4 million with cash $8.6 million lower than December 31st, 2021. Cash provided by financing activities is also includes cash outflows of $19.2 million for the repurchase of 1,086,797 shares of common stock at an average price of approximately $17.64. As of March 31st, 2022, we had $284 million in inventory consisting of $217.3 million in new vehicles, $69.2 million in pre -owned vehicles, approximately $8.4 million in parts inventory, and LIFO reserves of $10.9 million. As of March 31st, 2022, we had no borrowings under our $25 million revolving credit facility, $9.4 million of term loans outstanding, and $230.9 million in gross notes payable on our Floorplan facility."
}