{
    "symbol": "UAL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 13:59:17",
    "content": "  Operator: Good morning, and welcome to United Airlines Holdingsâ\u0080\u0099 Earnings Conference Call for the Third Quarter 2022. Good morning, everyone, and welcome to Unitedâ\u0080\u0099s third quarter 2022 earnings conference call. Yesterday, we issued our earnings release, which is available on our website at ir.united.com. Information in yesterdayâ\u0080\u0099s release and the remarks made during this conference call may contain forward-looking statements, which represent the Companyâ\u0080\u0099s current expectations or beliefs concerning future events and financial performance. Please refer to our earnings release, Form 10-K and 10-Q and other reports filed with the SEC by United Airlines Holdings and United Airlines for a more thorough description of these factors. Also during the course of our call, we will discuss several non-GAAP financial measures. Joining us on the call today to discuss our results and outlook are Chief Executive Officer, Scott Kirby; President, Brett Hart; Executive Vice President and Chief Commercial Officer, Andrew Nocella; and Executive Vice President and Chief Financial Officer, Gerry Laderman. I want to start by congratulating and thanking everyone at United for your hard work, dedication and perseverance throughout the last two and a half years. Our people stayed focused on our unique long-term strategy, and weâ\u0080\u0099re now beginning to see the strong and differentiated results. In fact, based on most metrics itâ\u0080\u0099s running better than ever. We recognize that the near-term geopolitical and macroeconomic growth and overall pessimism facing the global economy, including airlines are unusually high right now. However, there are three industry tailwinds prevailing the COVID recovery for aviation and United that are currently overcoming those macro headwinds and we believe will continue to do so in 2023. Take one example, Japan just opened last week. And regardless of whether you think demand for business travel will ultimately turn to 100% or something less, it almost certainly is going higher from here. Second, there has been a permanent structural change in leisure demand, because of the flexibility that hybrid work allows. With hybrid work, every weekend could be a holiday weekend. Thatâ\u0080\u0099s why September, a normally off-peak month was a third strongest month in our history. People want to travel and have experiences, and hybrid work environment untethered them from the office and gave them the new found flexibility to travel far more often than before. And third, the strong demand environment is happening against the supply backdrop that currently has the industry 10% to 15% smaller relative GDP than it was in 2019 and the multiple constraints. Pilot shortages, aircraft delivery shortages from both Boeing and Airbus, air traffic control saturation and airport infrastructure constraints around the world are all real and they are constraints that will take years to fully resolve. These three trends are why all airline revenues keep surprising to the upside, but they are also real and durable, which is why we are so optimistic about 2023 and the longer term, despite the economic challenges. And for what itâ\u0080\u0099s worth, you need to believe all three of those trends were estimates to go up, probably any one of them would do, though I happen to be confident that all three are already happening and are sustainable. And in that strong industry environment, United is uniquely positioned to benefit for the long term. Differentiated fleet and growth decisions, increased exposure to growing international markets, real technology changes to change the customer experience and run the airline more efficiently, long-term investments in the infrastructure needed for growth such as newer gates, or building 14 additional simulator bays during the pandemic, founding our own pilot training academy and a cultural transformation to be fast, creative, innovative and customer focused. I am very proud of the United team for executing incredibly well and Iâ\u0080\u0099m confident that, we are well positioned for success next year and the years to go after that. During the quarter, our operational performance set records. Our on-time arrival and misconnection rates were the best for third quarter in company history, when excluding the low flying quarters during the pandemic. This means over 137,000 additional customers got to their destinations on time. In addition, our team did a fantastic job helping our customers and their bags get to their destination as seamlessly as possible. In fact, our mishandled bag ratio in September was better than 2019 levels. Our daily controllable cancels, which are driven by maintenance or crew challenges, dropped over 95% September versus what they were in January. With a reduction in these cancels alone, we were able to add 1% of incremental capacity to the third quarter. This provides a better experience for our customers, but also leads to much more cost-efficient flying. Putting that all together, and despite all the challenges around the industry, this was the best third quarter operationally for a full schedule in Unitedâ\u0080\u0099s post-merger history. With their grounding, weâ\u0080\u0099ve had to make suboptimal operation with schedule change adjustments that have led to a more complex operation. And the work required to return these aircraft to service, created a heavy burden on our tech-ops organization. For the first part of this year, we had over 500 of our technicians dedicated to this fleet in Victorville, California, with over 175,000 hours of work spent to get these aircraft back into service. Great news is that this work is behind us and these technicians have returned to their bases, which has led to the improvement in our performance metrics. With these aircraft fully back in service, our fleet can be more efficiently positioned for both, our operation and our customers. This year, weâ\u0080\u0099re on track to hire 7,000 airport personnel, 4,000 flight attendants, 2,300 pilots and 2,000 technicians. Ultimately, we expect to welcome 15,000 new team members this year and another 15,000 next year to support our United Next plan. September was our third best TRASM month in our history, excluding the low flying pandemic months. In many ways, September, where we operated with an 86% passenger load factor, 5 points better than September of â\u0080\u009819, was indicative of what we believe to be the new normal where hybrid work gives customers the flexibility to turn any weekend into a short trip. And we believe because of that, the off-peak periods are now stronger. First, across the Atlantic, United increased capacity by 22% versus the third quarter of 2019, adding 10 new cities and 18 new routes. We also pushed into new regions, becoming a relevant competitor to Africa for the first time. Atlantic PRASM increased 21% versus the third quarter of â\u0080\u009819, which we consider outstanding. United is now the largest airline across the Atlantic, where our strategic partnership with Lufthansa and Air Canada is working better than ever. Last week, we announced yet another Atlantic expansion plan for 2023 of nine new routes. A few weeks ago, we announced a new partnership with Emirates. This partnership will allow United to resume service to Dubai, the largest and best hub in the Middle East after a seven-year absence. Dubai is unique as a hub in the region, as it has both significant local markets and a large amount of premium demand, but also massive connectivity. While our Pacific flying is our least recovered so far from the pandemic, we continue to expand capacity as economies open. Overall capacity in the region was down 59% versus 2019, and Pacific PRASM increased 41% versus 2019, and we continue to experience much stronger cargo yields. Weâ\u0080\u0099ll be focused on resuming the bulk of our Pacific capacity, excluding China in the next year, now that Japan is fully open for business. Yields in the quarter did continue to fall, consistent with our expectations relative to pandemic highs and were 90% greater than 2019. While larger corporations clearly lagged the recovery rate, we believe new network patterns and hybrid work environments are having, positive and offsetting impacts on revenue. Our traditional view on business traffic recovery rates relative to 2019 may now be obsolete measurement, given the changes in how customers now travel in a remote work environment or business and leisure trips often are combined. Premium Plus, our new mid-tier global long haul product is now 7% of our long haul capacity, producing yields that are twice that of the main cabin. September was a strong revenue month, and we are entering the fourth quarter with a lot of momentum, and October is on track to date to quickly replace September as our third best TRASM month ever, excluding the low flying pandemic funds. In fact, we currently anticipate a similar TRASM increase in the fourth quarter as we saw in the third of between 24% and 25% on between 9% and 10% less capacity. While I recognize recent headlines would otherwise indicate our revenue performance should be faltering, I hope this strong revenue outlook puts those thoughts to rest. We expect that these recent cost changes to alter the balance of pilots, choosing a career at United Express versus a ULCC, with competitive pay United Express versus ULCC for the first time, weâ\u0080\u0099ll be better able to staff our United Express operation, albeit at higher costs. United Express pilots who joined our Aviate program can transition to a United mainline  job in four years, making it for the best short-term and long-term career option. We do expect that given the overall pilot shortage today, at non-legacy carriers, it may take a while and probably until 2026 to fully utilize in our 300 to 400 RJs weâ\u0080\u0099d like to operate by our Express partners. Mileage redemptions this quarter were the highest for any third quarter in our history and new co-brand accounts were up over 25% year-over-year, and we saw the highest quarter of spend in the history of the program in the third quarter. Momentum is strong, and we expect 2023 to set new records as we continue to grow the program. Thanks, Andrew, and a big thank you to the whole United team for achieving another quarter of profitability. As Brett mentioned, our recent operational performance has been record-setting, and we believe the worst of the operational-driven cost pressures weâ\u0080\u0099ve talked about on previous calls are now behind us. Importantly, weâ\u0080\u0099ve completed all remedial work on our 52 Pratt powered 777s and the vast majority are back in service with the last few expected to be on line by next month. On previous calls, we have noted the significant CASM-ex headwind driven by the grounded 777s, but it was more than just the capacity implications. We believe -- as we piece together a schedule with a suboptimal mix of aircraft, we also incurred a variety of direct and indirect costs in many of our operating groups as we waited for the return to service of a significant portion of our wide-body fleet. To put in context how impactful it is to have these aircraft flying again, our fleet was able to produce over 20% more ASMs for mainline aircraft per day in the third quarter compared to the first quarter. This provides a meaningful improvement in our utilization, which is one of the primary drivers of improved unit costs. We reported pretax income of $1.1 billion on an adjusted basis and an operating margin of 11.5%, also on an adjusted basis. This was 1 point better than our most recent guidance, driven by a combination of stronger revenue and better costs. As an example of how our strong operation benefits our costs, in September, we saw a 27% reduction in the premiums and overtime paid as compared to an average month in the first half of the year. As we look into the future, retaining top-tier operational performance will continue to be a key element to our execution on costs. Looking ahead, we expect fourth quarter 2022 CASM-ex to be up between 11% and 12% with capacity down 9% to 10% versus the fourth quarter of 2019. As Andrew mentioned, we expect the revenue environment to remain strong throughout the fourth quarter. As a result, we expect our fourth quarter 2022 adjusted operating margin to be about 10%, exceeding the fourth quarter of 2019 and adjusted diluted earnings per share, a metric we are happy to talk about again of $2 to $2.25. In the third quarter, we took delivery of 11 Boeing 737 MAX aircraft and 1 Boeing 787 aircraft. In the fourth quarter, we expect to take delivery of 20 MAXs and 4 787s. Assuming these aircraft are delivered, for the full year 2022, we now expect total adjusted capital expenditures to be $4.7 billion. Thereâ\u0080\u0099s certainly downside risk to that assumption but under almost any circumstance next year, we expect to take delivery of more aircraft in one year than any other airline in history. We ended the third quarter with over $20 billion of liquidity, including our undrawn revolver, which allows us to maintain flexibility as we meet the uncertainties that remain in our industry. We used some of our cash to purchase all of our aircraft delivered to date this year, and we expect to use cash, about half of the remaining deliveries in the fourth quarter. And remember that every aircraft purchased for cash today increases our pool of unencumbered assets, which further protects our future. In addition to aircraft purchases beginning in 2023, we will have the opportunity to prepay a portion of our debt at par. In the current rate environment, it is a tremendous benefit to have the flexibility to prepay debt, continue to pay cash for new aircraft or access the financing markets opportunistically for new aircraft deliveries. And at all times, we remain committed to restoring our balance sheet and working towards our long-term leverage targets. Please limit yourself to one question and if needed, one follow-up question. Brett, you brought up 137,000 of saved connections during the quarter. I think you said 1,500 a day. Mike, you have to look, itâ\u0080\u0099s a number of things. For us, itâ\u0080\u0099s much more about NPS and the overall experience. Just a quick one on capacity, maybe preliminarily for next year, Andrew. I know, Gerry, you said that January, weâ\u0080\u0099re going to get an update on kind of how youâ\u0080\u0099re thinking about 2023. But Andrew, the comment that you made that next year, it looks like youâ\u0080\u0099re preparing for all of Asia Pacific to recover or be back in the plan with the exception of China. What Iâ\u0080\u0099ll say about Asia Pacific, just to give you some color on that is, excluding China, in December this year, our schedule as published is 89% recovered. So, we are already well on our way to flying the full trans-Pac schedule, excluding China at this point as we enter into next year, early in the year. Mike, the only thing I would add is that if youâ\u0080\u0099re looking at the most optimistic side of what weâ\u0080\u0099ve said in the past, I would say thereâ\u0080\u0099s a downward bias to that. If nothing else, I mentioned 179 aircraft scheduled for delivery through the end of next year. So, if we were to cast our minds back 12 months, I think you and the rest of the industry were sort of struggling with an environment where you were seeing very peaky peaks and very troughy troughs. And I think in your commentary, you sort of indicated that whatâ\u0080\u0099s happening right now is the exact opposite where even the shoulder seasons are actually kind of picking up and kind of running it similar to almost peak like levels. Well, I think this new normal really allows us to become more and more efficient. For example, Tuesdays and Wednesdays are not as much of a trough as used to be in a traditional week. So, it doesnâ\u0080\u0099t necessarily peak as much on one or two days. And we also see like secondary holidays are incredibly strong, not just the primary holidays. And ultimately, what this could mean is that we operate a less peak schedule and a less peak schedule, we think comes with really enormous efficiency gains and that the marginal cost of an ASM in February is very different than that in July. So, a lot more to come on that subject, but I think a really interesting opportunity for United as it transitions from a very peaky schedule to something thatâ\u0080\u0099s less peaked. But look, we announced a number of new routes, I think just last week, across the Atlantic. Quite frankly, where the dollar stands is incredibly useful from a U.S. origin point of view for transatlantic travel. And we are very bullish on the outlook, not only there, but across our entire global network. Once economy is open, traffic rebounds very quickly, and we expect to see that in Japan over the coming months. And so again, weâ\u0080\u0099re bullish across the Atlantic and all but one will be coming back for next season. I mean, not to say that you guys are leaving Star or anything like that, but it was intriguing to see your new alliances with Emirates and Virgin Australia, and one of your South American partners seems to be getting involved with Abra. So just sort of on a high level, Iâ\u0080\u0099d just love to hear your thoughts about how you think about these alliances outside of your sort of traditional networks. First of all, our alliances, particularly going across the Atlantic with Lufthansa and Air Canada is, first and foremost, that is gigantic. And of course, across specific with ANA, down to the South Pacific with Air New Zealand, these are all things we focus on every day here and are key to our global network. That being said, the Middle East was, the way we use the term, a white spot for United. And when we looked at the opportunity to do a partnership with Emirates, it did fill in this white spot and allowed us to access a lot of destinations that we could not otherwise access with our existing partnerships. And now, I hope to be not only the largest airline to Australia, but the most profitable airline to Australia. And I think that comes with the strong network we have and great partnerships across the board, definitely Virgin Australia. So, weâ\u0080\u0099ll continue to look for opportunities that donâ\u0080\u0099t interfere with our core strategic immunized alliances. Quite frankly, at this point, Unitedâ\u0080\u0099s global network is pretty comprehensive. Iâ\u0080\u0099m not sure thereâ\u0080\u0099s many more of those out there in the world, but weâ\u0080\u0099ll keep looking. So, Gerry, the sequential drawdown in the air traffic liability was larger than I would have expected. It was just seasonal, as we get back to the sort of the normal booking trends that we see over time. But youâ\u0080\u0099re right, if I look at it as a percentage of trailing revenue, I suppose itâ\u0080\u0099s not that unique. So, Scott, thereâ\u0080\u0099s an airline business model that I would describe as predicated on an abundance of cheap capital and abundance of aircraft and abundance of pilots, and the pilot wage arbitrage and seating density. We feel like obviously super optimistic about where United is headed, but recognize that the market isnâ\u0080\u0099t there with this quite yet, and that was going to be restrained. Look, I think thereâ\u0080\u0099s a huge change thatâ\u0080\u0099s happened thatâ\u0080\u0099s not appreciated yet. I will perhaps be even more pejorative, I describe that business model as a Ponzi scheme, because it is predicated on growing 15% to 20% a year. The only way you keep your costs low is 15% to 20% of your growth, and that is now going to be a positive. I mean, look -- others are going to get on conference calls next week and say this is a temporary issue. But we have fewer controllers in the United States than we had 30 years ago, we have tripled the operations, but that works. In the FAA to put their fingers in the dike and try to do their best to manage day-to-day, but theyâ\u0080\u0099ve been pulled in so many directions, theyâ\u0080\u0099ve had to do drone and space launches and so many more people working on certification and aircraft issues without their budget going up. And until Congress authorizes more controllers, that is going to be a hard constraint on the operations of all airlines during the summer. And so, thereâ\u0080\u0099s just no airline, including us, thatâ\u0080\u0099s going to be able to grow at 15% to 20% a year anymore. The whole business model is predicated on three things: One, growing 15% to 20% a year; two, jamming people in like sardines; and three, itâ\u0080\u0099s not nickel and dime them, $50 and $100 in them to death with add-on fees as they donâ\u0080\u0099t know until they show up at the airport. Iâ\u0080\u0099m wondering what the better Q3, Q4 CASM means for next year. But what I can tell you right now, as I think I said in my prepared remarks, these numbers just increase the confidence we have in hitting our numbers for next year. So, I think thatâ\u0080\u0099s the way to look at it. And the fact that we are confident in our ability to hit our pretax margin target, I think, says a lot. And then, just on this idea of like the new normal. So, if youâ\u0080\u0099re right that thereâ\u0080\u0099s more leisure demand and better off-peak performance, but perhaps maybe thereâ\u0080\u0099s less business travel. Well, I think so far, and you can see by our results over the last 90 days and our outlook for the next 90 days, we think itâ\u0080\u0099s a pretty good trend. So obviously, I would say that itâ\u0080\u0099s positive for margin. So, Iâ\u0080\u0099m optimistic that all of those like headwinds that United Airlines faced in the pandemic are still in the transition period to tailwinds, and particularly the coastal gateway impact. I think we still have a long way to go, particularly on domestic traffic from our coastal gateway. On corporate recovery, can you offer some thoughts on recovery by market or hub in the U.S.? And Andrew or Scott, Iâ\u0080\u0099d just be really curious, as you look into the future, I would really appreciate your thoughts on kind of the Bay Area and how travel patterns may have changed there and kind of the upside you see into next year. And the ones that are the biggest to United Airlines are, in fact, the ones that trail the most. And yes, our results, I think, are leading the industry. So, I think, weâ\u0080\u0099ve quickly and affirmatively adapted to this new environment. That being said, I still think those are going to recover. And in particular, Iâ\u0080\u0099m convinced theyâ\u0080\u0099re going to recover on global long haul at a faster pace than the recovery on global -- on short haul -- domestic. And I will say even in the last few weeks, while it hasnâ\u0080\u0099t been a radical change, there is a positive flow to the recovery rate that was, I think, really nice to see. So from that perspective, I will say that business traffic in these key coastal gateways in New York and San Francisco still trail that of the interior hubs on average. And thatâ\u0080\u0099s why, as we go forward, as those tailwinds get stronger -- and we do believe weâ\u0080\u0099ll get stronger, I think that uniquely benefits United given where we are -- given what weâ\u0080\u0099re doing fine today with these new dynamics, I think weâ\u0080\u0099ll just do better in the future. So, itâ\u0080\u0099s too early to tell you our entire plan for the mix of financing or paying for cash for next yearâ\u0080\u0099s aircraft. Yes, thereâ\u0080\u0099s no question weâ\u0080\u0099re in a higher interest rate environment. But keep in mind, the financing portion of ownership cost for a new aircraft is such a small fraction of the overall cost of that aircraft, and the benefit so overwhelms that, even in the current interest rate environment, it really doesnâ\u0080\u0099t have a dramatic impact on us. Sure, I love doing EETCs  at 3% but EETC is at 6% or a little bit higher, thatâ\u0080\u0099s what we used to do 7, 8 years ago. So, thereâ\u0080\u0099s nothing new here. Just on the business travel recovery, you talked a little bit about it. And then, can you just speak to just -- the international volume side, that sounds great, but I think thereâ\u0080\u0099s still some work to do on the yield side. We -- when we did the forecast, itâ\u0080\u0099s pretty much flat. So, weâ\u0080\u0099re not expecting a significant recovery on the traditional way we measured it. Iâ\u0080\u0099m not sure thatâ\u0080\u0099s the right way to measure it anymore, to be clear. On cabin, I think your perspective is somewhat correct there. Weâ\u0080\u0099ve also seen really good strength in the Polaris cabin but not as good, I have to say, as the back of the airplane. And so as that business continues to come back, we will hopefully likely see, I think, further strength in the front section of the aircraft. Again, the numbers are pretty downright strong from a load factor point of view. So, as that returns to normal, however fast or slow that occurs, that will continue to provide, I think, more of a tailwind going forward. And then, just to piggyback on Scottâ\u0080\u0099s question earlier, just the -- bending the cost curve, all that stuff, weâ\u0080\u0099re turning in the right direction, it seems. And just from a high level, I know thereâ\u0080\u0099s a lot of unknowns on the capacity side. But, when I think about the buckets of the headwinds and tailwinds as we go into â\u0080\u009823, less disruption costs, less 777 maintenance, but pay is obviously trending higher regional expense. I think weâ\u0080\u0099re pretty comfortable that we have a good handle on that, and thatâ\u0080\u0099s been incorporated into our thinking all year. We have the tailwinds from the return of the 777s, the tailwinds from this record-setting operation that we have going on. So Andrew, I wanted to follow up on that point you made about running a less peaky schedule. If I look back sort of historically or think back historically, anyway, first and fourth quarter load factors \n Mr. Bernstein, weâ\u0080\u0099re losing your connection. So I guess, Andrew, Iâ\u0080\u0099m trying to dig into this idea of running less peaky operation. Iâ\u0080\u0099m wondering if the quarterly drop-offs from sort of 3Q to 4Q, 1Q, if that should be a little bit more moderate kind of coming out of the pandemic because of some of the changes youâ\u0080\u0099re making in terms of scheduling the airline and just building to the new normal. In fact, one of the good examples will be our European schedule, for this winter, we would use to cut off Tuesday or Wednesday a non-peak day on many of our transatlantic flights from New York. And this winter, if you look at them, I think a higher percentage of them operate daily throughout the entire week. So after Thanksgiving, but before Christmas, weâ\u0080\u0099re already booked 2, 2.3 points ahead of where we expected to be and versus â\u0080\u009819. And to the extent we can run an operation that has fewer peaks in it, particularly having the summer peak, not be so much higher than the rest of the year, that creates a dramatic amount of efficiency because when you think about it, we staff our pilot workforce for the flying that we do in -- from June 15th to like August 15th. But Iâ\u0080\u0099m just trying to think like is there any wayâ\u0080¦\n Well, you have to separate it domestically versus internationally. On the international front, we have almost all of our aircraft that have gone through the Polaris mod. I think weâ\u0080\u0099re down to one or two 787s that need to be done, and the bulk of our 767 400s. Versus â\u0080\u009819, we also have the Premium Plus cabin, which was -- just had been started, but was not significant. And today, I think itâ\u0080\u0099s about 7% of our long-haul ASMs. And as you can already see from our per seat sales, which I think were up about 20% in the quarter. As we replace single class RJs with those jets, I think thereâ\u0080\u0099s a lot more of that ancillary revenue to come. So, I think domestically, thereâ\u0080\u0099s just -- weâ\u0080\u0099ve only just started would be my take on that front. Internationally, I think our premium distribution in terms of seats in Polaris is, at this point, pretty stable, given where we are just finishing up the reconfigurations. Well, I had a really good call with the Secretary on Monday, as you referenced, because this is really something that we need to help them solve. And so, I think when you talk about extract, thatâ\u0080\u0099s probably the most important point. This is an agency thatâ\u0080\u0099s done an incredible amount of work over the last couple of decades, and theyâ\u0080\u0099ve been asked to do far more. The asks of the agency -- the number of people at that agency that are working on growth, space launches, aircraft certification programs, and itâ\u0080\u0099s just massively higher than it was before, and they were forced to fund that by taking headcount out of the operational budget, the day-to-day operational budget. Itâ\u0080\u0099s -- that sort of doesnâ\u0080\u0099t pass the smell test for anyone, I donâ\u0080\u0099t think. Iâ\u0080\u0099ve had one conversation with someone from the administration, three conversations with people on the hill just in the last 24 hours about that subject. Because until we -- itâ\u0080\u0099s a supply problem, until you fix the fundamental issue, itâ\u0080\u0099s going to be challenging. Mostly works okay in a month like September, but weâ\u0080\u0099re going to always have struggles in a month like July until we get staffed up to a level thatâ\u0080\u0099s more reflective of the amount of airline operations that are in the sky today. And so, I think weâ\u0080\u0099re aligned between us and the FAA on the need to work by a bipartisan way on the FAA reauthorization bill to increase their scrapping to be commensurate. And by the way, this is about -- weâ\u0080\u0099ve made the hundreds of billions of dollars of investment in infrastructure. We -- this Sunday in Denver, where we have 114 operations per hour, beautiful, big airport, 4 parallel runways built. But it wound up with something like a couple of sick calls, and the airport operation, not clear blue sky, Sunday, it was cut from 114 to 68. We donâ\u0080\u0099t get to use our infrastructure unless we have the human capital to support it, and itâ\u0080\u0099s about to get the human capital to support all the infrastructure that weâ\u0080\u0099re building. I just wanted to clarify, you said 15,000 new employees this year and 15,000 next year, thatâ\u0080\u0099s way ahead of, I think, what the goal was by 2026 with United Next. So, our hiring is actually right on schedule in terms of what we expect across the next four to five years with respect to United Next. And -- by the way, weâ\u0080\u0099re having no trouble finding terrific talent throughout the system. With respect to the pilots, our discussions with our pilots are obviously ongoing as they are with our other unions. So, we donâ\u0080\u0099t typically comment much beyond that, but weâ\u0080\u0099re continuing to make what we hope will be a progress in that area. Iâ\u0080\u0099d like to ask a question thatâ\u0080\u0099s kind of maybe been a little bit addressed already, but that is about the holiday travel season from a passenger perspective. We are definitely seeing a lot of strength for the holidays or obviously approaching the Thanksgiving time period, and our bookings are incredibly strong. And as I said earlier and as you indicated, the bookings are a little bit different this year and that theyâ\u0080\u0099re more spread out across multiple days than they were on any single day, very, very close to the holiday in the past. So, that definitely is a new travel pattern for us. The price points, there definitely is this inflationary pressure in the country and everybody can see it as theyâ\u0080\u0099re booking a hotel room and booking -- or even go to the grocery store, quite frankly. Weâ\u0080\u0099re putting back in a lot of that money back into the customer itself as we invest in these new aircraft, which are going to be fantastic, whether theyâ\u0080\u0099re with CPAC videos or Wi-Fi on board and so on and so forth. So, Iâ\u0080\u0099d like to think that money is going to great use to create a much better experience on board. United Airlines as well as you can see in great operations to make sure weâ\u0080\u0099re getting our customers for Thanksgiving or Christmas or any time, home to see grandma on time with their luggage as they expected. Please contact Investor and Media Relations if you have any further questions, and we look forward to talking to you on the next quarter."
}