{
    "symbol": "CRC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 02:28:04",
    "content": " And we are raising our 2022 oil production by 1,000 barrels of oil per day, raising the 2022 midpoint guidance of our EBITDAX by approximately $88 million and the midpoint free cash flow guidance by nearly $53 million for the full year. On the permitting side, CRC’s Carbon Management team submitted 2 Class VI permits for an incremental 80 million metric tons of CO2 sequestration for two new projects in the Sacramento Basin, thereby creating a second CO2 storage network in the San Francisco Back Bay area. In fact, after investing in our 4-rig drilling program and advancing our carbon management business, we returned over 100% of the first quarter’s free cash flow through a combination of our share repurchase program and our $0.17 per share dividend. We expect our 2022 drilling program to deliver NPV of $445 million or $5.73 per share and bring forward value to our PDP, which already represent approximately 80% of the company 84% of the company’s value. Even after a quarter of higher capital investment and shareholder returns, we continue to build our cash balance to $328 million at the end of the quarter, up from $305 million of cash at the end of 2021 and improved our already strong net leverage ratio of less than 0.5 turn. Moving to our 2022 corporate guidance on Slide 15 and given the rise in longer-term outlook for commodity prices, we are adjusting our ‘22 guidance to reflect $98 oil price and $5.30 natural gas price as well as the impact of an additional rig in the Los Angeles Basin, higher energy prices and some reclassifications. We’re raising our 2022 full year operating cost guidance by $40 million, primarily due to higher natural gas prices, which are driving our energy costs are driving up our energy costs and the cost of gas as inputs. Additionally, on the carbon management front, we’re adjusting our full year estimate of carbon management capital to remove approximately $15 million of expected lease acquisition costs that will be treated as carbon management expenses instead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead. You may now go ahead."
}