{
    "symbol": "CRC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 10:36:04",
    "content": " And then starting out with the initial commitment of $500 million from Brookfield for CCS projects that are jointly approved through the JV, Brookfield will contribute $10 per ton for their 49% share of the storage assets as they are developed. Assuming full participation by Brookfield and the 5 million metric tons per annum through the JV suggests a potential follow-on investment of more than $1 billion from Brookfield, which to be clear, would be incremental to the original $500 million. For the second quarter, we delivered adjusted net income of $1.13 per fully diluted share, which is in line with the prior quarter and generated $83 million of free cash flow. Assuming the JV develops the full 5 million metric tons per annum and Brookfield fully participates in their 49% share, the $10 per ton storage contribution from Brookfield would enable CRC to fund all of the capital needs related to its portion of our near-term goal, thus limiting the need for corporate capital to fund our carbon management business. Brookfieldâ\u0080\u0099s 49% share of the pore space contribution at a $10 per ton of the 200 million tons is approximately $1 billion, which is well in excess of the development capital, $638 million that I previously mentioned required from CRC. Achieving our target of 5 million tons could potentially provide an incremental $185 million of annual EBITDA, which is the midpoint of the economic type curve we showed net to CRC, and that would be with limited to no capital contributions from CRC to the JV. If we do that, itâ\u0080\u0099s going to require $2.5 billion, which is going to be in excess of the initial commitment of $500 million, but it will be on a project-by-project specific basis that we will make the capital commitments and the investments, us as well as Brookfield. Thatâ\u0080\u0099s at the project level that would still hold true then there is the split as Francisco was just describing on how they get the cash flows up but to describe it a bit further, if you had just more of a storage-only type project, which means youâ\u0080\u0099re not trying to recover a whole bunch of capital investment because thatâ\u0080\u0099s typically associated with the capture system, youâ\u0080\u0099d be towards the $50 a ton of EBITDA. I mean I guess the quick and dirty math is you could say, okay, 200 million tons to the JV, there is now a marker on that at $10 per ton, thatâ\u0080\u0099s $2 billion, but then there is incremental projects that you can bring after the $200 million tons that you are looking at â\u0080\u0093 the 200 million tons that you are looking at now. So, the $10 a ton is a contribution by Brookfield to acquire 49% of the pore space with the objective of developing 200 million tons of storage, which allows 5 million tons per annum of injection. What I would say is Brookfield and us are very aligned on investing the capital for the capture equipment and the storage, which we have estimated if we got to our 5 million ton target would be $2.5 billion, excluding financing, etcetera, split across the investors, and we are very aligned with Brookfield. I think Francisco has described it during Carbon Day that when we were the 100% owner of this target, we would generate close to $400 million roughly of EBITDA by 2027 at the midpoint of our economic type curve shown then."
}