{
    "symbol": "CVBF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 13:52:02",
    "content": " For second quarter of 2022, we reported net earnings of $59.1 million or $0.42 per share, representing our 181st consecutive quarter of profitability. We previously declared a $0.19 per share dividend for the second quarter of 2022, an increase of 6% compared to the first quarter of this year. Second quarter net earnings of $59.1 million or $0.42 per share compared with $45.6 million for the first quarter of 2022, or $0.31 per share and $51.2 million for the year-ago quarter or $0.38 per share. For the second quarter of 2022, our pretax pre provision income was at a record level of $85.7 million compared with $65.9 million for the prior quarter and $70 million for the year-ago quarter. Although our earning assets benefited from the general increase in interest rates, we also had strong growth in loans and investment securities, with loans growing by $134 million on average and investments growing by $328 million on average when compared to the first quarter. Total loans at quarter end were $8.7 billion, a $100.5 million or 1.2% increase from the end of the first quarter. However, after excluding PPP loan forgiveness, second quarter loan growth was $155 million or approximately 7% annualized. The core loan growth in the second quarter was led by continued growth in commercial real estate loans, which grew by $173 million or 11% annualized. At quarter end, non-performing assets, defined as non-accrual loans plus other real estate owned, were $13 million compared with $13.3 million for the prior quarter and $8.5 million for the year-ago quarter. At quarter end, we had no OREO properties and the $13 million in non-performing loans represented 8 basis points of total assets. During the second quarter, noninterest-bearing deposits averaged $8.9 billion, a $200 million increase from the average balance in the first quarter. At June 30, 2022, our ending allowance for credit losses was $80.2 million or 0.92% of total loans. For the quarter ended June 30, 2022, we recorded a provision for credit losses of $3.6 million compared to $2.5 million for the quarter ended March 31, 2022, and a $2 million recapture provision for credit losses in the year-ago quarter. Interest rates increased through the end of the second quarter, resulting in an increase in the unrealized loss on our available-for-sale securities and a $243 million decline in equity due to the associated decrease in other comprehensive income. Second quarter earning assets decreased by $400 million on average from the first quarter due to a decrease of $860 million in average funds on deposit at the Federal Reserve, offset by an increase in investment securities of $328 million and a $134 million increase in average loans outstanding. Our balance sheet continues to be well positioned for rising interest rates with significant liquidity, including $523 million on deposit with the Fed at the end of the second quarter and approximately $175 million of expected quarterly cash flows from our investment portfolio. Excluding the impact of PPP loans and interest income related to purchase discount accretion, loan yields were 4.2% for the second quarter of 2022, 4.11% for the first quarter of 2022 and 4.33% for the second quarter of 2021. Interest-bearing deposits and customer repos decreased by an average of $314 million from the first quarter, while noninterest-bearing deposits grew by approximately $200 million on average. In addition, the second quarter of 2022 reflects a $1 million increase in income on our CRE investments, including a $1.3 million gain from a distribution related to one of these investments. Deposit service charges were $5.3 million in the second quarter, which was a $274,000 increase compared with the first quarter and were higher than our second quarter of 2021 by 28% or $1.2 million. Our trust and investment services fee income increased by approximately $140,000 compared with the prior quarter while being $205,000 or approximately 6% lower when compared with the year-ago quarter. Excluding acquisition expense, non-interest expense decreased by $2.1 million over the first quarter of 2022 and increased by $4 million over the second quarter of 2021. Staff-related expenses declined by $1.1 million compared to the first quarter of 2022, primarily due to lower payroll tax expense, which peaks in the first quarter of every year. In closing, despite the previously mentioned headwinds, we produced approximately $86 million in pretax pre-provision income during the second quarter, which is a 30% increase from the first quarter."
}