{
    "symbol": "CVBF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 18:21:05",
    "content": " For the third quarter of 2022, we reported net earnings of $64.6 million or $0.46 per share, representing our 182nd consecutive quarter of profitability. We previously declared a $0.20 per share dividend for the third quarter of 2022, an increase of 5% compared to the second quarter of this year which represented a dividend payout ratio of 43% of earnings. Third quarter net earnings of $64.6 million, or $0.46 per share, compared with $59.1 million for the second quarter of 2022, or $0.42 per share, and $49.8 million for the year ago quarter, or $0.37 per share. For the third quarter of 2022, our pre-tax pre-provision income was $91.9 million compared with $85.7 million for the prior quarter and $65.7 million for the year ago quarter. However, new loan commitments were approximately $450 million in the third quarter, which compared with approximately $560 million in the second quarter. After excluding PPP loan forgiveness, third quarter loan growth was $131 million or approximately 6% annualized. The core loan growth in the third quarter when compared with the end of the second quarter, was led by continued growth in commercial real estate loans, which grew by $41.6 million or 2.5% annualized. Dairy and livestock loans increased by approximately $43.5 million from the prior quarter due to new loan originations and a small increase in the line utilization rate from 66% in the second quarter to 67% at the end of the third quarter. At quarter end, non-performing assets, defined as non-accrual loans plus other real estate owned, were $10.1 million compared with $13 million for the prior quarter and $8.4 million for the year-ago quarter. During the third quarter, we experienced credit charge-offs of $46,000 and total recoveries of $425,000, resulting in net recoveries of $379,000, compared with charge-offs of $8,000 and total recoveries of $511,000 resulting in net recoveries of $503,000 for the second quarter of 2022. During the third quarter, non-interest-bearing deposits average $9 billion an $86.9 million increase from the average balance in the second quarter and a $1 million increase in the average balance from the third quarter of 2021. Investment securities held-to-maturity or HTM securities totaled approximately $2.56 billion at September 30, 2022, which represents $146 million increase from the second quarter. For the quarter ended September 30, 2022, we recorded a provision for credit losses of $2 million compared to $3.6 million for the quarter ended June 30, 2022 and a $4 million recapture of provision for credit losses in the year ago quarter. The provision for credit losses in the third quarter was driven by loan growth, which was approximately $132 million when excluding PPP loans as well as an increase in our projected life of loan loss rates. Interest rates increased through the end of the third quarter, resulting in an increase in the unrealized loss on our available-for-sale securities and a $137 million decline in equity quarter-over-quarter due to the associated decrease in other comprehensive income. Our loan-to-deposit ratio continued to be 63% at the quarter end, and we anticipate funding future loan growth with cash flows from our investment portfolio, which are approximately $175 million per quarter. Total interest and fee income from PPP loans was approximately $1 million in the third quarter, compared with $1.4 million in the second quarter. Non-interest income was $11.6 million for the third quarter of 2022, compared with $14.7 million for the prior quarter and $10.5 million for the year ago quarter. Our customer-related fees, including deposit services, international and Merchant BankCard services were essentially flat when comparing the third and second quarters of 2022, but these fees increased by approximately $800,000 or 13% compared to the third quarter of 2021.Our trust and wealth management fees declined by $95,000 compared to the prior quarter, but increased by 7% or $186,000 year-over-year. The overall decrease in non-interest income in the third quarter compared to the second quarter was driven by variances in our income on Bank-Owned Life Insurance, returns on investments made under the Community Reinvestment Act and the $2.7 million gain on the sale of fixed assets realized in the second quarter of 2022. The growth in non-interest expense over the third quarter of 2021 was $4.9 million, which includes the impact of acquiring Suncrest at the beginning of 2022. We reported record quarterly earnings and strong loan growth in the third quarter and produced a record $91.9 million in quarterly pretax pre-provision income, which is 7% increase from the second quarter."
}