{
    "symbol": "CVBF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 14:48:05",
    "content": " Fourth quarter net income of $66.2 million or $0.47 per share, compared with $64.6 million for the third quarter of 2022 or $0.46 per share and $47.7 million or $0.35 per share for the year-ago quarter. For the fourth quarter of 2022, our pre-cash, pre-provision income was $95.4 million compared with $91.9 million for the prior quarter. Pretax pre-provision income grew by approximately 43%, when compared to the $66.8 million earned in the year ago quarter. We recorded a provision for credit losses of $2.5 million for the fourth quarter of 2022, compared to $2 million for the third quarter and no provision for the year-ago quarter. This quarterly decrease in average earning assets reflects the decline in our funds held on deposit at the Federal Reserve, which declined for more than $2 billion on average in the fourth quarter of 2021 to approximately $125 million on average for the fourth quarter of 2022. After excluding PPP loan forgiveness and the seasonal increase in dairy and livestock loans, fourth quarter loan growth was $189.7 million or approximately 9% annualized. The core loan growth from the end of the third quarter was led by continued growth in commercial real estate loans, which grew by $199.7 million or 3% annualized. At quarter end, non-performing assets defined as non-accrual loans plus other real estate owned were $4.9 million, compared with $10.1 million for the prior quarter and $6.9 million for the year-ago quarter. Classified loans for the fourth quarter were $78.7 million, compared with $63.7 million for the prior quarter and $56.1 million for the year-ago quarter. During the fourth quarter, non-interest-bearing deposits averaged $8.7 billion, a $307 million or approximately 3% decrease from the average balance in the third quarter. Year-over-year we had a $377 million increase in average balance, when compared to the fourth quarter of 2021, including the $513 million in non-interest-bearing deposits acquired from Suncrest at the beginning of 2022. Total deposits and customer repos were $14.2 billion on average in the fourth quarter of 2022, a $524 million or 3% decrease, compared with the prior quarter. The combination of seasonal growth in dairy and livestock loans seasonal deposit declines and the impact of cash burn on deposits from inflationary pressures resulted in borrowing overnight from Federal Home Loan Bank, averaging $161 million for the fourth quarter and peaking at year-end at $995 million. Our Fed balance averaged approximately $125 million for the fourth quarter of 2022, compared to $625 million in the third quarter and $2 billion in the fourth quarter of 2021. For the fourth quarter ended December 31, 2022, we recorded a provision for credit losses of $2.5 million, compared to $2 million for the quarter ending September 30, 2022. The provision for credit losses in the fourth quarter was driven by loan growth, which resulted in a $190 million of core loan growth, after excluding temporary seasonal growth in dairy and livestock loans, as well as the decline in PPP loans. Net interest income before provision for credit losses was $137.4 million for the fourth quarter, compared with $133.3 million for the third quarter and $102.4 million for the year-ago quarter. Fourth quarter earning assets decreased by $521 million on average from the third quarter, due to a decrease of $500 million in average funds on deposit at the Federal Reserve. Non-interest income was $12.5 million for the fourth quarter of 2022, compared with $11.6 million for the prior quarter and $12.4 million for the year-ago quarter. Our customer-related fees including deposit services, international and Merchant BankCard services increased by $500,000, compared to the third quarter and increased by $1.3 million or 28%, when compared to the fourth quarter of 2021. Non-interest expense for the fourth quarter was $54.4 million, compared with $53 million for the third quarter and $48 million for the year-ago quarter. Employee expense grew by $4.6 million or 15% over the fourth quarter of 2021, which includes the impact of the Suncrest acquisition, as well as inflationary pressures, unemployed compensation."
}