{
    "symbol": "CVBF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 14:31:06",
    "content": " First quarter net earnings of $45.6 million or $0.31 per share, compared to $47.7 million for the fourth quarter of 2021 or $0.35 a share, and $63.9 million for the year ago quarter or $0.47 per share. For the first quarter of 2022, our pre-tax pre provision income was $65.9 million, compared with $66.8 million for the prior quarter and $70 million for the year ago quarter. However, after excluding PPP loan forgiveness loans acquired from Suncrest, and the seasonal decrease in dairy and livestock loans, first quarter loan growth was $144 million, or approximately 8% annualized. The core loan growth in the first quarter was led by continued growth in commercial real estate loans, which grew by $100 million and C&I loans which increased by $27 million when compared with the end of the fourth quarter. At quarter end, non-performing assets to find this non-accrual loans plus other real estate owned were $13.3 million compared with $6.9 million for the prior quarter and $15.3 million for the year ago quarter. Classified loans for the first quarter were $64.1 million, compared with $56.1 million for the prior quarter and $69.7 million for the year ago quarter. During the first quarter, non-interest bearing deposits averaged $8.72 billion, a $395 million increase from the average balance in the fourth quarter. With yields on average of approximately 2.4%, including the $130 million in securities acquired from Suncrest, our total investment securities increased by $900 million from the end of the fourth quarter to $6 billion as of March 31, 2022. Net interest income before provision for credit losses was $112.8 million for the first quarter, compared with $102.4 million for the fourth quarter and $103.5 million for the year ago quarter. During the first quarter of 2022, PPP loans had an average balance of $160 million, compared with $244 million for the fourth quarter of 2021. Total interest in fee income from PPP loans was approximately $3 million in the first quarter, compared with $4.2 million in the fourth quarter. Deposit service charges exceeded $5 million during the current quarter, which is an increase of $575,000 compared with the fourth quarter, and we're higher than the first quarter of 2021 by 27%, or $1.1 million. Now expenses, non-interest expense for the first quarter was $58.2 million, compared to $48 million for the fourth quarter of 2021 and $47.2 million for the year ago quarter. Excluding acquisition expense, non-interest expense increased by $4.8 million over the fourth quarter of 2021 and $5.4 million over the first quarter of 2021."
}