{
    "symbol": "EGP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-27 17:40:23",
    "content": " And while California is still a very strong market in terms of rent increases, we've seen Las Vegas, Phoenix, some of the Florida markets, Austin, El Paso, and a number, it makes me feel like it's more sustainable or it is more sustainable because it's really not kind of waiting for the mix as much as it was last year. Similar to what we sold and it was on a ground lease, it was similar to what we sold in Phoenix early in the year as we're kind of always, I think, a good time to be a seller where the markets are, and we thought this isn't an asset that's going to really drive our growth or perform the same level as the balance of the portfolio, nothing wrong with the asset, but it didn't have the dock high distribution. I mean, could you just discuss any recent trends you are seeing in the transactions market for light industrial product, like specifically, how do you think higher rates have impacted bids from the private players you are competing with\n Maybe a two-part answer, what we're seeing on the type of products we're we typically chase, we've been hoping cap rates may rise, and seen nothing to date. The one area and I'm kind of repeating what one of the brokerage groups were telling me where they have seen cap rates come up and it makes sense or the long-term bond-like projects where it's a triple net single-tenant asset on a long-term lease, where you don't have a chance to take advantage of a rising market. It's really tenant driven where I will say where we've been impacted or where we're feeling it is as we build the buildings, especially in markets like Las Vegas, the Phoenix market that makes sense. Good question and thought, the way maybe that this helps the two ways we viewed it or one when you look at the supply numbers, I would say a general rule of thumb for our markets and in some cases it's been less as – I'd say 10% to 15% of new supply in Dallas, Atlanta picked the market. I don't think I've articulated it to the street as well as we could, but really our development model will, because it's within a park and because it's really, say Buildings 2 and 3 leased up well, will let the park really pull the next project. I don't want to just – I don't think it makes sense for us to shut the spigot off in Houston if we can develop and create value, but maybe it's a little bit build one or two, sell one or two in Houston and let the rest of the portfolio grow. The start number higher, I think the caveat to that is the other, what's holding us up and what's holding the market up a little bit is the steel deliveries and all the other things that there could be some projects especially as we get later in the year that we'd like to start and the markets there, it will be where in line can we get, because you hate that. It's pretty jaw dropping where land prices at $70, $80, $90 a foot for industrial and buildings trading for, if there's one in LA that traded for recently $600 a foot, which I never, having been in industrial longer than I want to add up over the years that those are numbers I didn't think I would see. They could, and it was really more again, maybe too far where I was saying, and I think, people would have thought, we were crazy, I was crazy if we had kept building during COVID and it's kind of one of those in hindsight's 2020 how short the pause was in industrial."
}