{
    "symbol": "ARIS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 15:15:23",
    "content": " In the second quarter, we increased our total water volume to approximately 1.2 million barrels per day, up 34% versus the second quarter of last year and up 6% sequentially over the first quarter of this year. As Bill referenced, later in the second quarter, a few of our large contracted customers experienced delays and they've provided schedules and completions on our dedicated acreage, which in turn delayed anticipated water solution volumes and related revenue. We reported adjusted EBITDA for the second quarter of $37.2 million, up 21% from the second quarter of 2021 and up 3% sequentially from the first quarter of 2022. As Bill and Amanda referenced, due to volume delays in our inflationary pressure, our adjusted EBITDA was slightly below our previously provided guidance range of $38 million to $40 million for the quarter. Given these updated volume, along with inflationary pressures that will impact operating margins in the short term, we anticipate third quarter adjusted EBITDA will be between $38 million and $41 million. As we think about the company's performance more broadly, we are delivering sequential volume growth of over 6% in the second quarter and anticipate growing adjusted EBITDA by approximately 30% this year versus 2021. It gives us great optionality and it gives us an opportunity this year to sort of accelerate some of the initiatives that we're looking at with our customers and as we indicated in our deck, once integrated, we expect this acquisition to generate incremental annual adjusted EBITDA of $11 million to $13 million. But we're just focused on the EBITDA that's incrementally added we know is on that system today, and what brings in and then the capital defrayment of approximately $25 million, $20 million, $25 million next year. So it's just aâ\u0080¦\n And we gave at that timeâ\u0080¦\n Yeahâ\u0080¦\n Okayâ\u0080¦\n But kind of big numbers, just to put it in perspective, a 4-well ag today within the lateral is going to take 2 million barrels of water and 2 million barrels of water at a $0.40 margin ends up being $800,000, a pure gross profit pushed across the quarter."
}