{
    "symbol": "TDCX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-22 12:38:06",
    "content": " We are seeing greater contribution from our four newer geographies, namely Colombia, India, Romania and South Korea, which made up close to 10% of the year-on-year growth in revenue for Q3, 2022 against Q3, 2021. In terms of earnings and quality growth, our numbers showed that we continue to deliver quality earnings growth, adjusted net income which strips out the performance share plan cost for a like-for-like basis comparison rose 15% year-on-year to US$24 million or S$35 million. Revenue rose 16.1% to $120 million, driven by growth across the omni-channel, CX sales and digital marketing, content, trust and safety service lines. Firstly, Q3 2021â\u0080\u0099s Asian productivity from key clients to projects in omnichannel, CX and sales and digital marketing service lines was higher as business volume increased significantly during this period from the preceding two quarters. Revenue from omnichannel, CX solutions was up 13% to US$70 million, due mainly to high business volumes driven by the expansion of existing campaigns in the FinTech and technology verticals. Revenue from content, trust and safety services rose by 6% to $20 million due to an increase in business service volumes. Adjusted net income rose by 27% to US$66 million, while net income rose at the lowest 6.6%, due mainly to the performance share plan expense which did not appear in the same period last year. Revenue from sales and digital marketing services increased by 47% to $82 million, while revenue from content, trust and safety services rose by 6% to $57 million. And on the Airbnb warrant thing, yeah, it is â\u0080\u0093 as what Edward mentioned just now, it has â\u0080\u0093 the warrant has a bit of a link to the Master Service Agreement, prescribing â\u0080\u0093 setting the business volumes as one of the conditions and because the Master Services Agreement was, renewed with TDCX last year, whereas the warrant agreement was executed in September this year."
}