{
    "symbol": "TDCX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-24 15:13:03",
    "content": " This was driven by strong contributions from clients across key verticals, including digital advertising and media, and travel and hospitality and especially from our ex-top five clients who are growing at the fastest pace since listing at twice the pace of our group revenue growth in Q2 2022. We maintain our focus on quality growth, adjusted net income, which strips out the performance share plan cost for a like for like basis comparison, rose 35.5% year or year to $22 million or S$ 30 million. The quality of our earnings growth is also shown in the strong cashflow conversions, Q2 2022 net cash from operating activities worth US$76 million almost doubling year on year. Revenue from new economy stood at 93% for the first half of 2022, excluding efforts to reduce our client concentration and our total clients now represent 57% of Q2 2022 revenue compared to 63% in Q2 2021. Revenue rose 20.3% to US$170 million, driven by growth across the omnichannel, CX and sales and digital marketing and digital planning. Revenue from omnichannel sales solutions rose 19% to US$68 million, due to high business volume driven by expansion of existing campaigns in our feedback and technology verticals. In Q2 2022 revenue from content, trust and safety services rose by 6% to US$19 million primarily due to an increase in business volume from a client in a travel and hospitality vertical. In Q2 2022, omnichannel sales reached up 69% of our business, while sales and digital marketing is at 24% and content, trust and safety share is 70% respectively. All other expenses which include items such as recruitment, transport and telecommunication expenses rose 1% for Q2 2022 lower than our revenue growth, which demonstrates continued focus on proven cost management. Revenue rose 25.1% to US$226 million, similarly driven by growth in the omnichannel and sales and digital marketing business segment. Revenue from the content, trust and safety services rose by 6% to US$38 million, primarily due to an improvement in business volumes from our client in the travel and hospitality services. In the first half 2022, omnichannel sales went up 69% of our business, while sales and digital marketing stood at 74% and content, trust and safety 17% respectively. In terms of the travel and hospitality space stood at 25% versus Q2 last year, this is still some 16% of the highest level peak quarter that we had in 2019. We think that the -- one of the environment that is kind of challenging in the digital advertising could very well impact us but it's also mitigated by the fact that we are quite strong in sales and digital marketing and we think like I said earlier on that, as the digital advertising market is becoming more and more competitive, our clients have put an appetite for engaging us to do sales and digital marketing."
}