{
    "symbol": "TDCX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-25 12:33:02",
    "content": " Throughout today's recorded presentation, all participants will be in a listen-only mode. Hello, everyone, and welcome to TDCX 2022 first quarter earnings conference call. We have our Executive Chairman, Founder and CEO, Mr. Laurent Junique; and our CFO, Mr. Chin Tze Neng. Before we continue, I'd like to remind you that we will make forward-looking statements, which are subject to risks and uncertainties and may not be realized in the future. Also, this call includes a discussion of certain non-IFRS financial measures, such as adjusted EBITDA, adjusted EBITDA margins, adjusted net income and adjusted net income margins. For reconciliation of the non-IFRS measures to the closest IFRS measures, please refer to our press release or the Form 6-K, which are available on our website. And for a change, I would like to start highlighting the good work that was done by our teams on climate change and corporate social responsibility. To begin with, we believe that businesses play an important role in promoting and accelerating sustainability. Given the impact of climate change, we made it a priority to reduce our carbon footprint across our operations globally. First of all, by reducing our carbon output and offsetting what we are currently unable to reduce through United Nations Climate Neutral Now Initiative. In addition, during the quarter, we launched our women's empowerment network. Through the network, we aim to continue to build a diverse and equitable workforce to empower our female colleagues to pursue their career goals and to uplift women in marginalized communities through digital literacy. As a result of the joint team effort, our quarter one 2022 revenue rose 26.9% to US$113 million or S$152 million. Adjusted net income, which trips out the performance share plan cost for a like-for-like basis comparison, was up 34.9% to US$22 million or S$30 million. Q1 2022 net cash from operating activities was US$37 million, up 188.1% year-on-year. However, this was still 30% below Q1 2020 levels. While clients' orders grew, it takes time to train and onboard talents before the revenue impact flows through for us. We serve payment gateways, crypto exchanges and other fintech companies requiring a high level of complexity. The crypto space is still only a small part of our business currently, and we are happy with this space. And as mentioned before, we are keeping a close watch, especially for market risks around it. On the digital advertising front, we continued with a growth, a very strong growth trajectory, and we're happy to announce a major new client win with a leading short-form video sharing social media company. This reaffirms our leadership in this particular space, helping digital advertisers support and grow their customer base. All in all, revenue from new economy clients stood at 93% of total revenues in Q1. On new client wins, we have continued our business development momentum with 10 new logo wins compared to four in Q1 2021. Sectors within these new logos include the e-commerce, fashion, tech, fintech and digital advertising, as mentioned earlier. Our client count stands now at 55 as of 31st March, up 41% compared to 39% a year ago. Now if I look at performance by services, just to recap for those who are joining our call for the first time, our business comprises three key service offerings, one, omnichannel CX solutions; two, sales and digital marketing services; and three, content monitoring and moderation services. The market opportunities for each of these services remain significant over the medium to long term, as indicated on the slides. And for trust and safety related work, we already clocked in around US$4 million a quarter, which is currently classified under the omnichannel CX stream. This includes data annotation work where we help enable machine learning, listing verification to ensure authenticity and accuracy of listings for rental or sale as well as the KYC procedures for onboarding of new trading accounts. As our clients start to look into decentralizing their services into new markets, our regional expansion will help us capture these new businesses. One, continued opportunities to expand business and service offerings with our existing blue-chip clients. Two, strengthening our business development and marketing efforts to accelerate new client growth. Three, a third pillar will be put on expansion into new geographic markets. Fourth, strategic M&A that will complement our capabilities, geographies, or client coverage. Last but not least, continuous discipline on operational cost efficiencies as well as productivity. Now on the current economic environment, we all know the near-term environment remains uncertain as the global economy faces many headwinds, such as inflation, the ongoing war and continuing supply chain issues. And I will now hand over to Mr. Chin to cover the financials in detail, as well as to provide an update on the guidance. Just to recap, we implemented the performance share plan or PSP in November, 2021 as a long term employee incentive program. Therefore, the adjusted EBITDA and adjusted net income metrics exclude the charge from the share-based plan expense to facilitate a like-for-like comparison with the same period last year. Accordingly, adjusted EBITDA rose 27.6% to US$35 million. Adjusted EBITDA margin rose marginally to 31.3% for Q1 2022, compared to 31.1% in Q1 2021. Net profit for the period declined 0.6% on a reported basis due largely to the implementation of the PSP, which did not appear in the same period last year and to a lesser extent, higher income tax expense. On the like-for-like basis, excluding PSP costs adjusted net income would have risen by 34.9% to US$22 million. Next, we share more details on our Q1 revenue performance by the services we offer and by the geographies in which we operate. Omnichannel CX now mix up 61% of our business while sales and digital marketing is at 23% and content moderation, 14% respectively. In terms of revenue contribution by key geographies, Singapore rose 7% to US$26 million; Philippines rose, 23% to US$27 million; Malaysia rose 44% to US$34 million; Thailand rose 37% to US$60 million. Thailand stood at 14%, followed by Japan at 4% and China at 2%. As Laurent shared earlier, we added 10 logos in Q1 compared to four logos in the same period last year. Client count stood at 55 as of 31 March, 2022, a 41% increase compared to 31 March, 2021. If we exclude the PSP cost, employee benefit expense would have increased by 28%, largely in tandem with revenue growth of 27%. Our depreciation expense declined by 4% largely due to certain renovation assets in Singapore, Thailand and Philippines being fully depreciated during the period. All other expenses, which include items such as recruitment, transport and telecommunication expenses rose 8% for Q1 2022 lower than our revenue growth, which demonstrates our focus on cost management. Lastly, let me provide an update on our full year 2022 outlook. While we have achieved a solid Q1 performance, the current business outlook remains uncertain. In particular, some clients are holding off on their earlier plans, commitments and delaying projects. Given this uncertainty, we are being practical about the current environment and earnings on the site of caution in terms of our outlook. As such, we are reducing our FY2022 revenue growth guidance to S$650 million to S$675 million or US$480 million to US$499 million. This takes into account lower assumptions of revenue growth from our top clients in the digital advertising and media, fintech and e-commerce verticals. With our continued focus on cost efficiencies and productivity, we are maintaining our full year 2022 adjusted EBITDA margins to be approximately 30% to 32%. Thank you, Mr. Chin for taking us through the financials. Hi, management thanks for taking my call. So the first would be on your new kind of big clients or big logs you just added, your leading global short-form video social media platform as well as your e-commerce platform. And for the second question, may would be on the outlook, we noticed the revised revenue guidance. And also maybe shed a little bit of color on Airbnb pulling out of China, whether that affects your business in China. So look, the new logo, we’re very, very excited about, for sure, and our new e-commerce clients from Southeast Asia as well. On the short-form video platform, I think its high-growth client that’s been very successful in disrupting the digital advertising business. So, we’re proud and happy to have been selected for their expansion and their plans. What’s interesting about this client is that we are covering them first start, both in Singapore and in Barcelona. It’s a simultaneous launch across two and actually now three LOBs, lines of business, which will eventually get into a third geography fairly quickly as well. Whilst it’s starting small, but steady, it’s got a great potential growth for especially 2023. So it’s really reaffirming or confirming TDCX’ expertise in both sales, support and more for this client and for the other clients we have in these sectors. Now on the revised guidance, there’s no real specific industry or clientele that has been singled out here. There’s a bit of a drop in the number of the clients we have, really on the back of a macro environment, uncertainty to begin with, things have moved very fast. You can see how the stock markets are behaving and how quickly things are happening with the prospect of inflation, ongoing more and its escalation, the possible recession next year, the impact on supply chain, China, clients, we feel have become more cautious. To answer your question, Jonathan, but it’s in general, an overall feeling of softness that’s caused us to make that decision to reduce our guidance. We’re erring on the side of caution, and we’ll continue to work with to be that target for sure. And just to play into your next question around Airbnb in China, it’s one of these unforeseen situation not expecting it at all. But in the grand scheme of things, it’s a small part of our business. China is a small part of our business, so we will be able to weather that. But it’s a disappointment for sure, and I’m sure for many in general, but we’ll ride through this. And it doesn’t alter our commitment to China in general, despite the challenges that China is encountering, just that specific challenge, the challenge is everywhere currently in China with the pandemic, which we understand that it is committed to China. Described it in the past, it’s really a very focused strategy, working with international clients, which are an extension of our network, needing some very specific work and that’s working well for us. And I hope that answers the question, Jonathan. Firstly, on the revenue trend, just want to have a better understanding on the quarter-on-quarter revenue trajectory. Question number two, circling back to the guidance you lowered it down. For the content moderation decline, what I probably wanted to confirm is that this is a single business line. It tend to be a seasonal and business adjustment I would say for that program, but maybe I take this opportunity to mention that content moderation is part of and we've spoken about this before, but again of a bigger trust and safety work that we do that is classified under OCX or omnichannel CX solutions. So what we see here is actually a classification for content moderation for that single product line that should actually be taking in the overall trust and safety work that we do, which is a data annotation, KYC and machine learning support. And that's, if I lump it together grows up about 50% per year, year on year. Now on the coming back on the guidance, the question was around, the seasonality on the guidance. So from Q4 to Q1 results I think similar to Q3, which was a big bump in Q. Q1 and Q4 are fairly different in general, Q1 is slightly faster. We have some overtime, so these are different quarters. So the last question is around guidance, in particular how to think about the guidance on a segment-by-segment basis. The margins and the difference between the different segments, in the different segments in the guidance, we expect that in a crisis, we expect that sales in digital marketing will do better. And if our clients let's say in fintech or in digital advertising are receiving less requests, less volume, then we'll have a reduction. And as you can see, we have not planned for any margin reduction. Right now, if I look at Q1 as an indicator, we don't see a very big impact on inflation yet. And in some cases, some price increases for some clients and all-in-all we've planned it such that it doesn't impact our margins at this point. Next question is from the line of Varun Ahuja from Credit Suisse, please go ahead. Hi, good evening management and thanks for the opportunity. A few questions from me, I want to touch back on the seasonality part. Number two, I just wanted to understand on the travel part. I missed your comment, I think you mentioned something on the travel, if you can get back again on that front, but overall, how do you see your travel contribution as it's opening up and then obviously you've acquired a lot of new clients also. I'm trying to figure out is the existing clients more specifically your large two clients, maybe the largest client is some pressure there, you're seeing some kind of reluctance or a cautious view on that front, because the expectation is some of the new clients would've started to ramp up or that you added over the last 12 months or so? And talking about quarter seasonality, I think a good point that you’re bringing here. I think Q3 is where we probably can see the impact of the travel recovery, as much as Q1 is a bit more muted. We received the decent orders for ramping up and we are ramped up, we’re starting to see the effects, but they were really truly coming at Q3. So that’s the seasonality if you’d like Q4 end of the year, Q1 depending on the region will be a bit more muted. And yes, we do see some impact on the airline work we do is significant, but it’s a small part of our business. On our large hospitality business, it’s also a nice pickup as well. And that’s been put in our forecast, but the other clients which are in fintech or in digital advertising have probably a more muted growth for the following quarters. And by the same token, the new business that we’ve brought in is taking a little bit slower than expected to materialize, whether it’s e-commerce, whether this is the short form video platform that we're launching, it was supposed to launch much earlier to be honest, it’s about to launch. The objective for TDCX is to expand in more geographies, as we said before in a prudent manner. But we need them, we need those geos to attract more business from our clients that land and expand strategies more value today than ever before. It also provides us a hedge to provide also more competitive services, should we need to do so and to grab more market share in those expanding markets that we’ve identified. So where we are staying the course, we’ve revised our guidance. It’s not what I want, but it’s what it is. If there are – can I ask two more questions there are no question on the queue; otherwise, I’ll get back under the queue. Yes, we do have couple more callers on the queue, Varun maybe. Hi, thanks management for giving the opportunity – giving me the opportunity to ask questions here. So we’ve – thank you, Sean. The other eight logos as well will show up a bit more in 2023, we’re already midyear. And my second question on the hospitality and travel vertical, you mentioned earlier about seeing a recovery in Q3 as things reopen. Looking in Q1, it was 19% up, right compared to last year, but it was still lower by 30% compared to 2020 – 2019 pre COVID time. It’s a good recovery, but once again, I would’ve hoped for more. No, it grew by 19% compared to 2021 for us. And my last question, have you seen this trend whereby tech companies, your clients who are cost cutting in this environment today and shifting their workforce from internally to outsource given, it’s slightly cheaper for them to outsource function to guys like yourself and the industry, are you seeing the trend yourself in this region? Yes, from tech companies, I think it’s not new. There’s labor tension as well, difficulty to find the people to do the job is a sign to that that clients may be looking for these options. We don't see it immediately on our forecast at this point, but this is a trend that could be developing for sure. So what we've seen since 2021, we see an increase in attrition. We see a bit of tapering in April, but we're not crying victory. There's different reasons for this, the first one we believe is work from home makes it very easy for someone to switch jobs and they don't need to have a consideration of whether this office is near my home for example, and they can switch job very quickly and have a laptop delivered to their home. Some people have – were in to travel, they lost their job, then they moved into a company like ours, for example. So there's going to be some, some demand – labor demand that's causing staff turnover. We don't have, I cannot confirm those numbers because they're not independently confirm, but we are still able to manage and we're able to manage with those increased attrition numbers, and we're able to deliver the head count that we're looking for. It's not getting easier, that's for sure. And we've taken steps to address this from a structure point of view with the global head of talent acquisition, and we're pushing ahead further in measures and actions to make sure that we still are able to deliver the important quality resources. Yes, the PSP costs that we have, Mr. Chin is...\n Hello Han. Mr. Cain, you can answer this question. So there was a two months accounting for the PSP in quarter four, as opposed to a full three months in Q1. And over these few quarters, it will take that from the current figure and also due to the, there were a few trenches of the PSP that got canceled. For sure, I mean, we're not – we're not turning down any particular clients and some of them are from the more traditional economy and we're definitely looking at those clients as well where they're looking for digital transformation, where they're looking for high quality services and then we've on-boarded the some or expanded on some existing traditional economy logos recently in Thailand. For example, we've acquired a client in that field in Colombia in quarter one as well, so yes, absolutely. Our client retention has increased from Q-to-Q, Q1 – Q1 2021 to Q1 2022 stands at 125% by net revenue retention rate versus it was about 113% in the prior year. So I think next up we have a call, a question on the webcast from Wilson Wong of Jarden . Well, I think that's actually all the questions we have on the webcast, as well as the call. I think we will just hold for a short while, see if there's any questions coming in for the next minute or so, if not then we will sort of end. So the next question, operator, please take over. Hi, thanks for taking my question. That's what's interesting about it because if I compare them to the other clients we had acquired in 2012 and 2015, we started with just one product line, one geo. This one, we're starting two product lines in two geos expanding into a third one. So yes, that answers the question. Secondly, of course, I think near term, you are lowering your revenue guidance because of some uncertainties regarding some customers maybe pulling back a bit in terms of making decisions. Thank you for this question, really. So assuming the macro backdrop stabilizes, our long-term growth outlook does not change. So look, it's pretty much what we had anticipated that is going to happen if the macro backdrop stabilizes in terms of our growth outlook. So there's no changes for the long-term, 2023, 2024. We're acquiring new customers, we're expanding geos. We just have to bear with the short-term blip, and we'll be able to ride it through. I guess as I mentioned previously, customers are still continuing to outsource part of their work up to third party. I guess with the recent spot market weakness, just wondering if you have seen private companies valuations has also come down with this, are we closer to acquiring any company, yes because we do have a very strong cash flow balance . Yes, absolutely, and we want to make this – put it to work. But look, yes, our pipeline is growing with very interesting targets and a nice range of targets that we're talking to. As you know, M&A takes time and we have to make sure that the price will adjust to the market, which it will unavoidably is a question of time. But we're looking for quality targets, profitable companies that really add to our story and add to our strategic position. But right now, we're still building the pipeline. That’s all, the question I have. And lastly, one other thing I wanted to check is one of your – obviously, global peer TaskUs is kind of mentioning they are seeing pressure wherein they've been offshoring some of the U.S. work to low-cost location and hence, same revenue and costs, both have an impact. No, great question on the dividends, Varun. It still feels like yesterday for me, although the numbers are very different as we speak. But the company is high growth, even at 19.3%. And we're one of the fastest growing in our sector, probably the second fastest growing with these kind of numbers. We have a plan for M&A, and I don't think it would be wise at this moment given the current market situation to jump into giving dividends so early in our history. Singapore is a different world in a way where we're doing multilingual work of a very high end or very domestic work for clients from the government, for example, which need to be operating from Singapore. And that's why we have a moderate growth outlook into Singapore, which we had planned and anticipated and that we're growing our network, but it's done at a severe pace at this point. There are no further questions at this time, and I would like to turn back to management for any closing comments. Thanks, everybody, for dialing in and spending time with us. I know if you have any other questions, please feel free to reach out to us."
}