{
    "symbol": "AMRX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 13:16:02",
    "content": " Second, in injectables, the strategic focus has been on scaling our business with an expanded portfolio, additional capacity and new capabilities, we expect over $170 million revenue this year and we are well on our way to achieving our goal of over $300 million injectables revenue by 2025, which represents 24% CAGR from 2021. For these first three products, we see peak sales of over $200 million in the next two to three years. Next across our R&D teams, we are increasingly focusing our efforts and investments toward high growth and high impact areas, particular injectables, complex generics, biosimilars, and specialty branded products. Versus the prior year period, revenue was up 3% while adjusted EBITDA was down 5% due to ongoing investments in high growth areas such as biosimilars, injectables, and specialty. Let me now review each business segment, starting with generics, which delivered Q3 net revenue of $350 million, an increase of $3 million or 1% versus the prior year period. At $69 million in the quarter, Unithroid and Rytary account for approximately 80% of our Specialty revenues and we are very pleased with our consistent growth with year-to-date total prescriptions being up 14% and 6% respectively. In Healthcare, Q3 net revenues were $106 million, grew $17 million or 19% compared to the prior year period, reflecting continued expansion about the distribution channel. As a reminder, our full year adjusted EBITDA expectations include about $40 million of incremental investments to drive future growth and $25 million of inflation. First, as previously mentioned, we expect strong top line performance across our three businesses driven by key products such as Rytary, Unithroid, Zafemy and injectables. First, in Q4 of this year, we began commercializing our first biosimilars, and in 2023, we will have a full year benefit of these launches, which we expect them to peak at approximately $200 million plus over the next few years."
}