{
    "symbol": "KMB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 14:07:09",
    "content": " It's harder for us to see, but just taking what you said about commodities and what we know about pricing, it doesn't look like you've experienced much notable volume deleverage to gross margins this quarter from the weaker volumes, but certainly, the operating margin performance was different. I'll comment in terms of North America, I would say the environment at this point remains fairly typical, and that's kind of -- it's rebounded from being I would say, more suppressed during the peak years of COVID and is now, I would say, normalized in terms of promotional frequency, may be still a little lower on depth. And so -- and the reference for that is -- I think we've had a price gap, meaning we've been ahead on price on Huggies all year until I would say recently, maybe in the last couple of weeks or so. And I would -- from my earlier comments on maybe the bifurcation, it's coming out a little bit more on more of the value-oriented tiers, let's say, Snug & Dry diapers for us, which is our value tier diaper in the U.S. or Scott 1000. The thing that would have -- that you would have seen is an expansion in terms of percent year-over-year in terms of the between lines, and that was really driven largely because of last year's onetime adjustment to incentive compensation, which we talked about at the third quarter earnings call. I don't think we're ready to comment on any specifics related to the transaction and... And again, the only thing I would say is overall revenue from this -- from the transaction that's being divested is just around the 1% level, and profits are immaterial. Like the value tiers tend to be a little bit more price sensitive in this environment because, as I was mentioning earlier, there are a significant number of households, let's say, in the U.S. that are -- have less to spend now given all the inflation that's occurred over the last couple of years or so. And so we approach it and notably, let's say, in the U.S. We've been very focused on growing the categories and working with our retail partners to grow the categories the right way I mean we're really proud to note that in the survey for the first time, we were rated #1 as a customer organization and #1 across most disciplines because I think our customers' view that we've been working with them in a partner-like fashion. And so I wouldn't say regarding, let's say, for your question, whether it's diapers or private label, anything different that we're seeing in terms of the profit play of them trying to change distribution or emphasize different lines. And one of the reasons we've priced is that -- and I think we've talked about this with our customers is we feel like it's our role to help grow the category and drive category growth, and that requires marketing. And right now, given the -- I would say, the supply shocks or the input cost shocks that we've taken on in the last three years, as I mentioned before, 1,500 -- the equivalent of 1,500 basis points of gross margin, margin improvement right now this year remains my top priority."
}