{
    "symbol": "DS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 13:48:04",
    "content": " We delivered nearly $87 million in total company revenue, up $13 million or 17% compared to Q2 last year. Our core business remains solid with our 53 American Golf courses delivering $71 million in total revenue, coming in at $8.5 million above last year's same quarter, driven by strong demand for events. Our four Drive Shack venues delivered total revenue of just over $11 million, and while down just slightly versus last year, they drove a strong events business with over $3 million in event revenue this quarter. For Q2, our two venues in The Colony and Charlotte generated combined total revenue of $4.4 million. Total event revenue in Q2 was $14 million and is up significantly at over $10 million to last year, with more than $7 million of the increase coming from private event sales at American Golf. Adjusted EBITDA for the quarter was $4.6 million, which was $3 million below last year's second quarter, which was expected with the strategic investments in headcount and other related expenses we've made to support the development and growth in Puttery. On a year-to-date basis through Q2, they are each generating over $4 million in total revenue and delivering venue EBITDA margins of 29%, which is in line with our expectations to date. The Colony delivered Q2 total revenue of $2.4 million, driven largely by their walk-in business at $1.9 million. Charlotte delivered total revenue of $2 million, with $1.5 million in walk-in business, which continues to drive a higher F&B spend per visit than The Colony. Our four venues generated just over $11 million in total revenue in Q2 of this year, down $400,000 versus Q2 of last year. We saw strong demand for events this quarter with revenue of $3.2 million, up $1.6 million or double compared to event revenue in Q2 of last year. As you can see here on Page 14, American Golf's total revenue for Q2 was just over $55 million, excluding management fee revenue and was up 12% to last year's second quarter. For the second quarter, we generated total company revenue of $86.7 million, up $12.8 million or 17.3% compared to last year's second quarter total company revenue of $73.9 million. When we break this down, the entertainment golf side of our business, which includes both Drive Shack and Puttery venues, generated total revenue of $15.7 million in Q2 this year, an increase of $4.1 million or 35.6% compared to $11.2 million in the second quarter last year. While total revenue was slightly down to last year, our Drive Shack venues drove a strong events business with $3.2 million in total event revenue, up $1.6 million or 106% versus Q2 last year. Total revenue generated by our three Puttery venues was $4.5 million this quarter, including events and was led by The Colony at $2.4 million, followed by Charlotte at $2 million. For the year-to-date period through Q2, our venue in The Colony delivered total revenue of $4.6 million, Charlotte generated $4.2 million, and as I just mentioned, D.C. at $100,000. On the traditional golf side of our business, American Golf generated total revenue of $70.8 million, including managed course reimbursements of $15.2 million. Excluding managed course reimbursements, American Golf total revenue increased $6.2 million or 12.5% compared to total revenue of $62.3 million in Q2 last year, which included managed course reimbursements of $12.9 million. The increase in total revenue was primarily due to higher event sales this year, which totaled $9.5 million, up $7.2 million or 311% versus the second quarter of last year."
}