{
    "symbol": "IMXI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 12:58:37",
    "content": " Net income of $13 million, down slightly; adjusted net income of $18 million, up 10% and adjusted EBITDA of $29 million, up 22%. And for the year, revenues of $547 million, up 19%; net income of $57 million, up 22%; adjusted net income of $70 million, up 22% and adjusted EBITDA of $105 million, up 21%. On Slide 9, looking at the top line agent and customer growth contributed to the 21% year-over-year increase in revenue reaching $154 million during the fourth quarter. On Slide 11, excluding certain intangibles like share-based compensation, transaction related expenses, amortization of intangibles, and the tax benefits related to these items, adjusted net income was $18 million, up 10% for the fourth quarter, but again, like on the previous slide, from an adjusted EPS perspective, we were up over 15%. For the full year, adjusted net income was $70 million, an increase of 22% for the full year. On Slide 12, adjusted EBITDA increased over 22% to $29 million for the quarter and it was up over 21% to $105 million for the year. Revenue to be in the $667 million to $688.5 million range, an increase of 22% to 26%; net income of $66.5 million to $69 million, an increase of 16% to 20%; and adjusted EBITDA in the $120 million to $124.5 million range, an increase of 14% to 18%. Revenue to be in the $140.9 million to $145.5 million range, an increase of 23% to 27%; Net income of $11.6 million to $11.7 million, a decrease of 1% to flat; and adjusted EBITDA in the $22.5 million to $22.8 million range, an increase of 9% to 10%. You may now go ahead. You may now go ahead. You may now go ahead. Within our guide for the year, weâ\u0080\u0099ve got revenue for La Nacional and this is for four quarters of the U.S. business and three quarters of the European business, revenue about $85 million, EBITDA about $4 million, and then net income about $2.5 million. And youâ\u0080\u0099ll see in our K, which weâ\u0080\u0099ve released previously, weâ\u0080\u0099re going to update the number in the K thatâ\u0080\u0099s going to say that we expect that business once fully integrated, which is going to take a little bit of time, about $80 million to $90 million in revenue, and then that same 9% and 11% EBITDA margins that we had mentioned in in previous K. So itâ\u0080\u0099s going to take a little while for us to work it up there, but I think weâ\u0080\u0099re optimistic and excited to get started. You may now go ahead. You may now go ahead."
}