{
    "symbol": "SGMO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 21:22:06",
    "content": " These statements include, but are not limited to, statements relating to the therapeutic and commercial potential of our product candidates -- the anticipated plans and time lines of Sangamo and our collaborators for initiating and conducting clinical trials, dosing and screening patients and presenting clinical data, advancement of our product candidates, advanced with the preclinical programs to the clinic, our investment focus and the sufficiency of our resources, our 2022 financial guidance, upcoming catalysts and other statements that are not historical facts. Regarding our wholly-owned Fabry disease program, we were excited to present additional preliminary data from our Phase I/II STAAR study at 3 separate medical conferences since the last call. I'm also pleased to share that this study has moved into the dose expansion phase, and we've begun dosing patients, including the first female patients in the study. After receiving endorsement from the Fabry Phase I/II study safety monitoring committee to progress to the dose expansion phase, 5 patients have been dosed in this expansion phase at the 513 be dose level, including the first 2 female patients in the study. Last month, we provided further update at the 29th Annual Congress of the European Society of Gene and Cell Therapy, ESGCT in Edinburgh, Scotland as well as the national organization for rare disorders nor conference in Washington, D.C. At both this event, we presented data as of July 21, 2022, presenting for the first time data across all 4th dose cohort in the dose escalation phase. In the Phase I/II PRECISION study of BIVV003, a zinc finger nuclease gene edited cell therapy candidate for the treatment of sickle cell disease, now wholly owned by Sangamo, we dosed the 6 patients. In addition with our partner, Pfizer, we've been accepted to participate in a poster presentation at ASH, December 10 to 13, 2022, providing updated clinical data on the Phase I/II ALTA study. We expect a significant portion of our operating expenses to be invested in the continued advancement of our lead programs, including Fabry Phase III planning activities, Phase I/II activity for sickle cell disease and TX200 and preclinical work in CAR T regs and genome engineering indications in the central loves system. Additional Phase I/II Fabry data in the first half of 2023, including additional ERT withdrawal data and the first data from the expansion phase and dosing of the third patient in the Steadfast Phase I/II study. We will be sharing as we pointed out in the first half of 2023 data from both additional data from the dose escalation as well as the early data from the expansion cohort patients, and this will include biomarker data as well as additional clinical data, the exact nature of which we will share in the first half, so in early 2023. Yes, one of our scientists, Bryan Zeitler from Sangamo presented at Prion 2020 earlier this year, data that Sangamo has generated in collaboration with the Broad Institute at the Massachusetts Institute Technology, where we were studying the ability of our zinc finger transcriptional repressors to be delivered to the brain of mice in a mouse model of preowned disease and repress the expression of prion protein and thus prevent the spread of pre-owned disease. We plan to share that information in early 2023, and we are collecting kidney biopsies also for patients who are naive or soon in the expansion cohort and that data will read out as the study progresses."
}