{
    "symbol": "SGMO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 21:15:03",
    "content": " These statements include, but are not limited to, statements relating to the therapeutic and commercial potential of our product candidates, the anticipated plans and time lines of Sangamo and our collaborators for initiating and conducting clinical trials, screening and dosing patients and presenting clinical data, advancements of our product candidates, advancements of preclinical programs to the clinic, our investment focus and the sufficiency of our resources, our 2022 financial guidance, upcoming catalysts and guidance and other statements that are not historical facts. We are well underway in dosing the first two cohort of patients with TX200 in our Phase 1/2 STEADFAST study in HLA-A2 mismatched kidney transplant, and we believe we remain in the lead in clinical progress amongst CAR-Treg companies. As we stated when the program unexpectedly transitioned back to us last year, we remain committed to the patients and investigators involved in the Phase 1/2 PRECIZN-1 study and expect to complete the study using funds we have already committed, but we'll make no material investments in the program going forward. As of the November 15, 2022 supplemental cutoff date, 13 patient across the dose escalation and dose expansion phases exhibited supraphysiologic Î±-Gal A activity sustained for over two years for the patient with the longest follow up. Now, digging into the data in a little more detail in the dose escalation phase, all nine patients treated in the dose escalation phase across the four doses exhibited elevated Î±-Gal A activity ranging from nearly fourfold to 67 fold of mean normal sustained for over two years for the longest treated patients as of the November 15, 2022 supplemental cutoff date. For naive and pesudo naive patients in the dose escalation phase, the Cohort 4 patient exhibited significantly higher levels of Î±-Gal A activity compared to those patients in lower dose cohorts. As of the 15, November 2022 supplemental cut-off date, the first three patient dose in the extension phase at the 5e13 vg/kg dose exhibited a rapid increase in Î±-Gal A activity following dosing sustained for up to 14 weeks as at the last date of measurement. This patient also exhibited an impressive 97% reduction in urinary podocyte loss up to six months, which coupled with the significant increase in Î±-Gal A activity along with reduction of lyso-Gb3 after dosing provides evidence of a potentially favorable effect on Fabry nephropathy. With regard to lyso-Gb3 level for naive and pseudo naive who have baseline level of lyso-Gb3 started high, patient experienced a 46% to 65% reduction in levels following treatment and continue to decrease for two patients until the data cutoff. In the Phase 1/2 STEADFAST study, our wholly owned TX-200 CAR-Treg cell therapy candidate for the prevention of immune-mediated rejection in HLA-A2 mismatched kidney transplantation from a living donor, the first two patient dose continue to do well. In December, we presented updated preliminary clinical data from the Phase 1/2 PRECIZN-1 study of BIVV003, a zinc finger nuclease gene editing autologous cell therapy product candidate for the treatment of sickle cell disease at ASH. And Nathalie, you reminded me earlier today that none of these patients are off ERT are on the 5e13 dose, they're all on the dose escalation phase."
}