{
    "symbol": "SGMO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 23:17:04",
    "content": " Building on a year of significant clinical and preclinical progress in 2021, Sangamo advanced multiple programs in the first quarter of 2022 as we continue our mission to create transformative genomic medicines for patients using our innovative technologies. In March, Sangamo dosed the first patient in our Phase I/II STEADFAST clinical study evaluating TX200, our wholly owned autologous CAR-Tregs cell therapy product candidate for the prevention of immune-mediated rejection in HLA-A2 mismatch kidney transplantation from a living donor. As Sandy outlined in his opening, Pfizer recently announced that in March of this year, the FDA lifted its clinical hold on the Phase III AFFINE trial, evaluating giroctocogene fitelparvovec, an investigational gene therapy for hemophilia A. Pfizer has announced that the voluntary pause remains in place until all necessary conditions are met, including approval of an updated drought protocols by regulatory authorities. In the first quarter, Sangamo also had significant and trailblazing development on our wholly owned TX200 CAR-Tregs cell therapy candidate for the prevention of immune-mediated rejection in HLA-A2 mismatch kidney transplantation from a living donor. On March 22, we dosed the first patient in our Phase I/II STEADFAST clinical study in what we believe is the first ever dosing of a human with a CAR-Tregs cell therapy candidate. We expect a significant portion of our operating expenses to be invested in continued progress of Elite programs, including Fabry Phase III planning activities, Phase I/II activity for TX200 and preclinical work in CAR-Tregs and CNS indications. The first quarter progress we have outlined demonstrates how this is coming together to create hope amongst the patients we're working to serve, a significant opportunity for our company and the potential for long-term sustainable value for our shareholders. We look forward to expected key milestones and catalysts throughout the year, including presentation of additional Phase I/II STAAR data for Fabry disease as well as the dosing of patients in the expansion cohorts. Thank you so much. Thank you so much. Thank you so much. Thank you so much. And it's true that while we haven't learned anything from the patients that have been dosed with TX200, I will point out that the investments that we've made in process development and manufacturing as well as obviously the biological expertise of the team that's working on this."
}