{
    "symbol": "OFG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 13:04:06",
    "content": " We are seeing a lot of activity on the reconstruction part and we're seeing a lot of projects going out there that are more government-driven, but are really creating an additional layer of momentum for the island, particularly for the middle class and low middle class in Puerto Rico and I think that's really encouraging and it should be sustainable for the next several years given the magnitude of those reconstruction funds. Your line is now open. We feel that loan growth is going to be funded by those core deposits that we have that excess deposits and so, at the end of the day, when you look at the Puerto Rico banking market today, it's very different than it was 20 years ago and it's very different from the same dynamics that you see in the banking market in the States, but I think in a way that is benefiting us at OFG and that is we only have three players, three main players and I think we all have excess deposits and we are all being very, very rational in our deposit strategies. And in terms of the commercial side, I think we will continue to see the strength of the business in Puerto Rico and we are not seeing any deterioration whatsoever for the commercial side of the loan book. Your line is now open. So, what we're seeing is that there is still quite a bit of a purchase market here in the island and there is quite a bit of an activity in spite of the increase in interest rates and that is because we still have a need for housing in the island and that's what some of the things that are being taken care of by the reconstruction fund. So, you might not see the residential mortgage market in Puerto Rico be as affected as in the States given that our residential prices have not gone as on a relative basis have not gone as high as pretty much all the states in the United States and what we're seeing is that there is still some good opportunities for purchase market here. As I said, this is a diverse -- geographic diversification strategy that we've been pursuing since 2017 and so what you will see from us is continue to be nationally diversified mostly focused on the small businesses in the States and building our team here in the island too -- I mean, I'm sorry not in the island building our team for the U.S. business also, that's also part of what we're doing because again I think it makes sense for us to diversify geographically. We're seeing a lot of business activity on the travels too, and I think Puerto Rico is also doing a much better job but marketing the island abroad. So, I think we're seeing the hospitality business as a growth business in the island and certainly there is a lot of Airbnb as you pointed out, but there is also -- in the last several years, there has been a quite a buildup on rooms, hotel rooms in the island in not only in the metropolitan area, but also around -- across the entire island and all those hotels are performing very well and should continue to serve the tourism business in the island. They've been doing -- in my mind, they're doing a good job, but keeping discipline -- fiscal discipline in the island and it's you see it in the States, you see it here in Puerto Rico, it's hard to keep fiscal discipline for governments across the United States as well as across the world. Your line is now open. Your line is now open."
}