{
    "symbol": "RNGR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 12:05:23",
    "content": " Despite experiencing seasonal and supply chain-related issues during January and February, Ranger finished Q1 with a quarterly revenue run rate of $140 million and corporate EBITDA margin of 10%. For the results, revenue for Q1 for the company was $123.6 million, up modestly from $123.1 million in Q4 despite weather and supply chain-related disruptions early in the quarter. At the segment level, revenue for High Spec Rigs increased from $59.5 million in Q4 to $64.5 million in Q1 and segment EBITDA increased from $8.8 million to $14.1 million. Starting with High Spec Rigs, and as always, on a quarter-over-quarter sequential basis, revenue was up 9% or $5.4 million, moving from $60 million to $65 million, with segment EBITDA margins moving up in tandem from 15% in Q4 to 22% in Q1. So the combination of the top line rate increases, and minimal increases in per unit expenses resulted in that sequential segment EBITDA margin growth and an adjusted EBITDA for the segment moving from $8.8 million to $14.1 million, a very healthy 60% sequential increase in absolute EBITDA. Here, Q1 revenues were up from $19 million to $20 million or 7%, driven primarily by growth in the coiled tubing business. EBITDA and margins moved in the opposite direction with EBITDA down $300,000 or 8% moving from $3.6 million to $3.3 million, while segment margins moved from 19% to 16%. We have experienced weather-related delays in April, but early in our northern operations, but we expect Q2 revenue to be between $135 million and $145 million with corporate EBITDA margins ranging between 10% to 12%. For full year 2022, we are increasing our guidance for revenue to be between $540 million and $580 million, with full year EBITDA margins of 11% to 13%. Based on the improvement in net debt in April that Brandon discussed, coupled with the strong performance of the business, by early 2023, we expect Ranger will have term debt of $10 million to $15 million, no revolver draw and a positive cash balance."
}