{
    "symbol": "CENX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 22:58:05",
    "content": " Starting on Page 3, we're very renounced that we achieved record quarterly adjusted EBITDA of over $105 million in the first quarter, a 30% increase over Q4. We do not foresee any research in Europe over the next few years, which instead remains at risk of further curtailment as energy prices in remaining production countries, continue to price above $250 per megawatt into 2024. You can see that the LME price of aluminum remains strong in Q1, with LME prices averaging $3,200 -- $327  in the first quarter and averaging that same price so far in Q2. Although, first quarter energy prices taken as a whole were relatively flat from Q4 levels, we have more recently seen significant price increases in MISO, driven by high global coal prices and spiking US natural gas prices, which seem to be driven by lower-than-average US storage levels and strong US industrial demand. While these markets remain dynamic and continue to trade in significant backwardation, we now expect higher US energy prices over Q2 by about $25 per megawatt. As we forecast on our last call, the Q1 realized LME of $2,762 a ton was up $158 versus prior quarter, while realized Midwest and European delivery premiums were relatively flat at $0.32 per pound and $343 a ton, respectively. Indian power prices in Q1 averaged $50 a megawatt hour, which is down about 9% versus Q4, while Nord Pool prices averaged $122 per megawatt hour or up 11% versus prior quarter. Lagged alumina index prices were up $85 per ton versus prior quarter and coke and pitch prices continued their upward trend, which realized prices increasing about 15% for each. For Q2, the lagged LME of $3,160 a tonne is expected to be up about $400 a tonne versus Q1 realized prices. Taken together, these aluminum price increases are expected to increase Q2 EBITDA by about $100 million versus Q1 levels. From the power perspective, factoring in the recent forwards, along with our realized quarter-to-date costs, we expect an overall increase in total energy cost versus Q1, with domestic prices up about 50% and Nord Pool prices relatively flat. In total, we expect all these items taken together will equate to an approximate EBITDA increase of $15 million to $25 million from Q1 levels for our Q2 results of about $120 million to $130 million. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}