{
    "symbol": "CENX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 23:10:16",
    "content": " In Q4 adjusted EBITDA with a loss of $12 million, which is an improvement of approximately $24 million over Q3 as the benefits of improving energy markets and cost cutting measures across our business improved results. In our markets in the U.S. and EU supply deficits widened last year, its high energy prices drove smelter curtailments especially in Europe, where 50% of remaining capacity has been curtailed due to high energy costs. As you can see from the graph on slide 5, EU energy prices remain in contango above $150 per megawatt hour, with significantly higher prices expected to return later in the year. Turning to regional premiums, strong aluminum demand in both the EU and U.S. have driven premiums higher so far this quarter with the spot Midwest premium, about $0.29 per pound, a 40% increase over Q4 levels and EU duty paid premium returning to levels above $300 per ton. Lagged realized alumina is expected to be $395 per tonne down slightly taken together the LME, delivery premium pricing and alumina changes are expected to decrease Q1 EBITDA by approximately $5 million versus Q4 levels. And then I compare the spot prices, and I use the sensitivities, I think on Slide 16, the conclusion we're coming to is, if you use spot pricing quarterly EBITDA generation goes to maybe $25 million to $30 million or $100 million to $120 million annualized, based on adjusting for spot for what's available. But we continue to believe as you look at natural gas storage in this country, natural gas production in this country, and as this has obviously come off significantly and pair that with increasing renewable generation, especially as some of these new projects start to hit and stronger coal production on the back end and utilities if you remember, this past year, we're a little bit short going into winter this year, they look much better situated and coal prices are quite high. And while we are quite confident that when you look at energy storage levels in the U.S. that we do see market conditions that should keep energy prices lower for longer here that's something you might understand, we'd like to be prudent and make sure that those are going to confirm for some period of time here."
}