{
    "symbol": "HIMX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 01:09:08",
    "content": " Before we begin the formal remarks, I’d like to remind everyone that some of the statements in this conference call, including statements regarding expected future financial results and industry growth, are forward-looking statements that involve a number of risks and uncertainties that could cause actual events or results to differ materially from those described in this conference call. Except for the company’s full year of 2021 financials, which were provided in the company’s 20-F and filed with the SEC on March 23, 2022, the financial information included in this conference call is unaudited and consolidated and prepared in accordance with IFRS accounting. On today’s call, I will first review Himax’s consolidated financial performance for the first quarter of 2022, followed by our second quarter 2022 outlook. Historically, our quarter sales are seasonally the low point of year due to the Lunar New Year holidays. This year, starting from February, additional factors also weighed in, mainly new lockdowns in China to contain the spread of Omicron variant and the geographical conflict erupting in Ukraine, both causing major disruption to our supply chain. Despite these additional challenges, our first quarter revenue, gross margin and EPS were all in line with the guided range issued on February 17, 2022. First quarter net revenues of $412.8 million decreased 8.6% sequentially, within our guidance of down 5% to 9%. Our gross margin came in at 47%, a decrease from the record high of 51.8% in the fourth quarter last year, but within our guidance of around 46% to 48%. Non-IFRS profit per diluted ADS was $0.697 a mid-range of the guidance of $0.67 to $0.73, but significantly up 81.5% from the same period last year. IFRS profit per diluted ADS was $0.663, a mid-point of the guidance of $0.635 to $0.695, but significantly up 73.1% year-over-year. Revenue from large display drivers was $110.6 million in Q1, a decrease of 11.5% sequentially but an increase of approximately 60% year-over-year. TV revenue was flat sequentially, anchored by high-end and large-sized TV shipments to key account, despite the first quarter being a seasonally low period and the continued soft TV demand. After consecutive quarters of strong growth, both monitor and the notebook IC sales decreased sequentially as we guided, on the backdrop of slowing end market sell-through. Moving on to our small and medium-sized display driver segment, revenue was $258.5 million, a decline of mid-single digits sequentially, but an increase of more than 25% year-over-year. In Q1, the automotive driver segment became our single largest revenue contributor, representing over 25% of total sales. The revenue growth in automotive driver IC was backed by comprehensive design-win coverage across the panel houses, Tier-1s and the car makers alongside increased capacity for both discrete DDIC and TDDI. Automotive DDIC sales, which is still predominant portion of our automotive IC revenue, enjoyed decent first quarter growth, up more than 20% sequentially with demand continuing to outpace supply. Given our leadership position in automotive driver IC, comprehensive product offerings and the growing vehicle different market, we expect sustainable, robust growth in our automotive business with further market share gains on top of fast expanding market. However, capital revenue was up low-teens on a year-over-year basis due to strength in our TDDI sales, which grew low single digit from the proactive adoption of all leading non-iOS tablet names. In line with our guidance, first quarter smartphone revenue declined double digit sequentially. The smartphone market continued to be challenged by sluggish demand on expected lockdowns in China and the geopolitical tension, resulting in significantly reduced the demand visibility at panel houses and OEMs, which have started to reduce their IC inventory. As we mentioned on last quarter’s call, we expected a portion of the first quarter decline due to our strategical rate initiated product transition for key customers’ new designs, which led to less production output during Q1. First quarter non-driver revenues came in better than expected at $43.7 million, a sequential decrease of low-teens but up around 25% year-over-year. Our Tcon business was slightly down mid-single digits sequentially, but increased more than 50% year-over-year, a reflection of better mix towards high-end product area, such as the 4K, 8K TV, gaming monitor, low-power notebook and automotive Tcon. Non-IFRS gross margin for the first quarter was 47%, a decrease from 51.8% of last quarter, but much higher than 40.2% of the same period last year. First, our cost of goods sold for Q1 reflected the higher foundry price from the previous quarter. Our non-IFRS operating expenses for the first quarter, was $44 million, down 9.3% from the previous quarter but up 12.3% from a year ago. As a reminder, the sequential operating expenses decrease was caused by a onetime cash bonus at the end of December last year to further reward employees for our last year’s remarkable financial results. IFRS operating expenses was $51.5 million for the first quarter, down 8% from the preceding quarter, but up 30.5% from a year ago. The 2021 annual bonus compensation, including RSUs and the cash awards totaled $74.7 million, out of which $24.8 million was immediately vested and recognized in the third quarter of 2021. Non-IFRS after-tax profit was $121.9 million or $0.697 per diluted ADS, decreased from $148.4 million or $0.849 per diluted ADS last quarter, but significantly higher than $67.1 million or $0.384 for the same period last year. We had $447.1 million of cash, cash equivalents and other financial assets as of March 31, 2022 compared to $245.8 million at the same time last year and $364.4 million a quarter ago. Our quarter end inventories as of March 31, 2022, were $253.1 million, up from $198.6 million last quarter and up from $114.9 million a year ago. Accounts receivables at the end of March 2022, was $442.2 million, up from $410.2 million last quarter and up from $289.1 million a year ago. Just prior to today’s call, we announced an annual cash dividend of $1.25 per ADS, totaling approximately $217.9 million and the payable on July 12, 2022. The payout ratio is 50% of net profit of last year, which is lower than our average payout ratio historically. As of March 31, 2022, Himax had $174.3million ADS outstanding, unchanged from last quarter. On a fully diluted basis, total number of ADS outstanding for the first quarter was $174.8 million. Now, turning to our second quarter 2022 guidance, we expect second quarter revenue to decline 16% to 20% sequentially. Against the backdrop of challenging market conditions and short-term uncertainty, for the second quarter, we expect a sequential decline in gross margin, mainly because our cost of goods sold this quarter represents pricing from previous quarters when foundries were still raising their prices. However, with both foundry and back-end pricing already stabilizing, our cost of goods sales moving into the second half will unlikely continue its upward trend over the first half of the year. We anticipate Q2 sales to be the low point of this year for full year, despite the murky short-term market condition we remain upbeat of our top line for 2022, supported by the automotive business and two new revenue streams, which all enjoy solid business visibility. For the automotive business, regardless of the macroeconomic concerns, we are targeting sales to double from last year, which is already more than doubled from the year before. For the second quarter, large display driver IC revenue is projected to be down double-digits sequentially due to production disruptions in the midst of China’s lockdowns, coupled with weakness in consumer demand. We expect monitor IC sales to also decline sequentially, reflecting the overall market softness in the second quarter. Yet on a year-over-year basis, monitor IC sales are expected to increase by more than 60%. This demonstrates our leading position across major customers for their higher-end displays and premium monitor models, as well as our ability to offer total solutions covering display drives and advanced Tcons. Turning to the small and medium-sized display driver IC business, in the second quarter, revenue is expected to decline mid-teens sequentially. Smartphone sales are set to decline single digits sequentially, while sales for tablets are expected to decline by double digit, both due to our customers’ efforts to reduce their near-term inventory. The result of the sudden deterioration of focus visibility from their customers on the backdrop of China’s ongoing city lockdowns, weaker macroeconomic environment and slowing end market demand. First, on the automotive segment, as Eric mentioned earlier, automotive overtook other sectors to become our largest revenue contributor during Q1, representing over 25% of our total sales. Despite strong consumer demand, the global car market continues to suffer from ongoing key component shortages and poor congestion, which are hurting automotive sales worldwide. We are uniquely suited to continue to expand our footprint in this lucrative market, backed by secured multi-year foundry capacity and customer purchase agreements, as well as strong design coverage from all major panel houses, Tier 1s, automotive OEMs. For the second quarter, we expect the automotive DDIC sales, which are still much larger than those of TDDI and AMOLED to be flat to slightly up sequentially, but up more than 90% year-over-year. While we expect our automotive DDIC output to increase quarter-over-quarter for the rest of the year, the severe foundry capacity shortage continues to be a constraint for our automotive DDIC business. Q2 sales for automotive TDDI are expected to decline single-digits sequentially as a side effect from the Russian-Ukraine War and Chinese city lockdowns, which have led to postponement of certain new projects, mass production timetable. For tablet, we expect sales to fall double digits sequentially from the high base in the first quarter driven by this slowdown in orders as our customers purchase their inventory. Turning to the e-paper driver business, another product in our small and medium-sized driver lineup, our e-paper business is set to grow more than 120% sequentially, representing around 2% of total sales in Q2. On a year-over-year basis, e-paper business is expected to increase significantly by around 300% due to a growing number of awarded projects with leading customers for their ASIC product shipment. We continue to collaborate with world-class e-paper customers for certain ASIC projects with increased R&D efforts spent on their next-generation products towards larger size, higher resolution and colored e-paper displays. Backed by long-term supply agreements and lasting partnerships with industry-leading customers, we expect to capture significant market share in the ever expanding e-reading and e-signage markets throughout 2022. In addition, our flexible AMOLED driver and Tcon for automotive display successfully ramped up for customers’ flagship EV model in Q1. In the light of serious constraints on AMOLED display driver capacity in the next few years, we have secured meaningful capacity in this area with our secured capacity fully booked up by leading panel makers. Finally, for AMOLED TV and notebook sectors, we are encouraged by our progress in the last few quarters with designed made for leading customers and panel houses next-generation products. In the second quarter, our AMOLED business, including key content driver is expected to account for around 4% of total sales and is slated for strong growth in the next few years. Starting with an update on timing controller, we anticipate Q2 Tcon sales to grow low single digit sequentially, a result of higher shipment of Tcon for monitor outlet tablet and automotive sectors. After years of commitment and R&D efforts, we have successfully positioned ourselves towards high-end areas, including 4K/8K TV, high-frame rate gaming monitor, low-power notebook, local dimming Tcon for automotive as well as OLED for tablet and automotive. As OLED displays get traction in the market due to technological advantages, we’ve been collaborating closely with major panel houses to joint-develop an industry-leading AMOLED tablet display solution. Another area we are gaining momentum with our AI total solution is the automotive meter reading, sorry, AMR application, where we have seen surging adoption across the continents over the past few quarters. As I mentioned last quarter, metaverse development is still in early stage, yet Himax is well positioned with years of research and development. For non-driver IC business, we expect revenue to be up low single digits sequentially in the second quarter. Tony, I think we actually mentioned that we feel confident that we should be able to achieve at least a flat 2022 total revenue versus the high level of last year. And also, we have two major new revenue stream kind of product line, right, being AMOLED drivers or related products and also ultra-low power AI sensor, this new revenues, which didn’t exist the year before. But if I take my existing projection for my customer for the first group, and I put in a number into my whole year’s projection and if I assume my whole year revenue to be flat compared to last year, then that implies the second group, i.e., the low visibility group. However, the good news is that we actually recently analyzed customers’ inventory level, rather thoroughly and particularly inventory level towards the end of the second quarter across this second group of products. And we come to an easy conclusion that the panel customers’ inventory towards the second quarter will be unusually low, right. But given the fact that our panel customers shipment during through to the low season are actually slightly down, but they are making regular shipments without major disruption, while their inventory control has resulted in a very, very unusually low inventory level towards the end of the quarter. So, actually – so what I am trying to say is if we predict the whole year revenue to be flat, it actually implies the second group that will be the visibility consumer electronics group to suffer from a pretty severe decline year-over-year, while we are actually seeing very promising signs that you may actually do better than that. That means our supply will still be lower than the demand for the second half, and that is another reason why we feel very confident about the visibility of the first group. And there is a follow-up should be on the gross margin side because it seems like you are like positive from a volume recovery and potentially, as you mentioned, like the first group product like long visibility as well. Now, if I look at the supply side, we have been through at least 0.5 year, two quarters, four quarters of rising cost of goods sold that leads directly to our gross margin erosion. So, if you look at our second quarter guidance, I can tell you, our guided gross margin decline is pretty much the same as our expected cost of goods sales increase percentage-wise, right. Now, how is the cost of goods sold going to be like in the second half, I think we are seeing very much foundry prices have stabilized. What happens is that I think everybody, our customers included, recognize the fact that if you look ahead into next year or the year after, for mature processes, the foundry capacity is still likely to be tight. And I mentioned earlier, right, towards the middle of the year, our customers’ inventory level is look to be much lower than normal. So, I guess our gross margin for the second year will depend largely on our final product mix, which obviously is harder to predict, especially given the fact that, as I mentioned in the second group, the visibility is low, meaning the revenue, the actual revenue, the actual outcome can come higher or lower than our numbers right now. I think my first question is regarding your – I think, Jordan you had mentioned quite a few times about the inventory level as your customers has been – could be – go to a pretty low level by the end of this quarter. But when we look at your inventory level in Q1, I think inventory has increased another 25% from 4Q and then more than double from a year ago. Let me just say it’s not a good idea to compare the inventory level with loss of last year because last year was unhealthy in the sense that we had literally no finished goods inventory, and our customers are chasing us for shortage like on a daily basis, right, from everywhere. If you look at our history, let’s say, we look at the past 5 years – excluding last year, right, our last 5 years to 10 years, our inventory days, meaning inventory compared to cost of goods sold, the range is in between 90 days to about 110 days. So, we are not worried about our Q1 inventory because particularly given the fact that we are still feeling the capacity, foundries capacity will remain short at least in the next year or 2 years. Now, with the expected dip of Q2 revenue, our end of Q2 inventory will still be higher than north of the end of the first quarter. But I said earlier, on the other hand, our customers’ inventory level, IC inventory level will be lower than usual. And in fact, we think it’s probably still appropriate that we take a slightly more aggressive inventory preparation approach compared to normal, given the – our view that the foundry capacity in any foreseeable future will still remain tight. If the foundry supply is going to remain tight for the next few years, why the foundry pricing will not further increase in the second half, especially I think in the past few days, we have saw the news about one of the largest foundry in the world has been raising the price in 2023. Currently, they sent notice at the same time to every customer that’s starting the beginning of next year, they are going to raise their price by 6%. And we are hoping through TSMC’s raising their price, they get to squeeze out some of the weaker demand that we can enjoy business supply where we actually welcome such price increase. So, I am certainly hoping and I don’t believe other foundries for their mature nodes will follow TSMC’s price hike, further price hike because they have already had their price hike much earlier on. That is then maybe another story because again, the foundry in the foreseeable future, I think at least 1 year to 2 years for mature nodes is going to still be tight."
}