{
    "symbol": "HIMX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 13:45:06",
    "content": " Revenue from large display drivers was $43.5 million in Q4, an increase of 5.3%  sequentially, exceeding our prior guidance of flat from last quarter. Large panel driver IC sales accounted for 16.6% of total revenues for the quarter, compared to 19.3% last quarter and 27.7% a year ago. Moving on to our small and medium-sized display driver segment, revenue was $177.4 million, an increase of 25.5% sequentially, and ahead of our guidance of a single digit increase, primarily a result of increasing shipment of TDDI in all three sectors, namely smartphone, tablet and automotive. Despite the challenging macro environment, our fourth quarter revenue for the tablet was up more than 100% sequentially, thanks to the strong shipment in higher-end TDDI products, an illustration of our leading solutions being adopted by more customers for their next generation products, supporting larger sized, high frame rate displays and high precision active stylus features. Meanwhile the AMOLED total solution sales, including TCON and DDIC, increased mid-teens quarter-over-quarter and accounted for more than 8% of total sales, mainly attributable to our tablet AMOLED total solution supporting the mass production of premium tablet models for a global leading customer. Automotive driver business once again represented the largest revenue contributor with over 30% of total sales in the fourth quarter, a result of our comprehensive product coverage and increasing automotive TDDI design-wins across panel houses, Tier 1s and auto brands. Our IFRS operating expenses for the fourth quarter were $52.5 million, a decline of 27.9% from the previous quarter and down 6.2% from a year ago. Fourth quarter IFRS operating income was $27.5 million, or 10.5% of sales, versus 1.8% of sales in the last quarter and 39.4% of sales from a year ago. Non-IFRS operating income was $34.5 million, or 13.1% of sales, compared to 14.5% last quarter and 41.1% same quarter last year. Revenue from large panel display drivers totaled $264 million in 2022, a decline of 33.7%  year-over-year, representing 22% of total sales, as compared to 25.7% in 2021. Small and medium-sized driver sales totaled $778.9 million, a decrease of 19.2% year-over-year, representing 64.8% of our total revenues, as compared to 62.3% in 2021. Non-driver products sales totaled $158.4 million, a decrease of 14.7% year-over-year, representing 13.2% of our total sales, as compared to 12.0% a year ago."
}