{
    "symbol": "HIMX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 12:59:02",
    "content": " Welcome to the Himax Technologies, Inc. Third Quarter 2022 Earnings Conference Call. Before we begin the formal remarks, Iâ\u0080\u0099d like to remind everyone that some of the statements in this conference call, including statements regarding expected future financial results and industry growth are forward-looking statements that involve a number of risks and uncertainties that could cause actual results or events to differ materially from those described in this conference call. On todayâ\u0080\u0099s call, I will first review the Himaxâ\u0080\u0099 consolidated financial performance for the third quarter 2022, followed by our fourth quarter 2022 outlook. Our third quarter revenues and the EPS beat the guidance, while our gross margins was at the mid-range of the guidance issued on August 11, 2022, despite macro headwinds continuing to challenge our business. Third quarter net revenue of $213.6 million decreased to 31.7% sequentially, but exceeded our guidance of a decrease of around 35% to 39% sequentially. Gross margin came in at 36.3%, a decrease from 43.6% last quarter, but at the mid-range of the guidance range of 35.5% to 37.5%. Revenue from large display drivers was $41.3 million in Q3, a decrease of 39.8% sequentially and below what we typically sees on a seasonal basis. Large panel driver IC sales accounted for 19.3% of total revenues for this quarter, compared to 22.0% last quarter and 27.9% a year ago. Revenue was $141.4 million, a decrease of 29.9% sequentially, primarily a result of the prolonged inventory reduction effort of our smartphone and tablet customers. Despite the challenging macro environment, we continue to gain traction with our leading driver solutions being adopted by more customers for their next-generation products. As an illustration, our proprietary tablet TDDI solution once again was adopted by Xiaomi for their latest premium tablet and 2-in-1 laptop, where our TDDI supports larger sized, high frame rate display and high precision active stylus features, as well as the most touch channels in the market to offer superior touch sensitivity. Meanwhile, for AMOLED business, our global leading customer had more AMOLED premium tablet models commence mass production this quarter where we provides the total solution covering DDIC and Tcon as their sole source supplier. In the third quarter, our AMOLED sales, including DDIC and Tcon were up more than 45% sequentially and accounted for more than 8% of total sales. Q3 automotive business was once again the largest revenue contributor, representing over 35% of total sales. However, Q3 automotive sales declined double-digit sequentially as guided as customers continued with strict inventory control measures to de-stock from the accumulation during China city lockdowns in the previous quarter. Yet, on a year-over-year basis automotive IC sales increased more than 80% for the nine months ended September 30, 2022, a result of our comprehensive product coverage and increasing design-wins for our automotive TDDI. For our e-paper business, another product in small and medium-sized driver lineup, sales declined double-digit quarter-over-quarter due to customers downsizing their annual business plans amid a weak consumer electronics market. Small and medium-sized driver IC segment accounted for 66.2% of total sales for the quarter, compared to 64.5% in the previous quarter and 59.9% a year ago. Third quarter non-driver revenue was $30.9 million, down 26.9% from a quarter ago. As expected, our Tcon business was down double-digit sequentially, pressured by lower shipment for TV, monitor and notebook markets. Yet, Tcon shipment for automotive enjoyed decent growth and we anticipated its business momentum to accelerate in the coming quarters. Non-driver products in Q3 accounted for 14.5% of total revenues, as compared to 13.5% in the previous quarter and 12.2% a year ago. Non-IFRS gross margin for the third quarter was 36.3%, a decrease from 43.6% of last quarter. As we previously reported, the incurred charges from agreements we entered with foundries and backend suppliers for securing capacity were the predominant factors that adversely impacted our margin profile in the third quarter. Our non-IFRS operating expenses for the third quarter were $46.7 million, slightly up by 3.8% from the previous quarter and 5% from a year ago. The sequential increase was caused mainly by increased salary expenses, while year-over-year expenses increased because of higher inventory, I am sorry, higher salary and R&D expenses. IFRS operating expenses were $72.9 million for the third quarter, up 38.5% from the preceding quarter and 6.4% from a year ago. The higher IFRS figures were mainly due to the tranche of annual bonus compensation, which we awards employees at the end of September each year. The 2022 annual bonus compensation including RSUs and cash awards was in line with the guidance we mentioned on its last earnings call that totaled $39.6 million, out of which $18.5 million or $8.5 per diluted ADS was immediately vested and recognized in the third quarter of 2022. Non-IFRS after-tax profit was $29.8 million or $0.17 per diluted ADS, decreased from $76.8 million or $43.9 per diluted ADS last quarter. We had $227.9 million of cash, cash equivalents and other financial assets as of September 30, 2022, compared to $250.8 million at the same time last year and $461.6 million a quarter ago. We had $48.0 million of long-term unsecured loans as of the end of Q3, of which $6 million was the current portion. Our quarter end inventory as of September 30, 2022 were $410.1 million, up from $337.3 million last quarter and up from $160.9 million a year ago. The excess customer inventory, particularly in consumer electronics, adversely affected our sales, resulting in high inventory levels as our production always begins months in advance. Accounts receivable at the end of September 2022 was $253.3 million, down from $371 million last quarter and from $400.9 million a year ago. DSO was 74 days at the quarter end, as compared to 100 days a year ago and 93 days from last quarter. As of September 30, 2022, Himax had 174.4 million ADS outstanding, little changed from last quarter. On a fully diluted basis, total number of ADS outstanding for the third quarter was 174.7 million. Non-IFRS gross margin is expected to be around 31.5% to 33.5%, depending on the final product mix. Against this backdrop, Himaxâ\u0080\u0099s business visibility remains limited, especially in consumer centric products. Judging by our current business pipeline and production plan, we believes our inventory level has reached the peak at the end of the third quarter. Looking into Q4, our gross margin is still under pressure due to price erosion from high inventory offloading, while the cost of goods sold remains high as the inventory was sourced when foundry and back-end pricings were still at high levels. Despite the soft demand, we remained upbeat about our topline growth from several revenue streams that we consider our high visibility group, notably automotive, AMOLED, timing controller and WiseEye AI image sensing. In the automotive business, we expect TDDI sales momentum to pick up starting Q4 from the trough in the third quarter. For automotive DDIC, however, customers are still in the process of offloading their inventories accumulated intended for the second quarter production, which was severely disrupted by the widespread China city lockdowns. We believe our 2022 full year automotive business growth will reach around 50% despite the challenging environment and expect growth momentum, especially for TDDI to extend into 2023 for another stellar year of strong growth. Separately, its WiseEye AI image sensing and AMOLED business are poised to deliver an impactful contribution next year. We expect WiseEye sales to grow nicely, backed by strong business pipelines from a wide variety of new AI application adoptions. Among our AMOLED deployments, our AMOLED for smartphone will commence as a new sales stream next year on top of the current AMOLED for tablet and automotive sales. Second, the gross margin for these segments is above our corporate average, lending support to a more sustainable higher margin profile for us. On a positive note, we do see TV panel prices showing signs of stabilization as customers have started to replenish inventory particularly in mainstream models, leading to positive momentum in our TV driver sales which are set to increase single-digit sequentially in Q4. Conversely, the downward trend in our IT segment lingers on with further declines expected in both notebook and monitor sales in the fourth quarter on the backdrop of customerâ\u0080\u0099s continuous tight inventory control measures and the sluggish economy. Sales for automotive TDDI are poised to grow by double-digit, while those for traditional driver IC are set to decrease single-digit from the last quarter. Smartphone driver IC revenue is set to be slightly down sequentially, a result of lengthy inventory off-loading cycle amid soft demand and limited visibility across those channels. Tablet driver IC revenue, however, is projected to increase double-digit sequentially driven by replenate -- replenishment momentum from leading customers. As we have previously discussed, automotive driver sales are now our largest revenue contributor and set to represent over 35% of total sales in Q4. As the leader in automotive display IC market, we not only offers the most comprehensive automotive product portfolio in the industry, ranging from traditional DDIC to new technologies such as TDDI, local dimming Tcon, LTDI and AMOLED, we also the preferred partner that panel customers like to work with, especially those looking to focus more on growing their automotive business in order to compensate for the soft consumer electronic business. As the pioneer of mass production for automotive TDDI and backed by rapid expansion of automotive TDDI adoption, we expect our automotive TDDI sales will be one of the primary driving forces for our long-term business growth for years to come. To-date we have acquired more than 200 automotive TDDI project awards with only a small portion currently in mass production, implying an enormous growth opportunity ahead. Meanwhile, the Chinese Government continues to support the NEV industry with stimulus programs, which may accelerate the adoption of premium automobile displays that adopt TDDI. Moreover, we are well positioned with suppliers in support of our automotive segment growth, leveraging diverse foundry sources for optimal operational efficiency and benefit. Furthermore, we are the first in the industry to launch the cutting edge LTDI or Large Touch and Display Driver Integration automotive display solution specially designed for the next-generation extra-large-sized automotive displays, which are typically larger than 30 inches. For smartphone, much of our shipments to key customers for their next-generation new designs have been delayed amidst deteriorating demand. As for tablet, shipments are on the rise for premium models that adopt high end tablet TDDIs and advanced AMOLED tablet solution, of which we offer both DDIC and Tcon to certain leading brands. Q4 sales for those premium tablet solutions are expected to increase more than 100% sequentially and we believe momentum will accelerate into next year, supported by demand for advanced specifications and higher end displays. Our e-paper driver business is expected to increase double-digit quarter-over-quarter, stemming from increasing shipment of a large size display to a leading customer as their sole supplier. We continue to collaborate with world-leading customers for certain ASIC and Tcon projects with increased R&D efforts spent on their next-generation products toward larger size, higher resolution and colored e-paper displays. Our AMOLED business, including Tcon and driver, is slated for strong growth in the next few years. For AMOLED tablet product, we provide both AMOLED driver and Tcon, and are the sole source supplier for one global leading brand. For automotive AMOLED display, we continue to win project awards for our flexible AMOLED driver and Tcon with both conventional car makers and NEV vendors. Finally, we are making good progress with leading panel houses for the development of AMOLED display drivers for smartphone, TV and notebook applications. As a reminder, for smartphone AMOLED display driver, we already have secured meaningful capacity and continue to look to expand it moving forward. Starting with an update on timing controller, we anticipate Q4 Tcon sales to increase by high-teens sequentially, bolstered by higher shipment of automotive products for both LCD and AMOLED displays. For the AMOLED display market, we successfully commenced production of AMOLED Tcons for tablet and automotive. We also made good progress strategically with leading panel makers on AMOLED notebook Tcon, which features advanced eDP1.5, providing higher resolution, higher refresh rate, as well as improved image quality to the notebook. Next on LCD display for automotive, our position remains unchallenged in automotive Tcon for local dimming technology, which not only enhances display contrast for better viewing and driver safeguard under various ambient light conditions, but also provides effective power saving, critical for EVs and larger sized displays. With years of strenuous work on this high entry barrier technology, we have won numerous awards from various OEMs, Tier-1s and car makers premium new car models, some of which have already commenced mass production. Additionally, we are undertaking new design developments supporting even larger panel sizes and higher resolution with more named customers. Now switching gears to the WiseEye AI total solution, which incorporates Himaxâ\u0080\u0099s proprietary ultralow power AI processor, always-on CMOS image sensor and CNN-based AI algorithm. For WiseEye business for notebook, we continues to support a range of Dellâ\u0080\u0099s new models where Himax remains the key supplier for leading-edge ultra power -- ultralow power AI processor and always-on CMOS image sensor. In order to capture the vast opportunity presented in the emerging notebook AI application market, we have extended deployment of in-house development of new algorithms to advance our AI capabilities, while partnering with leading notebook CPU players aiming to expand our partnerships with leading global laptop names to propel this business forward. In addition to features such as human presence, look-away and onlooker detections, we are also working on a variety of enriched new AI features and use cases to broaden possible applications with end customers for next-generation smart notebooks. Aside from notebook, our highly integrated WiseEye total solution, featuring ultralow power tinyML vision AI in a tiny form factor, is a perfect fit for many resource-constrained and battery-powered end point applications, a new AI area which is now ardently explored by AI communities. Moreover, we have additional WiseEye AI customer engagements in areas such as video conference device, shared bike parking, medical capsule endoscope, automotive, smart office, battery cam and surveillance, just to name a few. To that end, during the upcoming CES 2023, several of our proprietary ultralow power WiseEye AI solutions will be showcased jointly with our ecosystem partners and customers in various applications, including smart home, smart agriculture and surveillance, just to name a few. Also on display will be applications embedded with our Intelli-Sensing Module, a solution that offers numerous pre-trained machine learning modules -- machine learning models with a plug-and-play design that makes it possible to drastically reduce the significant entry barriers for AI or system developers in deploying computer vision and machine learning AI capabilities to the end point devices. Furthermore, we are more committed than ever to strengthening our WiseEye product roadmap and retaining our leadership position in ultralow power AI processor and image sensor for end-point AI applications. The WE2 AI processor features Arm based Cortex CPU and Ethos NPU, rich sets of sensor control interfaces, industrial grade security and cryptography engines and multi-layer power management architecture to offer superb tinyML computing performance, optimal energy efficiency and best-in-case security and privacy assurance. The WE2 AI processor offers 40% peak power savings and 30-fold inference speed, implying over 50 times power efficiency on a per inference basis compared to the first-generation WE1, which is already leading the industry among AI processors aiming for similar target markets. First, on our leading-edge front-lit LCoS microdisplay that features light-weight, small form factor and full color with unique characteristics of high illumination and low power consumption. One notable highlight in Q3 is a design-win with a partner for new AR glasses with our front-lit LCoS microdisplays, which assists hearing-impaired people through audio to text translation that is projected onto the AR glasses on a real time basis. In addition, we also started shipment of front-lit LCoS microdisplay in Q3 for a customerâ\u0080\u0099s assisted-reality type hands-free head-mounted device that sits below a personâ\u0080\u0099s line of sight to assist workers to access real-time working information. On 3D scanning for object reconstruction, our 3D sensing technology, which incorporates both our 3D projector and 3D decoder, is being deployed by a leading customerâ\u0080\u0099s 3D scanning device for the purpose of generating real-time digital twins, avatar and 3D environment surroundings that ultimately help users transit and connect seamlessly between physical and digital worlds. While still early in the lifecycle for optical and metaverse related products, the ongoing commitment by the worldâ\u0080\u0099s technology leaders alongside expanding interest in its potential suggests this next-generation technology is poised for significant growth in the years to come. For non-driver IC business, we expect revenue to increase high-teens sequentially in the fourth quarter. But at the same time, I think, our customers are still asking us to lower the price as well. You are right to say that the foundry is kind of lowering their price, although, they, I mean, in doing so they do expect volume from customers in exchange. Now the thing is, we are burdened we as an industry and Himax including, we are burden with relatively high inventory, meaning our capability to give significant orders to foundry right now is quite limited. So I think -- so actually I think on a negative note, you are likely to see across the industry gross margin continued to be under pressure, because we are just offloading our inventory, which were sourced previously at a higher cost, it doesnâ\u0080\u0099t matter really how foundry is lowering their price right now. However, for the products where the industry enjoys better visibility, certainly, we continue to place new orders to foundries. So on those area, typically, what we see is that, they are priced down is -- will they become less aggressive, because they know actually, you do have to continue to place older, because you donâ\u0080\u0099t have much inventory burden and the market prevents visible and relatively strong. However, I think, we are, I feel quite confident on how we call the strong visibility group in my prepared remarks and we also mentioned the same in last quarter. They are basically four major things in the next few years, which we call high visibility group in the automotive business in general and timing controller business and AMOLED business, and lastly, our WiseEye ultralow power AI business. After this destocking cycle is complete, I think, we will emerge a better position -- a better company gross margin wise, with supported by this so-called high visibility group of products. And maybe a housekeeping question is like in the past two years, I think, most of the semi and tech companies have higher loss of talented employees and face -- mostly facing quickly deteriorating outlook in the past few quarters. Now how do we do that, I think, again back to my so called high visibility group, for those product lines we do need to continue to invest. So, again, I think, the bottomline is, given the high -- the low visibility for the business, our target is to keep a flat OpEx expense next year compared to this year, while still continuing to invest in those, especially for those high visibility group of product lines. So I think on the one hand, I mean, our Chinese customers do -- would certainly love to see are using more Chinese foundries. On the other hand, I mean, even though our Chinese customers, they are -- other international customers they do need to target non-China customers and so some of those -- for many of those non-China customers, they are, I mean, seeing the uncertainty, again, this current intention, the prevailing tension between China and U.S. So I think the good news is, is therefore for guys like us, China is such a big foundry place, it doesnâ\u0080\u0099t matter how you strategize your foundry position, you -- I am talking about my customers or even end customers, you can really get away with utilizing or depending, calling, on Taiwan if you are so foundry other place. So I think, going looking forward, we are going to continue to called on Taiwan as our primary source of foundry supply, while continuing to spent our China and Korean foundry basis. In certain area they build capacity, we do have -- they do have the track record of technology and that is suitable for us, likewise for China. But in China, we are now doing -- actually across the four product quite a diversified line of product areas covering our smartphone, tablet, to a lesser extent TV and monitor. So throughout the years, they have -- we have been dealing with Chinese competition all the time and certainly is still intensified over the last few years, because again Chinese Government is giving it another push. So regardless we are still doing our best to support our China customers, both in terms of technology, and service and capacity and whatnot. I think itâ\u0080\u0099s -- the fact that China wants to localize more, doesnâ\u0080\u0099t mean they would -- they are good to stop using foreign suppliers, other suppliers. So our strategy is to upgrade our technology and our offering and try to where possible dominate in certain applications, for example, automotive, where our position remains quite dominant and Chinese competition is still having a hard time trying to get it, because the qualification process, the technology requirements and the willingness for adoption from Tier 1s and end user customers are all higher. The barriers are much higher even though Chinese Tier 1s, because many Chinese Tier 1s, they still have to deal with international end customers, even for dealing with local end customers. Both segments share one common characteristic, which is both have -- in both local Chinese end brands to master a major market share globally. Whereas if you look at notebook and monitor in comparison, where Chinese end customers presence is less compared to the two sectors, I mentioned earlier. And lastly, TV and smartphone where Chinese end customer do -- together command a pretty sizable market share. So that is one thing and the other thing is we are better specified into new businesses such as in our optics, such as our WiseEye, where really the whole competition is not really an issue as such. As a final note, Eric Li, our Chief IR/PR Officer will maintain investor marketing activities and continue to attend investor conferences."
}