{
    "symbol": "HLGN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-23 14:02:06",
    "content": " With the funding from Woodside combined with the application of the DOE award, we have contracts in place for our first module to provide $89 million in gross contractual value, which will translate to approximately $85 million of net revenue that we expect to recognize over a multi-year period. In total and considering amounts previously recognized in Q4, 2021, we are currently estimating an approximate $35 million loss on our first module, which reflects the fact that our total project cost estimates exceed the total of revenue to be earned under the Woodside contract and cash we received under the DOE award. So in terms of the steps, the steps on the path to getting contracts signed, early on, we enter discussions with prospective customers, we've gotten so much inbound inquiry, and I think that one of the things that we're most excited about is over the last several months even we've seen more interest from, frankly, sectors that we had not even considered when we first embarked on this effort. And so we, I would say that, in general, are in various stages with different prospective customers across that range of inquiry, ranging from projects entering the Q and getting their solar resource assessed, all the way to actually structuring contracts and looking at specific module locations that we're progressing negotiations on. And then in terms of whether this is representative, I think we've always message to the market that we do expect our initial projects to be loss making projects, which I think is typical whenever you're scaling up new technology, but we're actually very fortunate to have these great partners leaning forward with us because I think it's unusual, frankly, to have new technology companies have so much of their first projects fully funded, or the majority of them funded by prospective customers. And it's the discussion that's on everybody's lips right now, with what's happening with globalization and energy shortages, with the fact that natural gas went up by a factor of three in United States but in the last year with the fact that lithium went up by a factor of five in the last year, and with the electrification of transportation, all these minerals, all this energy is needed so badly, and renewable energy and the thing that we're doing with Heliogen really ends the geo-logic lottery."
}