{
    "symbol": "HLGN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 20:54:25",
    "content": " These statements include expectations and assumptions regarding the company's future operations and financial performance, including: Our guidance for full year 2022; the expected impact of recently passed federal legislation; discussions with potential customers; and commercial contract progress. The good news is that because of the hydrogen production subsidies of $3 per kilogram in the Inflation Reduction Act, we are seeing more intense interest in hydrogen offering from potential customers and provides a meaningful boost to our project economics. As an example of the way we're capitalizing on these seismic shifts, yesterday we announced that we've signed a memorandum of understanding with the city of Lancaster, California to build a green hydrogen production and fueling facility that is expected to supply up to 1,500 metric tons of green hydrogen fuel per year. As Bill mentioned, we recently entered into a memorandum of understanding with the city of Lancaster for our commercial scale, green hydrogen production and fueling facility with a capacity of up to 1,500 metric tons of green hydrogen fuel per year, intended to help the city of Lancaster achieve its goal to become one of the first net zero cities in the United States. As it relates to the new technologies we're developing, we were recently selected to receive a $4.1 million award from the U.S. Department of Energy's Solar Energy Technologies Office to accelerate the large-scale development of our concentrating solar thermal technology to decarbonize the heating of limestone to 950 degrees Celsius, which greatly reduce the carbon emissions associated with cement manufacturing. Collectively, the IRAs' attractive incentives have created tailwinds for basing projects here in the U.S., and we're seeing our customers with large global footprints, looking more favorably at the U.S. as a location for renewable energy projects compared to other countries."
}