{
    "symbol": "FRG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 01:33:02",
    "content": " The Franchise Group second quarter financial performance was within our expectations but for the full year 2022, we're lowering our financial outlook for revenue to approximately $4.3 billion from $4.45 billion; adjusted EBITDA to approximately $390 million from $450 million; and non-GAAP earnings per share to approximately $4.00 a share from $5.00 a share. Although American Freight is emphatically expected to be a material contributor to FRGâ\u0080\u0099s long term growth, the impact of inflation this year is likely to result in approximately $100 million less EBITDA than what the current store base would be expected to generate in the steady state. American Freight is expected to generate approximately $200 million less revenue than planned, that revenue loss comes with roughly 30% EBITDA flow through and additionally the nearly $ 1 billion of revenue that American Freight will generate will come at a cost of over 500 basis points of excess freight. And just correct me if I'm wrong, because it seems like American Freight, itâ\u0080\u0099s cheaper furniture that's much more sensitive to price both on the fact that your freight expenses are now significantly relative to the overall price of the goods but more importantly, your customers who normally you're attracting are now being basically priced out. Totally correct for a lot of reasons, look, American Freight, if you look at their freight costs that are loaded onto the product costs compared to pre-COVID, the last couple of years don't really give you much in terms of really good information, but their freight costs are up almost 200% from where they were. So, yes, there is a very large difference and you're also correct that at American Freight, the - what you would typically see is in a recession, you would see the lower income customer, everybody, the jobless rate going up, unemployment is increasing. On American Freight, one thought is that this was a little bit perhaps a recession - I don't wonâ\u0080\u0099t call it recession proof, but a recession resistant model, I guess it's turning out not to be the case but if you could just talk about the long term expectations, if you will, for American Freight, why this is still a good business. And part of our plan is open company owned stores every year whether we end up ultimately refranchising those or not, but whether it's two years, three years, five years, 10 years from now, American Freight is ultimately likely to be the most valuable business that we own contributing the most free cash flow of any business that we own today, that is of course. So we're seeing - that if I told you we would be seeing units in furniture and mattress down over 50% compared to pre-COVID levels, not COVID peak, pre-COVID levels and the business would still be generating the EBITDA that it's generating. But across the board, you know what, you're still seeing the average consumer for all of our businesses, seeing food and energy inflation and the cost to fill up the tank is greater and they're trying to limit the number of trips to any store, that would include Vitamin Shoppe, that would include Pet Supplies Plus."
}