{
    "symbol": "WISH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 21:22:03",
    "content": " And now I'd like to introduce your host for today's program Mr. Ralph Fong, WISH's Head of Investor Relations. Good afternoon, everyone, and welcome to WISH's Fourth Quarter and Full Year 2020 Earnings Conference Call. The remarks made today include forward-looking statements that are related to among other things, our financial expectations, business and turnaround plans, consumer experience and engagement, expectations regarding merchant relationships and strategic partnerships, the potential impact of our strategic marketing and product initiatives, including ad spending and the rebrand and the anticipated return on our investments and their ability to drive future growth. A reconciliation of non-GAAP to GAAP results is included in today's earnings release, which you can find on our Investor Relations website and which is also filed with the SEC. On this call, I will recap some of the major highlights of 2022, share our financial update and discuss the key strategic initiatives for 2023. At the macro level, we experienced a higher level of economic uncertainty that emerged in both our North American and our European market in 2022, which impacted consumer buying behavior. Additionally, we experienced supply disruptions attributable to COVID related lockdowns in China, I would like to take this opportunity to thank our dedicated and hard-working team in China for the efforts to work through all the supply chain and the logistic challenges during the lockdown throughout 2022. Despite the challenges we faced, we continue the transformation journey that we embarked on in 2021, working diligently to improve the front end for our users and the back end for our merchants. Our foundations for growth are built around 3 fundamental pillars: First, improving the consumer experience; second, deepening our merchant relationships; and third, achieving operational excellence. Our new brand incorporated a new logo, iconography, imagery and color palette, and was accompanied with a refreshed mission statement Bargains Made Fun, Discovery Made Easy, which more accurately reflects our renewed focus on helping value-oriented consumers discover listings for new products while having fun in frictionless and a convenient way We ramped up our merchandising efforts for the 2022 holiday season. Additionally, we launched a new Deals Hub promotion platform that allowed our merchants to showcase their best discounts and increase their product exposure across the WISH platform, while our customers were able to benefit from getting a great deal. As an example, our on-time delivery rate was approximately 89% in the fourth quarter of 2022, an improvement from approximately 82% during the same period of 2021. Our average time to door has significantly improved in the top markets we serve, resulting in much improved refund rates, customer order cancellation rates and consumer experience. Our customer refund rates fell 36% year-over-year in the fourth quarter, and customer order cancellation rates dropped 58% within the same time period as well. To sum it all up, as the result of our ongoing effort to improve the consumer experience, we saw encouraging buyer conversion and customer retention trends in the fourth quarter of 2022 versus a year ago. From a user and merchant experience standpoint, we continued to innovate and roll out a suite of product features to further improve the user experience on the WISH platform, including the revamped fashion experience, WISH Fashion; the shoppable videos feature, WISH Clips; the merchant scoring system, WISH Standards; improved Deals Hub; new logged-out experience; increased focus on merchandising and collections; and the redesigned homepage on the WISH app which features collection modules, category tabs, wishlists, et cetera. In addition, we formed partnerships with multiple providers of ecommerce software, fulfillment automation, platform integration and customer support solutions including eDesk, Productsup, and Eurora to further enhance the merchant experience. While it was down 57% from the fourth quarter of 2021, the rate of quarterly declines slowed, with revenues in Q4 only sequentially down 2% from the third quarter of 2022. Our Adjusted EBITDA in Q4 was a loss of $95 million, which was at the lower half of guidance range of a loss of $90 million to $110 million. Full year 2022 revenue totaled $571 million, down 73% from a year ago. Adjusted EBITDA in 2022 was a loss of $288 million, compared to a loss of $199 million in 2021. We also ended the year with cash, cash equivalents and marketable securities of $719 million. Looking to 2023, while we are committed to our three foundational business pillars, we intend to instill a strong focus on unit economics to help ensure a continued solid financial foundation for WISH and prioritize disciplined cash flow optimization so that our marketplace can effectively maximize its current opportunities. With that, I would like to spend a couple of minutes outlining the key strategic initiatives to improve our unit economics, going forward. Our first strategic initiative is to drive basket building, which we believe will increase cart size and conversion rates by improving listing quality and trust, reducing fulfillment time, and bringing down shipping costs. Importantly, we expect flat rate shipping to be a critical component in addressing one of the major pain points amongst our users on the WISH platform. Not only will this improve the shopping experience for our customers, we are confident it will also result in high order values, higher conversion rates and customer retention. In the first half of 2023, we intend to leverage incentives and merchandising campaigns to drive repeat purchases, bring buyers back via unpaid channels including personalized emails notifications and bring in right inventory for our focus categories, including home & life, hobbies, electronics, beauty & health, and fashion. In the first half of 2023, we intend to offer customers incentives and coupons for free shipping to encourage basket building and repeat purchases across our key categories. Additionally, we plan to provide more incentives for first-time purchases, repeat purchases, and inactive users as well. Our third initiative is to inspire browse & discovery experiences and, with this, our goal is to increase users' engagement, which is measured by product display page views and click-through rates. In the first half of 2023, we plan to further enhance the category browsing experience to help users not only explore the WISH catalog in a fun and engaging way, but also browse through the breadth and depth of WISH's product catalog and discover more products through shopping inspiration. While paid ads will remain a key driver for user retention and growth, our goal is to increase the efficiency of our paid ads and decrease the overall advertising spend with ROAS targets based on customer segments and user lifecycles. In parallel, we plan to invest more heavily in our unpaid channels, as we believe that emails and push notifications will be highly effective in bringing users back to WISH and driving customer loyalty over time. In summary, each of our strategic initiatives for 2023 are clear, and we are deliberate and focused in our efforts to improve our unit economics. Now I will add more color on Q4 and full-year 2022 financial performance, provide Q1 2023 EBITDA guidance, and expand on certain operational priorities in 2023. In the fourth quarter of 2022, we had 20 million monthly active users and 13 million last 12 months active buyers, which was a decline of 55% and 66% respectively, year-over-year. In particular, our digital advertising expenses in Q4 were $46 million, down from $66 million in Q4 of 2021 and $55 million from Q3 2022. Total revenues in Q4 were $123 million, a decline of 57% year-over-year. This decline was across Core Marketplace, ProductBoost, and Logistics, mainly driven by reduced ad spend and the new pricing structure which became fully effective in Q3 2022. However, it adversely impacted our Q4 marketplace revenue and EBITDA, resulting in an unfavorable comparison to the prior year. Q4 gross profit was $26 million, a decline of 78% year-over-year. Total operating expenses were $143 million, a reduction of 22% year-over-year. Our net loss was $110 million, compared to a net loss of $58 million in the fourth quarter of 2021. Our Adjusted EBITDA was a loss of $95 million, compared to an EBITDA loss of $23 million in Q4 2021. Operating cash flow for Q4 2022 was negative $109 million, compared to a negative operating cash flow of $49 million in Q4 2021. The Q4 2022 operating cash flow was primarily driven by our net loss of $110 million and $23 million of unfavorable changes in our operating assets and liabilities, which was partially offset by non-cash expenses of $24 million. Free cash flow was negative $109 million, compared to a negative free cash flow of $50 million in Q4 2021. We ended Q4 in a financially healthy position with $719 million in cash, cash equivalents and marketable securities and no long-term debt. Total revenues were $571 million, a decline of 73% year-over-year. Gross profit was $166 million, a decline of 85% year-over-year. Total operating expenses were $564 million, down 62% year-over-year. Total ad spend was $198 million, down approximately 80% from 2021. Our net loss was $384 million for the year, compared to a net loss of $361 million in 2021. Adjusted EBITDA was a loss of $288 million, compared to an EBITDA loss of $199 million in 2021. Our Free Cash Flow was negative $424 million in 2022, a significant improvement from a negative free cash flow of $953 million in 2021. However, we have seen unpaid traffic stabilize and conversion and retention rates improve, thanks to more compelling value for price, better listing quality and app features as well as faster delivery time. Secondly, during the first half of 2022 we implemented a new pricing strategy to make prices on WISH more transparent and competitive. This change reduces WISH's marketplace revenues and profits in the near term, but is critical in enhancing user retention and merchant engagement for the long run. Thirdly, we focused on optimizing cash flows throughout 2022. As a result, our cash burn in 2022 was reduced to 50% of that in 2021. From a year-over-year comparison standpoint, Q1 2023 is expected to remain unfavorable relative to Q1 2022, as Q1 2022 benefited from the original pricing practice, resulting in higher revenue and EBITDA. Ad spend is expected to remain an important driver of our top line performance, as we continue to focus on unit economics and utilize more diverse marketing channels to deliver higher returns. As a reference point, our estimated revenues in January 2023, the first month of Q1, are expected to be down approximately 15% when compared to our revenues in October 2022, the first month of Q4. On January 31st, we notified WISH employees that we will undergo a reduction in our global workforce to realign our resources with 2023 operational priorities. In the fourth quarter of 2022, the average time to door in five of our major markets improved by 6 days when compared to the same period of 2021. Our on-time delivery rate was around 89% in the fourth quarter, an improvement from approximately 82% in the same period of last year. In addition, we have started to implement forward deployment capabilities in China, which is expected to further reduce our delivery time to approximately 10 days for high velocity products listed on WISH. Building upon the success of the Every day is Black Friday campaign last November, we will be running multiple merchandising events across the 60-plus markets we serve in 2023. Through these merchandising events, we expect to strengthen WISH's Home and Life brand narrative across our user base, offering a broad variety of quality, unique lifestyle products at affordable prices. WISH aims to be the first in mind when a customer thinks about what they need, from their home essentials to event-based needs such as holidays and celebrations. I'm energized about our merchandising strategy, and expect merchandising to play an increasingly important role in driving GMV growth, user acquisition and retention. Over the last 12 months, the WISH team has devised and implemented some substantial changes that have improved our team's focus, sharpened execution, and led to the setting of key strategic goals that will place WISH in a position of greater strength and future growth. We expect to drive user experience improvement through operational and product efforts, leverage our strengths in data and predictive capabilities to deliver personalized and curated products to our users. Given the macro environment and financial challenges increasingly faced by consumers worldwide, we are focused on providing value and deals to our value-oriented users through extensive and sophisticated merchandising campaigns. The entire team at Wish is committed to successfully executing on our turnaround plans, and I am proud of what the team has accomplished and excited to see what we can do together in 2023. As Joe mentioned, we started building that in last November, and we continue to build the merchandising capabilities to engage with our new and existing buyers. And then lastly but not least, we do expect to drive top line growth in a more balanced approach between organic versus paid going forward as we continue to invest in the features, the new app features, delivery services and listing quality and becoming more competitive in the prices, we expect the customers to have more -- you'll see the compelling value proposition on which and have more pleasant shopping experiences with which and therefore, come back on their own. So long way if I answer your question, we care about unit economics and about continuing to focus, 2023. And I think it's -- I'm comfortable to say that we are very close to making that decision, and we will most likely start providing top line guidance, whether it's GMV or revenue in the very near term. So we had a fashion relaunch last year, and the fashion is one of the top 5 core categories we have on WISH. So a long way of saying, we consider that a very successful relaunch, and we continue to leverage the experience and the learnings to make other categories successful on WISH platform as well. So I think it's an ongoing progress, right, for the fashion relaunch, since actually updated in -- for Q3. Yes, that's a great question. I think the -- first of all, the marketplace revenue -- the performance of marketplace in general was really impacted by 2 major strategic decisions we made in 2021. And the second important change we implemented in 2022 was the pricing -- new pricing practice, as I mentioned earlier. And is that essentially kind of almost entirely impact, it's a direct impact on marketplace revenue versus logistic in the near term. So I would say those 2 decisions were both necessary to build customer retention and merchant trust engagement for the long run, but we had some adverse impact for the near term on the marketplace revenue and profitability. And I think going forward, we expect the marketplace and the logistics performance to be more aligned as we kind of gradually works through the changes. And as we move into the -- especially second half of 2023, it will be a much more kind of comparable from a year-over-year standpoint. Just looking at -- going back to marketing, just looking at just the kind of taking out the brand, I guess, as a percent of marketplace revenue is still pretty high as a percent and  total revenue. And I think if I remember correctly, in the past 3 years, in 2020, it was more than -- it's about 67% of revenue spending in sales and marketing. And as in 2021 was 54%, 53% and then last year, it was a 40-plus percent. So every year, we made a tremendous progress in reducing our reliance on performance marketing and therefore, reduce the percentage of marketing spend as a percentage of the total revenue. And that's the reason why in Q4 last year, we started to really focus on ROAS, right. But to answer your question, yes, we will continue to focus on the marketing ROAS, the return on marketing in 2023. But we are not really managing towards marketing dollar budget as a percentage of revenue, instead we focus on the real as the return on every dollar we spend. If we look at the EBITDA guidance, it implies, let's say, a negative 45% to 50% year-on-year decline in revenue, kind of assuming that the OpEx as a percentage revenue stays roughly the same. Yes, that's a great question. And I think we talk about the revenue of January actual, right, and there was a 15% decline relative to October and that's mostly driven by seasonality. And I think the -- if you look at quarter-over-quarter, our EBITDA guidance is actually more favorable compared to the Q4 actual EBITDA performance. I'd like to hand the program back to WISH's CEO, Joe Yan, for any further remarks."
}