{
    "symbol": "GWRS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 01:15:25",
    "content": " Welcome to the Global Water Resources, Inc. 2022 Third Quarter Conference Call. I would like to remind everyone that this call is being recorded on November 10, 2022 at 1 p.m. Eastern Time. Welcome, everyone and thank you for joining us on todayâ\u0080\u0099s call. Yesterday, we issued our 2022 third quarter financial results by press release. Speaking today is Ron Fleming, President and Chief Executive Officer; Mike Liebman, Chief Financial Officer; and Chris Krygier, Chief Strategy Officer. Mr. Liebman will review the financial results for the third quarter, and Mr. Krygier will review strategic initiatives and business development. Mr. Fleming, Mr. Liebman and Mr. Krygier will be available for questions at the end of the call. Before we begin, I would like to remind you that certain information presented today may include forward-looking statements. These forward-looking statements involve a number of assumptions, risks, uncertainties, estimates and other factors that could cause actual results to differ materially from those contained in the forward-looking statements. Accordingly, investors are cautioned not to place undue reliance on any forward-looking statements, which reflect managementâ\u0080\u0099s views as of the date hereof and are not guarantees of future performance. For additional information regarding factors that may affect future results, please read the sections Risk Factors and Managementâ\u0080\u0099s Discussion and Analysis of Financial Condition and Results of Operations included within our latest Form 10-Q filed with the SEC. For a reconciliation of these measures to the comparable GAAP financial measures, please see the tables included in yesterdayâ\u0080\u0099s earnings release, which is again available on our website. At Global Water, we continue to advance our mission of growing and aggregating water and wastewater utilities so that our customers can realize the benefits of consolidation, regionalization and environmental stewardship in the face of water scarcity, challenging regulations and aging infrastructure. So in the quarter, our company completed a public offering of common stock totaling net proceeds of $14. 9 million and an increase to our unused revolving line of credit from $10 million to $15 million ensuring we have the capital necessary to fund acquisitions, infrastructure investments and for general corporate purposes. We also announced the completion of our company-wide rate case, which includes new rates for 96% of our customers, including numerous notable policy decisions. On October 3, we filed an application at the ACC for approval to acquire Farmers Water Company and its roughly 3,300 customers in the town of Saolarita. Subsequent to quarter close, we completed the upgrade of La Quintas Serenas customer connections from manually read meters to smart meters. As a reminder, La Quintas Serenas is a utility we acquired in 2021, also in the town of Saolarita. Total active connections grew 8% as compared to the end of Q3 2021, bringing total connections to 56,134. Despite the national slowdown, development and housing activity continues in Metro Phoenix and our service areas. Thus far, Metro Phoenix has only experienced a 14% reduction in single-family home permits in 2022 over the same period in 2021. In Maricopa, our largest utilities, where weâ\u0080\u0099ve also seen a slowdown, but the city has still issued over 1, 000 single-family housing permits year-to-date. However, large-scale commercial and industrial growth continues to accelerate at a pace never seen before in Metro Phoenix, and this continues to push out to our areas either in our planned service territories or in communities immediately adjacent. Because of this, we continue to make excellent progress on the engineering, permitting and construction of new service areas including for the Nikola Motor Corp manufacturing facility and the surrounding Inland port, Arizona, amongst other areas within our large service territories. We believe that soon and in the years to come, we will continue to see large-scale commercial and industrial growth in addition to our strong organic housing growth. Putting all these elements together, Global Water is well positioned from an operational safety compliance and financial perspective with notable growth in the years to come. Total revenue for the third quarter of 2022 was $11.9 million, which is up $488,000 or 4.3% compared to Q3 of 2021. These increases were offset by the $692,000 of revenue recognized in Q3 2021 related to our infrastructure coordination and financing agreements, also known as ICFAs, as we didnâ\u0080\u0099t recognize any ICFA revenue in Q3 of 2022. Water and wastewater revenue, which excludes ICFA revenue for Q3 of 2022 increased $1.2 million or 11% compared to Q3 of 2021. Again, this increase was driven by the increase in active service connections combined with new rates. Some notable changes in operating expenses included increased operating and maintenance costs by approximately $100,000, which was primarily associated with increased expenses as the company continues to grow in addition to increases in costs related to inflation. G&A expense was reduced by $155,000 primarily driven by lower deferred compensation and board compensation tied to the reduction in stock price during the quarter. Lastly, we had approximately a $73,000 increase in depreciation and amortization tied to our capital expenditure program. Other expense for Q3 of 2022 remained flat at approximately $470, 000 compared to Q3 of 2021. Now to talk about adjusted EBITDA, which adjusts for nonrecurring items such as ICFA revenue as well as noncash items such as restricted stock expense. Adjusted EBITDA was $6.1 million in Q3 of 2022, an increase of $1 million or 20.6% compared to Q3 of 2021. Iâ\u0080\u0099d like to briefly touch on inflation and while we have not seen a material increase in our operating expenses as a result of inflation, we do expect to see some increases in future periods, primarily related to personnel costs. Additionally, as you would expect, we have experienced an increase in capital costs as a direct result of inflation. Lastly, before turning the call over to Chris, Iâ\u0080\u0099d like to touch on our liquidity position. When combining our unused $15 million line of credit with our September 30 cash on hand of over $15 million, we have over $30 million of liquidity to support ongoing operations and our growth strategy. First, as you heard earlier, and we mentioned on our last quarterly call, we received rate decision 78644 in July 2022. We implemented Phase 1 of our rate increase on August 1, 2022, and will implement Phase 2 of our rate increase on January 1, 2023. Second, in the quarter work began on the Arizona Corporation Commissionâ\u0080\u0099s Water task force led by Chairwoman Market Peterson, the task force is focused on reviewing and potentially providing more certainty around commission rules and procedures, in particular, around acquisition policy and water supply policy. Finally at the ACC, as you may have seen, the initial election results for the two open seats occurred this week. Currently, the two Republican candidates, Kevin Thompson and Nick Myers are leading the two Democratic candidates, incumbent Commissioner Kennedy in candidate, Lauren Kobi. While we await the election results regardless of who wins, we look forward to engaging with the current commissioners and newly elected commissioners to advance important water policies in our state. Finally, turning to our acquisition of Farmers Water Company. As you may have seen in yesterdayâ\u0080\u0099s press release, we filed our request for ACC approval to acquire Farmers on October 3, 2022. Just a few weeks later, on October 24, staff issued its recommendation to the Commission recommending approval of our application, which we appreciate. Finally, yesterday, at the ACC open meeting, the commissioners verbally approved the application on an expedited basis, and we appreciate their quick action. The transition planning process is going well, and we continue to estimate closing the Farmers acquisition in the first quarter of 2023. So itâ\u0080\u0099s clear, we are well positioned with a strong balance sheet and disciplined strategy. In fact, from an operational and financial perspective, we have never been stronger, and we have more than ample liquidity and access to capital to be great utility partners for the communities where we have the privilege to serve, and we will pursue expansion through organic growth, acquisitions and new projects, both big and small. As we handle this high growth, we intend to remain at the forefront of the water management industry and advance our mission of achieving efficiency and consolidation. We appreciate your investment in and support of us as we grow Global Water to address important utility, water resource and economic development issues in Arizona and potentially beyond. And I am curious if as this builds out, will this be an entirely regulated opportunity for you or is there also a potential opportunity to do something thatâ\u0080\u0099s unregulated, or I am just curious as to how this is going to function. Obviously, if you follow Arizona at all of our or in industrial boom, quite a bit of that has been moving south of Phoenix to Pinal County, which as you know, where we got lots of large service territory. So, I will just say this, we have been very active working with lots of potential projects that want to locate in our service areas there and in that Inland Port. But to your broader question, I think part of the reason we were brought into Inland Port and really our large service areas turned out Pinal County and other places, is the way we think about regional planning. But we think from an efficiency standpoint, a water resource management standpoint, from a community standpoint, itâ\u0080\u0099s best if this is all part of an integrated regulated plan. And thatâ\u0080\u0099s our companyâ\u0080\u0099s model, and thatâ\u0080\u0099s what we have positioned to these landowners and these communities and gotten that support. So, mostly for â\u0080\u0093 I would say, for any industrial project thatâ\u0080\u0099s coming into our service areas, itâ\u0080\u0099s part of an integrated plan and it will be the kind of the fully regulated normal water and wastewater utility service. Obviously, these are some of the pretty big projects and so it does have some different considerations as you provide service to them, but nothing that we canâ\u0080\u0099t do. So, as you think about, Ron mentioned that 1,000-plus permits that were issued this year, that will take some time for that to funnel through. Seeing a lot of companies that have some type of structure SOFR plus a fixed amount, but SOFR has accelerated quite substantially over the last six months, nine months. So, fortunately for us, the existing debt that we have outstanding over $110 million is all fixed rate debt at roughly 4.55%. We are still refining what that will be internally, but I will tell you, broadly speaking, we see that there is a significant opportunity to deploy capital down there, one, to catch up with the utility, but then two, to implement our platform and everything we have done in all of our other utilities. And so I donâ\u0080\u0099t have the specific dollars that we are ready to share at this point, but we definitely see it as an opportunity to deploy more capital thatâ\u0080\u0099s needed. So, if â\u0080\u0093 right now, the current composition is three Republicans, two Democrats and one Republican seat is up and one Democrat seat is up."
}