{
    "symbol": "MSTR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 18:38:05",
    "content": " The market value of our Bitcoin holdings was $5.9 billion at March 31, 2022 reflecting $1.9 billion of unrealized gains or nearly 50% appreciation when compared to the original cost basis of our bitcoin at March 31, 2022. Finally, other services revenues, which largely reflect our consulting services, were $22.8 million in this quarter, an increase of 9% year-over-year or 13% on a constant currency basis, primarily driven by an increase in billable hours worldwide, partially offset by an unfavorable foreign currency exchange impact and a decrease in average billing rates. Also, we have held back approximately $9 million from the loan proceeds as cash and macro strategy that can be used towards general corporate purposes, including paying interest for this loan or buying additional Bitcoin. MicroStrategy has pioneered the use of digital assets as a core component of enterprise's treasury policy, which has generated incremental value for our shareholders, as a snapshot into our current Bitcoin holdings by entities, as of March 31, 2022, of the total of 129,218 Bitcoins held by the company. Over the last few months in the world of Bitcoin, the interesting developments worth highlighting are the Executive Order coming out of the Biden White House on March 9th, which was really a first as long as anyone can remember, the first time that we had the executive branch in the United States in essence highlighting and endorsing an asset class as being critical to the future of the nation. What it means is that Lightning will in time not just move Satoshis back and forth at the speed of light to billions of people, Lightning will also move other digital assets like stable coins, Tether or a circle or any other digital currency or any other digital token could or an NFC or another asset could move over the Lightning network at extraordinary high speeds, extremely scalable, while taking advantage of the security assurances of the Bitcoin network."
}