{
    "symbol": "MSTR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 19:33:05",
    "content": " With our deep knowledge of business intelligence, rich enterprise analytics software platform and distributed network of loyal global providers -- sorry, loyal global customers providing us with a stream of revenues and cash flow, we're unlike any conventional holder of digital assets. In the second quarter, cloud subscription service revenues were $14 million, an increase of 36% year-over-year or up 40% on a constant currency basis. Finally, other services revenues, which largely reflect our consulting business, were $21.4 million this quarter, a decrease of 2% year-over-year but an increase of 4% on a constant currency basis. As a percentage of total software license revenues, the second quarter decrease of 19% year-over-year continues to reflect improvements in the productivity of our sales and marketing teams, along with an increase in capitalized commissions compared to last year. Finally, before I open up the call for Q&A, I would like to say that I'm extremely honored to be part of the MicroStrategy team and excited to be working with Mike and Phong in their new roles, where we are all aligned on executing on the corporate strategies of operating and growing our enterprise analytics business and acquiring and holding Bitcoin for the long-term. So, as a result of that, because people are afraid of volatility and sometimes, they're off put by the accounting, we have been able to develop a lead in the digital asset space as the first and the largest public operating company on a Bitcoin standard, and I think that has given us a sustainable competitive edge and a differentiator that we can use to continue to build shareholder value going forward. And this new executive structure means that I can even more enthusiastically focus upon communications and strategy and Bitcoin advocacy and evangelism knowing that I'm not ignoring the nuts and bolts day-to-day operations of the business, of which thereâ\u0080\u0099s 100,000 things you have to do well every year in a software company, and they need to get done, and they will get done."
}