{
    "symbol": "CVS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 12:23:10",
    "content": " Our first quarter results reflects strong performance from all our core business segments with continued momentum in revenue growth, cash flow generation and adjusted earnings per share growth, positioning us to increase our 2022 adjusted EPS guidance to a range of $8.20 to $8.40 per share. First quarter revenues of $76.8 billion increased by 11.2% year-over-year, reflecting robust growth across all business segments. Turning to Health Care Benefits segment, first quarter revenue of $23.1 billion increased by 12.8% year-over-year driven by membership growth across all product lines. During the first quarter, revenue of $39.5 billion increased by 8.6% year-over-year driven by pharmacy claims growth, growth in specialty pharmacy and brand inflation partially offset of continued client price improvements. Adjusted operating income of $1.6 billion grew 8.6% year-over-year driven by improved purchasing economics, reflecting increased contribution from the products and services of our group purchasing organization in specialty pharmacy partially offset by continued client price improvements and increased expenses to onboard new business at the beginning of the year. Adjusted operating income of $1.6 billion grew 15.1% versus prior year, driven by a few key components: strength in pharmacy and front store sales, the administration of COVID-19 vaccines and demand for over-the-counter test kits and related treatment categories, particularly at the beginning of the quarter when Omicron incidence was high. As a result of our first quarter performance, we are raising our full year adjusted earnings per share guidance to $8.20 to $8.40 which represents 3.5% to 6% growth versus our 2021 adjusted earnings per share baseline. Yes, so I think the easiest way to sort of think about that is largely what’s being sort of pulled through here is the prior year development that we experienced in the first quarter less the realize capital losses. And I would say in the quarter, mainly, I think because we made wage moves last year, I don’t think we felt a lot of pinch, but the one obviously the one place that we did see it is actually a result of the kind of cousin of inflation, and that’s interest rates and some of the losses that – realized capital losses that we took in the portfolio related to that."
}