{
    "symbol": "BFAM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 22:42:04",
    "content": " To recap the headline numbers for this past quarter, revenue increased 14% to $530 million, which yielded adjusted EBITDA of $91 million and adjusted earnings per share of $0.77, an increase of 18% from the prior year. For the full year 2022, revenue of $2 billion represented growth of 15%, while adjusted earnings per share of $2.60 expanded 31% over 2021. In our full service child care segment, revenue increased 15% in the fourth quarter to $388 million. In Australia, our centers currently operate at higher occupancy levels than the U.S. and UK business over 70% on average, but further enrollment growth has been slowed by staffing constraints as Australia experiences similar labor dynamics that we see across our global center operations. Moving on to our advisory business, which delivered revenue growth of 11% to $33 million, we launched a number of new clients this quarter, including Arrow Electronics, Atrium Health, and IQVIA and we continue to see healthy participation and activity levels at both College Coach and EdAssist. Adjusted operating income of $56 million or 10.5% of revenue increased 19% over Q4 â\u0080\u009821, while adjusted EBITDA of $91 million or 17% of revenue increased 15% over the prior year. Full service revenue increased $49 million to $338 million in Q4 or 14% over the prior year, which was in line with our expectations. Enrollment in our centers opened for more than 1 year, increased mid single-digits with 6% enrollment growth in the U.S. and approximately 1% growth in our European operations, reflecting the ongoing effects of having to limit new enrollments due to constrained availability of staff. Turning to Back-Up Care, revenue grew 15% in the quarter in this segment with total revenue of $108 million, again in line with our expectations. As Stephen mentioned, we were pleased with the strength of used growth through the quarter and the resulting operating performance, which delivered $33 million of operating income or 30% of the associated revenue. Looking specifically at quarter one of â\u0080\u009823, our outlook is for full service growth of 15% to 20%, Back-Up growth of 10% to 12% and ed advisory growth of 5% to 10% on the top line, which aggregates to total revenue growth in the range of 14% to 18%. Please proceed with your question. I was just hoping for the full year guide, could you help us with what youâ\u0080\u0099re assuming on the revenue side in terms of M&A contribution and also the utilization implied in that 15% to 20% growth for full service. So with respect to the full year, I know youâ\u0080\u0099re right, the full year guide for revenue overall was $2.3 million to $2.4 million with full service growth in 15% to 20%, let me see if I can pull over to what that you have that, Mike, on full service. Only about children like Elizabeth said, is of that 15% to 20% for full service, itâ\u0080\u0099s about 5% or so contribution there to the overall revenue growth for the year in full service. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And then just anything else you can say on the path to getting back to 8% to 10% margins, I would think on the negative, you still have an incremental $30 million of ARPA runoff after this year. Please proceed with your question. I think the good news on Back-Up similar to the full-service business is we do have pricing power and are able to continue to take some price increase on those Back-Up arrangements, not at the same level as we are seeing on tuition rate itâ\u0080\u0099s at 6% to 7%. Please proceed with your question."
}