{
    "symbol": "OOMA",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-02 19:54:05",
    "content": " 11:30 Subscription and services revenue was forty four point seven million dollars, ninety one percent of total revenue compared to ninety two percent in the prior year quarter. During the third quarter, we saw a product and other revenue increased thirty five percent to four point five million dollars as compared to three point three million dollars for the same period last year. We ended a third quarter with one million ninety eight thousand core users, up from one million sixty three thousand core users at the end of the third quarter last year, driven by the growth in business users. 12:32 Our average monthly subscription and services revenue per core user or ARPU increased nine percent with thirteen point two four dollars up from twelve point ten dollars in the prior year quarter driven by an increase in mix of business users, including higher ARPU office Pro users. On an overall basis, total gross margins for Q3 were sixty two percent, a decrease of eighty basis points from the same period of last year due to a higher mix of product revenue during the quarter. Sales and marketing expenses for the third quarter were fourteen point four million dollars or twenty nine percent of total revenue, up sixteen percent year-over-year, driven by higher marketing and channel development activity for Ooma business. 15:09 Research and development expenses were eight point four million dollars or seventeen percent of total revenue, up seven percent on a year-over-year basis from seven point eight million dollars driven by investments in new features for both Ooma Office and Ooma Enterprise as well as new products such as Ooma AirDial, which was introduced just last month. 18:09 For full year fiscal twenty twenty two, we expect total revenue to be in the range of one hundred and ninety one point five million to one ninety two million dollars an increase from a previously issued guidance range of one hundred and eighty eight point five million dollars to one hundred ninety million dollars. Residential for us is still a growing business and we estimate this fifty million dollars plus households in North America, obviously, T-Mobile is just in the U. S. but a large market opportunity to replace landlines with new solutions and so, we're quite excited to be continuing to see and drive growth with Ooma Telo and our residential business and we think what T-Mobile's doing now passing thirty million homes with wireless 5G Internet is quite significant. Just given the expanding product portfolio and as well as higher level tiers that you're offering and it is great to see your retention rates stabilized at ninety eight percent for last three quarters, but just given those two dynamics that I just mentioned, would you expect that to return to one hundred percent which where we were before the pandemic or even above Thank you. 45:42 So, I think there's some offsetting going on with both, that all the time, I think with step opportunity to improve on ARPU, even where the largest customers ramping, because if you really think about it, only in nineteen percent the total office users today has higher Pro tier."
}