{
    "symbol": "UVV",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-08 21:13:04",
    "content": " We are extremely pleased with our results driven by strong tobacco shipments in the nine months and quarter ended December 31, 2022, compared to the same periods in fiscal year 2022. Our Ingredients Operations segment also continued to positively contribute to and diversify our results in the nine months and quarter ended December 31, 2022. Increased costs, particularly selling, general and administrative expenses, including costs related to the expansion of sales and product development resources and deferred compensation costs from acquisitions reduced our results for our Ingredients Operations segment in the quarter and 9 months ended December 31, 2022. Net income for the nine months ended December 31, 2022, was $70.3 million or $2.82 per diluted share compared with $60.8 million or $2.44 per diluted share for the nine months ended December 31, 2021. Excluding certain nonrecurring items detailed in today's earnings release, net income and diluted earnings per share increased by $1.1 million and $0.04, respectively, for the nine months ended December 31, 2022, compared to the nine months ended December 31, 2021. Adjusted operating income, also detailed in today's earnings release, of $128.7 million increased by $12.2 million for the nine months ended December 31, 2022, compared to adjusted operating income of $116.5 million for the nine months ended December 31, 2021. Net income for the quarter ended December 31, 2022, was $41.7 million or $1.67 per diluted share compared with $34.9 million or $1.40 per diluted share for the quarter ended December 31, 2021. Excluding certain nonrecurring items detailed in today's earnings release, net income and diluted earnings per share decreased by $3.1 million and $0.13, respectively, for the quarter ended December 31, 2022, compared to the quarter ended December 31, 2021. Adjusted operating income, also detailed in today's earnings release, of $77.5 million increased by $2.7 million for the third quarter of fiscal year 2023 compared to adjusted operating income of $74.9 million for the third quarter of fiscal year 2022. Consolidated revenues increased by $419.2 million to $1.9 billion for the nine months ended December 31, 2022, compared to the same period in fiscal year 2022, on higher tobacco sales volumes and prices, as well as the addition of the business acquired in October 2021 in the Ingredients Operations segment. For the quarter ended December 31, 2022, consolidated revenues were $795 million, an increase of $142.4 million compared to $652.6 million for the quarter ended December 31, 2021, on higher tobacco sales volumes and prices. Operating income for the Tobacco Operations segment increased by $13.4 million to $119 million and by $7.3 million to $77.1 million, respectively, for the nine months and quarter ended December 31, 2022, compared to the same periods in the prior fiscal year. While sales volumes were higher in the Tobacco Operations segment in the nine months and quarter ended December 31, 2022, compared to the same periods in the prior fiscal year, margins were lower due to sales mix and sales of tobaccos that were written down in prior quarters. Tobacco shipments from Brazil of both carryover and current crops were up significantly in the nine months and quarter ended December 31, 2022, compared to the same periods in the previous fiscal year. In Africa, despite some lower burley tobacco crop sizes, Tobacco sales volumes were up due to earlier shipment timing in the nine months and quarter ended December 31, 2022, compared to the same periods in fiscal year 2022. Results for our oriental tobacco joint venture were down in the nine months and quarter ended December 31, 2022, compared to the same periods in the prior fiscal year, on lower sales volumes and unfavorable foreign currency comparisons. Selling, general and administrative expenses for the Tobacco Operations segment were higher in the nine months ended December 31, 2022, compared to the nine months ended December 31, 2021, primarily due to unfavorable foreign currency comparisons, higher provisions to suppliers and higher compensation costs. For the quarter ended December 31, 2022, selling, general and administrative expenses for the Tobacco Operations segment were higher compared to the quarter ended December 31, 2021, largely due to higher compensation costs and larger provisions to suppliers in part due to lower crop yields, partially offset by favorable foreign exchange comparisons. Operating income for the Ingredients Operations segment was $9.9 million for the nine months ended December 31, 2022, compared to $10.6 million for the nine months ended December 31, 2021, as benefits from increased sales, better margins and the inclusion of the October 2021 purchase of Shank's Extract, LLC were offset by increased costs, mainly higher selling, general and administrative expenses. Operating income for the segment was $0.8 million for the quarter ended December 31, 2022, compared to $3.5 million for the quarter ended December 31, 2021, on lower sales, particularly lower sales of extracts and higher costs. Selling, general and administrative expenses for the segment increased in the nine months and quarter ended December 31, 2022, compared to the same periods in the prior fiscal year, largely on higher compensation costs including final deferred compensation costs from acquisitions as well as costs related to the expansion of sales and product development capabilities of our plant-based ingredients platform."
}