{
    "symbol": "UVV",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-03 20:51:04",
    "content": " Our Ingredients Operations diversifies our earnings and deliver higher results driven by higher sales in both the six months and quarter ended September 30, 2022 compared to the same periods in the prior fiscal year. Operating income for our Tobacco Operations segment for the six months and quarter ended September 30, 2022 was up significantly compared to the comparable periods in the prior fiscal year, driven by increased tobacco shipments. Excluding restructuring and impairment costs and certain other non-recurring items detailed in other items in todayâ\u0080\u0099s earnings release, net income and diluted earnings per share increased by $4.1 million and $0.17, respectively, for the six months ended September 30, 2022 compared to the six months ended September 30, 2021. Excluding restructuring and impairment costs and certain other non-recurring item detailed in other items in todayâ\u0080\u0099s earnings release, net income and diluted earnings per share increased by $5.3 million and $0.22, respectively for the quarter ended September 30, 2022 compared to the quarter ended September 30, 2021. Consolidated revenues increased by $276.8 million to $1.1 billion and by $197 million to $651 million, respectively for the six months and quarter ended September 30, 2022 compared to the same period in fiscal year 2022 on higher tobacco sales volumes and prices, as well as the addition of the business acquired in October 2021 in the Ingredients Operations segment. Operating income for the Tobacco Operations segment increased by $6.1 million to $41.9 million and by $6.9 million to $33.8 million, respectively for the six months and quarter ended September 30, 2022 compared to the same periods in the prior fiscal year. While sales volumes were higher in Tobacco Operations segment in six months and quarter ended September 30, 2022 compared to the same periods in the prior fiscal year. Carryover and current crop tobacco shipments from Brazil were up significantly in the six months and quarter ended September 30, 2022 compared to the same periods last fiscal year. While in Africa, carryover and current crop shipments from Mozambique and Malawi were lower in the sixth months and quarter ended September 30, 2022 compared to the same periods in fiscal year 2022, due to smaller crop sizes, as well as some logistical delays. In North America, sales volumes were down in part due to shipment timing, and the sales mix included some lower margin tobacco in the six months and quarter ended September 30, 2022 compared to the same period in fiscal year 2022. Selling, general and administrative expenses for the Tobacco Operations segment were higher in the six months and quarter ended September 30, 2022, compared to the six months and quarter ended September 30, 2021, primarily due to unfavorable foreign currency comparisons. Operating income for the Ingredients Operations segment was $9.1 million and $4.5 million, respectively for the six months and quarter ended September 30, 2022 compared to $7.1 million and $2.7 million, respectively for the six months and quarter ended September 30, 2021. Selling, general and administrative expenses for the segment increased in the six months and quarter ended September 30, 2022 compared to the same periods in the prior fiscal year, primarily on the addition of Shankâ\u0080\u0099s."
}