{
    "symbol": "UVV",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-03 22:10:02",
    "content": " Results for our tobacco operations segment were down modestly in the quarter ended June 30, 2022 compared to the quarter ended June 30, 2021, largely on unfavorable foreign currency comparisons, due to the strong U.S. dollar. Net income for quarter ended, June 30, 2022, was $6.8 million or $0.27 per diluted share compared with $6.4 million or $0.26 per diluted share for the quarter ended June 30, 2021. Excluding restructuring and impairment cost and certain other non-recurring items detailed in other items in today's earnings release, net income and diluted earnings per share decreased by 1.2 million and $0.05 respectively for the quarter ended June 30, 2022, compared to the quarter ended June 30, 2021. Operating income of $13.3 million for the quarter ended June 30, 2022 increased by $2.7 million compared to operating income of $10.6 million for the quarter ended June 30, 2021. Consolidated revenues increased by $79.8 million to $429.8 million for the three months ended June 30, 2022, compared to the same period in fiscal year 2022 on higher carryover tobacco sales volumes and prices, as well as the addition of Shank's in October, 2021 in the Ingredients Operations segment. Operating income for the Tobacco Operations segment decreased by $0.8 million to $8.1 million for the quarter ended June 30, 2022, compared with the quarter ended June 30, 2021. Although tobacco sales volumes were up modestly, Tobacco Operations segment results were down largely on unfavorable foreign currency comparisons due to the strong U.S. dollar in the quarter ended of June 30, 2022, compared to the same quarter in the prior fiscal year. Carryover crop shipments were higher in Brazil in the quarter ended June 30, 2022, compared to the same quarter in the prior fiscal year, largely due to increased shipping availability. Operating income for the Ingredients Operations segment was $4.6 million for the quarter ended of June 30, 2022, compared to $4.3 million for the quarter ended June 30, 2021. Selling, general and administrative expenses for this segment increased in the quarter ended June 30, 2022, compared to the same quarter in the prior fiscal year on the addition of Shankâ\u0080\u0099s as well as higher labor costs."
}