{
    "symbol": "SMLP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 17:10:13",
    "content": " So Summit reported second quarter adjusted EBITDA of $50.5 million, which exceeded our internal expectations despite over $3.6 million of unexpected weather, maintenance and deal expenses incurred during the quarter. During the quarter, we successfully closed our Lane G&P asset sale for $75 million, which materially improved our leverage outlook and significantly increased our liquidity to $255 million as of June 30. So -- look, as a result of our year-to-date outperformance, the performance from several new wells connected to the system in July, we believe that we are going to trend towards the higher end of our 2022 adjusted EBITDA guidance range of $205 million to $220 million. With nearly 50 wells expected in the second half of 2022 and the approximate 60 wells they're on the plans thus far for '23, we definitely expect to see meaningful volume growth behind the systems over the next several quarters. That's inclusive of 562 million cubic feet of 8/8ths OGC volumes and segment adjusted EBITDA totaled $18.7 million, which decreased $1.5 million from the first quarter. Approximately half of the volume decline sequentially on our wholly-owned system was due to approximately 45 million a day of maintenance-related downtime upstream of our TPL-7 connection and approximately 9 million a day of volume temporarily shut-in behind our wholly-owned SMU system, while a customer was fracturing a nearby 4-well pad. And subsequent to quarter end, the four new well pad was brought online in July and had initial production of over 100 million a day. Approximately 17% or 6 million a day of the volume decline behind our OGC joint venture was also due to wells temporarily shut-in for frac protect, which was partially offset by 6 new lower volume condensate wells that came online during the quarter. Subsequent to quarter end, 9 new wells were connected behind our OGC joint venture that are expected to produce over 180 million a day on an 8/8ths basis. We believe these activities behind our wholly-owned system and OTC joint venture will serve as a volume catalyst for the Northeast segment beginning in the third quarter of 2022.As Heath mentioned, we look forward to better understanding Ascent's development plans in the Northeast pro forma for their acquisition of dedicated acreage behind our wholly-owned SMU system. The Rockies segment, which is inclusive of our DJ and Williston Basin systems, generated adjusted EBITDA of $13.9 million, which decreased $1.9 million from the first quarter of '22. Natural gas volumes were flat quarter-over-quarter, and there were four new wells connected behind those systems during the quarter. Crude oil volumes decreased approximately 17%, and that was primarily due to the weather that Heath mentioned alongside no new wells being brought on during the quarter. We estimate that the winter storm reduced liquids volumes by approximately 11,000 barrels a day, which accounted for nearly 100% of the sequential volume decline, and impacted gross margin by approximately $1.7 million during the quarter. Volumes normalized in June, and there are currently four rigs running with over 35 DUCs behind the system and approximately 30 wells expected to come online in the third quarter that we expect to serve as a volume catalyst here in the second half of the year. The Permian Basin segment, which is inclusive of our wholly-owned Lane G&P system that was sold on June 30 and our 70% interest in the Double E Pipeline reported adjusted EBITDA of $4.8 million, which represented a $0.7 million increase relative to the first quarter. There are approximately 100 rigs running in Eddy and Lea County, New Mexico, of which 14 are existing customers behind our Double E system, and we expect volumes behind our Double E joint venture to continue to increase alongside this increasing production and upstream activity in the region. Volumes averaged 312 million cubic feet a day, flat relative to the first quarter and we still expect our customer to move its active drilling rig in the basin to drill up 17 permitted wells and expect those wells to come online here in the fourth quarter. The Barnett segment reported adjusted EBITDA of $7.2 million, a decrease of $2 million relative to the first quarter. We generated adjusted EBITDA of $50.5 million, incurred capital expenditures of $6.1 million during the quarter, which included $1.9 million of maintenance CapEx. In addition to the sale of the Lane G&P system for approximately $75 million, we also sold an additional $2.6 million of latent inventory. Free cash flow generation during the quarter, along with the asset sale proceeds enabled us to pay down the ABL by approximately $82 million. As of quarter end, we had $151 million outstanding under our $400 million ABL credit facility and approximately $12 million of unrestricted cash on hand. Our available borrowing capacity at the end of the quarter totaled approximately $243 million, which included $6 million of letters of credit."
}