{
    "symbol": "RMD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-28 23:15:21",
    "content": " Our growth is the direct result of our global team's ability to pivot and drive for results, even as we continue to manage through several external challenges that are impacting our business, including one, on-going supply chain disruptions; two, COVID restrictions in parts of the world, three, recovering post-COVID Peak patient flow, and four unprecedented demand from a competitor recall, which will keep them out of the market at least through the end of the calendar year. Breaking it down by regional areas, device sales in the U.S., Canada and Latin America increased by 30%, as we've benefited from incremental revenue due to a competitor's recall and favorable product mix as we sold an increased proportion of higher acuity devices. Your line is now live. And that's allowed us to achieve the 30% year-on-year growth that we saw in devices in U.S., Canada, and Latin America and the 10% year-on-year growth that we achieved this quarter for Europe, Asia and rest of the world. Your line is now live. Your line is now live. In the math side actually, if you go back to 2019, Lyanne when we were talking about market growth, right, we were talking then about devices, mid-single digits and masks being high single digits, I look at our global mask growth rate at 9% constant currency with the headwind of new diagnoses downward or competitive being out for new patient stops. And the U.S. Canada, Latin America at 7% constant currency as pretty reasonable growth, new patients are down but what we're actually doing there is working with resupply with Brightree resupply, with SNAP technology ReSupply in the U.S. and around the world with some of our models are working with patients directly in markets like Australia, New Zealand, Singapore and our western and northern European teams working with hospitals and care delivery systems to achieve that 13% constant currency growth in Europe, Asia and America. Your line is now live. Your line is now live. Your line is now live. I actually created a video for the investors and the internal employees at one of our major electronic components suppliers to talk to them about how every chip they give us gives the gift of breath to a person who's suffocating and to really get that message through, I mean, I think you know in the huge demand for electric cars and, and cloud connected to consumer devices and an across the board demand is up across industries. And in short, our goal will be with all that work that Rob just talked about to make sure we take three steps forward, so that when you do get the two steps back of this and that component, we're still moving forward sequentially every quarter throughout the year, and then really freeing up as Rob said, the long term stuff starts to come into fruition over the next 3, 6, 9 months and beyond. Your line is now live. Your line is now live. Your line is now live. It's incremental, continuous improvement, step by step improvement of an amazing ops and supply chain team, and an amazing sales and delivery team working with customers on this allocation and understanding how to bring that product to market and understanding on the marketing side to just get ready for the demand gen that's going to need to happen to get all the backlog in and new patients in as we go in, throughout fiscal year 23 and beyond. Your line is now live."
}