{
    "symbol": "GLOP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 13:57:12",
    "content": " In the second quarter, we retired $20 million of debt and lease liabilities and purchased another $8.7 million of our preference units in the open market, bringing the total repurchase to $37.1 million since the repurchase program was initiated last summer. Turning to Slide 9 and the Partnershipâ\u0080\u0099s financial results for the second quarter of 2022, revenues for the second quarter were $85 million, a 21% increase for the second quarter of 2021. Adjusted EBITDA was $59 million, an increase of approximately $14 million or 31% from the second quarter of 2021, primarily due to a $14.5 million year-over-year increase in revenues. Finally, our adjusted earnings was $0.37 per unit, which increased by 270% compared to the second quarter of 2021. Our daily operating expenses per vessel were $1,729 lower in the second quarter of 2022 compared to the second quarter of 2021 and slightly above the full year guidance we gave on our last call due to inflationary pressures we have started to observe in our expenses. This reduction quarter-over-quarter was primarily due to a $1 million decrease in technical maintenance expenses and the decrease in vessel management fees partially offset by an increase in crew costs was largely related to the in-house management of the Solaris after delivering into our managed fleet on April 6, 2022 as I mentioned earlier. General and administrative expenses increased by $900,000 or $657 per vessel per day in the second quarter of 2020 compared to the second quarter of 2021. During the second quarter, we repurchased an aggregate of $8.7 million of our preference units in the open market. These repurchases have reduced preference unit distributions by approximately $3.1 million or $0.06 per common unit and we are not annualized second quarter distributions to preference unit holders and $0.07 per common unit based on the number of preference units outstanding as of June 30, 2022. We have made good progress on these goals despite the $104 million non-cash impairment charge we took in the fourth quarter of 2021 on our steams and additional impairment of $28 million in the second quarter of 2022 in connection with the two steams that we have classified as held-for-sale, as mentioned by Paolo earlier. The dip in 1-year time charter rates in the second quarter, which has been as high as $120,000 per day was related to the fire at the Freeport LNG export facility that have used the number of cargoes available for export and increased the number of rebates."
}