{
    "symbol": "TD",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-02 18:18:08",
    "content": " Adjusted revenue increased 16%, reflecting margin and volume growth in the Personal and Commercial Banking businesses and the impact of FX translation. Net interest margin was 2.80 -- 2.8%, up 10 basis points compared to the prior quarter, primarily due to higher deposit margins, reflecting rising interest rates, partially offset by lower margin -- lower loan margins. U.S. Retail Bank reported net income was US$955 million, up 18%, primarily reflecting higher revenue partially offset by higher noninterest expenses, including acquisition and integration-related charges for the First Horizon acquisition and higher PCL. Revenue increased 27% year-over-year, reflecting higher deposit margins and loan volumes, partially offset by lower loan margins and deposit volumes, lower overdraft fees and lower income from PPP loan forgiveness. Net interest margin was 3.29%, up 16 basis points sequentially as higher deposit margins, reflecting the rising interest rate environment were partially offset by lower loan margins and negative balance sheet mix. The U.S. Retail net PCL ratio, including only the Bankâ\u0080\u0099s share of PCL for the U.S. strategic cards portfolio, as an annualized percentage of credit volume was 0.34%, lower by 6 basis points sequentially. The contribution from TDâ\u0080\u0099s investment in Schwab was US$222 million, up 11% from a year ago, reflecting higher net interest income, partially offset by higher expenses, lower asset management fees and lower trading revenue. Insurance claims increased 29% year-over-year, reflecting the impact of changes in the discount rate, which resulted in a similar increase in the fair value of investments supporting claims liabilities reported in non-interest income, increased driving activity and inflationary costs, partially offset by fewer severe weather-related events. Wholesale Banking reported net income for the quarter was $331 million, a decrease of 24% year-over-year, reflecting higher noninterest expenses and PCL. Adjusted expenses increased 13%, reflecting continued investments in Wholesale Bankingâ\u0080\u0099s U.S. dollar strategy, including the hiring of banking, sales and trading and profession -- and technology professionals, higher severance and the impact of foreign exchange translation. The year-over-year increase primarily reflects the Stanford litigation settlement, a net loss from mitigation of impact from interest rate volatility to closing capital on the First Horizon acquisition, the recognition of a provision for income taxes in connection with the Canada Recovery Dividend and increase in the Canadian federal tax rate for fiscal 2022 and higher net corporate expenses. Gross impaired loan formations increased by 2 basis points to 16 basis points quarter-over-quarter, driven by Canadian Commercial Banking, primarily related to a new formation in the health and social services sector and some further normalization of credit performance, largely reflected in the Canadian and U.S. consumer lending portfolios. The allowance for credit losses increased by $113 million quarter-over-quarter, reflecting volume growth and credit conditions, including some deterioration in the economic outlook, partially offset by the impact of foreign exchange."
}