{
    "symbol": "TPVG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 20:56:02",
    "content": " We also entered into new debt commitments of $260 million during the quarter and additionally, our pipeline is now grown to more than $2 billion for venture growth stage companies at quarters end. Regarding second quarter investment portfolio activity, TriplePoint Capital signed a record $803.6 million of term sheets with venture growth stage companies and we closed a record $259.9 million of debt commitments to 17 companies at TPVG. During the second quarter, we funded $157.6 million in debt investments to 20 portfolio companies, which was well above our $50 million to $100 million guidance range for Q2. Our equity and warrant portfolio continues to grow well with 140 warrants in equity investments as of Q2 2022 as compared to 110 investments one-year ago and represents $107.9 million on a fair value basis, an increase of 71% from Q2 2021. We deployed capital using our attractive sources of leverage, which consisted of $390 million of fixed rate long-term investment grade notes, and a $350 million revolving credit facility that we renewed in July, while maintaining overall solid credit quality and increasing diversification in the portfolio. While we were very successful in funding new investments, totaling $157 million, approximately 30% was funded in the closing weeks of the quarter, which bodes well for the strong topline investment income growth in Q3 and beyond. Total unrealized losses included $16.8 million of mark-to-market adjustments on the loan portfolio, of which $13.2 million directly related to the Pencil and Pixel loans that was just covered by Sajal, as well as mark-to-market adjustments applied to our portfolio of fixed rate loans given the rise in the prime rate this quarter. Given the robust pipeline that we mentioned earlier, we ended the quarter with $234 million of unfunded investment commitments with an additional $96 million dependent upon the portfolio company, reaching certain milestones. With the completion of three separate five-year fixed rate investment grade loans over the last two and a half years and against the backdrop of a continued rising interest rate environment, our fixed rate borrowings account for 79% of our outstanding leverage at the end of the quarter, while 59% of our debt investments are at floating rates and stand to benefit from increasing interest rates over time. For example, during the next two quarters alone, we have more than $25 million in expected cash flows from contractual principal payments in the portfolio, excluding any loan prepayments and proceeds from the sale of public equity securities in our portfolio that may also occur. So I'd say â\u0080\u0093 as Jim said, listen, I think the reality of where the public multiples are and fundraising activity of the rest of the year, we expect our portfolio companies to continue to be able to raise, but I think again, raising flat is â\u0080\u0093 flat is the new up and up is amazing, but I'd say, we continue to expect to hold in that range of that 7% to 9% over the next couple of quarters."
}