{
    "symbol": "TPVG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 18:40:24",
    "content": " Despite current market volatility, it was notable that 56% of our portfolio companies that are active credits raised capital last year, representing almost $2.5 billion raised to 36 companies, of which more than $300 million came in the last quarter alone. Regarding investment portfolio activity during Q4, TriplePoint Capital signed $221 million of term sheets with venture growth stage companies, and we closed $105 million of debt commitments to 12 companies at TPVG. We also received warrants valued at $1.1 million in 16 portfolio companies and made $400,000 of direct equity investments in two companies. For the full year, TriplePoint Capital signed a record $2 billion of term sheets with venture growth stage companies, and we closed $594 million of debt commitments with 48 companies at TPVG, of which 34 were new obligors and 14 were existing obligors. During the fourth quarter, we funded $95 million in debt investments to 16 portfolio companies, which landed at the lower end of our guided range for Q4. During the full year, we funded $417 million of debt investments to a record 40 companies with a weighted average portfolio yield of 14.2% at origination. In 2022, we had $200 million of loan prepayment, resulting in an overall weighted average portfolio yield of 14.7% for the year. In terms of our expectations for portfolio growth in 2023, our range forecast for gross investment fundings for the full year is between $300 million and $500 million with Q1 and Q2, likely in the range of $50 million to $100 million for each quarter and Q3 and Q4 each likely to be in the $100 million to $150 million range. As of December 31, we held warrants in 107 companies, up from 81 companies as of Q4 2021 and held equity investments in 48 companies, up from 40 companies as of Q4 2021, with a total cost and fair value of $71 million and $96 million, respectively. For the fourth quarter, total investment income was $34.9 million, with a portfolio yield of 15.3% on total debt investments as compared to $25.9 million and 14.9% for the prior year period. The record level of total investment income was also the result of reaching a record year-end portfolio balance, with a portfolio fair value of $949.3 million at year-end, representing a 10% increase from a year ago. Net change in unrealized losses on investments for the quarter was $3.3 million, consisting of $0.5 million of net unrealized losses on our debt portfolio from reversals of previous unrealized losses and fair market value adjustments, $10 million of net unrealized losses on our warrant and equity portfolio and reversal of previous gains on ForgeRock. We ended the year with $324 million of unfunded investment commitments, of which $89 million was dependent upon the portfolio companies reaching certain milestones."
}