{
    "symbol": "TPVG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 21:10:28",
    "content": " In the first quarter here at TPVG our signed term sheets at venture growth stage companies was more than $650 million, the second highest since our IPO, topped only by the previous quarter. Regarding first quarter investor portfolio activity, TriplePoint Capital signed $657 million of term sheets with venture growth stage companies and we closed $126 million of debt commitments to 11 companies of TPVG. During the first quarter we funded $63 million in debt investments to 10 portfolio companies, which was the mid-point of our $50 million to $75 million guidance range for Q1, and an increase from $57 million in debt investments to seven companies in Q1, 2021. During the quarter eight portfolio companies raised over $800 million of equity capital as compared to 10 portfolio companies raising over $700 million of capital in total in Q1, 2021. Our equity and warrant portfolio continue to grow as well, with 128 warrants in equity investments as of Q1, 2022, up 36% from 94 warrants and equity investments one year ago, and represents $110 million on a fair value basis, almost double from $60 million as of Q1, 2021. While we experienced limited realized and unrealized valuation events in the first quarter, we did realize and record $3.1 million of net realized losses on investments, resulting from Casper Sleep completing its take-private transaction, and foreign currency adjustments on prepayments, and net unrealized losses on investments of $4.7 million resulting primarily from $3.5 million of net unrealized losses from fair value and mark-to-market adjustments, as well as the reversal and recognition of $1.2 million of previously recorded unrealized gains associated with investments realized during the period. We're here to help those companies accelerate growth, and the data shows right, those are the companies that are most attractive, both in good times and in volatile times for M&A, for a follow-on equity raise and let the cream rise to the top and so that's why again we think our investment strategy will outperform during volatility, because we focus on such high quality companies that they'll continue to attract, you know get more than the lion’s share of the capital that flows into the asset class. I would say software in particular, where they are coming to the debt markets versus last year, you know running into the equity markets and getting you know ten term sheets, and so again it's just – we’re seeing great companies looking for debt for the right reasons."
}