{
    "symbol": "CCOI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 17:21:03",
    "content": " Our revenue for the quarter increased sequentially by 1.3% to $152 million, an increase of 3.2% year-over-year. On a constant currency basis and also adjusting for the negative impact of universal service fee revenues on our revenue quarter-over-quarter or year-over-year on a quarterly basis, our revenues grew by 5.7% and for full year 2022 grew by 4.4%. On a constant currency basis, our NetCentric revenue growth for the quarter increased by 15.2% from the fourth quarter of 2021 and for full year 2022 grew by 16.7%. This is an increase of 8.2% in full-time equivalent sales reps. For full year 2022, we increased our sales force by a net number of $58 million or 11.8%. Over the next three years, we expect to continue to achieve significant cost savings through the integration of our networks, approximately reducing the network expense of the Sprint wireline network in North America by $180 million, achieving approximately $25 million in savings in the rest of the world on the Sprint wireline network; and then finally, achieving $15 million of savings for Cogent in its operation and maintenance expense for its North American network. Our quarterly corporate revenue declined year-over-year by 1.2% to $85.8 million from the fourth quarter of 2021, but as Dave mentioned, increased sequentially by 0.3%. For full year 2022, our corporate revenues declined by 4.4% to $342.6 million. On a constant currency basis, and if you adjust for the year-over-year decline in USF revenues, our total revenues for the full year increased by 4.4%, substantially better than the comparable 2.4% constant currency in USF tax adjusted revenue growth rate from 2020 to 2021. Our NetCentric business, which represented 43.6% of our revenues this quarter, had another solid quarter and grew by 2.6% to $66.2 million sequentially and by 9.6% year-over-year. For the full year, our NetCentric revenue grew by 11.1% to $257 million. Again, as Dave mentioned, the volatility in foreign exchange primarily impacts our NetCentric revenues -- so on a constant currency basis, our quarterly NetCentric revenue decreased year-over-year by 15.2% and sequentially by 2.5%. Our on-net revenue was $114.9 million for the quarter, a sequential increase of 1.5% and a year-over-year increase of 3.8%. Our EBITDA for the quarter, inclusive of the Sprint acquisition costs decreased sequentially by $0.7 million and decreased by $0.3 million year-over-year. Our EBITDA for full year 2022, inclusive of these costs increased sequentially by 1.2% to $230.6 million. Our fourth quarter and full year 2022 EBITDA results were impacted by the increase in our sales rep headcount, increased circuit costs related to our international expansion; and a year and $1.5 million onetime bonus that we granted to our eligible employees to help to offset the impact of inflation. Excluding Sprint acquisition costs, for the full year, our EBITDA increased by 2.2%, and our margin decreased sequentially by 220 basis points to 37.8% for the quarter and year-over-year by 120 basis points. If these average rates remain for the remainder of the quarter, the first quarter of 2023, the foreign exchange estimated impact on sequential revenues would be positive by $1.4 million, but year-over-year would be negative by the same amount, $1.4 million. We remain focused in our sales force productivity and sales force growth and continue to improve our sales training programs and manage out underperforming sales reps. On a sequential basis, our total sales rep headcount increased by a net of 26 or 5% sequentially and by 11.8% year-over-year to 548 quota-bearing reps. Our number of full-time equivalent reps, those reps that have been in the seat for more than three months increased to 503 from 465. We do project the stable revenue run rate of the acquired enterprise customer base to be approximately $450 million because the transaction is probably going to close sooner than we had initially anticipated, it is our expectation that at closing in the second quarter, the annualized run rate will actually be above $450 million. We've also identified a team of individuals, primarily Sprint sales professionals, but also some Cogent sales professionals will be focused on that customer base of about 1,200 large enterprises with the goal of improving the quality of their service, modernizing their networks and preserving that revenue initially and the ultimate expectation is that we will be able to grow the enterprise revenue base at about 1% to 2% per year. They've been through multiple technology refresh cycles, and we can improve margins and quality by bringing those services on net we think that we're being pretty conservative in our belief that we will see the $560 million run rate decline of $450 million that will plateau for a year or two and then only grow at a modest 1% to 2%."
}