{
    "symbol": "CCOI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 08:23:05",
    "content": "  Our revenue growth accelerated this quarter and our corporate revenues increased sequentially by 0.4% from the first quarter, the first time since the beginning of the pandemic, and is in part due to the increase in USF revenues. Our total revenues increased sequentially by 1% to exactly $150 million, an increase of 1.4% year-over-year. On a US GAAP basis, our corporate revenues increased sequentially 0.4% for the first time since the second quarter of 2020. On a constant currency basis, our Netcentric revenues grew sequentially 4.3% and increased by 16.8% from the third quarter of 2021. Our EBITDA margins, as adjusted for the $2 million extraordinary expense associated with the acquisition of T Mobile wireline, or known as the Sprint GMG business, that were incurred in the quarter increased sequentially by 50 basis points and by 90 basis points on a year-over-year basis to 39.9%. Our corporate business represented 57% of our revenues this quarter and our corporate revenue declined year-over-year by 4% to $85.5 million from the third quarter of last year, but, as Dave mentioned, increased sequentially by 0.4% for the first time since the second quarter of 2020. We have 45,176 corporate customer connections on our network at quarter-end, which was a sequential increase of 0.2% and a year-over-year decline of 0.8%. Our Netcentric business, which represented 43% of our revenues this quarter, and despite material FX headwinds, had another solid quarter and grew by 1.9% to $64.5 million sequentially and grew by 9.6% on a US GAAP and a year-over-year basis. On a constant currency basis, our Netcentric revenue increased year-over-year by 16.8%, which was an increase from the constant currency revenue increased last quarter of 16.2% and grew sequentially by 4.3%, which also was an increase from last quarter, which was 2.5%. On revenue and customer connections by network type, our on-net revenue was $113.2 million for the quarter, which was a sequential increase of 1.1% and a year-over-year increase of 1.9% Our on-net customer connections increased by 0.4% sequentially to 82,614 and increased by 3.1% year-over-year. Our off-net revenue was $36.6 million for the quarter, a sequential increase of 0.9% and a small year-over-year decrease of 0.1%. Our on-net ARPU, which includes both Corporate and Netcentric customers, increased sequentially by 0.5% from $455 to $458. Should these average foreign exchange rates remain at the current levels for the remainder of the fourth quarter of this year, we estimate that the FX conversion impact on our sequentially quarterly revenues for the fourth quarter would be a negative $1 million and the year-over-year conversion impact on our quarterly revenues would be a negative 4.3 million. We also know that, of the $450 million of revenue that we're acquiring from T Mobile, the Sprint business, most of that is concentrated in large enterprise customers that generate about $442 million of that $450 million in revenue. And even on an absolute basis, it should decline, but because we're picking up the wavelength product, the revenue scale is larger, rather than get to a kind of non-expansion CapEx number of $35 million, which was our maintenance number for Cogent, I think that number will be closer to $65 million for the combined company."
}