{
    "symbol": "CCOI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 12:10:05",
    "content": " For the quarter, the negative impact of USF on our revenues was $0.3 million and a negative of $1.4 million on a year-over-year basis. On a U.S. GAAP basis, our second quarter total revenues sequentially declined by 0.5% to $48.5 million and increased on a year-over-year basis by 0.4%. On a constant currency basis, our quarterly revenues increased sequentially 0.4%, an increase on a year-over-year basis by 2.7%. On a constant currency basis and also adjusting for the change and negative impact in USF revenues, our sequential quarterly revenues would have grown 0.6% sequentially and 3.6% year-over-year, approximately equivalent to the rate of growth in the last quarter. This increase represents the 40th consecutive sequential increase in our regular quarterly dividends, and our annual dividend growth rate today is 12.4%. And as Dave mentioned, our corporate revenue declined year-over-year by 5.9% and was $85.2 million and declined sequentially by 1.1%. A decrease in the USF tax rate, which only applies to our corporate VPN connections, had a $0.3 million negative impact on our sequential corporate revenue growth and a $1.4 million negative impact year-over-year. Our NetCentric business, which represented 42.6% of our revenues in the quarter, and despite very material FX headwinds, had another solid quarter and grew by 0.3% to $63.3 million sequentially and year-over-year by 10.2%. We had 50,674 NetCentric customer connections on our network at quarter end, a sequential increase of 2.4% and a 10% increase year-over-year. Our on-net revenue was $112 million for the quarter, which was a sequential decrease of 0.6% and a year-over-year increase of 0.8%. Our off-net customer connections increased sequentially by 1.8% to 13,160 and the year-over-year growth was 6.2%, which was an increase from last quarter. The average price per megabit for our installed base declined sequentially by 6.2% to $0.29 and year-over-year by 18.7%, and that year-over-year rate was better than our historical rate of decline of 21.5%. Our on-net ARPU, which includes both corporate and NetCentric revenues, declined sequentially by 1.5% and was $455. Our off-net ARPU, which is predominantly corporate customers, declined sequentially by 2.2% to $927. During the quarter, certain of our NetCentric customers took advantage of our volume and contract term discounts and entered into long-term contracts with us for over 2,460 customer connections, and that increased their revenue commitment to us by $23.3 million. Our quarterly EBITDA margin increased sequentially by 110 basis points to 39.4%, an increase year-over-year by 70 basis points. If these average rates remain at their current levels for the remainder of our third quarter, we estimate that the FX conversion impact on our sequential quarterly revenues for the third quarter would be a negative $1.1 million and the year-over-year FX impact would be a negative $3.8 million. While we did not repurchase any stock in the quarter and have $30.4 million remaining, we felt that the decision the Board took to increase our dividend for yet a 40th consecutive quarter to $0.905 per share for the quarter, representing a 12.4% growth rate in our dividend is consistent with our belief that our business is continuing to grow. I think for us to get back to a 2.5% sequential growth rate in corporate, we will have to see net absorption of central business district vacancy rates and tenants reoccupying sign those leases. We saw our NetCentric revenues were a direct result of this growth, grew at 10.2% year-over-year on a stated basis and 16.2% on a constant currency basis, so far above the long-term average growth rate of 9%."
}