{
    "symbol": "SIG",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-10 12:20:48",
    "content": " In Q1, you can see that we were able to leverage our costs significantly, and that as well had an incremental marketing spend ,so marketing for us is an effective mix of digital and social, and we are working that on a day-by-day, week-by-week basis with our marketing team, so we feel very good about our ability to be flexible and we’re holding the marketing spend within our guidance because of as the year progresses and the relative uncertainty of the back half and the potential shift of customer behavior to travel and other experience-oriented categories, we believe that’s very important for us to maintain that flexibility. Again if you have a question, please press star then one. We anticipated that there would be some tailwinds from stimulus and tax refund checks, and we actually broadened our assortment to reach more price points so that when we had customers either interact with us online or in store, we could get higher conversion rates - that’s what we saw, and particularly when we have a counseled sale, so for example in ecomm when someone interacts with one of our virtual consultants versus just navigating fully on their own, we’re seeing that ATV is up substantially, so that consultation really makes a difference to give customers confidence in the product that they’re buying. What we’re really pleased with, Dana, is that we’ve been able to continue on our working capital discipline and the lifecycle management, and as Gina said, inventory management is now institutionalized and as we think about that, that means the flexible fulfillment, the ship from store automation, buy online pick-up in store, and then having our inventory, all of our product--nearly all of our product available to all of our customers irrespective of channel is what we’re going to continue to work through and drive our assortment and drive our inventory efficiency. Again if you have a question, please press star then one."
}