{
    "symbol": "SIG",
    "quarter": 3,
    "year": 2022,
    "date": "2021-12-02 13:19:07",
    "content": " While both appeal to bridal customers, almost 30% of new Zales customers are on a self-purchase journey, up 400 basis points compared to two years ago, and 64% of new Kay customers are on a milestone or gifting journey to celebrate special moments in the lives of those they love, which is 700 points higher than two years ago. We didn't have capabilities like ship-from-store during our original analysis and no real way to capture each store's e-commerce halo but net tracking and macro level data, including traffic draw, tenant adjacencies and customer demographics for more than 30,000 retail venues in the U.S. We're analyzing customer needs down to an even more precise level to determine where connected commerce opportunity exists and how we can drive market share growth on a more localized basis. And what that says to me is that the work we're doing differentiating our banners and trying to broaden the mid-market segment that we play in with accessible luxury, as I discussed in my remarks, including the Diamonds Direct acquisition, including all of the work we've done to build a higher merchant -- higher quality merchandise assortment and custom capabilities at Jared, and of course, the continuing work that JamesAllen does to really pioneer creating optimal online bridal buying experience. So things like the merchandise margin expansion, the fleet optimization which has taken a lot of occupancy and labor costs, and it's enabled us to reinvest in advertising and capabilities that are going to drive growth and connected commerce capabilities that will drive growth as well and drive us to the jewelry category -- innovation leader in the Jewel category. But I will say, our high guide today reflects revenue of almost $7.5 billion, which I'm really proud of our team for all the great effort that they have put in to deliver not only banner differentiation, which is driving strong performance across our different banners, but also the innovation that we see coming in flexible fulfillment and how we're able to serve our customers."
}