{
    "symbol": "IGMS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 23:06:06",
    "content": " We are encouraged by the expanded safety and efficacy data for imvotamab at a 100 milligrams that we have developed through our clinical studies in non-Hodgkin's lymphoma, and we believe that imvotamab safety profile may be an important differentiating factor in the exciting new field of T-cell engagers in autoimmune disease. I am pleased to announce that we have now dosed more than 100 patients with IGM-8444 in our broad multi-indication, multi-combination Phase 1 study, and weâ\u0080\u0099re very excited about the safety and clinical activity profile that weâ\u0080\u0099ve seen to date in our combination with the standard FOLFIRI chemotherapy regimen in colorectal cancer patients. As you mentioned, we are announcing some encouraging safety and clinical activity data for imvotamab, which we think could offer a compelling and differentiated profile in the exciting new area of T-cell engagers in autoimmune disease. We announced today that as of our most recent data assessment, the incident of cytokine release syndrome was 9% overall safety evaluable patients treated with the 100 milligram titration dosing regimen in our Phase 1 and Phase 2 non-Hodgkinâ\u0080\u0099s lymphoma studies, and it was 13% overall safety evaluable patients treated with either 100 milligrams or 300 milligram titration dosing in these Phase 1 and Phase 2 lymphoma studies. As of the most recent data assessment, imvotamab has achieved a combined complete response rate of greater than 30% overall efficacy evaluable diffuse large B cell lymphoma or DLBCL patients in our Phase 1 and Phase 2 studies treated with the 100 milligram titration weekly dosing regimen, although, the patient numbers are too small to make a statistical assessment. In combination with these strong signs of clinical activity, we believe that imvotamab safety profile will be an important differentiating factor in the treatment of autoimmune diseases with T-cell engagers together with the potential to more effectively deplete pathogenic B-cell deep within tissues that may be refractory to current therapies. We are pleased with the safety in clinical activity profile that we have seen with imvotamab at 100 milligrams in our non-Hodgkin's lymphoma clinical studies to date, and we are excited to move forward aggressively in developing imvotamab for multiple autoimmune diseases. Your line is open. And so we've left things somewhat open in terms of if we get a strong signal that allows us to pick a dose and also confirm the magnitude of the benefit over the control arm, there's the potential that we can either stop this early and initiate a more formal registrational trial, or alternatively we could potentially with regulatory feedback expand this study to increase the number of patients on each of the arms and potentially use this as a randomized accelerated approval trial. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}