{
    "symbol": "BJRI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 20:29:03",
    "content": " From the top line sales perspective, our quarter three comparable restaurant sales increased 8.2%, as compared to the same quarter in 2019, which accelerated from 4.8% in the second quarter on the same three year basis. Because they remains a strong correlation between restaurant staffing levels and comparable restaurant sales, we intend to continue adding team members as necessary in the coming weeks to capture more sales in the near-term and to have the right teams in place as we head into the busy holidays, so we are able to maximize our fourth quarter sales potential. In summary, we are focused on a comprehensive set of initiatives aimed at significantly increasing our average weekly sales, growing our restaurant margins, and continuing our national expansion with a controlled pace in top quality sites with a goal of growing BJ's sales to $2 billion and beyond and delivering meaningful earnings growth and shareholder returns over time. Our restaurant level cash flow margin was 10.3% in Q3 of 2022 or 160 basis points lower than Q2 of 2022, which tends to be our highest sales quarter seasonally. Labor and benefits expenses at 37.7% of sales in the quarter were 50 basis points unfavorable for the third quarter of the prior year as reported, but 60 basis points favorable when removing the one-time ERTC benefit from the prior-year figure. Including -- included in our O&O expenses was marketing spend at 1.7% of sales, which was higher than the third quarter of 2021 by 40 basis points, driven by media investments, including connected television in certain markets to drive incremental sales. And while our sales to investment ratio are still above 1 based on the solid sales of new restaurants, it just makes us frankly, kind of, take a look across the board as to how we want to allocate capital at the current time, where we want to have that right balanced approach of investing in new restaurants knowing that now we've got these high return remodels, especially when we can add capacity and keep our concepts in a like new first-class and contemporary manner. I think third on that three legged stool is the capital allocation program and we'll continue to evaluate that in regards to share repurchases, but we don't want to do it at the expense of being able to invest back into remodels at our sales building initiatives and building new restaurants. We are looking at that as well, trying to look at the business and see the nice comp sales, and it's come down a little bit in Q3, still obviously very solid comp sales and mid single-digits in the 6%-plus range, as Tom talked about. And some of that is making sure we're doing the right thing for our team members and our managers and balancing it from the sales we'd expect, but even without that extra, call it, half an hour, the positive comp sales on a three year basis is -- in some weeks, it's higher than afternoon."
}