{
    "symbol": "BJRI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 21:52:07",
    "content": " BJâ\u0080\u0099s fourth quarter results demonstrated continued growth across key metrics, as we beat the industry as measured by comparable sales and comparable guest traffic according to Black Box, and we made further progress improving our restaurant level cash flow margins. Of note, our comparable sales performance has accelerated in fiscal 2023 to-date, driven by growth in the dining room guest traffic and an additional 3.7% of menu pricing, which is 190 basis points more than our pricing round that we took last February. To that end, our focus for 2023, this current year is about expanding our restaurant level margins through our sales driving initiatives, our margin improvement project, and allocating capital to high returning investments. Based on our current and expected sales growth trends, our margin improvement progress to-date, and expected further margin opportunities and additional pricing, we expect run rate restaurant level cash flow margins in the low to mid-teens as we exit 2023, assuming a continued healthy macro and consumer environment. When comparing margins, excluding the gift card breakage and ERTC benefits restaurant level cash flow margins improved by 250 basis points in the fourth quarter compared to the prior year. Adjusted EBITDA was 26.1 million and 7.6% of sales in our fourth quarter, which included the gift card breakage benefit, when again excluding the gift card breakage benefit from 2022 and the ERTC benefit from 2021, Q4 2022 EBITDA beat the prior year by 10.8 million with a margin that was 260 basis points higher. Labor and benefits expenses were 36.8% of sales in the fourth quarter after removing the gift card breakage benefit described earlier, our Q4 labor and benefits expenses were 37.1% of sales in the quarter, which was 140 basis points favorable compared to the fourth quarter of the prior year after removing the ERTC benefit. Occupancy and operating expenses were 23.5% of sales in the quarter after removing the gift card breakage benefit described earlier, our Q4 occupancy and operating expenses were 23.7% of sales in the quarter, which was 80 basis points favorable compared to the fourth quarter of the prior year as we leveraged higher sales. Factoring in our current sales and cost trends, I expect restaurant level cash flow margins to be in the 12% area in Q1 and expanding through the year as we grow sales through strategic initiatives, make additional progress on our margin improvement initiative and take additional menu pricing. And I think when we look at our business and think about the fact that we are looking somewhere in the seven to 8% menu pricing, so thinking about from the seven to 8% menu pricing, I think, we are thinking, you know, comp sales or revenue growth in the kind of maybe mid-single-digits or so, hopefully a little bit better."
}