{
    "symbol": "PLOW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 12:30:19",
    "content": " 2022 net sales increased approximately 14% when compared to 2021 and net income and diluted earnings per share both increased around 26%, and both segments produced improved year-over-year results. Also, looking at the fourth quarter, our financial performance also improved compared to last year, driven by continued price realization at both segments and higher volumes at Work Truck Solutions. On a GAAP basis, we recorded full year net income of $38.6 million or $1.63 per diluted share, an approximate 26% increase when compared to a net income of $30.7 million or $1.29 per diluted share in 2021. Work Truck Attachments net sales stayed about the same at a record $97.9 million with pricing actions offsetting lower volumes, which were impacted by below average snowfall in core markets and demand pull ahead in previous quarters. Net cash provided by operating activities decreased to $40 million for the year, primarily due to increased inventory, which was largely due to the following two reasons: First, the inflationary impact on our material costs account for approximately one-third of the inventory increase. We believe inventory will stabilize in 2023 and improve in years ahead as our record backlog is worked down and the supply chains improve moving back towards pre-pandemic levels when adjusted for inflation We are very pleased with our record fourth quarter free cash flow of $111.4 million, primarily driven by a record quarter for AR collections. So Sarah set out some long-term financial targets for that Solutions group, Mike, and what you saw in the fourth quarter, what you continue to see in 2023, it wonâ\u0080\u0099t be linear, but what youâ\u0080\u0099re going to see is positive profit improvement driven by things like new product launches or growth avenues that are not chassis dependent or profit improvement initiatives and product redesigns and cost reductions. I think the other piece that I would talk to would be that from a free cash flow perspective, we are not expecting significant improvement in the first quarter as the inventory that we had at the end of the year, it's unlikely we're going to work back down in the first quarter based on what we're seeing from a snow perspective. So when we look at the attachments business given the current snow season, if it does end up kind of playing out, we don't get any late season snow, how does that typically affect the coming year in terms of, I guess, quarterly cadence of demand trends like â\u0080\u0093 how much of the current year's snowfall impacts the coming year and the areas where you might be able to offset it with geographic expansion in some of these newer non-truck solutions that you're coming out with."
}