{
    "symbol": "PLOW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 16:02:01",
    "content": " We had a return way more typical first quarter in attachments versus the tremendously profitable first quarter we delivered last year, driven by a concentrated snowfall in February 2021. Beginning with work truck attachments, where we generated $45.8 million of net sales and $3 million of adjusted EBITDA. Net sales increased 9% due to higher pricing on higher input costs, which offset lower volumes when compared to the robust first quarter of 2021. On a consolidated basis, we delivered net sales of $102.6 million and gross profit of $21.1 million compared to net sales of $103.3 million and gross profit of $26.3 million during last year. SG&A expenses, including amortization expense, were $24 million compared to $22.6 million during the first quarter of 2021. We recorded GAAP net loss of $3.9 million or negative $0.18 per diluted share compared to a GAAP net income of $742,000 or $0.03 per diluted share in 2021. Similarly, we generated consolidated adjusted EBITDA of $4.6 million compared to $10.7 million in the corresponding period of the prior year. Interest expense was $2.1 million for the quarter, lower than the $3 million incurred in the same period last year as we benefited from the refinancing we completed in June of 2021. Adjusted EBITDA was $3 million during the first quarter, lower when compared to record adjusted EBITDA of $8.2 million recorded in the prior year. Accounts receivable at the end of the quarter were $43.1 million, in line with the $45.1 million at the end of the first quarter last year as expected. Capital expenditures for the first 3 months of 2022 totaled $2.2 million, consistent with the $2.2 million that was incurred last year. During the first quarter, we repurchased approximately 82,000 shares at a cost of approximately $3 million. Just on the back I know it's kind of a small amount, $3 million, but it's obviously one of your weaker free cash flow quarters."
}