{
    "symbol": "PLOW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 13:40:26",
    "content": " The revenue dropped through the bottom line with net income up 89% and adjusted EBITDA increasing 62%, due to higher volumes and improved price realization somewhat offset by operational inefficiencies due to supply chain constraints. Adjusted EBITDA improved compared to the third quarter of 2021, although our efficiency continues to be impacted by chassis and component supply plus inflationary pressures on material labor and freight costs. From a consolidated perspective, third quarter net sales increased approximately 30% to 166.1 billion and gross profit increased approximately 35% to 41.3 million when compared to the third quarter of 2021 due to increased volume and pricing adjustments. Interest expense increased by 1.1 million to 3.3 million, primarily due to higher interest on increased revolver borrowings compared to the prior year, plus higher interest rates on the term loan. The 33% increase was primarily attributable to increased volumes with a strong conclusion to the pre-season order period and higher pricing, compared to last year. Adjusted EBITDA was 22.9 million during the third quarter, 55% higher than the 14.8 million recorded in the prior year, due to increased volume, price realization, and inflationary pressures stabilizing, which was partly offset by increased labor costs. That brings us to Work Truck Solutions where we reported net sales of 57.9 million and approximate 25% increase on net sales, up 46.3 million in the third quarter of last year, due to higher volumes on more predictable, but still constricted supply of chassis and price realization. Adjusted EBITDA improved to 2.2 million, compared to 700,000 in the same period last year, but continues to be impacted by constructive supply of chassis and components impacting efficiency, plus inflationary pressures on material labor and freight costs. There are several factors involved, including increased accounts receivable of 41.2 million due to higher sales, as well as 33.7 million increase in inventory due to higher input costs and the pulling forward of purchases in anticipation of supply chain disruption."
}