{
    "symbol": "VERX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 18:14:06",
    "content": " In the second quarter, revenue was $119.3 million, up 13.7%, compared to last year's second quarter and exceeding the high end of our quarterly guidance by $1.8 million. Annual recurring revenue or ARR, was $398.1 million in the quarter, representing approximately 18.4% growth over the comparable 2021 period. As a reminder, in the second quarter of 2021, we recorded cloud-based revenues of $2.1 million from a tier-based subscription amendment to a cloud customer that we highlighted at the time. Adjusting for this amendment in the last year second quarter, cloud revenue quarter-over-quarter growth would have been 34%. Gross margin on subscription software revenues was 76.9%, compared to 77.3% in last year's second quarter and 76.6% in the first quarter of 2022. Gross margin on services revenues was 36%, compared to 35.3% in last year's second quarter and the first quarter of 2022. Accordingly, in the second quarter, Research and Development expense was $9.8 million or 8.2% of revenues, compared to $11.3 million or 10.8% of revenues in last year's second quarter. For the third quarter of 2022, we expect total revenues in the range of $121.5 million to $124 million, representing growth of 10% to 12% from the third quarter of 2021 and adjusted EBITDA in the range of $16.5 million to $18.5 million, representing a decrease of $3.4 million to $5.4 million from the third quarter of 2021. For the full-year 2022, we expect total revenues in the range of $480 million to $484 million, representing annual growth of 13% to 14% from the full-year of 2021. Obviously, as we monitor the ongoing evolution of OCI adoption of SAP S/4 adoption, we may see acceleration there, and it's certainly we're positioned well for that because of our content database and how well customers have relied on our content accuracy on-prem, when they're ready to make that migration to the cloud, it's a pretty seamless transition from their perspective because they want to get the same answer in the cloud that they were getting on-prem."
}