{
    "symbol": "VERX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 15:56:07",
    "content": " 2022 has started off incredibly well at Vertex with solid growth and positive progression across many dimensions of our business, resulting in total revenues of $115 million, up 17% year-over-year. Total first quarter revenues grew 17% year-over-year to reach $115 million, exceeding the upper end of our quarterly guidance by $1.5 million. Our annual recurring revenues, or ARR, grew to $380.6 million at March 31, 2022, representing approximately 18.9% growth over the comparable 2021 period. Our net revenue retention rate, or NRR, was 110% at March 31, 2022, growing from 105% for the comparable 2021 period and from 108% in the fourth quarter of 2021, demonstrating our customers' ongoing commitment to our software and solutions. In addition to the ARR growth, as mentioned above, our returns processing managed services business generated recurring services revenue of over $6 million in the first quarter of 2022 as compared to $4.9 million for the comparable prior year period. Our first quarter research and development spend, which includes our capitalized software development costs and cloud-based customer solutions was $19.8 million, representing 17.2% of revenues. First quarter selling and marketing expense was $25.6 million or 22.3% of total revenues, an increase of $6.9 million and approximately 36.5% from the prior year period. First quarter general and administrative expenses was $26.2 million or 22.8% of total revenues, an increase of $5.6 million from the prior year period. Adjusted EBITDA was $19.1 million for the first quarter of 2022, an increase of $1 million over the prior year comparable period and it exceeded the upper end of our quarterly guidance by $2.1 million, primarily due to our revenue performance and spend initiatives that shifted into the second quarter. Adjusted EBITDA margin for the first quarter of 2022 was 16.6%, a 187 basis point decrease versus the prior year comparable period, primarily due to our investments in go-to-market activities and strategic investments to drive our operating leverage. During the first quarter of 2022, we consumed $14.2 million in free cash flow, reflecting our ongoing investments in research and development and infrastructure modernization initiatives to support future revenue growth and operating leverage. For the second quarter of 2022, we currently expect total revenues in the range of $116 million to $117.5 million, representing growth of 11% to 12% from the second quarter of 2021. For the full year 2022, the Company continues to expect total revenue in the range of $479 million to $483 million, representing annual growth of 13% to 14% from the full year of 2021 and adjusted EBITDA in the range of $72 million to $75 million, reflecting our ongoing investments in acquisition integration as well as continued spend in research and development and selling and marketing expense to pursue opportunities for growth. Matt, one of the things we're finding is, and that's part of the strategy about bringing out new products is the more we start to surround our existing customers with new cloud-based solutions like our Edge solution that we launched at the beginning of the year, it will drive more migration opportunities for us. And then on the sales and marketing side, again, I think some of the differentiated relationships that we enjoy, we're able to talk to the communities that are out there, whether they be in our industry or related software sales industry about how we're able to bring them a differentiated go-to-market opportunity when they're talking to pursuing new customers, given things like the Oracle and SAP relationships."
}