{
    "symbol": "SAGE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 13:25:24",
    "content": " We will also be joined by Jim Doherty , who will provide an update on our launch preparations for the zuranolone in MDD and PPD if approved, and we will then be joined Kimi Iguchi, our Chief Financial Officer, who will review the financial results from the fourth quarter and full-year 2022; Laura Gault, our Chief Medical Officer will be available for questions during the Q&A portion of the call. Importantly, we've seen a consistent clinical profile to-date across the development program in MDD and PPD, including a rapid and sustained reduction in depressive symptoms as early as two or three days, a generally well tolerated safety profile, improvements in quality of life and overall health across domains of feeling, functioning and well-being, which I'll talk more about shortly. And finally, the potential for a flexible treatment approach in MDD and PPD that may provide optionality to healthcare providers and patients if Zuranolone is approved. We touched on this during our JPM presentation, but it's important to highlight in the context of the recent acceptance for filing of our NDA as these data suggest the potential for Zuranolone to improve measures of functioning and well-being that are important for patients with depression. Based on our PDUFA action date of August 5, if Zuranolone is approved for the treatment of MDD and PPD without extension of the FDA review period, we expect the potential launch near the end of 2023, following an anticipated three-month DEA scheduling review. Given the rapid improvement seen in clinical trial  to-date, we believe that if approved, Zuranolone has the potential to provide a new treatment option to patients suffering with MDD with the goal of helping them return to a state and well-being sooner. Given the unmet need, we believe that Zuranolone, if approved, is best positioned at launch for MDD patients requiring a first add or first switch therapy after continuing to experience depressive symptoms following their initial treatment course, including patients who have tolerability issues or non-compliance with chronic therapy. In PPD, we strive for Zuranolone to become standard-of-care at launch with use as first line therapy for treatment naive patients who are newly diagnosed with PPD or in place of other therapies currently administered. Thanks for taking my question. Thanks for taking my question. They've been impressed with the data, as I think they certainly understand for those interactions the opportunity that Zuranolone presents to deliver something that works, you know, in a rapid acting fashion after just three days, 14-day course something that's durable over time, does it come with this phenotype of side effects so often associated with other therapies and actually has the potential to return patients to a state of welding. I think in and around the second question around payer types, we're going to work with all different payer types regardless of the mix that they see to come up with solutions and making sure that Zuranolone is accessible at launch and again to really build on that understanding of unmet need and what Zuranolone can deliver from what we've seen in the data so far from what \n Thank you. If you pick up the newspaper where you go online, you see that just like MDD, there is a significant normal crisis credit with moms from the most part of depression that we're talking about 500,000 or so cases of PPD on an annual basis, so one in eight  so it's absolutely paramount that we continue to do the work that we're doing in and around working with OBGYN and other prescribers that also see patients that are suffering from PPD to help understand the importance of diagnosis or screening and diagnosis. That's really because of the challenging to get diagnostic treatment, when you have an agent like Zuranolone that works quickly with a 14-day regimen, we see the opportunity for physicians to look more rapidly for the diagnosis of PPD and certainly diagnostic paradigm is indeed less PPD. Thanks for taking my question. Thanks for taking my question."
}