{
    "symbol": "SAGE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 12:25:32",
    "content": " As a reminder, in the 50 milligram cohort of the SHORELINE Study, 80% of patients who responded to the initial two-week treatment with zuranolone and 50 milligrams only received one or two treatment courses during their time in this year-long study, with a median time to the second treatment course of 249 days. In our early engagements with payers, we have also heard that they believe zuranolone has the potential to be a promising new option for the treatment of both MDD and PPD with a new MOA and with clinical data suggesting the potential to provide rapid and sustain relief and depressive symptoms for patients and a generally well tolerated safety profile. As such, we believe that it's essential that we work with payers to try to minimize barriers that can impact the healthcare professionals' ability to prescribe zuranolone to treat MDD and PPD, so their patients have the potential to obtain rapid and sustained relief of their depressive symptoms. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And again, we're entirely excited about the totality of zuranolone in both MDD and PPD, clinically meaningful reductions in depressive symptoms with consistent improvements in mood and anxiety, the rapid onset of action, which we talked about as little as two or three days, the two week treatment course and the well tolerated potential certainly is an oral therapy that we clearly believe the world needs. Your line is now open. So with respect to our go-to-market approach, it's going to be absolutely important that we get out there quickly with that message, with the data that we have to reach those clinicians that you talked about getting to with an omnichannel approach, also making sure that we're able to reach patients with that message around what zuranolone has the potential to deliver. Your line is now open. Your line is now open. What we know from the market research is  given that there are a number of generic medications that have been available now for 30 to 35 years, there still is profound unmet need and patients need new therapies with new MOAs like zuranolone that offer rapid and lasting relief without the tolerability issues and the stigmatizing side effects that you see with other therapies that they've become  with all with just a 14 day course of therapy. And last but not least, I think patients I think as Barry noted in our -- in his comments about our go-to-market approach, it's going to be really important from an omnichannel perspective that patients early are aware of zuranolone and the distinction at zuranolone offers relative to perhaps the way that they've experienced other antidepressants in the past with respect to the rapid onset of action and the sustained relief all over just requiring a two week course of therapy. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}