{
    "symbol": "RBC",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-10 16:12:06",
    "content": " So net sales for our third quarter for fiscal 2023 were $351.6 million versus $267 million for the same period last year, 31.7% increase. Adjusted operating income was $71.6 million, 20.4% of net sales compared to last year of $46.3 million and 17.3%, respectively. Adjusted EBITDA was $103.3 million, 29.4% of net sales compared to $71.4 million, 26.7% of net sales for the same period last year. As a percentage of net sales, SG&A was 16.1% for the third quarter of fiscal 2023 compared to 15.6% for the same period last year. For the third quarter of fiscal 2023, expenses included $17.4 million of amortization of intangible assets, $1.2 million of costs associated with the Dodge acquisition, and $0.3 million of other expense. For the third quarter of fiscal 2022, other operating expenses consisted of primarily of $23.5 million of costs associated with the Dodge acquisition, $12.1 million of amortization of intangible assets, and $0.2 million of other items. Excluding approximately $1.2 million of acquisition costs, adjusted operating income was $71.6 million or 20.4% of sales for the third quarter of fiscal 2023. Excluding approximately $30.4 million of acquisition costs, adjusted operating income for the third quarter of fiscal 2022 was $46.3 million or 17.3% of sales. We anticipate total interest expense of between $21 million and $22 million for the fourth quarter of fiscal 2023 at an effective tax rate between 23% and 23.5%, excluding discrete your unusual items. For the third quarter of fiscal 2023, the company reported net income of $36.3 million compared to $0.5 million for the same period last year. On an adjusted basis, net income was $53.3 million for the third quarter of fiscal 2023 compared to $40.6 million for the same period last year. On an adjusted basis, net income available to common stockholders for the third quarter of fiscal 2023 was $47.7 million compared to $34.8 million for the same period last year. On an adjusted basis, diluted earnings per share for the third quarter of fiscal 2023 was $1.64 per share compared to adjusted diluted earnings per share of $1.20 per share for the same period last year. Please proceed with your question. Please proceed with your question. And you know we acquired Dodge in November of 2021, and we were at a run rate, an actual rate of sending the previous owner of Dodge $18 million a year to support computer systems and other activities that couldn't be transferred day one. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And so that's kind of a boomer bus area and it's busted right now and that's sort of $15 million to $25 million a year annualized and it doesn't have particularly good margins, so frankly we don't really miss it."
}