{
    "symbol": "RBC",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-07 12:09:01",
    "content": " I will start off by saying that net sales for the first quarter of fiscal â\u0080\u009823 were $354.1 million versus $156.2 million for the same period last year, an increase of 126%. Gross margin for the quarter was $141.2 million, 39.9% of net sales compares to $63.8 million or 40.8% for the same period last year. Adjusted operating income was $68.3 million, 19.3% of net sales compared to last year of $29.9 million and 19.1%, respectively. Adjusted EBITDA was $100.7 million, 28.4% of net sales compared to $45.3 million, 29% of net sales for the same period last year. As a percentage of net sales, SG&A was 15.8% for the first quarter of fiscal 2023 compared to 20% for the same period last year. For the first quarter of fiscal 2023, other operating expenses included $17.3 million of amortization of intangible assets, $3.8 million of costs associated with the Dodge acquisition and $0.2 million of other income. For the first quarter of fiscal 2022, other operating expenses consisted primarily of $2.6 million of amortization of intangible assets and $0.6 million of restructuring costs and other items. On an adjusted basis, operating income would have been $68.3 million for the first quarter of fiscal 2023 compared to adjusted operating income of $29.9 million for the first quarter of fiscal 2022. Interest expense for the first quarter of fiscal 2023 was $15.8 million, including $2.3 million associated with the amortization of deferred financing fees. For the first quarter of fiscal 2023, the company reported net income of $37.4 million compared to net income of $24 million for the same period last year. On an adjusted basis, net income was $40.2 million for the first quarter of fiscal 2023 compared to $24.3 million for the same period last year. On an adjusted basis, net income available to common stockholders for the first quarter of fiscal 2023 was $34.5 million compared to $24.3 million for the same period last year. Diluted earnings per share, was $1.09 for the first quarter of fiscal 2023 compared to $0.95 for the same period last year. On an adjusted basis, diluted earnings per share for the first quarter was $1.19 compared to adjusted diluted earnings per share of $0.96 for the same period last year. As a result of these adjustments, the total expense recognized in fiscal 2023 is expected to be less than previously anticipated, including a reduction of more than $5 million for the total for the rest of the fiscal year. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}