{
    "symbol": "RBC",
    "quarter": 2,
    "year": 2023,
    "date": "2022-11-11 16:45:03",
    "content": " Net sales for the second quarter of 2023 were $369.2 million versus $160.9 million for the same period last year, an increase of 129.4%. Adjusted operating income was $76 million, 20.6% of net sales compared to last year of $20 million and 12.4% respectively. Adjusted EBITDA was $108.8 million, 29.5% of net sales compared to $45.4 million and 28.2% of net sales for the same period last year. SG&A for the second quarter of fiscal 2023 was $57.5 million, compared to $40.2 million for the same period last year. As a percentage of net sales SG&A was 15.6% for the second quarter, compared to 25% for the same period last year. Other operating expenses for the second quarter of fiscal 2023 totaled $21.6 million, compared to $5.7 million for the same period last year. For the second quarter of fiscal 2023, other operating expenses included $16.8 million of amortization of intangible assets, $4 million of costs associated with the Dodge acquisition and $0.8 million of other expense. For the second quarter of fiscal 2022, other operating expenses consisted primarily of $2.8 million of amortization of intangible assets, $1.4 million of acquisition costs, $1.1 million of restructuring costs and related items and $0.4 million of other items. Operating income was $72 million for the second quarter of fiscal 2023, compared to operating income of $16.6 million for the same period in fiscal 2022. On an adjusted basis operating income would have been $76 million for the second quarter of fiscal 2023, compared to adjusted operating income of $20 million for the second quarter of fiscal 2022. Interest expense for the second quarter of fiscal 2023 was $18.3 million, compared to $15.8 million for the same period last year. For the second quarter of fiscal 2023 the company reported net income of $43.8 million, compared to a net loss of $1.4 million for the same period last year. On an adjusted basis, net income was $61.9 million for the second quarter of fiscal 2023, compared to $30.5 million for the same period last year. Net income available to common stockholders for the second quarter of fiscal 2023 was $38.1 million, compared to a net loss of $1.9 million for the same period last year. On an adjusted basis, net income available to common stockholders for the second quarter of fiscal 2023 was $56.2 million, compared to $29.9 million for the same period last year. Diluted earnings per share, was $1.31 per share for the second quarter of fiscal 2023, compared to a loss of $0.07 per share for the same period last year. On an adjusted basis, diluted earnings per share for the second quarter of fiscal 2023 was $1.93 per share, compared to adjusted diluted earnings per share of $1.16 per share for the same period last year. Turning to cash flow, the company generated $29.3 million in cash from operating activities in the second quarter of fiscal 2023, compared to $40.2 million for the same period last year. Well, if the baseline changes from $1 to $1.50 and if inflation goes from whatever it was last quarter, 8% to 2%, we're going to see a 2% adjustment on $1.50 and that adjustment will be up."
}