{
    "symbol": "WEX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 16:20:05",
    "content": " Now turning to our results, in the first quarter, we once again delivered record revenue generating $518 million a year-over-year increase of 26%, driven by a continued recovery in travel volumes, a strong increase in fuel volumes, a very good open enrollment season and a favorable fuel price environment. To put this in perspective of the $107 million of year-over-year revenue increase, approximately $38 million was related to higher fuel prices and unfavorable foreign exchange rates. Total purchase volume processed across the organization in first quarter, grew 66% year-over-year to a record high $28 billion, reflecting the strong double-digit growth rates in each of our segment. For the first quarter, total revenue exceeded the high end of our guidance for three primary reasons: continued fleet volume favorability, accelerated ramp and travel spend, and higher fuel prices. Fleet revenue for the quarter with $319.1 million, a 31% increase over prior year, powered by strong volumes from new customer wins and renewals, higher fuel prices and recovery in the existing customer base. This also means that excluding the impacts of fuel prices we are raising our 2022 guidance at the midpoint by $30 million in revenue and $0.20 in EPS, based on our strong Q1 results and a continuation of both good execution and a rebound in volume. In the over-the-road business we are hearing from customers that they're seeing a little bit more softness than they have over the last couple of years in terms of just volume trends, but I would say on the – a little bit side to emphasize that the spot rates are softer than they have been. So from, to kind of run across the business from a freight perspective, like I said they're seeing a little bit of softness in spot rates, which will translate into a little at less revenue in our factoring business, but from a volume perspective, volumes remains strong. And we've assumed that within our second quarter guidance and for our full year guidance, one of the things that and we thought about when we laid our guidance for both second quarter and the full year is the second half of last year we started to see this kind of movement in reopening and some strong trends that we just – we continued to see. Your line is open. Your line is open. And you can see from our perspective, like what we said last quarter is from a rate perspective that as we'd lend in more embedded payments customers into our corporate payments business that you would see that rate trail down during the course of this year, which is what we did see, as expected. Your line is open. But in terms of the framework we gave where we said, we’re going to existing customer growth, net new customers coming on new products and M&A, we feel, really good about how we’ve landed the first quarter very much and that framework with the additive part coming from existing customer growth. Your line is open. And from our perspective, we feel like we have been thoughtful about where travel scale, where we believe we’re going to see volume trends really across the business, and that’s what we factored into the guidance that we provided. Your line is open."
}