{
    "symbol": "WEX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 16:43:06",
    "content": " I'm pleased to report that in the second quarter, we once again delivered record revenue and adjusted net income per share with organic revenue growth of 22%, driven by strong volume trends across the business. Record quarterly revenue paired with scale efficiencies in our business model, resulted in adjusted net income for diluted share at $3.71, an increase of 61% compared to the same quarter last year. We're seeing cross-channel sales momentum across the WEX ecosystem with new virtual cards and health product sales to some of our existing fleet customers, including a leading provider of global automotive wholesale, financial software and media services and one of the largest truckload carriers in the U.S. We're building out our cross-sell infrastructure, including leveraging our data platform that allows sales to have a single view of the customer as well as cross-sell training programs for our account executives. For the second quarter, total revenue exceeded the high end of our guidance by more than $30 million due to a combination of record high travel and corporate payments purchase volume and higher fuel prices. Fleet revenue for the quarter was $379.2 million, a 38% increase over prior year powered by strong volumes from new customer wins and renewals, record high fuel prices and a continued recovery in the existing customer base. Corporate Payments customer volume grew 29% versus last year, and revenue was down 18% as reported but up 21% after adjusting for the previously mentioned accounting presentation change led by continued strength in the partner channel. Jagtar said in his prepared remarks, but the overall portfolio really looks strong, we continue to be pleased with both the volumes that we're seeing with our customers and what's happening within our accounts receivable portfolio. And so the growth rates that we assumed in the second half of the year in a more normalized environment than what we've seen in the last couple of quarters, it's still really strong."
}