{
    "symbol": "DRIO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 13:00:51",
    "content": " But if we put that portion aside and we are looking on the pure B2B2C business, and with the potential additional couple of millions of dollars that we were supposed to have from this national health plan, we are very confident that moving forward, we should be back to somewhere between 50% to 60% for the next few quarters. So overall, with these health plans that we have with a potential additional health plan that we're going to sign shortly with more strategic accounts that we're going to get in, we believe that we are making the right decision in terms of reducing the B2C. We're anticipating that we are going to bring in at least one additional health plan this year, and we're seeing sustained traction actually with Sanofi, especially on the commercial side, where we're co-selling with their market access team into health plans and have strong traction in terms of doing that. And then if you -- on the next slide, really, that's just showing the fact that we're growing from 51 contracts in 2021 to 100 or 100 plus in 2022, and we think that we're well on target to meet that strong growth in terms of the number of contracts that we line. One is on the commercial side where we're co-selling into health plans alongside their market access teams, which has substantially increased our health plan sales resources into those areas, and we have seen strong traction over the second quarter in terms of penetration into account, and that will continue to go forward. I've spoken about spoken about them, but we think that this is a very important part of our business, and we're definitely seeing acceleration through these partnerships, Sanofi, obviously, I've talked about Virgin Pulse in terms of medium- to large-size customers that enables us to reach those customers more efficiently and then implement them very quickly on the Virgin Pulse platform, and we've already seen traction in customers on that side and are growing, as I mentioned, a pipeline of customers behind that. So as I stated on the call itself, we're going to see an impact on Q3 and Q4 of this year by reducing the B2C, but we think that the impact on 2023 and 2024 is going to be marginal because of the big accounts that we are signing on and because what we have also in the pipeline. In terms of the strategic, if we are looking on the overall revenue that we are recognizing -- recognized in Q1 and Q2 versus the second half of the year, we should see additional revenue recognition, but probably lower than what we have seen in Q1 and Q2. So overall, the B2B2C, hence, employers and health plans, we're going to see a relatively high growth between the first half of the year to the second half of the year. And if we are looking on the strategic, probably we're going to see a decline between the first half of the year to the second half of the year, and this is due to the way that we are delivering each of the streams that I mentioned, data, development services and also market access."
}