{
    "symbol": "DRIO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 13:35:05",
    "content": " And we talked also about a super user-centric business model with a SaaS kind of, revenue -- recurring revenue that end up with high gross margins for -- which is something that's super relevant for software company like Dario. And we do believe that moving forward, we're going to see more strategic agreements with companies that are coming from the health care, more traditional players that are also becoming more-and-more believers of digital health and digital therapeutics is something that would create a lot of value and will change health care. I would say that, probably the smallest contribution relative to the other markets would have been health plans in the current quarter, as that continues to ramp up, but we expect that that will catch-up rapidly in the second and third quarters with the new health plans coming online. I'm just -- my comment was with more health plans coming on you're going to see that ramp happen -- continue to happen in the second, third and fourth quarter. Providers, I would expect that we'll see a small handful of providers in the second and third quarter, coming through as I said in -- during the presentation is that we're rotating sales resources out of that segment. And then I would say, the third and fourth quarters where you're going to see more accounts because of the fact there are more contracts, because that's when we'll start to see the employers that are on a January to December cycle, which is 70% of employers that's when they'll come in in fourth quarter. I would guess, that there's their product mix in terms of what they're selling into health plans, has changed and historically they haven't really sold into fully insured health plan business. And so maybe there's some adjustment there, because there's certainly a difference in time frame but we're still seeing things happen in that 12 to 18-month sales cycle that we've talked about for many quarters, not seeing a slowdown in terms of health plans interest. If anything I would say, we're seeing more interest in digital health solutions and health plans than we did, a year ago let's say, just to pick a time for it."
}