{
    "symbol": "GOTU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-08 12:09:05",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by, and welcome to the Gaotu Techedu Inc. Second Quarter 2022 Earnings Conference Call. Larry will give the general business overview for the quarter, and Nan Shen will discuss the financials -- on the prepared remarks, Larry and Nan Shen will be available for the Q&A session. These forward-looking statements are based upon management's current beliefs and expectations as well as the current market and operating conditions, and they will involve known or unknown risks, uncertainties and other factors, all of which are difficult to predict, many of which are beyond the company's control and may cause the company's actual results, performance or achievements to differ materially from those contained in any forward-looking statements. Our growth billing nearly doubled compared with that of last quarter, and we successfully generated positive net operating cash flow. Moreover, our net loss substantially narrowed year-over-year, and this is the third consecutive quarter that we realized non-GAAP profitability after our business restructuring. Going forward, we will continue to focus on educational services for college students and adult, non-academic tutoring services and educational contents and digitalized learning products, continue to uphold our strategy of profitable growth and continue to strive for effective growth through improving operational efficiency and optimizing cost structure. During this quarter, our net revenue reached RMB 537.8 million, and our gross billing increased 92.3% quarter-over-quarter to RMB 611.7 million. To provide a consistent basis of comparison, if we compare continuing businesses, the net revenues of our comparable business sales increased over 30% quarter-over-quarter. Further, our gross margin this quarter was 70.2%, slightly higher than that of the same period of last year. Additionally, we also generated a net operating cash flow of RMB 93.8 million, demonstrating that we have achieved effective growth. In the second quarter, we upgraded our user products and made a solid progress in our main businesses. To better serve our students, we have equipped our APP with additional tools, including independent many programs for key business lines, delay of coming live streaming announcement and exam guide as well as new features such as a mock examinations and test banks, teacher-student interactions and exam reminders. By reaching out to a larger and broader customer base, our APP has delivered better performance in customer retention and generated more synergies among our business lines, thereby expanding our customer acquisition channels while reducing marketing costs. In May, we released the go-to college students post-graduate entrance examination white paper, which present detailed guidance and a new medical analysis that we summarized based on numerous surveys and studies, and is intended to have student stand -- typically prepare for their exams and then reports their passing rate. Additionally, our non-academic tutoring services also delivered a solid performance in this quarter. It not only achieved quarterly operating profit, but also contributed positive net operating cash flow. For instance, the retention rate of our programming tutoring business was almost 8% during this quarter, and its cross-billings increased approximately quarter-over-quarter. Third, ROI for selling expenses and employee efficiency both increased during the quarter. Going forward, guided by our effective growth strategy, we will continue to implement control on marketing expenses and continue to further improve ROI for the selling expenses and operational efficiency. Over the next 18 and even 28 years, we will continue to offer exceptional services, create better products, provide superior content, empower more students and build a better go to. During the second quarter, through optimizing costs and enhancing operational efficiency, we continued to achieve effective growth under this challenging economic environment. Additionally, net loss was hugely narrowed by 94.6% year-over-year to RMB 49.8 million on the GAAP basis. We are also seeing a positive net operating cash flow of RMB 93.8 million, with that, our capital position remains strong. As of June 30, 2022, we had a total of approximately RMB 3.4 billion in terms of cash, cash equivalents, restricted cash and short-term investments on our balance sheet, providing ample resources for continued business development. Going forward, we will continue to focus on our 3 core businesses, educational services for college students and adults, non-academic tutoring services and educational content and digital learning products, well guided by our strategy of sustainable growth. As the new businesses we initiated after our business restructuring are still in their early development phases, we will compare our financial performance on a quarter-over-quarter basis, alongside with year-over-year comparisons to better present the development of our comparable businesses. In the second quarter of 2022, our net revenues decreased 75.9% year-over-year to RMB 537.8 million. To provide a consistent basis of comparison, if we compare our comparable businesses, our net revenues achieved healthy growth with a higher than 270% increase year-over-year and over 30% increase quarter-over-quarter. We would like to point out that from the second quarter onwards, our net revenues and gross billings come from continuing businesses. Among that, gross billings for non-academic tutoring services showed substantial quarter-over-quarter increase. The performance for non-academic treating services displayed seasonality as cost retention normally happened during the second and the fourth quarter of the year, during which up from  will be collected, and therefore, gross billings will increase. Our gross profit decreased 74.9% year-over-year to RMB 377.8 million, which give us a gross profit margin of 70.2%, 269-basis-point higher than that of the same period of last year. Non-GAAP gross profit was RMB 396.4 million, and non-GAAP gross profit margin was 73.7%. To break down the operating expenses, selling expenses decreased by 83.6% year-over-year and 5.3% quarter-over-quarter to RMB 269 million. Selling expenses margin for the first quarter was 50%, a solid decrease compared to the same period of last year. Since different customer acquisition strategies are suited for different business lines, after our restructuring, we prefer to acquire new customers more vertically, and we have upgraded our model for private traffic operations to better identify potential customers with high conversion rates. Further, we will continue to establish our branding in the education industry through exceptional service, superior quality and better learning results, and gradually become more reliant on customer acquisition through  referrals, and in this way constantly lower our customer acquisition cost and the selling expenses margin to pursue shareholder value and the sustainable growth. Since our new businesses are still in the early development stage, initial fixed costs, including R&D expenses, are still taking up a relatively high proportion of net revenues. Due to the effect of restricted stock units offered to employees in the past years, the share-based compensation expenses were still being recognized towards cost and expenses , and thus, took a high proportion of net revenue causing a relatively wide gap between GAAP and non-GAAP bottom line. With the end of this acceleration and the increase in our revenue, we expect share-based compensation expenses to gradually account for a lesser and lesser proportion of revenues in the following quarters. Additionally, our net operating cash flow turned positive this quarter, reaching RMB 93.8 million and representing an improvement in efficiency compared with the same period of last year and last quarter. As of June 30, 2022, we had RMB 591.5 million cash, cash equivalents and restricted cash, and RMB 2.8 billion short-term investments, which totaled approximately RMB 3.4 billion, providing ample resources for continued business development. Before I provide our business outlook for the next quarter, please allow me to remind everyone that this contains forward-looking statements, which involves risks and uncertainties, which are beyond our control and could cause the actual results to differ materially from our predictions. Based on our current estimates, net revenues for the third quarter of 2022 are expected to be between RMB 576 million and RMB 596 million, representing a decrease of 46.5% to 48.3% on a year-over-year basis. We are gradually becoming more focused on our businesses and products to target a more vertical student population and in this way, to create synergies between our users and to enhance our branding and to increase the market penetration rate. As such, during this quarter, we are focused on the 3 main businesses, including educational services for college students and adults and academic tutoring services and educational content and digitalized learning products. So currently, we did not disclose our revenue breakdown in detail because our current revenue structure is not a very perfect indication for what's going on, and we expect it to change in the following quarters as our revenues grow larger. Like this quarter, I mean, in the second quarter, our academic tutoring services and educational content and digitalized learning products, combined together, contributing roughly 60% of our revenues and constantly contributed operating profit and sizable net operating cash flow. And other than the 60%, the rest of the -- our 40% revenue were contributed by educational services for college students and adults, which includes some vertical categories such as whether through entrance exam preparation and civil servants exam preparation and also like financial and accounting qualification test preps as well as other exam preparation categories. So then if you're looking to next quarter for Q3 outlook, we foresee all these 3 categories of revenue to grow, but it still depends on like the seasonality and the different stages. If we look into last quarter, this business achieved over 200% year-over-year growth and gross billing also achieved over 68% year-over-year growth. So further, some of our business lines raising this group have achieved a quarterly operating profit, such as financial qualification prep businesses. And also, like the graduate school entrance exam preparation businesses also achieved around 30% quarter-over-quarter growth in revenue. So based on this, because we invest in certain categories, and they all like grow in a sustainable way so we can see that in Q3, we do foresee like our education services for the college students and working adults to continue to grow. Then for the second quarter and the fourth quarter, that's usually when the students started to take the courses, so we will see revenue to grow."
}