{
    "symbol": "GOTU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-06 11:32:04",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by and welcome to the Gaotu Techedu Inc. First Quarter 2022 Earnings Conference Call. Good evening, everyone, and thank you for joining us on our first quarter 2022 earnings conference call. These forward-looking statements are based upon management's current beliefs and expectations as well as the current market and operating conditions and they involve known or unknown risks, uncertainties, and other factors, all of which are difficult to predict and many of which are beyond the company's control and may cause the company's actual results, performance or achievements to differ materially from those contained in any forward-looking statements. Thank you for joining us on our 2022 first quarter earnings conference call on this special day, which happened to be Gaotu's third year listing anniversary. In the first quarter of 2022, our business continued to maintain a healthy and sustainable development and we can remain profitable for two consecutive quarters since we began our business restructuring. In this quarter, our net revenues were RMB724.6 million, and our gross billings were RMB318.1 million to present the basis of comparison. If we only look at our comparable businesses, which are professional education for college students and adult, vocational education, STEAM education and digital educational products. Moreover, gross billings of comparable businesses have shown quarter-over-quarter growth for three consecutive quarters. Our net income and non-GAAP net income were RMB53.7 million and RMB92.5 million, respectively, indicating that we have achieved effective growth. As of March 31, 2025 -- and '22, we had a total of approximately RMB3.2 million -- sorry, RMB3.2 billion in terms of cash, cash equivalents, restricted cash and short-term investments on our balance sheet. Since we initiated our business restructuring and organizational adjustments in the third quarter of last year, our operations have been centered upon three key effects, focusing on the core businesses, enhancing product quality and improving operational efficiency. First, in terms of focusing on our core businesses, we will continue to concentrate on online education, and we will continue to develop and invest in our four core businesses, which are professional education for college students and adults, vocational education, STEAM education and digital educational products. During this quarter, the skill of our professional and vocational education services further increased compared with that of the last quarter. Our STEAM education service has also made solid progress, especially in program in tutoring businesses which grew over 10x year-over-year in terms of gross billings. Through the gradual development of our new businesses, we will continue to expand our product portfolio across various categories. We will also expand our advantages in the high school tutoring services to other businesses continue to offer 15 students upgraded and modified courses that satisfy related government policies, fulfill the diverse and multidimensional learning demand of students and to build a true  and service platform. Second, in terms of enhancing our product quality, we believe that now is the best time to accumulate know-how, service our regional aspiration to educate and return to the fundamental essence of education. We will continue to invest in teaching the store sales offer the best education content and products, and we will continue to invest in technology to provide more user-friendly and personalized products. In the quarter, research and development expenses accounted for 17% of our total revenue, returning to a relatively high proportion as reflecting our emphasis on the importance of R&D and online education. Because our new businesses are still in their early development stage, adequate R&D investment is essential, but we will gradually reduce and strictly control our R&D and other operating costs to be within a specific range as we execute our strategy of effective growth and constantly evaluate the development of our business. Going forward, we will uphold our principles of good teachers are fundamental and our corporate value of the customer first, continuously refine our product quality based on a long-term view and strive to provide the best educational services in the industry to students, and that creates the most value for our customers. By firmly focused on customer value proposition and the firmly investing in the capabilities to deliver value, we believe we will generate sustainable and high-quality revenue growth. After a profitable last quarter, we continue to profit with 12.8% non-GAAP and income margin in this quarter, indicating that we have achieved healthy and sustainable growth. As end margin this quarter decreased 79 percentage points compared with that of the same period of last year, while the SM efficiency has notably improved. To further improve efficiency, we will continue to work towards optimizing our business processes and resources education to enhance productivity. We will closely monitor and follow the ongoing trends in the Chinese labor market, continue to cultivate the education industry while guided by the field and the training needs required by the country's future. It might be easy to do a business for one year or maybe even three years, but it's hard to run the companies that have sustained for over 10 years and only a selected few companies can become long lasting organization. Following our strategy of effective growth, we are pleased to be able to continue to profit in this challenging environment with a net income margin of 7.4% and a non-GAAP net income margin of 12.8% and during this quarter. As most of our new businesses are still in the earliest , we will compare our financial performance on a quarter-over-quarter basis. Professional education for college students and adults, vocational education, STEAM education and digital education products. On April 20, 2022, China's top legislature passed the mandate vocational education law of the People's Republic of China as the 34 section of the 13th National People's Congress. It has confirmed for the first time that vocational education is of equal importance as general education, and it advocates for a high republic acceptance of vocational education. We believe that under the strong support of government policy, vocational education will have a better future with higher market demand. In the first quarter of 2022, our net revenues decreased 43.1% quarter-over-quarter and 62.7% year-over-year to RMB724.6 million. To provide a consistent basis of comparison, if we exclude these businesses and look at our comparable businesses, which are professional education, vocational education, STEAM education, and digital educational products. Our net revenues increased over 200%, both year-over-year and quarter-over-quarter basis, representing a significant increase in scale. Further, our cost of revenue this quarter decreased 62.7% year-over-year to RMB212.9 million. Our gross profit decreased 62.6% year-over-year to RMB511.7 million, which will add a gross profit margin of 70.6% higher than that of the same period of last year and also higher than that of last quarter. To break down the operating expenses, selling expenses decreased by 87.6% year-over-year to RMB284.2 million. Additionally, we will continue to extend our courses offerings to build a learning platform across multiple categories to activate our branding in the vocational and professional education sectors and gradually become more reliant on customer acquisitions through foremost referral. With that, our net income from operations for the first quarter of 2022 was RMB25.3 million compared with loss from operations of RMB1.5 billion in the same period of last year. Additionally, our net operating cash flow was RMB481.3 million, representing a significant improvement compared with that of the same period of last year. As of March 31, 2022, we had RMB979.8 million cash, cash equivalent and restricted cash and RMB2.2 billion short-term investments, which totaled approximately RMB3.2 billion or enough to support our current operating scale and our explorations into new businesses. Before I provide our business outlook for the next quarter, please allow me to remind everyone that this contains forward-looking statements, which involve risks and uncertainties, which are beyond our control and could cause the actual results to differ materially from our predictions. Based on our current estimates, total net revenue for the second quarter of 2022, are expected to be between RMB438 million and RMB458 million, representing a decrease of 79% to 80% on a year-over-year basis. And because majority of our new businesses are still at early stage, and we want the business to become more stable before we can provide a process guidance and separate them into different segments. So this is kind of like our second quarter after the transformation of our new business, and we are still making gratifying progresses. And as I mentioned earlier, the revenue of our new businesses, if we make an apple-to-apple comparison, has exceeded 200% growth, both on a year-over-year basis and a quarter-over-quarter basis. And also the gross billing has increased by more than 60% year-over-year, laying the foundation for our future development. While maintaining the high growth, we have also managed to profit retain a non-GAAP margin of 12.8%, that proves that we have the ability to balance the rapid growth and profitability. So in terms of various of categories, like our team education of finance-related examination training or division examination training and like the preparations we provide for post-graduate college entrance exams. And we believe these businesses will continue to become our growth engines in the future, Mark."
}