{
    "symbol": "ESGR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 16:30:08",
    "content": " Forward-looking statements in this presentation include but are not limited to statements about Enstarâ\u0080\u0099s expectations for pending and future transactions, run-off liability earnings, the performance of its investment portfolio and the impact of rising interest rates on Enstarâ\u0080\u0099s business. Enstar had an active third quarter from an operational standpoint, and we continued to deliver on our core strategy of providing attractive capital release solutions to our partners. While our investment portfolio continued to be impacted by unrealized losses driven by inflation and rising rates, as was the norm throughout the insurance industry, we remain confident that our investment strategy will continue to generate strong returns over the long term. During the quarter, we announced our Loss Portfolio Transfer agreement with Argo, with reserves of approximately $750 million dollars. From a strategic perspective, we completed the commutation of Enhanzedâ\u0080\u0099s Catastrophe book, and as a result, expect to record approximately $60 million dollars in favorable development in the fourth quarter. We continue to make steady progress with respect to active claims, leaving us optimistic about our potential for strong fourth quarter run-off liability earnings, or RLE. Our new business pipeline remains robust and active, with numerous $1 billion dollar plus liability opportunities. The third quarter was similar to the first half of the year, with negative investment performance driven by rapidly rising rates and an increasingly challenging economic environment. We recognized $546 million of net unrealized investment losses, of which $151 million relates to our non-core equity investments, and $395 million relates to our core trading fixed income portfolio. Moving to our underwriting performance, we recorded positive RLE of $109 million for the quarter, and adjusted RLE of $14 million, with the fair value adjustment of $82 million being the largest contributor to the difference. We remain confident that Enstar will benefit over the long-term from an extended higher interest rate environment, given that. Importantly, our team has substantial experience managing through interest rate volatility and multiple economic cycles, and we are confident that we have created a flexible business model where our ability to acquire business is not impacted by a changing rate environment. As Dominic mentioned earlier, our solvency or economic balance sheet has become stronger in the current rising interest rate environment. As a reminder, on a GAAP basis, our $11.5 billion of gross loss reserves are carried at nominal value and are NOT impacted by changes in interest rates. We remain confident in our long-term strategy and using our 30 years of experience to navigate through the current environment, particularly as our balance sheet continues to be in excellent shape."
}