{
    "symbol": "LNN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-06 16:00:23",
    "content": " This is up 23% from the prior year and it would be the highest farm income levels since 2013 In international irrigation, we see some of the same positive market drivers linked to strong commodity prices and farm income in the developed markets including Brazil where we continue to set shipment records, Australia, New Zealand and Western Europe. Consistent with discussions on our fourth quarter earnings call, we did not see any significant Road Zipper projects exit the sales funnel in the first quarter and we have similar expectations for our second quarter. In the international irrigation markets, revenues of $66.9 million increased 94% compared to the prior year quarter. Total irrigation segment operating income for the first quarter was $17.2 million, an increase of 62% compared to the prior year quarter and operating margin was 11.8% of sales compared to 12.2% of sales in the prior year. First quarter operating results for irrigation were reduced by approximately $5 million resulting from the impact of the LIFO method of accounting for inventory, under which more recent and more expensive raw material costs are included in cost of goods sold rather than in ending inventory values. Infrastructure segment revenues for the first quarter were $20.2 million, an increase of 4% compared to $21.1 million in the prior year quarter. The decrease resulted from lower Road Zipper System sales, which were partially offset by higher Road Zipper lease revenue and increased sales of road safety products compared to the prior year quarter. Our total available liquidity at the end of the first quarter was $164.9 million with $114.9 million in cash, cash equivalents and marketable securities and $50 million available under our revolving credit facility. So what we saw in our fourth quarter is, we had called about, well, it's the same a number of $6 million total LIFO impact where ending inventories, had we been under FIFO would have been $6 million higher. To your point about steel, it's really been the hot rolled coil that we started to see that moderate and reduce really toward the end of our first quarter into our second quarter but at the same time we have seen continued cost increases in structural steel and other components. I think on the infrastructure side, price is going to be less impactful as the driver in revenue in that case, I mean talking about the lease revenue on Road Zipper and some of the project-type business which we really didn't have any in the quarter. I think on the infrastructure side, as we stated before, anything that would help us with Road Zipper growth because that's where the portion of the infrastructure that we are really focused on growing to high value, high margin product where we see a lot of growth opportunities there."
}