{
    "symbol": "LNN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-20 14:27:10",
    "content": " Total revenues for the fourth quarter of fiscal 2022 increased 24% to $190.2 million, compared to $153.6 million in the same quarter last year. Net earnings for the quarter were $17.9 million or $1.62 per diluted share, compared to net earnings of $5.8 million or $0.53 per diluted share in the prior year. Total revenues for the full-year of fiscal 2022 increased 36% to $770.7 million, compared to $567.6 million in the prior fiscal year. Irrigation segment revenues for the fourth quarter increased 20% to $150.5 million, compared to $125.3 million in the same quarter last year. North America irrigation revenues of $80.1 million increased 50%, compared to last year's fourth quarter. In international irrigation markets, revenues of $70.4 million were slightly lower, compared to last year's fourth quarter and this includes unfavorable effects of foreign currency translation differences of approximately $3.5 million. Total irrigation segment operating income for the fourth quarter was $24.2 million, an increase of 129%, compared to the prior year fourth quarter and operating margin was 16.1% of sales, compared to 8.4% of sales in the prior fourth quarter. The increase in operating income and operating margin resulted from higher unit sales volumes improved price realization and lower inflationary headwinds, compared to the prior year fourth quarter. For the full fiscal year, total irrigation segment revenues increased 41% to $665.8 million, compared to $471.4 million in the prior year. North America irrigation revenues of $355.7 million increased 30%, compared to the prior year and international irrigation revenues of $310.1 million increased 57%, compared to the prior year. Irrigation segment operating income for the full fiscal year was $105.8 million, an increase of 67%, compared to the prior year. Infrastructure segment revenues for the fourth quarter increased 40% to $39.7 million, compared to $28.4 million in the same quarter last year. Infrastructure segment operating income for the fourth quarter increased 97% to $11.5 million, compared to $5.8 million in the same quarter last year. For the full fiscal year, infrastructure segment revenues increased 9% to $104.9 million, compared to $96.3 million in the prior year. Infrastructure operating income for the full fiscal year was $18.3 million, compared to $20.2 million in the prior year."
}