{
    "symbol": "HPE",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-29 21:33:02",
    "content": " During the fourth quarter, total HPE revenue climbed 4% year-over-year on a constant currency basis to almost $8 billion, which was above our sequential outlook as we started to see a slight improvement to ongoing supply constraints. Non-GAAP operating margin rose to 11.5%, up 180 basis points year-over-year, one of the highest quarterly levels in HPE's history. In fiscal year 2022, we produced $28.5 billion of revenue, 5% compared to 2021 and above the 3% to 4% outlook we provided at Securities Analysts Meeting 2021. Our large order book contributes to our confidence in our fiscal year '23 revenue outlook of 2% to 4% growth adjusted for currency, and the longer term 2% to 4% revenue CAGR outlook over the fiscal year '22 to '25 period we provided at our 2022 Securities Analyst Meeting in Houston last October. Currency and our exit from Russia and Belarus represented a 300 basis points headwind to revenue for the full year, which means we ended the year solidly above our initial guidance for 3% to 4% revenue growth adjusted for currency. Our 33.1% non-GAAP gross margin in Q4 is up 10 basis points year-over-year, reflecting a very strong Compute quarter and higher logistics costs in the Edge business. In HPC & AI, revenue fell 11% year-over-year, solely as a result of the Frontier deal slipping into fiscal year '23, which also impacted our operating margin in this segment. In total, revenue from our own IP, margin-rich products rose strong double digits in Q4 and contributed to an annual operating margin of 15.9%, which represents a year-over-year gain of 210 basis points and a sequential gain of 120 basis points. This includes revenue growth of 2% to 4% adjusted for currency, non-GAAP operating profit growth of 4% to 5%, GAAP diluted net EPS of $1.38 to $1.46, non-GAAP diluted net EPS of $1.96 to $2.04, and free cash flow of $1.9 billion to $2.1 billion. So, moving forward, trend-wise, what you can expect is, obviously, this level of AUP growth to come down as we'll have to pass on to our customers the benefit of ease -- pricing of commodity easing, but we feel very good about the prospects of Compute in fiscal year '23, given the order book, the fact that our products are more and more differentiated and the need for customers to continue to opt for greater configs."
}