{
    "symbol": "HPE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-01 21:06:10",
    "content": " We increased total HP revenue by 2% year-over-year to $7 billion, despite continued industry wide supply constraints, which slowed our ability to convert orders and record breaking backlog to revenue. Demand for our differentiated edge-to-cloud products and solutions continues to be very strong, with Q1 marking the third consecutive quarter, we have generated a year-over-year order growth above 20%. Customers a requirement for a unified operating experience across edge-to-cloud and the desire to consume IT in a flexible way is fueling the tremendous or this growth of our HP GreenLake edge-to-cloud age, which saw record demand in Q1 with as-a-service orders of 136% year-over-year. Our intelligent edge business segment grew revenues 11% year-over-year and for the fourth consecutive quarter, so year-over-year over this growth of over 35%, driven by the very strong demand in secure connectivity from edge-to-cloud. Our High Performance Compute and AI business also generate a noteworthy product or the growth of more than 20% year-over-year, which has increased our total order book to a record of approximately $2.7 billion. Compute generated more than 20% or the growth year-over-year, expanded the gross margins and attractive operating margins up 240 basis points year-over-year driven by strong pricing discipline. The demand continues to be robust for our differentiated edge-to-cloud portfolio with order growth up 20% year-over-year, marking our third quarter in a row with order growth at or above 20% year-over-year. We delivered Q1 revenues of $7 billion, up 2% year-over-year and in-line with our outlook of normal sequential seasonality, despite a continuously challenging supply environment. We delivered non-GAAP gross margin of 33.9%, up 90 basis points sequentially and 20 basis points year-over-year, driven primarily by strong pricing discipline and our continued mix shift towards higher-margin, software-rich offerings. This gives us confidence in delivering our 35% to 45% CAGR target from fiscal year '21 to fiscal year '24, with increasing margins as our mix of both software and services continue to increase to 64% in Q1, up more than 4 points year-over-year. In HPC and AI, demand remains robust with product order growth of more than 20% year-over-year, driving our awarded contracts total to another record level of approximately $2.7 billion. Revenue grew 4% year-over-year, but was impacted by two large customer acceptance delays that impacted growth by more than 10 points in Q1 and are now on track to be delivered in Q2. In compute, order growth was up over 20% year-over-year for the third consecutive quarter, while revenue growth was flat, reflecting the difficult supply environment. As a result, we still have strong confidence in our fiscal year '22 revenue outlook of growth of 3% to 4% and expect to end the year with elevated levels of backlog, which bodes well for fiscal year '23. Everything gets delivered through HPE GreenLake, whether it's a connectivity through a subscription model, whether it's computer storage that you can consume elastically with data services running on top of it, whether it's the services to operate in a HPE GreenLake, HPE GreenLake is becoming a platform of choice for many customers because offers that flexibility and in an architecture that's edge-to-cloud."
}