{
    "symbol": "HPE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-30 18:04:05",
    "content": " In Q3, we delivered revenue of $7 billion, up 4% year-over-year and above our outlook of up low-single-digits sequentially despite an ongoing challenging supply environment and greater currency headwinds. We delivered non-GAAP gross margin of 34.7%, up 50 basis points sequentially and flat year-over-year, driven primarily by strong pricing discipline and our continued mix shift towards higher-margin software-rich offerings. Non-GAAP operating margins were 10.5%, up 120 basis points sequentially and 70 basis points year-over-year, reflecting operating leverage from strong gross margin and OpEx savings from our cost optimization actions taken during the pandemic. With our better-than-guided revenue growth, we delivered non-GAAP diluted net earnings per share of $0.48, up 9% sequentially despite elevated input costs from the ongoing industry-wide supply constraints and foreign exchange impact. We also continue to expand our as-a-service margins as our mix of both software and services continues to increase to 64% in Q3, up 6 points year-over-year, with our expanding cloud and SaaS offerings, particularly in Edge and Storage. We delivered operating margins of 16.5%, up 390 basis points sequentially and 40 basis points year-over-year, reflecting the improving operating leverage in this business and this despite higher component and logistics costs. This improvement can be seen on Slide 6, where we delivered non-GAAP gross margins in Q3 of 34.7%, up 50 basis points sequentially, and flat year-over-year, showing their resilience in spite of the increased component and logistics costs. As discussed, Antonio and I are very pleased with the continued demand strength and growing backlog that gives us confidence in achieving our original SAM revenue guidance in fiscal year 2022 for growth of 3% to 4% adjusted for currency that now includes a 2.5-point headwind from foreign exchange rates on a full year basis. And then specifically for cash flow, overall, at the company level, the dynamic that you all need to take into account is starting from the revenue growth that we flagged, which would be at least 5% on a revenue basis, reported basis, applying the margins commentary that we discussed, you're going to have a certain amount of cash earnings growth in Q4 sequentially relative to Q3."
}