{
    "symbol": "DSKE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 16:20:19",
    "content": " Revenues this quarter of $421 million, a 26.1% improvement year-over-year, coupled with continuously improving profitability metrics, despite facing strong year-over-year comps demonstrate the earnings power of our unique model, which places meaningful emphasis on execution across all market environments. In the first quarter, Daseke converted this revenue growth into $49.6 million of adjusted EBITDA a 38.5% improvement year-over-year, and adjusted diluted earnings per share was $0.24 a significant increase when compared to last year’s first quarter of $0.04 per share. As Jonathan outlined, Daseke’s diversified portfolio of industrial-facing end markets and the strategic flexing of our asset right model has enabled the company to execute effectively across various market environments. As we’ve seen over the past several quarters, in the first quarter, we continue to see sustained demand strengthening across our construction and manufacturing end markets. Candidly, we have experienced steady demand across virtually all of our – all of the end markets we serve, which when coupled with the limited capacity within the industry has led to the strong freight rates we’ve been able to experience in the market today, especially in our flatbed business. In the quarter, Daseke delivered revenues of $421 million, up 26.1% compared to revenues of $333.9 million in last year’s first quarter. At the combined operating segment level, our consolidated adjusted EBITDA results of $56.7 million were up 27.7% versus results of $44.4 million in last year’s first quarter. The segment’s adjusted EBITDA results of $25 million grew by 26.3% compared to the result of $19.8 million in last year’s first quarter as flatbed demand and ongoing tightness in available capacity kept rates at attractive levels, helping offset the cost pressures. I think you can – look, I think, Greg, you can think about it really ratably over the first few quarters of the year, such that by Q4, kind of the exit run rate, it’s a full $20 million to $25 million."
}