{
    "symbol": "SOUN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 18:27:14",
    "content": " Our business gained momentum in Q2 with cumulative bookings backlog increasing to $283 million, more than three times year-over-year and making the third consecutive quarter of triple-digit growth. The monetization pillar extend voice AI from a valuable cost component to a new incremental revenue-generating pathway for customers, meaning the unit economics become increasingly more attractive as the ecosystem scales and expand. Prior year Q2 results were impacted by one-time revenue derived from a customer upon the early conclusion of professional services contract, which added $4.3 million to last year's result. As you noted also, we're very pleased with the bookings results through Q2, $283 million up 3x from prior year, just indicates strong momentum and strong conversations that we're having with customers. So while we're not kind of articulating exactly where we expect to end the year, we're having a lot of great conversations with existing customers on how we expect to plan -- expect to potentially expand across regions, products, brands where as we noted in the prepared remarks, the second pillar, services offerings particularly with respect to food ordering and the SoundHound for Restaurants offering, we're seeing tremendous traction. But I think it's also important I didn't want this to be hidden in the prepared remarks either but we also are cognizant that we think it's one of the strengths of our business model because I think there are other, I'll just say peers out there who â\u0080\u0093 the solution is just a cost component to their customers and they feel pressure because they're constantly having conversations about how do I bring the cost of goods down with their customer. I mean, I think the pathway we've been on certainly for the past year and leading to this conference call as a public company, the fact that I highlighted that we have -- we're maintaining our expectations, we're able to deliver against that in a sort of macro environment where a lot of things have happened over the last nine months to say the least from inflationary pressures to geopolitical dynamics and so forth."
}