{
    "symbol": "SOUN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 21:15:05",
    "content": "  Operator: Good day, and welcome to the SoundHound Q4 2022 Earnings Conference Call. Good afternoon, and thanks for joining our fourth quarter and full year 2022 conference call. Weâ\u0080\u0099d also like to remind everyone, that weâ\u0080\u0099ll be making forward-looking statements on this call. In addition, we may discuss certain non-GAAP measures. Please refer to todayâ\u0080\u0099s press release for more detailed financial results and further details on the definitions, limitations and uses of those measures and reconciliations from GAAP to non-GAAP. We disclaim any obligation to update any forward-looking statements, except as required by law. An audio replay will be available shortly, following today's call. We're happy to share with you the results and highlights of our first fiscal year as a public company, which we closed out with a strong fourth quarter. SoundHound user queries using cloud connectivity were also highlighted growing over 85% in 2022, compared to '21, resulting in an annual run rate of approximately 2.2 billion. In Q4, our bookings increased 10% quarter-over-quarter, and our revenue was 9.5 million up 84% year-over-year. Before diving back in, I want to take a moment to reflect on how we got here and share our view of the latest trends and momentum in AI. We globalized our technology to over 25 languages, and are starting the year with 332 million in booking from our customers. And now we power tens of millions of devices and services around the world, enabling people to more seamlessly interact and exchange in a more accessible, interconnected world. With the recent popularization of generative AI and large language models, we view to 2023 of an inflection point of conversational AI with a clear intersection between technology readiness, and subsequent demand and adoption, such intersections are rare and SoundHound is in a unique position to create tremendous value. We believe the impact of generative AI and large language models to the field of conversational AI is similar to the impact of deep learning, deep neural networks to machine learning. And we view the market impact of this to be transformative similar to the mobile ecosystem destruction of the last decade, fast movers will create tremendous value. For the first time, we are unveiling our novel approach using our proprietary technologies called CAILAN and CAINET. CAINET can connect to SoundHound's internal generative AI models as well as external model such as Open AI, GPT, and ChatGPT, among others. SoundHound Chat AI: Okay, I will remember where your work is. SoundHound Chat AI: The corkage fee can vary depending on the restaurant, but it typically ranges from $15 to $50 per bottle. SoundHound Chat AI: Fleming's Prime Steakhouse & Wine Bar, The Wine Bar located at 2762 Augustine Drive in Santa Clara has parking. SoundHound Chat AI: It is a wine bar, a steakhouse and a seafood restaurant. SoundHound Chat AI: It will take approximately 7 minutes to drive 2.3 miles from Downtown to Fleming's Prime Steakhouse & Wine Bar, 2762 Augustine Drive, Santa Clara. SoundHound Chat AI: Sunset will be at 6:05 p.m. on Sunday, March 5, 2023. No, it isn't forecast to rain on March 5 near SoundHound. By combining the power of software engineering and machine learning with generative AI, we can finally deliver the digital assistant experience that users have been desiring for decades. Users no longer limit their interactions to simple control commands, setting timers and playing music. Combined with our breakthrough Dynamic Interaction, which I'll talk about shortly, this will further strengthen our position as a leader in voice interfaces by creating more interaction capabilities for users of our products. In addition, more product creators will demand this feature and this increase in adoption will also increase the revenue per SoundHound. In our pillar two, more tasks can be automated and in general customer service, an area of important focus for SoundHound will be transformed with AI being not just cheaper than humans but also better than humans. But incorporating the possibilities that are already proven from generative AI and large language models into customer service applications, we envision that end users will ultimately prefer to speak on AI agents rather than a human representative when talking to a business. We expect our expansion to new customer service verticals to accelerate, and ultimately, AI enabled customer service will be as necessary to every business as electricity. Due to our advanced and comprehensive technologies, mature product and existing customer base, in our view, this can't be done as a side project. It can't be achieved by simply interviewing a few external APIs, and creating the necessary technologies to winning conversational AI will be costly, inefficient and slow. Last November, we unveiled a new technology called Dynamic Interaction. By combining Dynamic Interaction with generative AI, we expect to achieve our ultimate vision of making computers better than humans in language understanding and more human in the way they interact and respond. Even our unique positioning and strength, the growing demand we're seeing for our independent AI powered products and services will only get stronger as we execute on more opportunities and with more customers. In 2022, we made great progress importing and extending significant relationships and partnerships with a number of new brands with our vertical agnostic technology. In the past year, SoundHound has announced a number of key partnerships and integrations including an agreement with Qualcomm to bring SoundHound both AI to Snapdragon platform, new deals, and integrations with VIZIO, Square, Toast, and Oracle and an expanded partnership with Snap. SoundHound also signed a multiyear agreement with Hyundai and announced an expansion of our Stellantis relationship in Europe as well as a series of collaborations in our commercial space, including with LG, HARMAN, DPCA and DMI. In automotive, we now work with 20 brands, an impressive number given we went from 0 to 20 brands in just a few years. While we continue to add new brands in a portfolio, we're also able to expand with our existing brands globally by supporting new languages, new regions, adding edge and cloud and new services. With more than 75 billion connected devices expected globally by 2025, we see a tremendous opportunity here for our voice AI powered products and solutions. Last year, our voice AI technology was made generally available for customer service starting with SoundHound for restaurants, making our entry into this massive, rapidly evolving service industry. This launched, we have added restaurant customers across North America and continue to pursue relationships with important partners including companies like Oracle, Square and Toast with more to come. Our SoundHound to onboard found both our assistant allows restaurants to automate the ordering process at drive-throughs ordering kiosks in app and over the phone, enabling customers restaurants to create efficiencies in order taking at a time when many are tackling rising food costs, staffing shortages, supply chain issues and other headwinds. We are excited as we move forward in 2023, because we expect to continue to add customers and partners and deliver voice AR technology to some of the most well known brands in the world. And we already voice enable meaningful cars, TVs, mobile apps, IoT devices and restaurants on a global scale, thanks to our extensive set of languages. And while we're excited about what we have built at SoundHound, and the new opportunities we have realized, is nice to see that the success is also being recognized by the industry. We certainly have been named a speech industry award winner, and we were also named as one of the world's top 10 disruptive AI companies by AI magazine. In addition, SoundHound for restaurant has been named among the winners of the National Restaurant Association's Smartbrief Innovation Award for Foodservice after only a short period since market launch. The convergence of heightened market demand for conversational AI and the technological readiness for our AI powered solutions has positioned us at a critical and very exciting inflection point, one we're trying to take advantage of. In closing since launching SoundHound initial voice AI platform in 2016, we have radically evolved it, globalized it, reached 25 languages, is selected by 20 car brands, and created over 100 branded assistants across numerous brands and languages. We continue to scale into major enterprises including Hyundai, Kia, Genesis, Mercedes Benz, Stellantis, Dodge, Chrysler, Harman, Toast, Square, LG, VIZIO, Snap, Pandora and many others. There's tremendous opportunity in itself to expand within these existing customers, but we're also making meaningful progress in expanding or other submarket as demonstrated we can have a restaurant in customer service. And with recent product launches, such as Dynamic Interaction for customer service and generative AI, we're confident in our ability to both grow within our existing global additive market and expand into new ones. A year when the IPO market stalled, higher interest rates dared investors towards value and sentiment shifted away from disruptive high growth technology companies such as ourselves. Nevertheless, we adjusted fought harder, aggressively took actions and set ourselves up to serve the rapidly increasing demand for our products and on much stronger financial footing. At SoundHound, we do that by making conversations with machines more natural and seamless and the demand for that has never been stronger. Large language models generative AI to the pervasive, pervasiveness of chatbots are unearthing entirely new use cases every day. Despite the volatile macro backdrop, we have now outperformed our publicly stated value outlooks for the past two years. We closed the air with $332 million, representing a year-over-year growth of 59%. The contracts underlying our bookings backlog now ranged from one year to more than nine years, with the roughly 6.5 year weighted average contract length. Through the year, we saw meaningful lengthening in customer contracts, which demonstrates the deepening strategic partnerships and validates the value we continue to create. Pillar two represents voice enabled services, generally under monthly subscription contracts. As we have discussed previously, the bulk of our current business and backlog is in pillar one and in 2020 we've scaled into millions of new cars and devices. And this pillar, we are extending our offering across new units, and adding more features to existing ones to expand revenue per unit. In automotive for example, we saw more than 3x growth in the air new unit production in 2022, and unit price expansion of more than 20%. As we have discussed previously, going our pillar two voice enabled services is a key focus area starting with AI enabled customer services for restaurants. Just several months in and our qualified advanced pipeline of stores is now well into the thousands, and we are rapidly enhancing product features to extend our reach to even more brands and locations. In Q4, we generated $9.5 million in revenue of 84% year-over-year. For the full year, our revenue was $31.1 million, and it was predominantly driven by product royalties, with an increasing contribution from subscription services throughout the year. In Q4, our gross margin improved to 71%, up from 67% in the prior year quarter, which was largely driven by the expanding scale of our business. As we look forward, there are some on-prem activities that we related to the cloud, helping us continue to drive gross margin expansion, along with the anticipated benefits of further scale. Moving on to operating expenses, R&D has been the key pillar of this company as we built our voice AI platform and deep patent portfolio while over 260 filed and pending. In Q4 R&D was $21.5 million, up 32% year-over-year. We continue to invest in R&D to ensure we remain at the forefront of innovation in AI and machine learning, while also helping to develop and scale our cloud offering and other products and services. In 2022, we ramped up our sales and marketing investments in both people and technology to accelerate growth, particularly in pillar two. We have increased focus in digital marketing, lead generation and customer acquisition both direct and through channel partners. In Q4, sales and marketing expenses were $6.7 million of 587% year-over-year up a small prior year base. G&A expenses were $7.2 million in Q4 up 41% year-over-year, which reflects investments across the global support functions and finance, legal facilities and human resources. Across all operating expenses, non-cash employee stock compensation was $9.3 million in Q4. Full year net loss per share was $0.83, compared to a net loss of $1.18 in the prior year. Under the capital structure, our cash position at year end was $9.2 million. In January, we successfully raised $25 million in preferred equity. All-in, our balance sheet has strengthened meaningfully and we have a fully funded business plan through and beyond the point of our becoming profitable. Earlier this year, we announced restructuring actions that were necessary to right size our cost structure impacting both people and discretionary spend. Such decisions are never easy, but the actions have enabled us to accelerate our path to profitability without materially impacting our ability to execute our business plan effectively. We expect revenue to grow approximately 50% in 2023 and we now expect to be adjusted EBITDA positive in Q4 of this year, setting the stage for sustained long-term profitable growth as we enter 2024. First, the $332 million of cumulative bookings backlog that I noted earlier gives us high confidence on revenue that will either automatically roll into the P&L in accordance with software revenue recognition guidance or as a result of expected customer unit volumes upon which we generate royalty revenue streams. In addition, we expect that SoundHound for Restaurants will provide a meaningful contribution to revenue and grow at an accelerated rate as we move through the year. It is important to note that SoundHound for Restaurants has had only a minimal contribution to our revenue up to this point, but the underlying customer foundation pipeline and activation of stores is building rapidly. It's also important to note that this vertical has a very attractive financial profile with more predictable revenue streams, better scalability, leading to more favorable operating margins, and a fast conversion of initial customer contacts cash flow. Therefore, overall in 2023, we expect that revenue will be in the range of $43 million and $50 million. We expect this revenue will build through the year, with each quarter larger than last due to seasonality of pillar one businesses and the scaling of restaurants. Last year approximately two-thirds of our revenue was recognized in the second half of the year, and we expect to see a similar trend for this year. While progress will not always be linear, we are building a strong and sustainable business model and driving growth with a clear path to profitability. Market momentum is real, customer traction is strong, and we are extremely excited about our path forward. A lot of interesting developments, obviously, I guess first on the restaurant vertical, you seem fairly positive about that vertical. And then, I guess also just seems like this would be applicable to very large chains. So, a couple of points, yes, when I alluded to the pipeline in my prepared remarks, I mean, generally, we -- obviously, we have a lot of conversations going on and we sort of have an initial pipeline and then we kind of ventured into our CRM systems when it's in the more advanced stage. So qualified leads that we really characterizing what I was referencing are ones where there deep conversations going on with decision makers at the restaurant, where there's clear line of sight to a significant opportunity, whether it's small and medium enterprises, it could be one to single digit level locations in the enterprise side, they could be 10s or 100 plus, and we definitely have a suite of both small medium midmarket and enterprise level customers that have hundreds of stores. We've previously mentioned, White Castle, as an example chain that has over 350 stores around the nation, and we're activating and live and several of those and scaling. I would say that, you know, in terms of the number I mentioned, 1,000s, of advanced stage pipeline, so those are ones that are not yet paying us monthly fee, those are pipeline. In many cases, what happens is, we kind of get a late stage conversation with let say, a pizza restaurant, and there are certain features and facets that they need, maybe they need a customization of doing half this half that. So in a lot of cases, there's really active engagement, we may just need to add some features and functionality. We have hundreds of restaurants signed up already so beyond the pipeline stage that are operating, and we're quickly scaling those. So, as I mentioned in the prepared remarks, a time from sort of initial conversation to cash flow or monthly recurring revenue in the case for us can be very rapid, and especially when you get into restaurants that have multiple stores, because once you ingest that menu upfront, and you custom sort of develop the capability and the voice, moving to restaurant number two or three is very, very fast. In some cases, if it's more than the drive thru feature, you might have some acoustic things you have to figure out but generally, especially performer and you don't have any of those complexities of traffic or outside noise, and so it could be much more rapid. I rambled a little bit there, so maybe I'll pause and do that kind of question. Yes, it will be both, to offer that to our existing customers and car makers and other teenagers and so on. And SoundHound, historically, we've had direct-to-consumer applications and products, and our existing applications have received over 300 million downloads. So that's something that is part of our D&A, you're really good at it. So, they are basically bundling our voice AI solution into their chipsets, and they can basically be our channel partner and sell it to our customers on our behalf. So we guided 50% growth, and in sort of highlighted that is going to be back end loaded. So there's seasonality associated with like TV sales, and so forth as well. But then also with our pillar two and restaurants as we continue to scale, getting traction, and that builds on a monthly subscription basis, that'll compound in a positive way that that should go through the year. But I'd say that just overall profile and long-term, we definitely think the levels, you know, the 70% plus level that we've been delivering this year is very achievable, very scalable, as you go into our diversification of products from cloud to edge that we've seen this year, that does have favorable elements to gross margin. I mentioned in my prepared remarks, through the year, we were migrating cloud, and we had that sort of impact a little bit of a drag in 2022's margin, that is now kind of completed. And then, also there's some other actions we're taking to drive efficiencies and margin and then also just with scale, but with respect to cloud versus edge, some of the edge solutions, they tend to have favorable gross margin profile. So, as you put it all together, we expect gross margin continue to be in the zone and positive to what it was in 2022. And then on the OpEx slide, I mentioned, on a full year basis 60 million of savings. And the first quarter will have some of the restructuring costs impact in it, but on an ongoing and we're still for some of our international countries. But certainly by the end of the year, we'll have worked through entirely in fact, in Q1, by the time we're down with Q1, we should be largely through all the restructuring activity. And yes, I mean, as you get to the full year Q4 estimation, I think when you look at our OpEx items, R&D, sales and marketing G&A we're taking in the actions we took were north of 40 plus percent reductions on both headcount and discretionary. The other thing I'd say, we and I mentioned this in the prepared remarks in passing as well around the stock comp elements, although that doesn't affect the adjusted EBITDA, but that also we expect to come down. And then, I guess on the community kind of bookings backlog, I guess the group 10% sequentially. We announced that we have over 70,000 restaurants and one thing that they're unique about our kind of a restaurant is that we could work with single location restaurants. But we could actually work with a restaurant that has a single location because our on-boarding is automated, so you can ingest the menu. And even if they have custom vocabulary on their menu, RFPs recognition automatically gets trained and enhanced to recognize those and they have complex menu structure, all of that can be automated. So that's a very green area for us to go after the long tail and to us the partnership is very keen, because they have -- they opened the doors and 10s of 1000s of restaurants for us. So, the demo you heard was voice based, so the user was talking to a mobile app and here's the response. There will be a text plain text input, as well as like voice we think will be the dominant way and that's one of our differentiators bring our own ASR. So if you remember, when Apple launched Siri more than 10 years ago, there were all these ads on TV that made it the promise that you can go and have it open up the conversation with an assistant users, love the idea they rushed to it. And now more than a decade later, you're finally able to deliver that experience that users have wanted. But if you ask them questions about real time search queries like I was the weather or sports scores or stock prices, or setting a timer or calling contact or sending messages or sending calendar, navigating to restaurants or addresses, they say that goes. So to really deliver this ultimate assistant experience, you need to have both, you need to have generative AI language model. And you need to have the existing assistant domains that people demand with a voice interface on top of it, and there's only a handful of companies that can take advantage of the situation. And Brett the other thing, just that, for us, the generative AI is certainly the like the demo we shared, but we also talked about Dynamic Interaction and we previously announced the Dynamic Interaction sort of next generation for auto. In this space, we think, certainly voice is an important modality. And so, there's a ton of applications use cases that we're very excited about and the monetization will come with those near-term. When we found a SoundHound, we have a vision to see voice enable, voice AI in our lifetime. Our conversational AI comes to the prominence across industries, we're confident that as the only independent cross industry works AI platform, you are in a strong position to deliver best-in-class technology to even more global brands."
}