{
    "symbol": "AGM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 21:57:16",
    "content": "  Jalpa Nazareth: Good afternoon, and thank you for joining us for our First Quarter 2022 Earnings Conference Call. I’m Jalpa Nazareth, Director of Investor Relations and Finance Strategy here at Farmer Mac. As we begin, please note that the information provided during this call may contain forward-looking statements about the Company’s business strategies and prospects, which are based on management’s current expectations and assumptions. On today’s call, we will also be discussing certain non-GAAP financial measures. Disclosures and reconciliations of these non-GAAP measures can be found in the most recent Form 10-Q and earnings release posted on Farmer Mac’s website, farmermac.com under the Financial Information portion of the Investors section. Joining us from management this afternoon are our President and Chief Executive Officer, Brad Nordholm, who will discuss first quarter business and financial highlights and strategic objectives; and our Chief Financial Officer, Aparna Ramesh, who will provide greater detail on our financial performance. At this time, I’ll turn the call over to President and CEO, Brad Nordholm. Our financial results are strong as we’ll be discussing, and we also are working to build upon a solid foundation for our future growth. We generated consistent core earnings, and most importantly, our portfolio remained strong and credit performance continued to be stable with 90-day delinquencies and substandard asset ratios improving relative to the same period last year. The Agricultural Finance line of business, which is approximately 75% of our total outstanding business volume and comprises all products secured by first liens on agricultural real estate plus all USDA guaranteed loans grew approximately $500 million this quarter, or roughly 3%. At the onset of the pandemic, opportunities for new business volume and our AgVantage securities program were limited, as liquidity support provided by the Federal Reserve Bank resulted in the tightening of investment grade credit spreads to historically low levels and increased competition. Net Farm & Ranch loan purchase volume was strong during the first quarter, despite its seasonally large number of payments. During the first quarter, markets experienced the disruption caused by a combination of factors, including inflation, a federal funds rate increase, expectations of future increases, as well as the conflict in Ukraine. While production expenses are forecast to increase and government payments are expected to fall, rising cash receipts should offset these changes with recent commodity price data suggesting that even stronger incomes are possible. In terms of our portfolio, while we anticipate that future -- lower financings could result in lower levels of new loan purchases in some of our Farm & Ranch and USDA products, it could also result in lower portfolio prepayment speeds. Our Rural Infrastructure Finance line of business grew nearly $150 million this quarter or 2%, primarily due to our loan purchase product. Also, contributing to growth this quarter and rural infrastructure line of businesses was a $35 million commitment to a large solar project. As I’ve said on prior calls, renewable energy is both, an important economic development opportunity for rural America, and it’s a business opportunity for us. As mentioned in our last earnings call, over the last few months, we’ve been focused on enhancing our infrastructure to support a securitization program, and we are closely monitoring a changing market dynamic. The market for new issued securitizations was challenged during the first quarter, as the volatility in the debt capital markets resulted in somewhat of a slowdown in securitization markets. Farmer Mac continues its measured and thoughtful investment in people, technology and business infrastructure to improve our capacity and efficiency. And to achieve these goals over the long run, we’re going to need to be able to achieve gross annual business volumes that represent the growth over our current asset levels. That’s an example of our efforts to upgrade our technology platform, including doubling the eligible loan size for AgXpress scorecard products from $1.5 million to $3 million. We hope that through our rebranding initiative, we’re able to better to gain deeper insight from each of our stakeholders in order to continue to build on our strong reputation and as the nation’s key trusted secondary market for credit to rural America. With the support of our Board, we believe that our unified commitment to Farmer Mac’s strategic plan in conjunction with the organization’s talented and committed employee base is enabling us to take Farmer Mac to the next level. Now, I’d like to turn the call over to Aparna, our Chief Financial Officer, to discuss our financial results in more detail. Core earnings for first quarter 2022 were $25.8 million, or $2.37 per diluted common share, compared to $30 million, or $2.75 per diluted common share in fourth quarter 2021 and $25.9 million or $2.39 per diluted common share for the same period last year. The sequential decrease was due to the non-recurrence of the fourth quarter 2021 $5.2 million after tax gain on sale of mortgage loans, a net change in our total allowance for losses of $1.1 million after tax and a $0.7 million after tax increase in operating expenses. Net effective spread for first quarter 2022 was $57.8 million, an approximate 7% increase compared to fourth quarter 2021 and the same period last year. Our liability side of the balance sheet remains strong as we continue to benefit from our dynamic funding strategies that we’ve outlined to you in the past, and we’ve continued to maintain our discipline asset liability management. Last quarter, we introduced operating segments to allow us to offer more transparency into the various contributing components of our portfolio’s net effective spread. While we have spent the last few months identifying ways to potentially execute these transactions more efficiently and we hope to return to the market this year with another securitization transaction, we are taking a more measured approach in the short-term, just as Brad mentioned, recognizing that current market dynamics are resetting credit market perspective and read outlook. First quarter 2022 was extremely challenging for the securitization market, as the evolving macro rate environment has contributed to spreads that are widening and interest rate volatility that is increasing throughout the quarter. We are, however, still committed to building a robust securitization program, which we believe will provide Farmer Mac with an opportunity to diversified funding sources and fulfill our mission of delivering low-cost liquidity even more effectively. Operating expenses increased by 13% in first quarter 2022, compared to first quarter 2021. And this was primarily due to increased headcount, including 10 new employees in connection with the strategic acquisition of loan servicing rights in third quarter 2021, increased staff compensation, and increased spending on software licenses and information technology and other consultants to support growth and strategic initiatives, some of which Brad mentioned earlier. And this will be primarily to modernize and mitigate risk in our infrastructure, enhance the technology platforms to support our revenue and hedging strategies and add relevant talent across the organization, especially as we scale and enter into new areas of business such as renewable energy and telecom. Over the next 12 to 18 months, we’ll continue as we’ve done before to closely monitor our efficiency ratio, which ended March 31, 2022, at 33%. As of March 31, 2022, the total allowance for losses was $16.3 million, a modest decrease from year-end 2021. This decrease was primarily attributable to a risk rating upgrade on a single loan related to the borrower’s successful securitization of a large payable that was incurred as a result of the arctic freeze that struck Texas in February of 2021, and this was partially offset by new loan volume. Farmer Mac’s $1.2 billion of core capital as of March 31, 2022, exceeded our statutory requirement by $489 million or 66%. We locked in low fixed rate funding over the past two years, and that has positioned us extremely well to withstand either a rising or flattening rate environment. Despite rising rates and higher input costs that are experienced by our borrowers, credit quality remains strong, given the increase in commodity prices that has outpaced the increase in input costs. And with that, Brad, I’ll turn it back to you. Farmer Mac has significantly increased its profile name recognition over the last few years, and we believe this will help us as we bring new capital to agricultural and to rural communities of America. And now, operator, I’d like to see if we have any questions from anyone on the line today. And obviously, this is an extremely volatile environment which we’re operating. Not only are we dealing with increases in interest rates and -- but the global events, which are having a significant impact on commodity prices, including agricultural prices and the inputs into agricultural production. I’m going to ask Zach Carpenter to comment on the business outlook and how we’re seeing the combination of rising interest rates and volatility, and generally goods conditions in American agriculture impact originations. But let me begin by saying that the overall condition of American agriculture, while these price changes are unnerving, the outlook, as I said, remains generally quite positive with anticipated record levels of earnings in American agriculture in 2022. So, if you look at the commodity sheets, we’re seeing corn approaching $8 a bushel, we’re seeing wheat over $10 a bushel. But at the same time, we’re seeing natural gas at $7.50. So, agriculture has the effect of rising cost of inputs, but it also is seeing really a level of commodity -- agricultural commodity prices that we haven’t seen, frankly for about 10 years, and that’s both on a real as well as nominal basis. And we’ll carefully distinguish between demand for short-term operating credit, which may be a function of commodity prices for inventories and longer-term trends as it relates to land. It’s -- when you have all these numerous components coming into the market, it creates, I would say, a lot of pause. That being said, we have seen the fastest increase in interest rates for our products in many years. When you look in the food and agri business space in those transactions, we’ve had a pretty quick drop-off in volume compared to 1Q ‘21. And again, that goes back to just uncertainty and trying to understand what’s happening in the market and making sure transactions come at the appropriate time. From a historical perspective, debt is still relatively cheap, even though you’ve had a significant increase in interest rates. And we’re assessing the market, and we’re looking to be flexible and competitive in our rates and support the sellers and the lenders and their borrowers as they navigate this uneasy time. Going forward, as mentioned, volatility has been very high, input costs have been very high, but we expect farm incomes to continue to be strong in 2022. That doesn’t mean that there may be some operators, some producers, some farmers and ranchers in some commodity sectors that won’t experience some level of distress. But generally speaking, we’re optimistic in terms of continued high quality credit performance. And then, just one follow-on, which is a lot of the factors that you noted, we’re seeing, obviously, uncertainty impact a lot of sectors and a lot of general demand for financing and for transactions. There are opportunities, and they’re in different corners of our portfolio and our lines of business, I think, Marla. For example, right now, one of the impacts that the rapid run-up in commodity prices is happening is that farmers are drawing on their operating lines of credit very heavily. So, we may see some pick-up there, and that may be a second example of the kind of opportunity that you’re alluding to. Third thing I’d just mentioned is that we are extremely disciplined in how we price our loans, our asset liability management. We’ve talked about that on numerous occasions before, but we pretty much match all of our business activity to current, meaning real time, this minute, this hour, this day debt capital market conditions. So, those are three specific ways that we could see some increasing demand per product amidst this unprecedented volatility that you’re referring to. Obviously, you’ve got a variety of hedges to limit interest rate risks due to obviously dramatic market shifts in Q1. Gary, one of the benefits of having the kind of volatility is that we are going to prove to you what we’ve been talking about for years, and that is the discipline of our asset liability management. We have some tremendous advantages because we really don’t take on any basis risk or underlying interest rate risk, and we’re able to do that through managing our derivative activities. So, when you add all of that together, maybe it’s a slightly complicated, we’re looking at it. We essentially have really the benefit, especially in this rising rate environment, some of the positions that we’ve taken on in the last two years that are really coming out in our favor. So, there’s probably a lot to unpack there, but maybe the short answer to that is, it continues to be an advantage for us in terms of how we fund and manage our balance sheet through our portfolio. But I will say that when we look at where we are relative to our competitors and by that I mean the Farm Credit Funding Corp or other GSEs, we typically, on the long end of the curve, maybe been somewhere between 5 to 10 basis points on top of that. So, everyone is seeing widening across the board relative to what’s happening. But I think also as a GSE, maybe from a credit standpoint, credit spreads widening out, we are not seeing as much relative to maybe other issuers. But, we are seeing the same dynamics that we’ve seen in the past two years relative to other GSEs. And you know this Gary, but over the last two years, we’ve really been very opportunistic, whether it’s on our capital stack through preferred issuances or whether it’s been through extending our debt funding. So, there’s probably a little bit of a wash. And you wouldn’t have seen too much of a benefit on that 97 basis points. You said your efficiency ratio is 33% today and you’ve got spending plans for the next, let’s say, 4 to 6 quarters. Let me jump in, and I’m sure Brad or others might want to add to this. The first quarter, typically, when you think about revenue, and this is not unusual, go back to the first quarter of last year and the previous quarter in 2020, Q1 tends to be north of 30%. One dynamic that we have additionally seen playing out -- in fact, when you look at why that reason, compensation tends to be something that really pops up, we’ve really done, I think, a fairly good job of managing just a run rate of compensation and keeping that down. But, our sense is that that will slightly come down, and it’s not going to be huge move, because we can see some pretty big swings. As always, with follow-up questions or things that you’d like to have clarified, please get in touch with Jalpa, and we’ll put together the right people to answer your questions. And while we don’t know exactly where commodity prices and interest rates will be 6 months from now, we do know that the way we’re structured, we’re very, very well positioned to continue to deliver very, very steady results and to continue to fulfill our mission of serving American agriculture."
}