{
    "symbol": "AGM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 13:30:30",
    "content": " The overall growth in the wholesale financing space continues to reflect many of our institutional counterparties, adding longer term AgVantage Securities to manage their asset liability maturity profiles, given the recent increases in interest rates and the comparative competitiveness of Farmer Mac AgVantage pricing relative to other market and Fed Reserve Bank derived options. Developing this capital flow to American agricultural producers exemplifies Farmer Mac's core mission to lower cost for the end borrower, and improve credit availability in rural America while also creating a well-received new investment opportunity for leading institutional investors. And I'm going to ask both Aparna and Zach to weigh in, because our asset liability management in this interest rate environment has been a contributor, but also and you can see this reflected in how we report out our segments, our line of business segments, is the benefits of diversification show up both in the top line growth as well as the bottom line growth because some of these lines of business that have had disproportional increases over the last year are accretive in terms of net effective spread. One of the phenomenon, and I think we've emphasized this on the call, you know, our quarterly calls as well as on this one, is just the fact that as the nominal rate environment has continued to move up some of the decisions we've made to extend our funding, as well as some of the excess capital that we've raised, has certainly contributed to lowering our funding costs in aggregate, because that's really reinvests and offsets, the rise in the nominal rate environment that could come with trying to raise capital or funding in this particular environment. So we acknowledging what's been going on over the last 10 years, continual trend in the reduction of the cost of these sources of energy, and the fact that this capital investment is being made in rural markets many times on leased or purchase land agricultural land, and in rural communities, all part of our mission of supporting the economic development and economic opportunities in rural America makes perfect sense for us to do this as well as the credit risk profile and the funding requirements for these long-term amortizing projects. Because if they're saying they're lending money at 7.5% and they're borrowing at 4.3% and they're generating attractive returns, and they're growing their renewable energy lending portfolio, it would seem, this is my very simplistic view that you would have an extreme funding advantage and your cost of lending would be significantly lower, and this $200 some-odd million renewable loan book that you have currently should be able to grow at a phenomenal rate."
}