{
    "symbol": "MFC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 12:26:12",
    "content": " While our net income for the second quarter was impacted by market volatilities, on a year-to-date basis, we delivered net income of $4.1 billion, which was $600 million higher than the same period in 2021 and close to $1 billion higher than our year-to-date 2022 core earnings. We achieved new business value of $511 million, lower sales in certain markets in Asia due to continued COVID containment measures impacted NBV this quarter. We generated core earnings of $1.6 billion, with a year-over-year decrease of 9%, reflecting a number of factors: the unfavorable impact of markets on seed money investments; lower new business gains; lower in-force earnings in U.S. annuities related to the variable annuity reinsurance transaction that closed in February of this year, as well as lower net fee income from lower fee spread and lower average AUMA in Global WAM. These were partially offset by in-force business growth in Asia, Canada and U. S. insurance, higher yield on fixed income investments, and gains on available for sale equities in corporate and other, and improved policyholder experience in the U.S. Of note, the unfavorable impact of markets on seed money investments was $93 million, and consisted of approximately $65 million from equity funds and approximately $28 million from fixed income funds. Net income attributed to shareholders of $1.1 billion decreased by $1.6 billion from the prior year quarter, reflecting charges from the direct impact of markets, smaller gains from investment-related experience and lower core earnings. New business gains decreased by 25%, primarily driven by lower sales in Asia resulting from continued COVID-related containment measures and lower contributions from insurance segments in the U.S. and Canada. Core earnings in our global WAM business decreased by 16%, reflecting lower fee spread and lower average AUMA due to lower equity markets and higher interest rates. Core earnings in Asia decreased by 3%, driven by lower new business volumes, reflecting COVID-19 containment measures in Hong Kong and several markets in Asia Other, unfavorable policyholder experience in Mainland China and Vietnam and unfavorable product mix in Mainland China. The core loss in corporates and other increased by $61 million, primarily driven by the unfavorable impact of markets on seed money investments, and we delivered core ROE of 12.1%. In the second quarter, we generated APE sales of $1.4 billion, down 1% from the prior year quarter as growth in North America was more than offset by a decline in Asia. Overall, Global WAM's average AUMA decreased by 3%, driven by the unfavorable impact of markets in 2022, partially offset by net inflows over the past 12 months."
}