{
    "symbol": "MFC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 12:12:09",
    "content": " You'll see on Slide 6, we delivered solid core earnings of $1.6 billion, a modest 4% decrease from the prior year quarter as we continue to benefit from the diversity of our businesses. And we also reported net income of $3 billion, an increase of $2.2 billion over the prior year quarter, reflecting strong investment-related experience and a gain from the closing of the US variable annuity reinsurance transaction. While the rapid and unprecedented resurgence of COVID-19 disrupted new business activities in multiple markets in Asia, our diversified digitally enabled and well-established distribution channels delivered double-digit growth in APE sales and NBV relative to the average levels during the first wave of the pandemic in the first and second quarters of 2020. This year-over-year change was driven by a number of factors; lower new business gains in Asia, an unfavorable impact of markets on seed money investments and lower in-force earnings in US annuities due to the variable annuity reinsurance transaction that closed on February 1st. Net income attributed to shareholders of $3 billion was up $2.2 billion from the prior year quarter, reflecting gains from the direct impact of markets, again related to the U.S. variable annuity reinsurance transaction and larger gains from investment-related experience. New business gains decreased by, 31% from the prior year period, primarily driven by lower Critical illness sales in Mainland China, lower sales in Hong Kong and several markets in Asia Other due to the strong COVID-19 wave, as well as lower COLI product sales in Japan. Core earnings in Asia decreased by 5%, driven by lower new business volumes in Hong Kong and several markets in Asia Other, reflecting the adverse impact of COVID-19 containment measures, lower sales in Japan and unfavorable product mix in Mainland China. Core earnings in Canada increased by 19%, reflecting higher in-force earnings, more favorable policyholder experience and new business gains in the individual insurance business. We delivered new business value of $513 million, down 14% from the prior year quarter. Our financial leverage ratio increased by 0.6 percentage points from the prior quarter, driven by a net issuance of securities, the impacts of higher interest rates on AFS bonds, a stronger Canadian dollar and share buybacks, partially offset by growth in retained earnings. And given the CSM is an intrinsic part of the value of the business and an objective metric that illustrates the growth and future earnings generation capability of our insurance businesses, on transition, we will be adding 2 new medium-term financial targets relating to the CSM."
}