{
    "symbol": "TRU",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 15:33:04",
    "content": " We delivered organic constant currency revenue growth of 7%, excluding mortgage, highlighted by the strength of our international emerging markets and strong growth in financial services in key emerging verticals. We also expect adjusted EBITDA margin to expand from 26.5% to 32% end year, positioning us to reach roughly 40% margins by 2025 as we fully realize cost synergies of at least $80 million now, increased from our prior guidance of $70 million. Excluding Neustar and Sontiq in October and November, and Argus from the full quarter, the organic constant currency margin would have been 36.8%, up about 110 basis points, compared to the year ago fourth quarter. Fourth quarter adjusted diluted EPS declined 4% with adjusted EBITDA growth offset by higher interest expense and a higher-than-expected full year adjusted tax rate of 22.4%, compared to our 22% guide. Excluding mortgage, organic constant currency revenue growth was 2%, despite comparing to a 27% growth rate in the fourth quarter of 2021, implying a 15% two year growth CAGR. And then as Todd said, the first quarter of the year, because of seasonality is typically our softest from a revenue standpoint and it just so happens that this year, we're comparing against a very strong first quarter in 2022 where the enterprise grew 8%, financial services U.S. grew, I don't know, I think it was in the mid-teens, right? We exited the year at 8%.We've got a strong line of sight to that revenue, in particular, because as we've said before, it's about 80%recurring and we had one of our best selling years ever last year, good sales volumes and momentum increasing with each passing quarter, right? The fact is we got great momentum, we had a big year of sales, we've got probably higher line of sight to the 8% growth than we typically would coming into the New Year and I feel like we're just getting our rhythm, our mojo, if you will, in terms of cross-selling Neustar products across all of our verticals."
}