{
    "symbol": "TRU",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 15:29:10",
    "content": " In the second quarter, TransUnion's organic constant currency revenue growth was 5% overall and 9% excluding U.S. mortgage revenues. In the U.S. markets in the second quarter, financial services, excluding mortgage, grew a robust 18% on the strength of consumer lending, which grew 29%, card and banking which grew 17% and auto, which managed to grow 5% despite inventory shortages. Our international segment grew 15% on an organic constant currency basis behind surging growth in our emerging markets of India, LatAm, APAC and Africa, and attractive growth in Canada and the UK after adjusting for nonrecurring revenues from the prior year. And now turning to our revised full year guidance for 2022, we have reduced enterprise organic growth expectations, excluding U.S. mortgage, from 11% to 9.5% at the guidance midpoints. As the organic growth bridge shows, our revised guidance reflects adjustments in several factors, including the shortfall in second quarter results, a lower mortgage forecast given the rapid increase in rates and falling volumes, modestly lower growth in U.S. markets, excluding mortgage, as we reduce our forecast and financial services to the mid teens versus our earlier guide of approximately 20%. As we integrate Argus over the year, we expect revenue growth in the low single digits with a 31% margin, excluding integration costs. Excluding the Neustar, Sontiq and Argus actions, the margin would have been 40.2%, down about 30 basis points compared to the year ago second quarter. Now looking at segment financial performance for the second quarter, U.S. markets revenue was up 44% compared to the year ago quarter. Excluding the revenue related to one-time contracts, including with the UK government, our UK business would have grown about 8% in the quarter as our core financial services business continues to show solid mid single digit growth. In Asia Pacific, we grew 22% from continued good performance in Hong Kong, driven by credit visions growth and new business with fintech players, along with continued recovery in the Philippines, which had been under lockdown longer than any of our other markets. To conclude, TransUnion delivered another good quarter and we're set up for a strong full year with 9% to 10% organic constant currency revenue growth, excluding mortgage, and with an organic EBITDA margin of about 40%. If you could, give us more color about the 25 million bar, which is the organic revenue growth reduction for second half of the year as it refers to U.S. markets ex-mortgage, like give us a sense, does this include an assumption about a slowing consumer lending environment or any vertical within emerging verticals that have had a kind of tempered expectation for the second half? So I think what is probably most instructive to think about that $25 million ex-mortgage is just simply the growth rates that we had anticipated in our financial services business for consumer lending and for card and banking, we expected to be higher than what I would consider to be already really strong growth rates. The other part is the emerging markets business, which is an increasing portion we're forecasting roughly 8% growth organic over the course of the year."
}