{
    "symbol": "BARK",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-09 18:53:07",
    "content": " Our results last quarter illustrate the significant progress we continue to make across each of our strategic initiatives we laid out at the beginning of the year, namely accelerating our path to profitability; making meaningful progress in our food and consumables business; and transforming our customer base by acquiring more premium customers. Last quarter, we grew our average order value by $2 year-over-year, improved our gross margin by 4 points to 60%, reduced our inventory by $15 million and ended the quarter with $164 million of cash on the balance sheet, essentially unchanged from fiscal Q2. Our dental product, BARK Bright delivered $2.7 million of revenue in the quarter, up 70%, compared to last year. Finally, that all rolled to an adjusted EBITDA loss for the quarter of $12.8 million, slightly ahead of our guidance and a 30% improvement, compared to the third quarter of fiscal 2022. For our fiscal fourth quarter, we expect revenue to be approximately $121 million and full-year revenue to come in at roughly $530 million. For the fiscal fourth quarter, we currently expect an adjusted EBITDA loss of roughly $3 million an 87% improvement, compared to the fourth quarter of fiscal 2022. Our Bright product line has been performing exceptionally well, delivering $2.7 million of revenue in the quarter and roughly $8 million through the first nine months of fiscal 2023, up over 100% on the corresponding period for 2022. To quantify the magnitude of this exercise, we expect to achieve approximately $12 million of annual cost savings starting this quarter with around $10 million to $11 million flowing into fiscal year 2024. And lastly, adjusted EBITDA was negative $12.8 million, $200,000 ahead of our guidance for the quarter and a 30% improvement, compared to the negative $18.3 million we generated last year. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}