{
    "symbol": "PAYX",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-29 14:38:04",
    "content": " Those are ASO clients are Paychex clients and we'll be talking to them again next year about whether or not it's the right time and whether or not you've got the right benefits offering that now meets their needs, and we're certainly doing a lot of work there to try to make sure we've got the right continuum of insurance products to meet the market conditions for small businesses today. And again, I think what's going on there, not only as our products and services resonating, but I think people that are advising clients are beginning to put a preference on, hey, if I'm going to advise my clients were to go, maybe they need to be in a nice safe place where I don't have to have worries about whether or not their employees are going to get paid. One thing that's really interesting final point on that, John, just to highlight something John said, which is this preference for ASO versus PEO is a permanent preference for many clients eventually that want a PEO solution because they want the benefit of and we're expecting that we're going to see more of that as we head into next year. So, we're confident that we'll have the right lineup and the right opportunity, and then as Efrain said, historically, most of Paychex PEO sales really prior to our acquisition of Oasis was coming from upgrading ASO clients into the PEO business, a lot of inside the base. So, we think there's additional opportunity inside our client base to upgrade them to PEO and that not only increases the revenue, but it also increases the lifetime value of the customer to us, it's the right thing to do for the business, and we'll be looking at plans to do that as we go into next year as well. I think that what you're seeing is -- and again, some of this is just speculation on our part, but when we see clients that had our insurance and we go through enrollment and where they had 25 employees that bought the insurance, now they have 22 or you see clients that had your insurance in the PEO and decide that they no longer going to have insurance or offer insurance for your employees. So, I think what you're going to see is us continue to understand what things we need to engage the customer around that if we engage them on those items, it's going to increase the value they get from Paychex. So I was always trying to explain to people that when you look -- when I look at it because we're doing our budget points, I'm looking back almost five fiscal years now and fiscal year '19 stands out because then you see all this entity going on in the other fiscal years. So, I think when we're sitting down for the budget, we're certainly going to add sales reps engaging our strategic partners, doing things that we need to do to cover the market and the market opportunity we have, but we're equally balanced on making sure we're making the investments in digital engagement and driving productivity and using the data analytics we have to make sure we're making every rep as productive as they can be."
}