{
    "symbol": "INFN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 23:09:02",
    "content": " Today's call will include projections and estimates that constitute forward-looking statements, including but not limited to, statements related to our expectations regarding business plans, model and strategy, including product road map and products, sales, growth, market opportunities and trends, manufacturing operations, technology, the shift to open architectures, market adoption of coherent optical engines, competition, customers, expectations regarding industry-wide supply challenges, the macroeconomic environment and ongoing COVID-19 pandemic impacts and statements regarding our future financial performance, including our financial outlook for the fourth quarter of 2022. On a year-over-year basis, we expanded operating margin by 270 basis points, grew product revenue 17%, which represented an acceleration from 11% growth that we posted last quarter and grew total revenue by 9%. First, we ramped ICE6 to over 30% of product revenue in the quarter and secured key design wins with several large customers, including at Tier 1 global cable operator with significant operations in the US, a Tier 1 ICP as we expanded into their long-haul network and a major telecommunications service provider in Asia Pacific. Looking ahead into the fourth quarter, we're planning for another quarter of above-market revenue growth, while fighting the remaining acute supply chain challenges to get towards non-GAAP gross margins of 40%. The Infinera team executed well to deliver revenue and operating margin at the upper end of our outlook range and revenue in the third quarter was $390 million, up 9% on a year-over-year basis with product revenue growth of 17%. Through the first three quarters of 2022 and compared to the same period in 2021, we grew company revenue by 6% and product revenue by 11%, well ahead of the 4% growth rate for the optical market, netting in an expected gain in market share. Taking these factors into account, we expect Q4 revenue to be in the range of $435 million, plus or minus $15 million, representing approximately 8% growth on a year-over-year basis at the midpoint of the range. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. So, as you look out into the next three, four, five quarters, will we see when the supply chain improves but that 400 basis points falls through to the gross margins, or are there price increases that you're anticipating that would cause the effective normalized costs to go up and offset some of that benefit. So, conceptually, if hypothetically, we were to see the majority of that 400 basis point hit to gross margins in 3Q fall out, say, three quarters of a fall out in the third quarter of next year, would the expected strategy be to take that to the bottom line, or would you take some of that and reinvest it into R&D, sales and marketing and other expenses."
}