{
    "symbol": "INFN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 20:34:06",
    "content": "  Today's call will include projections and estimates that constitute forward-looking statements, including but not limited to, statements about our business plans, including our product road map, sales, growth, market opportunities, manufacturing operations, products, technology and strategy, statements regarding the impact of industry wide supply chain challenges, macroeconomic factors and COVID-19 on our business plans and results of operations, as well as statements regarding future financial performance, including our financial outlook for the third quarter and second half of 2022. The second quarter results were encouraging in a challenging environment with revenue beating the midpoint of our outlook range, non-GAAP operating margin at the upper end of our range and non-GAAP gross margin near the midpoint of our range due to higher supply chain costs. On a year over year basis, product revenue grew 11%, while services revenue declined 11% due to supply related delays in customer deployments, resulting in total company revenue growth of 5.5%. We expect the supplier chain -- higher supply chain costs to start easing next year, potentially declining by 30% to 40% in 2023 and to dissipate in 2024. On a year-over-year basis, Q2 revenue of $358 million was up 5.5% with product revenue up 11% in the quarter and up 8% in the first half. Services revenue, which is still being impacted by the timing of customer project deployment, was down 11% on a quarter-over-quarter -- on a year-over-year basis. Taking these factors into account, we expect Q3 revenue to be in the range of $360 million to $400 million, representing approximately 7% growth on a year over year basis at the midpoint of the range with product revenue growth at or above 8% to 12% while services revenue will still be down on a year over year basis in Q3. The resulting operating margin in Q3 is expected to be 3% plus or minus 300 basis points, generally in line with current consensus expectations and up on a year over year basis at the midpoint of the range. Overall, I look at a tough macroeconomic backdrop but growing -- our current view of the year is we will grow product revenue 8% to 12%, and that will be double what we did last year in a tough supply chain environment."
}