{
    "symbol": "INFN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 23:38:01",
    "content": " Today’s call will include projections and estimates that constitute forward-looking statements, including but not limited to, statements about our business plans, including our product road map, sales, growth, market opportunities, manufacturing operations, products, technology and strategy, statements regarding the impact of industry-wide supply chain challenges and COVID-19 on our business plans and results of operations, as well as statements regarding future financial performance, including our financial outlook for the second quarter of our fiscal year 2022. Second, a $20 million impact from two new supply chain-related developments including, first, project delays due to customer dependencies, meaning we shipped the hardware, but our customers were delayed in commissioning their network to allow for revenue recognition due to challenges with their site readiness availability of customer resources and customer furnished installation material. We anticipate the second half of the year will benefit from the continued ramp of our own production of ICE6, conversion of our backlog of revenue, partial benefit from first half push outs of those projects as I mentioned we're timing-only based and some supply chain relief given the actions we've taken over the last six quarters will continue to intensify. Turning to the financial details of the quarter, Q1 revenue of $339 million grew 2% year-over-year with product revenue up over 5% while services revenue was down 8% on a year-over-year basis. And no customer contributed greater than 10% of our revenue in the quarter.\\ Q1 gross margin of 36.2% came in below the midpoint of our outlook range, primarily due to an incremental 150 to 200 basis points of supply chain impact from higher component costs and lower volumes. And second, approximately $25 million of revenue attenuation from customer delays and project push-ups, including a large global ICE6 deal that is shipping in Q2, but will generate revenue in the second half of the year. Compared to the year ago quarter, the primary factors influencing our gross margin outlook include a higher mix of ICE6 revenue, which is accretive to the company's gross margin, but is being offset by the impact from a combination of higher supply chain costs as we continue to bear the burden of higher components, materials, logistics and freight costs. We expect Q2 operating margin to be a loss of 2% plus or minus 100 basis points, with operating margins down on a year-over-year basis at the midpoint of the range, primarily due to lower gross margin compared to the year ago quarter. Given the recent external events, including the challenging supply chain environment and the impact to our services revenue in the year from customer project pushouts, based on what we see today, we now expect our full year revenue growth to be at the low end of our 8% to 12% goal and for gross margin to expand by 100 basis points to 150 basis points in 2022 versus our prior 300 basis point to 400 basis points goal. Our updated outlook for the year also implies a meaningful improvement in our financial performance in the second half of the year, with revenue growth measures for the second half at or above the high end of an 8% to 12% range and gross margin of 40% plus exiting the year. Our second half financial performance is expected to benefit from product growth, the ramp of ICE6, the deployment of new customer wins secured in the first half, the timing of certain large project deployments completions and our supply chain mitigation efforts. Your line is open. Your line is open. And the fact that, that DSP is back from the fab, ahead of schedule and testing well, just puts us a high degree of confidence -- a higher degree of confidence in our ability to go ahead and hit that margin improvement in the first half of next year and the fact that we're going to have samples out bodes well for all the customers looking to deploy both point-to-point and kind of the industry's first point to multipoint. Your line is open. Your line is open. Your line is open. So given that, look, I think our – giving the color of outlook that we have, we're just trying to give you assurance that, again, when you're sitting on $822 million RPOs and you know the contracts, you know the design wins you have and you're expecting that to grow again, again commensurate with the first half growing another $100 million in RPOs, that's what gives us confidence. Your line is open. Your line is open. Your line is open. Your line is open."
}