{
    "symbol": "INFN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 20:05:06",
    "content": " Today's call will include projections and estimates that constitute forward-looking statements, including, but not limited to statements related to our expectations regarding our business model and strategy, market opportunities and trends, competition, customers; capacity growth; the shifting open architecture; market adoption of coherent optical engines; our ability to ramp ICE6 and increase vertical integration; the potential for Infinera as new subsystems products to drive market expansion; increase Infinera's profitability; and improve Infinera competitiveness in the future. Expectations also regarding industry wide supply chain challenges and the macroeconomic environment, projected year-over-year drivers of demand, revenue, gross margin, operating expenses and operating margin, future investments in our direct sales force, our ability to sell higher margin products to existing customers of line systems and Infinera's financial outlook for the first quarter and full-year of 2023. Second, we plan to expand our operating margins and gross margins again in 2023, as we continue to ship more vertically integrated products like ICE6 and as the supply chain costs attenuate in the back half of the year. Revenue in the quarter was $486 million, a new high for the company and up 21% on a year-over-year basis, with product revenue up 26%. Performance in the services business improved further with revenue up 19% sequentially and 3% on a year-over-year basis, as we continued to recover from the supply-related impact earlier in the year. Operating profit in the quarter was $51 million, up to approximately 200% on a year-over-year basis, with an operating margin of 10.5%, compared to 4.3% in Q4 of â\u0080\u009821. This margin performance in the quarter clearly highlights the operating leverage potential in our business model, which we believe will only get better as we drive a higher percentage of vertical integration in our product mix and with the benefit from the attenuation of supply chain costs in the second half. We delivered record revenue of $1.57 billion, up 10% on a year-over-year basis and within our stated range of 8% to 12% growth. Taking these factors into account, we expect Q1 revenues to be in the range of $380 million plus or minus $15 million, representing approximately 12% growth on a year-over-year basis, at the midpoint of the range. We expect Q1 gross margin to be in the range of 38.5% plus or minus 150 basis points, up 230 basis points year-over-year at the midpoint of the range. The resulting operating margin in Q1 is expected to be approximately 1.5% plus or minus 250 basis points, up approximately 250 basis points on a year-over-year basis. The two key drivers of gross margin expansion in the year will be the continued ramp of ICE6 and our expectation of some relief of supply chain costs of approximately $30 million, with most of the benefit expected to flow through the second half of the year."
}