{
    "symbol": "TRVI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 02:40:23",
    "content": "  Operator: Good afternoon, and welcome to the Trevi Therapeutics First Quarter 2022 Earnings Conference Call. Various remarks that management makes during this call about the company’s future expectations, plans and prospects constitute forward-looking statements for purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the Risk Factors section of the company’s most recent quarterly report on Form 10-Q, which the company filed with the SEC this afternoon. In addition, any forward-looking statements represent the company’s views only as of today and should not be relied upon as representing the company’s views as of any subsequent date. While the company may elect to update these forward-looking statements at some point in the future, the company specifically disclaims any obligation to do so even if its views change. I would now like to turn the conference over to Jennifer Good, Trevi’s President and CEO. Good afternoon, and welcome to our first quarter 2022 earnings call and business update. Joining me today on this call are Lisa Delfini, Trevi’s Chief Financial Officer; and Dr. Bill Forbes, Trevi’s Chief Development Officer. 2022 has already been an exciting year on the clinical front for Trevi, and there is more data to come. For instance, it is believed that for pruritus and PN, if you are able to break the itch scratch cycle for the patient by reducing or suppressing the itch and therefore the urge to scratch, then the skin and nodules will have time to heal. For cough in IPF, patients may cough upwards of 1,500 times per day, and by significantly reducing cough, there is potential to decrease the mechanical trauma that coughing puts on the lungs, which may result in broader benefits to IPF patients. Trevi was built with this strategy in mind, and it is very exciting to be reading out critical data in both of our indications in the coming months. Our most advanced program in clinical development is in severe chronic pruritus in prurigo nodularis or PN, which is a serious and debilitating disease characterized by papules and nodules on the skin as well as incessant and severe itching. We believe PN, due to the refractory nature of the disease, is neurologically mediated and potentially aligns well within the neural mechanism of our mixed agonist-antagonist drug. Most of these patients have already tried and failed topical treatments, and we believe future patients will be eligible for an oral therapy like Haduvio before turning to biologics. Turning now to our other clinical program, which is in chronic cough in idiopathic pulmonary fibrosis, or IPF. During the first quarter, we were very happy to report a positive result from a pre-specified efficacy interim analysis, allowing us to end enrollment early, save money and accelerate into the next phase of development. In this interim analysis, Haduvio showed a 77% reduction from baseline at day 22 in daytime cough frequency as measured by an objective cough monitor, demonstrating a 52% difference from placebo. Imagine how impactful a 77% reduction in cough may be to a patient who coughs up to 1,500 times per day. Haduvio was well tolerated in this study with only one SAE that was not deemed to be treatment related, and the adverse events were consistent with what we have seen in Haduvio trials in other indications. With the strength of the p-value reported, we would expect to see similar results in the final data set and anticipate announcing data on the full set of subjects in the third quarter of this year. To date, the team has written a protocol synopsis, which we intend to design as an adequate and well-controlled trial, as well as requested a meeting with the FDA to discuss the design. And as a team, we are determining our path forward, not only in this indication, but also other chronic cough indications. It has been a busy start to the year at Trevi, but we still have much to do with the data-rich few months ahead of us, and then a transition into the next phase of development. As a reminder, the full financial results for the three months ended March 31, 2022, can be found in our press release issued ahead of this call and in our 10-Q, which was filed with the SEC today after the market closed. On April 11, we raised $55 million through the sale of common stock and prefunded warrants to both new investors and any long-time investor who also chose to participate. The new investors were Frazier, Venrock, and Fairmount, and these funds are well-known biotech investors, and we’re thrilled to have them in our corner as we advance the development of our programs. Together with our cash balance of $29 million at the end of March, I’m happy to report that we now have over $80 million of cash and investments on hand. These funds will be used for our ongoing operations, including completing our current PRISM trial and its open-label extension and planning for and conducting our next trial for chronic cough in IPF. In addition, we have approximately 15 million warrants still outstanding, which can provide up to $20 million, if exercised. For the first quarter of 2022, we reported a net loss of $7.3 million compared to a net loss of $8.4 million for the same quarter of 2021. R&D expenses were $4.6 million during the first quarter of 2022, compared to $5.6 million in the same period of 2021, primarily due to decreased clinical trial subject recruitment cost due to our PN trial wrapping up enrollment this year. G&A expenses were $2.4 million during the first quarter of 2022 compared to $2.5 million in the same period of 2021, primarily due to lower legal fees as a result of the timing of certain intellectual property filings. In closing, we are excited about the strategy of the company, the recently reported data in IPF cough, and the strength of our balance sheet to continue executing on our plan. So as far as what to expect with the top line, I think, as far as guiding you, we’ll provide the information that we have. And then assuming this is positive, you’ll have to conduct a second Phase 3 trial in PN. But given that we should be in – the second trial is to be conducted in a better COVID environment than the previous one, maybe just give us an idea of how the time lines could be improved. So I’ll probably pass the budget response on to Lisa, but yes, we’ve been guiding towards the probable need for a second study in this indication. And of course, hopefully, we don’t have to have as many patients in the second study as well. So depending on a lot of hypotheticals, hopefully, that will take about two years in the in-clinic phase for it to be completed. Lisa, I don’t know if you want to handle the cost of the study. So we don’t have an exact number, but we are estimating that it will be in the $20 million to $30 million range. So I’ll start, and maybe, Jennifer, you might want to step in on a couple of these. But what we’re looking at, and we’ve been pretty vocal about this. Right now, we estimate that we’ll have about 300 patients in the next study, 100 patients per treatment group. We anticipate that the enrollment period for that will be 18 to 24 months, and we’re going to try to do everything we can to keep it to 12 months, if possible. So I’ll add a little more color here to this, Annabel. But one of the things that I’ve been very vocal about is that we don’t need a lot of patients to show efficacy, and we know based upon our Phase 2 experience that very few patients are required to drive a statistical difference. We anticipate that when we unburden them from this kind of cough, the amount of cough that these patients have, that they will do very well from a respiratory perspective, and I think that will play into hospitalizations and respiratory distress that they have and an improvement in the respiratory exacerbations. So I think, for the most part, we’ll follow them right now. And as Jennifer mentioned in her talk, we’ll have a discussion with them in Q3. So I don’t know, Jennifer, if I missed anything. I would just add on the resourcing, Annabel, you’re asking. I think I feel comfortable, we’ve got a good development team in place. We’ve got a strong clin-ops under Bill, and we are capable of running both of these trials. But what I’m less comfortable with, and it probably plays into some of our decisions and other indications as sort of wearing off into completely new spaces. I think as long as we stay home in sort of pruritus and cough, I feel comfortable about our ability to run two trials in parallel. So I think PN, it’s pretty easy to sort of measure healing. Well, I think the antifibrotics have done a pretty good job of trying to stick out some of this. I think we’ll take a look at changes in FVC, although six months is a little bit short to be able to see anything like that. But I think we’ll probably hone in around things like hospitalization, specifically respiratory hospitalizations as a result of respiratory illness. And so we’re talking about those, and I want to get over my skis on some of this, so we want to have a discussion with the FDA on it. But I think as far as exacerbation of IPF, if you just take a look and look at the things that the antifibrotics have done to try to measure improvement in some of these things, we’ll count some of those same types of things. And we’ll have an open-label study that will be able to follow these patients longer, too. So I think we’ll see over time whether or not reducing cough, in about half of these patients by up to 75% reduction in their daytime cough, we’ll see if that translates into better respiratory function over time. Are there, I mean, you mentioned you had warrants, but are there any other potential ways to monetize some of the ex-U.S. opportunity to really give yourself additional lift to maximize what you can do with these programs that you have right now? So we’ve been busy at that over the last year, sort of preparing for these data readouts. We’ve got a lot of experience and Bill has been through all those jurisdictions getting approvals, but I do think bringing in sort of their knowledge around pricing and some of the stuff is helpful. I mean obviously, if you end up disease-modifying, I think Annabel hit on some of the FVCs that’s longer. If you end up just treating sort of the severe aspect of the disease of cough, which I still think is quite meaningful, it’s not going to be in that disease modification category. So huge range there and a lot of difference, but it just is going to come down to what Bill is able to sort of read out in this trial. So we’re going to make sure we read both of these trials out and get both of these programs on their way, assuming the data supports that. Clearly, cough does, we’ll wait for PN. Beyond that, we are doing a lot of work internally preparing for other markets, pricing sort of strategy, I think to the question about resourcing, what can we handle. So we’ll fight off maybe one or potentially two other indications along the way that could make some sense, I think, to help really grow out the company. So we are doing that work, and I would expect, once we get all the data in hand and are able to course around the path forward, we’ll be able to give some guidance on that. I’d also like to thank the Trevi team, our study investigators and all the subjects who have participated in our clinical trials."
}