{
    "symbol": "TRVI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 23:10:04",
    "content": " Various remarks that management makes during this conference call about the company's future expectations, plans and prospects constitute forward-looking statements for purposes of the safe harbor provisions under the Private Securities Litigation Reform Act of 1995. Actual results may differ materially from those indicated by these forward-looking statements as a result of various important factors, including those discussed in the Risk Factors section of the company's most recent annual report on Form 10-K which the company filed with the SEC this afternoon. In addition, any forward-looking statements represent the company's views only as of today and should not be relied upon as representing the company's views as of any subsequent date. While the company may elect to update these forward-looking statements at some point in the future, the company specifically disclaims any obligation to do so even if its views change. I would now like to turn the conference call over to Jennifer Good, Trevi's President and CEO. Joining me today on this call are Lisa Delfini, Trevi's Chief Financial Officer; and Dr. David Clark, Trevi's Chief Medical Officer. 2022 was a transformational year for Trevi with regard to validating the broad utility of the mechanism of our drug, Haduvio. With our trials in IPF cough and prurigo nodularis both reading out positive, it left us in a strong position to decide how best to grow the company for our stakeholders. Based on the strength of the cough data and IPF as well as the lack of competition in that space, we feel we can carve out a strong and unique position in therapy for IPF. We also believe that because of the differentiated central and peripheral mechanism of our drug, we have the potential to provide therapy across a range of chronic cough indications regardless of what the underlying disease is. So with those decisions made and strong capital raising in 2022, we are now buckled in and focused on executing against our plans for the next stage of development. Let me now provide an update on each of our programs, starting with our lead program in chronic cough and IPF. IPF is a serious end-of-life disease and chronic cough is a major cause of morbidity, significantly impacting the patient's quality of life. As we prepare for our next trials in this indication, there are many learnings we can take from the development work occurring in refractory chronic cough. However, there are also unique aspects of the IPF patient population related not only to a potential effect on the underlying disease but safety in this frail patient population that we also need to keep in mind. The doses we are planning to study are 27, 54 and 108 milligrams BID. Based on the data from the Phase II CANAL study, we have dropped the highest dose as it appears the efficacy occurred very early in that trial and at the lower doses. In parallel, we are planning for a Phase Ib respiratory physiology study. But because of the lung impairment in IPF patients, we feel this is an important question to study early. There is a new regulatory process in the EU called CTIS which became mandatory as of January 31, 2023. In theory, this new process will streamline the review process, although there is little data to show how the implementation is going and companies expect there will be growing pains. In parallel, our clinical operations team is preparing for these studies so that we can initiate once we have regulatory agreement on the protocol and an open IND. In addition to the preparations in IPF cough, we are also developing a protocol for a Phase II refractory chronic cough study. There have been a lot of trials in this condition, with only one mechanism which has been successful, the P2X3s. However, we believe there is still a significant opportunity for a mechanism that works both centrally in the brain and peripherally in the lungs and has the potential to provide strong and consistent efficacy in a broader set of RCC patients. During the fourth quarter, Dr. Philip Molyneaux presented data at the British Thoracic Society meeting. On Monday, May 22 in Washington, D.C., additional results from CANAL will be presented at the American Thoracic Society meeting. And on June 9 through 10 in Reston, Virginia at the American Cough Conference, there will be a presentation on our central and peripheral mechanism of action and why it is unique and could be important broadly in cough. The other program where we have ongoing work is for the treatment of prurigo nodularis, or PN which is a serious and debilitating disease characterized by papules and nodules on the skin as well as incessant and severe itching. In June of last year, we also reported positive data in the Phase IIb/III PRISM trial in PN. During the first quarter of 2023, we completed the 1-year open-label extension study that was associated with PRISM. Finally, we also commenced a human abuse liability study in the fourth quarter of last year. This study is a randomized, double-blind, active and placebo-controlled 5-way crossover design. The study is conducted in 2 parts, with the first part characterizing various butorphanol doses. As I look back on 2022, I am extremely proud of the execution by our team and the positive trial results in both of our lead indications. For PN, we are in discussions with potential partners to advance that program into the next stage of clinical development. The full financial results for the 3- and 12-months ended December 31, 2022 can be found in our press release issued ahead of this call and our 10-K which was filed with the SEC today after the market closed. For the fourth quarter of 2022, we reported a net loss of $5.5 million compared to a net loss of $8.5 million for the same quarter in 2021. The decrease was primarily due to decreased clinical trial costs, reflecting the completion of both the blinded portion of the PRISM and CANAL trials prior to the fourth quarter of 2022, partially offset by an increase in costs related to the human abuse liability study which we initiated in the fourth quarter of 2022. Other income net was $1.1 million in the fourth quarter of 2022 compared to other expense net of $300,000 in the same period of 2021. The change was primarily due to an increase in interest income in 2022 as a result of investing the funds from our capital raises completed during 2022, coupled with higher interest rates than were available in the fourth quarter of 2021. For the year ended December 31, 2022, we reported a net loss of $29.2 million compared to a net loss of $33.9 million for 2021. During the fourth quarter of 2022, we received $3.1 million in gross proceeds from the underwriters' option for the greenshoe related to our September offering. These funds, together with the funds we raised earlier in the year, enabled us to end the year with cash, cash equivalents and marketable securities of $120.5 million. I want to ask, Jennifer -- both my questions are really dosing-related questions. David, I'll take the first one on the house since I lived through that. And then why don't you take the RCC dose since you're working on that protocol, as we speak. And so we sort of pushed up and really, there's a limit in the guidance that says once you get to 3x your effective dose in the market, you can stop which is what we were able to get to. And by the way, you're quite right that the top dose in -- used in the HAL study is 486, as you say, Jennifer. For the RCC study which as Jennifer explained, the design will be very similar to the CANAL, this 2-way crossover design in approximately 60 subjects. So -- and in the Phase IIb chronic cough IPF study also, that's a dose-ranging study, as you know. 27, 54 and 108 would be the 3 selected doses versus placebos for that. So yes, we are planning to run these doses together in the 2 programs. Yes, I mean as Jennifer said in the introduction, the -- we'll give precise guidance on the conduct phase for that study once we've finalized our planning. But studies of this sort of size that we're talking about, 200 subjects, you would usually aim for about a 12-month recruitment phase. The real gating factor has been a slight delay in the study start for that study, primarily driven by global supply chain issues with packaging materials, as it would happen. And then the other piece that Jennifer alluded to in terms of study trial conduct, the precision on what our estimate would be for how long the study will conduct, the other major factor there is this new EU CTIS process that you will have heard of. It's no longer optional, it's mandatory this year. And maybe another one, like so you guide the full data from the open-label extension operation in second quarter '23. I think we want to see the data, sort of what does it show, what's there. It's got a lot of interest by the dermatology community, for sure. I think R&D expenses will increase in 2023 as we conduct all of these studies that were -- that Jennifer referred to, as opposed to 2022. So most likely, we will go to the 162 dose that was included at the highest dose that was titrated to in the CANAL study. And how to inform, David, that Phase III program and what doses we use. So for Phase III, what we need to know is how broad a population of the IPF patients and their comorbidities. And we include -- so the respiratory physiology study will really answer that question for us because, as we have explained in the introductory comments, that study will include subjects with increased severity and with these comorbidities that were not included in Phase II to allow us to make that call for Phase III. Yes, Sean, I'm going to defer sort of giving hard guidance on that until we actually initiate it. I mean, David told you in sort of his last answer that we're planning for roughly a 12-month recruiting process. It's going to be a 6-month dosing -- or 6-week dosing, I'm sorry. But also -- my understanding is that there's the PAciFy trials as well as expected from Dr. Molyneaux both for morphine, post the test in IPF. And I think, Mayank, you were asking about the Philip Molyneaux trial in the U.K. around morphine. I think from our perspective, we're excited about that study because I think it just builds more critical evidence around the mechanism here in this whole opioid pathway. Morphine has its own set of issues, certainly around respiratory depression and also just the whole scheduling, Schedule II. But from our perspective, we think it just continues to build critical scientific evidence around the pathway; so I think it should work. And as I've heard from several KOLs, it's really the only thing that works in cough. But we felt that, first of all, we work on 2 receptors and we felt that because of more of the safety profile and abuse addiction profile around our drug, that we could be a much better chronic option. I would say in the IPF which is probably a little more advanced here, we -- there's a sort of accepted rate around 25%. We saw slightly lower, roughly 23% in our study. But when you look across the trials that have been done, that's a pretty good estimate. I think in RCC, we're working with sort of the experts here in the space who have all the data. David, I don't know if you know the powering assumptions we're using on placebo. For the IPF, including recent studies, they've been below 30% for placebo response consistently. The RCC, the key there is that it's a 2-way crossover design like CANAL. Now in RCC studies like that, including recent RCC studies, the placebo response has been around about 20%."
}