{
    "symbol": "AVT",
    "quarter": 1,
    "year": 2022,
    "date": "2021-10-28 21:23:05",
    "content": " As we shared last quarter, despite supply disruptions and ongoing pandemic restrictions in certain regions, we've continued to execute well in a strong market environment and progress on our margin expansion efforts by accelerating the growth of our high margin for no business, while also supporting the growth of our core distribution business to investments to improve efficiencies and strengthen critical partner relationships. Our focus and execution and the durable changes we've made to position Avnet as a stronger business are reflected in this quarter's results for both electronic components, and Farnell businesses. Operating margins were 3.2%, a slight improvement from last quarter as the team continues to manage operating expenses, while growing revenues driven by improved efficiencies across the business. As Phil noted, these initiatives include our efforts to expand skews in Farnell's inventory and enhance new product introductions, as well as make investments and systems and e-commerce, all of which have been major contributors to strong and sustainable operating margins. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. A couple of things that we noticed, this is the first time in a while. A couple of things that we noticed, this is the first time in a while. Please proceed with your question. So we committed to put over 200 plus 1000 new skews in and the more we do that, that's going to drive the automation, if we will e-commerce, which we've got many initiatives behind the scenes to go with it, if you will with the low touch high service model, and then put some of that over to the core business as well, take the best of what Farnell does, we're not leveraging across the enterprise, which we're beginning to do as well. Please proceed with your question. We've made significant durable changes over the past year that positions us to capture growth, continue to invest in our business and sustain at least a 3% to 3.5% operating margins for total Avnet in any type of market, internally driving our ability to deliver steadily increasing shareholder returns."
}