{
    "symbol": "AVT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-04-27 20:17:10",
    "content": " We are competing favorably across the board and are pleased to see continued improvement in our Americas business, where strong demand and expanded supply chain orchestration opportunities helped us grow revenue by over 40% year-over-year and achieved our fifth consecutive quarter of operating margin growth. 56% of our total sales and 72% of the total transactions were placed through Farnell's e-commerce platform this quarter, and we expect that to continue to see increased traffic and new customer acquisitions in quarters to come. Electronic Components grew revenues to 33% year-over-year to $6.0 billion, driven by increased demand creation and IP&E revenue, as well as new supply chain orchestration engagements. Please proceed with your question. Please proceed with your question. Please proceed with your question. Next quarter, the current guide is still an 18% growth year-on-year, okay, taken out, and that's given even Maxim, which you didn't mention. And it's growing in numbers of opportunities of what I'll call them non-traditional customers coming our way and suppliers taking us in that need help with the supply chain management and the orchestration of the control towers, if you will, to help the end customer manage their supply chains through and with the EMS providers, if they're using those. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And you're right, because our inventory did - you're right, it's a couple of quarters ago, and we shared with all of you on the phone that we refine in that inventory because we knew it was going to go back out. But it's not of the same products, but again, remember, the difference though is Farnell carries a really broad SKU count, right, because they're handling the engineers and it is higher service with - and they want to get to ship complete kits."
}