{
    "symbol": "AUB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 11:49:05",
    "content": " Please note that for the most part, my commentary will focus on Atlantic Union's second quarter results on a non-GAAP adjusted operating basis, which excludes the $9.1 million pretax gain or $8 million after tax from the sale of RIA business to Cary Street Partners in the quarter, and also pretax restructuring cost of $5.5 million or $4.4 million after tax in the first quarter related to the closure of 16 branches in the company's operations center in March. In the second quarter, reported net income available to common shareholders was $59.3 million, and earnings per share -- per common share was $0.79, up approximately $18.5 million or $0.25 per common share from the first quarter. Non-GAAP adjusted operating earnings available to common shareholders in the second quarter were $51.3 million, and adjusted operating earnings per common share was $0.69, which is up approximately $6.2 million or $0.09 per common share from the first quarter. In the second quarter, the total allowance for credit losses increased approximately $2.6 million primarily due to net loan growth during the quarter and increased uncertainty in the macroeconomic outlook due to high inflation, tightening monetary policy and geopolitical risks. The provision for credit losses of $3.6 million in the second quarter increased slightly from the prior quarter's $2.8 million provision, and a negative provision for credit losses of $27.4 million recorded in the second quarter of 2021 as the allowance for credit losses has normalized towards pre-pandemic CECL day one reserve levels. Tax equivalent net interest income was $142.3 million, which was up approximately $8.1 million from the first quarter, and that was driven by higher interest income due to average loan growth from the prior quarter, increases in loan yields due to higher market interest rates and an additional day in the second quarter, which was partially offset by increases in deposit and borrowing costs. The loan portfolio yield increased to 3.67% in the second quarter, up from 3.49% in the first quarter due primarily to higher rates on variable rate loans, an increase in net accretion on purchase accounting adjustments, and that was partially offset by a decline in PPP accretion income as that program winds down. Noninterest income increased $8.1 million to $38.3 million, primarily due to the $9.1 million pretax gain from the sale of the RIA business during the second quarter. Factoring out that gain, adjusted operating noninterest income declined approximately $950,000 to $29.2 million in the second quarter from the prior quarter. The net reduction was due to a decline in the investment securities portfolio of approximately $207 million, primarily due to the impact of market interest rate increases on the market value of the available-for-sale securities portfolio partially offset by the net impact of the decline in cash and cash equivalents of $155 million, which was used to fund net loan growth of $196 million in the second quarter. At period end loans held for investment were $13.7 billion, inclusive of $22 million in PPP loans, net of deferred fees, which was an increase of $196 million or 5.8% annualized from the prior quarter. If you exclude the PPP loan impacts, loan balances in the second quarter increased 7.2% annualized driven by increases in commercial loan balances of $153 million or 5.4% on a linked-quarter basis annualized, and consumer loan balance growth of $89 million or 17% annualized from the prior quarter. So replacing the $1.8 million decline expense on a quarterly run rate basis, declined noninterest income of $2.3 million, but add back $0.5 million in noninterest income because we'll be recording $0.5 million, presumably based on earnings of Cary Street Partners."
}