{
    "symbol": "AUB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 12:48:14",
    "content": " Please note that for the most part, my commentary will focus on Atlantic Union's first-quarter results on a non-GAAP adjusted operating basis, which excludes pre -tax restructuring costs of $5.5 million or $4.4 million after-tax expenses in the first quarter. In the prior quarter's pre -tax restructuring cost of $16.5 million or $13.1 million in after-tax expenses, which was related to the closure of 16 branches and the company's operations center during March of this year. In addition, fourth quarter non-GAAP adjusted operating earnings excludes the pre -tax gain of $5.1 million or $4.1 million on an after-tax basis related to the sale of Visa Inc. class b common stock in December 2021. In the first quarter, reported net income available to common shareholders was $40.7 million, and earnings per common share were $0.54, which was down approximately $4.1 million or $0.05 per common share from the fourth-quarter. Non-GAAP adjusted operating earnings available to common shareholders in the first quarter were $45.1 million and adjusted operating earnings per common share were $0.60, which is down approximately $8.7 million or $0.11 per common share from the prior quarter. Turning to credit loss reserves as of the end of the first quarter, the total allowance for credit losses was approximately $111 million comprised of the allowance for loan and lease losses of $103 million and the reserve for unfunded commitments of $8 million. The total allowance for credit losses increased approximately $2.8 million in the first quarter, primarily due to net loan growth during the quarter, and increased uncertainty in the macroeconomic outlook due to high inflation, tightening monetary policy, and geopolitical risks. The provision for credit losses of $2.8 million in the first quarter increased from the prior quarter's negative provision for credit losses of $1 million, and negative provision for credit losses of $13.6 million recorded in the first quarter of 2021 as the allowance for credit losses has normalized toward pre -pandemic CECL day one reserve levels. Tax equivalent net interest income was a $134.3 million, which was down approximately $7.3 million from the fourth quarter driven by lower PPP loan-related interest fees of $8.4 million, as well as lower net incretion of purchase accounting adjustments of $2.2 million. In addition, other borrowing costs were lower by $1.2 million in the first quarter, driven primarily due to the acceleration of the unamortized discount related to the redemption of the company's subordinated debt incurred in the prior quarter. The first quarter's tax equivalent net interest margin was 3.04%, which is a decline of six basis points from the previous quarter due to -- comprised of a decline of eight basis points in the yield on earning assets, partially offset by a two basis point decline in the cost of funds. The loan portfolio yield decreased to 3.49% in the first quarter from 3.81% in the fourth quarter due to the $8.4 million decline in PPP loan related interest and fees, which negatively impacted the first quarter loan yields by 20 basis points and the earning asset yield by 15 basis points. And also the decline of 2.2 million in net accretion of purchase accounting adjustments, which negatively impacted the first quarter loan yields by seven basis points and the earning asset yield by five basis points from the prior quarter. Non-interest income declined $6.2 million to $30.2 million in the first quarter from $36.4 million in the prior quarter, and that was primarily due to the $5 million -- $5.1 million gain from the sale of Visa Class B common stock recorded in the fourth quarter. Turning to non-interest expense, reported non-interest expense decreased $14.6 million to $105.3 million in the first quarter, primarily driven by lower restructuring expenses of $11 million as the prior quarter reflected $60.5 million related to the closure with companies up center and a consolidation of 16 branches that was completed in March of this year compared to $5.5 million in restructuring charges associated with the closings in the first quarter. Total assets were $19.8 billion at March 31st, a decrease of approximately 5.7% from December 31st levels due to a decline in cash and cash equivalents -- equivalence of $406 million as excess liquidity was redeployed to fund net loan growth of $264 million and net deposit runoff of a $127 million. At period end, loans held for investment were $13.5 billion, which included $67.4 million in PPP loans, net of deferred fees, which is an increase of $264 million from the prior quarter, driven by non PPP loan balance growth of $346 million, partially offset by $76 million in PPP loans that were forgiven during the first quarter. Excluding PPP loans, loan balances in the first quarter increased 10.8% annualized driven by increases in commercial loan portfolio of $297 million or 10.9% linked quarter annualized, and consumer loan balance growth of $48.9 million or 9.8% linked quarter annualized. At the end of March, total deposit stood at $16.5 billion, a decline of a $127 million or approximately 3% annualized from the prior quarter as a decline of a $182 million in high cost time deposits was partially offset by growth in low cost deposits. In addition, the company repurchased approximately 630,000 Common shares for $25 million during the first quarter, and currently has $75 million remaining on its $100 million share repurchase authorization. With the financial impact of the PPP loan program winding down, the pandemic-driven volatility related to expected credit losses and credit loss reserve levels subsiding, and the expectation that interest rates would begin increasing this year, we loaded in our fourth quarter 2021 earnings conference call in January that we set our top-tier financial metrics to be the following: Return on tangible common equity within a range of 13% to 15%, return on assets in the range of 1.1% to 1.3%, and an efficiency ratio of 53% or lower. And then on the expenses, I remember last quarter, you gave a range of $385 million to $390 million, and this quarter's expenses is a little bit higher than that kind of run rate. So again, if you look forward, we're probably looking at $96, $97 million in the out-quarters, combined that with the first quarter we're still at $385 to $390 on a full-year basis. We do think that that's going to come back down because late in the quarter we saw mortgage rate spike 5% -- up to 5% or a little higher so that's expected to come down, we think on a normal basis you see 20% to 25% of the origination book, regardless of the rates, we have a 75% purchase and a 25% -- 20% to 25% refi."
}