{
    "symbol": "WSC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 22:58:29",
    "content": " Given the resulting 31% in year-over-year revenue growth and the sequential stabilization in SG&A, we generated $251 million of adjusted EBITDA from continuing operations in Q3. Based upon this unique storage value proposition, which is further enhanced as we extend and expand VAPS penetration, we're confident in continued storage rate growth for years to come as we've been experiencing in our Modular business. As such, implied Q4 adjusted EBITDA from continuing operations is $257 million to $277 million, which, along with the $251 million of adjusted EBITDA from continuing operations in Q3 indicates that we're already at the $1 billion adjusted EBITDA run rate that we set in our November 2022 Investor Day with a superior revenue mix and a laser-like focus by our team on the Modular and Storage operations. And now with our ERP reporting and analytics, all in place and with a full year of tuck-in acquisition activity under our belt, we're in a place now where SG&A from continuing operations, excluding stock comp and other discrete expenses actually declined sequentially from approximately $140 million in Q2, to $135 million in Q3. While higher than we forecasted, these investments are demand-driven, supporting the strongest modular delivery volumes since 2019 and nearly 15,000 new storage units this year that are all being absorbed immediately by our customer base and we're operating nearly 90% utilization in that product class. As I mentioned, net CapEx and variable costs will moderate with the seasonal slowing of modular deliveries, which will result in sequential margin expansion with EBITDA margins up approximately 200 basis points for the year, in achieving a $500 million free cash flow run rate as we enter 2023. When we see the order backlog and the demand outlook as we get into second half of January and first half of February, that's when we'll start allocating refurbishment capital in the modular business for the seasonally stronger Q2 and Q3 period."
}