{
    "symbol": "WSC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 01:57:07",
    "content": " Value-added products penetration is also expanding in North America modular and continues to roll out as planned under our Mobile Mini brand aggregate, representing a $500 million organic revenue opportunity that is entirely within our control. Adjusted EBITDA margins expanded 200 basis points year-over-year and 240 basis points sequentially, and we saw strong margin expansion both at the gross margin and EBITDA margin level across all of our segments as well as at the consolidated net income level, driven by the steady compounding of pricing, value-added products and volumes at rates well in excess of cost inflation. Together, in North America modular and North America storage the natural convergence from average rates to recently delivered rates over our 3-year lease duration represents about a $200 million predictable organic revenue growth opportunity irrespective of market conditions. Modular refurbishment of approximately $50 million in Q2 effectively doubled versus Q2 of 2021, supporting over 1,000 units of organic volume growth year-to-date as well as inventory readiness. And based on the continued growth of operating cash flows and the tapering of capital expenditures in the second half of 2022, which I expect will be more in line with the second half of 2021, we have clear line of sight to achieving $500 million of free cash flow run rate heading into 2023. In the last 12 months, on a leverage-neutral basis, we generated and allocated over $1.1 billion of capital, 31% or $358 million went to organic capital expenditures, 22% or $251 million has gone towards tuck-in acquisitions, and we used $481 million or 42% to repurchase approximately 5.6% of our economic share count. Looking into the second half of the year, as margins expand into Q4 and CapEx tapers, we expect our free cash flow run rate to accelerate to a $500 million run rate as we enter 2023, and then that run rate will grow through the course of 2023. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I think we mentioned in the prepared commentary, all the branches now offer the furniture for the ground level offices, and we are seeing that take off, I would say, in line with our expectations and the $50 million of opportunity we had attributed to furniture and gloves feels very attainable and then probably more exciting from my perspective as we begin to roll out the VAPS offering, if you will, for storage. Your line is open. Your line is open. Your line is open. Your line is open."
}