{
    "symbol": "WSC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 02:30:26",
    "content": " Starting on Page 13, I'll talk through how each of these growth levers contributed to our strong performance in Q1, in which we delivered $509 million in revenue and $192 million of adjusted EBITDA, both up 20% and 17%, respectively, year-over-year. In North America Modular, we achieved average VAPS rate per month of $407, up 21% year-over-year, on all units delivered over the last 12 months. If we simply hold these already achieved penetration levels for three years, while the on-rent fleet rolls from its average 3-year lease durations, we'll realize $160 million of annual top line growth or approximately one third of the $0.5 billion VAPS-related potential. In North America Storage, now 80% of our ground level office fleet can be delivered with our VAPS offering, and penetrating our Mobile Mini ground level office fleet at the same level already achieved on life-size units in the Modular segment would yield another $50 million of incremental VAPS-related top line growth. North America Modular has now sustained double-digit Modular rate growth, inclusive of VAPS for over four years now, such that rates on new Modular deliveries are greater than 30% above the average of all units currently on rent. Given four years of history in North America Modular, where in VAPS penetration has delivered just over half of the sustained double-digit rate growth and lease rate optimization has driven the balance, there's certainly further potential upside in this powerful and proven lever. This portfolio of idiosyncratic growth levers underpinned by ambitious with achievable milestones laid out at our Investor Day in November, notably achieving $1 billion of EBITDA milestone within three years, and along the way achieving $500 million of free cash flow annualized run rate as we exit 2022. Average rental rates in North America Modular have already increased significantly, and we continue to see powerful spot rate increases for unit rental rates exclusive of value-added products, up 20% to 30% year-over-year in both North America Modular and North America Storage. So expansion of our leasing margin will lag due to the duration of our leases and yet overall gross profit margin still expanded by 227 basis points despite increased maintenance and labor costs, as well as elevated activity levels, especially in our Modular segment, where work order completions were up 11% year-over-year in Q1 to support our growing order backlog in Q2. We've executed and integrated 10 acquisitions since September that are not yet fully optimized, and we have resourced numerous functional initiatives across the company in the areas of inventory management, product management, branch network optimization, national accounts and marketing and information technology, all of which will allow us to scale efficiently in 2023 and 2024 based on the obvious growth that we need to support in those years. On the Modular side of our business, we have gone through a pretty thoughtful exercise over the last six months or so to standardize a lot of our delivery and setup activities across the network, so that we can more consistently predict the margin that's going to come out of those services as well as the pricing that we're charging. Now if we execute the plan that we're talking about today, we'd enter 2023 with a much higher revenue run rate than we expected maybe six months ago, that will have higher EBITDA generation this year, higher CapEx generation this year, such that second half free cash flow is not materially changed based on this forecast."
}