{
    "symbol": "NR",
    "quarter": 4,
    "year": 2021,
    "date": "2022-02-18 14:10:29",
    "content": " The mineral grinding business contributed total third party revenues of $36 million in 2021, yielding approximately breakeven operating income and ended the year with $47 million of net capital employed, including roughly $25 million of net working capital. Consolidated revenues increased 18% sequentially to $180 million in the fourth quarter, benefiting from strong growth in both segments. Our industrial solutions segment generated $52 million of revenues in the fourth quarter, reflecting an 18% sequential improvement, benefiting from the anticipated year-end demand for product sales in the utility sector. The Site and Access Solutions business contributed $51 million of segment revenues in the fourth quarter, including $29 million of rental and service revenues and $22 million of product sales. Comparing to the fourth quarter of last year, revenues from the Site and Access Solutions business increased $8 million or 20%, substantially all of which is attributable to higher product sales. Now turning to Fluid Systems, total segment revenues improved $20 million sequentially to $128 million in the fourth quarter, reflecting broad based improvements in our global customer activity. Revenues from U.S. land increased 21% sequentially to $62 million, significantly outpacing the 13% improvement in market rig count, reflecting improved revenue per rig, including a benefit from elevated fluid losses. In Canada, revenues increased 21% sequentially to $70 million in the fourth quarter, meaningfully outpacing the 6% market rig count improvement. Outside of North America revenues improved 21% sequentially to $45 million in the fourth quarter, with our operations in North Africa being the primary driver of the growth. After consideration of both the third and fourth quarter charges highlighted in the press release, the sequential improvement in operating income reflects an incremental margin of roughly 22% on the $20 million revenue increase. During the fourth quarter cash flow, net cash used in operating activities was $17 million, including $35 million of cash usage associated with the increase in receivables, largely reflecting the impact of the revenue growth."
}