{
    "symbol": "NR",
    "quarter": 2,
    "year": 2021,
    "date": "2021-08-07 16:28:07",
    "content": " Consolidated revenues improved 1% sequentially to $142 million, with a 28% increase in international Fluid Systems and a 15% improvement in Industrial Solutions rental and service revenues, offsetting the previously anticipated pullback in Industrial Solutions product sales that we discussed on our prior quarter call. As anticipated, coming off the exceptionally strong first quarter product sales, segment revenues declined 15% sequentially to $45 million in the second quarter, as Site Access product sales pulled back to $10 million for the quarter. Partially offsetting the product sales reduction, rental and service revenues improved 15% sequentially, contributing $33 million of revenue in the second quarter, including a record $25 million contribution from the power transmission and other industrial end markets, reflecting strong performance both in the United States and in the United Kingdom. With the lower revenue, our Industrial Solutions operating margins declined modestly to 22% in the second quarter, generating $15 million of EBITDA. Our international revenues improved 28% sequentially to $35 million in the second quarter, benefiting primarily from improvements in Europe and North Africa. Total revenues for the Industrial Solutions segment declined 15% sequentially to $45 million in the second quarter, which includes a $43 million contribution from the Site and Access Solutions business and $2 million from industrial blending. Rental and service revenues improved 15% on a sequential basis, coming in at $33 million for the second quarter, which reflects our strongest quarter in nearly 2 years. As a result of the $8 million decline in revenues, the Industrial Solutions segment operating income declined by $3 million sequentially to $10 million, contributing $15 million of EBITDA in the second quarter. Comparing to the second quarter of last year, revenues from the Site and Access Solutions business increased $16 million or 59%. Turning to Fluids Systems, total segment revenues improved by 11% sequentially to $97 million in the second quarter. Gulf of Mexico revenues declined $6 million or 44% year-over-year, driven primarily by the changes in customer drilling and completion plans, including a strong contribution from completion fluids in the prior year quarter. International revenues improved $6 million or 22% year-over-year, benefiting from new project start-ups and the recovery of customer activity in several European markets and Algeria, while the Middle East remained roughly $2 million below prior year levels, reflecting the ongoing COVID challenges."
}