{
    "symbol": "NR",
    "quarter": 3,
    "year": 2021,
    "date": "2021-11-03 15:51:04",
    "content": " International revenues improved 6% sequentially to $37 million in the third quarter, with our expansion in Asia Pacific being the primary driver of the improvement while certain areas in the EMEA region continued to be negatively impacted by COVID related restrictions. Benefitting from the revenue improvement as well as our ongoing efforts to reshape the U.S. Fluids business, the Fluids Systems segment made progress towards a return to positive cash flow generation, however, the improvement was offset by $4 million of third quarter charges as highlighted in yesterday's press release. The Site and Access Solutions business contributed $42 million of the segment revenues in the third quarter, including $28 million of rental and service revenues and $14 million of product sales. With the modestly lower revenues, the Industrial Solutions segment operating income declined by $2 million sequentially to $8 million, contributing $13 million of EBITDA in the third quarter. Comparing to the third quarter of last year, revenues from the Site and Access Solutions business increased $13 million or 46%. Now turning to Fluids Systems, total segment revenues improved by 11% sequentially to $108 million in the third quarter, primarily driven by improvements in Canada and other international markets. As Paul touched on, with this sequential revenue growth in the third quarter, we saw continued progress in returning the Fluids Systems segment to profitability, although the $4 million of charges related to Hurricane Ida and our ongoing cost actions largely offset the improvements keeping the Fluids Systems reported operating loss flat sequentially at $7 million for the third quarter. And although the change in Shell activity in the Gulf of Mexico provides an unfavorable headwind, we expect Fluids segment operating income will be roughly breakeven for the fourth quarter prior to the cost of any further restructuring, including a solid earnings contribution from our international operations along with improvements in the U.S. Also with the December 1 maturity of our remaining $39 million of convertible bonds, we expect interest expense to step down modestly in Q4, then level off at roughly $1 million of quarterly interest expense in 2022."
}