{
    "symbol": "NR",
    "quarter": 1,
    "year": 2021,
    "date": "2021-05-08 20:13:06",
    "content": "  Operator: Greetings, and welcome to the Newpark Resources’ First Quarter Earnings Conference Call. Participating from the Company in today’s call are Paul Howes, Newpark’s President and Chief Executive Officer; Gregg Piontek, Chief Financial Officer; David Paterson, President of Fluids business; and Matthew Lanigan, President of the Industrial Solutions business. With underlying fundamentals improving in both segments, I’m pleased with our overall performance in the first quarter, highlighted by the solid performance in the Industrial Solutions segment, growth in Stimulation Chemicals and the strong cash generation in debt reduction. Consolidated revenues improved 9% sequentially to $141 million, while operating income return to positive territory and EBITDA increased to $10.9 million for the first quarter, which included $800,000 loss on the repurchase of convertible bonds. In our Industrial Solutions segment, revenues improved 6% sequentially to $53 million in the first quarter, benefiting from the ongoing recovery in customer activity, most notably from the utility sector. Total revenues from the Industrial Solutions segment increased 6% sequentially to $53 million in the first quarter, primarily attributable to a 14% improvement from the Site and Access Solutions business, which contributed first quarter revenues of $49 million. Rental and service revenues were relatively flat on a sequential basis, coming in at $29 million for the first quarter, with the benefit from the broader recovery in the utility sector and the improving E&P market more than offsetting the elevated activity from Hurricane driven repairs that benefited the previous quarter. Most notably, the quarter’s performance further demonstrates the value of our industrial solutions diversification, a strategic effort that has been underway for several years. As the energy transition gains momentum, it’s clear that the utility infrastructure across the globe will require significant expansion and upgrade. In Fluids Systems, we are extremely proud of the progress we’ve made over the past year to reshape the business, reducing our cost structure, harvesting cash in the balance sheet and reducing our net capital employed, while at the same time improving our market position and enhancing customer satisfaction. Over the past decade, we’ve made meaningful growth investments in both our infrastructure and capabilities positioning Newpark as a market leader in the fluid space. We will continue to optimize our working capital investments, rationalize our roofline, including the potential sale of infrastructure and assets that may no longer be needed as we remain firmly committed to delivering an asset light and agile business model, that can generate a sufficient return on invested capital. In terms of cash flow, as we said in the past, we remain committed to a business model that maintains positive free cash flow through all phases of the industry cycle, something we’ve consistently demonstrated over the past four years. And finally, I’d like to note that we remain encouraged by the continuing market focus on environmental sustainability, which we see as a meaningful tailwind to our environmentally-focused product offerings across each of our businesses. As we’ve discussed for many years, providing our customers with differentiated technology that works in harmony with the environment has long been part of Newpark’s DNA. To learn more about the benefits of our environmentally-focused product offerings, we encourage you to read our 2020 sales report, which can be found on our company’s website. With that I’d like to close the call, as I always do, by thanking our shareholders for investing in us and thanking our employees for their hard work and dedication to Newpark as well as a continued focus on safety. Let’s see, I think on the international Fluids side, Paul, I think I heard you referred to the potential to get back to pre-COVID revenue levels by end of year. International has been subdued the last two quarters, we’re starting to see some real -- I’d say increases in activity across the board. We look at the Middle East as an area that we expect a lot of growth as we look at the current administration’s focus on slowing down the drilling activity here in the U.S. and so the win in Bahrain, I think it’s a very strong statement in terms of our capabilities in that part of the world. Look, I think, based on what we’re seeing right now with closing activity domestically and large infrastructure projects internationally, particularly in the U.K. where there are substantial long-term investments being made by the government that is, there is nothing really on the right now that would suggest that things are going to slow down materially, so we’re quite encouraged. Don’t want to get wrong footed here though, I’d imagine maybe there is some room for you guys to give back a little in working capital here in the near term. Any considerations, I’ll keep this question maybe specific to the near quarter here in Q2, that we should think about regarding working cap. Could you elaborate on issues that you may be facing there, whether it’s resiner or bariter , LIBOR, which you also mentioned, talk a little bit about that. Marshall, it’s Matthew, I’ll take it from the I guess the matting side first. We’re also seeing cost inflation in raw materials for our products, mainly on the oil derivatives that we are seeing it on our polymers as well. Marshall, it’s what we’re seeing is I think pretty consistent with what’s very broadly being seen by everyone in the market. I assume again since it’s happened, not just in our industry, but every industry is fairly good to pass on those price increases. Gulf of Mexico, oils in the mid ‘60s, that’s obviously a big deal, gas looks pretty good. Intuitively that you would think that’s going to lead to pickup in the Gulf, but offsetting that you kind of we have an administration that’s going to anti-oil and gas out there. So I think that’s a strong commitment to the Gulf of Mexico, and we’re starting to see some of the independents getting back to activity. I think it’s early in the year, Marshall, on how we see that, but I think the Gulf is going to remain steady through 2021 and I know there are some other projects queuing up down the road. There are no further questions in the queue, I’d like to hand the call back to management for closing remarks."
}