{
    "symbol": "LSTR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 11:44:05",
    "content": " Truck revenue was 1% over the 2021 third quarter, mostly due to a 1% increase in truckload volume. Revenue hauled via other modes of transportation increased 49% over the 2021 third quarter, mostly attributed to higher ocean and air revenue per load. Overall truck revenue per load in the 2022 third quarter was essentially equal to truck revenue per load in the 2021 third quarter with revenue per load up 1% on truckloads hauled via unsided platform equipment, down 2% on truckloads hauled via van equipment and down 1% on truckloads hauled by other truck transportation services. Accordingly, given the increase in diesel fuel cost in the 2022 third quarter compared to the 2021 third quarter, I believe this metric provides a better gauge of current market conditions as compared to Landstar's overall revenue per truckload, which is influenced by many factors, including length of all delivery time, equipment requirements and fuel costs. While we have seen revenue per mile on van equipment hauled via BCOs decreased sequentially since it peaked in February 2022, Landstar's year-over-year change in rates has not been near the magnitude reported in various industry reports. During the 2022 third quarter, revenue per mile on van equipment hauled via BCO capacity in July was 2% over July 2021, and then August was $0.01 below August 2021. Even though on a sequential basis, revenue per mile on van equipment hauled by BCOs as of the end of the 2022 third quarter was 17% below the all-time high reach in February. Overall, revenue per mile on loads hauled by BCOs via unsided equipment in July, August and September increased approximately 9%, 6% and 2% over July, August and September 2021, respectively. And unlike revenue per mile on van equipment, revenue per mile on unsided equipment hauled via BCOs was at a record high in the 2022 third quarter, 5% higher than the 2021 third quarter. Loads hauled via BCOs in the 2022 third quarter were approximately 5% below the 2021 third quarter on lower utilization, partly offset by slightly higher average truck count. The decrease in variable contribution margin compared to the 2021 third quarter was primarily attributable to mix, as an increased percentage of revenue was generated in the 2022 period by one truck brokerage carriers, which typically has a higher rate of purchased transportation than revenue generated by BCO independent contractors and two, multi-mode capacity providers, which typically has a higher rate of purchased transportation than revenue generated by third-party truck capacity providers. The unfavorable mix impact was partially offset by an increased variable contribution margin on revenue generated by truck brokerage carriers, as the rate paid to truck brokerage carriers in the 2022 third quarter was 224 basis points lower than the rate paid in 2021 third quarter. During the 2022 and 2021 third quarters, insurance and claims costs included $2.1 million and $3.5 million, respectively, of net unfavorable adjustments to prior year claim estimates. As it relate to our 2022 fourth quarter expectations, based on the trends we have experienced in the first few weeks of fiscal October, and our anticipation of a muted holiday shipping season this quarter, I've assumed that the sequential decrease in truck revenue per load and truckload volume we have experienced thus far in October will continue throughout the rest of the 2022 fourth quarter. Even given the extra week in the 2022 fourth quarter, we expect the recent softening trend in truckload volume to continue and expect fourth quarter truckload volume  to be below the 2021 fourth quarter in a range from 2% to 4%. In the 5 years preceding the pandemic, truck revenue per load on average was approximately 1% higher in the fourth quarter compared to the third quarter. However, in 2017, truck revenue per load in the fourth quarter exceeded the third quarter by over 8%. Yet in 2018, truck revenue per load in the fourth quarter was 3% below the 2018 third quarter. Based on recent trends, I expect truck revenue per load in 2022 fourth quarter look more like the 2018 fourth quarter, with truck revenue per load expected to be 2% to 4% below the 2022 third quarter. Given that assumption, truck revenue per load in the 2022 fourth quarter would be 5% to 7% below the 2021 fourth quarter. Based on these expectations of truck revenue per load and the number of loads hauled via truck, I currently anticipate 2022 fourth quarter revenue to be in the range of $1.775 billion to $1.825 billion. However, as an example of the model's resiliency if we were to experience a 20% decrease in revenue in 2023 from our 2022 full year estimate, and assuming normalized insurance, we believe Landstar would still generate an operating margin of 50% or more. We definitely feel that we've seen the sequential load volume trends decrease July - from July to - from June to July to August to September and anticipate kind of the peak season - kind of be stable throughout the rest of the thing, but the comp going into the first quarter and the demand scenario we're looking at is going to be very challenging first half next year. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}