{
    "symbol": "LSTR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 13:54:06",
    "content": " First quarter of revenue, gross profit, variable contribution, operating income and diluted earnings per share were each all-time quarterly records, ahead of even our record 2021 fourth quarter. During the 2022 first quarter, we initially provided first quarter revenue and earnings per share guidance as part of our 2021 year-end earnings release on January 26. Overall, revenue was an all-time quarterly record of $1.970 billion in the 2022 first quarter, approximately 13% above the high end of our initial guidance and in line with our April 5 updated guidance. Those positive sequential trends put February revenue per truckload approximately 3% above December, far above normal seasonal trends where February rates are always below the prior year's December. Given the pricing strength Landstar experienced during the first two months of 2022, it wasn't surprising that truck revenue per load in March was equal to that of February, even after considering the recent spike in fuel costs. Additionally, as expected, the year-over-year comparison in truck revenue per load in March was much more difficult than during the first eight weeks of 2022 as rates in March of 2021 increased 11% over February 2021. Overall truck revenue per load in January, February and March 2022 increased 25%, 29% and 17% over January, February and March of 2021. As to rates by equipment type, truck revenue per load on loads hauled via van and unsided/platform equipment in the 2022 first quarter increased 27% and 19%, respectively, over the 2021 first quarter. After the number of loads hauled via truck, our initial guidance on January 26 called for truckload volume to increase over the 2021 first quarter in a 12 to 14 percentage range. In total, first quarter truckload volume increased 20% over the 2021 first quarter, in line with our April 5 update. The number of loads hauled via unsided/platform equipment grew 15% over the 2021 first quarter, mostly due to improving demand for our services within the U.S. manufacturing sector over the 2021 first quarter. In the 2022 first quarter, gross profit was $214.6 million, an increase of roughly 46% compared to $147.1 million in the 2021 first quarter. In the 2022 first quarter, variable contribution increased roughly 43% to $270.5 million compared to $189.2 million in the 2021 first quarter driven by strong revenue growth. The decrease in variable contribution margin compared to the 2021 first quarter was attributable to the mix between our BCO independent contractor capacity, which has a higher variable contribution margin in loads hauled via truck brokerage carriers. Revenue hauled via truck brokerage carriers increased to 52% of total revenue this past quarter, up from 49% of total revenue in the same period last year. The increase in insurance and claims as compared to 2021 was primarily due to a $4.3 million of increased net unfavorable development of prior claims in the 2022 first quarter, an increase in insurance premiums for commercial trucking liability coverage, and increased severity of current year trucking claims in the 2022 period. With respect to loads hauled via BCOs, which represented 42% of truck revenue into 2020 first quarter, an increase in the cost of diesel fuel has minimal impact on revenue per load as fuel surcharges billed to customers are paid 100% to the BCO hauling those loads and are not included in the company's revenue. Accordingly, an increase in fuel cost of this magnitude would typically be expected to increase truck revenue per load on loads hauled by truck brokerage carriers, which represent a 58% of truck revenue in the 2022 first quarter. Assuming we maintain truck revenue per load throughout the remainder of the second quarter consistent with levels we have seen in March and early April, and fuel cost also remained steady throughout the rest of the quarter, truck revenue per load would be above the 2021 first quarter in a mid-teen percentage range. From 2016 to 2021, without including 2020, which was impacted by the onset of the pandemic, truckload count has increased sequentially from the first quarter to the second quarter in a range of 4% to 13%. Considering the record number of truck loadings in the 2022 first quarter, I expect that 2022 second quarter truckload count to trend toward the lower end of the range of recent historical first and second quarter sequential percentage increases, and therefore expect truckload cap to increase over the 2021 second quarter in a low double digit percentage range. Based on the expectations of truck revenue per load and the number of loads hauled via truck, I currently anticipate 2022 second quarter revenue be in the range of $2 billion to $2.5 billion. Based on that range of revenue and assuming insurance and claim costs are approximately 4.2% of BCO revenue, I anticipate 2022 second quarter diluted earnings per share to be in the range of $3.22 to $3.32. 2022 first quarter revenue was the highest quarterly revenue in the company's history, and increased 53% compared to the 2021 first quarter. Perhaps even more impressive than the top line growth was the fact that the 2022 first quarter gross profit, variable contribution, operating income, net income and diluted earnings per share were the highest ever achieved by Landstar in any quarter in the company's history. Revenue per mile on loads hauled via BCOs using van equipment increased 5% from December to January, 3% from January to February, and decreased 0.1% in March compared to February."
}