{
    "symbol": "LSTR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 12:35:19",
    "content": " During the 2022 second quarter, revenue per mile on van equipment hauled by BCO capacity in April, May and June was 23%, 13% and 7% over April, May and June of 2021 respectively. Overall, revenue per mile on loads hauled by BCOs via unsided equipment in April, May and June increased 22%, 14% and 11% over April, May and June 2021, respectively. And unlike revenue per mile on van equipment, revenue per mile on unsided equipment hauled BCOs sequentially increased from the end of the first quarter to the end of the second quarter and achieved an all-time Landstar high in June of 2022. Total second quarter truckload volume increased what would be considered a strong 10% over the 2021 second quarter, had it not been for the growth rates Landstar experienced over the past six quarters. During the 2022 second quarter the number of loads hauled via van equipment in April, May and June increased 11%, 12% and 4% compared to April, May and June of 2021. Month over prior month growth in the number of loans held via unsided/platform equipment was more consistent in the 2022 second quarter, with April, May and June increasing 11%, 9% and 10% compared to April, May and June 2021. In the 2022 second quarter, variable contribution increased 21% to $267.5 million compared to $220.8 million in 2021 second quarter driven by strong revenue growth. The decrease in variable contribution margin compared to the 2021 second quarter was primarily attributable to mix, as an increased percentage of revenue was generated in the 2022 period by one, truck brokerage carriers, which typically has a higher rate of purchase transportation than revenue generated by BCO independent contractors; and two, multimode capacity providers which typically has a higher rate of purchase transportation and revenue generated by third-party truck capacity providers. While we have seen revenue per mile on van equipment hauled via BCOs decrease since it's peaked in February 2022, Landstar's year-over-year change in rates hasn't been near the magnitude reported in various industry reports. Your line is now open. Thank you so much. Your line is now open. Thank you so much. Your line is now open. Your line is now open. Thank you so much. Your line is now open. Thank you so much. Your line is now open. Thank you so much. Your line is now open. Thank you so much. Your line is now open. Thank you so much. Thank you so much."
}