{
    "symbol": "CBAY",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 21:40:05",
    "content": " Our Phase 3 development program for seladelpar in PBC includes ongoing NDA-enabling PK studies; ASSURE, a long-term safety study to complete a comprehensive patient safety database; and RESPONSE, our second Phase 3 efficacy and safety study to support marketing approval. Central to our clinical development program for seladelpar in PBC is RESPONSE, our second global Phase 3 registration study targeted to enroll 180 PBC patients who have had an inadequate response to or are intolerant to first-line treatment ursodeoxycholic acid. Please proceed with your question. But again, I think I would take the comments just given where we are in the study and a view towards what’s necessary to complete enrollment really as a guide towards the confidence that we have in executing and completing enrollment in the third quarter, much greater visibility today than we had even several months ago. Please proceed with your question. I think as we’ve continued to progress with our own development, we’re certainly anchored by our ability to carry forward and complete the development program for seladelpar, not just in the U.S. but for registration, as I mentioned, even in Europe. I think some of what we’ve seen with other transactions, you mentioned the sale of the rights obeticholic acid outside the U.S. for a little over $400 million to Advent Pharma, I think really underscores what we believe to be an opportunity again to expand addressable patient population here, specifically in that transaction outside the U.S. And so as we’ve progressed, it’s always been an important priority for us to evaluate a host of different strategic alternatives. Please proceed with your question. And so we’re unwavering in our level of focus and completing enrollment in RESPONSE, executing on the global clinical program that’s inclusive of ASSURE, a study that we think adds to our Phase 3 development program and our prior history of development to really position seladelpar as really being the most extensive program in PBC in development to date. And ultimately, the final dataset, should it really support the profile we’ve seen with the drug thus far, as I’ve mentioned, in north of 300 PBC patients that we’ve dosed with seladelpar to date, many of which have actually gone even out to 2 years of treatment. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. We have also had the benefit of effectively targeting a number of patients in powering RESPONSE not just for the primary and key secondary end point around biochemical response and normalization of biochemical response, but also around treating pruritus that’s something that we think we are advantaged around given our prior data sets."
}