{
    "symbol": "CBAY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 04:47:05",
    "content": " In the third quarter, we reported completing enrollment in RESPONSE, our global Phase 3 registration study, evaluating seladelpar in PBC patients who have had an inadequate response to or intolerant to first-line treatment with ursodeoxycholic acid. Last week, we had the opportunity to share additional analyses and results from our prior clinical studies of seladelpar in PBC at the American Association for the Study of Liver Diseases annual Liver Meeting in Washington, D.C. Today, Iâ\u0080\u0099ll provide an update on the progress we have made as well as our plans going forward in our clinical development program for seladelpar and PBC. At the PBC Analyst Day, I also shared a summary of the patient segments where seladelpar could experience â\u0080\u0093 to experience rapid adoption, which includes 14,000 to 16,000 patients who are either incomplete responders to UDCA or have discontinued second-line treatment of obeticholic acid. In terms of the last part of your question around post-marketing, I think all here know that in the setting of PBC, we expect that the accelerated approval pathway is, in fact, in the best interest of patients and certainly will remain available to seladelpar as it has been for other agents in PBC. One of the things I think that gives us some advantage here is, as Chuck had mentioned, the extent of the overall patient population and experience both efficacy and safety database that we continue to collect in ASSURE, which will grow as patients from RESPONSE continue to roll into that study. We certainly, as weâ\u0080\u0099ve mentioned, believe that, that we will have, in fact, a significant number of patients for overall safety and even longer-term safety out to 1 in 2 years and beyond from ASSURE as well as obviously leading in from our prior clinical experience, perhaps, in fact, the most robust safety data set at the time of regulatory filing."
}