{
    "symbol": "CBAY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 20:43:08",
    "content": " Our prepared remarks today will be focused on key business updates centered around substantial advancements in the company's clinical development program of seladelpar for patients with PBC, organizational growth and focus necessary to bring seladelpar to patients, and financial position to support value creation for all of our stakeholders. First, our business development activities have been focused on evaluating potential partners who can help us bring seladelpar to patients around the world, particularly in geographies outside the U.S. and Europe where additional development beyond our ongoing clinical studies will be required. Our global market evaluations included both primary and secondary research across all key stakeholders, including PBC patients, while also examining healthcare providers perceptions of current PBC treatment versus seladelpar's target product profile. In terms of our discussions, yes, I think as we've had conversations with many of the healthcare providers and particularly the thought leaders in the field globally, there's no question that as potential agents like seladelpar where in our clinical studies to date, we've seen anywhere from 30% to 40% of patients enrolled in our prior studies between 1 years and 2 years of treatment actually experienced normalization of alkaline phosphatase. And in that path forward, we certainly believe we have not just the internal resources, the relationships with key healthcare providers, but really the balance sheet and investors to allow us to accomplish this objective as we think being able to bring seladelpar to as many patients that may benefit as something we can execute upon ourselves and firmly believe this is the greatest path to creating significant value. Please proceed with your question. And as we've done really since 2015 when we first started developing seladelpar for patients with PBC, anything that we learned through this additional work, we would look to share at medical meetings and eventually publish as we have done historically. Please proceed with your question. Please proceed with your question. Please proceed with your question. So, with that important caveat, what we've seen thus far in what we believe are similar patient populations is the ability for seladelpar to bring a greater proportion of patients to goal as it pertains to alkaline phosphatase below 1.67x the upper limit of normal and normal bilirubin whether we're looking at 3 months or 12 months or beyond. And I think more importantly, certainly seladelpar's product profile, combining that with in what we'll see as we head into 2024, 2025 on both the commercial and the Medicare eligible side really provides a great opportunity to have less headwinds for patients to gain access to the medicine. Please proceed with your question. Please proceed with your question. Based on what we see with seladelpar in terms of its actions on cholestasis inflammation, the known effects we saw on reducing fibrosis and NASH patients, a mechanism in addition to these effects on pruritus that we've just talked about a mechanism for which we think there could very well be significant opportunity in PSC. Please proceed with your question. Please proceed with your question."
}