{
    "symbol": "NVCN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 20:03:03",
    "content": " The operating losses and comprehensive losses for the three months ended September 30, 2022, was $6.7 million and $8.2 million, respectively, or $3 basic and diluted loss per share, as compared with $6.7 million operating losses and $6.9 million comprehensive losses or $2.79 basic and diluted loss per share for the same period in 2021. The $1.3 million increase in the comprehensive loss incurred for the three months ended September 30, 2022, compared to the same period in 2021 can be substantially explained by a $402,000 decrease in other income, primarily relating to the Canadian emergency wage subsidy received in September 2021, and not in the current period. Revenues increased by 31% to $923,000 for the three months ended September 30, 2022, compared to revenues of $703,000 for the same period in 2021. Total expenses for the three months ended September 30, 2022, were $7.4 million compared to $7.3 million for the same period in 2021, representing an increase of $181,000, or 2%. The increase in total expenses for the three months ended September 30, 2022, compared to the prior period can be substantially explained by an $844,000 increase in employee expenses, primarily related to the accrual of bonuses that were accrued in the prior period and a $624,000 increase in other operating expenses related to the COSIRA-II study, offset by an $862,000 decrease in non-cash share-based payments. Selling expenses for the three months ended September 30, 2022, were $1.1 million compared to $786,000 for the same period in 2021, representing an increase of $276,000 or 35%. The increase in selling expenses for the three months ended September 30, 2022, compared to 2021, can be substantially explained by a $148,000 increase in employee expenses due to an increase in the headcount in Germany, France and the UK at a $221,000 increase and other expenses incurred for the commercialization activities related to the Reducer as the company increased its selling activities and expanded its markets, offset by a $94,000 decrease in non-cash share-based payments as the expected life of the share appreciation plan was adjusted from one year to four years. General and administrative expenses for the three months ended September 30, 2022, were $2.3 million compared to $3 million for the same period in 2021, representing a decrease of $662,000, or 22%. Decrease in general and administrative expenses for the three months ended September 30, 2022, compared to 2021 to be substantially explained by a $677,000 decrease in non-cash share-based payments as the expected life of the share appreciation plan was adjusted from one year to four years. Product development and clinical trial expenses for the three months ended September 30, 2022, of $4.1 million compared to $3.5 million for the same period in 2021, representing an increase of $567,000 or 16%. The increase in product development and clinical trial expenses for the three months ended September 30, 2022, can be explained by $444,000 increase in employee expenses due to the accrual of bonuses that were not accrued in the prior period and a $207,000 increase in other product development and clinical trial expenses, offset by a $91,000 decrease in non-cash share-based payments as the expected life of the share appreciation plan was adjusted."
}