{
    "symbol": "SPOK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 11:04:01",
    "content": " You will also hear from Mike with respect to our year-to-date pro forma results, but the high level answer is, we would have generated well over $10 million in adjusted EBITDA, which is defined in the earnings release tables. For the second quarter of 2022, total GAAP revenue was $33.7 million, compared to revenue of $35.7 million in 2021. Revenue for the quarter consisted of wireless revenue of $18.7 million, which was down $5.8 million -- 5.8% from $19.9 million and software revenue of $15 million, down 5.4% from $15.9 million, largely in line with our expectations. These continued strong trends in our wireless business are being driven by the combination of solid gross additions from our sales organization, continued minimization of churn with existing customers as well as stable unit pricing or average revenue per unit, or ARPU, was $7.23 for the quarter versus $7.25 in the year ago period when adjusted for approximately $0.07 on of decline attributable to decreases in universal service fund revenue. Lastly, license and hardware revenue was $2.5 million compared with $1.4 million in the same period of the prior year or 79% higher, as we saw higher bookings in the second quarter and a solid mix of license and hardware in those bookings. Wireless revenue was $37.5 million compared to $40 million, reflecting net paging revenue churn in line with the trends seen in the second quarter, and year-to-date software revenue of $30 million compared to $31.8 million in the prior period. Second quarter adjusted operating expenses, which excludes depreciation, amortization and accretion of $0.9 million, and severance and restructuring costs of $0.5 million, totaled $30 million in the second quarter compared to $37.4 million in 2021. In the second quarter, adjusted EBITDA was a positive $3.7 million compared with a negative $1.5 million in the same quarter of 2021 and reflects the progress made to date with our strategic pivot. We expect adjusted operating expenses for the full year of 2022 to be in the range of $123.3 million to $126.1 million, and CapEx will be in the range of $3.2 million to $3.9 million, with the majority of CapEx related to our wireless business."
}