{
    "symbol": "SPOK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 23:14:02",
    "content": " Over the past three quarters, Spok has generated $16.9 million of pro forma free cash flow, and has returned $18.8 million in cumulative capital to shareholders since the implementation of the strategic business plan. Now, turning to our third quarter highlights, since the implementation of our strategic business plan, eight months ago, we have been operating a cash flow business model featuring our wireless service line in our Care Connect suite software solutions with the goal of returning capital to shareholders. Now, I want to be clear that while we're pleased with the, approximately, $16.9 million in pro forma adjusted EBITDA for the first three quarters of 2022, we continue to expect to cover approximately 80% of our $1.25 annual divided this year, which equates to approximately $20 million per year from adjusted EBITDA. Revenue for the quarter consisted of wireless revenue of $19.1 million, which was down $500,000 or 3% from $19.6 million, and software revenue of $14.7 million down 9.4% from $16.2 million largely in line with our expectations. Turning to the third quarter software revenue, specifically maintenance revenue which is the largest component of our software revenue was $9.2 million versus $9.6 million in the same period of the prior year, or 4.8% lower. Third quarter adjusted operating expenses, which excludes depreciation, amortization, and accretion of $800,000, and severance and restructuring costs of $1.5 million totaled $27.9 million in the third quarter, compared to $39.4 million in 2021. Given where we stand, with $16.9 million in pro forma adjusted EBITDA for the year-to-date period, I want to underscore that fact that we still expect to generate approximately 80% of our full-year dividend or approximately $20 million in adjusted EBITDA for the full-year, and this is reiterated in our updated guidance that I will walk through next. We expect adjusted operating expenses for the full-year of 2022 to be in the range of $123 million to $125 million, and CapEx will be in the range of $3.2 million to $3.9 million, with the majority of CapEx related to our wireless business."
}