{
    "symbol": "SLG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 17:34:06",
    "content": " Your line is open. Just to put that in perspective on the $1.250 billion that we did and was included in the press release, that was done more than 100 basis points tighter than where you would do those today on $1.250 billion, you can do the simple math, 100 basis points of $1.250 billion over the course of several years, that's a lot of money, well worth a couple of basis points. Your line is open. But I think the good news in that pipeline is we're seeing a lot more activity from the small to medium-sized tenants, which is â\u0080\u0093 it change from where the market was for the past six or nine months because a lot of the leasing activity, although the year is doing, broadly speaking, the market is doing well compared to the prior two years, velocity is still down compared to sort of the 10-year average. Your line is open. Your line is open. In terms of the maturities, theyâ\u0080\u0099ll â\u0080\u0093 time will tell what the refinancing markets look like, what the property markets look like sitting here today, we canâ\u0080\u0099t predict sort of whatâ\u0080\u0099s going to happen in the future at existing loan maturities, but we were happy with the outcomes, obviously, on 245 Park and 5 Times Square. Your line is open. And like I said, make a very large dollar amount, but a small relative per square foot improvement amount for improvements, beautification, efficiencies, new lobby, plaza, amenities and still have a basis very low by Park Avenue standards, and I think have one of the best buildings with one of the best views sitting right on top of access to Grand Central Station. Your line is open. Your line is open. I think stabilized cap rates was â\u0080\u0093 cap rates for assets like 245 has improved with us at the helm in this market across from JPMorganâ\u0080\u0099s $5 billion to $6 billion investment, few blocks up the road from One Vanderbilt down the street in 425 Park carries a sub five cap rate. Your line is open. Your line is open. Your line is open. Your line is open."
}