{
    "symbol": "AYX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 18:29:02",
    "content": "  Operator: Good afternoon, and welcome to the Alteryx Third Quarter 2022 Earnings Conference Call. I'm Ryan Goodman, Alteryx's Head of Investor Relations. Additionally, Paula Hansen, our President and Chief Revenue Officer; and Suresh Vital, our Chief Product Officer, will be joining us for the question-and-answer session after prepared remarks. During this call, we will make forward-looking statements related to our business, including statements about our financial guidance for the fourth quarter and full year 2022. For a discussion of additional forward-looking statements made during this call and the material risks and other important factors that could affect our actual results, please refer to our SEC filings available on the SEC's website and Investor Relations website as well as the risks and other important factors discussed in today's earnings release. Additionally, non-GAAP financial metrics will be discussed on today's call. Our Q3 revenue of $216 million, up 75% year-over-year, came in above our guided range. Our annual recurring revenue, or ARR, came in at $758 million, up 31% year-over-year. Like many global businesses, we saw a meaningful currency headwind in Q3. Normalizing for this $12 million impact, ARR would have been handily above our guided range and up 33% year-over-year. Sales productivity continued to improve year-over-year, renewal rates held near multiyear highs, and our net expansion rate improved for the second straight quarter to 121%. Our value-based go-to-market motion continues to resonate in this market environment, and our results demonstrate the strong execution across a meaningfully up-leveled sales force. While we are mindful of the macroeconomic dynamics and challenges facing many companies, we are fortunate to see data analytics continue to be a top budget priority. Every business and government needs to run a tighter ship, predict how inflation will affect their environments and make better data-driven decisions faster. And it's not just about buying additional tools, it's about empowering knowledge workers with data analytic capabilities. The study found that enterprises have deployed solutions in less than half of the departments that actually need them, and less than half of the nearly all respondents knowledge workers are actively using any analytics software. We've updated our partner program and expanded our partner ecosystem, and we've invested in our customer success organization to help customers achieve desired business outcomes. We are fully aware of the economic environment out there, and we are effectively executing through an elevated level of deal scrutiny, as customers demonstrate greater spending discipline. We hosted our Inspire EMEA user conference in Amsterdam last month with over 1,300 attendees from nearly 30 countries. Our Global 2,000 penetration increased to 46%, up 7 points from this time last year, as top brands across the globe are aligning with Alteryx on their digital transformation journeys. We won two $1 million-plus deals that deeply incorporate Alteryx Analytics Cloud, one of which leveraged our new cloud ELA bundle. Cloud momentum is picking up, with multiple wins for use cases across the Alteryx Analytics Cloud platform. As we gain traction with larger enterprise customers, the Alteryx Analytics Cloud platform is unlocking incremental opportunities for us with more personas and new use cases. We won two seven-figure deals during the quarter with a significant cloud element, one of which was with a Fortune 100 auto manufacturer. This multiyear Alteryx customer not only meaningfully expanded its designer and server license count, but also signed on for several thousand designer cloud licenses to enable cloud-native access to data in Google BigQuery. In addition, by leveraging a cloud ELA, this customer can engage with machine learning and Auto Insights as they move forward with cloud transformation. In Q3, they significantly expanded their multi-thousand user license agreement with more designer seats as well as cloud. Genomics England, a UK-based health care organization that was already using Trifacta, adopted a cloud ELA to expand usage of designer cloud and explore potential use cases with machine learning and Auto Insights. The early momentum is great to see and it's a reflection of the platform innovation, market demand, sales execution, and value that customers find in our solutions. On that note, with Alteryx machine learning now available on the Alteryx Analytics Cloud platform, we are accelerating our multi-tenant, multi-cloud architecture. As I mentioned earlier, following our Q2 launch of Designer FIPS, we introduced Server-FIPS in Q3. To that end, we secured approximately 50 $1 million-plus ACV wins over the last 12 months, bringing us now to over 100 $1 million-plus customers. Our customer success initiatives, such as delivery of hundreds of use cases and solution blueprints, are driving scalable and repeatable outcomes, in which customers can deliver higher ROI. And our ELA construct is garnering favorable customer response, as evidenced by roughly doubling our ELA business year-over-year in Q3. Additionally, we saw customers with burst capacity renew and upsell to a higher ELA tier. Our customer success team engaged with the regular cadence of enablement programs, exploring incremental opportunities to deploy data analytics across the enterprise. After fully exhausting its first capacity earlier this year, this customer signed on for a new ELA in Q3 that was more than double the original capacity, increasing the total ACV to well over $1 million. Our customer success team has done a fantastic job in creating value for our customers and, of course, earning upsell opportunities for Alteryx. In addition to one of our largest new logo wins in the history of the company, we're establishing many new customer relationships with companies as they continue on their digital transformation journey. For example, Okta, a leading independent identity provider adopted, Alteryx Designer and Server to automate data analytics in both the sales operations and finance organizations. This has been a huge focus for Alteryx over the past year, as we see partners as a means to both efficiently scale our go-to-market reach, as well as enhance our customer success efforts. Since updating the partner program earlier this year, we are seeing positive trends, with partners influencing over half of the new ACV wins in Q3. This allowed us to identify a breadth of incremental use cases in finance and tax, ultimately resulting in the customer increasing its license count by approximately 300%. Excluding a $12 million currency headwind versus what we assumed in our guidance, ARR would have been 33% year-over-year, two points of growth higher and above the high end of our guidance range. Because we adjust our entire ARR using end-of-quarter rates with approximately 20% of our ARR denominated in foreign currency, FX can have a meaningful impact on ARR in times of higher volatility, like we saw towards the end of September. Revenue of $216 million grew 75% year-over-year, exceeding the high end of our guided range, benefiting from better-than-expected bookings and robust renewal rates. With the revenue upside in our disciplined spending mindset, the business delivered a non-GAAP operating profit of $5 million, which is $10 million better than the high end of our guided range. Over the past several quarters, we've communicated our intent to increase traction with larger organizations given a higher customer lifetime value. This quarter, I hosted our first Alteryx CFO event in New York for dozens of CFOs and senior financial leaders from Global 2000 companies. As part of our strategic enterprise go-to-market motion, we've invested in our sales force, our partner ecosystem, our customer success team, and our product road map. Our average ARR per customer continues to see strong sequential and year-over-year growth coming in at 91,000 in Q3. And on the ELA front, we continue to see strong momentum, closing approximately as many ELA deals in Q3 as the entire first half of this year. First, as our larger customer cohort has our highest retention rate, we are seeing renewal rates near multi-year highs and up significantly year-over-year. Moreover, our average ARR per customer is more than 4 times the average size of customers that churned this quarter. Second, as we are identifying and winning a breadth of opportunities within larger customers, we are seeing sequential improvements in our net expansion rate of 121% and a Global 2000 net expansion rate of 129%. And third, with an expanding portfolio of cloud solutions, we're better equipped than ever to meet the growing demand for data analytics throughout the organization. In fact, more than half of our early cloud ACV bookings was with our $1 million-plus customers. In Q3, we captured over $10 million of upside to our non-GAAP operating profit guidance, with approximately 50% of the revenue upside following through to the operating level. Sales force productivity was a key driver to profitability, with sales and marketing as a percentage of revenue improving by 10 points versus Q2. For example, our high level of employee retention enabled us to temper our hiring in Q3. And with growing ranks of fully ramped reps and improved productivity, we expect to further moderate hiring in coming quarters. In summary, we are pleased with the Q3 results, in which we demonstrated durable, profitable growth driven by strong execution and saw continued evidence that data and analytics remains a top spend priority for business leaders across the globe. First, we expect to have a meaningfully larger renewal base relative to 2022, which consists of both 2020 three-year renewals and the increasing cohort of one-year renewals. Second, we have a growing book of ELAs with burst capacity, creating upsell opportunities for large enterprise customers with high visibility in coming quarters. And last but not least, we have our Alteryx Analytics Cloud, which we expect will continue to build momentum and increasingly become more meaningful to the financials next year and beyond. And with the strategic investments we've made in recent years, coupled with our disciplined operational rigor, the business is well aligned to demonstrate improving profitability. We expect ARR to be in the range of $820 million to $825 million, representing year-over-year growth of 29%. Keep in mind, we experienced a $12 million FX headwind to Q3 that I mentioned earlier. And excluding this headwind, we beat Q3 by $7 million. We expect GAAP revenue to be in the range of $276 million to $281 million, representing year-over-year growth of 59% to 62%. We expect our non-GAAP operating profit to be in the range of $50 million to $55 million, and we expect non-GAAP net profit per share to be in the range of $0.48 to $0.53. For the full year of 2022, we are increasing our GAAP revenue range to $830 million to $835 million, representing year-over-year growth of 55% to 56%. We expect non-GAAP operating profit to be negative $5 million to breakeven, an improvement from our prior outlook for a loss of $30 million to $20 million. Finally, we expect non-GAAP loss per share to be in the range of $0.37 to $0.32, an improvement from the prior outlook for $0.56 to $0.46. The durable growth trends continue to validate the go-to-market and innovation investments we've made over the past couple of years, and our disciplined approach to spending is increasingly apparent in our improving profitability. While we are certainly mindful of the macro environment and proceeding with a high level of rigor, we are confident in our ability to close out the year with strong momentum, and we believe we are well on our way to becoming a $1 billion-plus ARR company. Thank you very much. That's on a solid quarter, everybody. Yes, listen, I've been traveling nonstop for the last six, seven months, met with hundreds of customers, and I would say that the demand for data analytics is quite high. Almost every meeting I have, customers are asking for help, because it's such a fragmented market. And I'm really, really thankful, frankly, that we made the changes that we did in the go-to-market to really move from a bottoms-up motion to a top-down motion, because that gives us visibility to the kind of the CFO level spending priorities that allows us to do a better job forecasting. We saw a small number of deals, get additional kind of stages added into the cycle, but we were able to obviously close out a really good solid quarter and I think give a pretty solid print. Clearly, the business has some seasonality this year, but there are dynamics around revenue rec that impacted sequential growth in 1Q. Listen, I think in any quarter, you get some customers that want to do a deal early and some that ask for a little more time, frankly. And as we talked about over the last three or four quarters, we had a large cohort of 2018 and 2019 three-year renewals coming in this full four-quarter period. And we've been tracking those, especially the large account ones, and working on plans to not only get the renewal but earn the permission to do a lot more, either sell to more personas or sell more seats or ideally both. And so, Paula has just done a great job prepping the team and, frankly, bringing on people that can lead and drive that motion. And, Joel, I'll just add a little bit on to that in terms of the ongoing opportunity as it relates to expanding with our customers through our renewal programs as well as through our enterprise license agreements. If you look at the enterprise license agreements that we've put in place, that gives us great visibility into consumption and utilization and gives the sales team a chance to go back and move them up to the next tier of the enterprise license agreement or expand across the balance of the portfolio. And in the prepared comments also, Joe, we referenced the burst ability in our ELAs that is really a tell to how strong the renewal opportunity can be for next year. And so, when we give next year guidance on our Q4 earnings call, you'll see what we see there as well, but I think we're in a really good spot. Thank you very much. So, in terms of revenue, we tend to see 40% the first half, 60% kind of the back half, and I think that's what you're seeing play out again this year, and so I would think about that distribution as you guys are looking at linearity. So, thinking about back half of the year, I think, would be helpful. In terms of operating profit, as you're seeing this year, we tend to get most of the profit towards the back end of the year, so I wouldn't expect anything different there. And then maybe lastly on ARR, just keep in mind that Q1 of 2023 will be the first quarter that we lap the addition of Tifacta, so think about that in your net new ARR growth assumptions as well. I guess, Mark or Paula, there's no doubt we're seeing increasing levels of scrutiny across the broader enterprise. Listen, the customers that I speak to every day, they want to be able to make better decisions faster. And to do that, they need -- they realize they need to really garner the totality of the data that swirls around the enterprise to be able to do so. It's relatively easy to upskill your people a couple of weeks of training and they can start building automated workflows, to your point, to be able to turn around manual processes. I think people are understandably freaked out, coming out of a pandemic, seeing the nightmare if they're in manufacturing of the supply chain in the last year and trying to deal with inflation and the potential impact of a recession. And we -- our entire sales motion is built around use cases and examples of how we can deliver specific business outcomes, not just sling in licenses. And I would add, Brent, to the market opportunity that Mark just explained very, very well, and I hear in all of the conversations that I have. It was in eight countries outside of the US just in Q3 alone that, that market opportunity is real because of all the reasons that he cited. And then I would just add to it that, what we've been building for the last two years now on the go-to-market side has been about a value-based go-to-market, which really resonates in times where there's extra scrutiny. So our sales team is able to show up with comprehensive use cases and blueprints, return on investment models, clear operating models for customers that want to scale quickly, so they can see the return on the investment quickly. So all of the work that we've done over the last two years in the go-to-market to focus on value, value with and through partners, value with and through our customer success team, is certainly helping us manage those extra scrutiny conversations with customers. And we want to appeal to those personas, and that's really given us a little extra wind behind our sails with our cloud products in Q3. Super helpful color here, and thanks for the color, and great to see the momentum in the business. First of all, we've talked for a number of quarters now about the investments that we've made in go-to-market and product in particular. And if you think about just the cadence of hiring, a lot of those hires came early in the year. And so, Q3 is going to be the first real full quarter that we have that employee base on board, and so that's going to burn a little bit more cash. And then, when you just think about seasonality, as we go through the year, we tend to have the strongest collections in Q1, which are collecting off of the prior Q4. But we obviously provided a bunch of commentary around how we think about the expense levels of the business, as you indicated, going forward. You mentioned, I think, two factors, Kevin: one, the 2020 three-year renewal cycle; and then also the impact of ELAs. Any color on 2023 renewal base, that would be very helpful. As you know, over the last couple of years, we've moved pretty significantly to align pricing and value closer as opposed to pricing and duration. So, we've seen a bunch of customers both elect to maintain on three years and others move to one year. As we project out and look at our renewal base into 2023, we do expect it to be significantly larger than the renewal base in 2022 for those reasons. Additionally, I guess I would point back to -- during the pandemic, we saw the most significant churn in the highest impacted verticals that we had at that time. And so a lot of those customers had gone through whatever dynamics of their business and adjustments that have had, we've had significant improvement in renewal rates to multiyear highs this year, so we're seeing a significant improvement in that respect. And then just, again, calling back to the commentary that I had with the mix of three-year and one year, we intentionally drove duration through our pricing decisions in 2021 down, and we've seen it stabilize, and it's sitting at about one and a half now. So, we're getting a significantly larger number of one-year deals proportionate to what we had seen in the past. So, obviously, we've been talking for a number of quarters about the opportunity that ELAs present for us to move a customer up and create an expansion opportunity inside the term of the ELA. So, while we have one and three-year ELA contracts, we gave an example in the script about an airline that before they even hit their one-year anniversary, it was an opportunity for us to expand to them to the next tier of ELA. And we're seeing that consistently with our ELA customers that it's reducing friction, it's giving them confidence to expand with us, and it creates opportunity for us inside the term of the ELA to go back for expansion. And last quarter, we did more in Q3 in the ELAs when we did the whole first half, and you can imagine we will be talking about ELAs again at the end of Q4. I guess, Kevin, I'm trying to tie your answer now to a previous question regarding early renewals. That usually happens when you have early renewals or you have increasing durations, where you recognize much more upfront. You've introduced tremendous amount of content over the past year, year-and-a-half, yet we have no qualification on how that's doing, how is that contributing. Let me start with the question about revenue and ARR, and then I'll hand it off for the commentary around designer server and cloud. So just for clarification, to Mark and Paula's earlier point, we certainly have customers quarter-to-quarter that would look to early renewal contracts. Those -- the revenue attributable to those continue to be recognized in the period the renewal -- excuse me, the period that the renewal expires. Revenue has a lesser effect, given just the way that FX translation works. So I would attribute the strong revenue growth to strong bookings in the quarter, strong renewal rates, and ARR was affected by FX. On the product question, Ittai, thank you for acknowledging the amount of innovation we've kind of led out this year. Obviously, earlier in the year, we did the Alteryx Analyst Cloud, which is designer cloud, Alteryx Machine Learning and Auto Insights. It's largely being driven with customers renewing, but also our designer and server customers expanding. We did all this in the cloud side, while also adding tremendous amount of innovation on to design a desktop. And so, where Mark kind of talked about the FIPS release and all the work we did there, that gives us the opportunity to address the customer as the public sector needs. All this machine learning, we continue to see real interest in the product, particularly as teams start to upskill their analysts on machine learning and AI capabilities. So the platform vision, Ittai, is really resonating with our customers. The cloud offering, as Mark talked about this earlier, is going to create -- we are creating a building a platform for everybody, for all our products to serve every persona, the IT teams as they think about their data engineering needs, business analysts as they think about upskilling and going beyond designer and server for business users to get access to insights very readily without having to rely on dashboards to Auto Insights. So it's really resonating with a variety of personas, and this is the kind of innovation you should expect to see from us as we keep rolling out our cloud products. So that innovation that Suresh and team have built unlocks opportunity and pretty nice tranches with our customers, because they are personas that we've not historically been able to address. Pretty impressive to see the beat here, especially when thinking about some of the macro volatility we've all been hunkered down and thinking about with respect to the broader market. First, again, I appreciate you calling out that FX headwind to ARR for Q3. Again, I appreciate the broad brush strokes for the growth levers when thinking about calendar 2023. So with respect to FX in the current guidance for Q4 and the full Q4, we are assuming rates as they are today across our major currencies. So there's obviously a variety of them, but we're looking at current rates for that portion similar to what you saw in Q3. And then from a burst capacity within our ELAs, we see really high utilization of the base licensing and then roughly 40% of our customers are already utilizing burst capacity. So every quarter, we see accretive customers moving into the burst. And that always gives us a little bit extra visibility into what the renewal opportunity could be, as we're really motivating and incentivizing customers to go faster. And in times like these, I think most of the customers we talk to, they want to do more and they want to be able to have better visibility in CRM corners. Congrats on the strong quarter, and thanks for taking my questions. I realize that this is largely driven by a shift in focus to larger, more strategic customers. So on the net new logo, we've consistently talked about the strategy being focused on quality of ads of customer logos versus quantity. We see the opportunity in the Global 2000 to be the most significant, whether it's expansion within the existing customers that we have in Global 2000 or net new customers in the Global 2000. So, there's nothing about Q3 in terms of net new logos that was unique to Q3 or linked to anything at a macroeconomic level. So, we did not see material impact from a macro perspective there, and we're starting Q4 with a solid pipeline, and that's part of our business as well from a year-on-year perspective. And Kamil, regarding customer churn, nothing really new there. As you might remember, we've got our sales team focused on the largest customers, mid-market and above. And so we said previously, whatever nominal churn we do get, it tends to happen in much smaller cohorts of customers. And that's just a direct result from the focus that Paula and her team are putting in large enterprise, large government. Average revenue per customer was about 91,000 this quarter, which is up again this quarter. And if you look at those customers that churned, their value was about 1/4 of that. So again, when we're seeing customer churns, they tend to be much smaller, less penetrated customers. So, I'd like to come back to Ittai's question about revenue versus ARR. So, just -- I know you said that the revenue renewals -- strong renewals in the bookings. And I would just, I guess, remind that going into 2022, we did comment that there would be a slightly greater upfront portion. So, when you're looking at year-over-year revenue trends, this year is benefiting from recognizing about 50% upfront, whereas last year was about 40%, so that certainly is creating some of that dynamic that you may be seeing. It's hard to tell, given that EBIT, of course, is based on revenue and we're more focused on ARR, but if you look -- and you decreased the EBIT loss for the year from last quarter's guide to this quarter's guide. Well, I guess to answer that, Michael, I would just point to -- we've seen a meaningful change in where we thought profitability would be for the full year, from the beginning of the year until today. But for the change in paying out bonuses in -- half of the bonus in Q3 versus paying it all at the end of the year, which we have historically done, I would expect cash flow to trend to operating expenses. So, we definitely see great interest in the market on this because people today aren't necessarily getting the insights from static dashboards that they're looking for, particularly in this uncertain economic time. Rather, it is a supplemental capability because it handles real time-based data very well. So it's a very, very powerful capability for business owners in particular. And really, our customers when they talk about auto insights, they describe it as having an AI-powered analyst at their fingertips. And so it's not really about Tableau consolidation exercise, it's about making analytics accessible to all. And auto insight is a great way to get business users, business owners. No, I mean just -- what I love about it, it's a whole new persona for whom we can sell -- to whom we can sell. Listen, we're just ramping up our -- no pun intended, ramping up our federal kind of presence. We now have a hunting license to go hunting, but it's not really a very meaningful percentage of our business yet. As you heard from ServiceNow last week, it's a massive part of their business and a more mature Alteryx. You're going to see the same thing from us, but I'd give us a couple of years before we start breaking into the multiple percentage points for federal. But really, I think the bigger picture that FIPS brings is, and every customer is asking for this, is focus on building great governance and security in our desktop products. Of course, we're going to do that in our cloud-based products. And that's been a massive focus, especially in the last year and in the next few releases for the team around governance. And I'd like to say thank you again to our customers, partners, shareholders and our team here at Alteryx. I believe we had a great Q3, and we're committed to the opportunity ahead. This team is executing at a very high level, and we have a really strong product road map, and I'm confident in the strategic direction of this company. Thank you very much."
}