{
    "symbol": "TCX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 10:30:10",
    "content": " Gross profit before network costs for the second quarter increased 30% year-over-year to $33.8 million, from $26 million, with the increase due mainly to the higher gross profit contributions of both Platform Services and Fiber Internet Services. Breaking down gross profit by business, Domain Servicesâ\u0080\u0099 gross profit for the second quarter of 2022 increased 3% from Q2 last year to $20 million from $19.5 million. Platform Services gross profit increased 202% to $7.9 million from $2.6 million for Q2 2021, with the entirety of the increase being driven by revenues related to the Mobile operator platform. As a percentage of revenue, gross margin for Fiber Internet Services expanded to 57% in the second quarter from 46% in Q2 last year. The increase is primarily the result of the following: People costs were up $3.3 million this quarter, with increased workforce costs to support business expansion, related to Ting Internet growth, as well the continued Platform Services ramp, and to a lesser extent the acquisitions of Simply Bits as well as the UNR assets and its development team, both in October 2021. Adjusted EBITDA for Fiber Internet Services was negative $6.2 million compared with negative $4.6 million in Q2 2021, with the larger loss reflecting expected costs required to support the accelerated expansion of that business. And finally, the Corporate category had positive adjusted EBITDA of $1.9 million compared with $2.9 million in Q2 last year, with the decline primarily driven by, and as expected, the lower earn-out from the sale of the Ting Mobile customers to DISH, as customers continue to churn lower transition services margins and lower contribution from the mobile subscribers retained. Finally, deferred revenue at the end of Q2 was $150 million, down 1% from $152 million at the end of the first quarter of 2022 and down 3% from $155 million at the second quarter of last year."
}