{
    "symbol": "TCX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 22:35:26",
    "content": " Revenue for Domain Services for the fourth quarter was $60.3 million, down 2% from the same quarter of last year, while gross margin was $18.4 million, down 7%. As of Q4, Waveloâ\u0080\u0099s revenues were $4.5 million, up 10.6% from Q3 but down 53% year-over-year. Our adjusted EBITDA number for Q4 was negative $1.1 million, down 27% from last quarter and 119% year-over-year. Ting had revenue gains of 38% year-over-year, increasing to $11.5 million in Q4 of 2022 from $8.3 million in Q4 of 2021. There was also a decline in corporate revenues of 17% year-over-year, from $3.2 million in Q4 of 2021 to $2.7 million in Q4 of 2022, driven by the expected decrease in low margin transitional service revenues with DISH. Domains revenue had a modest decrease of 1.8% year-over-year, from $61.4 million in Q4 2021 to $60.3 million in Q4 2022, as transaction levels normalized following the pandemic. Breaking down gross profit by business, Tucows Domainsâ\u0080\u0099 gross profit for the fourth quarter of 2022 decreased 6.5% from Q4 last year to $18.4 million from $19.7 million. That total breaks down amongst our three businesses as follows: Adjusted EBITDA for Tucows Domains was $10.6 million, down 3.7% from Q4 of last year, reflecting the normalization of renewals to pre-COVID levels. And finally, the Corporate category had adjusted EBITDA of $3.3 million this quarter as compared to $0.6 million in Q4 last year with the increase primarily driven by lower corporate expenses this year versus last year, including one-time items in Q4 2021 and a higher earnout from the sale of the Ting Mobile customers to DISH. Finally, deferred revenue at the end of Q4 was $145 million, down 1.4% from $147 million at the end of the third quarter of 2022 and down 1.8% from $148 million for the fourth quarter of last year, primarily reflecting the reversion of Domains renewals to pre-COVID levels."
}