{
    "symbol": "TCX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 20:32:17",
    "content": " Cost of revenues before network costs for Q1 increased 7% to $49.4 million from $46.2 million for the same period of last year, with the increase being less than the revenue growth due to the increase in high-margin Platform Services revenues. Gross profit before network costs for the first quarter increased 28% year-over-year to $31.7 million from $24.7 million, with the increase due mainly to the higher margin contributions of both Platform Services and Fiber Internet Services. Breaking down gross margin by business, Domain Services' gross margin for the first quarter of 2022 decreased 4% from Q1 last year to $19.7 million from $20.5 million. Platform Services' gross margin increased nearly ten-fold to $5.9 million from $0.6 million for Q1 2021, with the entirety of the increase being driven by revenues generated by the underlying Mobile operator platform. People costs were up $3.5 million this quarter, with increased workforce costs to support business expansion related to Ting Internet growth, including the first full quarterly inclusion of the Simply Bits team which joined this past November, as well the continued Platform Services build, and, to a lesser extent, the acquisition of the UNR assets and its development team in October 2021. Adjusted EBITDA for Fiber Internet Services was negative $4.3 million compared with negative $3.9 million in Q1 2021, with the larger loss reflecting higher costs required to support the accelerated expansion of that business. During the quarter, we generated $5.4 million in cash from operations compared with $14.1 million in Q1 last year, with the decrease being primarily due to increased prepaid expenses, timing of AR collections and the recognition of a contract asset this quarter in the Platform Services business. Finally, deferred revenue at the end of Q1 was $152 million, up 3% from $148 million at the end of the fourth quarter of last year but down 3% from $157 million at the first quarter of last year."
}