{
    "symbol": "CS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 15:04:14",
    "content": " Overall, we saw net revenues decline year-on-year, mainly due to a particularly strong comparable in the first quarter of 2021, especially in the Investment Bank and Wealth Management. We've reduced these figures significantly in the first quarter with net credit exposure at the end of the first quarter standing at CHF373 million, that's about 56% lower than the end of 2021. Overall, we saw a negative impact of CHF206 million on pretax income with respect to Russia's invasion of Ukraine in the first quarter, comprising CHF58 million in the provisions of the credit losses and CHF148 million of trading and fair value losses. For the first quarter, all these changes had the impact of increasing compensation costs by CHF214 million overall, and that's in line with the guidance that I gave that we should expect an increase in compensation costs for the year of about CHF1 billion. Overall pretax income was 74% lower year-on-year at CHF212 million, but we did though see net new assets of CHF4.8 billion booked in the period and that's a reversal clearly of the net asset outflows that we saw in the previous quarter. 41:53 That said our equity derivatives business, while not seeing the strength to trading in the first quarter of last year still performed well in the first three months of 2022, and our fixed income results reflected normalized securitized product revenues lower than in recent periods, but still above historic levels. 45:16 Now taken together with the 15% year-on-year increase in operating expenses to CHF308 million, reflecting the increased cash accruals due to normalized compensation deferral levels, the group wide investments in risk technology and compliance and CHF15 million of costs relating to the supply chain finance matter, pretax income for the quarter was CHF51 million 62% lower year-on-year. Thank you very much. Please ask your question. Your line is now open. Thank you very much. I think you asked specific question in terms of methodology, I think I said, back in February that we expected about 6 billion to 7 billion of methodology changes this year I think that's still the case, but clearly there will be some increase in op risk RWA above and beyond that, as we work through the impact of the litigation provisions that we took two weeks there, but I don't have a particular view at this point in terms of that number and that's something I'd expect to see in the second half of this year not in the second quarter. Please ask your question. Your line is now open. Thank you very much. Thank you very much. Please ask your question. Your line is now open. 70:23 No, we are obviously actively managing our exposure and the 7.4 billion that we had at the end of the first quarter compared to 10.2, we had at the end of the first quarter ‘21, so it's down 30% and we are obviously observing the markets for leverage loans and high yield bonds and in close collaboration between both the first line and the second line, and it's a market that is clearly significantly slower and less active than it was a year ago, but at the same time, we also more cautious, but at the same time, as you we were said, it's not only sponsor deals, but it also corporate deals and we look at a deal by deal. Your line is now open. Your line is now open. Please ask your question. So we did obviously have the benefit as we actually predicted in our 2020 Investor Day, we said that 2021 will be the year for Credit, and that is exactly what happened in the first quarter, 2021, where we saw an absolute record in our fixed income sales and trading of 1.6 billion compared to the 800 million that we now saw in the first quarter ’22, so we are half, basically of where we were. Please ask your question. Your line is now open. And he's very closely also liaising with our global high net worth strategy because some of the successes we've seen now in Switzerland also with CSX, for example, is something that he can also help build out internationally with the Global Wealth Management team, but we are and we'll continue to show our volumes in terms of AUM and net new assets for our Global Wealth Management business including that business going forward as well. And obviously, they were -- during the finalization of the restatement, we had to finalize the numbers for GTS and for AFG, especially those the AFG is the Asia Finance Group and the split between Wealth Management and Investment Banking and for those two businesses went through a finalization, iteration in the first quarter, but broadly speaking there and absolutely in line with what we had already presented on the 4 of November at our Strategy Day. Thank you very much. Please ask your question. Your line is now open. Your line is now open. Thank you very much."
}