{
    "symbol": "BRLT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 22:05:05",
    "content": " When we began the 2022 fiscal year, I shared with you that our approach would be to prudently and strategically invest to grow the Brilliant Earth brand in business, to expand our showroom and omnichannel footprint and to optimize our significant financial and operating advantage with our asset-light, agile and highly efficient business model, all with an eye on delivering profitable and sustainable near and long-term growth, and on extending our lead as a transformative modern fine jeweler for today's consumer. As we expected, we delivered Q4 revenue of $120 million as the industry came off its biggest year ever in bridal, and we strategically expanded our focus to prioritize growth in fine jewelry. In the fourth quarter, we delivered revenue of $119.6 million, a 2% decline year-over-year and growth of 28% on a four-year CAGR basis. As weâ\u0080\u0099ve mentioned before, with continued growth in fine jewelry and expansion of our assortment, we do expect AOVs will decline on a year-over-year basis and in Q4 that decline was 14%. As a result, for the full year 2023, we project net sales will be in the range of $460 million to $490 million, which represents 5% to 11% growth versus fiscal year 2022, a four-year CAGR of 23% to 25% and a four-year stacked  growth of 128% to 143%. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. However, how I might think about some of those areas would be one for AOV as with respect to fine jewelry with our continued growth there do expect that since fine jewelry has a lower average price point that there will be declines year-over-year in on an aggregate basis. And as we talked about for the call, like, we could â\u0080\u0093 we saw for Q4, we do continue to see strong order growth and I think weâ\u0080\u0099re very excited by that, the growth in orders, the growth in number of customers served, I think just really reflects the resonance and the success of the Brilliant Earth brand. Your line is open. Your line is open. So I think, Iâ\u0080\u0099d like to walk through just how weâ\u0080\u0099re thinking about the opportunity and our long-term perspective, I think weâ\u0080\u0099re â\u0080\u0093 we believe that thereâ\u0080\u0099s a lot of trajectory for us to continue to really grow and gain share over the long-term and making investments in things like growing awareness of the brand, expanding the showroom footprint, investments in fine jewelry. Your line is open."
}