{
    "symbol": "BRLT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 18:12:05",
    "content": " For this morning's call, Beth will begin with highlights of our second quarter financial and operational performance, and the drivers of our future growth. You will find additional information regarding these non-GAAP financial measures and a reconciliation of these non-GAAP to GAAP measures in today's earnings release, which is available at the Investor Relations section of our website at investors.brilliantearth.com. As we approach our one-year anniversary as a publicly traded company, we are pleased to report our fourth consecutive quarter of strong profitable growth. It's been an incredible year for our company, one in which we've grown the reach and impact of our mission, to cultivate a more transparent, sustainable, compassionate, and inclusive jewelry industry. We're pleased with our second quarter results, as they demonstrate our continuing ability to navigate in a rapidly changing macroeconomic environment. By staying focused on nimbly and prudently executing our strategy, while optimizing our asset-light business model to grow the brand, we are in a strong position to continue to take share in a fragmented industry and to prudently manage our costs, so that we continue to deliver profitable growth. We delivered record gross margin of 53.1%, a 460 basis point improvement over the prior year. And we delivered $9.6 million in adjusted EBITDA, representing an adjusted EBITDA margin of 9%. Recent highlights include the continued expansion of our omnichannel strategy, with the opening of showrooms in Bethesda, Columbus, Houston, Minneapolis, Cleveland and Detroit to bring our reach to 21 showrooms in which our customers can experience a personalized joyful shopping experience. With each new showroom opening, we bring more consumers to our brand, while also deepening our relationships with both new and returning customers. For example, we've recently launched an online waitlist to ensure customers can get the right appointment for their schedules, even if we are fully booked. Whether in our showrooms, or on our website, in Q2 we continued to deliver design-led proprietary products that our customers love, across our period assortment. But today, I'll start with fine jewelry, a fast-growing small percentage of our total mix, with huge growth potential. For Mother's Day, we enjoyed strong success delivering over 350 basis points of growth in fine jewelry mix over the prior year. We also launched men's fine jewelry including necklaces, bracelets, chains and cufflinks to an enthusiastic response. And while millions of views are impressive, it's our engagement and community building that we're most excited about. In fact, in a recently conducted brand survey, 13% of customers indicated they learned about Brilliant Earth on TikTok. And you've heard me say it for the past two quarters, 2022 is the year of wedding and we continue to capitalize on this. Both men's and women's wedding bands have grown faster than our overall business year-to-date, led by the strength of our product assortment and a record number of weddings that have driven demand. During the quarter, our AOVs were generally in line with past quarters and we continue to consistently realize profit on first purchase and see growth across our price points. As our brand grows, new and returning customers look to us for trend-leading, proprietary product design and craftsmanship in concert with our deep supplier integrations and technology, we added thousands of new lab and natural color diamonds, offering our customers an even broader on-trend assortment of colors, shapes and price points from which to choose. Our ability to leverage data, to understand our customers' preferences and then to optimize the breadth and depth of our diamond assortment which today includes over 200,000 lab and natural beyond conflict-free diamonds enables us to effectively serve the broad needs of our customers. These products and brand stories and the results that they drove illustrate what makes Brilliant Earth special, our mission, our brand, our unique and powerful business model and our team, one whose hard work and commitment is truly exceptional. In any environment and as we have since our founding in 2005, we focus on creating the future by serving our customers joyfully and responsibly, creating trend-leading sustainable products and delivering profitable sustainable long-term growth. As we look ahead to the rest of the year, we will remain cognizant of ongoing macroeconomic uncertainty and you can expect that we will continue to manage the business as we always have in a nimble fashion to deliver profitable growth and extend our leadership in the fine jewelry industry. During the quarter, we continued to execute our mission-driven growth strategy focused on scaling our business and building our brands to be the jeweler for the next-generation consumer while simultaneously delivering strong profitable growth. Revenue grew to $108.8 million, which represents 18% year-over-year growth and up 31% on a three-year CAGR compared to Q2 2019. Gross margin expanded to 53.1%, a 460 basis point increase compared to Q2 2021 and our highest quarterly gross margin percentage on record. These results again illustrate and reinforce the power and distinction of our brand, growth across our product lines and our agile highly efficient business model. Q2 revenue grew 18% year-over-year, which was consistent with our expectations in Q2's rapidly changing macroeconomic environment. This was driven by new and repeat customers, reflecting the increasing strength and awareness of Brilliant Earth, which led to growth across our product lines. Wedding band sales were also particularly strong in Q2 this year, as the strength of our product assortment and historically robust year of the wedding fueled sales. The outperformance of fine jewelry and wedding bands led to a mid-single-digit percentage decline in our total company blended AOV for Q2, as both fine jewelry and wedding bands have a lower average price point than our overall business. As Beth mentioned, we recently opened our 21st showroom reflecting the ongoing successful execution of our omnichannel growth strategy. In addition to providing customers with even greater access to our unique and joyful shopping experience, our showrooms continue to generate robust uplift in metro bookings after opening. As we look ahead to expanding our showroom presence in additional cities, we will continue to do so with a sharp focus on delivering strong ROI. Consistent with the plans we shared since our public offering almost one year ago, we see tremendous opportunities for our business to grow and for our brand to lead in the highly fragmented jewelry industry. Our showroom rollout and further expansion into fine jewelry both show encouraging results in driving financial performance, customer loyalty and lifetime value. Q2 gross margin expanded to 53.1%, which is up 460 basis points versus the prior year. Growing demand for the Brilliant Earth brands, our premium and differentiated product offerings, pricing engine optimization and procurement efficiencies once again drove strong gross margin expansion across our product assortment. As I said last quarter, what we hope will become a well-understood refrain from us is that these results illustrate how our asset-light data-driven business model is a competitive and financial advantage. In the second quarter, SG&A increased to 47.9% of net sales, compared to 35.1% of net sales in Q2 2021, an increase of 1,280 basis points. Approximately 130 basis points of this increase was related to net changes in add-backs to adjusted EBITDA including equity-based compensation and new showroom pre-opening expenses, which are added back in our presentation of adjusted EBITDA. The remaining approximately 1,150 basis point increase over the prior year reflects investments we've made to support our growth. In addition, we are continuing to invest in our fine jewelry assortment, which we see as a significant growth opportunity. In Q2, 2022, we continue to build our team to support our strategic initiatives, new showrooms and operations as a public company. As a growth company, we are also strategically investing in scaling Brilliant Earth for the long term. The combination of strong revenue and gross margin growth balanced by strategic investments in the business, delivered $9.6 million in adjusted EBITDA in the second quarter. Profitability, positive free cash flow and a capital-efficient operating model continue to differentiate us among direct-to-consumer companies and we continue to operate the business in an asset-light fashion. As you may recall, our aim over the long term is to see revenue growth in the high 20s to low 30% range, with growth across our product lines and our omnichannel model. Our long-term gross margin target is in the mid-50% range, driven by our premium products and brands, our price optimization engine, procurement efficiencies and growth of higher-margin fine jewelry. Our long-term marketing spend target is in the mid to high-teens as a percentage of revenue, as we continue to grow our brand awareness and to roll out our showroom experiences to drive conversion and repeat customer behavior. And we are targeting a 15% to 20%-plus long-term adjusted EBITDA margin, driven by several factors: gross margin expansion, improved effectiveness of our marketing spend, and leverage in our G&A expenses. However, the rate of year-over-year gross margin growth is expected to moderate from the first half of the year as we begin to anniversary improved gross margins from last year. As a result, we continue to expect adjusted EBITDA for the year to be $30 million to $40 million or an approximately 7% to 9% adjusted EBITDA margin. Historically, we have seen slightly higher year-over-year growth rates in Q4 than in Q3 and we expect a similar pattern this year. An important contributor is the strong outperformance we've seen in fine jewelry and that historically, fine jewelry sales are the highest in Q4. Your line is now open. Would love your thoughts on pricing optimization opportunities in the back half and what you see there as well as inflation and cost of goods sold and materials, if that's a factor as you think about your own pricing strategies as well as cost of goods sold. And as a data-driven company, we're always looking at opportunities to be able to maximize the benefit of our premium brand as well as the exclusive and unique product offering that we have. And so, that also I think plays a role in how we're able to take advantage of the premium positioning that we have. As you know, we do have our pricing optimization engine as well as a light asset -- an asset-light model that allows us to adapt very nimbly to changing conditions. And so, I think that's something that we do see a lot of continued strength for us in our gross margins. I would say, kind of starting from the overall revenue growth, we continue to see strong demand and the performance that we have has remained consistent. As it relates to, how we think about our marketing efforts, the digital environment we do recognize it's very dynamic, it's highly competitive. That said, our marketing spend remains efficient and we continue to drive profitable growth. So, investing in brand building for us is incredibly important to be able to drive awareness to continue to take market share. So, it's really important for us to invest here and we've seen those investments paying off. This is a category that has massive potential and as we're investing, we are also seeing some strong results there as well. Your line is now open. As it relates to bridal, while bridal has moderated slightly, it does continue to experience strong growth. But overall, I would say that generally, we're seeing consistent performance. As it relates to fine jewelry, we're really excited about our opportunity there. So, see this being a nice growth driver especially as we're entering Q4 being a premium gift, giving occasion, just like we saw with Mother's Day being a real strong performance for us. So, I think that's going to be a nice tailwind for us. We're continuing to invest in marketing, in our assortments, in the digital experience, in creative imagery a lot of I think important investments there that are really helping to drive that category. So that we see as it becomes a bigger and bigger part of our mix and we gain scale efficiencies in that area of the business we see there's opportunities to grow our margin there, in addition to some of the other initiatives and levers that we've been able to pull historically. Your line is now open. And so, we're excited to be able to capitalize on the resonance that we've had with our customer base. And as it relates to the second half, we have I think a very compelling product offering both in really across our product portfolio. And I'm really excited, especially as we're opening new showrooms and reaching more and more customers that we're seeing such strong results. So, I think the overall approach that we take is to really have a lot of insight into the trends insight, into our supply chain manage things tightly and we expect that will continue to be the case in the upcoming quarters. Your line is now open. I guess just on gross margin, obviously, nice continued benefits from pricing optimization. I think this really starts just to set the context from the premium brand, premium differentiated proprietary products that we have that allow us to have that premium gross margin. With the pricing engine, we've talked through our longer-term target of mid-50s in terms of gross margin. We are seeing a lot of success in customers that are already loyal to Brilliant Earth customers perhaps they've come into a showroom, and they already have a really strong connection. Your line is now open. We're really excited about the metros and how well they've been performing, as well as the upcoming ones that are on our road map. So Truly Brilliant is a newer collection for us and we think that this is really nicely targeting for that discerning customer who is looking for premium characteristics both in terms of our blockchain-enabled natural diamonds, it uses renewable energy for a lab created. So we're expecting I think a really strong reception, but I would say, it's early in terms of what we've seen there. So continue to see strength in the overall category, but we usually don't get too granular as it relates to subcategories. Your line is now open. So in terms of how we think about SKU count we're really looking at productivity across different assortments to make sure that, as we're introducing new products, we're continuing to see that productivity level remain strong. And that's what we've seen so far, as we've been introducing our assortment and increasing the number of SKUs we're seeing very strong performance. So I would say, like, as we think about 12 to 24 months out, we're really taking a very dynamic approach there. So our approach is not to introduce an incredibly wide selection at all cost, it's really to take a more design-driven tailored approach, which is more curated. As we expand into fine jewelry, I talked earlier about, how we really take a data and technology-driven approach and integrate tightly with our suppliers. I think just also the way that we operate is just efficient in that, if you look at a traditional jeweler, they might need to bring in thousands of pieces of a given SKU just to get something started and to have something in every single location. We operate in a different way where we can test and learn, start with limited allocations of inventory, see what's doing well, again, use that data to see where we want to make those investments in inventory. And so, I think, we're well positioned to continue to have an efficient and capital-light model. I think, one thing I would just add is, we also have the ability to rapidly introduce new products. And I think that's a real competitive advantage for us, as we're seeing strength in the assortment to be able to expand on what we're seeing as trends in the marketplace very quickly. And then lastly, you've done a great job with the gross margin and part of that is due to the fine jewelry penetration. Any kind of color you can kind of give us on just where we are with fine jewelry penetration today, where we might think it might be two years from now and where you might want to be five years from now, just to give people some kind of thought process on how that penetration kind of grows long term, because it's obviously a nicely margin accretive opportunity for you guys. I think, just on a qualitative standpoint, it's still quite small for us. And if you look at most jewelers and jewelry representing the majority of their sales, that's really I think what we're targeting in the future. So while we're not providing specific numbers, we do have I think a lot of investment in this area and are trying to accelerate to the extent that we're able to do it in a profitable way. Your line is now open. I think, the recent numbers that I have seen do indicate that there's an acceleration there in terms of independents closing doors. Typically, there is a bit of a lag, so I think that's what we've seen in previous more challenging times and I think that you're right on to think of the fact that we're probably going to see increased consolidation more generally. As it relates to the opportunity, we continue to see this highly fragmented industry as ripe for disruption. We have strong supplier relationships, our mission-driven values and the resonance that our brand has, I think is very compelling. Your line is now open. Well, while we're not going to comment specifically on one particular competitor, we think that we are very differentiated in the industry. We're constantly introducing new trend-driven collections and those resonate, as well with our customer base. So, we're really very focused on our own strategy and how we can resonate with the millennial and Gen Z audience and are seeing great success there. I think, we have a really attractive model, as it relates to our inventory light capital-efficient, a more agile flexible model. That's not to say, we won't be opportunistic as we see opportunities to continue to drive an improved customer experience and to lower costs, but do recognize that there are trade-offs as it relates to inventory there. So, I think we're comfortable with our current model and feel really good about the supply chain partners that we've had. So overall, I think even though there have been some macroeconomic headwinds there, we're continuing to perform really well."
}