{
    "symbol": "AIRG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 22:34:13",
    "content": " Joining us for todayâ\u0080\u0099s call are Airgainâ\u0080\u0099s CEO, Jacob Suen; Senior Vice President of Product and Marketing, Morad Sbahi; and Vice President of Operations, Victor Blair. As a reminder, this call will be recorded and made available for replay via a link found in the Investor Relations section of Airgainâ\u0080\u0099s website at www.airgain.com. Following managementâ\u0080\u0099s prepared remarks, the call will be opened up for questions from Airgainâ\u0080\u0099s publishing sell-side analysts. I caution listeners that during this call, Airgain management will be making forward-looking statements about future events and Airgainâ\u0080\u0099s business strategy, and future financial and operating performance. Then our Senior Vice President of Product and Marketing, Morad Sbahi will provide an update on our strategic product and marketing initiatives. As we indicated during our guidance, we had a record second quarter that built upon the strong momentum we established in Q1 and deliver record quarterly sales of $19.3 million, which was up 10% sequentially and 11% year-over-year. In addition to strong top line growth, we deliver our first quarter of adjusted EBITDA profitability in over a year. Taking a step back, especially for those of you who may be new to Airgain in our industry, I would like to provide a brief overview of who we are and what we do. Airgain is a leading provider of wireless connectivity solutions, creating and delivering products that include embedded components, external antennas, and integrated systems across the globe. We operate in three growth markets, enterprise, automotive and consumer, which collectively offer Airgain a more than $15 billion total addressable market. Our enterprise market is characterized by solutions for the industrial Internet of Things or in order to, smart CD and smart utility connectivity and reliable wireless connectivity in dense environments, such as buildings, stadiums, and transportation terminals. Our automotive market includes products that are deployed in a wide range of vehicles to solve critical connectivity needs in the fleet, public safety and automotive aftermarket segments. In our consumer market, which is the original pillar of our model encompasses a large growing set of consumers using wireless enabled devices, including wireless gateways, smart home devices, and more. Today, we see the largest investors growing opportunities in our automotive and enterprise markets, particularly on the IoT front with NimbeLink products now fully integrated into our portfolio. Through this process, we discover that a significant differentiator or Airgain is the diversity of products we offer across the value chain. Because of this value proposition, we have organized our products into three distinct sub-brands, Airgain Embedded, Airgain Integrated and Airgain Antenna Plus. With an extensive rate of products, invest in markets, partnerships have never been more important to our go-to-market strategy. We continue to see demand for our external fleet antenna business, especially in public safety, where we have secure several wins for our products to be deployed with first responders. Alongside those efforts, we have built partnerships with software and hardware providers to amplify our sales efforts on the B2B manufacturing front, specifically targeting fleet management, asset tracking, public safety and transportation markets. As an example, where the incumbent in the next generation Wi-Fi 6E opportunity that we started working on in the second quarter with a North American Tier 1 service provider that is expected to launch in Q2 2023. In addition, our new solution selling approach has helped us secure wins that include more than one of our product lines, significantly increasing the size of our customers engagements. In addition to our embedded component wins, we also continue to grow our integrated product lines. During Q2, we expanded our free connectivity opportunity into the financial services market with a significant order to a key service provider in that industry. Weâ\u0080\u0099re also seeing significant wins through our asset tracking partners in the construction, rental, packaging and micro mobility markets. The growing partnerships and customer wins not only do we reflect the increasing demand for Airgainâ\u0080\u0099s innovative technology, but also our world class global team who is committed to realizing our companyâ\u0080\u0099s vision and scaling our business. In terms of our CFO search, we have narrowed the search down to a short list of financial leaders that have the credentials to build on our solid foundation and take Airgain to the next level of growth and profitability. Sales increased 10% sequentially to a record $19.3 million, up from $17.5 million in Q1 of 2022. Beginning with our consumer sales, Q2 finished at $6 million, $100,000 below Q1 2022, primarily due to supply chain constraints for our customers. Automotive sales increased from $2.8 million in Q1 to $4.2 million in Q2, primarily due to higher revenue from our AirgainConnect and Antenna Plus products. Margins were 110 bps below mid-point guidance, mainly due to unfavorable product mix in higher than expected material costs. Finally, our balance sheet remain strong with cash and cash equivalents at quarter end of $9.4 million after paying the NimbleLink earn out in April. Due to the ongoing supply chain issues, affecting companies globally, both Airgain and our customers are experiencing longer lead times for contract fulfillments of certain products. In Q3, we expect sales to be in the range of $18 million and $19.5 million or $18.75 million at the midpoint of the range. We expect Q3 non-GAAP operating expense will be about $7.1 million plus or minus $200,000. Now, I would like to turn the call over to Morad, who will walk us through our sales and marketing initiatives. In our previous call, we introduced a marketing framework that helps communicate the progress we are making in penetrating our core growth markets. Addressing our continued evolution, I am encouraged to report that our efforts with the major utility company I mentioned during the last call, deploying AirgainConnect and adjacent products at a large scale continues the progress. Airgain is also evolving its depth of capabilities to better enable enterprises to deploy powerful, reliable and secure private wireless networks that require higher throughput and wider coverage along that line. This quarter, we introduced the next generation of CBRS and CBand antennas for private wireless network applications, featuring technology that provides high performance connectivity for point to point, as well as point to multipoint applications. We frequently receive requests for these arrangements for our asset trackers, after market antennas and with our AirgainConnect products. In addition, there is a growing opportunity for these types of partnerships with our embedded products. Our advance development team is hard at work producing new products to target entirely and tap segments for us, all with the express goal of establishing Airgain as a leader in 5G. Jacob also mentioned earlier our three new sub-brands, Airgain Embedded, Airgain Integrated, and Airgain Antenna Plus. It is focused on design teams, consistent of engineers, product managers, and system architects that are trying to bring connected products to market. It is divided into our fleet antennas, which appeal to our end user markets and IoT antennas, which appeal to design teams. In the case of our IoT antennas, a design engineer often must decide whether to design in internal or external antenna and Airgain is able to offer multiple options. By segmenting our product offering by audience, we have also been able to successfully launch targeted demand generation activities that have begun to generate significant results, filling the pipeline for current and future sales. Looking ahead, we have aligned our product suite with the expanding demand from our markets and customers. We also see continued interest in our products from software, hardware and carrier partners because of their ease of integration and look to continue to build our leadership taken advantage of the new wave of 5G product deployments. That decision saw success in short order as we were able to maintain a flexible production process and continue the migration of finished goods assembly to North America, thereby mitigating the risk that other companies are experiencing in China on supply chain related matters. In addition, rising interest rates, inflation and associated effects have combined to challenge Airgainâ\u0080\u0099s opportunities to grow margins and remove risk for customer supply chains. Despite these external headwinds, Airgain delivered record sales in solid gross margins. As you can see from our growth and profitability metrics, weâ\u0080\u0099re executing on our strategy to penetrate our growth markets and capture a meaningful share in the wireless connectivity market. Looking ahead, weâ\u0080\u0099re focus on going within our core markets, as well as expanding our leadership within IoT and 5G. In parallel, Airgain will continue to look at strategic inorganic growth opportunities that align with our overall market capture plan to enhance our product portfolio or customer base within our targeted market. Our outlook for growth is supported by the strong tailwinds in our end markets, our growing backlog and our confidence in our teamâ\u0080\u0099s ability to capitalize on the demand for Airgainâ\u0080\u0099s advanced wireless technologies. My first question is on gross margins, so I know weâ\u0080\u0099re looking back to get into the low 40% range again in â\u0080\u0093 you guys in this call and in the past have talked about some of the initiatives you have to get back to that range. We experience some unfavorable product mix in Q2 and we incurred some onetime charges and weâ\u0080\u0099re repositioning our inventory in Q3, which will help eliminate and give us a much more positive trajectory in Q4 for a gross margin improvement. I guess, how â\u0080\u0093 could you characterize the size of the supply headwind to the consumer segment in terms of lost demand, if you can, and also how much you think we â\u0080\u0093 of that demand, do we recover going into 3Q and 4Q of this year. So on the consumer side, as I indicated, previously that really we seeing a recovering happening, although itâ\u0080\u0099s been steady instead of improve dramatically like we were hoping for. In fact, with this many service providers are already upgrading their network to support the Wi-Fi 6E, and not really position Airgain really well for the near future. I indicated that we â\u0080\u0093 in Q2, this is another major service provider in North America Tier 1 thatâ\u0080\u0099s already starting the design and expect that will be shipping in Q2 of next year. So we donâ\u0080\u0099t really get breakdown the details regarding a particular market segment, but we did mention in the earnings call that earlier regarding that the contribution to the uptake in automotive, but mainly contributing to AirgainConnect, as well as some of our Antenna Plus improved selves. And I think that  we actually done a really good job in Q2, and weâ\u0080\u0099re also expecting that train to continue in Q3 and beyond."
}