{
    "symbol": "OIS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-17 14:27:19",
    "content": " During the fourth quarter of 2022, the company continued to show improvement as the industry expands activity to support growing energy demand, generating revenues of $202 million and EBITDA of $21 million, representing sequential increases of 7% and 30% respectively, after excluding a third quarter 2022 litigation related settlement gain of $6.1 million. In our Wellsite Services segment, we achieved a 12% sequential increase in revenues and an impressive 29% sequential increase in segment EBITDA, driven by higher U.S. completion and production activity, along with enhanced customer penetration and better equipment utilization. In our Downhole Technology segment revenues decreased 10% sequentially, while segment EBITDA decreased 75% due to the timing of international perforating products sales, lower integrated gun product sales mix domestically as several key customers delayed light quarter startups, supply chain challenges in inventory and receivable write-off, many of these issues are deemed to be transitory. Given customary seasonality and working capital builds in the first quarter, our free cash flow will be weighted to the second half of 2023 comparable to what we experienced in 2022 when we generated $33 million in free cash flow in the second half of the year. Our Offshore Manufactured Products segment generated revenues of $105 million, segment EBITDA of $17.8 million and operating income of $12.3 million in the fourth quarter of 2022. Segment EBITDA margin in the fourth quarter of 2022 was 16.9%, compared to 13% when adjusted to exclude the $6.1 million litigation gain reported in the third quarter of 2022. In our Wellsite Services segment, we generated revenues of $68 million, segment EBITDA of $12.5 million and operating income of $5.3 million in the fourth quarter of 2022. In our Downhole Technologies segment, we reported revenues of $13 million and segment EBITDA of $1 million in the fourth quarter of 2022, compared to revenues of $33 million and segment EBITDA of $4.1 million reported in the third quarter of 2022. Your line is open, sir. Your line is open, sir."
}