{
    "symbol": "OIS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 18:02:06",
    "content": " During the second quarter of 2022, the company generated revenues of $182 million and consolidated EBITDA of $17 million, representing sequential increases of 11% and 17%, respectively, and the highest quarterly revenues and consolidated EBITDA reported since the first quarter of 2020 before the onset of the COVID-19 global pandemic. During the second quarter, we generated revenues of $182 million, consolidated EBITDA of $17 million and a net loss of $5.1 million or $0.08 per share. Cash was used during the quarter to fund a $16 million build in working capital associated with the growth in activity levels, $8 million for the acquisition of E-Flow Control Holdings, a U.K.-based global provider of integrated handling, control and instrumentation systems and $6 million in open market purchases of our outstanding 1.5% convertible senior notes at a slight discount to par value. In terms of our third quarter 2022 consolidated guidance, we expect depreciation and amortization expense to total $16.9 million, net interest expense to total $2.4 million and our corporate expenses are projected to total $10 million. Starting with our Offshore/Manufactured Products segment, we generated revenues of $96 million and segment EBITDA of $14.7 million in the second quarter of 2022, compared to revenues of $84 million and segment EBITDA of $15.6 million reported in the first quarter of 2022. Segment revenues increased 15% sequentially driven primarily by a 21% increase in project-driven revenues and higher customer demand for short-cycle products, while margins declined due to a shift in product mix from the first quarter of 2022. Second quarter 2022 bookings totaled $77 million, yielding a quarterly book-to-bill ratio of 0.8x, while our first half of 2022 book-to-bill ratio was 0.9x. In our Well Site Services segment, we generated revenues of $55 million and segment EBITDA of $8.9 million in the second quarter of 2022 compared to revenues of $48 million and segment EBITDA of $5.5 million reported in the first quarter of 2022. Our second quarter 2022 segment EBITDA margin of 16.2% represented the highest quarterly margin achieved since the third quarter of 2019, boosted by expanding activity levels in the U.S., some recovery in our international operations and our decisions made in 2021 to streamline our operations and exit underperforming regions and service offerings. In our Downhole Technologies segment, we reported revenues of $31 million and segment EBITDA of $2.9 million in the second quarter of 2022 compared to revenues of $32 million and segment EBITDA of $2.9 million reported in the first quarter of 2022."
}