{
    "symbol": "CPSI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 23:10:05",
    "content": " While there's a lot of work remaining this year, we are very encouraged by the first quarter results and remain steadfast in our determination to deliver on our three-year plan to provide outsized shareholder returns and $80 million in adjusted EBITDA in 2024. Speaking of M&A, this quarter's results included one month of activity for HRG with revenues of $3.8 million and adjusted EBITDA of $600,000. Our other recent acquisition, TruCode, contributed $3.4 million of revenues absent purchase accounting adjustments and adjusted EBITDA of $1.8 million, both down slightly from the first quarter of 2021's pre-acquisition amounts as customer conversions from term licenses to SaaS arrangements injected some timing noise into revenue recognition. HRG contributed $2.9 million to the quarter's bookings since the date of acquisition, adding to successful execution from our existing sales teams and driving overall bookings to a 31% sequential increase and a 132% improvement over the first quarter of 2021's levels. TruBridge bookings increased 38% sequentially and nearly threefold over the first quarter of 2021's amounts as HRG drove net new TruBridge bookings to $4.4 million, compared to well below $1 million during the first and fourth quarters of 2021. HRG's $3.8 million revenue contribution drove total revenues to their second highest level in company history, surpassed only by the fourth quarter of 2017 when more than $12 million in non-recurring MU3 revenue created a momentary revenue spike. The past quarter showed a 5% sequential increase in revenues, while the combined $7.2 million in revenues from HRG and TruCode drove top line growth over the first quarter of last year to 14.5%. We call this out because the timing related decline in GRH revenues clouds up a nice organic growth story for TruBridge during the first quarter, as outside of HRG and GRH, revenues increased 3.5% from the fourth quarter of 2021. Product development costs were down $700,000 or 9% sequentially and $1.3 million or 16% from the first quarter of 2021 due to increased labor capitalization. Sales and marketing costs increased $900,000 or 14% sequentially and $1.7 million or 33% from the first quarter of 2021 as improved bookings and revenues drove commissions cost higher, while recent acquisitions brought incremental spend."
}