{
    "symbol": "AMN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 11:48:05",
    "content": " Since February, we had a $1 billion revenue target with a 15% adjusted EBITDA margin for the fourth quarter and our guidance today is comfortably ahead of these targets. Nurse and Allied segment revenue was $828 million in the third quarter, 32% higher year-over-year and declining 25% sequentially. For the fourth quarter, we expect revenue in Nurse and Allied Solutions to be down 7% sequentially and approximately 29% year-over-year due primarily to the reduction in bill rates weâ\u0080\u0099ve discussed. In our Physician and Leadership Solutions segment, third quarter revenue was $175 million, showing 16% growth over the prior year, slightly better than our guidance. In the third quarter, Technology and Workforce Solutions segment revenue of $135 million grew 35% year-over-year, better than our guidance of 30%. For the fourth quarter, we expect revenue in Technology and Workforce Solutions to grow approximately 10% year-over-year with similar increases in all major business lines. Adjusted SG&A, excluding certain nonrecurring expenses and stock-based compensation expense, was $204 million this quarter or 17.9% of revenue compared with $168 million or 19.2% of revenue in the year ago quarter. In the third quarter, Nurse and Allied revenue was $828 million, 32% higher than prior year and down 25% from prior quarter. Physician and Leadership Solutions revenue in the third quarter was $175 million, 16% higher year-over-year and flat sequentially. Technology and Workforce Solutions revenue was $135 million in the third quarter, growing 35% year-over-year and down 10% from the prior quarter. In February, based on our anticipated fourth quarter exit rate, we laid out a framework for 2023 expectations, including $4 billion of annualized revenue and a 15% adjusted EBITDA margin. Based on the midpoint of our current guidance for the fourth quarter of 2022, the same approach implies $4.26 billion of revenue and an adjusted EBITDA margin of approximately 15.3%. And then I would also just point out that when you think about the year-over-year revenue decline in Nurse and Allied, we only have $8 million of labor disruption revenue in the fourth quarter guide, and thatâ\u0080\u0099s comparing against $85 million last year. Mark, on your â\u0080\u009823 question, I would just say, with the flattening in the bill rates that weâ\u0080\u0099ve seen post September and where demand sits not just within Nurse and Allied but across PLS and the revenue growth that we are seeing in Technology and Workforce Solutions, I think thatâ\u0080\u0099s what gave us the confidence to talk about annualizing the fourth quarter number. But where weâ\u0080\u0099re sitting right now for what we see from the September numbers to where weâ\u0080\u0099re at right now, we think the worst is behind us from these 9% or 11% or 14% sequential decline that weâ\u0080\u0099ve seen, and we think the fourth quarter, for all intents and purposes, outside of seasonal fluctuations next year, that weâ\u0080\u0099ve reached the bottom."
}