{
    "symbol": "AMN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 00:24:03",
    "content": " This was slightly stronger than we expected, with revenue up 66% over prior year and 8% lower than the first quarter, due primarily to the expected decline in nurse bill rates. In Nurse and Allied Solutions segment revenue was $1.1 billion, up 76% year-over-year. For the third quarter, we expect Nurse and Allied revenue to grow 24% to 28% year-over-year, with the increase coming primarily from a higher number of clinicians on assignment. Physician and Leadership Solutions recorded second quarter revenue of $176 million, 26% higher than a year ago. Technology and Workforce Solutions hit another record with second quarter revenue of $149 million, up 59% year-over-year. Second quarter revenue of $1.43 billion was 4% above the high end of our guidance range, driven by outperformance from all three segments. Consolidated SG&A expenses were $244 million or 17.1% of revenue, compared with $157 million or 18.3% of revenue in the year-ago quarter and $258 million or 16.6% of revenue in the previous quarter. Adjusted SG&A, excluding certain nonrecurring expenses and stock-based compensation expense, was $229 million this quarter or 16% of revenue, compared with $148 million or 17.2% of revenue in the year-ago quarter. In the second quarter, Nurse and Allied revenue was $1.1 billion, 76% higher than prior year and down 10% sequentially. Physician and Leadership Solutions revenue in the second quarter was $176 million, 26% higher year-over-year and down 2% sequentially. Locum tenens revenue was $106 million, 36% higher than prior year and down 6% sequentially. Locums had $14 million less pandemic-related revenue in the second quarter versus the first, while core revenue grew 8% sequentially. Technology and Workforce Solutions revenue was $149 million in the second quarter, growing 59% year-over-year and up 3% sequentially. The Nurse and Allied average bill rate for Q2 came in 9% lower than the first quarter, and we still expect the third quarter to experience the largest sequential decline of the year. Our current expectation is that we will exit the year with Nurse and Allied bill rates stabilizing at approximately 30% lower than the first quarter level, better than our prior expectation of 35% below the Q1 peak. Your line is now open. Your line is now open. Yes, A.J., as we think about moving through the third quarter there, weâ\u0080\u0099re still expecting sequential declines every month all the way through September and then a very modest decline in the bill rates into the fourth quarter to settle out at that 30% below the Q1 peak. Your line is now open. Your line is now open. Your line is now open."
}