{
    "symbol": "CMC",
    "quarter": 1,
    "year": 2023,
    "date": "2023-01-09 16:49:03",
    "content": " I would like to remind all participants that during the course of this conference call that the Company may make statements that provide information other than historical information that will include expectations regarding the economic conditions, effects of legislation, U.S. steel import levels, U.S. construction activity, demand for finished steel products, the expected capabilities and benefits of new facilities, the Company's future operations, the time line for execution of the Company's growth plan, the Company's future results of operations, financial measures and capital spending. I will start today's call with a few comments on CMC's first quarter performance, then discuss our key strategic growth investments and sustainability efforts before providing an update on the current market environment. CMC generated core EBITDA for the quarter of $425 million, an increase of 30% from a year-ago, which produced an annualized return on invested capital of 23%. As Barbara noted, we reported fiscal first quarter 2023 net earnings of $261.8 million, or $2.20 per diluted share compared to prior year levels of $232.9 million and $1.90, respectively. Core EBITDA was $425 million for the first quarter of 2023, representing a 30% increase from the $326.8 million generated during the prior year period. CMCâ\u0080\u0099s North American segment generated adjusted EBITDA of $378 million for the quarter, equal to $348 per ton of finished steel shipped. Our Europe segment generated adjusted EBITDA of $64.5 million for the first quarter of 2023, which included the receipt of an annual energy credit that totaled approximately $9.5 million. Europe volume increased 30% compared to the prior year due to the market share gains mentioned by Barbara, as well as the impact of a planned major maintenance outage taken during the comparative period of the first quarter of fiscal 2022. Do you think the structural adjustment you've seen in the U.S. rebar market Pre Infrastructure Bill, the one you mentioned in your presentation, are currently being fully reflected in spot rebar metal spread that are premium to flat products, meaning that we should now see a return to a more normal cost price relationship moving forward for U.S. rebar prices and cost compared to what we've seen over the past two years?"
}