{
    "symbol": "FSLR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 20:05:05",
    "content": " We ended the year with a gross cash of $2.6 billion, or $2.4 billion net of debt, which is an increase to gross and net cash of $800 million versus the prior year. Our full year 2022 operating loss were $27 million, which included depreciation and amortization of $270 million, production start-up expense of $73 million, net losses of $48 million associated with the sale of our Luz del Norte project and share-based compensation expense of $29 million, partially offset by a $254 million net gain from the sale of certain businesses. Looking across the horizon, as is showed in the 10-K filing, as of 31 December 2022, we had a total contracted backlog of 61.4 gigawatts with expected future revenue of $17.7 billion for a portfolio average base ASP of $0.288 per watt, before the application of potential adjusters. On a full year 2022 to 2023 basis, we expect a 1% to 2% reduction in cost per watt produced, driven by improvements in throughput, yield, efficiency and inbound freight, partially offset by higher fixed costs and a headwind from the conversion of all production to high mechanical load modules in 2023 to optimize order fulfillment management and logistics. This is driven by several factors, including costs driven by the expected implementation of bifaciality at our lead line in Perrysburg in Q4 of 2023, which results in a reduction in front side watts, offset by a higher energy production profile; planned downtime associated with our Series 6 throughput optimization in Ohio; and a headwind associated with our Series 7 factory in Perrysburg, exiting its ramp phase in mid to late 2023, but not yet operating at full scale by year-end. Taken together, we forecast cost per watt produced, ramp and underutilization and sales freight and logistics costs to combine to yield a Q4 2022 to Q4 2023 net reduction in cost per watt sold of 9% to 11% and full year 2022 to 2023 cost per watt sold reduction of 7% to 9%. Our net sales guidance is between $3.4 billion and $3.6 billion; gross margin is expected to be between $1.2 billion and $1.3 billion, which includes $660 million to $710 million of advanced manufacturing production tax credits under Section 45X of the IRA; and $110 million to $130 million of ramp and underutilization costs. Operating income is expected to be between $745 million and $870 million, as inclusive of $195 million to $220 million of combined ramp and underutilization costs and plant startup expenses, and $660 million to $710 million of Section 45X credits. We ended the year with a gross cash balance of $2.6 billion or $2.4 billion net of debt, which is an increase to both gross and net cash of $800 million versus the prior year."
}