{
    "symbol": "EVA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 14:27:04",
    "content": " First, we firmly believe in the cash flow profile of this business and have strong conviction around our ability to not only deliver $305 million to $335 million in adjusted EBITDA for 2023 and but also to double adjusted EBITDA over the next four years and to self-fund our growth by 2027. Inflationary adjustments and pass-throughs in our contracts covered as well, but dramatically improved supply chain conditions, combined with lower energy costs and lower delivered fiber costs in our operations, coupled with higher fixed cost absorption rate in 2023 will deliver a significant uplift to expected cash flow, setting us up for a strong year in 2023 and beyond  Finally, our commercial services capability, which provides accretive margin expansion opportunities benefiting from market dislocations, which will continue to be a key incremental opportunity to drive value into this business. We are referring to this unanticipated accounting treatment as the deferred gross margin transaction as roughly $89 million of gross margin and adjusted EBITDA is not being recognized in fourth quarter 2022 results, but will be recognized in future years. For full year 2022, excluding the deferred gross margin adjustment impact, we would have achieved adjusted EBITDA of approximately $244 million, which was within our expected range of $240 million to $260 million. Excluding the impact of deferred gross margin transaction, net revenue would have been $414.3 million for the fourth quarter 2022, an increase of 50% year-over-year. Without the impact of the deferred gross margin transaction, fourth quarter would have been net income of $17 million. Adjusted EBITDA for the fourth quarter 2022 was $18.6 million as compared to $55.1 million and $68 million for 2021 on a recast and non-recast basis, respectively. Without the impact of the deferred gross margin transaction, adjusted EBITDA for 2022 would have been $244 million, which was in line with our expectations and increased by approximately 8% when compared to 2021 adjusted EBITDA on a non-recast basis. Distributable cash flow for the fourth quarter 2022 was an outflow of $1.7 million as compared to this year of $42.8 million and $54.9 million for the fourth quarter 2021 on a recast and non-recast basis, respectively. As we note reported the impact of the deferred gross margin transaction, the cash flows from operating activities would have been higher by $102.3 million from the proceeds related to the sale of finished goods that are included in cash flows from financing activities. And the rest after the kind of like -- after the beginning of the year, and the $102 million of cash collected from the customer because of the accounting of, as we mentioned, the deferred gross margin transaction is now presented as -- even though it's cash collected for the sale of finished goods is now presented in cash flow from opening activities as opposed to what you normally see for cash received for finished goods being presented as part of the cash from operating activity. So -- and on top of that, we've certainly been able for future plans to layer on incremental contracts just announced today, 600,000 tons had really very favorable pricing gives me a very high level of confidence that those plants will be on a 5x or better EBITDA multiple and generate the $75 million to $90 million that we have mentioned in our remarks. And in Brazil, as we mentioned in our prepared remarks, with this equity raise of $200 million to $250 million, we do expect not only on a pro forma basis at the end of 2022 to be within our financial policies with the leverage under 5x approximately maybe 4.7x, but also based on our forecast for end of 2023, we do expect to achieve those type of leverage targets both on a reported basis at approximately 4.8x."
}