{
    "symbol": "EVA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 16:15:04",
    "content": " Based on the continued operational improvements we are seeing across our fully contracted asset base and the seasonally strong second half of the year you've heard us describe, we expect fourth quarter results to be strong with another significant step-up in adjusted EBITDA to approximately $113 million at the midpoint of our guidance range. As we look into 2023, we are really starting due to our strides as a corporation, and we're coming up on our one year anniversary of the conversion from an MLP to a regular way C Corp. We are currently forecasting adjusted EBITDA for 2023 to be in the range of $305 million to $335 million, which will cover our stable current dividend of $3.62 per share at 1.1 times at the midpoint of this range. Recent biomass spot market prices as well as the forward curve pricing of certain European biomass indices have exceeded $400 per metric ton, which represents a substantial premium to the current long term contracted pricing across Enviva's weighted average portfolio, and we were able to capture some of that differential during the third quarter of 2022. Adjusted gross margin for the third quarter of 2022 was $75 million, which represents an increase of approximately 120% as compared to $34 million for the third quarter of 2021 on a recast basis, and an increase of 33% as compared to the nonrecast basis for the third quarter of 2021. Adjusted gross margin per metric ton was approximately $60 per metric ton, as John mentioned, which represents an increase of 104% as compared to $29.36 for the third quarter of 2021 on a recast basis and an increase of 24% as compared to the nonrecast basis of $48.38 per metric ton. Adjusted EBITDA for the third quarter of 2022 was $60.6 million compared to $14.2 million on a recast basis and $62.9 million on a nonrecast basis for the third quarter 2021, respectively. In October, we shared with the market that we expected that adjusted EBITDA for the third quarter of 2022 to be in the range of $60 million to $65 million, and we are pleased to be in line with that guidance range even with a slight deferral of about $3 million in adjusted EBITDA due to Hurricane Ian. And I think as we started out the year, as we commented on the implications of the war in Ukraine that had the effect of dampening third party volume availability, which given that we're a quite large participant in the market, a very large book of both production assets as well as long term outtakes across a range of geographies, that has been a part of our business, and you've seen that kind of consistently reported historically."
}