{
    "symbol": "AWH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 14:01:22",
    "content": "   Operator: Good morning, ladies and gentlemen and welcome to Aspira Women's Health Inc. Second Quarter 2022 Conference Call. In the second quarter of 2022, we utilized $6.4 million in cash, roughly 40% less than we utilized in the first quarter of 2022 and 16% less than the fourth quarter of 2021. Dr. Phan, can I ask you to briefly introduce yourself and then provide an update related to our product portfolio, including today's announcement of an expansion to our relationship with Harvard's Dana Farber Cancer Institute, and a number of other academic institutions to include endometriosis, in addition to our ongoing collaborations related to ovarian cancer. As soon as the report is published, we will stage on our website, you will hear more about ovarian cancer offerings, including a presentation regarding the clinical application of OVA1plus and OvaWatch in all the 24 at 12 PM Eastern time, when Nicole and I host the webinar with Dr. Charles Dunton, Aspira Chief Medical Officer, Dr. Nicole Williams of the Gynecology for Institute of Chicago, and Dr.  of Aspira Women's Health. Second quarter 2022 OVA1plus revenue was $2 million, an increase of 17% year-over-year and a 10% increase sequentially. The year-on-year price and sequential 1% decrease in revenue per OVA1plus test performed was driven by the mix of payer type with decrease patient pay collection for the second quarter of 2022, as well as our strategic initiative to serve the Medicaid population, which currently has a lower price when compared to our average and representing a higher percentage of our revenue. Research and development expenses for the three months ended June 30, 2022 were $1.4 million roughly flat when compared to the prior year second quarter of $1.47 million and the first quarter of 2022 spend of $1.35 million. Sales and marketing expenses were $3.6 million for the three months ended June 30, 2022 a decrease of $917,000 compared to the second quarter of 2021 and $439,000 compared to the first quarter of 2022."
}