{
    "symbol": "BDC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 10:13:09",
    "content": " On top of record revenues and EPS, we also expanded our EBITDA margins to 17.0%, up 90 basis points for the year, driven by strong leverage on our organic growth. As we grew EBITDA and generated $220 million of free cash flow in 2022, net leverage declined to 1x at the end of the fourth quarter, down from 2.1x at the end of the prior year. Fourth quarter revenue increased 8% year-over-year and 12% organically to $659 million, exceeding our guidance range of $635 to $650 million. Enterprise Solutions revenue increased 6% year-over-year on an organic basis, with solid mid-single digit growth in both Broadband and 5G and Smart Buildings. Net income in the quarter was $76 million, up 28% from $60 million in the prior-year period. And EPS increased 35% year-over-year to $1.75, compared to $1.30 in the year-ago period and exceeded our guidance range of $1.60 to $1.70. To quickly highlight our performance, revenues increased 13% versus the prior year and 16% organically to a record $2.6 billion. Net interest expense was $44 million for the year, down from $63 million in the prior year, benefiting from the early debt repayment that we completed in the first quarter as well as favorable foreign exchange rates. The Industrial Automation Solutions segment generated revenues of $1.4 billion, increasing 15% from $1.2 billion in the prior year. Industrial Automation segment EBITDA margins for the year were 19.7%, increasing 150 basis points compared to 18.2% in the prior year, due to solid operating leverage on volume growth and favorable pricing. The Enterprise Solutions segment generated revenues of $1.2 billion, increasing 12% from $1.1 billion in the prior year. That being said, I am very encouraged with how the segment ended the year with fourth quarter EBITDA margins of 14.1%, up 60 basis points compared to 13.5% in the prior year period. Total cash flow from operations for the fourth quarter was $202 million, up 19% compared to the prior year. We expect full year 2023 EPS to be $6.60 to $7, representing EPS growth of approximately 3% to 9%. For the first quarter, we expect revenues of $615 million to $630 million, with organic growth between 3% to 6%. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}