{
    "symbol": "PCTI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 14:12:10",
    "content": " In today's call, we will discuss the second quarter performance and outlook for the third quarter followed by our long-term vision, our growth strategies and the progress we are making in each of our product lines. Our long-term vision is supported by three core growth strategies: launch innovative wireless products, expand and leverage distribution channels and increase market share by providing more components of the overall systems, all of which we will discuss in greater detail later in the call. Revenues for antennas and industrial IoT devices were $17.6 million in the period, an increase of $2 million compared to the second quarter of 2021. This increase for the second quarter of 2022 is due to both an increase in revenues related to antennas for fleet applications and a full quarter of revenue recognized from Smarteq, which was acquired at the end of April 2021. Operating expenses on a non-GAAP basis were $9.7 million in the second quarter of 2022, an increase of $0.8 million compared to the second quarter of 2021 and $0.1 million higher sequentially. And non-GAAP diluted earnings per share was $0.10 in the second quarter of 2022, higher by $0.03 compared to the second quarter of 2021. With our backlog going into the third quarter and continued demand for our products, we expect to achieve revenues in the third quarter in the range of $25.5 million to $26.5 million. I would now like to dive deeper into our progress against our three key growth strategies that I spoke to earlier in the call: launching innovative wireless products, expanding and leveraging distribution channels and increasing market share by providing more components over the overall systems. In terms of our first core growth strategy of launching innovative products, our product suite presently includes wireless IoT devices, antennas and RF test and measurement equipment used across a variety of wireless technologies, including 5G, WiFi, P25, LoRa and others. The IoT radio modules are currently in several trials, and we expect FCC approval soon for sales in the U.S. With respect to antennas, we successfully launched several products in the quarter, including the new 5G, 10-in-1 combination antenna portfolio for rail, fleet and mass transit. We also see continued strength in the agriculture, utilities, logistics and vehicular markets, including antennas for EV charging stations in Europe and in the U.S. Our test and measurement products focus on 5G wireless operators, government agencies and public safety markets. In the second quarter, our test and measurement team produced multimillion dollar orders from two of our largest OEMs for our Gflex and HBflex scanning receivers and ancillary products that will be delivered this year."
}