{
    "symbol": "EOSE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 16:03:05",
    "content": " And you see that operating company metric coming out on the bottom left-hand side of the page, which is around discharge energy from our technology, which now stands at 541 megawatt hours with almost 50% of that coming from field operations out in the field at customer locations, continue to prove the robustness of the technology we've been operating in extremely harsh environments that have been approaching 50 degree Celsius ambient temperatures with the systems continuing to operate per plan. And Randy will walk through the cash balances, we ended with $16.3 million in the bank with closing on the end of July, an $85 million senior secured term loan, and I'll let Randy go through more of the details there, but really strong operating performance, strong allocation of capital and control of our cash to deliver our strongest operating quarter to date since we've been a public company. We feel like we fit perfectly on this opportunity, and we've been partnering with the CEC almost since the inception of the company going from testing cells to testing batteries to running pilot systems to now being able to use this $140 million to get utility-scale projects out into the field in solving California. And in fact, if you look at one of the projects that we closed in the quarter with Bridgelink was for delivery as we get into the end of this year, and that's basically because of the investment in our capital, the investment of domestic supply chain and having a bill of material where you'll be able to deliver. So as we take the left-hand side of the page and look at the growth accelerating and then look at our global supply chain operational strategy, we feel really good about being able to deliver this growth over time, and we're starting to show as a company, our ability to be able to execute and deliver to customer requirements, which is very exciting. It's very exciting when you start to look at the projects that we've been talking about moving through the pipeline in that middle section of this page are now turning into booked orders, and we continue to work that process as we go forward and feel really good about how the commercial team has positioned the company for growth. Thank you very much, sir. I think all projects are moving forward and obviously, in the environment that you're in, you're dealing with choppy waters, not only from -- and I think we've done a pretty good job of securing components to be able to deliver as we ramp up, but then there's also the civil works and permitting side of this on the customer. I think one of the things that we're doing on the DOE grant side, which would be great for us on a product development, our grant application is in consortium with a potential technology partner for part development along with three universities to be able to get us to 100%. I'm proud of what our operations team continues to do to position the factory to deliver for customers a quality product that performs -- we'll continue to work our cost equation, both on the fixed and the variable side to position the company to become margin positive as we get into the end of next year and into 2024. Thank you very much, sir."
}