{
    "symbol": "EOSE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 13:00:29",
    "content": " I think when you look at the framework that's there and just how the team is delivering, how we position the company looking forward, you know we have demonstrated an ability to produce and deploy Energy Storage Systems at scale. So, you know I'm pretty excited about what this can deliver, because as we've seen time and time again in the industry, this has worked for both wind and solar, but what makes this different is the duration of the program and the fact that we're incentivizing domestic production to have a U.S. supply chain around this critical asset in our energy mix. But as we started doing this, what the team was able to do, you know never waste a crisis, was to streamline our operating processes and increase our output over the current asset base, which allowed us to avoid $3 million in CapEx reduction as we hit our Energy Block production run rate towards the end of the quarter. You know a portion of that of course was scrap and rework and so you know with regards to the Z3 profile, right, so you know as we've talked about before, the guiding principles of the program were around design for cost, design for manufacturability and so you know I think you can see just looking at the pictures in terms of the, you know the simplicity, especially relative to the Gen 2.3. So I think what everybody is talking about, it's less about here's â\u0080\u0093 you know I think those â\u0080\u0093 the way that I'm seeing it evolve right now in the early days is it's accelerating discussions and people wanting to talk about how to bring online and the benefits that you get, but at the same time I think we are and they are both saying, â\u0080\u0098look, let's price this to the market of what we get a return on and then what the ITC and PTC will be, will be.â\u0080\u0099 \n Okay, that makes sense. Now with the IRA legislation there, them coming to us and saying â\u0080\u0098okay, how do we put together multi-level sales agreement, a multi-year sales agreement that then allows us to get â\u0080\u0093 you know secure capacity with you and then allows us to go after projects that have longer duration and flexible sorts.â\u0080\u0099  So the combination of those things, along with the regulatory framework is very encouraging for what we're seeing, but early days and I think like names at this time, not ready to disclose those and neither are the, I think the counterparty that we're talking to. You know I sit here having been with the company now for over four years and feel really good about where we are with the backlog that we have, and the product that we're developing, and the team that we built, and feel like we've got to navigate through, the liquidity of the company, continue to work with the DOE to get to a conclusion on the LPO loan, and really then position to capture what I think continues to be one of the greatest secular changes that I've seen in the energy industry in my 30 year career."
}