{
    "symbol": "EOSE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 14:55:10",
    "content": " Around the legislation, I told you about the impact on orders and shipments at the end of 2023 but feel really good about how that's going to evolve here over the next few months as we see blue chip customers and also significant shift to longer duration storage, we see the pipeline going up, I think you'll see that converting into orders as we go through the year. Those are agreements that go over across multiple years, more seeing happening in the spaces as customers look to that growth I talked about on the prior page, and they see tight capacity coming from lithium-ion with lithium-ion really being focused on the EV market, they look to us as the company with probably the largest manufacturing capacity in the industry for non-lithium-ion batteries and look to us to help fill that gap and be able to grow. Going over to the far right, which is the backlog of orders that we have on hand, which we talked about earlier stands above $450 million, the delivery and we talked about this many times, there's really three main components I would say inside of there. Your line is open. Please stand by for our next question. Your line is open. Please stand by for our next question. Your line is open. Please stand by for our next question. Your line is open. Please stand by for our next question. Your line is open. Please stand by for our next question. Your line is open. Please stand by for our next question. Your line is open. So if you were to achieve the high end of guidance, 50 million in revenue, Z3 fully automated line of 1.2 gigawatt hours of capacity, 15% unit cost reduction, and exiting at a positive gross margin, what would be the next milestones you'd be focusing on? Thanks to all of our shareholders for the support that they give us and the customers for the trust that they've put in us to deliver projects we think and believe as the days go on, we're building a company that has a lot of intrinsic value that gives the world a product that needs to power its future is something that's never been done before."
}