{
    "symbol": "IDCC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 15:59:01",
    "content": " I would now like to hand the conference over to your first speaker today, Richard Lloyd. I am Richard Lloyd, Communications Director and with me in today's call are Liren Chen, our President and CEO; and Rich Brezski, our CFO. Consistent with last quarter's call, we will offer some highlights about the quarter and the company and then open the call up for questions. Before we begin our remarks, I need to remind you that in this call, we will make forward-looking statements regarding our current beliefs, plans, and expectations, which are not guarantees of future performance and are made only as of the date hereof. Forward-looking statements are subject to risks and uncertainties, that could cause actual results and events to differ materially from results and events contemplated by such forward-looking statements. These risks and uncertainties include those described in the Risk Factors sections of our 2021 Annual Report on Form 10-K, our second quarter 2022 quarterly report on Form 10-Q, and in our other SEC filings. In addition, today's presentation may contain references to non-GAAP financial measures. In the second quarter, we continued to make excellent progress across all parts of the business. And I'm particularly pleased, that the strong momentum we built in 2021 has continued into the first half of this year. In Q2, we significantly increased revenue and net income on both a sequential and year-over-year basis. We entered into a multi-year, worldwide, non-inclusive, fee-bearing license with Amazon covering our rings of Amazon's consumer electronic devices and our InterDigital's patents. In the second quarter, our total revenue increased 42% year-over-year to $125 million. I will let Rich talk you through our financial performance in more detail, while I cover some other notable highlights from the quarter. Rajesh was previously a Senior Vice President and the Head of Corporate R&D at Qualcomm, where he spent 25 years in research and senior leadership roles. Along with our ability to attract world-class talent, one of the keys to our recent success has been the value that we continue to drive as a leading innovator across a range of critical technologies. Meanwhile, CE devices as well as the growing array (ph) of our key product overuse multiple technologies such as WiFi and Video. In short, we are in excellent position to drive growth from both existing relationships and new opportunities. In recent years, our strength in Video has become even more valuable, that we have built our formidable innovation pipeline, explore opportunities in building more immersive consumer experience and continue as a leading contributor to both the HEVC and VVC video standard. We have also achieved impressive growth in our video portfolio, which now numbers approximately 7,000 patents and applications. In wireless, our portfolio of cellular SEPs for 5G multi-mode device continue to grow in the second quarter and now stand at more than 10,000 patents and applications giving us an incredibly strong base in generational mobile that will define connectivity for the rest of this decade. In second quarter, the Institute of Electrical and Electronic Engineers, IEEE, recognized one of our senior wireless engineer for his work in 5G, by awarding him the prestigious Benjamin Franklin Key Award. Specifically, he was recognized for his groundbreaking contribution to millimeter wave, which is a foundational technology that enables both 5G's incredible speed and its ultra-low latency. Staying on the IEEE, another InterDigital engineer was recently appointed as the Chairperson of Topic Interest Group, that is responsible for identifying and exploring use cases for artificial intelligence and machine learning in Wi-Fi. While we continue to reap the rewards for innovation being implemented in today's devices, many of our research efforts are firmly focused on the technology that will shape connectivity and content consumption in the years to come. I'm especially excited by the new partnership we announced in June, with Inria, France's leading Institute for research in digital science and technology. This new innovation will not only support innovation -- this new initiative will not only support innovations across France but also enable engineers to proceed cutting edge scientific research and to explore technologies, that would define media experiences in the future, in areas such as SR and Metaverse. On the licensing front, we believe strength of our innovation, the increasing value of our patent portfolio and our licensing track record well position us to renew key agreements and sign new ones. In the second quarter, in addition to the Amazon deal I mentioned earlier, we also closed an additional agreement with industry device manufacturer Zebra Technologies covering our 4G, 5G and Wi-Fi technology. Zebra's devices are used in retail, healthcare, banking, manufacturing, and transportation, and other industries. Through our licensing platform partner, almost half of the connected cars on the market are now licensed to our 3G and 4G standard essential patents. In summary, our licensing platform -- performance this quarter underlines opportunity that we see in our core markets and in newer area, where our innovation is helping creating considerable adding. In terms of the integration activity, we continue to look forward to the upcoming decision from the UK High Court in our FRAND trial against Lenovo. And I will reiterate my message from our last earnings call, that we remain confident in the strength of our technology, the quality of our IP portfolio, and the merits of our case. As we are not getting into all the details here, but the announcement has moved the SEC policy in U.S. in our third balance and more predictable direction and confirmed our belief that while dispute over SEP license do arrive factors such as the value of the and/or innovation should guide the Court's decision making. The second quarter also saw progress in our ESG program, with the release of our second annual corporate sustainability report. At InterDigital, we passionately believe that our technology contributes to building a better and more sustainable world, and this year's report details not only how we mitigate our environmental footprint, but also how we maximize our social impact, it insures our governance needs best practices and how we strive to help our employees to excel. As Liren noted, we delivered another strong quarter with significant increases in revenue and profitability, on both a sequential and year-over-year basis. We grew total revenue 42% over second quarter 2021 to $125 million, including $100 million of recurring revenue. While mobile agreements, such as Xiaomi have driven a large part of our growth, we have also begun to see meaningful growth in the CE, auto, and IoT markets. In second quarter 2022, we had over $35 million in combined revenue from the CE, auto, and IoT markets, including almost $12 million on a recurring basis. For the first half of 2022, we recognized about $23 million of recurring revenue from these markets, representing a 70% increase from the comparable period in 2021. While we are pleased to report such strong revenue from these markets, we remain committed to driving continued growth. Moving on to expenses, you can see the benefits from the cost management actions we initiated a year ago, in our first half 2022 results. On an annualized basis, excluding litigation and stock-based compensation, we have reduced our operating expenses by almost $35 million. Moving on to capital allocation, we made the decision to refinance our convertible debt during the second quarter as it became clear we are heading into a volatile period marked by inflation and rising interest rates. Similar to our prior financings, we entered into an option structure that increases the per share price at which we experience dilution from our new debt to $106. First, to buyback approximately two-thirds of our old debt, and second, to concurrently buyback $75 million of our common stock. Looking forward to the third quarter, we currently expect revenue to come in between $96 million and $100 million. At this point our revenue guidance is based only on existing contracts, so the entire range is comprised of recurring revenue. On the expense side, we expect additional investments in research and development and an uptick in litigation costs related to ongoing proceedings, will drive operating expenses to the range of $76 million to $80 million. Finally, we expect non-operating expenses comprised of interest and other expenses to be in the range of $6 million to $8 million and an effective tax rate in the range of 25% to 27%. Your line is open. So I understand the geopolitical situations in part of Eastern, in particular, it's fairly sensitive. But the major contract we are currently negotiating, they are not been that much impacted by some of the issues. And so far, we have been demonstrating a very strong track record, still striking fair deals in across multiple windows in many different continent. And Rich, as you mentioned, the operating expenses were reduced by $75 million net of re-investments already made. For the moment, I'll stick to the guidance I've provided for the next quarter, where we mentioned an uptick led by R&I reinvestments but also a little bit from the litigation associated with ongoing matters. Your line is open. The first thing I want to touch on is, if you have any visibility for your OpEx guidance, given that the implied operating margins seem to decline sequentially. The R&I that I was just referring to related to the last question, that we are investing in today is to drive revenue that we would see years down the road because we make such long-term investments and fundamental research. When we license, we're granted permission to use technology that we've already invented in the past. So this uptick in R&I is really to drive future growth, not related to the upcoming third quarter. For the Apple and Samsung negotiation, obviously, our relationship with Apple and Samsung is very, very important to us and we have been focusing on the -- renewing their contract for quite a while. And I think everyone is aware that Apple contract expires end of Q3 of this year, and Samsung contract expires end of Q4 of this year. And it's always worth reminding that those licensing agreement with us, it really represents very long-term relationship. So through -- so, such a long-term relationship here there has been multiple renewals happening. We feel confident about the current negotiation based on how much our technology has advanced, frankly they have become even more important with the connected world with a lot of market video content being consumed on the device. So, to that degree, it's worthwhile obviously for us to remind them how much they have benefited from everything we have developed. Your line is open. And this year, you're guiding for a decline both on a sequential basis and year-over-year basis. Can you talk about -- if I get it right, you're guiding for $98 million, which will be down year-over-year and will be down sequentially. And any color on kind of what to expect later on, even if we don't -- there is no explicit guidance. No, it's a good question, Tal. There's not a lot of seasonality in our revenue because if you -- and you can find this on our financial metrics, that we published on our website. And then also fixed fee revenue, where there is a fixed price over the term of the agreement and we typically amortize that total quantum over the term on a straight line basis with maybe sometimes exceptions. The majority of the fixed fee, the majority of the total revenue is on the mobile side that definitely means towards the fixed fee. On the consumer electronics side, that's where it's more -- tends to be more variable and maybe there is a little bit more seasonality, but overall a small component. On a sequential basis, we also breakout I mentioned recurring revenue from past sales and with some of the new agreements that we signed this quarter, when you think about Amazon and then through our licensing partner GM and Ford, as well as others, there is some past sales where they're basically catching up for the use of our technology, prior to entering into these agreements. So we recognize that past amount and we try to delineate, so it's clear to everybody what that impact on the quarter was. The recurring number of $100 million, therefore, is kind of -- what to think about going from quarter-to-quarter. And at the midpoint, we're maybe down 2% it's a relatively small number. And that's -- if you look year-over-year, we had some licenses that expired last year, renewed a bunch of them, not all of them, some customers had left the business. And then in terms of growth, it's the step function changes from adding significant new agreements. Incidentally, third quarter last year, we're signing Xiaomi, there is a lot of past sales there as well. Everyone is talking about slowdown of devices, devices still make the majority -- vast majority of your revenues. So as Rich mentioned earlier, so a vast majority of our smartphone license agreement is a fixed fee agreements. What that means is that, under contract those vendor pay us the same dollar amount year-after-year during the term of the contract. So if they have lost a significant market share and those factors will be frankly factored in, but it's worth noting that for the next contract we are trying to negotiate. We actually try to frankly look at third-party projections, those already make certain amount of forward-looking expectation projection to see in the next five years or longer how much the volume will be. So we see over a relatively short period of time after we resolve thatâ\u0080\u0099s a handful of vendors relationship here, we should be able to grow into about 80% to 85% market penetration. So I think gaining more vendors and coverage will actually be in my opinion much bigger driver than the short-term, certain amount of vendors losing some market share. And the largest one is Oppo, who among three brands, Oppo, Realme and OnePlus ships over 200 million devices per year. And then the third one, which is Lenovo, again through the purchase of Motorola brand, they are a major player in a number of different markets including the U.S. And we are -- as I mentioned earlier, we are waiting for major court decision out of the UK, whereas the court will decide on a global base how much our worldwide patent portfolio is worse, there is so called brand rate determination case and that trial also consist of part damages. The reason being, all of the three vendors we are talking about, they are really global vendors. And like, Lenovo and Oppo and Vivo, these are very significant markets outside China, actually in the case of Lenovo, a vast majority of their phones are actually sold outside China. In the Qualcomm case, it always goes to court, but in the last second, there is an agreement. Once someone loses aside, the court rarely decides it's -- I've been following Qualcomm since the '90s and it always settle out of court eventually. So you're correct that frankly a vast majority of the cases are negotiated or settled before the trial, that frankly has been InterDigital's experience also. So we -- like Qualcomm, we prefer bilateral negotiation and most of the deals do get done through bilateral negotiations. Since the beginning of last year, we have signed 16 new agreements up to the end of Q2 here. So a vast majority of that agreement was signed through bilateral negotiation, without lawsuits. But once in a while we do have to file all those, generally, those are after a very lengthy negotiation where at the other side simply refuse to pay a fair term that many other vendors are paying. So when we go for those litigations, sometimes frankly case gets settled before it goes to trial and sometimes we do go to trial and get a court decision, it's hard to say, it's really case by case. But it's worth noting that through the history of InterDigital, whenever we have filed lawsuit to enforce our patent right, our IP rights every single time, we end up in a license agreement under the FRAND terms. So I did read the same news about Samsung renewing that agreement, they have continued their existing agreement, added seven more years to it. I think it's a great development for Samsung, it's also a great deal for Qualcomm. So, but we are definitely seeing that as an encouraging sign, that licensees and license or licensors continue their our long-term relationship. And as I mentioned earlier, we have very long-term relationship with Samsung and I think that's an encouraging sign. And on the technical front, I'm not sure did you quantify CE or video contribution to the current quarter. We mentioned we didn't break it out but in combination, we said that CE, auto, and IoT contributed $35 million of total revenue in the quarter and $12 million of recurring revenue in the quarter. Scott, I mean, obviously, in general, we do not see an impact to our existing agreement because they are fixed fee agreement. But for the new license agreement here, it's really a case-by-case basis. And they are a major player in the premium tier and based on all the report we see, the IP is impacted than some of the players who are competing in the low to mid-tier devices. Regarding the TVs and others, it's really -- Scott, it's hard to say generically, but we're -- as you're probably aware, our focus on getting the -- some of the leading brand TV vendor deal signed. And frankly, there's very significant past sales component to it. So it's really -- the near-term impact is relevant, but it's not necessarily a deciding factor. But one thing I was describing earlier is, we combined with our Technicolor acquisition, we really brought ourselves through the past several decades I agree into one of the leading technology developer and frankly leading patent holders in video space. Video increasingly becoming relevant for many, many devices, smartphones, and many other connected devices here. Before we sign off, I just like to thank all the shareholders for their continued support and our employees for their contribution to another outstanding quarter."
}