{
    "symbol": "NEX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 21:43:13",
    "content": " These differentiated returns, supported by the fuel cost arbitrage, should last several years as the industry fully transitions to next-generation equipment, a process that will likely take over seven years at the current newbuild cadence, with more than half of industry capacity still legacy diesel fleets. Last quarter, we presented a detailed capital allocation strategy that rest on two foundational pillars: we will prioritize a net debt zero capital structure to ensure our business remains nimble through the cycle; and we will look to invest 8% to 9% of our revenue in CapEx annually, which we believe is sufficient for us to maintain service quality and market share in our core frac business, while slowly transitioning the rest of the fleet to natural gas powered and funding growth in our wellsite integration strategy. Our cash used in investing activities was $51 million during the fourth quarter, and CapEx totaled $79 million, mostly driven by normal maintenance, investments in the next phase of our Power Solutions growth and proactive investments to increase our inventory to spare major components, such as engines and transmissions, as we look to minimize the impact of the tight supply chain. So, it's been a thing that we're going to continue to go and we even would say openly that we'd like to keep looking inorganically around that kind of model to continue to grow that business with robust cash flow we have. You're going to see a lot, I think, of -- or some drift in our fleet count up and down going forward, I'd say forever, as we configure our fleet optimally, fleet to fleet, geography to geography, client to client, even though our horsepower, I expect to maintain flat, So, that's one thing I'd say. And then, you go and you think about the attrition side supported by what I just said is that even if only 3% of the fleet attrits, that's saying that the frac fleet lasts 30 years or frac fleet just lasts that long. So, I think when we talk about our horsepower being flat, we talked about having electric fleet coming in and the fact that we're going to remove and retire 150,000 horsepower over the next 18 months, all of that kind of leads to us saying that we're going to keep the same amount of supply in the market through '23 and that we're going to manage it. I think if I caught it correctly, you said you expect EBITDA to be up 40% to 50% in 2023, which is basically in line with the implied EBITDA, right, based on your free cash flow and CapEx number, right, it's about $920 million to $985 million. It would seem to me, and you pointed out the new capacity, and -- but when you think about the lead times, companies such as yourself having the wherewithal to place orders now to be in the front of the queue, just seems like the larger companies in theory, it sounds -- it's not meant to sound anticompetitive, but you can tie up the supply chain a bit more -- and it does limit, if I'm not mistaken, the number of new entrants that could actually practically come on into the market."
}