{
    "symbol": "VEEV",
    "quarter": 2,
    "year": 2023,
    "date": "2022-08-31 21:08:07",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by and welcome to the Veeva Systems Fiscal 2023 Second Quarter Results Call. Ato Garrett, Senior Director of Investor Relations, you may begin your conference. Good afternoon and welcome to Veevaâ\u0080\u0099s fiscal 2023 second quarter earnings conference call for the quarter ended July 31, 2022. As a reminder, we have posted prepared remarks on Veevaâ\u0080\u0099s Investor Relations website just after 1:00 p.m. Pacific today. With me today for Q&A are Peter Gassner, our Chief Executive Officer; Paul Shawah, EVP Commercial Strategy; and Brent Bowman, our Chief Financial Officer. During the call, we may make forward-looking statements regarding trends, our strategies and the anticipated performance of the business, including guidance regarding future financial results. Forward-looking statements made during the call are being made as of today, August 31, 2022 based on the facts available to us today. If this call is replayed or viewed after today, the information presented during the call may not contain current or accurate information. We may discuss our guidance on todayâ\u0080\u0099s call, but we will not provide any further guidance or updates on our performance during the quarter unless we do so in a public forum. On the call, we may also discuss certain non-GAAP metrics that we believe aids in the understanding of our financial results. With that, thank you for joining us. Thank you, Ato and welcome everyone to the call. Total revenue was $534 million, up 17% year-over-year and subscription revenue was up 17% to $429 million. Hiring was good, our innovation engine is working well and our customer relationships continue to get stronger as we have more solutions to offer and each of our solutions gets better. Your line is open. On the drug pricing, first, to put it in perspective, this is specific to the U.S. and thatâ\u0080\u0099s a big part of life sciences, but certainly not the whole part of it. And then it has to do with Medicaid, which is roughly about half of the U.S., it doesnâ\u0080\u0099t have to do with private insurance. In the short and medium-term, itâ\u0080\u0099s steady as she goes. No, follow-up for Brent. Brent, when I look at the guidance, I guess I just wanted to get a sense for kind of what you mentioned headwinds in the pipeline in June. So yes, in June, we started to see some of the macro factors of plan and that continued in July at a similar pace. If you take a step back from a revenue guide perspective, we are growing revenue 18% after normalizing for FX. And if you unpack the reduction, about half of the reduction is related to FX as the dollar continued to strengthen over the last 90 days. Specifically, itâ\u0080\u0099s impacting commercial a bit more. Most of the R&D products are â\u0080\u0093 they are not priced on a per unit basis per user, they are priced more on the enterprise agreement, so really no long-term change in the overall business or the competitive environment. Your line is open. I wanted to ask about one on just some of the activity you saw this quarter and then another one on the macro, please. Maybe just to start, in quality, in particular, it stands out 52 wins this quarter and it sounds like R&D is holding strong despite the macro. Yes, I will take that one. So big picture, whatâ\u0080\u0099s happening is we picked a good product strategy number of years ago to have a suite of quality products all on a common platform. So QualityDocs, QMS, training and now we have introduced LIM, laboratory information management. So yes, it starts â\u0080\u0093 it can be a small biotech that the only thing they need from us at the very beginning might be quality or it can be a new customer thatâ\u0080\u0099s an established customer that just happens to be starting in one of our product areas in quality and then they are going to add multiple product areas in quality or it could be a customer where quality is the first area and thatâ\u0080\u0099s going to lead into clinical and regulatory and others. So I would say itâ\u0080\u0099s even mix across all three and it goes across segments, enterprise, SMB, pre-commercial goes over into med tech as well. And then Brent, one for you if I may, please. Just on the guide for billings, 9% growth, it looks like for Q3, a pretty meaningful deceleration. And then just within the macro, it sounds like you are not assuming or you did that you havenâ\u0080\u0099t seen R&D impacted here as more commercial side. I believe on a constant currency basis, we are guiding closer to 17% for billings in Q3. One is FX, similar to revenue as well as the macro. On the billings side, about a third is related to FX, again, to the strengthening dollar. So, we talked about the Crossix piece a second ago and some lighter in uptick in the number of user add-ons. Thanks so much, Brent. Your line is open. First, I wanted to start out by just better understanding kind of some of the puts and takes of the guidance in the back half of the year, because if we take guidance at face value right now, be it billings or subscription revenue, the idea of reacceleration in the back half of the year seems to be off the table for now. And then I have got a follow-up. So FX, we see it definitely had an impact. We are still early, early days in a broad opportunity across R&D as we are the operating system for DevCloud. And then in commercial, we have a lot of opportunities as well if you think about Data Cloud and Link and the like. And then maybe I just wanted to think about â\u0080\u0093 in the prepared remarks, you called out maybe some headwinds on the SMB side. Yes, sure, happy to. So first off, I know pharma represents about 90% of Veevaâ\u0080\u0099s overall revenue with the balance being med tech and CPMC. So the balance of that is SMB, which is roughly 40% of the total pharma and this is made up of wide range of different customer types. Your line is open. In earlier quarters, I know those were obviously very big and very complicated deals that take a while. So, thatâ\u0080\u0099s playing into the â\u0080\u0093 our guide for the year. So yes, I wouldnâ\u0080\u0099t say there is anything significant change in large deals other than some general additional deal scrutiny. Some of it is measurement, how are your advertising going and some of it is more programmatic, which is you can buy audience for us â\u0080\u0093 from us, patient audiences. But at the macro level, due to the macro environment, people spend a little bit less in advertising and so that flows through to Crossix. When we bought it about 3 years ago, the idea was to use it to develop data cloud, but also to integrate CRM and Crossix so we can help the industry bring together sales and marketing. So we are increasing our revenue in Crossix overall, and weâ\u0080\u0099re making it a broader offering and even establishing a new type of pattern with some customers where certain percentage of Crossix is done as an enterprise agreement, a baseline measurement agreement. Therefore, it will be a little less variable as we go forward. Your line is open. Thank you, guys for taking the question. On the guidance side of the equation, I mean, overall excess billings coming down by $35 million on a $2.3 billion base isnâ\u0080\u0099t huge, itâ\u0080\u0099s not a very big impact. So maybe for Brent, I was hoping you could help us garner confidence that this is the right cut that no more is going to be necessary on a go-forward basis and give us some confidence that the numbers have been de-risked on a go-forward basis. And then on the product side, I was wondering if you could dig into data cloud a little bit. So let me take that first one, Keith. So our â\u0080\u0093 consistent with our guidance philosophy, we take all the best information to give you the best view we have of the business today. And we considered FX, the current rates they are at. Keith, Iâ\u0080\u0099ll take the second part of your question around data cloud. So first, just defining that at the highest level, Data Cloud is Open Data, Link, and Compass. I think you may be referring to Compass, but let me hit each of them really quickly. Open Data is our customer reference data, state grower. Thatâ\u0080\u0099s been around for a while, Link. We announced that a number of years ago as one product, link for key people that has really great momentum, momentum in the enterprise and the SMB. We also announced four additional Link products which are getting â\u0080\u0093 they are all in the very early stages with early adopters, but they are getting a lot of excitement because of the momentum weâ\u0080\u0099ve created with that first Link product. So Link family of applications, thatâ\u0080\u0099s doing really well. And then the third area, which I think you may be referring to is driving additional speed is Compass. And Compass is â\u0080\u0093 remember, thatâ\u0080\u0099s our patient data, thatâ\u0080\u0099s what we launched first and prescriber. And over time, we will have sales data in that area. It could be something like defining the patient journey, understanding how to treat patients, it maybe finding more doctors based on the patients that they treat. And then once we deliver on that, we will expand within that brand team, maybe additional products and then also across brands, selling new products to other brands in that company. And we think all the time about things about how we can kind of further accelerate in there, and weâ\u0080\u0099re executing on most of those. Your line is open. Iâ\u0080\u0099d love to revisit the trajectory of the core CRM business, the piece thatâ\u0080\u0099s based on seat-based pricing. So regarding the commerce space, so we still believe that 10% is the right number over time, we havenâ\u0080\u0099t seen anything that has changed that view. I would say, really happy with the progress in the quarter. Itâ\u0080\u0099s just the momentum, the â\u0080\u0093 especially in the enterprise segment. Over time, and I think we will get there. There are other products adjacent to CDMS which is the ePRO, patient-reported outcomes, that type of thing. That one is a marathon, but weâ\u0080\u0099re ahead of the game. I think most people would say, Peteâ\u0080\u0099s going to win that race. Itâ\u0080\u0099s too early to call that race for Compass because weâ\u0080\u0099re just getting started, so very different Compass in CDMS. Your line is open. Thanks for taking the question. Maybe first for Peter, I think there was something in the prepared remarks relative to the growing number of customers with that vision for a unified platform. But obviously, you guys are heavily embedded in that strategic discussion. Yes, itâ\u0080\u0099s a good question. So big picture, weâ\u0080\u0099re getting more products and each of the products are getting better, and weâ\u0080\u0099re fitting them together very nicely. And we saw that with Dev Cloud first, where we â\u0080\u0093 a little, I guess, 6 years ago, 4 years ago, we started really painting this big picture. And now weâ\u0080\u0099re just executing on it, right, just executing. Commercial, weâ\u0080\u0099re doing that now as well. So we have good, stable, happy customers in CRM and in commercial content, and weâ\u0080\u0099re leveraging that for success in these big new areas. Crossix, Data Cloud and actually our business consulting, which is our business consulting is going well. So what weâ\u0080\u0099re seeing is our product strategy is right on the commercial side and on the R&D side, and weâ\u0080\u0099re executing well. I was really encouraged by this quarter because we just executed well, and the macro environment actually helps us for the long-term because during this time, there is a flight to quality with customers and with employees. So more rehires, more hires, getting more people, planting more seeds for future growth. When you have more excellent products, they fit together better, you just get more excellent relationships. And the macro, that happens. COVID happened and then the overspending by governments, the inflation, the correction, the war in Ukraine, etcetera. But you get through these things, and itâ\u0080\u0099s really about itâ\u0080\u0099s just about execution. So thatâ\u0080\u0099s why you hear optimism for me because I feel like to â\u0080\u0093 we got a plan, and itâ\u0080\u0099s working. And maybe if we could follow-up on that to a certain extent as well too, you highlighted a lot of kind of the ongoing innovation in a number of new product announcements and the strategic value of that business consulting segment maybe to the point. Now weâ\u0080\u0099re in it drives decisioning today, but relative to that the potential value capture. And maybe thatâ\u0080\u0099s is in an area of growing incremental reliance on Veeva to say, hey, we want you to develop more of these kind of capabilities and solutions, obviously, to go out and capture more of the overall opportunity, but to continue to expand and develop that market, speaking to your point on the long-term maybe favorability from what you guys are seeing today as well. Itâ\u0080\u0099s kind of business consulting is complete a picture for Veeva, strategic discussions about â\u0080\u0093 with our customers how can they change their go-to-market motion. And that leads into both being able to introduce our products but also to influence our products, because we have a very tight relationship between our consulting group, our product group and our sales group. And I donâ\u0080\u0099t know about every company in the world, thatâ\u0080\u0099s for sure. But I donâ\u0080\u0099t know about any company that has this mix inside one company, and itâ\u0080\u0099s really feeling good. Your line is open. One for Peter and one for Brent, I guess, Peter, just to start, you mentioned just a second ago that the macro actually might help you a little bit. The reason I ask is I assume most of those are more R&D customers, not necessarily commercial customers. The advertising, which is the Crossix related business thatâ\u0080\u0099s required over the long-term, but you can modulate it up and down. So our product footprint is more about building â\u0080\u0093 itâ\u0080\u0099s building capabilities for the long-term, not nice to have. Itâ\u0080\u0099s susceptible a little bit here when you have these hiccups in the macro cause people to reassess a little bit, okay, whatâ\u0080\u0099s going on. Just follow-up on that, I was actually referring to your product portfolio, meaning, I realize none of your products are going anywhere. But I was wondering, even within your R&D product portfolio, are there things that might become more of an imperative in the short-term versus others. That might not be the case, but I was just curious. No, not really because they are all pretty foundational, and they are in their areas. If youâ\u0080\u0099re in safety, thatâ\u0080\u0099s the most important thing to you. If youâ\u0080\u0099re in the clinical data management area, thatâ\u0080\u0099s the most important thing to you. And then, Kirk, to your second question, we did see it some of that â\u0080\u0093 we talked about lower spending in SMBs, and thatâ\u0080\u0099s more in the lower half of that SMB definition that I was describing before because that SMB space is a very wide space. I was just reflecting on your question, Kirk, and give you a bonus answer here. In terms of the products, it has more to do with just the natural cycles in the industry that â\u0080\u0093 which run longer than the temporary macro. So, for example, some of the best progress we have had in the last year is actually in our regulatory in the upper end of the enterprise in the regulatory area. And thatâ\u0080\u0099s just a function of us having good products and customer success in the industry, just itâ\u0080\u0099s a natural â\u0080\u0093 we are approaching that second replacement cycle. So, itâ\u0080\u0099s more the natural rhythms rather than the macro. Your line is open. Thanks for taking the question. And then just a follow-up on Kirkâ\u0080\u0099s question, I guess if we look at your R&D guidance for the full year, it did come down slightly. I presume some of that was FX, but you also didnâ\u0080\u0099t take up the revenue guidance. So, I guess are there certain portions of the R&D portfolio that are seeing deal delays, perhaps CDMS where the deal sizes tend to be larger. So, there are a few questions there. So, on linearity, we started to see some of the impact in the later part of June. So, that was where we started to see a little bit of the headwinds from a lower spend in SMBs and a little bit of additional deal scrutiny. So, the quarter started out a little bit more typical and then we started to see that later in the month of June. And then related to R&D, on a â\u0080\u0093 if you exclude the impact of FX on a full year basis, itâ\u0080\u0099s closer to 32% growth full year. So, we are very pleased with what we are seeing from the momentum in the R&D space. Now, they are not completely immune either to additional deal scrutiny. So, if itâ\u0080\u0099s a large deal, there could be additional levels of approval and inspection on that. Your line is open. Maybe first, on the commercial side of the business, recently in some of the checks as we are thinking about budgets for calendar year â\u0080\u009823 picked up that some budgets are starting to remain sort of static on a year-over-year basis for sales and marketing. In some of our checks, we are starting to pick up that as we look at budget planning for sales and marketing heading into next year. Yes, where most of the industry is entering their budget planning cycle right now, so those â\u0080\u0093 a lot of those conversations are kind of hitting full swing in most life sciences companies. And no, I have not heard we are seeing that yet. Itâ\u0080\u0099s just â\u0080\u0093 again, like Peter talked about, a lot of what pharma does is these longer cycle, longer planning kinds of things, and we havenâ\u0080\u0099t seen any indication that budgets will be impacted next year. So, we havenâ\u0080\u0099t heard that yet, but time will tell. So, the add-on of additional CRM users, add-on of Chrome app users, there is always some level of churn that happens. You donâ\u0080\u0099t see it, but companies get acquired as one example. Your line is open. Thanks for taking the question. And then I have got a follow-up. And then be higher in the quarter, as you called out a couple of occasions that Veeva is a good place to work and potentially some of the smaller previously faster-growing public or private companies may not be as attractive to some of that talent, thinking about talent leaving and there being multiple compression, particularly in the private markets. Looking at your balance sheet, you have got nearly $3 billion in cash. Certainly, the hiring environment is better now than it was a year ago. In terms of M&A potential, yes, when the valuations come down, and the speculation comes off a little bit, it is a more attractive M&A environment and so we are looking, but we are always patient. We have a â\u0080\u0093 so far, 100% track record of success on our acquisitions. So, we are a bit careful and surgical, but we are looking. And when you are looking, you might find something, but you donâ\u0080\u0099t know exactly when you find it. Your line is open. The $17 million of lower subscription revenue guidance, most of that seems to be coming in the second half. If I specifically apply that to what I imagine the Crossix revenue basis, it implies a rather large change in Crossix performance. If you â\u0080\u0093 if you take a look at the reduction, half of it is FX related. And then you can kind of split the other balance between Crossix, which you called out, there was a little bit more pronounced impact to the Crossix business and then the balance would be more broadly. So, I think your observation is a good one. But based on your operating history and being through ebbs and flows in this industry, does it stand out to you that there is specific areas of your business. It seems like itâ\u0080\u0099s falling exclusively in commercial that are getting caught up in the macro where R&D is forging ahead 32% organic and the enterprise commercial solutions like align events, data, those donâ\u0080\u0099t seem to be changing. So, I think we are seeing the impact today is as you mentioned, more on the commercial side, where itâ\u0080\u0099s more user-based consumption. So, that modulates a bit more in the macro. So, again, it was more pronounced in Crossix, and we saw with some of our add-on business, so within the year. On the longer term ELA-type business, those are longer really strategic type deals. And the â\u0080\u0093 they are less likely to be impacted, I would say over time. I would add that it has to do with the maturity of the product as well, Crossix being a special case that can go up and down with the advertising. If we look at our very mature and high market are products like PromoMats, the commercial content, CRM, thatâ\u0080\u0099s where you are going to see it a little bit more. You have to remember in these other growth areas where we are just getting started, so data cloud, including Link encompassing their business consulting and then the R&D area, safety, CDMS, these new quality products. And thatâ\u0080\u0099s, we are not as susceptible there, right. Thatâ\u0080\u0099s just the natural cycle of getting your early adopters live and happy, getting the value out there and then capturing the market. Your line is open. So, Brent, I just wanted to follow-up on some earlier questions. I am just getting questions from investors because I think a lot of people thought maybe the SMB exposure was more R&D focused, just given the pre-commercial nature. So, I donâ\u0080\u0099t know if there is a way to split that out. So, the exposure we are seeing is more on the commercial side, as we said before, and itâ\u0080\u0099s more on the lower end of the SMB space. Now, we still are seeing, like I said before, increased scrutiny on larger deals that cut across both commercial and R&D. But as far as the lower spending in SMB, that is more pronounced on the lower end and on the commercial side. But in general, they will follow the amount of advertising spend the customer does in general. So, thatâ\u0080\u0099s the way you should think about that. I would like to turn the call back to CEO, Peter Gassner for closing remarks."
}