{
    "symbol": "FE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 15:34:03",
    "content": " The new 4-year Grid Mod II plan proposes a $626 million capital investment to expand our deployment of Grid Mod technologies designed to enhance the delivery of safe, reliable power, promote modern experiences for customers, offering emerging technologies and provide opportunities to help lower customer bills. Although this results in an estimated earnings headwind of approximately $0.30 per share beginning in 2023, which reduces the noncash benefit from the pension from $0.40 per share in 2022 to an estimated $0.10 per share in 2023, the funded status of our qualified pension plan has improved from 82% at the end of 2021 to 84% at the end of June. These include accelerating additional capital investments and optimizing our financing plans, which includes moving $1 billion of planned debt financings from 2023 to future years, reducing corporate costs in our real estate footprint as well as anticipated benefits from continued improvements we are seeing in customer arrears. On a pro forma basis, excluding the impact of accounting changes, rate credits provided to Ohio customers and equity financing transactions, operating earnings increased by $0.06 per share or 13% compared to the second quarter of 2021. Again, adjusting for the impacts of accounting policy changes, Ohio rate credits and dilution, this represents a $0.06 improvement versus our operating earnings for the first half of 2021 or approximately 6% year-over-year growth. The positive impact of our investment programs in Pennsylvania, Ohio and New Jersey was offset by slightly lower residential customer demand, as I'll discuss in a moment, and higher planned operating expenses including planned maintenance outages at our generation facilities as well as the impact of accelerated maintenance work we mentioned earlier. And finally, in our corporate segment, our results improved by $0.09 per share compared to the second quarter of 2021, largely impacted by higher profits from our legacy investment in a mining operation in Montana as well as lower interest costs from our efforts around the balance sheet I mentioned earlier. First, if you just look at year-over-year earnings growth based on what we know relative to the pension, it starts with our regulatory strategy, strong formula rate investments across transmission and distribution as well as the rate structures we have in place from the Ohio SEET settlement that provides really strong regulatory earnings growth. And then as I mentioned, we have planned operating efficiencies from FE Forward as well as the benefits from the tender transaction and the investment earnings on the corporate side, the mining operation where it's giving us flexibility to pull ahead some planned maintenance work this year from future years."
}