{
    "symbol": "FE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 14:38:04",
    "content": " Operating earnings were $0.50 per share for the fourth quarter of 2022 and on an adjusted basis, excluding unique drivers this year, which include the impact of accounting changes, rate credits provided to Ohio customers and equity financing transactions. In our transmission business, fourth quarter results benefited from continued formula rate base growth of 9% year-over-year associated with our Energizing the Future investment program as well as lower financing costs. Again, on an adjusted basis, excluding the accounting changes, Ohio rate credits and equity transactions, we achieved a $0.26 improvement in operating earnings compared to 2021, which represents 12% year-over-year growth. In terms of other 2023 drivers, our expectation is for the continued strong growth from the investments we're making for our 6 million customers in our distribution and transmission businesses and an improvement in our cost structure, driven in part by the work we accelerated into 2022, but this is certainly an area we will need to keep an eye on with respect to inflationary pressures. Please proceed with your question. So if you think about 2023 ex pension and ex-Signal Peak, there's going to be obviously significant improvement in the earnings year-over-year of the business, mainly because of the actions that we took last year to accelerate maintenance expenses and the plans that we put in place for additional cost controls this year. So, if I think about the plan going forward, I think what you'll see is above-average growth from the business ex-pension, ex-Signal Peak from new base rates and formula program capital spend in our distribution companies, the continued organic growth from our transmission business and then how we're going to deploy the proceeds in an EPS accretive way from the FET transaction. Please proceed with your question. Please proceed with your question. Please proceed with your question. We're glad to see in the slides that the 6% to 8% annual growth rate target continued beyond 2025, the recently announced FET transaction obviously gives you a lot of flexibility in terms of deploying capital, as you mentioned, either towards rate base growth or debt repayment, both of which yield recurring benefits to earnings. Please proceed with your question. So if you think about just year-over-year, the $0.38, I would say probably 25% of that is coming from OpEx that we accelerated from '23 into '22, our financing plan, which would be permanent the debt tender as well as the open market repurchases that we executed in the back half of last year. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}