{
    "symbol": "FE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 15:20:36",
    "content": " In West Virginia, the Public Service Commission approved a settlement agreement for environmental compliance projects at the Fort Martin and Harris power stations to meet the U.S. EPA's current affluent limitation guidelines required to operate both plants beyond 2028 as well as a surcharge to recover the expected $142 million of capital investment along with annual operation and maintenance expenses. On a proforma basis, excluding the impact of accounting changes, rate credits provided to Ohio customers and equity financing transactions, which are all unique drivers this year, our third quarter operating earnings increased $0.11 per share or 16% compared to the same period in 2021. Again, on a pro forma basis, adjusting for the accounting changes, the Ohio rate credits and equity transactions, we achieved a $0.17 improvement in operating earnings compared to the first 9 months of 2021 or nearly 10% year-over-year growth. Jon, just -- I guess, just given some of the pressures we've seen with inflation and interest rates, I guess, how much of the $0.30 of pension headwind that you previously disclosed have you sort of been able to offset to date with some of the O&M and financing moves you've done recently, especially as we're layering in Signal Peak, which essentially is printing money given sort of the coal price moves. I would tell you with the moves that we've already made with our financing plan, the OpEx that we're accelerating into '22 and the insight that we have into Signal Peak's earnings for next year, at least the sales that they have locked in at this point in time, we've captured the majority of the $0.30. And also the potential for having to file a coal-blowing rate case at some point, do you think about -- in your conversation with stakeholders there, whether there's potential for a global settlement of some kind where you wrap all of those things into one kind of multiyear rate-making regime and rather than have potentially kind of 2 different proceedings or dockets and kind of somehow resolving for long -- to kind of create more long-term uncertainty about the regulatory work in the state. I mean we have not yet reviewed the order or the details, but we do understand that our proposal has been successful to a large extent and something potentially approaching $1 billion of investment over the next 8 to 10 years, which we view as very positive and additive to our plan and why it's so important to have our balance sheet, the strength that we're targeting. My sense is we'll file those sometime in the first part of next year, you probably won't see new rates until the end of next year or first part of '24 as part of those cases."
}