{
    "symbol": "HEXO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-03-18 14:42:10",
    "content": " While the convertible note with a significant inhibitor to HEXO's growth prospects, I am pleased that we can now, as a result of our recently announced proposed strategic alliance with Tilray, put that behind us and continue to position ourselves to retain and grow our significant market share while we become a cash flow positive business within the next 4 quarters. This proposed alliance between HEXO and Tilray achieved several goals, including: it deleverages the balance sheet to a more manageable level; it raises sufficient liquidity to fund The Path Forward, including unlocking of USD 80 million of restricted cash; it preserves value and minimizes dilution to existing shareholders; and it offers significant commercial benefits to HEXO representing upsize to The Path Forward. The Tilray agreement is expected to deliver up to $50 million combined cost synergies within 2 years of the completion of the transaction and will leverage both companies' commitments to innovation and brand building, strengthen market position and capitalize on opportunities for growth. As you may recall, last quarter, we introduced The Path Forward, a strategic plan that utilizes HEXO's current assets and our capabilities to drive accelerated organic growth, build market share and become operationally cash flow positive within the next 4 quarters. The Path Forward is made up of 5 priorities: continue to reduce manufacturing and production costs; streamline and simplify the organizational structure; realize cost synergies from acquisitions and recent plant closures; focus on revenue management, including more disciplined pricing; and five, accelerate organic growth by building market share, capturing market share gains and capturing missed revenue opportunities. And I'll just remind you of those 5 priorities: continue to reduce manufacturing and production costs; streamline and simplify the organization; realize cost synergies from acquisitions and recent plant closures; focus on revenue management, including more disciplined pricing; accelerate growth through organic market share gains and capture missed revenue opportunities."
}