{
    "symbol": "CXW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 14:47:03",
    "content": " In the first quarter of 2022, we generated revenue of $453 million, which was consistent with the prior year quarter, despite the non-renewal of contracts with the United States Marshals Service, or USMS, at our Leavenworth Detention Center and our West Tennessee Detention facility in 2021. Now, the decline was driven by the non-renewal of the three contracts that I just mentioned, the transition of populations at our La Palma Correctional Center pursuant to a new contract with the state of Arizona, the sale of 5 non-core properties since the first quarter of 2021 and an increase in interest expense due to our issuance of $675 million of unsecured senior notes during 2021. However, because of the preparation to receive the Arizona inmates, including a reduction in the average daily population of Immigration and Customs Enforcement, or ICE, detainees at the facility, facility net operating income decreased $2.4 million during the first quarter of 2022 compared to the first quarter of 2021. Utilization from ICE was higher in the first quarter of 2022 than in the prior year quarter, which offset the reduction in utilization due to the non-renewal of the United States Marshals Service contracts at our Leavenworth and West Tennessee facilities. Lastly, as we have previously disclosed, transitions of populations at our La Palma facility and contract terminations at our Leavenworth, West Tennessee and the managed-only Marion County Jail facilities accounted for a reduction in EBITDA of $9 million or $0.05 per share from the prior year quarter. Occupancy in our Safety and Community facilities continues to reflect the impact of COVID-19, but increased to 70.6% in the first quarter of 2022 from 69.9% in the prior year quarter, despite the contract terminations at the West Tennessee facility on September 30, 2021, and our Leavenworth facility on December 31, 2021, both of which remained idle during the first quarter of 2022. Additional but more moderated sequential declines in ICE detainee populations during 2021 and into 2022 were offset by higher state inmate populations, which increased 4.9% from the first quarter of 2021 to the first quarter of 2022 as states began to emerge from COVID-19. And so that would impact Q2 because even if Title 42 gets lifted under the current terms, which will be May 23rd, you don’t really see increases in populations, at least until the end of the second quarter and then even have to surpass the first tier fixed monthly payments for some of our Federal facilities. Yes, you said it. Yes, you said it."
}