{
    "symbol": "FORM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 22:08:03",
    "content": " As anticipated, FormFactorâ\u0080\u0099s third quarter revenue was down sequentially from the second quarter, chiefly due to the expected reduction in demand for foundry and logic probe cards and this produced the forecasted decline in gross margins and profitability. These core strategic tenants are first sustained semiconductor content growth in both consumer and enterprise applications; second, the industryâ\u0080\u0099s relentless investments in new technology and capacity; and third, the device-specific consumable nature of advanced probe cards, which when combined with our customersâ\u0080\u0099 innovation-driven investments in engineering systems, have historically resulted in less volatile demand cycles than wafer fabrication equipment. Turning now to our fourth quarter outlook, our sequentially weaker outlook is due to three primary factors: one, the new U.S.-China trade restrictions announced on October 7; two, weaker DRAM probe card demand; and three, further softness in foundry and logic probe card demand with specific weakness in RF probe cards. Third quarter revenues were $181 million, an 11.3% sequential decrease from our second quarter revenues and a decrease of 4.8% year-over-year. Probe Card segment revenues were $139.4 million in the third quarter, a decrease of $28.3 million or 16.9% from the record Q2. Systems segment revenues were a record $41.5 million in Q3, an increase of $5.3 million or 14.6% from the second quarter. Within the Probe Card segment, Q3 Foundry and Logic revenues were $90.6 million, a 26% decrease from Q2. DRAM revenues were $35 million in Q3, $1.9 million or 5.2% lower than in the second quarter and were 19% of total quarterly revenues as compared to 18% of revenues in the second quarter. Flash revenues of $13.9 million in Q3 were $5.4 million higher than in the second quarter and were 8% of total revenues in Q3, higher than the 4% in Q2. Non-GAAP operating expenses for the third quarter were $49.5 million, or 27.4% of revenues as compared with $54.5 million or 26.7% of revenues in Q2. Company non-cash expenses for the third quarter included $8 million for stock-based compensation, $1.6 million higher than in the second quarter due to the increase in fair value of the annual RICO grants as a result of the higher stock price at the time of grant, $2.8 million for amortization of acquisition-related intangibles, similar to the second quarter and depreciation of $7 million, $0.2 million lower than in the second quarter. So they are not part of the step down in the quarter, but one-third, a significant chunk of whatâ\u0080\u0099s been a $40 million to $50 million quarterly run rate comes from the domestic customers and given our exposure at the leading edge in both Foundry and Logic and in DRAM. Maybe I want to â\u0080\u0093 next question, I want to double click some of the comments youâ\u0080\u0099ve made, Foundry and Logic, probe card, if I heard it correctly, I think you are implying roughly $10 million ish kind of reduction in the Foundry and Logic segment into next quarter. Mike, I wanted just to start by going back to the breakdown that youâ\u0080\u0099ve given us in terms of the three things that are impacting revenues you should look into the fourth quarter, and the question really is helping us understand the degree to which some of these things, I think itâ\u0080\u0099s more foundry and logic and some of DRAM thatâ\u0080\u0099s more cyclical and just due to the sudden decrease in demand that weâ\u0080\u0099re seeing in application areas and customer adjustments versus some things that might be more structural, such as the inability to ship to China. I wouldnâ\u0080\u0099t want to create the expectation that it makes up for a $50 million delta in 2023, but there are some growth prospects inside there as well as in the broader foundry and logic and DRAM probe card space."
}