{
    "symbol": "FORM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 20:40:03",
    "content": " FormFactor again posted strong results in the first quarter, delivering the second highest quarterly revenue in company history, exceeding the non-GAAP gross and operating margin levels of our target financial model, and producing the highest quarterly free cash flow in company history. Let me close by noting that our first quarter results and second quarter outlook, demonstrate another step towards our target financial model that delivers $2 million of non-GAAP earnings per share on $850 million of revenue. First Quarter revenues were $197 million, a 4% sequential decrease from our Q4 of 21 record quarterly revenue, and an increase of 6% year-over-year. Probe card segment revenues were $160 million in the first quarter, a decrease of $6 million or 4% from Q4 of 21. Within the probe card segment, Q1 found the unlogic revenues were flat with Q4 at $114 million, comprising 58% of total company revenues, slightly higher than the 56% in the fourth quarter. DRAM revenues were $35 million in Q1, $6 million or 14% lower than in the fourth quarter, and were 70% of total company quarterly revenues as compared to 20% of revenue in the fourth quarter. On a non-GAAP basis, gross margin for the first quarter was 49%, 200 basis points above the high end of our outlook range and 470 basis points higher than the 44.3% non-GAAP gross margin in Q4, with higher gross margins in both our segments. Non-GAAP operating expenses for the first quarter were $51.9 million, or 26.3% of revenues, as compared with $49.7 million, or 24.2% of revenues, in Q4. Company non-cash expenses for the first quarter included $7.5 million for stock-based compensation and $2.4 million for the amortization of acquisition-related intangibles, both of which are at similar levels for the fourth quarter, and depreciation of $7 million, $0.5 per fully diluted share higher than in the fourth quarter as a result of our capacity expansion. Non-GAAP gross margin for the second quarter is expected to be 47%, plus or minus 150 basis points, on a similar product mix to Q1, offset by higher manufacturing costs."
}