{
    "symbol": "FORM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 22:21:04",
    "content": " The second quarter financial results and overall themes were similar to the first quarter's as major customers continued to release and ramp new designs to meet demand for their products, driving strong results in our probe card business in both Foundry & Logic and DRAM. As you saw in our press release and as Mike mentioned, FormFactor, again, posted strong second quarter results, delivering the second highest quarterly revenues in company history with revenues and gross margin above the midpoint of our outlook ranges, EPS at the high end of the range and non-GAAP gross margin again exceeding our target financial model. Second quarter revenues were $204 million, a 3.4% sequential increase from our first quarter revenues and an increase of 8.4% year-over-year. Probe card segment revenues were a record $167.7 million in the second quarter, an increase of $7.7 million or 4.8% from Q1. Systems segment revenues were $36 million in Q2, a decrease of $1 million or 2.7% from the first quarter. Within the Probe Card segment, Q2 Foundry & Logic revenues were a record $122 million, a 7.3% increase from Q1, comprising 60% of total company revenues, slightly higher than the 58% in the first quarter. DRAM revenues were $37 million in Q2, $2 million or 7% higher than the first quarter and were 18% of total quarterly revenues as compared to 17% of revenues in the first quarter. Flash revenues of $8.5 million in Q2 were $3 million lower than in the first quarter and over 4% of total revenues in Q2, lower than the 6% in Q1. Non-GAAP operating expenses for the second quarter were $54.5 million or 26.7% of revenues, as compared with $51.9 million or 26.3% of revenues in Q1. Company noncash expenses for the second quarter included $6.4 million for stock-based compensation, $1.1 million lower than in the first quarter; $2.7 million for the amortization of acquisition-related intangibles, $0.3 million higher than in the first quarter; and depreciation of $7.2 million, $0.2 million higher than in the first quarter. Yes, I'll take that. Yes, I'll take that. When we talk about our target model of $850 million of revenue and 47% gross margin, most of the growth should come from Foundry & Logic."
}