{
    "symbol": "OESX",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-09 13:36:04",
    "content": " Specifically the previously announced $4 million plus project for our longtime automotive customers started more slowly than anticipated in Q3, but is now accelerating in Q4, and the start of a $9 million Department of Defense project shifted from third quarter of this year into first quarter of 2024. Our fiscal 2024 outlook reflects a growing array of significant retail logistics public sector and automotive projects in our LED lighting pipeline, as well as strong growth in our EV charging solutions and electrical maintenance services business. Before I turn the call over to Per, I wanted to make it clear to our shareholders that despite an anticipated $50 million year-over-year decline in our business from our largest customer and online retailer through the first nine months of fiscal '23, the balance of Orion's business grew by approximately 9% year-to-date and 5% in quarter three over the prior year periods. As previously discussed, the current year has been largely impacted by the wind down of the multiyear project with our largest customer, which had an $11 million impact on the third quarter. As of quarter end, net working capital was $24.5 million, including inventory investments of $19.3 million, which includes finished goods associated with our large automotive project, the addition of Voltrek inventory, and the balance of inventory intended to support product sales volume increases in the coming quarters. Nothing specific at this point, I think maybe the best way to think about it, just for some context is, when we announced the Voltrek deal in October, we said we expected them to do about $3 million to $5 million of revenue in the second half of the year. And just to clarify one thing for the audience on the earnout, the $1.5 million we accrued in the third quarter, if their performance continues, at the level it is, we would expect to record an additional $1.5 million accrual in the fourth quarter of our fiscal year, and then the expectation would be that, that would be paid sometime mid to late summer."
}