{
    "symbol": "VSEC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 06:07:01",
    "content": " Fleet segment revenue increased 22% on a year-over-year basis in the first quarter, driven by strong growth with commercial fleet customers and e-commerce fulfillment sales, together with stable contributions from the U.S. We continued to experience strong demand for aftermarket parts servicing Class 4 through 8 vehicles and heavy-duty trucks across both our commercial fleet and e-commerce fulfillment channels. We reported $231.2 million in revenue in the first quarter, an increase of 40% versus the prior year period, our strongest revenue quarter in 10 years and revenue growth in all three of our operating segments. Aviation recorded its highest revenue quarter ever, driven by a combination of strong new program execution, share gains within the business and general aviation market and continued commercial end market recovery. Throughout this year, we will continue to invest in new capabilities and expand our integrated solutions across a growing base of new business and general aviation customers and commercial customers, including MRO capabilities in support of the recently announced Honeywell Aerospace agreement for Avionics product repair. For the remainder of the year, we're anticipating growth in quarterly revenue year-over-year and an adjusted EBITDA rate of approximately 10% to 11%, driven by more moderated repair recovery and organic investments that support continued growth in 2023 and beyond. Commercial revenues were $27.9 million in the first quarter, an increase of 93% versus the prior year period and now represent 42% of total segment revenue, a new record. Segment adjusted EBITDA of $8.8 million, increased 9% versus the prior year period while adjusted EBITDA margins declined as anticipated 160 basis points year-over-year, given a higher mix of commercial revenue. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions."
}