{
    "symbol": "VSEC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 13:18:15",
    "content": " Aviation segment adjusted EBITDA represented over 50% of total company 2022 adjusted EBITDA versus 29% in the prior year, supported by balanced growth across both commercial and business and general aviation customers and both distribution and MRO revenue channels. Segment revenue of $261 million increased 12% compared to 2021, driven by growth within commercial and e-commerce fulfillment customers. For the full year 2022, we recorded $949 million in revenue, up 26% versus 2021, driven by growth in all business segments, but primarily driven by the $160 million of new aviation business. Total adjusted EBITDA for the year was $92 million, an increase of 27% versus 2021, and adjusted net income was $37 million, an increase of 34% versus 2021. For the full year 2022, Aviation generated record revenue of $408 million led by organic investments in new distribution programs, contributions from the global parts acquisition and increases in MRO activity. Total adjusted EBITDA of $52 million was up 145%, and for the full year, adjusted EBITDA margins were 12.8%, up 420 basis points versus 2021. Within the Aviation segment, we anticipate revenue to grow between 7% and 15% year-over-year, driven by a balance of commercial end market recovery, new program execution and expected stabilization of business and general aviation markets. Total commercial revenues were $24.9 million in the fourth quarter, an increase of 19% versus the prior year period. Adjusted EBITDA for the full year was $33 million, up 9%, and highlights the opportunity to continue to increase total segment profitability while diversifying revenue. Looking to 2023, we anticipate revenue growth of 12% to 20% year-over-year as contributions from the commercial revenues, primarily from the recent Memphis, Tennessee facility launch, offset modestly lower US Postal service revenues. For the full year, Federal and Defense revenue increased 4% to $280 million primarily as a result of our US Navy program, which was up 45% year-over-year as a result of a vessel transfer to the Royal Bahrain Naval Force. Adjusted EBITDA declined 55% to a $10.8 million year-over-year due to the shift to more cost plus contracts, which represent 50% of total segment revenue, up from 35% in 2021. As a result of the nonrepeating 2022 US Navy vessel transfer, we anticipate between a 5% and 10% revenue decline in 2023 for the Federal and Defense business and an adjusted EBITDA margin of 1% to 3% as we continue to invest in new business development resources and capabilities that will drive incremental growth in 2024 and beyond. For the full year 2022, we used $3.2 million of free cash flow, which includes $10 million of fourth quarter inventory investments, to support the previously announced VSE Aviation expansion into the Asia Pacific region for our existing Pratt & Whitney Canada engine accessories program. As we look towards the Fleet segment, a lot of the growth that we're expecting to see is in the commercial side of our business as you'd expect, the new most recent Memphis facility launch will drive some really good improvement in terms of total commercial revenues in the business, we expect to see some modestly lower USPS revenue."
}