{
    "symbol": "VSEC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 19:52:14",
    "content": " During the third quarter, revenue, net income, adjusted EBITDA and free cash flow each increased materially on a year-over-year basis, driven by a combination of new business wins, program execution and improved demand across our key commercial end markets. Third quarter adjusted EBITDA of $24 million was up 12% versus the prior year, driven by contributions from both our Aviation and Fleet segment. Our Aviation segment had another outstanding quarter with revenue of $102 million, up 40% and adjusted EBITDA up 86% in the third quarter. Revenue in our Fleet segment increased 7% in the third quarter, driven by growth with commercial and e-commerce fulfilment customers. The EBITDA improvement benefited from commercial Fleet growth, along with steady contributions from the U.S. During the quarter, Federal and Defense segment revenue increased 12% year-over-year, driven by growth within the foreign military sales program with the U.S. Navy. These new business wins support our goal of building a pipeline of consistent and recurring multi-year revenue and they include the following: a new 15-year distribution agreement with Pratt & Whitney Canada, supporting new engine line maintenance spare parts and engine accessory exchange to support customers in the Asia Pacific region; a new 5-year exclusive distribution agreement with a global OEM supporting their Fuselage Mounted Antenna systems for their European, Middle East, Africa and India customers; the expansion of an agreement with a global OEM, where VSE acts as the exclusive distributor of their inertial reference system and navigation device supporting a wide range of aircraft platforms from Bombardier, Textron, Dassault and Gulfstream and a new 2-year agreement as a sales channel partner to distribute more than 200,000 spare parts supporting Embraer business jet. During the third quarter, the Aviation segment achieved record adjusted EBITDA through successful implementation and execution of recently awarded distribution programs, along with growth and scale within our MRO businesses. We reported third quarter revenue of $242.5 million, an increase of 21% versus the prior year period, driven by growth in all 3 of our operating segments. Aviation recorded another strong quarter with over $100 million in revenue, driven by the successful implementation of new programs, share of wallet expansion and continued end market recovery in both Business and General Aviation and commercial end markets. Fleet segment growth was supported by commercial fleet and e-commerce fulfillment revenue, together with modestly higher contributions from the U.S. Federal and Defense segment growth was driven by the U.S. Navy programs, specifically for military sales in support of ongoing aftermarket services. Total commercial revenues were $25.4 million in the third quarter, an increase of 23% versus the prior year period and represents 39% of total segment revenue. As expected, we generated $11.3 million of free cash flow in the quarter, primarily driven by revenue growth and the successful execution of recent aviation distribution awards. We're now at about 10% below pre-COVID levels in our commercial repair business, which has improved versus the second quarter and continues to pace in line with the overall market recovery and then our business in general aviation repair businesses continued to accelerate in terms of investments we placed through those businesses. I'd say in the aggregate, if you look at all the announcements, including the Memphis facility, there's probably about $60 million of working in capital investment that we'll make into our business over the coming 6 months or so and probably about $10 million of CapEx next year as part of all the growth that we're experiencing. Yes, I mean there's obviously the offsetting -- yes, there's the offset to that, which is the U.S. And as I mentioned, it's going to take us -- certainly, the first quarter will see a bigger impact on margins, but it's going to take us some time to progressively get back as it relates to kind of getting the full ramp rate and there's a mix shift dynamic on the commercial revenue channel versus the U.S. If you look at the aviation deals that we've announced, I'd say, we're looking at maybe, call it, $10 million to $12 million of incremental revenue for next year with opportunities for us to continue to support more customers, depending upon the timing of the transition and inventory transitions and the like."
}