{
    "symbol": "MESO",
    "quarter": 2,
    "year": 2023,
    "date": "2023-03-02 04:21:04",
    "content": " Weâ\u0080\u0099ve generated new analyses of data from the Phase 3 trial and from the Expanded Access Program, showing the validated potency assay in place during the Phase 3 trial actually reflects the primary mechanism of action of remestemcel in children with steroid-refractory GVHD and correlates with the product in vivo bioactivity and predicts overall survival outcomes. In an investigator-initiated study, at Mount Sinai in New York, the use of validated biomarkers for assessment of treatment effect in severe steroid-refractory GVHD children demonstrated that remestemcel treatment resulted in significantly greater day 28 overall responses on the left-hand slide and day 180 survival on the right-hand slide in those children who were matched for biomarkers for the highest risk of disease. In our open-label Phase 3 trial study 001, 89% who had severe Grade C/D disease, day 100 survival was 74% compared to 57% in propensity-matched children from the MAGIC cohort, match for the same inclusion criteria as the children in 001. However, in an earlier analysis with CIBMTR database just in Grade D patients, there was a 51% day 100 survival compared to 31% survival in children with Grade D disease treated with best available therapy. This Slide 17 shows side-by-side the published data from MacMillan et al on the left-hand side in children with steroid-refractory acute GVHD treated with best available therapy, demonstrating an overall survival of just 35% through two years. And the key elements of that Phase 3 trial without a single injection of rexlemestrocel together with hyaluronic acid carrier into the lumbar disc causing pain, resulted in significant reduction in pain relative to saline controls at both 12 months and 24 months across the entire study population of 404 patients. Today, we are very pleased that the outcomes of the DREAM heart failure trial, double-blind, randomized, controlled in 537 patients who received rexlemestrocel or sham and will follow for over 30 months was published in the premier cardiovascular Journal, Journal of the American College of Cardiology."
}