{
    "symbol": "LFG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-17 00:46:07",
    "content": " Over the last six months, we have successfully entered into an industry changing JV, acquired a landfill gas electricity business at a compelling valuation, meaningfully grown our project development backlog and corresponding estimated long term annual earnings power, secured and amended and upsized credit facility, signed additional long term fixed price commercial contracts, produced our first models of all components of Archaea Version 1 Plant and made strides on our 2022 development programs. These municipal landfill wins are consistent with the company's strategy produce - to pursue new RNG development opportunities at scale and across the large total addressable market of public and private landfills in the U.S. On the commercial front, we recently signed new RNG sales agreements with Ã\u0089nergir and UGI, which added additional RNG volumes to our contracted base. We also wanted to provide additional specifics around our ongoing optimization program, which will not only mitigate the 19,000 SCFM lost landfill gas at our legacy facilities through capacity expansions but in combination with other efficiency improvements is expected to result in more than $100 million in incremental annual EBITDA added to our existing RNG asset base after completion of ramp up. Currently, taking into account volumes expected to be sold under our existing long term fixed price contracts and forward rent sales for this year, we estimate approximately 2.5 million to 3.5 million MMBtu of our expected second half 2022 RNG production will be subject to market pricing. With cash flow contributions from second half development activities and underlying base asset growth, we believe we can achieve over 200 million in run rate EBITDA in about 3x run rate leverage once all projects in this year's development plan are completed and ramped up to full flows which puts us in a strong financial position to execute on our 2023 priorities and beyond. So it's not only supply and demand, but it's also the fact that folks now see with what we've done at Assai and our other long-term offtake that the volumes that we said we would deliver, we're actually delivering and that's why when we see, you know, additional second third contracts with offtake partners, we're delighting our customers with what we're doing, they're seeing our excellence and they want to continue to participate in that."
}