{
    "symbol": "NTIC",
    "quarter": 1,
    "year": 2023,
    "date": "2023-01-12 14:09:04",
    "content": " For the first quarter ended November 30, 2022, our total consolidated net sales increased 9.7% to a first quarter record of nearly $20 million as compared to the first quarter ended November 30, 2021. Total net sales for the fiscal 2023 first quarter by our joint ventures, which we do not consolidate in our financial statements, decreased 8.5% to $24.7 million. The first quarter of fiscal 2023 is also the third consecutive quarter of Zerust Oil & Gas sales over $1.5 million, reflecting the positive momentum within our oil and gas business. Fiscal 2023 first quarter Natur-Tec sales were $4.6 million, a 21.6% increase over the prior fiscal year period. Compared to the prior fiscal year period, NTIC's consolidated net sales increased 9.7% to a first quarter record because of the positive trends Patrick reviewed in his prepared remarks. Total operating expenses for the fiscal 2023 first quarter were $7.9 million, 11.7% increase over the prior fiscal year period. Gross profit as a percentage of net sales improved to 31.8% during the three months ended November 30, 2022, compared to 31.3% during the prior fiscal period, primarily a result of improved pricing to offset inflationary pressures and increase sales to customers in the oil and gas industry as products within this end market carry higher margins that our Zerust industrial products. NTIC reported net income of $502,000, or $0.05 per diluted share, for the fiscal 2023 first quarter compared to $4.5 million, or $0.46 per diluted share, for the fiscal 2022 first quarter. For fiscal 2023 first quarter, NTIC's non-GAAP adjusted net income was $608,000, or $0.06 per diluted share, compared to non-GAAP net income of $781,000, or $0.08 per diluted share, for fiscal 2022. During the fiscal 2023 first quarter NTIC's board of directors declared a quarterly cash dividend of $0.07 per common share that was payable on November 16, 2022, to stockholders of record on November 3, 2022."
}