{
    "symbol": "AMPG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 18:37:14",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to AmpliTech Groupâ\u0080\u0099s 2022 Investor Update Call. Later, we will conduct a question-and-answer session and instructions will be given at that time. As a reminder, today's conference call is being recorded. I'd now like to turn the conference call over to AmpliTechâ\u0080\u0099s Director of Corporate Communications, Shan Sawant. On the call today, our AmpliTechâ\u0080\u0099s Founder and CEO, Fawad Maqbool; the Company COO, Jorge Flores; and the Company CFO, Louisa Sanfratello. Following initial management comments, we are going to open the call upto investor questions. This call is taking place on Monday, November 14, 2022 Remarks that follow and answers to questions including statements the Company believes to be forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements generally include words such as anticipate, believe, expect, or words of similar importance. Likewise, statements that describe future plans, objectives, or goals are also forward-looking. Such risks include among others matters that the Company has described in its press releases and in its filings with the SEC, except as described in these filings, the Company disclaimed any obligations to update forward-looking statement, which are made as of today's date. With that, let me turn the call over to our CEO Fawad Maqbool. I want to use this time to review some key financial and operational milestones from Q3 '22, speak on current market conditions and overall communication space, and also provide an update on our two newer ventures MMICs and TGSS. Revenue increased 415% to $5.4 million, compared to $1.1 million in Q3 '21. Gross profit grew to $2.7 million and over 7-fold increase from the Q3 '21 gross profit of $314,000. Q3 '22 net income reached $577,000 compared to a Q3 '21 net loss of $593,000. As of September 30, 2022, our cash and equivalence totaled $13.1 million and working capital was $20.2 million, giving us an ample capital to fund all of our strategic growth initiatives. Now operationally, AmpliTech had a successful showing at the annual AOC Electronic Defense Show, achieving positive customer engagement and setting a company record for a number of meetings with new and existing customers. These included many military applications, since we know there was a large effort by the government to update much of the existing obsolete communications infrastructure. Finally, TGSS AmpliTechâ\u0080\u0099s fully managed 5G system integrator company, is now operational. Revenue contribution from this division is expected to begin by Q3, 2023 or earlier. AmpliTech product demand remains strong, as shown by the increased revenue guidance we just issued in our earnings press release. As I mentioned in the third quarter, we reported record quarterly revenue of $5.4 million. Effectively, quintupling our Q3 2021 revenue of $1.1 million, this growth was primarily driven by strong demand for our LNA products and semiconductor packages. It's important to note, as per our previous quarter guidance, that despite rising industry material costs, we reported $577,000 of net income, compared to a net loss of $593,000 in Q3 '21. Again, that's an improvement of 193 basis points. A $1 million increase from our guidance last quarter, representing a 239% increase over fiscal year 2021 revenues. AmpliTech is also well capitalized for executing our strategic growth initiatives with solid cash reserves of $13 million and the healthy working capital of $20 million, low cash burn and profitable operations, we have no need to raise additional cash at this time. Now, I would like to speak about the communications infrastructure space today and the opportunities that we see ahead for AmpliTech. As of today, we still find that the communications industry infrastructure is not at the level it needs to be to power next generation technologies. In fact, Ooklaâ\u0080\u0099s latest 5G network speed test report shows 57 to 116 megabit per second downstream speeds, and eight to 11 megabit per second upstream speeds, from the three major carriers; that just means speed to everyone here on your cell phones and on your laptop and your devices. These are numbers from this quarter, so you can see recently even from these numbers that we're still not at what we should be, it's far from the 1-2 GB/S speeds that denotes true 5G, including the 2-5 GB/S speeds required by AR/VR technologies companies like Metaverse. As we build out our product suite, our goal is to improve this overall infrastructure performance and bring it much closer to enabling true 5G. We now have an assortment of loan noise amplifiers, filters, attenuators, and other components available in ship form or MMIC, and we expect to add more new products by the end of 2022. We are progressing on schedule for the launch of this product line and we reiterate our goal to provide MMIC chips on a COTS or Commercial off-the-shelf bases by Q2, 2023. We are also continuing the development of our TGSS division, which will offer innovative true 5G O-RAN radios as well as the planning and optimization services required to complete all new 5G installations globally. For those of you that that don't understand O-RAN and what it means, let me give you an analogy. If people travel overseas or to another country, they need to have to get to use their appliances and adapter; something that converts 110 volts to 220 or 220 to 110; without this conversion, they cannot use their appliance. So using this analogy, O-RAN is something that you need to have 5G in-place and to adapt for 5G, you'll need this adapter to connect to the older technology. So in essence, without this adapter, you cannot get to 5G. AmpliTech amplifiers feature extremely low noise across a range of frequencies, diffuse minimal data loss, and ultimately provide clear signal that can travel great distances at greater speeds. We believe that by implementing these components into a full 5G open radio unit, which we are building in the next gen open ran architecture; we expect to create a compelling product for our customers. In closing, I'd like to congratulate the AmpliTechâ\u0080\u0099s team for their hard work and execution that's evident in our record third wave -- third quarter results. We are thrilled to continue to solve the challenges ahead of us, by building communications infrastructure of tomorrow, today. Well, we see continued growth. I mean, we, we have seen continued growth because of the demand, that's existing and it's in aligned with all the, all the requirements for 5G and all the requirements for the chips right now as it is. But as these technologies evolve, they'll still be a continuing demand and we plan on infusing it with our own MMICs as well. They'll be able to sell not only the semiconductor packages themselves, but they'll also be able to sell the MMICs in the packages to the same existing customer base. And that will be an increase in revenue for both companies, for both divisions. Well, we didn't sign any agreements with Meta. So we joined them as a participant in providing technology for all this evolving structure, the infrastructure. And last question on Quantum computing, obviously it's a big piece, it's growing. As I mentioned before, it's like a hockey stick and we're at the curve of that hockey stick and we've also sent in several demo units to customers, and right now they're in qualification. Actually next year will be a pivotal year because all the demonstrations that have been done this year, we provided hardware to these large users and when they see the comparative results of our products compared to what is out there, then we see a very, very large increase in revenue next year, due to this. I can't give you any numbers on that, but the total market is obviously in the hundreds of millions. All right guys, well, congratulations again in a great quarter and good luck for Q4. Fawad, I don't have too many more right now, but obviously -- obviously a strong sales result in the third quarter. Yes, in general, it usually is slower due to the holidays. And not just that, there are a lot of people that take the vacations at this time, even customers. So even though we would normally pick up orders or they're in line, they wouldn't be placed until next year. Also, because a lot of people hold back on the budgets, they wait till next year and then they put the budget in place because they run out of funds for this year. And then just you mentioned, and you've mentioned this in the past and I've been aware of it, you, you've had, you've been having success and experiencing strong demand at these recent trade show events. We have actually, we, as mentioned before, we implemented the CRM tool, that we are using now. And it's really generated a lot of inquiries and a lot of a large funnel for inquiries and then which will be converted a large, a large percentage of that. Well, right now, like our CRM model, though have source of doing at least converting 25% of the opportunities that are in the funnel. And just to add to the success that we're getting at the trade shows, we're generating a lot of requests for information that before we have, which eventually, as you're aware of it will turn into RFQ and then solidly purchase orders from different new people. And then, I just want to get your thoughts on the backlog because when you acquired Spectrum at the beginning, or earlier, I guess like a year ago now you had quite a sizable backlog from that acquisition. Do you, when you're looking at, I don't want to get ahead of my skis here, but when you're looking at 2023, obviously you're expecting a huge demand influx here. Do you, but obviously you need customer orders to, to generate sales. Well, it, I, can tell you that we have five, at least five very large customers that we are discussing these products in quantum computers, quantum computing as well as the 5G applications. I can't say anything right now, but in general, the only limitations right now for us getting purchase orders are just logistics and current conditions, economy conditions that we've been in experiencing there. There's a lot involved in the, that causes these delays. But again, my estimate is as early as Q4, we could see some of the results of all these efforts as early as Q4 and it could be not in revenue, but in bookings. So it sounds like we could we could see a bit of a domino effect possibly as we get closer to year-end, you could start to see some evidence of more of these orders coming in. And I guess we'll, we'll kind of get an update from you probably by, February or March of next, of next year at that time when you report the fourth quarter. Also, I'm happy to see, great job on the, on the bottom line too. Great to see you, you put up over just over $5 million of revenue and yet you put up a GAAP net profit. So that's, that's great as well. Our goal is to, to shift our focus, as I mentioned before from the original mode that we were providing the LNAs connector LNAs just, just in regular commercial markets here and there to smaller customers. Our goal is to provide the very special LNAs, which differentiate us from other competitors. And the government itself from that show in, specifically that show is for military applications. So we are going after all the military applications because there's a whole revamping of military communications infrastructure and companies like Space Force and Navy and Air Force, they're all revamping their communications hardware. So we've made inroads in contacting all these companies and are now getting some exposure for both our connector modules as well as our MMIC chips, so, that we can access the entire -- the entire spectrum of applications. But in specifically, specifically, we are focusing towards the larger margin applications. Every one of these things that we mentioned, a larger margin and not just the regular general amplifier requirements like we used to do before. We've brought to the, the specialty microwave from two buildings into one building. That's also a big, big plus for us because by, buying specialty, I mean spectrum, we have actually went into a resale operation that averages out to a lower overhead from manufacturing. We've also implemented an ERP system, which lowers our overhead and actually increases our throughput. And our next question will come from Edward Gilmore, private investor. Thanks for taking my call, just one question for me. You mentioned in the press release that the TGSS is now completed and operational, and I wondered if you could just maybe give some more insight on the eventual revenue impact there. Basically what I mentioned before, you need to take all these existing 3G, 4G, LTE, so-called 5G stuff that's right there, right, with all carriers right now. That inter-operability is the O-RAN compliance, which is, has been standardized so that everyone can use the existing infrastructure and then tack on the 5G. And that means any country, anywhere that's using 3G, 4G, 5G, they will now be able to come up to that standard and be able to receive the new 5G hardware, so second part of our plan in TGSS is to provide the hardware. So the hardware itself is the radio that uses our amplifiers, which are very low cost, I mean not low cost, but low noise. And as well, they have MMIC form. A MMIC form factor means chips, so they can fit into these radios and hundreds of them can fit in there because they're in ship form. Now, because of that, we would be able to increase the range of these radios and provide a much lower noise figure and higher data, which other radios cannot. And the second part of it next year is to provide these, this hardware that will be retrofitted into millions of sites. But also with the hardware and millions of sites, you're going to have services for all these millions of sites as well. Sorry, as I mentioned before, yes, it is both operational and manufacturing. We're also focusing all our product focus to the large higher margin products like the quantum computing amplifiers and modules also to the 5G infrastructure, which is the hardware, which is not a $2,000 amplifier like we normally sell. So that is very important in, in showing why the revenue will increase. And in manufacturing, we've lowered our overhead, as I mentioned internally in all across our, our different divisions as well as the, the ERP system that we have in place. So the COTS generates a faster turning turnover of sales as opposed to the custom design product that takes 30, 60, 90 days to build. To hear about the progress we've made and the plans we have to realize AmpliTech mission of providing the communication systems of tomorrow, today. Until then, if you have any other questions or would like to schedule a call with management, please contact our communications director whose contact information is listed at the bottom of our press releases."
}