{
    "symbol": "ARRY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 23:10:27",
    "content": " You'll recall, coming into our second quarter, we had some constraints on our liquidity due to our debt covenants, delivering $425 million of revenue and managing our working capital to not require either covenant relief or additional funding was a testament to this team's execution. As Kevin mentioned, the $352 million from the legacy Array business represents organic growth of 79%, compared to the prior year and quarter-over-quarter growth of $101 million, which is partially due to our normal seasonality where we would expect more deliveries in the second and third quarters. Gross profit increased to $47.4 million from $20.5 million in the prior year period due to the increase in volume, coupled with better pass-through pricing on the projects signed under our new business process. That said, we currently anticipate paying down revolver in full in the third quarter with a combination of the funds received from the settlement Kevin discussed earlier and our free cash flow, which we expect will range from $75 million to $100 million in the quarter, driven by improved margins and better working capital efficiency. So I think the right answer is, it's going to take two or three quarters to get STI margins to where we think we really want them to be kind of a terminal margin perspective, but you'll start to see that improvement here in the back half of the year for sure. I can only say that, I think that we're in a great position and have a seat at the table working with several of the larger industry bodies, we certainly spend time with SIA, and we have representatives on the Board of SIA, who will have a seat at the table in terms of helping the government work through some of the details in the language that's going to come further as these provisions get more clarity wrapped around. So I would say that, of course, you're going to have that just normal transition of the receivables that build after Q2 being collected in Q3, but we're normally a free cash flow generating business and feel that once our margins are back at the historical levels, we'll continue to generate free cash flow. But for the balance of this year, we still believe we're going to be free cash flow positive in the tune of around $100 million for the full year."
}