{
    "symbol": "VVI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 14:33:05",
    "content": " As I mentioned, Pursuitâ\u0080\u0099s overall adjusted EBITDA was $15.6 million for the second quarter. This is up $13.6 million compared to the prior year, primarily due to revenue growth, partially offset by improved staffing levels to support the return of consumer demand and our new experiences. The new experiences we opened or acquired since the beginning of 2021 collectively contributed revenue of $9.4 million and adjusted EBITDA of $271,000 during the quarter. Revenue reached 75% of the pre-pandemic 2019 second quarter and adjusted EBITDA margin was slightly better, reflecting increased in-person live event activity and GESâ\u0080\u0099 lower, more variable cost structure. Spiroâ\u0080\u0099s second quarter revenue increased $77.5 million, with an increase in adjusted EBITDA of $21.8 million as compared to the 2021 second quarter. GES Exhibitions second quarter revenue increased $141.5 million, with an increase in adjusted EBITDA of $34.9 million as compared to the 2021 second quarter. As shown on Page 11 of our earnings call deck, our second quarter revenue reached a new record of $77.6 million, which is up $41.3 million or 114% year-over-year. Relative to pre-pandemic 2019, second quarter revenue increased $22.2 million or 40%. We anticipate that full year 2022 adjusted EBITDA margin will increase from the 20.1% we saw in the second quarter and materially from 2021, but will remain below 2019 levels. During the first half of 2022, GES Exhibition delivered an 8% EBITDA margin on $266 million in revenue, and had a 22% flow-through to adjusted EBITDA on incremental revenue compared to the first half of 2021, as seen on Page 19 of the earnings presentation. During the quarter, Spiro delivered $89.4 million in revenue and $15.8 million in EBITDA as existing clients spending exceeded our expectation and new clients started their marketing projects with Spiro. We continue to expect very strong year-over-year growth from both Pursuit and GES and are pleased to be increasing our full year guidance for consolidated adjusted EBITDA due to GES was stronger than previously expected performance during the second quarter, partially offset by a reduced full year outlook at Pursuit. As shown on Page 21, we expect Pursuitâ\u0080\u0099s adjusted EBITDA for the 2022 full year to be in the range of $70 million to $80 million, which is down from our prior guidance of $80 million to $90 million. For the peak third quarter, we expect Pursuitâ\u0080\u0099s adjusted EBITDA to be in the range of $74 million to $82 million as compared to $59.6 million in Q3 2021 and $75.1 million in Q3 2018. Based on the stronger-than-expected performance of our second quarter events and current expectations for the balance of this year, we feel comfortable increasing our full year range for GES by $25 million. For the third quarter, we expect GESâ\u0080\u0099 adjusted EBITDA to be in the range of $6 million to $11 million as compared to a loss of $4.2 million in Q3 2021 and a loss of $2.8 million in Q3 2019. For the third quarter, we currently expect an operating cash inflow somewhere in the range of $70 million to $75 million and capital expenditures of approximately $30 million, including growth CapEx for FlyOver Chicago, a new mountain coaster experience at the Golden Skybridge and completion of the new Forest Park Hotel build."
}