{
    "symbol": "VVI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 13:34:06",
    "content": " As shown on Page 6, we delivered consolidated revenue of $382.7 million during the third quarter. GES adjusted EBITDA of $10.7 million, increased $14.9 million year-over-year and was near the high end of our prior guidance range as we continued to see strengthening of live event activity and great execution by the GES team. This is up $15.5 million compared to the prior year, primarily due to revenue growth, partially offset by enhanced staffing levels to support the return of consumer demand and our new experiences. Additionally, Pursuitâ\u0080\u0099s 2021 third quarter adjusted EBITDA included a $4.3 million Canadian wage subsidy benefit that did not repeat this quarter. Overall, the net positive impact on large non-annual events on GESâ\u0080\u0099 third quarter revenue versus 2021 was approximately $30 million, including about $7 million for Spiro and $23 million for GES Exhibitions. As compared to Q3 2021, GESâ\u0080\u0099 consolidated adjusted EBITDA of $10.7 million, improved $14.9 million on a revenue increase of $102.9 million. And as Steve mentioned in his opening remarks, GES drove a significant increase in profitability versus the 2019 third quarter when we had negative adjusted EBITDA of $2.8 million on a similar level of revenue. From 2019 through today, we have opened or acquired 11 new experiences at Pursuit that collectively delivered $38.5 million in revenue during the 2022 third quarter. As shown on Page 14, both GES Exhibitions and Spiro performed very well during the quarter with revenue significantly up year-over-year and in line with the 2019 third quarter. In addition to delivering strong top line results, GES also drove a substantial increase in profitability with an adjusted EBITDA improvement of $13.5 million compared to 2019 on similar revenue. On a same-show basis, revenue from our U.S. exhibitions was 91% of its 2019 level for the third quarter, as shown on Page 15, up slightly from 87% in the second quarter of 2022 and in line with our expectations. Through the third quarter, GES exhibitionâ\u0080\u0099s EBITDA margin was 6.6% versus 5.9% in 2019 with about $150 million less in revenue. During the third quarter, Spiro delivered results of $73.3 million in revenue and $4.7 million in EBITDA as client spending relative to 2019 remain strong. As shown on Page 18, we expect Pursuitâ\u0080\u0099s adjusted EBITDA for the 2022 full year to be in the range of $70 million to $74 million as compared to our prior guidance range of $70 million to $80 million. For the fourth quarter, we expect GESâ\u0080\u0099 adjusted EBITDA to be in the range of $6 million to $11 million as compared to $9.6 million in the 2021 fourth quarter. While we expect exhibition, same-show revenues and Spiro client spending at about 90% of pre-pandemic levels, we anticipate GESâ\u0080\u0099 overall fourth quarter revenue will be about 30% lower than the $279 million delivered in the 2019 quarter. Tyler, your line is open. Tyler, you may proceed. Tyler, you may proceed. Tyler, your line is open."
}