{
    "symbol": "VVI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-10 13:51:08",
    "content": " The re-measurement of this lease liability resulted in an FX gain of $804,000 during the fourth quarter, bringing the 2022 full year FX loss to $4.2 million. This is up 35% or $64.5 million year-over-year, driven by 46% growth at Pursuit and 34% growth at GES. Pursuit adjusted EBITDA was negative $11.3 million and came in slightly below prior year and our prior guidance range, primarily due to higher-than-anticipated expenses in the seasonally slow quarter. Fourth quarter revenue of $34.1 million grew $10.8 million year-over-year, with same-store revenue growth of $5.9 million or 32% and $4.8 million of revenue growth from New Experiences that we opened or acquired during 2021 and 2022. The New Experiences we opened or acquired during 2021 and 2022 delivered positive adjusted EBITDA of approximately $800,000 during the quarter, which is a $1.6 million improvement versus the prior year, reflecting the continued ramping of Sky Lagoon and FlyOver Las Vegas as well as the addition of the Forest Park Hotel, partially offset by seasonal losses from Glacier Raft Company and Golden Skybridge. GES' fourth quarter adjusted EBITDA improved by $3.1 million year-over-year, reflecting the increase in revenue as well as higher cost to support the more robust business activity. Viad's full year revenue more than doubled versus 2021 and consolidated adjusted EBITDA reached $116.1 million, up from $1.3 million in 2021. New Experiences acquired or opened during '21 and '22, contributed revenue of $43.2 million, adjusted EBITDA of $6.9 million and an adjusted EBITDA margin of 16%. On a same-store basis, Pursuit's adjusted EBITDA improved by $21.6 million on a revenue increase of $84.7 million or 49% and same-store adjusted EBITDA margin improved by 80 basis points. At GES, we delivered an adjusted EBITDA improvement of $91.6 million versus 2021 on a revenue increase of $507.7 million. Our capital expenditures totaled about $67 million for the full year and were mainly at Pursuit, including growth CapEx for the Forest Park Hotel, the mountain coaster at Golden Skybridge and FlyOver Chicago. We're proud to have delivered record quarterly revenue in each of the 4 quarters of 2022, along with 59% year-over-year growth in full year adjusted EBITDA. The 11 New Experiences that we've opened or acquired from 2019 through 2022, collectively delivered $88.1 million in revenue in 2022, which is nearly 30% of Pursuit's total revenue for the year. Refresh, Build, Buy is also about improving performance at existing experiences and we've been successful driving revenue growth at the experiences that were part of Pursuit prior to 2019.On a same-store basis versus 2019, Pursuit grew full year 2022 revenue by 5.5% despite pandemic-related headwinds as we remain focused on elevating the guest experience and price optimization. However, 2022 overall ticket revenue of $115 million grew by approximately 36% versus 2019 as we invested in new attractions and drove higher effective ticket prices. 2022 also saw strong revenue growth in our retail business, which increased 33% year-over-year to $33.5 million. In addition to delivering strong top line growth, GES drove a substantial increase in profitability during the fourth quarter with adjusted EBITDA of $1.7 million above the high end of our guidance range for the quarter. During the fourth quarter, GES Exhibitions delivered $143.6 million in revenue and $6.9 million in EBITDA. Given the strength of trade shows, I anticipate these companies will participate again in the future, but not until late 2023 or early 2024.Additionally, GES Exhibitions will experience year-over-year revenue headwinds in 2023 of approximately $20 million from our sale of ON Services and approximately $30 million from what we call negative show rotation, driven by the timing of major non-annual shows. Show rotation will turn positive in 2024, bringing an expected year-over-year increase in revenue of approximately $60 million for GES Exhibitions. As shown on Page 21, we expect Pursuit's adjusted EBITDA for the full 2023 year to be in the range of $85 million to $95 million as compared to $67.9 million in 2022. For the seasonally slow first quarter, we expect Pursuit's adjusted EBITDA loss to be in the range of $14 million to $11 million as compared to $11.5 million in 2022. Revenue is expected to be in the range of $28 million to $32 million, up from $23.8 million in 2022 with continued improvements in international leisure travel, removal of border restrictions into Canada and all signs pointing to a much stronger visitation in 2023. Revenue is expected to decrease about 5% year-over-year, primarily due to headwinds from sale of ARM Services, which contributed about $50 million in revenue in 2022 and negative share rotation revenue of about $30 million. For the first quarter, we expect GES' adjusted EBITDA to be in the range of $8 million to $11 million as compared to $2.7 million in 2022.Revenue is expected to be in the range of $195 million to $215 million, reflecting a relatively easy comparison to $153.6 million in the Omicron-impacted first quarter of 2022. For GES, we expect strong tailwinds in 2024 from positive show rotation of approximately $70 million and an anticipated full recovery of show sizes and corporate client marketing budgets."
}