{
    "symbol": "GBS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-09-01 18:40:27",
    "content": "  Operator: Greetings, and thank you for joining us for GBS, Inc's Fourth Quarter and Fiscal Yearend 2022 Financial and Business Update Conference Call. As a reminder, today's conference call is being recorded. Joining us on the call today are Dr. Steven Boyages, GBS CEO and Chairman of the Board; and Spiro Sakiris, Chief Financial Officer. If you'd like to be added to the company distribution list, please send an email to investor.relation@gbs.inc. Some of the statements on this conference call are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 Section 21E of the Securities Exchange Act of 1934 and the Private Securities Litigation Reform Act of 1995, which involves risks and uncertainties. Forward-looking statements on this call include without limitation GBS, Inc.'s ability to develop and commercialize diagnostic tests, realize commercial benefit from its partnerships and collaborations and secure regulatory approval, among others. Although GBS, Inc., believes that the expectations reflected in such forward-looking statements are reasonable as of the date made, exceptions may prove to have been materially different from the results expressed or implied by such forward-looking statements. GBS, Inc. has attempted to identify forward-looking statements by terminology, including believe, estimates, anticipates expects, plans, projects, intends, potential, may, could, might, will, should, approximately or other words that convey uncertainty of future events or outcomes will identify these forward-looking statements. These statements are only predictions and involve known and unknown risks, uncertainties and other factors included in the company's public filings filed with the Securities and Exchange Commission. During this conference call the company may refer to EBITDA, a non-GAAP measure. EBITDA is normally calculated by adding back tax income -- back income tax, depreciation and amortization to net income/loss. I would now like to turn the floor over to Dr. Steven Boyages, CEO of GBS, Inc. Steven, please go ahead. Hopefully you've had the opportunity to review today's corresponding press release providing an overview of our recent achievements, important upcoming milestones and financial results for the fourth quarter ended June 30, 2022. On today's call, I would like to point out the accomplishments of this most recent quarter, as well as reflect on all we've achieved over the last 12 months. I'd also like to provide an update on our exciting, ongoing engagement with Intelligent Fingerprinting Limited for the rights to its point-of-care fingerprint, sweat-based drug screening technology, presently focused on opioids and drugs of abuse. I will then turn the call over to Spiro, our Chief Financial Officer for a review of key financial metrics, including our preliminary yearend and fourth quarter results with updated forecasted cash burn. Following a reshuffling of roles early in the year, including my appointment as CEO and Chair of the Board, the entire GBS team has successfully achieved several key milestones previously forecasted, specifically as it relates to the saliva Glucose Biosensor as our lead asset. This study enrolled approximately 40 adults with Type II diabetes mellitus at the Diabetes Research Institute of Sutter Health Mills-Peninsula Medical Center in San Mateo, California, is being conducted to support clinical validation whilst also solidifying the direction of future clinical studies. I'm pleased to report that the results from that study were encouraging and in line with expectations, where blood, saliva glucose concentrations were consistent with previous studies. Meanwhile, we are moving into the final design and verification phase of Glucose Biosensor development, involving two key parallel clinical studies. With clinical development and regulatory dialogue proceeding at pace, we are concurrently establishing the manufacturing capacity to support further studies and prospective commercial supply. In June, we excitedly announced the selection of a site at the University of Newcastle in Australia for construction and operation of a new state-of-the-art proprietary Biosensor manufacturing facility. To add to this, our first batch of new equipment arrived on site, with the next installment of deliveries scheduled to arrive before end of September. This includes a new ink delivery system and a UV water purification system, both essential for the Biosensor production. We have also ordered a new inductively coupled plasma mass spectrometer, which we expect delivery early in the New Year. By yearend, we anticipate 60% of the equipment to have been delivered, with the remaining 40% due early in the New Year. Concurrently and while we continue to advance our saliva Glucose Biosensor effectively not only for glucose detection in diabetes, but also with research to develop new biosensors for hormone, tumor and allergen biomarkers. Hence while we've been in active engagement with Intelligent Fingerprinting regarding its point-of-care fingerprints, sweat-based drug screening technology focused on opioids and drugs of abuse. In June of this year, we announced execution of an exclusivity agreement with IFP for its fingerprint sweat-based drug testing technology. This agreement represents the precursor for a proposed acquisition of IFP that if consummated, would allow GBS to further solidify its leadership position in the rapid non-invasive diagnostic solutions, accelerate revenue growth and expand our portfolio of tests. I would also like to welcome Peter Passaris, GBS' new Director of Operations. And with 18 years of manufacturing and enterprise experience, Peter is exceptionally qualified to manage our Newcastle SRA and product development activities. He joins us most recently from Ecolab, where he served as Sales and Operations Manager, prior to which he worked as a Chemical Engineer in R&D before eventually moving into technical sales and operations. So with a warm welcome to Peter, I would now like to turn the call over to our CFO, Spiro Sakiris for a more detailed review of our third quarter financials. As of 30 of June, 2022, the company's cash, cash equivalents and marketable securities totaled approximately $8.2 million, compared to approximately $12.6 million on June 30, 2021. For the year ended June 30, 2022, the company had a preliminary net loss of $8.4 million or $0.57 per share, compared with a net loss of $7.3 million or $0.65 per share for the same period last year. Government support income was $437,000 and $1.98 million for the year ended 30 of June '22 and '21 respectively. Since our IPO, GBS has continued to bring forward expenditure on key resources and commercial partners to advance projects towards commercialization. The major categories include research and development and commercialization for the financial year of $3.8 million, compared to the year prior of $3.8 million also. Employee benefits expenses of $2.3 million compared to the prior year of $1.9 million, the increase being due to staff towards commercialization and development. GBS is of the view that based on the current operating plan and financial resources, its cash, cash equivalents and marketable securities at June 30, '22 will be sufficient to cover expenses and capital requirements into the second half of the 2023 calendar year. Obviously, you probably can't share all of them with us. And as you stated, we can't give you all of the details, but I'll get the Spirit to give you some of the key highlights going forward. Obviously, that'll come into play when people are actually using them after approval. From a technical perspective, it's a matter of then trying to improve the sensitivity of the strips by looking at the chemical and conductive layers within the strip. But so far, we're extremely excited by the initial results. Look, at the moment we just want to complete the IFP deal. Assuming that will be completed within the next month or two, our teams are going across to U.S. and then the UK as well to have a look at the Cambridge site where IFP is based. And once we have some management representation with some Board representation, from IFP and you  both point of view, then we will look at the Chief Executive position. But at the moment, it's business as usual. We're expanding, as you can see with our Director of Operations, Peter Passaris and Spiro Sakiris and Harry Simeonidis are doing a fantastic job. Yes, I wanted to just get a sense of that -- I actually can't remember what my first question was, but I was trying to get a sense of just cash burn and kind of how adding the new deal if you add on Intelligent Fingerprinting, how that's going to change cash flow going forward after they're layered on, assuming the deal takes place. Yeah, the key sticking points going forward. And then assuming it does get done, how's that going to change the cash flow view going forward, because I know there revenue is positive. So what that 31 of August deadline is, just to clarify, that is when the right to IFP to come into the exclusivity component of it. They -- after the 31 of August, they can then go forward and see through the exclusivity component of it. And we're just basically going through a lot of the detail, the fine points, are putting something together like this. And many late nights, John dealing with the different time zones and what have you, so but we're pressing forward. The second question, sorry, I think you were discussing in relation to the cash burn. So what's happening in the cash burn situation is a benefit with our cash burn is that we have clumpy nature of expenditure with R&D, with equipment and so forth. So what will happen is, we've got the ability to extend the cash burn in relation to that type of expenditure with the timing of that expenditure. So what we're looking at doing is once all goes well, we anticipate that the deal does come off, we'll be going back and doing pro formas and releasing that to the market, in relation to the impact on the cash flow, but bearing in mind that we do have that flexibility in relation to the clumpy and project-based nature of our expenditure. Okay, and then kind of along that same line, you're getting some funds to support the building of the facility. So what we've got with that is in relation to the building, so what's happening is the building -- the discussions are that the university will be putting the building up, and then we will be taking that on as a tenant. Now that's why we've started -- as Steve covered it before, we've started ordering the equipment, being mindful that we want to commission the equipment, have it going without losing time. Now that expenditure has already commenced, which is in the current cash flow numbers that we've been through. And then the timing of that coming in, the impact of that, as we make the expenditure, we get matched with that government grants of the MMI facility from the government dollar for dollar. So that's where the nature of the expenditure -- we're bringing forward the parts of the equipment that we need now, which are important, and then we're timing the rest of it by order of priority and matching the cash inflows and outflows as well too. Okay, and just going back to the -- I think you guys had mentioned that 60% of the equipment was going to be in before the end of the year. Yes, quantity, that's quantity. And what we're doing is the equipment is being staged according to A, completing the development stage. Probably yeah -- I would say for 2022, that's probably a fair estimate, sort of 50-50 Look, having said that may be more like 40-60 because the expensive items of equipment, which we're planning to do towards the end of that period. In closing, I just want to reiterate our continued commitment and strong belief in innovative actionable Biosensors for point-of-care monitoring diagnosis as being integral to the future of all healthcare. Those suffering from diabetes deserve more affordable, convenient and disposable testing options which GBS aims to deliver whilst also reducing costs to all stakeholders, including not only patients but providers and payers as well. Finally, I'd like to thank the entire GBS team for their tireless effort and dedication, along with patients and investigators from our studies. And equally, it's important the continued support of our shareholders."
}