{
    "symbol": "GBS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-10 21:15:20",
    "content": "  Operator: Greetings, and welcome to the GBS Inc. Second Quarter 2022 Earnings Conference Call. It is now my pleasure to introduce your host, Tim McCarthy of LifeSci Advisors, Investor Relations for GBS Inc. Joining us today from the company are Dr. Steven Boyages, Interim CEO and Chairman of the Board; and Spiro Sakiris, Chief Financial Officer. If you haven’t received this news release or if you’d like to be added to the Company’s distribution list, please send an email to Investor.Relations@gbs.inc. Some of the statements on this conference call are Forward-Looking Statements within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934 and the Private Securities Litigation Reform Act of 1995, which involve risks and uncertainties. Forward-looking statements on this call include, without limitation, GBS Inc’s ability to develop and commercialize its diagnostic tests, realize commercial benefit from its partnerships and collaborations, and secure regulatory approvals, among others. Although GBS Inc. believes that the expectations reflected in such forward-looking statements are reasonable as of the date made, expectations may prove to have been materially different from the results expressed or implied by such forward-looking statements. GBS Inc. has attempted to identify forward-looking statements by terminology, including believes, estimates, anticipates, expects, plans, projects, intents, potential, may, could, might, will, should, approximately or other words that convey uncertainty of future events or outcomes to identify these forward-looking statements. These statements are only predictions and involve known and unknown risks, uncertainties and other factors, included in the Company’s public filings, filed with the Securities and Exchange Commission. We undertake no obligation to update any forward-looking statements contained in this release, to reflect events or circumstances occurring after this date, or to reflect the occurrence of unanticipated events. During this conference call, the Company may refer to EBITDA, a non-GAAP measure. EBITDA is not, and should not be considered an alternative to net income loss, income or loss from operations or any other measure in determining operating performance. EBITDA is normally calculated by adding back income tax, depreciation and amortization to net income loss. I would now like to turn the floor over to Dr. Steven Boyages, interim CEO of GBS, Inc. Steven, please go ahead. We issued our second financial quarter 2022 preliminary financial and operating results, after the close of the market today. On today’s call, I would like to highlight the key developments that GBS team has made this quarter, highlighting specifically our clinical advancements, as well as development in the build-out of our high key manufacturing facility. I will then turn the call over to Spiro for a detail review of our financials, including our preliminary second quarter results and our forecasted cash burn. As GBS discussed in November, we prioritized the product development and manufacturing aspects growth. GBS remains focused on developing and commercializing, innovating new biosensors, the point of care model and diagnostic tests. As we build our portfolio validated evidence, we intend to demonstrate accuracy similar to other food-based methods, such as serum, blood or urine. To simply put, we believe on offering patients an affordable, convenient and disposable testing option for people with diabetes, we can increased compliance and frequency of testing to drive better outcomes for our patients. We want to reiterate, we have prioritized the development of our flagship product, the saliva glucose biosensor, towards that commercialization goal, and are actively working with our licensor toward regulatory approval in both North America and Asia. Now let’s review this quarter’s key highlights, where we made significant advancements. Firstly, in December GBS announced that its licenseor, Lifescience Biosensor Diagnostics, LSBD had filed an application with the U.S. Food and Drug Administration, FDA for breakthrough device designation. Secondly, the team has submitted that clinical trial protocol or institutional review board approval to the Mills Peninsula Medical Center in California, which will be responsible for executing this initial clinical trial enrolling 40 subjects. The objectives of this key study are to explore the relationship between salivary glucose and plasma glucose, as well as the time course data between the two testing modalities, using sophisticated glucose times testing in 40 subjects. Turning to our manufacturing advancements, following the recent grant of $4.7 million by the Australian Federal Government to fund the build-up of a high-tech biosensor manufacturing facility, GBS has begun sourcing required equipment. Discussions are underway between the University of Newcastle and GBS Inc. for the location, build out and commissioning of the new high-tech manufacturing facility. To the Australian Government’s announcement of a medical research commercialization initiative, GBS is in the process of evaluating and preparing expressions of interest towards further Australian Government Funding as we believe the GBS firmly fits into the objectives of this initiative. The initiative will focus on early stage translation and commercialization support, which funds support for early stage medical research and innovation projects with commercial potential. Now before turning over the quarter, our CFO Spiro Sakiris will discuss the financial second year financial quarter results. And while investors recite valuations and they needed for capital on an ongoing basis, we remain engaged and committed to driving returns for our stakeholders. Finally, we would like to thank you for your support and look forward to sharing our successes as we see. With that I would like now turn the call over to our CFO, Spiro Sakiris for more detail review of our second quarter financials. For the quarter ended December 31, 2021, the Company had a preliminary net loss of 3.46 million or $0.23 per share, compared with a net loss of 1.9 million or again $0.23 per share in the same period last year. This is predominantly due to the acceleration of development and commercialization expenditures, which includes the expensing of 2.6 million of prepaid R&D contributions, which had been funded in the previous year. Government support income was 177,791 to the three-months ended December 31, 2021, a decrease of 55,427 for the same period ending 2020. As at December 31, 2021, the Company’s cash, cash equivalents and marketable securities totaled approximately 11.19 million, compared to approximately 12.57 million on June 30, 2021. As of December 31, 2021, the company had 14.88 million shares outstanding. Despite equity capital market conditions of light, the company continues to be favorably positioned financially and has multiple funding resources and strategies with over 10 million in the bank. GBS is of the view that based on the current operating plan and financial resources, its cash, cash equivalents and marketable securities as of December 31, 2021, will be sufficient to cover expenses and capital requirements into the first half of 2023. With that overview of our financials, I will now turn the call back to the operator to open the line for questions. Ladies and gentlemen at this time, we will be conducting a question-and-answer session. Thanks for the quick rundown on progress on all the fronts and a few other items I wanted to follow-up on are just the partner identification for the Chinese markets, I know that you are making progress there and wondered if you have seen any other progress since our last update. So basically the list as we have identified before, there is a short list discussions, commencing as we identified before that we are not reposition at the report and conclusive as stages are. And then on the COVID side, I know you are working with Wyss Institute and we are progressing some validation efforts there. John, we understand that the progress is excellent as we announced previously to the market. We are expecting further announcements within the next quarter, but at this stage, No. And you did give us an update on the next step for the glucose sensor the trial, 40% trial. I guess is that what - after you complete that, I think you provided a date of July 2022. And we are looking at what we call glucose tolerance testing, that is where we of the glucose loads of individuals. And we measure, both in plasma, capillary blood, venous blood and in saliva, the glucose parameters. So, we can set up an effective gold standard and we are using mass spectromety to actually be able to validate those measurements at this point in time. So, there are some ongoing studies beyond that, but they will lay support to our future submissions. The gold standard for the market is, we wanted to have plus or minus 15%. So, we know that saliva the glucose measurement will be a couple of log orders lower, but as long as we can differentiate between low, normal or high then the absolute magnitude of difference between blood and saliva won’t be an issue. And then, we have seen the COVID test number spike with the recent Omicron and then they are kind of rolling over. Look, I think as much as of us are suffering from fatigue from COVID, I don’t think it is going to go away rapidly. And I think as we get better understanding of the illness characteristics and the need for understanding, who is immune and who is not immune, who is infected, there is going to be a great need for laboratory testing for both COVID antigen and COVID antibodies. Hey, Steven and Spiro, thanks for taking our questions. Wondered, if there is any update on that and whether you received feedback from the FDA. So basically it is the pre-submission the waiting for response back from FDA, in relation to their work or their work was quite - quite busy in relation to the COVID so there’s no further progress on that yet. Regarding the manufacturing facility, and we are excited to hear updates on that. Yes, so basically, what we are doing, the first step is, in relation to that, as we mentioned in the announcement, we are looking at getting the first stretch of equipment across which the objective is that we will install that on Newcastle University’s premises. Now, the objective of that will be to expediate the progress of the commercialization and then at the same time, the commissioning that property, the equipment. Now, what happens is once we did that commissioned and that by doing that, we are not delaying time in relation to ultimately getting the factory up and going. So whilst we are sourcing the site, finalizing the site, we are getting that work done on that equipment and getting the tutor unparalleled so we operating it as efficiently as possible. Just add to that, I mean, that is just in case people aren’t aware the innovation and the founders are actually at the University of Newcastle. I noticed that the development and regulatory expenses were a little bit below trend in the first quarter, it seemed to be above trend in the second quarter, just want to see if those were timing issues that led to that. The nature of the expenditure is not even if it is very concrete, depending on milestones that have been delivered by the research partners. So we have included in that, which I referred to in the announcements and was talking, that we do have an expensive list and prepaid R&D of about 2.6 million that R&D was funded in the previous year. So I would say, look it is difficult to say to average to project forward, because you have already isolating it to six months, and very, very clumpy in nature. I have used that as a staff, but then just to keep an eye on our reporting and possibly update that as we have got updates on the R&D expenditure. Because my forecast actually, kind of average the first six months and uses up the same amount in the second half of the year. Keep that on for the time being and then like I said, it gets updated as we get further releases."
}