{
    "symbol": "GBS",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-11 20:44:06",
    "content": "  Operator: Greetings, and welcome to the GBS Inc. First Quarter 2022 Earnings Conference Call. It is now my pleasure to introduce your host, Tim McCarthy of LifeSci Advisors, Investor Relations for GBS Inc. Joining us today from the company are Dr. Steven Boyages, Interim CEO and Chairman of the Board; and Spiro Sakiris, Chief Financial Officer. If you haven't received this news release or if you'd like to be added to the company's distribution list, please send an email to Investor.Relations@gbs.inc. Some of the statements on this conference call are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934 and the Private Securities Litigation Reform Act of 1995, which involve risks and uncertainties. Forward-looking statements on this call include, without limitation, GBS Inc.’s ability to develop and commercialize its diagnostic tests, realize commercial benefit from its partnerships and collaborations, and secure regulatory approvals, among others. Although GBS Inc. believes that the expectations reflected in such forward-looking statements are reasonable as of the date made, expectations may prove to have been materially different from the results expressed or implied by such forward-looking statements. GBS Inc. has attempted to identify forward-looking statements by terminology, including believes, estimates, anticipates, expects, plans, projects, intents, potential, may, could, might, will, should, approximately or other words that convey uncertainty of future events or outcomes to identify these forward-looking statements. These statements are only predictions and involve known and unknown risks, uncertainties and other factors, included in the company's public filings filed with the Securities and Exchange Commission. During this conference call, the company may refer to EBITDA, a non-GAAP measure. EBITDA does not and should not be considered an alternative to net income loss, income loss from operations or any other measure for determining operating performance. EBITDA is normally calculated by adding back income tax, depreciation and amortization to net income loss. I would like now to turn the floor over to Dr. Steven Boyages, Interim CEO of GBS Inc. Steven, please go ahead. We issued our first financial year quarter 2022 preliminary financial and operating results after the close of the market today, and I hope you've been able to review them. On today's call, I'll begin with an update on our leadership changes and highlight GBS achievements to date that were announced last week. I'll then turn the call over to Spiro for a more detailed review of our financials, including our preliminary first quarter results and our forecasted cash burn. As GBS announced last week, we've accelerated and prioritized product development and manufacturing, which have resulted in changes to our organization and leadership structures, which I'd like to walk you through now. By ensuring that we have the best team to execute our strategic product and operational plans, we can continue to drive shareholder value in the long run. As such, and in order to bolster the company's existing management capabilities, the Board announced that Harry Simeonidis has transitioned his role over to President of Asia Pac, Sales and Marketing to focus on the emerging Asia Pac markets due to his vast experience and skill set developed over his 25 years tenure in the region. Until that time, I'm committed to working with our management team as Chief Executive and Chairman to drive GBS forward. On behalf of the Board and management team, I want to thank Harry for his work in advancing our company and we appreciate his continued support. Our proprietary technologies revolve around saliva-based testing approaches, which we intend to demonstrate are as accurate as other fluid-based methods such as serum, blood and urine. We believe by offering patients an affordable, convenient and disposable test strips, we can drive increased compliance and frequency of testing to drive better outcomes among people living with diabetes. One of the key differentiating factors of GBS’ biosensor is that this platform technology uses a proprietary organic thin film transistor technology or abbreviated OTFT, which can be applied across different testing modalities. As such, we have identified approximately 130 additional diagnostic tests and evaluated the commercial potential in multiple geographic areas around the world. As we look out into 2022 and analyze our forward-looking portfolio, GBS is prioritizing two lead product candidates towards commercialization. Firstly, our flagship product candidate is the novel saliva glucose biosensor, a convenient point of care test expected to substitute for the invasive finger pricking blood glucose monitoring for patients living with diabetes. Secondly, our saliva SARS-CoV-2 antibody test candidate which will provide real-time quantitative detection of SARS-CoV-2 (COVID-19) virus antibodies. Firstly, saliva glucose biosensor. In the subsequent quarter, we made significant advancements in the development of the clinical action plan. At a very high level, this three-step prospective clinical action plan comprises the following. Firstly, to define the relationship between saliva and plasma glucose as well as the time course between the two; secondly, the development of the algorithm between plasma and saliva glucose; and thirdly, to validate the algorithm and generate prospective data for full regulatory approval. GBS was recently identified for a competitive grant award by the Australian government under its Modern Manufacturing Strategy, MMS. This non-dilutive capital is incredibly important to the next phase of manufacturing development, in which GBS can accelerate product development through the purchase of several important technical machinery and equipment. Finally, I want to return to our second key biosensor strategy which is the saliva SARS-CoV-2 antibody test. Turning to GBS' financial year first quarter financial results, which our CFO, Spiro Sakiris, will discuss in greater detail shortly, I just want to highlight that we continue to exercise fiscal restraint and responsibility as we emerge from the COVID-19 pandemic. With that, I would now like to turn the call over to our CFO, Spiro Sakiris, for a more detailed review of our Q1 financials. As Steven mentioned, Q1 was an impressive period of advancement and development of GBS' biosensor-based point of care tests but also for GBS' growing organization. For the quarter ended September 30, 2021, the company had a preliminary net loss of 1.4 million or $0.10 per share compared with a net loss of 1 million or $0.12 per share in the same period last year. Government support income was zero for the first three months ended September 30, 2021, a decrease of $55,427 for the same period ended 2020. As of September 30, 2021, the company's cash, cash equivalents and marketable securities totaled approximately 12.6 million compared with approximately 12.57 million as of June 30, 2021. As of September 30, 2021, the company had 14.88 million shares outstanding. GBS is of the view that based on the current operating plan and financial resources, its cash, cash equivalents and marketable securities at September 30, 2021 will be sufficient to cover expenses and capital requirements into the first half of 2023. Look, it’s a good question and it's good to be able to talk to you directly. I have an extensive clinical research, technological, IT background. And as we're moving now into our next phase beyond our establishment, we wanted to bring a greater focus on the execution of our two key clinical programs, as well as our relationships with other partners. So we see this as building on what has been achieved to date, rather than a distraction or a changing direction. It's generally an acceleration of effort, and we believe that we should be able to put forward a superb team going forward into the next quarter and beyond. Look, my view is that we should be doing this in the next three to six months. Given our focus, particularly in the U.S., we'd be particularly looking for a U.S. candidate to work with our teams there on site. But again, we're not going to compromise quality for timeliness. We are in the holiday period, particularly in Australia, but that's not going to slow us down. Look, that's a key milestone for us. And today, he is in California, two clinical research facilities, looking to build relationships to begin that key work of correlation between not only saliva, but gingival fluid as well as comparison to gold standards of venous blood, capillary blood and interstitial fluid. Right, and we're very excited by that pre-submission package to the FDA. I think there is at least one more that you have to perform as well before you’re --\n Look, the studies are there in the development of the algorithm in terms of being able to present that data to the device, so that the patients will hold. That will require the product development, the production model of the sensor, but it's currently being prototyped. Look, I might just make some comments  and then pass it across to Spiro. It may not sound like a lot of dollars from a U.S. perspective, but $4.6 million grant in Australian terms is a huge amount of funding. So what we're looking at that, since the grant’s been announced, we've been concentrating on finalizing the site. And with that process, the important part of that process is that the role of the manufacturing facility -- it has a few roles. And this allows us to get together the processes, and most importantly, the quality control. Once we've then put these protocols together, this will then give us a blueprint in relation to manufacturing that we need to do in our other territories, be it contract manufacturing, be it direct manufacturing. The 4.7 that's coming in, we've got that -- the grant is based on dollar-for-dollar matching. And with that cost, it’s included in our budget equipment, you've got the labor component, because the job creation is a very important part of the grant. Yes, I'll have those details in Q1, which is in the process Q1 next year before March."
}