{
    "symbol": "EQR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 15:11:05",
    "content": " We're negotiating a little bit more, but that's clearly typical for the fourth quarter and have a pretty strong degree of confidence that we're going to continue to achieve about 8% to 9% in growth from the renewals. Well, I mean, I think, look, if you backed us up a few months ago, where our expectations were for 2023, and I think I alluded to it in the comments, I mean, we've got 2 markets right now that are exhibiting a little more price sensitivity than what you thought. So I think as we think about 2023 for those markets, I said in the prepared remarks, I still believe there's a lot of potential for those markets to deliver strong growth, we just need a little bit of clarity on that job front, a little less ambiguity. And I think in San Francisco, what you saw is the South Bay really kind of benefited through the year even though it was delivering all of that supply and right now, my guess is what we're feeling is a little bit of pressure from that hangover supply in the South Bay. I think the most prevalent or probably the area that you see the most pressure already is really in some of our expansion markets, particularly Texas, where you're seeing an aggressive amount of kind of reassessment activity and kind of push. So it would require us to think about another risk differently, too, and that's political risk because one of the things that our coastal markets have, I think, more of though maybe not quite as much of as we may have thought, is risk of rent control, risk of activity by politicians that's job destroying and growth destroying. So that occupancy -- that physical occupancy coming back into the market and us kind of capturing it like Michael just mentioned, is a dollar for dollar, 100% upside to financial results because whether it's $0.50 less a month or before, it's a full rental payment more than what's going through the financial statement. My guess is, and I'm not -- and maybe you can help me a little bit on how you're getting to your number is that you're maybe taking -- taking blended rates and kind of averaging blended rates over the year and coming up with that number is my guess on how you're coming with your 50 basis points higher than what our embedded number is. If you're looking back to that summer period and saying, boy, you guys were 11% or 12%, and now you're sitting down closer to 5%, you need to remember that the majority of this decline is this seasonality that you can kind of see evident on Page 4, but also every lease and every renewal that we have done since that point, we are capturing that Loss to Lease that we shared from a while ago. I look at like overall, I will tell you, when you just look and Mark alluded to this in his prepared remarks, is the health of the new residents moving into this portfolio from an income standpoint, our income -- rent as a percent of income is right in line at 19%, which, to me, kind of points to this fact that these new residents moving in are clearly going to be able to absorb kind of future increases that we push through into the portfolio. I think clearly, when you look at like a Seattle, San Francisco and some of these urban markets, we continue to see this trend where we are drawing in new residents from a wider area from outside of the states, from outside of the MSAs, which we view as a positive, meaning that these markets are continuing to draw people from all over kind of the country and even the foreign markets."
}