{
    "symbol": "EQR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 15:41:20",
    "content": " Translating all this into the numbers, first quarter same-store revenue results were about 125 basis points lower than we anticipated due to these higher bad debt, partially offset by about 25 basis points of better rate growth, leaving the final quarterly same-store revenue number about 100 basis points lower than we expected when we gave you guidance back in very early February 2022. As we begin our primary leasing season, we feel really good about our pricing position, which includes the near elimination of concession usage across the portfolio outside of Seattle and is translating into robust new lease change performance with April on track to deliver just over 17.5% new lease growth after posting over 15% in the first quarter. So our initial guidance back in January assumed that we would based on kind of our experience in the fourth quarter, to be honest with you, that I just mentioned thought that we would before rental relief start seeing improvement in the first quarter and then accelerate improvement, meaning more people paying or just moving out as we went through the remainder of the year. But if we would just step back and look at where we are for April and May and even preliminary June, we’re still putting out quotes that range somewhere between 14% and 15% for these months, which is probably about 200 basis points stronger than what we originally contemplated, which is just this intra period kind of strength that we see. Some of the assets we’re selling, we intended to sell well before the pandemic for tax abatement reasons 421a type reasons or ground leases or whatnot, but it is also part of just diversifying into some markets that may be a little less political risk and having a company that can have a little less volatility and compound cash flows more reliably going forward. And I guess I'm just wondering if you have any early read on how some of those conversations are going in terms of the resident who got a bunch of free rent is now being pushed up to market, and what's happening – the market itself is very tight, so maybe the person can move, but any sort of anecdotal color you're hearing on that topic would be helpful. So the absolute number of residents leaving to go buy home is materially down, and the percentage ticked down to about 11.5% of move out citing that reason pretty much in line with our historical norms of like an 11% to 12%, but reduced from like the 15% that we were seeing in the fourth quarter and third quarter of last year. I think right now what you're starting to see is just the supply constraints, the cost of single-family housing in our markets, rising mortgage rates, we expect that is going to keep this percent at a very low end, which really eliminates pressure on move-outs from this reason going forward. So I think the way I would look at this right now, if I think about intra period rent growth, the markets that I kind of alluded to in my prepared remarks that are really kind of outperforming expectations of New York, San Francisco and LA, relative to San Francisco right now, you're just now starting to see some of that pricing power come back. So really it's the strength of this intra period rent growth that has allowed us to maintain this loss to lease at a very high level sitting here in April, even though we just captured a whole bunch of it in the first quarter through this renewal and new lease process that you can see when you look at that blended rate that we reported for the quarter. And I think as we mentioned in the past, we're not going to be able to capture this full 11% this year, but the fact that this number remains 11% and is higher than what we otherwise would have expected it to be in April, really does put us in a great position for the portfolio, not only to contribute into 2022 revenue, but position it for 2023 to have stronger embedded growth. Rent as a percentage of – no, we're keeping in track generally low 20% rent is a percent of income and as we've talked about in the past, we're really finding the same general kind of renter who's working in the same general knowledge based industries. And really when you look at move-ins from the first quarter, the only change that happened was New York that used to be the absolute low point at 17.5% ticked up to 18%, which still shows that from an overall affordability standpoint, those residents are going to be able to absorb additional increases."
}