{
    "symbol": "FMX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 17:11:09",
    "content": " On your other question about what we're trying to achieve going on the road, I mean, obviously, what we communicated last week is relevant and meaningful, and it prompt a lot of questions, and it certainly deserves going and meeting with -- some of our biggest investors, we're going to be meeting with many of you guys and also with investors that for one reason or another have not been invested in FEMSA, but that historically should have or have been kind of because of the good fit between their portfolios and what our company is. And I mean, clearly, as we look at our businesses, on the one hand, Coca-Cola FEMSA with the tremendous knowledge of the traditional market with also with OXXO -- with tremendous relationship with the suppliers, knowledge on how to do the peaking as I explained once in terms of how many cases or how many products, how many units each individual store will need. And I think also, Ken, you mentioned during the last week call that, I mean in terms of additional value creation to open 1 stores in OXXO in Mexico, obviously, is one of the most profitable investment that we can make. So we're being a lot more strategic and a lot more targeted in pinpointing the right points so that the net new stores that we're adding are being a lot more productive than the ones we were adding before plus, I mean, all the efficiencies that we gained during the pandemic, all the learnings about, I mean, opening hours, about shifts about changing supervision patterns, about inventory stocking segmentation, et cetera, have produced these all-time high ROICs at the store level and at the whole country level in Mexico. I mean, obviously following on what Daniel and Eugenio just said, scale being a big part of the, let's call it, secret sauce that eventually allows other very good things to happen when you kind of know what you're doing in terms of openings because we did say in the beginning Eugenio mentioned, we came a little bit short of the 800 target in Mexico. But in the cost businesses, we're seeing also a lot of growth given the long-term relationship model that we have with the Coca-Cola Company and how that is incentivizing us to -- I mean, to grow in all the categories, both of CapEx and including -- I mean, production lines but more importantly, more coolers, more bottles and cases and that."
}