{
    "symbol": "GWH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 23:27:06",
    "content": " Joining me on the call from ESS are Eric Dresselhuys, CEO; and Amir Moftakhar, CFO. Following management's prepared remarks, we will hold a Q&A session. Earlier today, ESS released financial results for the third quarter of 2022. As a reminder, the information presented today will include forward-looking statements, including without limitation, statements about our growth prospects, partnerships, financial performance and strategy for 2022 and beyond. In particular, those described in our risk factors set forth in more detail in our most recent periodic reports filed with the Securities and Exchange Commission as well as the current uncertainty and unpredictability in our business, issues with our partnerships, inflation, the markets, the economy, and the current geopolitical situation. Management uses non-GAAP measures internally to understand, manage and evaluate our business, and make operating decisions. With that, I will now turn the call over to ESS's CEO, Eric Dresselhuys. Today, I will discuss our success with current and new customers, our operational challenges and successes, as well as recent market trends we're seeing, including the impact of the Inflation Reduction Act. ESS continued to gain traction across multiple fronts of the business in the third quarter, and the entire team here was thrilled to see our market buoyed by the tailwind of the Inflation Reduction Act. We continue to build a cohesive, highly skilled team capable of delivering a differentiated storage technology at scale that is ideally suited to couple with renewable generation in the global drive to carbon neutral. We're doing this in an unprecedented supply environment, just as the market we serve is expanding dramatically. First, I'm pleased to share that ESS has made great progress on our extremely important initiative to expedite the time between product shipment and revenue recognition. On the shipment front, we delivered an Energy Warehouse to our partner TerraSol Energies near the end of Q2 for Sycamore International, a Pennsylvania based technology recycler that integrated it with a solar array, and we were able to recognize revenue on that unit in less than three months. Importantly, TerraSol placed a follow on order for another Energy Warehouse at the Sycamore site to double their storage capacity, a strong indication of the unique value we can deliver. With that said, we have continued to experience supply challenges with a variety of components across the Energy Warehouse balance of plant. We continue to build Energy Warehouses, but the nearly finished units are sitting in our production bay awaiting the parts that are delayed. While we didn't ship as many units in Q3 as we had hoped, we had many others in various stages of completion in the third quarter and we feel we can ship 20 or more EWs in the fourth quarter. But importantly, we still feel confident in our ability to get to our exit run rate by the end of the year. As a reminder, we generally speak about production in two categories: battery modules, which represent our core intellectual property; and balance of plant. On the battery module side, we now have two semi-automated lines running and have our fully automated line slated to be up and running before the end of the year. As our team works to optimize each of these lines to improve cycle time, scalability and cost, we now have line of sight to exit 2022 with a capacity greater than our original target of 750 megawatt hours per year. On the balance of plant, we continue to make progress with our design for manufacturability initiatives that speed throughput, improve quality and lower labor and its associated costs. At the end of the third quarter, we have already cut the labor inputs to Energy Warehouses by half from the start of the year and expect considerable additional improvements by the end of the year. Importantly, I want to give a big shout out to the team that is working tirelessly to execute these improvements against the challenging supply backdrop. I am thrilled to see the many new faces that have joined ESS in 2022, gel with the existing team to drive our progress. While California's objective is to have a carbon free electricity generation by 2045, SMUD is targeting 2030, 15 years earlier than the rest of the state. Additionally, as another sign of the significance of this transaction, ESS and SMUD will team up with local colleges and universities to establish a center of excellence to educate the workforce needed to install and service the burgeoning long duration energy storage market. And as exciting and transformative as this deal is, let's put in perspective in terms of the market size. In fact, California represents roughly one-tenth of the storage power needed in the U.S. which is estimated to be about 50 gigawatts. As utilities in jurisdictions around the world progress their decarbonization plans, it will quickly recognize the critical role of long duration energy storage in achieving their goals. In fact, I was in Australia just last week, attending the All-Energy Australia Conference and could not have been more impressed with how the entire market is moving forward to drive decarbonization and accelerate the demand for long duration energy storage. When combined with the SMUD agreement, we've established a meaningful base of business for ESS. Now that it has been signed into law, it is clear that the IRA will have a dramatic impact on deploying technologies like ours along with many others to decarbonize the domestic energy system. With an additional kicker possible for siting the project in an economic or energy development zone, our customers could receive a total tax credit of 50% or more. On top of that, our customers can also apply for certain available grants; and if approved, that can knock more than two-thirds off their total project costs, approaching 70% savings. Additionally, ESS is expected to receive a production tax credit of about $45 per kilowatt hour that we ship, while solar plus storage without incentives was already regarded by many as a better capital investment than other generation options. Coupled with the increasing prices for storage that we're seeing in the market today, we believe this can provide a considerable accelerant to our growth and profitability objectives. With all of this excitement in our business and the market, it's bittersweet to announce that the Amir Moftakhar will be leaving ESS. We've included details in the press release, but I'll quickly say that Tony brings extensive experience across a range of industries and we are delighted to have him join the leadership team. Before I review the financials, let me say that it's been my unique pleasure to serve as the CFO of ESS for the past four years. As I transition other opportunities, I'm proud of the team we've built and have confidence that my successor, Tony Rabb, will continue and accelerate on the momentum we've built. Unless otherwise noted, all numbers we talk about today will be on a non-GAAP basis. As Eric shared, ESS continues to gain momentum with our manufacturing initiatives, as well as with customers. Near the end of Q2, we shipped the unit to developer TerraSol Energies, and we were able to commission, gain acceptance and recognize revenue on this unit in less than three months. As we've shared, we've been very purposeful on our process in achieving revenue recognition as we balance legacy customer contracts, initial field experience deploying our S200 battery module and ramping up our Customer Success organization. This accelerated revenue recognition timing reflects progress that we've made across each of these fronts, and we are committed to honing our process further and working with our customers to further speed up the process. As a reminder, we remained under development accounting rules in Q3, so the material overhead and labor costs we incurred in producing the products we shipped fall into OpEx resulting in zero cost of goods sold. And they continue to make outstanding progress not only improving our current manufacturing operations, but also setting the stage to scale manufacturing as we move beyond our two semi-automated lines to our first fully automated manufacturing line. As Eric mentioned, we believe the team's innovation and focus on optimizing processes should result in ESS exiting 2022 with a capacity greater than our initial goal of 750 megawatt hours. Given our current plan, and the assumption that we will remain under development accounting for the rest of the year, we continue to expect our non-GAAP operating expenses for the year to come in at around $100 million. As we execute our plan in the coming year, we currently have ample liquidity to run the business and expect to end the year with cash, cash equivalents and short-term investments in excess of $120 million. Well, it's still a relatively limited data set, so I don't know that we've learned anything entirely conclusive. We have learned a lot about the system deliveries, shipments, hardening the product, so it goes through the transport process. But at this point, I don't know that we have any broad conclusion around system performance over any extended period of time. Yes, it's a little ahead of expectations. So as Amir mentioned on the call, we're tracking for slightly better total capacity availability at the end of the year than we had anticipated. It's just around the labor cost reductions with the lines, I mean, it's great to see the 50% recognized as of this quarter. I mean, look, we're in the process of commissioning our automated line now. So I think, -- directionally, I think that those targets still hold. I think once we get the line up and running and finalize some of the processes around that, we'd be able to better speak to if that number would need to be updated or not. I think the summary is, there's a significant cost out opportunity that remains with what's driving labor out and we're right in the middle, right in the heart of determining exactly what that is. And I'm wondering is it still a lot of the increase, four systems that would be kind of in that still two-four hour range. I think, Thomas, we've seen more longer duration requests certainly in some of the more advanced markets, whether it's California or Australia where it just was last week. Any of the markets that are further developed on the renewable penetration curve are all starting to ask for longer six, eight, 10 hour duration storage. Well, as you know, we've just come on the one-year anniversary of the listing. There are no immediate plans to take on any specific fundraising activities around that, but we wanted to ensure that we're in the right position to act if and when the time comes. First, just to go back to some of those parts that you are -- products that you're waiting for final parts. And then on a related note, obviously, you've recognized one for revenue. So in terms of the units we have here, we've got seven or eight units that are effectively complete waiting final acceptance and about another 20 units that are on the floor kind of in various stages of completion waiting for those overdue parts. So certainly relative to what's been deployed, which is in total now about 10 units, it's a pretty substantial step up. We've recognized revenue for four of those units, so it would be the initial SoftBank unit, the two Applied Medical units and then the TerraSol unit that we've shipped, the SDG&E project because that's a microgrid. We don't know what the final exact number will be, but our hope is to get something in the neighborhood of 20 of those rolling to customers before the end of the year. It's nice that you just recognized revenue on one unit because now we know what the ASP is, even I can figure that out. And so I think the market has moved considerably both because of things like the Inflation Reduction Act, but just the general market pricing. So it also depends, of course, a little bit on what the scope of our deliverables are under a contract if it's just a standalone unit, or if there are other services and components along with that. So it's not a mile off, but it would probably be to the lower side of what we would expect going forward. Kind of curious, nice to see that acceleration in revenue recognition for the unit in Pennsylvania. With our newer contract terms, I think those will accelerate the way that the most recent unit did. I think to the extent that they are legacy customer contracts and/or there's a larger microgrid project component, I think those need a little bit more time and care just to get them up and running and commissioned in a little bit more purposeful cycle. So certainly, over time, I think what you'll see is, our contract terms have changed, those will get more favorable through the revenue recognition process. And just as we build a history of delivering and shipping to these customers, it will all continue to accelerate, whether it's a single unit or a project, then we'll just take some time to work through. We haven't had anybody call us and say please don't ship the product, because I'm waiting for IRA. We expect that those will be published before the end of the calendar year, and that the tax impacts on both the ITC and the PTC will be in effect for the full length of calendar year '23 and tax year '23 maybe in this case more specifically. So if anything, I think we're seeing people feel urgency now to say, â\u0080\u009cAm I going to be able to get products?â\u0080\u009d Because the anticipation is that there will be a surge in demand and there will be a near-term scramble for capacity -- product capacity for projects they need to deploy in the â\u0080\u009823 and â\u0080\u009824 time frame. I suspect that if you did a survey of people across the spectrum of project developers, they would tell you that they expected to continue to be tight in the near-term. And the second advantage that we have is for some of the larger projects that we're involved in, the partner -- the developer partner is taking care of or already managing that interconnect queue. We're very excited about the continued progress in the market, excited that we're building at an accelerating rate, and look forward to finishing the year strongly as we head into 2023, which we believe will be a very important year of growth for ESS."
}