{
    "symbol": "GWH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 23:15:20",
    "content": " At this time, all participants are in a listening only mode. Later, we will conduct a question-and-answer session. Joining me on the call today from ESS are Eric Dresselhuys, CEO; and Amir Moftakhar, CFO. Following management's prepared remarks, we will hold a Q&A session. Earlier today, ESS released financial results for the first quarter of 2022. As a reminder, the information presented today will include forward-looking statements, including, without limitation, statements about our growth prospects and strategy for 2022 and beyond. In particular, those described in our risk factors set forth in more detail in our most recent periodic filings filed with the Securities and Exchange Commission, as well as the current uncertainty and unpredictability in our business, the markets, the economy, and the current geopolitical situation. And we disclaim any obligation to update any forward-looking statements, except as required by law. During this call, we will also present certain financial information on a non-GAAP basis. Management uses non-GAAP measures to internally understand, manage and evaluate our business, and make operating decisions. With that, I'll turn the call over to ESS' CEO, Eric Dresselhuys. We continue to build and ship energy warehouses, while increasing capacity and lowering unit costs. In the first quarter, we shipped two energy warehouses to San Diego Gas and Electric and expect to complete our deliveries in the next week, The Cameron Corners micro-grid project. In this deployment, six of our EWs will be used for energy shifting as well as supporting critical services during power safety shut offs, including a health centre, a library, a fire station, a school, two gas stations and a small retail strip. While we began 2022 slowed by the supply chain challenge that faced the globe, we have navigated the industry wide challenges and have strong confidence in our trajectory. In addition, while our supply chain electronics was less than optimal starting the year, we now feel we have a strong handle on securing the necessary components and expect to deliver on our production schedule. Additionally, our design for manufacturing cost reduction is progressing well. Combined the automated line and the DFM efforts should lower labor input by more than 80% for each unit shipped, while dramatically improving production throughput. Despite the advances we made in supply chain and production improvements, as you saw in our earnings release, we did not recognize revenue in the first quarter. Although we had a number of units shipped installed and working at the sights of our first customers in Q1, we ran into several unanticipated challenges that delayed our ability to recognize revenue on these units. While we continue to make considerable progress across the operations of our company, further developing, our delivery and customer success team is a high priority. As you have probably seen despite considerable macro uncertainty, the market dynamics for long duration storage continue to shift in our favor in a way we simply could not have imagined just a year ago. With the growing desire for energy independence, we are seeing countries pulling the timing of their carbon reduction goals. As an example, in April, the German government approved plans to have renewable energy comprised at least 80% of its energy generation by 2030 with a shift to nearly 100% by 2035. As a testament to the importance of grid storage to their plan, the German government came together to eliminate key administrative hurdles or its deployment. They broke out storage on its own and it now joins generation, transmission and consumption as the four activities conducted on the electrical grid. Additionally, Ireland's government pulled in its grid decarbonization goal to produce 80% of its energy with renewable sources by 2030. RWE a German multinational energy company has committed to invest up to €1.5 billion in Ireland, some current projects being developed. Elon Musk himself also recently posited that for the entire world to transition, transportation, electricity and heating and cooling to clean energy, we will need 300 terawatt hours of storage. Importantly, the headlines about how the earth will need hundreds of terawatt hours of storage are filtering through to our conversations with customers current and perspective not only about their immediate needs, but also what they expect to deploy in just the next few years. We're hearing from Blue Chip tier one customers talk about their peers that they will not be able to secure the energy storage capacity they need, because global supply will not be great enough to meet the demand. In fact, incumbent storage technologies are facing a much more uncertain price curve than they did even six months ago, making our solution one that stores and releases energy with iron, salt and water. While we have facing challenges in our ramp, we believe we are on track to be the most viable lithium alternative grid energy storage system available. To do this, we will need to continue to hone in scale our manufacturing operations while reducing unit cost. Through all of this, we currently are in and tend to remain well capitalized. And with that, I'll hand it over to Amir to cover the financials. Unless otherwise noted, all numbers we talked about today will be on an adjusted non-GAAP basis. You will find the reconciliation of GAAP to non-GAAP financial measures on our earnings release, which is posted on our Investor Relations website. We shipped two energy warehouses and the first quarter to San Diego Gas and Electric and by next week, we expect to ship them our second EW this quarter. This will complete an order for 6 EWs in total that will help SDG&E to power a micro grid that they are deploying to support critical services in Cameron Corners, California. With regards to the three units we shipped to two other customers prior to Q1, we did not recognize revenue in the first quarter on these units due to continued delays in achieving final revenue recognition hurdles. In the first quarter, we remained under development accounting rules, so the material overhead and labor costs we incurred and making our products we ship fall into OpEx resulting in zero cost of goods sold. With that, we reported Q1 adjusted EBITDA of negative $19.2 million. In the first quarter, cash used by operations was $19.4 million. While there continues to be broad based supply challenges affecting all manufacturing, we currently do not see any ongoing issues that will impact our ability to deliver on our plan of 40 to 50 energy warehouses this year. If we ship all of these units and are able to recognize revenue for them in 2022, this would translate to approximately $10 million in revenue this year. However, given our early experience and deliberate approach to revenue recognition, we consider it likely that we will not recognize revenue in 2022 for all of the units we shipped this year. Importantly, we continue to work closely with our customers on delivery timing, and have not had any order cancellations today. As Eric mentioned, we are also on track to execute the other two operational initiatives we spoke about last quarter, implementing cost reductions and automating our manufacturing line. With these changes, we expect to exit 2022 with 750 megawatt hours per year of production capacity. Given our current plan, and the assumption that we will remain under development accounting for the full year, we continue to expect our non-GAAP operating expenses to come in at about $100 million. As we execute our plan in the coming year, we currently have more than ample liquidity to run the business and expect to end the year with cash and cash equivalents well in excess of $120 million. And with that, we can open up the line for questions. So I'd say on the rev rec, you're touching on a few of them, right. I think, in general, we're working through those challenges. And I can say working closely with our customers this quarter, we feel very good about our progress. Obviously, there – I think we're in line with you in terms of the demand growth and need here. The pipeline continues to grow, as you say, a lot of the demand is coming from Europe, as we indicated. So although the domestic pipeline is growing as well, we've seen a real surge in the last quarter of interest out of Europe. Most of that is not standalone, most of that is combined solar or wind plus storage. I think standalone storage still has a lot of applications, but both domestically and overseas, it's a combination of decarbonization and energy security goals. So, we're working to get our capacity ramped up to address that as fast as we can. The next question comes from George – oh, my apologies, from Thomas Boyes of Cowen. No, we still expect that 2023 Energy Centers being deployed and made operational, so no change to the plan there. And obviously, it's nice to see the improvement supply wise with injection molding. I am not – in terms of – I'm not sure exactly which chips, where the shortage is, so I probably am not going to do a good job with that. What we found in general, we feel very good about where we are now in terms of meeting our near-term production goals. The challenge, of course, in general has been it's a game of Whac-A-Mole. Small components and things that are generally not issues keep popping, kind of popped up. So we're just trying to be mindful of having firmer agreements with all of our suppliers across the whole of the supply chain, but no major issues today. And then just one more around Europe and none of the kind of the projected units for this year are earmarked for that market, correct. This is something that would be resumed would probably be at more for 2023, okay. Yes, I think, it depends a little bit on exactly the number of units we ended up shipping this year. I mean, we do have a couple of units. Just like in high school, all over. So first, when you look at the landscape, clearly, there couldn't be a more opportune time for your solution, given what's happening with lithium supply with lithium prices. Your pipeline sounds like it's been stable, but the phone must be ringing. Just can you share any anecdotes around pricing on the pipeline around – just conversations you've had with potential customers, anything you could share would be helpful. And with a name like Dresselhuys, George, I experienced the same thing over the years. The first is that the need for storage is becoming more apparent and as I mentioned in the prepared remarks in places like Germany, people have realized that they need to clean up some of the regulatory or structural issues to help accelerate the adoption of storage, because of its importance to energy transition in general. At this point, lithium really sets the market price for storage, and then everybody indexes off of lithium's price. So with the lithium price kind of declines, reversing and really meaningful price increase is starting to hit the market. And maybe going back, it was okay to the revenue recognition question. I think what we're finding is connecting the product to the grid, has certain dynamics. As Eric mentioned in his prepared remarks, we spent a lot of time really around the customer delivery organization and just making sure that those processes and challenges are met. And as I reiterated before, I feel very, very positively about the progress that we've made so far this quarter on that front. Anyways, just to drill down on this more – obviously, you've got the performance in rev rec issues for the units that are out there. You're saying that given the challenges we face, we're unlikely to see revrec on those units at any time during 2022. I think the intent of my prepared remarks was to communicate that, given our intentional revrec process, it's likely that there'll be some of those units that are not recognized in the 2022 year, not that the early units that we shipped would not be recognized. Yes, like I said before, we feel very positively about the progress we've made with those specific units this quarter. I think we've shared before that we intend to be very purposeful and deliberate early on, but that as we get our legs under us, both from a product standpoint, which we currently feel good about and the customer delivery site standpoint, which, again, we're making a lot of progress on this quarter. So we'd be happy to kind of keep you updated as we develop that, that timing. I mean, the cash level not a huge problem this quarter. In terms of our working capital needs, in our cash burn, I think, it's important to differentiate between the revenue and kind of how we get cash on some of these deals. Obviously, right now, on the revenue recognition standpoint, we expect that to happen very late in the process. So, those two pieces are separate for us. And then lastly, just in terms of the burn, I think, what you can expect to see from us, as we're working on the design for manufacturability initiatives and the cost out initiatives to balance deploying significant product in the field with doing so at a time where we've already realized some of those cost savings. So we're trying to balance that to make sure that our cash burn is appropriate, and that the longevity of the company is very strong. And the combination of our processes here with the way that we've structured the contracts, I would say that if we were starting out today, that I would anticipate that the revenue recognition process would have happened much faster than then we've seen play out. And again, that's a function of a lot of things. Part of it being our own processes, part of it being the delivery realities, and part of it being customer sites grid connectivity. But again, I think if we were starting from square one today, that process would have happened much quicker, and we feel very good about how that's trending. Okay, and if I can just follow-up on sort of a different take on the other question that was posed about just your system, these are the sort of the incumbent, if you will, the lithium ion energy storage systems that you would compete with. So in the in the EV space, clearly a theme has emerged, where the projections of demand over the next decade, essentially, from the – passenger car sector, whether there's now doubts about that growth CAGR just from the absence of availability of enough battery materials, including lithium, and that underpins, of course, this strong pricing cycle for lithium. Eric, here, I'll take that because it's a great question. It's the really the confluence of those elements you talked about, that I think, is driving the interest in the solution. It starts with regulatory and policy goals for de-carbonization, and energy security. And as people have become aware that these solutions exist, and they've started to appreciate the value of longer duration, energy storage, that event alone was all that was happening. You take that now combined with the shortage of the alternative solutions, specifically lithium, and that helps to drive increased demand. And then I think the third thing that comes up is safety and sustainability, which have been on the table from the very beginning, are now getting a lot more attention as we increasingly have two things, one fires that have happened with large scale lithium batteries out in the field. Actually, I was going to ask about because, I think, just in the last week, there has been more evidence of safety issues with, I think, a large scale tire, I think, in Korea with a lithium system installed lithium system. Yes, so I think that's right. There was a player announced in Korea, there was also one in Arizona a couple of weeks ago. So yes, the short answer is, I think, the safety benefits and the durability benefits of our solution are getting more attention than they did before. It really, like a lot of things in a new emerging market comes down to education, that these things build momentum as people understand them on an increasing and deeper level."
}