{
    "symbol": "GWH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 22:12:06",
    "content": " Joining me on the call from ESS are Eric Dresselhuys, CEO; and Amir Moftakhar, CFO. Following management's prepared remarks, we will hold a Q&A session. Earlier today, ESS released financial results for the second quarter of 2022. As a reminder, the information presented today will include forward-looking statements, including, without limitation, statements about our growth prospects and strategy for 2022 and beyond. In particular, those described in our risk factors set forth in more detail in our most recent periodic reports filed with the SEC as well as current uncertainty and unpredictability in our business, the markets, the economy, and the current geopolitical situation. During the call, we will also present certain financial information on a non-GAAP basis. Management uses non-GAAP measures internally to understand, manage and evaluate our business, and make operating decisions. With that, I will turn the call over to ESS's CEO, Eric Dresselhuys. Today I will discuss our progress with installations, customer wins and production initiatives and then hand it over to Amir to cover the financials. Q2 was another quarter of strong execution by the team and continued progress for ESS, notably declared the final milestones with our two initial energy warehouse customers and recognize revenue on these units. We work collaboratively with these customers through the process and learned a great deal about installation and deployment, it will carry into future projects. We also built and shipped additional units in the second quarter, including those for SDG&E and our partner TerraSol. With all six of the EWs they've ordered now on site, we are working with SDG&E to complete commissioning and to couple our batteries with onsite solar arrays to power The Cameron Corners micro-grid to mitigate the effects of Public Safety Power Shutoffs, or PSPS, a tool of last resort to reduce wildfire risks during extreme fire weather conditions. Our delivery to our partner TerraSol is deployed next to Sycamore International, a technology recycling firm in Pennsylvania, where it will complement a solar installation to provide business continuity and energy cost savings. In fact, TerraSol has contracted for a second unit, so that Sycamore can participate in the local frequency regulation market. We are delighted that over the weekend, the Senate found a path forward with the passage of the Inflation Reduction Act or IRA, a groundbreaking piece of legislation that can provide meaningful incentives across a range of technologies and applications to accelerate decarbonisation in the U.S. energy system. For Energy Storage in ESS, there are a number of important provisions including an extension of the renewable energy ITC, which includes storage when coupled with wind and solar. And finally, a number of really smart provisions like direct pay and tax credit transferability, which will ensure more money goes to doing the job and will allow everyone to move faster. In most cases, the incentives available increased meaningfully when the manufacturer meets certain domestic content and workforce requirements, all of which are currently met by ESS. While our business plan does not rely on these provisions, we believe there is an opportunity for it to provide meaningful financial tailwinds to our plans. And just two days ago, we were delighted to host the Secretary of Energy, Jennifer Granholm, along with Oregon Senators Ron Wyden and Jeff Merkley and Oregon Governor Kate Brown for a tour of our advanced manufacturing facilities. As a tireless advocate of the energy transition, Secretary Granholm has been a staunch supporter of the drive to a carbon neutral economy by 2050, while creating American jobs. Given the passage of the Inflation Reduction Act in the Senate, we were particularly excited to be the first stop for the Secretary, the Governor and the Senators. ESS embodies everything that the IRA is intended to support, domestic manufacturing of the key technologies required to address climate change. On the customer front, we are excited to share details of two new important relationships. We are proud to announce a landmark partnership with Energy Storage Industries Asia-Pacific or ESI, where we will initially sell ESI energy warehouses and in the next two years put in place the infrastructure to sell, assemble and service EWs and DCs. As currently planned, this agreement would result in ESS delivering over a gigawatt hour of Energy Storage to ESI in the next five years. ESI has already placed multiple orders for more than 70 Energy warehouses, and we began shipping them EWs last month. In the coming quarters, ESI will ramp facilities in Queensland, Australia, that will take key components that ESS will ship from our Oregon factory like energy modules and proton pumps and assemble them with the balance of plant. ESI conducted an exhaustive evaluation of technologies to address the need for long duration energy storage in Australia, and we are thrilled to be working with them as partners. And we believe this relationship will be foundational to driving scale in our U.S. manufacturing facility, as well as creating a sales and support foothold in an extremely important market. This installation will support TECO's Big Bend Solar Project, which powers 3,300 homes. Expected to ship early next year, the energy center will deliver 10 hours of energy storage and will be used for solar peak shifting, and fossil fuel displacement. On the operational front, we continue to implement our design for manufacturability initiatives and are confident that numerous improvements queued up for the remainder of this year will continue to drive reductions in unit economics. However, as we work to improve our supply base, we continue to battle various supply issues with components that make up our EWs. As we have ramped new vendors, we have seen their delivery times push out due to their own supply challenges. And while we still see a path to our original plan of shipping 40 to 50 energy warehouses this year, we would likely be near the low end of the range and possibly below it depending on our ability to resolve these supply chain issues. And regardless of the number of EWs we ship in 2022, we expect our production exit velocity to remain the same as we crossed into 2023. We have already begun to receive our next fully automated line and expect to have it up and running in the fourth quarter, which will bring our annual capacity to 750 megawatt hours, triple where we started the year. As mentioned last quarter, we brought on a leader for this team and I am thrilled with the energy and focus he has brought to the effort. This team will bring a wide gamut of disciplines to maximizing our success with customers from early engagement and site preparation to on site installation and grid connection, final testing, commissioning and support. Importantly, as ESS broadens its customer base, this team will drive the expand activities in our land and expand strategy. The team is not only working with existing customers who have received their units, but also customers we've contracted to ship EWs to and even customers we're exploring agreements with. In working on our initial energy center installation with Portland General Electric later this year, the team will build the blueprint to ensure future energy center deployments go smoothly. At the highest level, this team will create the recipe for success and repeatability across our products that will be critical to ensuring customers realize the value of our solutions quickly and seamlessly. We're pleased to see market dynamics continue to move in our favor, and the team at ESS is working hard to execute on our operational objectives. While supply externalities may impact our progress near-term, we're confident in the trajectory of our business, and how we are perfectly suited to solve the grid scale energy storage challenges in front of us. And with that, I'll pass it on to Amir to discuss the financials. Unless otherwise noted, all numbers we talk about today will be on a non-GAAP basis. You'll find the reconciliation of GAAP to the non-GAAP financial measures in our earnings release, which is posted on our Investor Relations website. As Eric shared, we continue to make strong operational progress across the business and with customers. In previous calls, we shared with you that we've taken a deliberate approach to revenue recognition, working to balance legacy customer contracts, initial field experience deploying our S200 battery modules and ramping up our customer success organization. We're very happy to report that we've met all of the revenue recognition criteria for our first three energy warehouse units, and recognized revenue of $686,000 in Q2. Additionally, we have made significant progress aligning new and existing customer contracts, internal manufacturing, testing and shipping processes and customer success initiatives to begin the process of optimizing a revenue recognition process moving forward. As a reminder, we remained under development accounting rules for Q2, so the material overhead and labor costs we incurred in producing the products we shipped fall into OpEx resulting in zero cost of goods sold. With that, we reported Q2 adjusted EBITDA of negative $21 million. We ended the second quarter with $192.2 million in cash, cash equivalents and short-term investments. In the second quarter, cash used by operations was $15.2 million. Our current cost reduction efforts remained largely on track, and we still expect to take 80% of the labor out of manufacturing and EW by the end of the year. We have brought up our second semi automated line and remain on track for the fully automated line to be operational in Q4, which in total will bring our production capacity to 750 megawatt hours. With this additional capacity combined with many of the process improvements I mentioned previously, the team is now working with a next wave of customers to receive EWs to help ensure smooth site prep and bring up processes for our product deliveries. Given our current plan, and their assumption that will remain under development counting for the rest of the year, we continue to expect our non-GAAP operating expenses to come in at about a $100 million. We currently have ample liquidity to run the business and expect to end the year with cash, cash equivalents and short term investments in excess of $120 million. So for in the near term through the balance of this year, and through next year, the relationship is largely about us building fully completed products, here in Oregon and shipping them to Australia. The facility has been built in Queensland, Australia today soon, they've broken ground, they had a ceremony on it. And as that gets up and running, the idea will be -- we'll ship power modules, proton pumps, all of the core IoT, and they will assemble what we think of as the balance of plants. Nowadays it's a super straightforward agreement, if we sell them, those components at an agreed to price, they license the IP on top of it. And so then, in terms of the rest of the sales pipeline, it's great to see some conversion here in the ability to recommend some revenue. The top-line pipeline is just a little under $9 billion in total at this point, and it's -- we're largely focused on the U.S., Australia, New Zealand, and Europe as our core markets. I would say that, it's -- we think it's going to change even more or accelerate. I've got a handful more questions on the demand side, but I'll take those offline. So it's yes, there has been a little bit of ability to exert some pricing power in the market, both in part because of inflation in the broad sense, but also the limitations and the very specific inflationary pressures that have come to lithium have changed the market dynamics for storage. We expect that there is some potential in the very near term, that as the investment, the --excuse me, the Inflation Reduction Act comes into play in 2023 that could continue regardless of inflation specifically, simply because of the demand that we think will be put into the market. Maybe the first one, to kind of build off me with the pipeline. So I would say, increasingly, we are seeing specific RFPs coming out, calling for six, eight and 10 hours. We don't see too much in the 12 hour yet, although a few RFPs and specific solicitations have come in the 12-hour range. But it is interesting that we are now starting to see RFPs -- formal RFP process has come out, looking for that longer duration. Whereas a year or more ago, you wouldn't have seen that the people who were interested in long duration would have probably been more in direct, bilateral conversations with the vendor about a specific project or target. And then maybe could just give us a sense, what you're seeing kind of on the interconnection side of the equation. Certainly, that's been an issue for solar wind and everyone. We haven't had too many interconnection issues, based on the projects we've done, to date and to have queued up over the next few months. Good news for us is many of the times the customers that we're dealing with, have been in that process for some time. But it's really been kind of a low grade or what we say around the supply chain team whack a mole, it depends on week to week, different components will be delayed. None of this is long-term concern to us, it's really more related to ramp up. First, you've talked a lot about the revenue recognition issues that came up on those first few units and talked about some of the learnings from that in terms of the contracts that you're writing. Yes, hey, Joe, it's Amir. There are a handful of legacy contracts with some key strategic customers that we have remaining, that that may follow the more purposeful route that we described before. But certainly, we have revamped not only our internal process, but the contracting process and some of the existing contracts that we have out there. So like I said on the call, I do anticipate over the next couple of quarters here that that that process will get much more efficient. But that is certainly what we're what we're looking for in terms of aligning the customer contracts and the shipment to be able to do that in a much tighter period of time, including the same quarter. I know, there's been a number of cost down initiatives. But yes, there were a couple of really interesting ones, you're trying to get precious metal out of the catalysts and the proton pump, for example. Yes, we're making progress. Part of that is related to some of the supply chain issues, by the way, we're moving. So every time you change to a new supplier, you're adding a small amount of risk into that conversion. The biggest cost reductions we've had for this year, and this was always the plan is on the labor side, and we're making great progress against that. And the good news is, it's not only more efficient, but we build faster with less labor. Yeah, I think that's probably a reasonable expectation. I mean, certainly, when you start shipping more units, and recognizing revenue, I think it'd be a logical next step to pull out of development accounting, and the first of the year is always a logical time to do that. Okay, and then the last one, just looking at you've got 750 megawatt hours coming out at the end of this year, lots of learning lots of things to digest. We ever made any announcements on that at this point, Joe, it's a very dynamic market environment right now. With the IRA bill coming in, we're going to be very keen to see how the market demand starts to shift."
}