{
    "symbol": "MOMO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-08 13:20:06",
    "content": " Therefore, in the third quarter, we decided to adjust Tantan's goals to focus on narrowing net loss by reducing low-efficiency channel marketing spend and accelerating our efforts to develop products and monetization models, that are suitable for the Asian taking culture, in order to pursue profitable growth. With regards to VAS, revenue from value-added services excluding Tantan totaled RMB1.34 billion for the third quarter, up 6% year-over-year or 1% sequentially. For the third quarter, VAS revenue was RMB202 million down 6% sequentially, mainly due to a decrease in paying user accounts. Since July, we have gradually cut off channels and methods with low ROI, continued to optimize budget allocation for channel investments and adjusted feeding strategy timely according to market dynamics; in the third quarter, unit user acquisition cost decreased by nearly 30% sequentially and by more than 40% from a year ago. In the third quarter, total revenue for the profit driven hour oriented standalone apps was RMB203 million, up a 154% year-over-year and 2% sequentially. Looking into the key revenue items for the quarter, firstly on live streaming, total revenue from live broadcasting business for the third quarter 2022 was RMB1.66 billion down 24% year-over-year, but up 9% quarter over quarter. Tantan's live broadcasting revenue amounted to remember a RMB139.7 million down 40% from Q3 last year, but up 20% from the previous quarter. Revenue from value added service on an ex-Tantan basis reached RMB1.34 billion in the third quarter of 2022, a 6% increase year-over-year and a 1% increase sequentially. Tantan's value added service revenue amounted to RMB201.6 million, down 27% from Q3 last year and 6% from the previous quarter. The year on year decrease was due to the demonization process to improve user experience and retention in the latter half of 2021, as well as the pressure on Tantan's annual use and paying conversion caused by the COVID resurgence and reduction on marketing spend."
}