{
    "symbol": "MOMO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-07 12:15:06",
    "content": " For the first quarter of 2022, total revenue at the group level was RMB 3.15 billion, down 9% year-over-year and 14% quarter-over-quarter. On an ex-Tantan basis, total revenue was RMB 2.8 billion, down 4% from Q1 last year and 14% from last quarter. Tantan’s total revenue for the quarter came in at RMB 349 million, down 39% year-over-year and 20% quarter-over-quarter. Momo's live streaming revenue totaled RMB 1.48 billion for the first quarter, down 13% year-over-year. With regards to VAS, revenue from value-added services, excluding Tantan, totaled RMB 1.26 billion for the first quarter, up 11% year-over-year. Revenue from the new bucket of stand-alone apps maintained rapid growth momentum, totaling RMB 135 million, up 140% year-over-year, while the net loss continued to narrow. In Q1, consumption softness in connection with macro headwinds had a negative impact on some of our users and the resurgence of COVID in various regions of China led to escalation of containment measures, leading to a significant slowdown in year-over-year growth in Momo VAS revenue. Total revenue for the first quarter was RMB 349 million, down 39% year-over-year, 20% quarter-over-quarter. VAS revenue for the first quarter was RMB 224 million, down 29% year-over-year and 5% quarter-over-quarter. Live streaming revenue for the first quarter was RMB 125 million, down 38% quarter-over-quarter, mainly due to 2 factors: First, Q1 seasonality for the live streaming business in general; second, the demonetization process of live streaming last year continued into this quarter. Revenue from the new bucket in the first quarter was RMB 160 million, up 184% year-over-year and 43% quarter-over-quarter. Total revenue for the first quarter of 2022 was RMB 3.15 billion, down 9% year-on-year or 14% quarter-over-quarter. Non-GAAP R&D expenses for the first quarter was RMB 229.2 million compared to RMB 244.1 million for the same period last year, representing 7.3% and 7% of total revenue, respectively. The decrease was attributable to the following factors: number one, lower marketing spend for new apps as a result of our focus on cost reduction and efficiency improvement; number two, lower user acquisition investment on Tantan as we adopted a conservative marketing approach during the pandemic resurgence; number three, in Q4 last year, core Momo had a quarterly-specific branding expense item. Non-GAAP G&A expenses was RMB 85.9 million for the first quarter 2022 compared to RMB 94.2 million for the same quarter last year, representing 2.7% of total net revenue, same in both periods. Lastly, on business outlook, we estimated our second quarter revenue to come in the range from RMB 3.05 billion to RMB 3.15 billion, representing a decrease of 16.9% to 14.2% year-on-year or a decrease of 3.1% to an increase of 0.1% quarter-over-quarter."
}