{
    "symbol": "MOMO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-01 12:27:06",
    "content": " For the second quarter of 2022, total revenue at the group level was RMB 3.11 billion, down 15% year-over-year and a slight 1% decrease quarter-over-quarter. Tantan's total revenue for the quarter came in at RMB 331 million, down 36% year-over-year and 5% quarter-over-quarter. In general, although Momo's MAUs declined 4% from Q2 last year due to pandemic resurgence in the first half, excluding the impact of external factors beyond company's control, the fundamentals of Momo as a social platform remains stable and healthy due to the improvement of channel efficiency and enhancement of overall retention driven by product efforts. Momo's live streaming revenue totaled RMB 1.4 billion for the second quarter, down 26% year-over-year and 5% quarter-over-quarter. With regards to VAS, revenues from value-added services, excluding Tantan, totaled RMB 1.32 billion for the second quarter, up 9% year-over-year and 5% quarter-over-quarter. In the second quarter, the total revenue of the profit-driven ROI-oriented standalone app was RMB 199 million, up 184% year-over-year and 24% quarter-over-quarter. Total revenue from live broadcasting business for the second quarter 2022 was RMB 1.52 billion, down 28% year-over-year and 6% quarter-on-quarter. Core Momo's live broadcasting revenue totaled RMB 1.40 billion for the second quarter, down 26% year-on-year and 5% quarter-over-quarter. Revenue from value-added service on an ex-Tantan basis reached RMB 1.32 billion in the second quarter of 2022, a 9% increase year-over-year and 5% increase sequentially. Tantan's value-added service revenue amounted to RMB 214.4 million, down 28% from Q2 last year and 4% from the previous quarter. Non-GAAP R&D expenses for the second quarter was RMB 214.3 million compared to RMB 232.9 million for the same period last year or an 8% decrease year-over-year, which was due to continuous optimization in personnel costs since the beginning of the year. For the second quarter, marketing spend for Momo and Tantan decreased RMB 74 million or 15% from the same period last year."
}