{
    "symbol": "MOMO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 13:15:16",
    "content": " For the fourth quarter of 2022, total revenue was RMB3.21 billion down 13% year-over-year, and 1% quarter-over-quarter. Total revenue for a Momo app and standalone new app was RMB2.87 billion, down 11% year-over-year, a 1% quarter-over-quarter and adjusted operating income was RMB514 million, down 21% year-over-year and 20% quarter-over-quarter. Total revenue from the Momo app and standalone app for fiscal year 2022 was RMB11.3 billion, down 10% from last year, the decrease was due to the decline in Momo revenue while the standalone apps maintain rapid growth momentum from a high base in 2021. With regards to last, revenue from value-added services excluding Tantan totaled RMB1.27 billion for the fourth quarter up 2% year-over-year and down 5% sequentially. In the fourth quarter, past revenue from the Momo app totaled RMB1.04 billion in the down 9% both year-on-year and quarter-over-quarter, revenue from the standalone apps was RMB220 million up 129% year-over-year and 15% sequentially. For fiscal year 2022, revenue from value-added services excluding Tantan totaled RMB5.18 billion, up 7% year-over-year. Last revenue was RMB184 million, down 9% sequentially although the sales of new memberships service played a positive role in improving VAS ARPPU, the increase couldn't fully offset the pressure from paying user decline because membership revenue is highly correlated with the number of paying users. For fiscal year 2022, Tantan's total revenue was RMB1.37 billion, down 33% year-over-year, mainly due to the decrease in paying user count resulting from COVID and our initiative to reduce channel investments. In the fourth quarter, revenue from the standalone apps totaled RMB229 million doubled from the year ago period and up 13% sequentially. Looking into the key revenue line items for the quarter, firstly, a live broadcasting, total revenue from live broadcasting business for the fourth quarter of 2022 was RMB1.72 billion down 20% year-on-year but up 4% quarter-over-quarter. Momo apps live forecasting revenue totaled RMB1.56 billion for the quarter, down 20% year-on-year, but up 3% quarter-over-quarter. Tantan's live broadcasting revenue amounted to RMB152.9 million, down 19% from Q4 last year, but up 7% from the previous quarter. Revenue from value-added service for the fourth quarter of 2022 was RMB1.45 billion, down 2% from Q4 last year and 6% sequentially. Non-GAAP sales and marketing expenses for the fourth quarter was RMB388.6 million, or 12% of total revenue compared to RMB648.6 million or 18% of total revenue for the same period last year. Non-GAAP G&A expenses was RMB84.9 million for the fourth quarter of 2022, compared to RMB89.4 million for the same period last year, representing 3% and 2% of total revenue respectively."
}