{
    "symbol": "EQT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 12:59:05",
    "content": " As shown on slide 12 of our investor deck, we highlight breakeven pricing of our entire 1,800 core Marcellus inventory with every location generating a 10% or higher return at a natural gas price below $3 per Mcf. Year-to-date, we have repurchased approximately $830 million of debt principal, and we plan to further fortify our balance as we are rating our year-end 2023 debt reduction goal by $1 billion to $2.5 billion to tactically capture the market discount currently available. First, we recently raised our base annualized dividend by 20% from $0.50 to $0.60 per share, which is a sign of the growing confidence we have in the sustainability of our business and longer term natural gas prices. With the $213 million we spent repurchasing convertible notes during and subsequent to the end of Q2, we lowered our fully diluted share count by almost six million shares at an effective equity price of approximately $37 per share, while simultaneously eliminating a debt obligation and simplifying our balance sheet. In total, our updated framework allocates roughly $4 billion towards shareholder returns by year-end 2023 and leaves approximately $3.5 billion of retained free cash flow flexibility on recent strip. With the continued resiliency of longer dated natural gas prices, we now see approximately $22 billion of cumulative after tax free cash flow from 2022 through 2027 at current strip. This is up from the prior $17 billion we highlighted last quarter and equates to approximately 140% of our current equity market cap, underscoring the tremendous value opportunity embedded in EQT shares. Adjusted operating cash flow was $915 million and free cash flow was $543 million, bringing our total year-to-date free cash flow to more than $1.1 billion. As an illustration of the resiliency of our forward outlook, if NYMEX retraced to approximately $3 per MMBtu in 2023, we would still expect to generate approximately $1.6 billion of free cash flow next year or a 10% free cash flow yield. Conversely, if natural gas averaged $7 per MMBtu level, we would expect to generate almost $6 billion of free cash flow in 2023 or nearly a 40% free cash flow yield. Again, using strip pricing, we see approximately $22 billion of cumulative free cash flow through 2027, which is net of all expected cash taxes and hedge premiums. With $4 billion earmarked for year-end 2023 for debt reduction, share buyback and our increased base dividend, with plenty of room for upside given we expect to generate $22 billion of cumulative free cash flow through 2027."
}