{
    "symbol": "MDC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 19:11:08",
    "content": " Good morning, ladies and gentlemen, and welcome to the MDC Holdings 2022 first quarter earnings conference call. After finishing our prepared remarks, we will conduct a question-and-answer session, at which time we request that participants limit themselves to one question and one follow-up question. Before turning the call over to Larry and David, it should be noted that certain statements made during this conference call, including those related to MDC’s business, financial condition, results of operations, cash flows, strategies and prospects and responses to questions may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These statements involve known and unknown risks, uncertainties and other factors that may cause the company’s actual results, performance or achievements to be materially different from the results, performance or achievements expressed or implied by the forward-looking statements. These and other factors that could impact the company’s actual performance are set forth in the company's first quarter 2022 Form 10-Q, which is expected to be filed with the SEC today. Good morning and thank you for joining us today as we go over our results for the first quarter of 2022, provide our thoughts on current housing market conditions and give some insight into the future of our company. MDC Holdings reported earnings of $2.02 per diluted share for the quarter, a 34% increase over the first quarter of 2021. As we came in near the high-end of our stated guidance with new home deliveries of 2,233, average sales price on homes closed in the quarter trended higher rising 16% on a year-over-year basis as the combination of the healthy demand and limited supply continued to provide for a favorable pricing environment at our communities. As we sold an average of 5.4 homes per community per month in the quarter, demand was broad based from both a geographic and pricing standpoint with the millennial age buyer continue to being the driving force behind our sales success. This large population of buyers has reached a prime phase in their lives when home ownership became a much higher priority, whether due to changing family dynamics, a chance to build equity or the desire to put down roots. Factors, including taxes, affordability and overall quality of life are weighing more heavily into where business operates while the emergence of online and remote work capabilities have given employees more freedom to live and work from where they choose. At MDC, we have positioned our company to take advantage of these trends by investing in the markets that are benefiting from this migration and by opening communities that appeal to millennials with innovative homes at more affordable prices. After years of historically low mortgage rates, buyers are now being faced with higher financing costs for their perspective home purchase as the average rate on 30 year fixed rate mortgage has moved approximately 200 basis points since the beginning of the year. While current mortgage rates are still attractive from the long-term historic perspective, it is natural to expect that this move higher may have a near-term impact in our business as buyers adjust to this new reality. Long-term, however, we believe that the demand factors in place coupled with a lack of supply in our markets, keep the new home construction market on a solid footing. In addition, it is important to note that while the absolute cost of owning a home has gone up with the rise in interest rates, the relative costs has stayed relatively stable given the concurrent rise in monthly rents across the country. With a strong balance sheet, a seasoned leadership team and a product profile that is tailored to today's buyers, MDC is in a great position to build on the track record of success and to adjust whatever changing rate environment may bring. Confidence we have in our ability to fund our operations and operate effectively through the housing cycle is borne out by our industry leading dividend, which yields above 5% based on recent price levels. For those investors who believe in long-term viability of the housing market and who are seeking a healthy dividend, we believe MDC is a compelling value. With that I'd like to turn the call over to David, who will provide more details on our operations this quarter. MDC delivered strong results in the first quarter of 2022, both in terms of profitability and order activity. Supply chain issues continue to be a headwind for our industry, but they were fairly consistent with what we faced in the fourth quarter of 2021. Despite the supply chain challenges, we continue to generate outstanding margins across our home building divisions. As strong buyer demand and low inventory levels have allowed us to raise prices ahead of cost inflation, divisions that posted particularly strong margins in the quarter included Orlando, Las Vegas and Riverside County. As Larry mentioned, new home demand was broad based during the quarter with the mountain region posting an absorption pace of 5.6, a west region of pace of 5.5 and the east of pace of 4.8. Divisions with the best absorption paces during the quarter included Denver, Portland and Northern California. Though we have noticed that the sales process is taking a little longer, most buyers seem to be adjusting to the higher rate environment as well, and continue to be motivated to move forward with their purchase. Additionally, we have seen very little change in cancelation rates among our buyers already in backlog. As such our general senses that market dynamics remain healthy and the demand continues to outstrip supply, particularly in the markets that we operate. While it’s unclear where rates will eventually settle out, we believe our market positioning are more affordably priced product and our build order strategy MDC has is in a great position to be a success with a number of interest rates scenarios. From a land acquisition standpoint, we remain diligent in our land underwriting efforts and focus on investing in markets poise for continued growth. We believe this transaction combined with our organic land pipeline we have already secured in the Nashville area one year ago, has the potential to launch MDC in a leadership position in Nashville. Now I’d like to turn the call over to Bob who will provide more detail on our results this quarter, as well as some forward looking guidance. During the first quarter, we generated net income of $148.4 million or $2.02 per diluted share, representing a 34% increase from the first quarter of 2021. This increase was driven by home sale revenues, which rose 19% year-over-year to $1.24 billion, as well as our gross margin from home sales, which improved by 380 basis points to 25.7%. As we have indicated for several quarters, competition in the primary mortgage market has increased as refinance volumes have declined. The increase in rate was primarily due to federal energy efficient home tax credits, which have not been extended to 2022 and a decrease in the windfall recognized upon the vesting and exercise of equity awards. We delivered 2,233 homes during the quarter, which represented a 3% increase year-over-year and exceeded the midpoint of our previously estimated range for the quarter of 2,000 to 2,300 closings. The average selling price of homes delivered during the quarter increased 16% to about $556,000. This was the result of price increases implemented over the past year, as well as a shift in the mix of our closings from Nevada to our Northern California markets. As David mentioned, supply chain disruptions and labor constraints remain a headwind to the entirety of our production process from land development to final home inspections. While these issues did not seem to worsen during the quarter, they remain an obstacle for our teams to navigate on a daily basis. As a result, our delivery projections for the second quarter, as well as the remainder of the year are based on production schedules that reflect current labor and supply chain conditions. We are currently anticipating home deliveries for the second quarter of 2022 of between 2,400 and 2,600 units. In addition, we are reiterating our full year guidance of between 10,500 and 11,000 home deliveries. Excluding the inventory impairment and warranty adjustment recorded during the quarter, our gross margin from home sales would have been nearly 26%. These improvements were driven by price increases implemented across nearly all of our communities over the past year, which have been partially offset by increased building material and labor costs. We expect to continue to produce strong gross margin from home sales based on the gross margin of our homes and backlog, as well as our continued focus on pricing. Our SG&A expenses, a percentage of home sale revenues decreased 60 basis points year-over-year to 10.4% as we continue to drive improved overall operating leverage. Despite the increase in home sale revenues, our marketing commission expenses were little changed year-over-year resulting in a 90 basis point improvement in these costs as a percentage of home sale revenues. As we have noted previously, we’ve been successful in controlling these costs, given the current demand environment. As was the case last year, these actions caused a somewhat slower pace of sales in March, relative to January and February. Additionally, cancellation rates remained low during the quarter at 8.2% relative to beginning backlog and 16.7% relative to gross orders. We saw active community count increased to 200 as of quarter end, as we had 38 new communities become active during the quarter. In addition, we opened our first community in Austin, Texas during the quarter, and we’re pleased to experience strong demand. This challenge is made even more difficult by the current demand environment and the extended land development times, we continue to experience. With that said, we expect our active community count to remain flat at approximately 200 communities during the second quarter, followed by continued growth in the back half of the year. We continue to forecast double-digit percentage growth interactive community count from December 31, 2021 to December 31, 2022. We approved 2,740 lots for acquisition during the first quarter of 2022, which represented a 37% decrease from the prior year quarter. This follows several quarters of significant land acquisition approval activity, which can be seen by the 18% year-over-year increase in total lots controlled as of March 31. In addition, we acquired 1,909 lots during the quarter resulting in total land acquisition and development spend for the quarter of $309 million. We expect that the acquisition of the majority of the home building assets of The Jones Company of Tennessee will result in the addition of approximately 1,700 controlled lots to our total lot supply. We generated $118.1 million in cash from operations during the quarter, and believe that we have the opportunity to generate cash flow from operations over the remainder of the year as well. As a result of our disciplined approach to capital allocation and our successful execution of strategic initiatives, our pretax return on equity over the last 12 months increased 530 basis points year-over-year to 32.9% as of March 31, 2022. We have been able to achieve these impressive returns, while continuing to maintain one of the strongest balance sheet in the homebuilding industry. So I'm not talking about sales in 2Q, but I'm talking about homes that would close in 2Q where maybe the rate wasn't locked. And so, the customer comes back to you and says, now I have to have a much higher rate because the delivery time was later, that sort of thing. Well, I think, we talked about the 26% or greater gross profit margins for Q2. Well, implicitly, it incorporates sort of holistically everything that you think may happen, which is encouraging. When you think about the overall strength of the entry level market versus the move up segment of the market, I know you've been focusing a little bit, a lot more on the entry level. So, Steve, I think, it's a great question. We think that our product is really a product that can be accepted by a variety of consumers, not just entry level move down as well, we do build to order. We do have programs in place to try to minimize the blow from rising interest rates, long-term lock programs that we've put in place, things of that nature. Yes, that's helpful, particularly about the idea of the BTO model, helping with a move down customer. Sometimes we'll run it where it's half and half, builder versus the customer. Yes, we think with the products that we have that – and the land supply we've been able to get new markets really are going to be fine for us. And so, we think our land basis is, is pretty similar to some of the current builders. Well, I think, Larry and I've always been opportunistic over the last 45 years, but we look at both and this is the first time we actually expanded a few markets that we're pretty excited about to include Nashville. Yes, I think, you've captured it pretty well. Certainly, we recognized that individual markets have appreciated significantly year-over-year, including Austin, Nashville. But then again, they still are very affordable relative to other markets and they're attracting a lot of jobs, which I think really gives them a lot of long-term potential, even though if you're in the market and you are just looking at that market, you say, wow. And just one more from me, just in terms of recognizing the cost inflation that we've seen on the build to order model. Yes, I think we're probably roughly, I guess, up 15% year-over-year on a per foot basis. You guys were talking earlier about how you implemented new strategies and workarounds for cycle times last quarter, but there were new issues arising. If you ask one of our division presidents, I'm sure they would read you a list of a mile long of things that they've dealt with. So, the good news is, I think there's active strategies to try to make sure that we're getting ahead of it including ordering materials earlier in the process making sure we're diligent in terms of our permitting process. So even though we're not a spec builder making sure we're getting the permit as early as we can in the process, so that we're ready to start as soon as the sale occurs. And then secondly – and I apologize if you covered this a little bit earlier, if you can kind of give a sense of how your demand and orders trended throughout the quarter, and maybe there is a month by month breakdown. So as we go through the spring season, we implement limitations on lot releases as we increased prices during the quarter, we saw a little bit lower activity in March relative to the first two months. Just given the macro outlooks that are weakening, and then there is this persistent supply chain issues, not every builder will be able to get over. From time to time over the last decade, we've looked at a lot of transactions. The last one was about 11 years ago, but when The Jones Company transaction came up, kind of checked all our boxes build to order very quality homebuilder, a leader in Nashville and we see a lot of packages that we felt pretty good about this one that it would fit into to our DNA and both our product and market. You also note, we have a great group of people at The Jones Company that really complements our existing team. More recently, however, as you know, we have allocated more capital towards our industry leading dividend, including growing that dividend over the course of the past couple of years as well as land assets including The Jones Company coming up here, currently slated to close at the end of Q2. I know, I mean, I’m assuming just given your BTO model, you probably have a little bit more visibility than you had last quarter. And I think, the one variable I already talked about on the lumber side, seeing that more recent spike in lumber come through in Q3. I think that’s one thing to be aware of, outside of that, I’ll leave it at the 26% plus for Q2. We still think it’s a great environment out there, solid demand. Thanks, actually, it’s Paul Sadowski. So, I think, we love to be in that 300 plus range in terms of closings. So, we feel pretty good about that one getting up to scale. In terms of the drag, we’ve got relatively small teams in each of the four new markets naturally that’ll change with The Jones Company coming on Board in late Q2. So I don’t know that it’ll be a material drag, we will have in the second half of 2022 up to a 100 additional closings coming from Jones give or take, it’s a bit of a moving target right now. And those will be lower on the margin spectrum, call it in the 10% to 15% range simply because we have to allocate the purchase price. And I know you’re well aware of that process, Paul. So it’ll drag margins just a tee bit in the back half of the year, but then again, we’re just talking about 100 closings or so. You’ve got 20% of your business in Denver and the Marshall Fire destroyed 1,000 homes out there, which is about 10% of annual production for the Denver market. I mean what they have to do to clean the site up, what they have to do with the EPA and every one of those houses has a different insurance policy on it. And so it’s a terrible thing that happened in fact, that it affected some houses that we built over 20 years ago. So what we’re seeing is we’re seeing a lot of people that are moving into houses for rent, moving into apartments, and we’re seeing some of those consumers out looking to buy houses for us, but it’s not going to be a one year process. Yes, we really don’t see it. I would say it’s a little more move up focused than our percentage, we’re 65% what we call more affordable. I think as you get into 2023, you see less of that, naturally it’s dependent upon how quickly houses close, whether or not the closing occurs as scheduled all those kind of things. So a little uncertain at this point, but that’s roughly the program right now that we can expect. Thanks, gentlemen, and great job on the quarter. Sometimes we will help them out with it, if we’re doing a promotion or something like that. So, I don’t want to imply that there’s not any risk to that, but it’s probably that the most reasonable estimate at this juncture. Well, I think lumber, for example, until they deliver the lumber pack, you are not certain on your pricing. On the backend trades, I think you have the same potential for changes in pricing, depending upon what issues they’re up against with their own labor pool as well as materials, as much as we’d like to lock it in contractually. When you’re dealing with local or even regional people through your suppliers and subcontractors, you really have to work with them and make sure that they are moving forward that they’re still profitable in their endeavor. So from a pragmatic standpoint, I think we’re always in discussions with our subcontractors. But we feel like we’re in a pretty good position, nonetheless, to make a good margin on our backlog in Q2 and into the second half of the year. I’m wondering if you guys have quantified that in any way, percentage of sales that you’re seeing that phenomenon happen. Have you guys quantified what percentage of your sales that’s happening, people from moving from California to Arizona or Texas that kind of thing,\n This is David. I don’t think we really quantified it, but a clear example would be moving from say San Francisco in the Bay area to the East Bay where people may have moved out of a attached unit, a town house and moving into a single family, single family house with either a three carter garage or a big lot. So and we’re seeing a lot of that type of movement, what – which might be interstate, but some people are moving into other states, but this work from home phenomenon it’s been really interesting. In some of your lower cost states, you could be north of 20% coming from other markets. And as it does conclude the question-and-answer session, I would like to return to floor to Bob Martin for any closing comments."
}