{
    "symbol": "BJ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-18 11:33:17",
    "content": " Our second quarter comp was driven by significant gains in traffic and market share led by our grocery and perishable categories, and our general merchandise and services comp improved both year-over-year and sequentially. With average U.S. gas prices in the second quarter running about 45% higher than last year, the value that we offer has resulted in robust growth and comp gallons as members relied on BJ's to save at the pump. In the second quarter, growth in our member count was impressive at 6% year-over-year, this was led by a combination of strong renewal rates, and membership acquisition helped by our growing success in digital acquisition. Our general merchandise and services division comp grew by 4% in the second quarter and up 2%, and up 24% on a two-year and three-year stack respectively, as discretionary spend continues to normalize towards a new higher base from the past two years. Excluding the impact of the acquired inventory, our baseline year-over-year increase was approximately $250 million, about 50% was related to new club growth and other strategic actions we've taken to better position our business, such as improving in-stock levels over last year. And we're seeing new members come in from across the economic spectrum as well even as you do see some pressure on the lower side of the economic spectrum, given the waning government stimulus, those folks need to save money more than the average and we're certainly seeing a lot of folks on the higher end come in as well as they search for value. Certainly, grocery led the way inside of our box this quarter, not surprisingly given what's going on in the market, but we had strong performance across our portfolio, including in general merchandise and sundries, which improved sequentially and year-over-year as well. And you think about the traffic gains in our core business, you think about the market share gains in our core business, you think about the relevance that gas provide even though the cost of a gallon gas is a bit lower today than it was in March, let's say, it's still very much elevated over prior years and people are overall searching for value. We are still seeing some of the things that we talked about in the first quarter where lower -- members on the lower end of the economic spectrum, we're seeing a little bit of a pullback there, really not in their traffic so much, but in their overall shopping given they have less government aid dollars than they had in the past. So we've seen tremendous gains in market share across our business, but most particularly in our gasoline business, right, with gallons up 40% on a two-year stack and 18% up this last quarter."
}