{
    "symbol": "BJ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-17 12:09:03",
    "content": " Iâ\u0080\u0099ll just echo what Bob said - as we think about the co-brand program, weâ\u0080\u0099ve talked about this with the street a little bit, we made the strategic decision back when we launched the current version of the program to invest all the economics back into the members with the goal of driving lifetime value, and weâ\u0080\u0099ve been really pleased with how thatâ\u0080\u0099s performed over the last several years. The team across the board at CapOne is incredible in everything that they do, and as we think how that plays through to the growth in the next program, we think that there is a substantial leg higher from here in terms of the growth with the membership base, so there will be a little bit--in term of the KPIs, there will be a little bit of a slowdown here--not a slowdown but a pause as we shut off acquisition in the coming days on the current program as we work through the transition, so youâ\u0080\u0099ll likely see a pause in the higher tier membership penetration as we report Q4, and then as we get the program launched in the first half of next year, youâ\u0080\u0099ll see it then reaccelerate from there as we start acquisition with the new program. Weâ\u0080\u0099ve also had headwinds all over the business, most notably in margins this year as supply chain costs and general merchandise markdowns really impacted our margins throughout the year, and so I do think it will be tough to lap the gas income that weâ\u0080\u0099ve seen this year. We feel like weâ\u0080\u0099re going in the right direction, and all the clubs weâ\u0080\u0099ve opened in the last few years have outperformed what we thought they would do, so that gives us a ton of confidence to continue to keep our foot on the gas from a real estate perspective. The quality of the conversations and the execution that weâ\u0080\u0099re seeing from the team, as well as the new planning and allocation folks that weâ\u0080\u0099ve brought in, has really just changed the game for us, so Iâ\u0080\u0099m very bullish on our GM prospects over the long term with our team and looking forward to getting into next year, so we can see how the members react to what weâ\u0080\u0099re doing. But this year has been an interesting one, to the core of your question, where weâ\u0080\u0099ve made so much money on gasoline, weâ\u0080\u0099ve used that to spend into the beat, if you will, so we have made our gas prices a little bit even lower than normal to showcase even more value, and then weâ\u0080\u0099ve taken that gas profit and invested it in other places in the business, so think about helping our members through these inflationary times. I donâ\u0080\u0099t know that that slows down in 4Q, but as our competitors have noted and I talked about earlier, our GM performance was a little bit soft in the third quarter and youâ\u0080\u0099ve got a tough market out there, and GM becomes a bigger piece of our business in the fourth quarter, so youâ\u0080\u0099re absolutely correct - the guidance that weâ\u0080\u0099ve got out there, comps in the 4% to 5% range for 4Q, would imply a decent decel. Over the past few years, weâ\u0080\u0099ve already seen the effect of a fee increase, right - the average dollars per member is well over $60 at this point, itâ\u0080\u0099s up about $5 in the last few years, so weâ\u0080\u0099ve mixed our business up to really look like it has had a fee increase when we havenâ\u0080\u0099t changed the sticker price to our members, so itâ\u0080\u0099s sort of an unappreciated thing that weâ\u0080\u0099ve been able to do over the past few years, and our membership team has done a fantastic job doing that. IT also comes to one of the core reasons weâ\u0080\u0099re doing the co-brand transition, right - that has been the fastest growing part of our premium tier memberships over the years, and with the new value prop that weâ\u0080\u0099ll announce in January, we only expect that to get better. As you remember, the longer term story four years ago or so, we didnâ\u0080\u0099t really have a digital business to speak of, and weâ\u0080\u0099ve spent a bunch of time building the infrastructure, and lo and behold now weâ\u0080\u0099re well over a billion dollars and 9%-ish of our business."
}