{
    "symbol": "FRO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 15:17:07",
    "content": " In the third quarter Frontline achieved $63,200 per day on our VLCC fleet, $57,900 per day on our Suezmax fleet and $58,800 per day from our LR2/Aframax fleet. So far in the first quarter of 2022, we have booked 87% of our VLCC days at $58,300 per day, 77% of our Suezmax days at the cool $72,400 per day and 68% of our LR2/Aframax days at a solid $63,900 per day. We came in at the net income of $240 million, which is the highest quarterly net income we have had since 2008, then we had an adjusted net income of $215.5 million, the adjusted net income in the fourth quarter increased by $133 million compared with the previous quarter and that was mainly driven by an increase in our time charter equivalent earnings due to the higher TCE rates that Lars went through earlier in the presentation. We estimate average cash cost breakeven rates for 2023 of approximately $27,000 for VLCC, $21,500 for Suezmaxes, and $17,600 per day for LR2 tankers, with a fleet average estimate of about $22,300 per day. What we have -- are observing is that asset prices are moving a bit ahead of the markets to defend investing in say, a new build look at the VLCCs you need closer to $50,000 per day of earnings consistently for the next 20 years to make 15% to 20% return on the investment. Your line is open, please ask your question. Your line is open, please ask your question. So to try and make sense of it, I think the situation around boiler being redirected from Russia to -- from going into Europe being redirected to Middle East and Asia, you're basically seeing both Aframaxes and Suezmaxes getting drawn into that trade, limiting the amount of macro ships in those markets in a compliant markets that has given the VLCCs opportunities to enter that market and basically have good returns in that market, too. Where we would say that over 20-year vessel that as an owner you've never heard off, you would attach to the 30% efficiency to that ship compared to say a dark -- gray fleet Russian trader, who'll probably only get 50%, 60% efficiency out of the ship basically due to the limitations in the compliant market a ship with Russian history have. I think that's going to be quite exciting considering the fact that the oil production levels are not really higher than what we had and we're missing a couple of years of more and more demand growth, which historically at least has been between 1% and 2% per year."
}