{
    "symbol": "NTCO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 14:50:08",
    "content": " But I think to your first question Joe, we are always looking of course at optimizing our footprints right, and weâ\u0080\u0099ll continue to do so, especially in those markets that we're not able to generate profits and especially in the short term, not able to generate cash flow, right. That is still at very low levels, and of course we cannot be satisfied with that, and we're working to improve that towards the second half of the year, especially in the very critical Q4, which has of course big penalty impacts, not only for Avon International but for all our brands, but itâ\u0080\u0099s a key priority for us to continue to work on SG&A as well to improve profitability. Yeah look, I think the story on The Body Shop this quarter is a story in which the retail recovery of course has improved year-over-year right, given the COVID last year, but of course hasn't offset the decline, the big decline in The Body Shop At Home, right. We remain infused about that, Aesop already has a pretty good brand awareness and brand equity in China, even though it hasn't operated there within retail, and again all the indications that we have is that basically the consumers are going to be also very much into the Aesop proposition through the experiences that â\u0080\u0093 difference experiences that Aesop offers, right, especially compared to other luxury brands right. Even though again, we already see some better results as I mentioned, especially on the inventory â\u0080\u0093 on the inventory management level in terms of working capital, and on the return investment as we do a more diligent and thorough CapEx revenue of the projects in the short term, right. Itâ\u0080\u0099s very important to highlight through, right, and again I want to be very clear that we are not happy with cash flow, but I think very important to highlight that historically the business has a big seasonality in terms of cash consumption in H1 and cash generation in H2, especially in the very critical Q4 right, which again is basically a seasonal quarter for the BUs and basically a huge cash generation quarter for Natura &Co right."
}