{
    "symbol": "HAE",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-10 15:58:03",
    "content": " Today, we reported organic revenue growth of 19% in the fourth quarter and 7% in fiscal '22, and an adjusted earnings per diluted share of $0.65 in the fourth quarter, and $2.58 in fiscal '22, an increase of 41% versus the prior year fourth quarter, and an increase of 10% versus the prior fiscal year. Plasma revenue increased 31% in the fourth quarter driven by a 12% increase in U.S. plasma volume, price benefits and a $6 million stocking order. Transfusion Management revenue grew 18% in the fourth quarter and 11% in fiscal '22, and was equally strong for BloodTrack and for SafeTrace Tx as we completed a series of new account installations. Apheresis revenue declined 1% in the quarter and fiscal '22 as the strong recovery in platelet collections in Japan was offset by lower revenue from convalescent plasma, and staffing shortages that affect the collection centers across the U.S. For the full year, Whole Blood revenue declined 3% driven by blood center staffing shortages and previously discontinued customer contracts in North America. Our adjusted gross margin was 53.6% in the fourth quarter and 53.9% in fiscal '22, an increase of 360 basis points when compared with the same periods of the prior year. These benefits were partially offset by inflationary pressures in our supply chain and manufacturing, including freight, labor and raw material costs as well as higher depreciation costs primarily related to the increasing installed base of our NexSys devices in the U.S. Price had a positive impact on the fourth quarter results, but a limited impact on our fiscal '22 since price adjustments in our Plasma business in the first 9 months of the year largely offset price benefits from NexSys and Persona conversions in the second half of fiscal '22. Adjusted operating expenses in the fourth quarter were $95.4 million, an increase of $13.4 million or 16% compared with the fourth quarter of the prior year. Adjusted operating expenses for fiscal '22 were $348.6 million, an increase of $65.6 million or 23% compared with the prior year. As a result of changes in our adjusted gross margin and adjusted operating expenses, fourth quarter adjusted operating income was $46.6 million, an increase of $16.1 million or 53%, and adjusted operating income for fiscal '22 was $187.1 million, an increase of $32.6 million or 21% compared with the prior year. As a percentage of revenue, adjusted operating income margin was 17.6% in the fourth quarter and 18.8% in fiscal '22, up 410 basis points and  basis points, respectively compared with the same periods in fiscal '21. The adjusted income tax rate was 22% for both the fourth quarter and fiscal '22 compared with 12% and 14%, respectively, for the same periods of the prior year. Fourth quarter adjusted net income was $33.5 million, up $9.6 million or 40%, and adjusted earnings per diluted share was $0.65, and 41% when compared with the fourth quarter of fiscal '21. Adjusted net income for fiscal '22 was $132.6 million, up $11.9 million or 10%, and adjusted earnings per diluted share was $2.58, up 10% when compared with the prior year. Changes in the adjusted income tax rate, higher interest expense and FX had a negative $0.10 impact on the fourth quarter and a negative $0.31 impact on the full year adjusted earnings per diluted share when compared with the prior year. At the end of the fourth quarter, total debt outstanding under the facility was $284 million, with no borrowings outstanding under the $350 million revolving credit line at the end of fiscal '22."
}