{
    "symbol": "HAE",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-09 11:55:05",
    "content": " Today we reported organic revenue growth of 5% for our second quarter of fiscal '22 and adjusted earnings per share of $0.60, down $0.02 or 3% compared with the second quarter of the prior year. North American disposable revenue increased 10% in the second quarter, driven by a 20% improvement in U.S. collection volumes compared to the prior years we observed meaningful recovery from the pandemic. Therefore, while we continue to assume significant and accelerated U.S. collection volume recovery in the second half of fiscal '22, we are lowering our plasma organic revenue growth guidance to 10% to 20%. The high end of our revised revenue guidance aligns with the midpoint of our previous guidance range of 15% to 25% and assumes a significant increase in collection volume, considerably higher in the 20% growth rate we observed in the second quarter. The low end of our revised guidance range also assumes that second half U.S. collection volumes will still grow considerably, but the rate of increase will be more consistent with the 20% growth we observed in the second quarter. Transfusion management revenue grew 5% in the quarter primarily due to strong BloodTrack growth in the UK, and 8% year-to-date, driven by strong first quarter growth in both, BloodTrack and SafeTrace Tx as we completed a series of new account installations in the U.S. We reaffirm our guidance for 15% to 20% organic revenue growth in hospital, including mid-20s Hemostasis Management organic revenue growth. Our recently acquired Vascular Closure business delivered $21 million of revenue in the second quarter and $43 million year-to-date, doubling its revenue compared to the equivalent six-month period last year. Whole blood revenue declined 11% in the quarter and 12% year-to-date, driven by lower than usual procedure volumes due to COVID-19 and previously discontinued customer contracts in North America. Chris has already discussed revenue, so I will begin with adjusted gross margin which was 52.6% in the second quarter, an increase of 40 basis points compared with the second quarter of the prior year. Adjusted operating expenses in the second quarter were $82.4 million, an increase of $16 million or 24% when compared with the prior year. In the first half adjusted operating income was $81.7 million, an increase of $10.2 million or 14% compared with the same period in fiscal ‘21. Our adjusted operating margin was 18.3% in the second quarter and 17.4% in the first half, representing decreases of 220 basis points and 20 basis points respectively, compared with the same periods in fiscal ‘21. Our adjusted income tax rate in fiscal ‘22 was 22% in the second quarter and 23% in the first half, compared with 19% and 13% in the same periods of fiscal ‘21. Second quarter adjusted net income was $30.7 million, down about $1 million or 3% and adjusted earnings per diluted share was $0.60, down 3% when compared with the second quarter of fiscal ‘21. In the first half, adjusted net income was $56.1 million, up about $1 million or 1% and adjusted earnings per diluted share was $1.09 up 1% when compared with the first half of fiscal 2021. The delay and the anticipated timing of recovery of plasma collection volumes, combined with the inflationary pressures in our global supply chain, are significant enough to revise our fiscal 2022 adjusted earnings per diluted share guidance to a range of $2.40 to $2.65 compared to our previous guidance range of $2.60 to $3. The revised guidance range of 10% to 20% on the low end, and as we said in our prepared remarks contemplates continued 20% growth, very consistent with where we were in the second quarter and at the high end of the range would be nearly double that at 35%. What we've guided for assumes on the low end of the range that we build on the performance we've already achieved year-to-date, in particular the 20% year-over-year growth in the second quarter, and that we continue upon that trajectory."
}