{
    "symbol": "HAE",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-11 12:29:16",
    "content": " Today, we reported organic revenue growth of 6% and adjusted earnings per share of $0.50, up $0.04 or 9% compared with the first quarter of the prior year. Moving to hospital, revenue grew 26% in the quarter primarily due to continued improvements in hospital procedures driving increased utilization of disposables, strong capital sales in North America, and new business opportunities in Europe. Chris has already discussed revenue, so I will start with adjusted gross margin, which was 54.7% in the first quarter, an increase of 750 basis points compared to the first quarter of the prior year. Adjusted operating expenses in the first quarter were $87.1 million, an increase of $23.4 million or 37% when compared with the prior year. Our first quarter adjusted operating income was $37.9 million, an increase of $9.4 million, or 33% compared with the prior year. First quarter adjusted net income was $25.4 million, up $1.7 million or 7% and adjusted earnings per diluted share was $0.50, up 9% when compared to the first quarter of fiscal '21. Our Vascular Closure business is exceeding original expectations, and we expect this business to be net neutral to adjusted earnings per diluted share in fiscal '22 compared with our original expectation of $0.15 to $0.20 dilution in the first year following the acquisition. Today, we announced the revised Operational Excellence Program with total gross savings of $115 million to $125 million that will deliver $80 million to $90 million in gross savings by the end of fiscal '23, which is in line with our original expectations with an additional $35 million in savings by the end of fiscal '25 with the return of volume back to pre-pandemic levels. In addition to updating the total estimated gross savings for this program, we accelerated the pace of these savings in fiscal '22 and now expect this program to deliver gross savings of approximately $33 million, an increase of $11 million or 50% when compared with our previous guidance."
}