{
    "symbol": "HAE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-08 11:46:02",
    "content": " Third quarter revenue was $260 million, an increase of 8% in reported dollars and an organic revenue decline of 1%. Year-to-date revenue was $728 million, an increase of 13% in reported dollars and an organic revenue growth of 3% versus prior year. Third quarter adjusted earnings per diluted share was $0.84, an increase of 4%, and year-to-date adjusted diluted EPS was $1.93, an increase of 2% when compared with the prior year. Plasma revenue decreased 2% in the third quarter, primarily driven by disruption from Omicron and a $6 million stocking order in the prior year. Year-to-date, Plasma revenue improved 3% compared with the prior year and was largely driven by 11% growth in U.S. collections, partially offset by the onetime stocking order and prior price adjustments, which have now fully annualized. Accordingly, we are updating our fiscal '22 Plasma revenue growth guidance to 8% to 10% compared with our previous guidance of 10% to 20% to reflect the protracted pace of collections recovery through the end of our third quarter. Revenue increased 11% in the third quarter, driven by continued procedure recovery, despite challenges posed by hospital staffing shortages and supply chain disruptions in Asia Pacific. Hemostasis Management revenue grew 18% in the third quarter and 23% year-to-date, primarily due to adoption of our TEG 6s devices and increased utilization of cartridges in North America, where we experienced 3 consecutive quarters of strong capital sales. We remain enthusiastic about the performance and potential of our Hospital business and update fiscal '22 revenue guidance to 16% to 18% growth, including mid-20s Hemostasis Management growth. We had another record sales quarter in Vascular Closure, delivering $24 million of revenue in the third quarter and $67 million year-to-date. Year-to-date, Apheresis revenue declined 1% as first half growth from a strong recovery of platelet collections in Asia Pacific and the winning of several new tenders in EMEA was offset by third quarter revenue declines. Whole Blood revenue declined 9% in the quarter and 11% year-to-date, driven by lower transfusions due to reduced hospital procedures, collection center staffing shortages and previously discontinued customer contracts in North America. In the third quarter, we reported our highest adjusted gross margin in company history of 54.9%, an increase of 350 basis points compared with the third quarter of the prior year. Adjusted operating expenses in the third quarter were $83.8 million, an increase of $12.8 million or 18% compared with the prior year. Adjusted operating expenses year-to-date were $253.2 million, an increase of $52.2 million or 26% compared with the prior year. Third quarter adjusted operating income was $58.8 million, an increase of $6.2 million or 12%. And year-to-date adjusted operating income was $140.5 million, an increase of $16.4 million or 13% compared with the same period in fiscal '21. Adjusted operating margin was 22.6% in the third quarter and 19.3% year-to-date, representing increases of 70 basis points and 10 basis points, respectively, compared with the same periods in fiscal '21. The adjusted income tax rate was 21% in the third quarter and 22% year-to-date compared with 16% and 15% in the same periods of fiscal '21, respectively. Third quarter adjusted net income was $42.9 million, an increase of $1.5 million or 4%, and adjusted earnings per diluted share was $0.84, an increase of 4% when compared with the third quarter of fiscal '21. Year-to-date adjusted net income was $99 million, an increase of $2.2 million or 2%, and adjusted earnings per diluted share was $1.93, an increase of 2% when compared with the first 9 months of fiscal '21."
}