{
    "symbol": "SJW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 19:13:04",
    "content": " This compares favorably to 2021 quarterly revenue of $139.7 million, reflecting a 23% increase and net income of $18 million, reflecting an 86% increase and a diluted EPS of $0.60, reflecting an 82% increase. This compares favorably to 2021 annual revenue of $573.7 million, reflecting an 8% increase; net income of $60.5 million, which reflected a 22% increase or diluted EPS of $2.03, reflecting a 20% increase. As you can see, the 20% year-over-year increase in diluted earnings per share for 2022 was primarily driven by revenue increases of $1.56 per share, which I will break down for you shortly. Inflation impacted the company's earnings in 2022, particularly due to investments in our employees that help drive the increase in administrative and general as well as higher interest costs due to the interest rate increases in addition to new investments in infrastructure that benefit our customers. The revenue increase was mostly driven by $38.7 million in cumulative water rate increases and $20.7 million in the true-up related to the San Jose Water Company general rate case that was approved and recognized in the fourth quarter and retroactive to January 1, 2022. Two of the debt issuances; Connecticut Water Company's $25 million senior notes and San Jose Water Company's $70 million senior notes were funded on December 15, 2022 and January 25, 2023. As was mentioned earlier, in the fourth quarter, we realized the full benefit of the CPUC approved settlement agreement between San Jose Water Company and the Public Advocates Office for the 2021 GRC that covers 2022 through 2024 interim and outstanding revenue for 2022 of $25.1 million, as well as the recovery of memorandum and balancing accounts amounting to $18.2 million. If approved by the Public Utilities Regulatory Authority, as filed, the increase would generate $3.1 million in annualized revenues and will bring the cumulative WICA to just over 6%. Since our last General Rate Case in 2014, the company has invested more than $43 million in drinking water and wastewater infrastructure that is in service and providing a benefit to customers."
}