{
    "symbol": "BOOM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 23:00:22",
    "content": " Order backlog increased 16% sequentially during the fourth quarter, and now stands at a 10-year high of $55.5 million. Quickly recapping our top line results, fourth quarter sales were 175.1 million flat with this yearâ\u0080\u0099s third quarter, but up 36% year-over-year and on a pro forma basis. Arcadiaâ\u0080\u0099s fourth quarter sales were $74.4 million, down 8% sequentially, but up 31% compared to the prior year pro forma sales. DynaEnergetics reported fourth quarter sales of $77.6 million, up 10% sequentially driven by North American market demand compared with a prior year quarter sales grew over 50% driven by a 56% growth in DynaStage system units sold in a modest price increase in North America. Looking at our fourth quarter expenses, consolidated SG&A was $30.6 million, which was flat with the previous quarter and up $5.7 million compared with a pro forma fourth quarter in 2021. Adjusted EBITDA attributable to DMC was $19.6 million, which was down 10% sequentially, but up over 150% compared to the prior year quarter on a pro forma basis. DynaEnergetics reported fourth quarter adjusted EBITDA of $14.4 million, which reflects 4% growth quarter-over-quarter and over 260% growth year-over-year. NobelClad reported adjusted EBITDA of $3.4 million, which was flat sequentially and up 60% compared to the fourth quarter of 2021. Looking at guidance, first quarter sales are expected to be in a range of $168 million to $178 million versus the $175.1 million reported in the 2022 fourth quarter. At the business level, Arcadia is expected to report sales in a range of $70 million to $75 million versus the $74.4 million reported in the fourth quarter. First quarter selling, general, and administrative expense is expected in a range of $32 million to $33 million versus the $30.6 million reported in the 2022 fourth quarter. First quarter guidance on SG&A expense includes approximately $2 million of patent litigation expense at DynaEnergetics, but excludes approximately $1.5 of cost related to the resignation of the former DMC CEO. We expect our SG&A run rate will be below $30 million per quarter by the end of the year, excluding one-time expenses and will also decline as a percent of sales. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live."
}