{
    "symbol": "BOOM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 06:32:04",
    "content": " Consolidated third quarter sales were a record $174.5 million, which were up 5% from the second quarter and up 160% from the third quarter last year. Excluding $80.7 million in revenues from Arcadia in which we acquired a 60% controlling interest last December, third quarter sales increased 5% sequentially and 40% versus the third quarter of 2021. DynaEnergetics third quarter sales were $70.4 million, up 4% sequentially and up 59% versus last year's third quarter. Arcadia, our Architectural Building Products business reported third quarter sales of $80.7 million, up 6% sequentially and up 24% versus pro forma sales in last year's third quarter. Third quarter sales at NobelClad, our composite metals business were $23.4 million, up 7% sequentially and up 2% versus last year's third quarter. Third quarter sales were $174.5 million, up 5% versus this year's second quarter. Arcadia's third quarter sales were $80.7 million, up 6% sequentially. DynaEnergetics reported third quarter sales of $70.4 million, up 4% sequentially. Consolidated gross margin in the third quarter was 29% down from 31% in the second quarter, and up from 25% in last year's third quarter. The gross margin improvement compared to last year's third quarter, reflects higher sales volume on fixed manufacturing overhead expenses at DynaEnergetics. DynaEnergetics reported third quarter gross margin of 30% flat versus the second quarter and up from the 22%, in last year's third quarter. NobelClad's third quarter gross margin was 27% versus 28% in the second quarter and 30% in the year ago third quarter, primarily due to a less favorable project mix and the impact of the prior year Cares Act credits, respectively. Looking at our third quarter expenses, consolidated SG&A was $30.5 million and included $12.9 million of SG&A from Arcadia compared to $15.3 million in the same quarter last year. Third quarter adjusted net income attributable to DMC was $6.7 million or $0.35 per diluted share versus adjusted net income of $403,000 or $0.02 per diluted share in last year's third quarter. At the business level, Arcadia is expected to report sales in the range of $70 million to $75 million versus the $80.7 million reported in the third quarter. Fourth quarter selling general and administrative expense, is expected in the range of $31 million to $32 million versus the $30.5 million reported in the 2022 third quarter. Fourth quarter adjusted EBITDA, attributable to DMC is expected to be in the range of $15 million to $18 million versus $21.8 million, in the 2022 third quarter."
}