{
    "symbol": "BOOM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 10:54:01",
    "content": " Our consolidated second quarter sales were record $165.8 million, up 20% from the first quarter and up 153% versus the second quarter of 2021. Excluding revenues from Arcadia, which we acquired a 60% controlling interest in during last yearâ\u0080\u0099s fourth quarter, second quarter sales were up 26% sequentially and up 37% versus the second quarter last year. Second quarter sales at DynaEnergetics, our energy products business increased 38% sequentially to $67.5 million. Second quarter sales at Arcadia, our architectural building products business increased 12% sequentially to $76.5 million. Excluding the Arcadia acquisition consolidated sales were $89.4 million, an increase of 37% versus the second quarter of 2021. Arcadia reported second quarter sales of $76.5 million, up 12% sequentially. DynaEnergetics reported second quarter sales of $67.5 million, up 38% sequentially and 60% versus the same quarter last year. Sales at NobelClad were $21.9 million, flat sequentially and down 6% versus last yearâ\u0080\u0099s second quarter. Second quarter gross margin benefited from the acquisition of Arcadia, which had a higher gross profit percentage than DMCs legacy business units, as well as the impact of higher sales volume on fixed manufacturing overhead expenses, combined with higher average selling prices at DynaEnergetics. Arcadia reported second quarter gross margin of 34%, an increase versus 30% in the first quarter driven by pricing actions. Looking at our second quarter expenses, consolidated SG7A was $29.4 million and included $11.4 million of SG&A from Arcadia, compared to $14 million in the same quarter last year. Arcadia reported second quarter adjusted EBITDA attributable to DMC of $9.8 million, DynaEnergetics reported second quarter adjusted EBITDA of $13.3 million, while NobelClad reported adjusted EBITDA of $3.4 million. Looking at guidance, third quarter sales are expected to be in a range of $155 million to $163 million versus the $165.8 million reported in the 2022 second quarter. At the business level, Arcadia is expected to report sales in a range of $70 million to $73 million versus the $76.5 million reported in the second quarter. Third quarter selling, general and administrative expense is expected in the range of $30 million to $31 million versus the $29.4 million reported in the 2022 second quarter. Cameron, your line is live. Again strong first half of the year, strong sequential growth in the second quarter, it sounds like next quarter, the current quarter 3Q, we might see some dip in margins, just given the high aluminum prices earlier on in the year. Stephen, your line is live. Gerry, your line is live. Stephen, your line is live. Gerry, your line is live. Our litigation costs, I think, year-to-date, are around $4 million and I think they were $1.7 million in the quarter and we are -- thatâ\u0080\u0099s a comfortable rate for us right now that we actually see probably less spending in the second half of this year compared to the first half of the year, primarily because of the court systems and how things are working their way through the court systems. Cameron, your line is live."
}