{
    "symbol": "CMI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-06 14:37:05",
    "content": " Excluding the Meritor business, revenues for the fourth quarter of 2022 were $6.6 billion, an increase of 13% from the fourth quarter of 2021, primarily driven by increased demand in many of our North America markets. With these exclusions considered, EBITDA was $1.1 billion or 16.1% of sales in Q4, above our guidance of 15.5% and stronger than the $705 million or 12.1% reported a year ago. Also excluding Meritor, the costs related to the planned separation of the filtration business and the impact of the indefinite suspension of our Russia operations, full year EBITDA was $4 billion or 15.1% of sales compared to $3.5 billion or 14.7% of sales in 2021. Our reported full year 2022 results include five months of operational performance for Meritor or $1.9 billion of revenue and $26 million of EBITDA, including $115 million of acquisition, integration and purchase accounting related costs. We are forecasting total company revenues for 2023 to increase 12% to 17%, compared to 2022 and EBITDA to be 14.5% to 15.2% of sales, driven by the inclusion of a full year of sales from Meritor, continued strength in the North American truck market, improved demand in power generation markets, overall pricing improvement and slow improvement in the China on-highway markets. In New Power, we expect full year sales to be $350 million to $400 million, more than doubling our 2022 revenues. Within Components, we expect Meritor to add $4.5 billion to $4.7 billion in revenue in 2023 with EBITDA margins in the range of 10.3% to 11%, an improvement from the comparable 2022 EBITDA margin of 7.2%. First, we delivered strong results in the fourth quarter of 2022, exceeding our own projections for revenue and EBITDA from three months ago, and we delivered stronger margins Engines, Components, Distribution and Power Systems compared to a year ago. Full year 2022 results included five months of operational performance for Meritor, yielding $1.9 billion of revenue, $26 million of EBITDA, reflecting $115 million of acquisition, integration and purchase accounting related costs. Selling, admin and research expenses increased by $52 million or 6% due to higher compensation and research costs as we continue to invest in new products and capabilities to support future profitable growth, particularly in the Engines and New Power segments. Weâ\u0080\u0099ll continue to focus on raising margins in our core business, driving improvements in the performance of Meritor, generating strong cash flow and investing in the products and technologies that position us to lead in the adoption of new technologies and penetrate new markets through our New Power business. We have $4.5 billion to $4.7 billion in revenue and EBITDA margins for the Meritor business, 10.3% to 11% compared to in 2022, that was 7.2%."
}