{
    "symbol": "CODX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 22:41:03",
    "content": " The company's execution during the quarter remained strong as we continued to make progress on the optimization of the Co-Dx PCR Home testing platform, along with development of our other business sectors and in-demand PCR products with quarter-on-quarter revenue remaining steady. This is why our focus has been and continues to be on defining and focusing on the total addressable market for our new Co-Dx PCR Home platform and ensuring its robustness, quality and versatility will stand the test of time as the world pivots to a new reality of more widespread at-home and point-of-care testing for a range of infections. In addition to other products we have discussed in previous public statements such as our ongoing development of a multiplex STI panel to detect and differentiate between four prevalent causes of sexually transmitted infections, the company has rolled out one product for monkeypox, with another multigene monkeypox test in active development, and continues to work on its upper respiratory panel test, which includes markets for RSV, an illness currently experiencing a worrying and unusually early surge in 2022 within the United States. Overall, we believe our advancements in the field of at-home/point-of-care PCR testing, team of experts working diligently to achieve our shared company vision, growing product pipeline and our practice of letting financial intelligence drive our smart spending are positioning Co-Diagnostics to execute against our strategic growth initiatives. And we are anticipating some material ramifications of those NGOs in dealing with our new platform, which enables them to put a very inexpensive solution in the hands of laboratories and governments and other end users around the world with the device that costs in the neighborhood of $300 at retail and tests that are very inexpensive compared to what's offered by the competition. To conclude today's call, I want to highlight the progress the company has made since the beginning of the pandemic in developing a long-term strategy around our exceptional new Co-Dx PCR Home platform. Beginning in the spring of 2020, the company recognized that COVID-19 could be the catalyst for creating a new platform, whereby the company's proprietary CoPrimer technology could be combined with an inexpensive instrument that could drive testing down to the at-home and point-of-care markets, and not just for COVID-19, but for a whole range of diseases such as flu, RSV, STIs, tuberculosis and others."
}