{
    "symbol": "CODX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 18:37:05",
    "content": " Our proven record of accomplishments in the last three years was accompanied not only by increased visibility in the world of diagnostics and a vastly increased distributor and customer base, but also the resources and connections to manifest a key element of our vision since our founding 10 years ago this year, reduction of healthcare costs around the globe by democratizing infectious disease testing made possible, thanks to a platform bringing the highest level of quality and diagnostics directly to the people and places who need it the most. As has been shared previously, the company's real time PCR platform has been developed for detection of infectious diseases in at home and point of care settings and multiplex panels are planned to follow after receipt of the platform's initial regulatory authorization by the FDA. Throughout the course of 2022, we continued to make progress on the optimization of the new Co-Dx PCR Home platform and defining its total addressable market at launch, along with development of our other business sectors and our in demand PCR products. We believe that the new platform's versatility that has garnered so much interest by NGOs is augmented by its durability, our highly experienced and renowned team of developers, scientists and engineers tasked with bringing the Co-Dx PCR Home platform from concept to reality have remained fixed on the objective of building a durable platform technology that has the potential to address the needs in a variety of industries, fueling future growth. Clinical trials for the new platform to support our FDA EUA submission are ongoing, because the evaluations are dependent on identifying, enrolling a particular number of both symptomatic and asymptomatic COVID-19 positive and negative patients at testing sites, the company will not be providing projected timelines for completion at this time. The device has been designed to incorporate specialized optics and other innovative features to accommodate multiplex assays as we expand its future suite of products to include additional respiratory, STI and other infectious diseases utilizing our Co-Primers technology, this patented molecule has unique properties associated with facilitating multiplex PCR and we intend to bring the full power and capabilities of our patented technology to our new Co-Dx PCR platform. In addition to other products we have discussed in previous public statements, such as our ongoing development of a multiplex STI panel to detect and differentiate between four prevalent causes of sexually transmitted infections for both the new platform and our centralized lab business channel, the company rolled out two products for mpox last year in response to an urgent health concern generated by that virus and continues to work on its upper respiratory panel multiplex for centralized labs as well. Overall, we believe our advancements in our at home point of care real time PCR testing platform, team of experts working diligently to achieve our shared company vision, growing product pipeline and our practice of letting financial intelligence drive our smart spending during 2022, position Co-Diagnostics to execute against our strategic growth initiatives. Whether through the new platform, our existing and successful centralized laboratory vertical or even by providing PCR tools for vector control services to be more efficient and effective, our mission remains the same, preserving life by reducing the spread of infection disease and making our robust gold standard real time PCR testing solutions available to as many people and as many places as possible."
}