{
    "symbol": "CREX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 12:12:09",
    "content": " Revenues generated from our core digital signage products and services increased $6.6 million or 133% in 2022, as compared to 2021. Had the companies completed the Merger as of December 31, 2021, the combined company would have revenue in excess of $12 million during the three months ended March 31, 2022. Services and other revenues were $4.3 million in 2022, an increase of $2.1 million, or 96% with the inclusion of 44 days of Reflect in the consolidated results. Managed services revenue, which includes both software-as-a-service SaaS and help desk technical subscription services, were $2.7 million in the three months ended March 31, 2022 as compared to $1.3 million in the same period in 2021, which included $0.8 million contributed by Reflect for the 44 days from February 17 through March 31, 2022. The Company's annual recurring revenue run-rate now exceeds $13.5 million as of March 31, 2022. Sales and marketing expenses increased by $0.4 million, or 111%, from $0.3 million and to $0.7 million in 2022, driven by the acquisition of Reflect during the period. Research and development expenses increased $0.1 million, or 41% in 2022, from $0.1 million during the three months ended March 31, 2021 to $0.2 million during the three months ended in 2022, driven primarily by the acquisition of Reflect. Our general and administrative expenses excluding bad debt expense, increased $0.6 million, or 31%, from $2.1 million during the three months ended March 31, 2021 to $2.7 million during the three months ended March 31, 2022. Bad debt expense returned to a more normalized rate of $0.1 million during the three months ended March 31, 2022, representing an increase of $0.6 million as compared to the prior year as the result of a bankruptcy recovery in the same period in 2021. Our operating loss was $1.0 million during the three months ended March 31, 2022, inclusive of the following $1.7 million in non-cash charges. Our net income was $2.5 million during the three months ended March 31 2022, and included a $5.5 million gain on marking outstanding warrants to fair value, a $1.2 million non-cash charge related to the issuance of warrants in exchange for a debt waiver, a $0.5 million of interest expense $0.2 million of which represents non-cash amortization of debt discount, recorded in conjunction with the issuance of warrants and $0.3 million loss related to amending and extending our debt facilities. For balance sheet highlights the company's unrestricted cash position as of March 31 2022, was approximately $6 million, which we believe when combined with our accounts receivable and SaaS contract billings provides sufficient cash runway to service our debt and operate our business moving forward. I previously provided fiscal year 2022 guidance of at least $43 million in revenue, which is 40% more than the $30.7 million 2021 pro forma combination of CRI and Reflect."
}