{
    "symbol": "CREX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 16:37:03",
    "content": " The results are in line with our previously stated target of achieving at least $43 million of revenue in the current year, a 40% organic growth rate from the pro forma combined company results in 2021. Point number two, EBITDA and adjusted EBITDA for the third quarter of 2022 was $1.5 million and $1.2 million, respectively, improving our adjusted EBITDA margin from 8.5% in Q2 to 11.2% in Q3, bringing our year-to-date adjusted EBITDA for the 9 months ended September 30, 2022 to 8.6%. Through the September 30, we have grown our ARR run rate to be in excess of $14.5 million and we remain on track to achieve the growth targeted for the current year based on known and expected commitments anticipated for the fourth quarter of 2022. Based on known and anticipated customer commitments for the coming year, we are increasing our previously communicated revenue target to $54 million, representing a 25% organic growth rate incremental to the 40% organic growth rate we have achieved in 2022. Revenues for the 3 months ended September 30, 2022, were $11.2 million, representing an increase of $6.4 million or 135% as compared to the same period in 2021, driven in part by the acquisition of Reflect on February 17, 2022 and the company's successful sales activities as a combined company post-merger. During the 3 months ended September 30, 2021, the pro forma combined results of CRI and Reflect produced $7.7 million in revenues. The current year combined company results for the 3 months ended September 30, 2022, representing an increase of $3.5 million or 45% over the pro forma combined results for the same period in 2021. This year-to-date organic revenue growth rate was 53% as compared to the pro forma combined 2021 9 months ended September 30, 2021. Hardware revenues were $5 million in the 3 months ended September 30, 2022, representing an increase of $2.8 million or 126% as compared to the prior year, driven by continued large-scale LED deployments in the quarter by multiple customers. Services and other revenues were $6.2 million in the 3 months ended September 30, 2022, an increase of $3.6 million or 143% with the inclusion of Reflect operations in the company's consolidated results for the full reporting period. Managed services revenue which includes both our SaaS and help desk technical subscription services were $3.9 million in the 3 months ended September 30, 2022, as compared to $1.4 million in the same period in 2021, driven by the continued expansion in our SaaS software subscription base. Gross profit increased by $2.2 million or 92% during the 3 months ended September 30, 2022, as compared to the same period in 2021, driven by an increase in revenue but offset by a reduction in gross profit margin. Gross profit margin decreased to 40.4% from 49.4% driven by less favorable revenue mix during the 3 months ended September 30, 2022, related to several material customer hardware rollouts during the year that had a lower gross profit margin than our software services. The prior year included a benefit of $50,000 related to ERC credits, resulting in a net reduction in R&D expenses year-over-year for the 3 months ended September 30, 2022. General and administrative expenses increased $1 million or 54%, driven primarily by the acquisition of Reflect in February of 2022 and the prior year inclusion of approximately $200,000 of a benefit from employee retention credits. With respect to operating loss, net loss and EBITDA, operating loss was $284,000 during the 3 months ended September 30, 2022 which includes $800,000 and $500,000 in noncash charges for both the amortization of intangible assets and noncash employee and director stock compensation, respectively. Net loss was $600,000 during the 3 months ended September 30, 2022 which included a $400,000 gain on marking outstanding contingent liabilities to fair value and $800,000 in interest expense, including $400,000 in amortization of debt discount included within interest expense. EBITDA was $1.5 million and adjusted EBITDA was $1.2 million for the 3 months ended September 30, 2022. One other item of note in the financials, we did have a change in the fair market value of our contingent consideration during the 3 months ended September 30, 2022, with a mark-to-market contingent consideration issued in the Reflect merger which resulted in a gain of $442,000, primarily driven by an increase in interest rates and volatility in the period. With our increased revenue guidance issued today of $54 million for 2023 and the anticipated growth in our ARR, we anticipate expanding our adjusted EBITDA margins to 15% in 2023. At scale which we define as $100 million in revenue, we believe this is a 30% plus adjusted EBITDA margin business that will deliver significant free cash flow."
}