{
    "symbol": "PEPG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-25 10:58:06",
    "content": " Perhaps most encouragingly, we observed the accumulation of exon-51 skip transcripts from Day 10 to Day 28 at 5, 10 and 15 mg/kg dose levels, which we believe to be supportive of the potential for both the accumulation of skip transcripts and the accumulation of functional dystrophin protein in our planned repeat dose clinical trials in patients with Duchenne muscular dystrophy for DMD. As an example, following a single dose at 10 mg/kg, we observed levels of exon skipping up to 1.4% in healthy volunteers, sevenfold higher than previously reported results following a single dose in human mix based on a cross-trial comparison from publicly available data. As we reported at the Muscular Dystrophy Association, or MDA meeting earlier this week, we observed following a single dose of 20 mg/kg of EDO51 in male wild type non-human primates, 2.5% exon-skipping by ddPCR, the same method used to assess exon skipping in our Phase 1 human clinical trial. Based on encouraging non-clinical and Phase 1 healthy volunteer clinical data, PepGen is planning to initiate two clinical trials to assess the safety and efficacy of repeat doses of EDO51 in boys and young men living with DMD. As we have previously communicated in the first half of 2023, we expect to initiate an open label Phase 2 13-week multiple ascending dose or MAD clinical trial CONNECT1-EDO51 with four monthly doses in boys and young men living with DMD pending approval of the clinical trial application by Health Canada. In our mdx mice study received dosing with 30 mg/kg of PGN-EDO23 every 4 weeks and in our non-human primate study, in which NHPs were dosed with 20 mg/kg of EDO51 every 4 weeks, we observed stacking of exon skipping in both the species and accumulation of dystrophin protein in mdx mice after four doses. Following on our successful Phase 1 trial of EDO51 in healthy volunteers, we are planning to initiate two clinical trials to assess the safety and efficacy of repeat monthly doses of EDO51 in boys and young men living with DMD."
}