{
    "symbol": "PDCE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 16:59:05",
    "content": " Let me open by saying over PDC's entire 50-year history, 2022 stands as the most successful year by almost every measure, a record free cash flow level of $1.4 billion, $1 billion of which was returned to our shareholders in the form of share repurchases, our fixed dividends and a $0.65 per share special dividend this past December, production for the company, a record 85 million BOE. Free cash flow is anticipated to be $825 million, that's at $75 oil and $3 natural gas, on a capital spend of approximately $1.4 billion. The table on this slide highlights our per well reserves for a 2-mile laterals, which range from approximately 460,000 barrels with 48% oil in the Northern black oil window to 900,000 barrels equivalent with 20% oil in the retrograde gas window. While the EURs and oil mix percentages vary between each of these phase windows, the key takeaway is that all four phase windows deliver exceptional economics that range from 63% to 96% internal rates of return based on $75 oil and $3 gas. Starting on Slide 15 and has already been â\u0080\u0093 as has already been pointed out on the call, 2022 was an exceptional year operationally for PDC, and that has translated to approximately $1.4 billion in free cash flow, a record for the company. Using the midpoint of our anticipated 2023 capital investment guidance and the ability to generate more than $2 billion in adjusted cash flow from operations in a $75 per barrel and $3 gas world, we target being able to return more than $550 million to our shareholders in 2023. In the first quarter, the company expects to invest between $400 million and $475 million, with total production being in the range of 240,000 to 255,000 BOE per day and 78,000 to 84,000 barrels per day of oil production. In the second quarter, the company plans to invest between $325 million and $400 million and total production to be in the range of 257,000 to 272,000 BOE per day and 84,000 to 90,000 barrels per day of oil production. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}