{
    "symbol": "DAVA",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-15 12:13:02",
    "content": " We reported another solid quarter with revenue totaling Â£196.2 million for Q1 of our fiscal year 2023, representing a 33% year-on-year increase from Â£147.5 million in the same period in the prior year. Importantly, we continued growing the number of larger clients with a total of 140 clients paying us in excess of Â£1 million per year, compared to 93 in the same period last year, representing an impressive 51% year-on-year increase. Endava's revenue totaled Â£196.2 million for the three months ended September 30, 2022 compared to Â£147.5 million in the same period in the prior year, a 33% increase over the same period in the prior year. Our adjusted profit before tax for the three months ended September 30, 2022 was Â£39.5 million compared to Â£34.8 million for the same period in the prior year. Our adjusted profit before tax margin was 20.1% for the three months ended September 30, 2022, compared to 23.6% for the same period in the prior year. Our adjusted diluted EPS was Â£0.54 for the three months ended September 30, 2022, calculated on 58.1 million diluted shares as compared to Â£0.49 for the same period in the prior year calculated on 57.8 million diluted shares. Revenue from our 10 largest clients accounted for 33% of revenue for the three months ended September 30, 2022, compared to 36% for the same period last fiscal year. Additionally, the average spend per client from our 10 largest clients increased from Â£5.3 million to Â£6.4 million for the three months ended September 30, 2022, representing a 20.3% year-over-year increase. In the three months ended September 30, 2022, North America accounted for 35% of revenue compared to 36% in the same period last fiscal year. Europe accounted for 22% of revenue compared to 20% in the same period last fiscal year, and the U.K. accounted for 40% of revenue compared to 41% in the same period last fiscal year, while the rest of the world accounted for 3% unchanged from the same period last fiscal year. Revenue from North America grew 26.1% for the three months ended September 30, 2022 over the same quarter of fiscal year 2021. Revenue from Payments and Financial Services grew 38.3% for the three months ended September 30, 2022. Revenue from TMT grew 21.5% for the three months ended September 30, 2022 over the same quarter of 2021 and accounted for 23% of revenue compared to 25% in the same period in the prior year. Revenue from other grew 33.9% for the three months ended September 30, 2022 over the same quarter of 2021 and now accounts for 25% of revenue, unchanged compared to the same period in the prior year. Our adjusted free cash flow was Â£21.8 million for the three months ended September 30, 2022 compared to Â£16.5 million during the same period last fiscal year. CapEx for the three months ended September 30, 2022 as a percentage of revenue was 1.7% compared to 2.3% in the same period last fiscal year. Our guidance for Q2 fiscal year 2023 is as follows: Endava expects revenues to be in the range of Â£204 million to Â£206 million, representing constant currency revenue growth of between 23% and 24%. Our guidance for full year fiscal year 2023 is as follows: Endava expects revenues to be in the range of Â£843 million to Â£852 million, representing constant currency growth of between 23% and 24%."
}