{
    "symbol": "DAVA",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-14 13:56:18",
    "content": " We reported another solid quarter with revenue totaling Â£205.2 million for Q2 of our fiscal year 2023, representing a 30.2% year-on-year increase from Â£157.7 million in the same period in the prior year. As a result, we continued growing the number of larger clients with a total of 156 clients paying us in excess of Â£1 million per year compared to Â£107 million in the same period last year, representing an impressive 46% year-on-year increase. We also saw the cohort of our largest clients, those spending over Â£5 million per year with us, grow by 48% from 21% in the same period last year to 31% last quarter. Endava's revenue totaled Â£205.2 million for the 3 months ended December 31, 2022, compared to Â£157.7 million in the same period in the prior year, a 30.2% increase over the same period in the prior year. Our adjusted profit before tax for the 3 months ended December 31, 2022, was Â£41.9 million compared to Â£33.0 million for the same period in the prior year. Our adjusted profit before tax margin was 20.4% for the 3 months ended December 31, 2022, compared to 20.9% for the same period in the prior year. Our adjusted diluted earnings per share or EPS was Â£0.57 for the 3 months ended December 31, 2022, calculated on Â£58.0 million diluted shares as compared to Â£0.46 for the same period in the prior year calculated on Â£58.0 million diluted shares. Revenue from our 10 largest clients accounted for 31% of revenue for the 3 months ended December 31, 2022, compared to 34% for the same period last fiscal year. Additionally, the average spend per client from our 10 largest clients increased from Â£5.4 million to Â£6.5 million for the 3 months ended December 31, 2022, representing a 19% year-over-year increase. In the 3 months ended December 31, 2022, North America accounted for 33% of revenue compared to 35% in the same period last fiscal year. Europe accounted for 23% of revenue compared to 21% in the same period last fiscal year and the U.K. accounted for 39% of revenue compared to 41% in the same period last fiscal year, while the rest of world accounted for 5% compared to 3% in the same period last fiscal year. Revenue from North America grew 22.6% for the 3 months ended December 31, 2022, over the same quarter of fiscal year 2022. Revenue from payments and financial services grew 35.4% for the 3 months ended December 31, 2022. Revenue from TMT grew 13.3% for the 3 months ended December 31, 2022, over the same quarter of fiscal year 2022 and accounted for 22% of revenue compared to 25% in the same period in the prior year. Revenue from other grew 36.6% for the 3 months ended December 31, 2022, over the same quarter of fiscal year 2022 and now accounts for 25% of revenue compared to 24% in the same period in the prior year. Our adjusted free cash flow was Â£37 million for the 3 months ended December 31, 2022, compared to Â£31.2 million during the same period last fiscal year. CapEx for the 3 months ended December 31, 2022, as a percentage of revenue was 2.0% compared to 2.4% in the same period last fiscal year."
}