{
    "symbol": "CVGW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-01 23:10:24",
    "content": " Grown segment revenue was $207.6 million, down about $3 million from the second quarter, as the average selling price of avocados increased by 14%, while avocado volumes were about 10% lower due to supply constraints in Mexico and intentional steps taken to maintain margins. The decrease primarily was due to a $6.4 million decline in gross profits in the Grown segment from the volume constraints, inventory sell-through challenges and margin management decisions Brian outlined. Within Prepared, the former RFG portion of the segment realized a significant increase in gross profit from ongoing operational initiatives, achieving a 7.7% gross margin from just over 2% in the prior quarter. The improvement was even more pronounced relative to the negative 5.4% gross margin in the prior-year quarter, which included some unfavorable one-time adjustments, representing a recovery of almost $15 million year-over-year. For additional perspective on segment performance, year-to-date gross profit through the third quarter totaled $53.5 million, up from $48.3 million for the prior year. In the Grown segment, year-to-date gross profit per carton for avocados increased by over 20% or almost $10 million. The gross profit increase of $4 million in Prepared consisted of a $14 million recovery in the former RFG portion of the segment, much of which occurred in the third quarter, partly offset by an almost $10 million decline attributed to our guacamole line from input cost pressure. SG&A was $16.7 million for the quarter, or 4.9% of sales, while about in line with $16.6 million from the second quarter of 2022, the third quarter also included an increase of $800,000 associated with our new performance based bonus plan. Adjusted EBITDA was $8.1 million for the third quarter, down from $12.7 million in the second quarter of 2022, mainly driven by lower gross profit in the Grown segment, partly offset by higher gross profit in Prepared. Relative to prior year, third quarter adjusted EBITDA was up $7 million, primarily on higher gross profit in Prepared. On a year-to-date basis, adjusted EBITDA totaled $25.5 million, about flat to prior year, as higher segment gross profit of about $5 million was offset mostly by higher SG&A, attributed primarily to increased compensation and bonus expense and other costs."
}