{
    "symbol": "CVGW",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-20 21:47:02",
    "content": " Grown gross profit increased by $2.4 million to about $50 million for the year, as higher gross profit per carton, resulting from our margin management efforts more than offset volume declines caused by lower supply from Mexico. Grown segment revenue was $119 million, down $88 million from the third quarter, as the average selling price of avocados decreased by 45% from historically high summer prices, while avocado volumes were about 2% lower as a result of our margin management efforts. Prepared segment revenue was $125 million, down $10 million from the third quarter, primarily due to seasonally weak volume in the Fresh Cut division. Consolidated gross profit was $20.4 million, up $1.8 million from the third quarter, primarily driven by a $5 million increase in gross profits in the Prepared segment, partially offset by a $3 million sequential decrease in Grown. Grown gross profit fell sequentially, as avocado volume declined about 2% and we manage the business for margin during the quarter, amid still challenging supply/demand conditions for most of the quarter. For the fiscal year gross profit totaled $73.8 million, up about 29% from $57.4 million in the prior year. Adjusted EBITDA was $9.6 million for the quarter, up from $8.1 million in the third quarter of 2022, mainly driven by the gross profit increase in Prepared. Relative to prior year, fourth quarter adjusted EBITDA was up $8.2 million, primarily driven by a $10.1 million gross profit increase in Prepared. For the year adjusted EBITDA totaled $35.1 million, up from $26.8 million in the prior year, as higher gross profit in both Prepared and Grown was partly offset by higher SG&A costs. We also expect to invest approximately $18 million in CapEx in 2023, as we pursue more profit improvement and growth projects primarily in our Prepared business. I mean, think about the Grown segment, we had an avocado business that saw 15% less Mexican volume in the market, market prices that went from $35 a case to $70 a case back to $30 a case. And somehow in all of that, in that Grown business, we managed to deliver gross profit per case, that was what -- for the year anyway, over a course of time, right in the middle of our guidance of $3 a case to $4 a case. They will still be a little bit of seasonality and it will be less than that, and I am sure in the first quarter, probably, less than that in the fourth quarter, but annually, very similar to how we guide annually to the gross margin per case in avocado business, annually we ought to think about that Fresh Cut business as 10% to 12% exit rate headed into 2024. So, in general, I think, you are going to see a strategy that comes out thatâ\u0080\u0099s based on growth across all of our segments, Grown, Prepared, and then even in Prepared in both Fresh Cut, as well as guacamole, and then you will see a segment that or at least a guardrail based upon return on invested capital, because we think, thereâ\u0080\u0099s really smart investments that we can make and then thereâ\u0080\u0099s some investments that might get us growth, but none of us would be happy about and I am not interested in those. So, yeah, CapEx expectations next year about $18 million versus about $10 million this year and so think of that, probably, call it, $1 million to $2 million that is just a matter of timing, so spend that we expected to make in 2022 that slipped into 2023. But the remaining increment, call it, between $12 million and $18 million, that represents incremental profit improvement projects in 2023 versus 2022, most of that is going to be concentrated in the Prepared business. We will have a Prepared Fresh Cut business that grows distribution with its existing customers and new customers, and exits the year on a 10% to 12% gross profit margin run rate."
}