{
    "symbol": "CIVI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 12:36:06",
    "content": " I would like to welcome everyone to the Civitas Resources First Quarter 2022, earnings call. Good morning and welcome to Civitas ' First Quarter 2022 Earnings Conference Call I'm joined today by Ben Dell, Chairman. Yesterday we issued our earnings press release, filed our 10-Q and posted a new Investor Presentation, which is available on the Investor Relations section of our website. Please be aware that on today's call, we may make forward-looking statements. Please read our full disclosures regarding forward-looking statements in our 10-K and other SEC filings on today's call, we may also refer to certain non-GAAP financial metrics, reconciliations to certain non-GAAP metrics can be found in our earnings release and SEC filings. I'd like to start out the call today by introducing our new CEO, Chris Doyle. Chris has over 25 years of domestic and international experience in the E&P and midstream businesses, having set the foundation for his career by spending over two decades at Chevron, Anadarko. Chris has a strong track record of leading diversified teams and platforms across the E&P and midstream businesses is experience judgment, perspective in leadership qualities, will be instrumental as we continue to thoughtfully grow the Civitas plant, with a clear objective of becoming a national leader among our peers, while advancing the principles of the new E&P business model. He's already made a tremendous start this week, and we look forward to all of you getting to meet with him and hearing directly from him in the coming weeks. The first quarter of 2022 was another stellar quarter for the company execution-wise, with production of a 159 thousand barrels of oil equivalent per day, and 68 thousand barrels of oil today. Civitas  will be our budget on oil and total production, as well as on all operating and capital expenditures, including differentials. On the G&A front we had significant activity in 1Q related to the termination of legacy employees, our CEO transition, a move to our permanent headquarters, among other non-recurring expenses. On the financial side, the company's balance sheet continues to be a core strength and strategic advantage that we're focused on maintaining. As of March 31st, CIVI's balance sheet consisted of $500 million of total debt and roughly a $150 million in cash. We have since paid off a $100 million, in outstanding notes with cash on hand and sit here today with only $400 million of debt on the balance sheet. And now we also recently up-sized our credit facility borrowing base to $1.7 billion and increased our electric commitment on the facility to $1 billion, which provide us with significant amount of liquidity. This is composed of our $0.4625 per share base dividend, and our variable dividend of $0.9 per share this quarter. Our 2022 plan is almost a 100% permitted at this point with the only remaining and permitted pad scheduled to be spot in 4Q and 2023 will largely be permitted once we receive approved on our cap, which we expect to occur in the third quarter. Our goal to become the clear ESG leader within our peer group is also very much aligned without states environment, so on community-focused coal jet. And we've provided details about our expanded ESG platform in Civitas ' assets inaugural corporate sustainability report, which was published earlier this week. We encourage everyone to take a look at the recall, which outlines the company's recent achievements and future goals around climate leadership, delivering value to our communities, and best-in-class corporate governance provisions. As Colorado's largest pure-play E&P and first carbon neutral E&P company on a Scope 1 and Scope 2 basis, we are very excited about the company's future. A relentless focus on costs, expanding our cash margins, protecting our balance sheet, and returning excess cash flow generation to shareholders. And with that, I'll turn the call back to the Operator for Q&A. Your line is open. As you said, certainly seems like you have more than ample permits for this year. Like Ben mentioned in his comments, we do have Q pads that are coming up and OGDP hearings that we plan to split in late fourth quarter, that should put us a 100% permitted through this year and those carrying into the first quarter of next year. Right now for our development plan in 2023, a bunch of that those locations come from the box elder cap that we have currently pending with the CEO GCC. So that will be the majority of the locations we do plan in 2023, just an update on that cap for everybody. We do anticipate getting completeness determination from the CEO GCC quarter, and that would lead to what we are hoping for a late third quarter final approval hearing and that should be. And then, Ben's second question based on the top, reserve on shareholder returns. I think if you look at our uses of cash, our focus is up a say, pay the base dividend, pay the variable dividend. And then at that point, we're looking in base and consolidation opportunities and then how they compare versus executing a buyback. I think if you look at those in base and consolidation opportunities, the vast majority of them are being down. And as we get towards back end of the year, we'll undertaken evaluation of what to do with our excess cash. Your line is open. Yeah, I can -- I'll start some more stats on permitting in general. First of all, that cap, you're correct, it was submitted initially by Crestone, we amended that shortly after the merger announcement last year to include some of the extraction acreage that was right on the flanks so that already occurred a while ago and has been part of what we submitted and have resubmitted in late February. So over the next several months, we plan to have a couple 100 wells, about 220 wells submitted, and hopefully approvals rolling through on various OGDP's that we're working on that are in addition to the box elder cap is just currently our plan. is to drill the box, sell the cap mostly in 2023, but we should have ample inventory coming through these other OGDP's that we're working on. Wanted to get an update on integration process with Bison or maybe even for all of the companies that have come together here over the past year, just to see where you are in that process. We really only brought three full-time employees as far as the -- I guess the longer-term integration that came with the merger, we're basically down to that 300 employee mark that we anticipated when we put together the margins in November first of last year. Everything pretty much is as expected, this is our first full quarter post merger implement-execution perspective and very clean quarter. I think there's certainly a little bit of work on the back-office still remaining there's -- we still have a couple of corporate and field offices trying to close those out, integrate those, but from an integration respective, think everything's going better than anticipated and faster than anticipated. Your line is open. Wondering you could talk a little bit about where things stand in terms of land, now that you've combined all the companies. Yeah, what I would say is that the base significant synergies on the land side of putting all these companies together, both in terms of ability to drill longer laterals, our ability to execute trades. Obviously with the other major players in the base and then everyone trying to optimize their positions along with trying to win bill an increase our working interest and our key path, so we never really stops from a A&D land side of the business and magnitude will be very effective in making a number to those trades to optimize what our business plan. Of course, it's certainly a broader regional mix and product mix spend, I guess any one of the companies had the for the deals. We of course, there's massive rally in both oil and gas. Yeah, maybe I'll make some opening comments and then maybe Matt can follow-on. First and foremost, I think we set out a very clear plan of what we intend to do on a multi-year basis, and I don't see us materially deviating from that plan. Obviously, the commodity prices have moved around and relative pricing has moved around, but I don't think that's going to lead to a material shift in how we attack the business. I think when you look at the combination of the companies, the great thing we've seen over the last six months, Is that age company brought some really unique skill sets. Your line is open. For our midstream spend, it's a little over 50 million for this year. There will be some expansions to Rocky Mountain Midstream, but Rocky Mountain Midstream for the most part, has been built out. When you look at Rocky Mountain and really not on the rocky mountain, but the broader midstream infrastructure with the oil asset that we have down the Southwest and the Gas gathering then have down lock-in. Why would say a do look at the cash flow from the midstream business, about 85% ourselves get eliminated and consolidation. So when, when you look at Capital that happen, that's part of wire margins are where they are and, you know, keeping our margins and cost structure low with the very tenants to the company. So at this point, I think we don't see the need to potentially carve it out and indefinitely we're trying to get up. Just out of curiosity as you look at the Basin right now, I mean, I think part of the drive to carve out that midstream initially for bonanza was was kind of aligned pressures and access to capacity. This is Matt, I think right now, the basins in pretty good shape as far as takeaway goes, there's a lot of infrastructure built before everything slowed down in 2020 for Civitas as a whole, we don't have a lot of exposure for new drills left to the DCP system. But for the most part, our new production is going to be exploring through RMI, which has multiple offsets or updates to several different midstream providers. And then a lot of our other new turn-in-lines down south will be going to Western Gas or to Rocky Mountain midstream, which both have ample capacity available right now. So on the Gas side, we're not too worried about and then for oil, we have a very clear, very desirable mix of oil where we have access to a lot of the local markets as well as having to sell down in Coshing. Your line is open. One, the LOE in the fourth quarter is just a little bit, not apples-to-apples strike because keep in mind October west just Bonanza Creek. The second item I'd say Q1 does reflect March Bison production, which it was not a significant necessarily to the enterprise and because those are oilier barrels may do come in with higher per BOE LOE."
}