{
    "symbol": "CIVI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 16:25:13",
    "content": " At this time, I would like to welcome everyone to Civitas Resources Second Quarter 2022 Earnings Conference Call. I'm joined today by Chris Doyle, President, and CEO; Marianella Foschi, CFO; Matt Owens, COO, and Brian Cain, our Chief Sustainability Officer. Yesterday, we issued our earnings press release, filed our 10-Q, and posted a new investor presentation which is available on the Investor Relations section of our website. Please be aware that on today's call, we may make forward-looking statements. On today's call, we may also refer to certain non-GAAP financial metrics. I'm excited to talk about our results in the second quarter, but I want to start by highlighting what I see as the fundamental pillars of how we run our business. First, operating assets to maximize free cash flow. Third, commit to returning meaningful capital to shareholders, and fourth lead the way in terms of environmental, social, and governance. We have been and will continue to be strong believers in the value of consolidation but only as those opportunities enhance, extend, or optimize our business around those four pillars. That discipline means, we don't have a significant transaction to highlight for you today, but it also means we have a very clear picture of how the underlying assets are performing. The team is executing well, the assets performing ahead of expectations, we beat our internal oil targets, we beat our internal total production targets it came in under CapEx. They were very active in optimizing netbacks on our oil production which, thanks to 18 months of consolidation is not only a significantly more scale. We produced 110,000 barrels of oil per day gross, but is also geographically diverse. Whether we continue to capture those opportunities is yet to be determined, the focus from this team is expanding margins. We're a company focused on generating free cash flow ahead of production growth, ahead of activity, cost leadership is an absolute imperative. We redeemed $100 million in senior notes with cash on hand and as of the end of the quarter, the company was unlevered on a net debt basis, was $400 million of total debt outstanding, it gets roughly $440 million in cash. We also firmed as a company, our commitment to return meaningful capital to shareholders with the announcement of our $1.76 in a quarter per share total quarterly dividend. As the business continues to create significant free cash flow we will evaluate the best use of cash where that's reinvesting in our business through the drill bit, launching share buybacks, extending the runway with additional acquisitions, or increasing dividends back to our shareholders. Relative merits of each of these options shift they shift continually, especially in the market is volatile is what we've seen over the past quarter. But this management team, our Board, and our largest shareholders are fully aligned and we're committed to getting it right. Looking ahead into 2023, roughly 20% of our programs on a fully approved OGDP's of permits another 30% permits are submitted with the majority of those deemed complete and simply awaiting hearing dates and we'll continue to submit the remainder as we approach year-end and into the first quarter. In total, we have 575 wells working through what we call our permit pipelines. On CapEx, we have increased the midpoint of our '22 guidance slightly due mainly to cost inflation but importantly staying within the high end of the original guidance. Our operating cost guidance has been updated, our oil differential guidance was updated and decreased from $6 to between $4 and $5 per barrel. We also are now guiding $75 million to $125 million, of 2022 cash income taxes and that assumes oil average is $100 per barrel for the remainder of the year. As Colorado's largest pure-play E&P and first carbon-neutral E&P company on a Scope 1 and Scope 2 basis, Civitas is well positioned for future success within Colorado and the industry more broadly. Your line is open. I'm just wondering, given the - what appears to be substantial free cash flow going forward. Chris, I'm just wondering, could you discuss how share buybacks will play into the mix along with you know you certainly mentioned the dividends. So I would, I would say that we are in a great position. We're going to look opportunistically for opportunities as you said to do accretive deals like the one that we did but we will also consider whether that's a buyback, a special dividend, or other acquisitions all of those are in play. And as we've guided, most of the year there still a few in-basin opportunities within the DJ and that will continue to run to the ground. And as you said, we are generating significant free cash, and the Board is really focused and the team is focused on what the best use of that cash is going to be. I would say we're early days with both the COGCC and the industry as more broadly if you think back Neal to Appalachia early days, it takes some time for operators to get their feet under them, it takes some time for the regulators to get their feet under them as well. Yes, I think that's a great number and that's permits in hand. So that's why when you look at that new Slide 5 that we have, we're showing a lot more than that. We've got a lot of projects that we're working on internally, Chris mentioned in his prepared remarks that we did get our first cap deemed complete earlier in the quarter and we hope to have our second one submitted by the end of this year. Our next question comes from Michael Scialla from Stifel. Your line is open. Your line is open. Hi, I was hoping you could talk a little more about some of these kinds of pending M&A deals. I guess there is still quite of ongoing negotiations here, are they kind of heavy, or is it just kind of getting difficult to transact here at the right price, just trying to get a sense of how you're thinking about M&A right now. Obviously, it's a rapidly consolidating base, and thanks to the efforts of this company and others it's not a difficult discussion to have quite honestly as long as we are disciplined. And we have been coming back to, how do we make this company better, not just bigger. And so what you saw in the second quarter is we were disciplined, we didn't get anything over the finish line other than small transaction that we highlighted in the comments. Unless they allow us to create more cash flow get that back to shareholders, protect our balance sheet and lead the way in the ESG and it's as simple as that. And at that point, would you pivot to just a higher return of capital you obviously have no net debt at this point. Strong base dividend the variable was up a lot this quarter, but still a lot of excess free cash flow above that you did mention buyback in the prepared comments. We'll know I would say in the next quarter, certainly by the year-end will be sitting on significant free cash that we will deploy and what will determine working with the Board in the management team is best use those funds. But I think from a time perspective, Leo I'm thinking the next quarter, possibly to the end of the year. I know historically, the company has kind of talked about trying to keep volumes fairly steady. I would say, you look at first half were essentially flat to the second half the second quarter as higher than came in higher than what we expected. A lot of that's due to early but outperformance in the walk-ins area, longer plateaus and good execution by the team. I think I'd add is, remember, we had a bunch of capital that we spent in the fourth quarter last year accelerating a bunch of docks. Kind of I guess longer-term plans there, the big jump in transport cost, but obviously, you saw it in the realizations. So as we continue developing, especially in our southern area we will have more volumes that we're able to sell in basin potentially at these better prices like we saw in the last two quarters. That was associated with the legacy Bonanza Creek position which would free up another 25,000 barrels a day of low gravity crude that we would then be able to access these in basin markets with. So as long as those in-basin market stay strong, we should be able to continue taking advantage of these prices. Your line is open. I think is an area that could - we could allocate some capital to, if we see a real opportunity and it would be in the easy tuck into our ops. Yes, the only thing I'd add is, we're not really focused on new formations at this point in time, but there are alternate benches like you mentioned, and some of our areas that haven't been adequately tested. I don't think it will add a new formation in total for us to develop, but it will allow us to develop on a little bit tighter Chevron pattern. Yes I think when you look at G&A quarter-over-quarter, a significant decrease as we continue to peel off caution and rationalize systems and input integrated process and systems in place. Again, I would say we're very early in that process. I would say in general, Noel, this is Marianella. I think that just the roll-off of the companies and the exit of services, we continue to shed off G&As as close as we can and different we are in the year we believe the guidance that we gave was a little more perfect, but we're definitely making meaningful strides on both those items. Our next question comes from Michael Scialla from Stifel. Hi, good morning everybody, and I apologize for joining the call late if any of these questions have been asked previously, I apologize for that. It looks like in terms of wells drilled, completed, and brought online. I would say a couple of things, one, the assets outperforming on a production basis and allowing us to generate significant free cash flow, which is our number one focus more so than activity. So we would average around three for the year, we're still there. The only other thing is, we've had some success with our internal leasing program and just setting up organically our working interest in a few pads. I would say that, and this goes to the fourth pillar we talked on our prepared remarks is we will as a company, lead the way in environmental, social, and governance. We're going to be spending about $6 million a year to retrofit pneumatic devices which at about year three should result in a 30% to 40% reduction in emissions and that in addition to some of the other sources that we've - that we've found and looking through the portfolio of 5 companies, we are targeting a 50% reduction by 2027. We are, we are carbon-neutral today and we are making investments today to significantly reduce emissions, in the short term because to your point, we see that regulations and particularly regulations around air quality, they tend to get tougher and not easier, and so we are taking the proper steps to be ahead of that. Your line is open. In your opening remarks, you had mention that you are in the early innings of integrating the five companies. The companies are fully integrated, as evidenced by a great quarter - a great string of quarters quite honestly. But the business, I would, if we were looking around this table, and walk in the halls we know there is more that can be done to optimize our production base to optimize our performance in all aspects. I think, well not necessarily reflected in future guidance, could be some potential upside. To me, this is you take back 18 months ago and the individual constituents of this company, we are now a $5 plus billion company. What that means is the addition of a clear process, clear accountabilities, and clear systems integration I think can yield a lot of value that were not in place previously. We are now 170,000 barrel a day company, that is a massive base production much bigger than any of the constituent parts. And so really focusing in on-base production, not just drilling and completing wells, but base production. And I think more broadly we have everything plugged in together to your point, we're fully integrated but optimizing process, optimizing systems, getting the right folks in the right spots, and everyone aligned to one central mission. We're early days and we're going to get there, and I think that's what I wake up every morning really excited about is that, how the assets performing, how the teams performing in the wake of five companies coming together knowing that there is much more to come, I get really excited about. I would say, there should be a noticeable difference visible to the outside world based on the second quarter results. But I would also say, have this discussion a year from now, we're not going to be done. We may be closer to nil of biddings, but we will as a company continuously improve every aspect of our business. And so I would say, and the Company is doing a phenomenal job of this is, we will not accept where we are today. Our next question comes from Michael Scialla from Stifel. Your line is open. In previous quarters, we guided at $75 that we would not expect to pay cash income taxes. I'd like to turn the call back over to Chris Doyle, for closing remarks."
}