{
    "symbol": "CRTO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:05:21",
    "content": " For Commerce Media and specifically for retailers focused on retail media, Criteo has been providing the platform that enables retail media for five years. The rise of Commerce Media has come about as a result of the quest to monetize valuable first-party commerce data, which retailers and other media owners have struggled to fully utilize for many years. Using our platform, brands will have access to best-in-class advertising solutions with Criteo's Commerce Media technology, including our offsite capabilities and Flipkart's audience scale. Today we work with about 22,000 commerce clients, thousands of publishers and activate close to $3 billion in annual media spend throughout our platform. So the chances of us finding global ads consumers for retailers on-site and off-site is huge, adding to that ability to fund and attract new consumers through our reach and combination of AI and data this drives commerce outcomes maximizes return on ad spend for our clients. Brian’s agency heritage brings even more firepower to our agency channel work which is really firing on all cylinders, with over $200 million in activated media spend or about 32% of our overall business coming through agencies in the first quarter, compared to 30% a year ago. And ultimately we believe our first-party commerce media network will help marketers and media owners preserve and increase their ability to reach relevant users and personalized campaigns, onboarding, enriching and activating first-party data. By leveraging their existing integrations for onsite retail media monetization, retailers partnering with Criteo can seamlessly enable brands to target audiences across the open web, as well as measure results at the SKU level. To best address the needs of our clients, we’re evolving to always-on audience marketing strategies from point solutions, offering access to full-funnel capabilities and commerce audiences through our Commerce Media Platform. Criteo in the past has been a retail targeting business the amount of times I've heard Criteo being referred to as a retargeting business is just -- the difference between there we have been and where we are today and going is the notion of being -- of great hold of the opportunity that exists around commerce media and putting our assets, the breadth of assets pivoting them to be able to do what they do for that opportunity. And having the mechanism that drives advertising across to -- or commerce audiences on media properties is a powerful place to be, all again fueled by this notion of being the platform that underpins everything that's going on across Retail Media and everything that more broadly is going on across commerce media. And as we look at our newest solutions in particular our Commerce Media Platform and around audience targeting, as well as that's really a focus on how do we drive increased traffic and how do we attract and retain new customers kind of up the funnel. In other words, if there's pressure on them to slow down on brand advertising because they want more performance or they want to put into commerce media or whatever the tactic might be where they're upper funnel, where they're lower funnel and where they're all the way through the retail -- their retail chain and out into their consumers across the open Internet."
}