{
    "symbol": "CRTO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 13:27:02",
    "content": " With their logged-in first-party data, their quality shopper audiences, along with our ability to provide real time closed-loop measurement, brands are moving ad budgets rapidly in their direction and Retail Media is expected to capture one in five digital ad dollars by next year. In light of our growing momentum, we've now taken actions to accelerate our plans by shifting more highly experienced engineering resources, doubling the size of the existing team to concentrate on the rapid deployment and scale of our Commerce Max Demand Side Platform, or DSP, and to continue to bring more features and capabilities to market faster for our Retail Media clients. In Retail Media, revenue was $202 million and Contribution ex-TAC was $161 million, up 33% year-over-year, as we continue to rapidly expand with our retailers. Retail Media, Commerce Audiences and Iponweb combined represented 47% of Contribution ex-TAC in our fourth quarter, up from 41% in Q3 and up from 32% in Q4 last year. In Retail Media, revenue was $60 million and Contribution ex-TAC grew 23% at constant currency to $57 million, on top of strong growth last year. We delivered strong growth in Commerce Audiences as clients transition to always-on audience strategies to acquire and retain customers with new business and cross-selling across our over 20,000 retailers and performance marketers. In closing, as a leader in Commerce and Retail Media, we believe we are well-positioned to deliver on our plans for growth, resilient performance, healthy profitability, and strong cash generation to drive shareholder value in 2023 and beyond. So that's the way that we've modeled our 2023 expectations and we continue to win new logos, we continue to drive much more business including new formats through our Retail Media business and we anticipate that we'll continue to be absolutely on track for our 2025 long term target. And Commerce Max is one of our acceleration efforts through the first half of this year because Commerce Max is where all of the Retail Media networks come together in front of the agency that they can buy it across networks, which doesn't exist today. So Q1 and Q2, we'll continue to see a slower growth environment with the macro and we anticipate Q3 and Q4 with new features, but also with just the tailwind of the secular trends of Retail Media and the highest seasonal patterns that we have been in especially in Q4 that will be where we see the growth drivers. Adoption from a Retail Media perspective continued wins and actually more usage from those networks is something that we think a tremendous amount about because what -- the knock on effect of that, of course, is that we get the unlocks, the revenue unlocks and the long term growth that Retail Media as an opportunity overall provides."
}