{
    "symbol": "PVH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-28 12:46:10",
    "content": " These include PVH's right to change its strategies, objectives, expectations and intentions and the company's ability to realize anticipated benefits and savings from divestitures, restructurings and similar plans such as the planned cost efficiency action announced in its second quarter earnings release and its 2021 sale of  and exit from its Heritage Brands business to focus on the Calvin Klein and Tommy Hilfiger businesses. And underlying growth, excluding the impact of currency and the Russia-Ukraine exit, was plus 9% in the fourth quarter driven by better-than-expected results for both Tommy Hilfiger and Calvin Klein. The PVH+ Plan is our brand-focused, direct-to-consumer and digitally led growth plan that will over time build Calvin Klein and Tommy Hilfiger into the most desirable lifestyle brands in the world and in parallel, making PVH one of the highest performing brand groups in our sector. And in North America, we were able to start to win more with our domestic consumer, driving plus 9% growth for Tommy and Calvin together in a brand-accretive way, recognizing that this is the beginning of a multiyear unlock. We also came into the year knowing that an important underlying driver of the PVH+ Plan is to become more cost competitive in a way that simplifies how we work, increase our speed in decision-making and empowers our team to execute and enables us to drive new growth by making strategic investments in areas such as marketing, supply chain and technology. Our ability to drive underlying revenue growth of 9% for 2022 and earnings per share of $8.97, in line with our initial expectations at the start of the year, approximately $9 per share, is a testament to our disciplined execution of our strategic priorities and the power of our 2 global brands, Calvin Klein and Tommy Hilfiger. Our strong fourth quarter results delivered underlying revenue growth of 9% versus last year, exceeding our top line guidance by 4% on a constant currency basis. From a regional perspective, fourth quarter revenue for our international business was up 11% versus last year on a constant currency basis, continuing to significantly exceed 2019 pre-pandemic levels. In North America, revenue in the fourth quarter was up 5% overall for Tommy Hilfiger and Calvin Klein with our retail store business up high single digits versus last year as we drove sequential improvement versus the third quarter in sales to domestic consumers. Our global brands also continued strong underlying growth, balanced across both brands, with Tommy Hilfiger revenues up 10% on a constant currency basis and Calvin Klein revenues up 8% on a constant currency basis."
}