{
    "symbol": "PVH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-02 18:00:20",
    "content": " Through the disciplined execution of the PVH+ Plan, we are confident in the sustained momentum of our overall underlying business trends and we are reaffirming our annual guidance for constant currency revenue growth, EPS, and a 10% EBIT margin, which includes maintaining our strong gross margins and speaks to the strength of our overall business. Despite the macro challenges with the war in Ukraine, the underlying business performance in Europe remains very strong with performance closely aligned to the PVH+ Plan growth drivers driven by strong product execution across both Tommy and Calvin, combined with a market presence that allows us to very closely follow where and how the consumer wants to shop, both in stores and online. Overall, revenues for the first quarter were up 2%, compared to the prior year as reported and up 7% on a constant currency basis, reflecting strong underlying double-digit growth and continued momentum in Europe. Driving that growth was our direct-to-consumer business where we saw continued positive consumer sentiment and momentum in-spite of the worsening macro environment, up 4% compared to the prior year and up 9% on a constant currency basis, inclusive of a 6% reduction from the exit of the Heritage Brands Retail business. From a regional perspective, we saw strong momentum in nearly all international markets other than those markets in Greater China, which were affected by COVID shutdowns with first quarter revenue for our international businesses up 8% versus last year on a constant currency basis and significantly exceeding 2019 pre-pandemic levels. In North America, direct-to-consumer led strong growth of 21% overall for Tommy Hilfiger and Calvin Klein in the region for the first quarter although our North America business is still below 2019 pre-pandemic levels as we face significant ongoing supply chain disruptions. So taken together, our EBIT of $210 million was better than our plans due to the revenue outperformance, gross margin in-line with our plans, and proactively managing SG&A in light of increasing macro pressures and an operating margin of 9.9% for the quarter, compared to our guidance of approximately 10% for the full-year. While we continue to navigate this unprecedented macroeconomic volatility, we remain confident in the power of our two global brands Calvin Klein and Tommy Hilfiger and in the fundamental strength of our business, and we believe that the disciplined execution of our strategic priorities will drive underlying double-digit top and bottom line growth for 2022 while maintaining our strong gross margins. I think if we talk about the first quarter specifically, if we start at the top line, 21% growth, really good strong balanced growth across both wholesale and DTC, I think the most important impact for us and really for the most of the first half of the year North America is really going to be the impacts of supply chain disruption. As Stefan mentioned earlier, down 25% in the first quarter versus last year, and we will see that impact as well carried through into first couple of months of second quarter, but what I will say is from a positive perspective, it's one of the reasons why we're confident of being able to continue growth into the second half as those, sort of, some of the lockdowns ease and our ability to return back to selling, we've seen relatively quick upticks in the marketplace from there at that point in time."
}