{
    "symbol": "PVH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-01 15:02:05",
    "content": "  These include PVHâ\u0080\u0099s right to change its strategies, objectives, expectations and intentions, and the companyâ\u0080\u0099s ability to realize anticipated benefits and savings from divestitures, restructurings and similar plans, such as the planned cost efficiency action announced in the second quarter earnings release and its 2021 sale of assets of and exit from the Heritage Brands business to focus on its Calvin Klein and Tommy Hilfiger businesses. Top line results exceeded our expectations on a reported and constant currency basis and the underlying growth, excluding the impact of currency and the Russia-Ukraine exit, was plus 9% in the third quarter, driven by better than expected growth rates for both Tommy and Calvin. As a reminder, our PVH+ Plan is about connecting our two global brands closer to where the consumer is going than any time before through five growth drivers; winning with product, winning with consumer engagement, winning in the digitally led marketplace, developing a demand and data-driven operating model and driving efficiencies while investing in growth. Our global bestseller initiative which puts the best products from our global design center into North America continued to grow its impact in the third quarter, up from 50% in the second quarter, and we are seeing strong performance from these products. Looking forward, I'm incredibly optimistic for how in a very disciplined manner through the PVH plan, every quarter we will unlock more and more of the full potential of our two iconic brands, Calvin Klein and Tommy Hilfiger across all our regions leveraged by PVH as a high performing global growth platform. As Stefan discussed, we are pleased to report strong third quarter results which exceeded our top line guidance by 2%, delivering underlying revenue growth of 9% versus last year and significantly exceeding our earnings guidance with earnings per share of $2.60. In North America, revenue in the third quarter was up 10% overall for Tommy Hilfiger and Calvin Klein and above our plans, despite the inflation and interest rate pressures that continue to weigh on consumer sentiment in the region. Our strong third quarter performance is a testament to our ability to react quickly in the short term, while continuing to be laser focused on strategic actions to support the long-term growth of our business powered by our two global brands, Calvin Klein Tommy Hilfiger. Overall, we expect gross margin in the fourth quarter will reflect a similar year-over-year decline versus what we reported for the third quarter, as we offset the negative impact of the increasingly promotional environment by driving our higher margin direct-to-consumer channel as a greater share of the business versus last year. Your line is now open. Your line is now open. If we take Tommy as an example where we increasingly connect our products to the global design center of the brand and have those bestsellers, even for the North America market, we see that the category is like men's knits, which is our number one category for Tommy, we were up 42% versus last year. Your line is now open. Your line is now open. Your line is now open."
}