{
    "symbol": "ESAB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 13:29:19",
    "content": " This morning, I'm joined by our President and CEO, Shyam Kambeyanda; and CFO, Kevin Johnson. Please keep in mind that some of the statements we are making are forward-looking and are subject to risks, including those set forth in our SEC filings and today's earnings release. Actual results may differ, and we do not assume any obligation or intend to update these forward-looking statements, except as required by law. With respect to any non-GAAP financial measures mentioned during the call today, the accompanying reconciliation information related to those measures can be found in our earnings press release and today's slide presentation. With that, I'd like to turn the call over to our President and CEO, Shyam Kambeyanda. Good morning, everyone, and thank you for joining us today. Before talking about the results, let me take the time to recognize our teams across the globe and particularly our team in China, who worked extraordinarily hard during the quarter to ensure we serve our customers during the lockdown. We have the finest set of associates, and I'm proud and appreciative of what they do every day to make ESAB successful. Excluding Russia, organic growth was 13%. Our organic revenue growth reflected strong price realization, as our teams continue to execute our EBX process on pricing to offset inflation. EBITDA was a record $111 million in the quarter, up 6% and we expanded EBITDA margins by 10 basis points to 16.7%, a solid achievement despite geopolitical, currency and inflation headwinds. In addition, we remained on track to deliver our free cash flow guidance. Lastly, we successfully extended our $600 million term loan and fixed it at competitive rates. When I joined in 2016, ESAB was in the early innings of its digital journey. And what I discovered was we had a strong foundation, which included Weldcloud, Universal Connector and CutCloud, all developed using an open architecture. At this time, we also discovered our customers who are using the welding equipment less than 10% of the time. To accelerate our digital solutions strategy, we added four fantastic acquisitions. Starting with TBI, which is a leader in robotic arm purchase, we added to our analytical capabilities with HKS, which provides real-time wealth analytics to continue to strengthen our portfolio, we then acquired WeldNote, which provides our customers with a library of weld processes. To put it all together, we acquired OCTOPUZ, a leader in offline robotic software, all of these solutions create an InduSuite, which we launched in the second quarter. To accelerate the commercialization of our digital strategy, we've been looking for strategic partners, which brings me to our next slide. We're excited about this partnership, and we'll be sharing more in the future quarters. I know many of you like to see examples of EBX, on the right side of the slide, I provided a recent example of a distribution center Kaizen in North America, where we successfully streamlined our order pick process. During the quarter, we completed over 37 Kaizens, each improving our productivity, efficiency and safety at ESAB. And as I've said before, we are a continuous improvement organization, and EBX is in our DNA. As I mentioned earlier, sales rose to a record $661 million, a 5% year-over-year increase, 9% organically and 13% excluding Russia. Our markets in North America, India and the Middle East had strong end market demand. Europe and South America were resilient as expected, and we expect improving market conditions in China for the second half. We delivered record EBITDA dollars, expanded margins by 10 basis points, 80 basis points, excluding Russia, despite a strong U.S. dollar. Sales rose to $291 million, growing 15% organically, reflecting strong price realization. EBITDA increased 28% and margins expanded by 170 basis points, reflecting strong execution by our teams. China worked through restrictive COVID measures and demand in Europe was in line with what we expected Our second quarter sales climbed 4% organically on the back of strong price. Excluding Russia, organic sales increased 11% and margins improved 10 basis points year-over-year. Lastly, I'm proud of our team as they continue to build momentum for our new products, and we've had some notable wins leveraging our InduSuite software solution. With that, let me turn it over to Kevin for Slide 10. Today, this means over half of our debt is now fixed and we have around $550 million of borrowing capacity, which provides us with ample financial flexibility for the next few years. As in our prior guidance, we have only included Russia for Q1 and continue to exclude it from Q2 to Q4. Given this global backdrop, we have been working hard on cost reduction opportunities. a strong second half of the year, in line with what we expected in our guidance as we burn off inventory that we built up during the first half to offset supply chain pressures. We also paid out our first dividend in July, a $0.05 per share quarterly dividend, and we expect to continue this in the future. With that, let me hand back to Shyam on Slide 12 to wrap up. To summarize, we delivered a strong first half and I'm very proud of our team as we continue to bring innovative new products to the global market and build momentum in our digital solutions through InduSuite. We're using EBX to drive growth, higher profit and cash flow. Yeah, Nathan, what we've said, if you remember our announcement back in May that we had stopped supporting the business. We are no longer exporting from Western Europe into that business, and we're working out a transition plan. It is a complex process, and we continue to work through it. So we've nothing more to add on that front when we do, we'll make that announcement. Obviously, there is concerns over there with high energy prices, rising inflation, tighter rates, all those kinds of things. But I think ex the Russia business, you still saw organic revenue growth. So out of Europe, we are expecting flattish volume for the rest of the year. Where we do see a lot of momentum within our business is in India, the Middle East and also to some extent, in the South Pacific, especially in Australia and the Southeast Asia region. So all in all, what we define as our EMEA and our APAC region continue to have some green shoots with some flattish volumes out of the Europe. Your next question comes from the line of Chris Dankert with Loop Capital, Loop Capital, my apologies. So I'll come back to automation a little bit more broadly, I guess, historically, automation and cutting sales combined have been near well-ish  percent of sales, if I remember correctly. What we have defined within - if you remember, even during our Investor Day and then since then, is that we're expecting that segment to grow by close to about $150 million through next 3 to 5 years. And so if you look at some of the numbers that we've provided to you in the past and then at that number, you can sort of see it sort of creates a significant business within ESOP going forward. We're excited about it, thrilled about the partnership that we've signed on to with Hexagon. But more importantly, there were several other things that we've also done. We've created specific products with our filler metal line, that drives specifically towards that second wave of automation going forward and continue to innovate on the cutting process as well to continue to serve our customers well. And our intent on that particular front is to sort of be a process leader rather than provide a fully integrated solution going forward, which we believe allows for lower cyclicality, better margin profile over the long term to to ESAB. And then not to get too granular here, but what kind of gives you confidence in that back half outlook. And Kevin, maybe you want to sort of give them a view on that one. So Chris, what we're expecting, we are sort of going back to normal seasonality, stepping down in Q3. And on that, as you kind of walk your way through the year, we're expecting sort of sequential decrementals and incrementals in that kind of mid-20s reins  as we're working out for the rest of the year. And I think as Shyam mentioned, growth assumptions in the second half to exclude Russia, as I mentioned in my script. Thank you for joining us today, and we look forward to speaking to you on our next earnings call."
}