{
    "symbol": "GM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 13:38:03",
    "content": " Despite these challenges, we have seen a continuous year-over-year volume improvement, Q1 up 1%, Q2 up 7% and we expect Q3 to be up 90% to 100% year-over-year as we lapped the significant impacts experienced in Q3 â\u0080\u009821 and the retime vehicles and Q4 to be up 20% to 30%, remaining on track to increase our 2022 wholesales by 25% to 30% year-over-year as we guided to at the beginning of the year. Adjusted automotive free cash flow was $1.4 billion for the quarter, down $1.1 billion year-over-year driven primarily by higher CapEx related to EV investments and the impact of holding these vehicles built without certain components in the company inventory. In Q2, North America delivered EBIT-adjusted of $2.3 billion, down $600 million year-over-year and EBIT-adjusted margins of 8% driven by higher commodity costs and investments in growth partially offset by strong pricing across our portfolio, but especially on our full-size trucks and SUVs and the non-recurrence of 2021 recall cost. GM Financial once again delivered solid results driven by strong used vehicle prices with Q2 EBIT-adjusted of $1.1 billion, down $500 million year-over-year primarily due to the reserve adjustments made last year. So I think with the vehicles being completed out of that inventory, we should see a little bit of a richer mix in Q3 and Q4 largely because of the truck side of it, but thatâ\u0080\u0099s going to help us keep us on track to the $13 billion to $15 billion. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. So, we will continue to do that, especially where we see the strongest demand for whether itâ\u0080\u0099s the fleet vehicles from BrightDrop, knowing the importance of getting affordable EVs out with the Blazer and Equinox, but also the strength that we are going to see â\u0080\u0093 that we are already seeing in the Silverado EV and the LYRIQ as well."
}