{
    "symbol": "CSTL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 05:46:06",
    "content": " As it relates to reimbursement, we discussed on our second-quarter earnings call, Novitas, the Medicare contractor that manages claims related to our Pittsburgh, Pennsylvania laboratory completed the medical review of our DecisionDx-SCC test in the first quarter of this year and they subsequently priced our test at a rate of $3,873 per test, the usual and customary rate for risk stratification or prognostic gene expression profile tests such as those used in patients diagnosed with breast, prostate and other cancers, also recall that Novitas posted a broad track LCD entitled dl-39-365, genetic testing for oncology back in May. In the third quarter 2022, revenue was $37 million, an increase of 58% over the third quarter of 2021 tracking closely to our overall test report volume growth. The higher revenues also reflect Medicare reimbursements for DecisionDx-SCC as Derek discussed earlier, partially offset by the effect of higher negative revenue adjustments related to test delivered in previous periods, which were negative $0.3 million for the 3 months ended September 30, 2022 compared to negative $0.1 million for the 3 months ended September 30, 2021. Excluding the effects of revenue adjustments related to tests delivered in prior periods, adjusted revenue was $37.3 million, an increase of 58% over the third quarter of 2021. Our total operating expenses, including cost of sales for the quarter ended September 30, 2022 were $58.5 million compared to $35.3 million for the third quarter of 2021. Our sales and marketing expenses increased by $9.1 million for the 3 months ended September 30, 2022 compared to the 3 months ended September 30, 2021, attributable to higher personnel costs, including salaries, bonuses and stock-based compensation. R&D expense increased by $3.4 million in the third quarter compared to the third quarter of 2021 attributable to higher personnel cost primarily due to expansions in headcount in support of our growth, higher pay rates and higher stock-based compensation expense and also due to higher cost for clinical studies. Cost of sales exclusive of amortization of acquired intangible assets for the 3 months ended September 30, 2022 increased by $4.4 million compared to the 3 months ended September 30, 2021 primarily due to higher personnel costs attributable to additional headcount and our laboratory testing operations, including increased headcount attributable to the addition of Cernostics and AltheaDx as well as higher pay rates. In summary, we delivered another strong quarter with an increase in revenue of 58% over last year, with total test report volumes trending closely at 57% growth, are executing well on our growth plans, and expect to finish the year in a position of strength with accelerated momentum going into 2023. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}