{
    "symbol": "LI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 12:51:19",
    "content": " China's retail sales of new energy passenger vehicles surpassed 1.17 million during this quarter, more than doubled year-over-year according to the China Passenger Car Association with penetration rates climbing to 27.1% from 21.8% in the first quarter. Despite the challenges posed by the COVID-19 resurgence across cities national light from the March to May we delivered 28,687 vehicles during the second quarter, representing a 63.2% year-over-year increase. As a result, our second quarter gross margin remained relatively solid at 21.5%, up 2.6% year-over-year as we remain devoted to R&D and network extension to fuel our future growth. On a quarter-over-quarter basis, affected by supply shortage due to the COVID-19 in the second quarter of 2022 total revenues and the vehicle sales decreased by 8.7% and 8.9% respectively. Revenues from other sales and services were RMB249 million, or US$37.2 million in the second quarter of 2022, representing an increase of 83.6% from RMB135.7 million in the second quarter of 2021 and a decrease of 1.7% from RMB253.4 million in the first quarter of 2022. Cost of sales in the second quarter of 2022 was RMB6.85 billing, or US$1.02 billion, representing an increase of 67.7% year-over-year, and a decrease of 7.4% quarter-over-quarter. Gross profit in the second quarter of 2022 was RMB1.88 billion of US$280.4 million representing an increase of 97.1% year-over-year, and a decrease of 13.2% quarter-over-quarter. Operating expenses in the second quarter of 2022 were RMB2.86 billion, or US$436.5 million representing an increase of 91.9% year-over-year, and the increase of 10.9% quarter-over-quarter. Research and development expenses in the second quarter of 2022 were RMB1.53 billion, or US$228.7 million, representing an increase of 134.4% year-over-year, and an increase of 11.5% quarter-over-quarter. Selling, general and administrative expenses in the second quarter of 2022 for RMB1.33 billion of US$197.8 million, representing an increase of 58.6% year-over-year and the increase of 10.2% quarter-over-quarter. Losses from operations was RMB978.5, meaning of US$146.1 million in the second quarter of 2022, representing an increase of 82.6% year-over-year, and a increase of 136.9% quarter-over-quarter. Now for our business outlook for third quarter of 2022, the Companyâ\u0080\u0099s deliveries to be between 27,000 to 29,000 vehicles representing an increase of 7.5% to 15.5% from the third quarter of 2021. The Company also expects the third quarter total revenues to be between RMB8.96 billion and RMB9.56 billion, or US$1.34 billion, and US$1.43 billion, representing an increase of 15.3% to 22.9% from the third quarter of 2021."
}