{
    "symbol": "LI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 12:19:06",
    "content": " With Li L8 and L9 continued strong performance and the addition of L7 to our family, we will set ourselves a stretch goal of 20% market share in the RMB300,000 to RMB500,000 premium SUV segment this year. Our total revenues in the fourth quarter of 2022 were RMB17.65 billion or $2.56 billion, representing an increase of 66.2% year-over-year and an increase of 88.9% quarter-over-quarter. Revenues from other sales and revenues were RMB381.5 million or $55.3 million in the fourth quarter, representing an increase of 55.9% year-over-year and an increase of 28.7% quarter-over-quarter. Our cost of sales in the fourth quarter was RMB14.08 billion or $2.04 billion, representing an increase of 70.9% year-over-year, an increase of 72.6% quarter-over-quarter. Our gross profit in the fourth quarter of 2022 was RMB3.57 billion or $517.1 million, growing 49.8% compared with the fourth quarter of last year and 201.7% compared with the third quarter of this year -- of 2022. Operating expenses in the fourth quarter of 2022 were RMB3.7 billion or $536.4 million, representing an increase of 47.1% year-over-year and an increase of 11.7% quarter-over-quarter. R&D expenses in the fourth quarter of 2022 were RMB2.07 billion or $300.1 million, up 68.3% year-over-year and 14.7% quarter-over-quarter. Our selling, general, and administrative expenses in the fourth quarter of 2022 were RMB1.63 billion or $236.3 million, representing an increase of 44.8% year-over-year, an increase of 8.1% quarter-over-quarter. Net income in the fourth quarter of 2022 was RMB265.3 million or USD38.5 million, representing a decrease of 10.2% from RMB295.5 million net income for the same period in 2021 and compared with RMB1.65 billion net loss in the third quarter of 2022. For the first quarter of 2023, the company expects the deliveries to be between 52,000 and 55,000 vehicles, representing an increase of 64% to 73.4% from the first quarter of 2022. The company also expects first quarter total revenues to be between RMB17.45 billion and RMB18.45 billion or $2.53 billion and $2.68 billion, representing an increase of 82.5% to 93% from the first quarter of 2022."
}