{
    "symbol": "LI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 17:51:02",
    "content": " According to the China Passenger Car Association, or CPCA, retail sales of new energy passenger vehicles in China reached 1.07 million in the first quarter of 2022, representing a year-over-year increase of 146.6%. We delivered 31,716 Li ONE’s during the quarter, aiming industry-wide supply chain challenges, up 152.1% year-over-year and achieved a total revenue of RMB 9.56 billion, 167.5% higher than the first quarter of 2021. Our R&D expenses increased 167% year-over-year to RMB 1.37 billion, accounting for over 14% of our total revenues, as we continue to enhance our strategic investment in autonomous driving, intelligence costed and electrification. This included RMB 9.31 billion or $1.47 billion of vehicle sales in the first quarter of 2022, an increase of 168.7% from the first quarter of last year. On a quarter-over-quarter basis, total revenues and vehicles, vehicle sales decreased 10% and 10.3%, respectively primarily due to the decrease in vehicle deliveries in the first quarter of 2022. Revenues from other sales and services were RMB 253.4 million or $40 million in the first quarter of 2022, representing an increase of 127.2% from RMB 111.5 million in the first quarter of 2021, an increase of 3.6% from RMB 244.7 million in the fourth quarter of 2021. Cost of sales in the first quarter of 2022 was RMB 7.4 billion, or $1.17 billion, representing an increase of 150.1% year-over-year and a decrease of 10.2% quarter-over-quarter. Gross profit in the first quarter of 2022 was RMB 2.16 billion or $341.3 million, representing an increase of 250.9% year-over-year and a decrease of 9.1% quarter-over-quarter. Operating expenses in the first quarter of 2022 were RMB 2.58 billion or $406.5 million, representing an increase of 151.5% year-over-year and an increase of 9.4% quarter-over-quarter. Research and development expenses in the first quarter of 2022 were RMB 1.37 billion or $216.7 million, representing an increase of 167% year-over-year and an increase of 11.7% quarter-over-quarter. Selling, general and administrative expenses in the first quarter of 2020 were RMB 1.2 billion or $189.8 million, representing an increase of 135.9% year-over-year and an increase of 6.8% quarter-over-quarter. The Company also expects second quarter total revenues to be between RMB 6.16 billion and RMB 7.04 billion or $972.3 million and $1.11 billion, representing an increase of 22.3% to 39.8% from the second quarter of last year. Please ask your question. Please ask your question. Please ask your question. Please ask your question. Please ask your question."
}