{
    "symbol": "KERN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 11:37:13",
    "content": " Today we reported our first-quarter financial results for 2022, and I'm pleased to say we have posted our fourth consecutive quarter of top-line growth, highlighted by software revenue growth of 71% year over year, total revenue growth of 73% year-over-year, and a current revenue run rate now in excess of $27 million. Gross profit increased to $4.7 million in the first quarter, up 85% year-over-year, and gross margin increased to 68% in the first quarter, from 64% in the same quarter last year. Total revenue increased to approximately $7 million, up 73% compared to prior year, driven largely by accelerating software growth. Gross profit increased to $4.7 million in the first quarter of 85% year-over-year, while gross margin increased to 68% in the first quarter from 64% in the same quarter last year, and up from 58% in the prior quarter, primarily due to operating synergies realized from our acquired assets, our ongoing initiatives to drive operating efficiencies, and acquiring additional B2B customers which have higher gross margin. Moving to operating expenses, total operating expenses increased 318% year-over-year to $25.4 million compared to $6.1 million in the same quarter last year. Non-GAAP product development expense increased $700,000 year-over-year to $1.9 million, up 56% primarily due to the 2021 acquisitions mentioned previously. Non-GAAP sales and marketing expense increased $1.7 million year-over-year to $3.3 million, up 103% primarily due to the acquisitions mentioned previously. Total non-GAAP sales and marketing expense as a percentage of revenue declined 17% compared to prior year, as we've invested in sales and marketing initiatives to drive growth in our enterprise business unit, which is leading to increased bookings numbers discussed previously. Non-GAAP general and administrative expenses increased $200,000 year-over-year to $1.9 million or 15%, again, related to the acquisitions previously mentioned. The sort of an organic basis, I would say it was a bit of a mix results, I think from the last quarter, if I'm looking at the numbers, we were up about 10% year-over-year in our legacy business, but we had some ins and outs as we move and we shift some of our revenue streams around. I think when we brought in the Viridian, one thing to considered the profile of an enterprise business unit, they tend to have -- because it's really heavy traditional ERP, they tend to have a larger focus of internal resources that would fall into the sales and marketing bucket, and so that's why you would see a significant step up there in the fourth quarter and that's quarter this past quarter compared to prior year, it's just the nature of that type of business."
}