{
    "symbol": "HELE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-06 16:59:03",
    "content": " On a core basis, for both the quarter and year-to-date, we are pleased to report that we grew our sales and adjusted diluted earnings per share compared to the prior year period despite the especially difficult comparisons versus last year and this year's major headwinds from broad-scale inflation, supply chain disruptions and the EPA matter. Looking at our online sales on a two-year stack, our sales in the channel have grown approximately 24% since the third quarter of fiscal '20. Now looking at bottom line performance, core adjusted EPS grew 3% on top of last year's 21% increase despite the headwinds I mentioned. We now expect to grow core net sales 2% to 3% over last year's 25.1% increase, grow core adjusted diluted EPS, 4.7% to 6.5% over last year's 26.5% increase and expand margins. These factors were partially offset by a decrease in sales in the Health & Home segment due to stronger COVID-19-driven demand for health care and healthy living products in the prior year period, primarily in thermometry and air filtration and the unfavorable impact on air filtration product sales as a result of the EPA matter. We estimate the expected impact of the acquisition for the period from the December 29, 2021 closing date to the end of fiscal '22 to be approximately $20 million of net sales revenue and approximately $0.07 of adjusted diluted EPS which reflects the typically lower seasonal sales and earnings for the business during this period. Our core adjusted diluted EPS expectation implies an increase of 4.7% to 6.5% which includes 2.7% of unfavorable impact due to the EPA matter, implying expected year-over-year growth of 7.4% to 9.2%, not including the impact of the EPA matter. In summary, on a core basis, including the impact of the EPA matter, our revised full year outlook implies net sales growth of 2% to 3% on top of the 25.1% growth in fiscal '21. Our adjusted diluted EPS on a core basis, including the impact of the EPA matter, our revised full year outlook implies growth of 4.7% to 6.5% on top of growth of 26.5% in fiscal '21. Please proceed with your questions. That said, the thermometer ups and downs make it tough and that's what we called out the two-year stack to show that in total, but not just international, Health & Home up 10% even with all the EPA stuff, just to give people some perspective because of all the volatility. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. And in the case of the growth, I mean we're talking like this company is more than 40% bigger than it was four years ago and that's before Osprey and before the growth that we said on today's call that we expect to put down in fiscal '23. Please proceed with your questions."
}