{
    "symbol": "AMOT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 11:35:22",
    "content": "  Operator: Greetings, and welcome to the Allied Motion Technologies Fourth Quarter and Fiscal Year 2022 Financial Results Conference Call. Dick and Mike are going to review our fourth quarter and full year 2022 results and provide an update on the company's strategic progress and outlook, after which we'll open up for Q&A. If not, you can find it on our website at alliedmotion.com, along with the slides that accompany today's discussion. If you're reviewing those slides, please turn to Slide 2 for the safe harbor statement. As you are aware, we may make forward-looking statements on this call during the formal discussion as well as during the Q&A. I want to point out as well that during today's call, we'll discuss some non-GAAP measures, which we believe will be useful in evaluating our performance. The fourth quarter capped off a record year for Allied, as we continue to execute our strategy, leverage our diversified end market mix and further develop our One Allied global platform. I'm incredibly proud of the teamwork and dedication of the entire Allied team as their consistent and focused efforts, advanced our strategic priorities, both organically and inorganically while navigating macro headwinds. There were a number of highlights during the fourth quarter, as revenue grew 35%, due to higher demand across each of our target markets, which included incremental sales from acquisitions and impressive organic growth of 18% during the quarter. And on an adjusted basis, our earnings per share were $0.43, up from $0.30 last year. For the year, we reached a milestone as our revenue grew 25% across the 500 million level. We achieved solid annual organic growth of 12% on a constant currency basis, which reflected strong demand within our Industrial and Aerospace & Defense markets. We believe our performance across markets substantiates the investments we have made to grow, diversify and strengthen our business. Overall, we achieved our stated goal of gross margin expansion, reaching a record 31.3% for the year, which was up 130 basis points. And we have not yet fully leveraged these acquisition costs, we still delivered annual net income of $17.4 million or $1.09 per diluted share and on adjusted basis, net income per share of $1.88, which was up 18% for the year. As a reminder, our results include the acquisitions completed during the fourth quarter of 2021 and the second quarter of 2022. As expected, we did see some minor seasonality seeping back into the business during the fourth quarter, particularly in December, due primarily to the typical holiday shutdowns and customer inventory adjustments associated with general business conditions normalizing. Nevertheless, fourth quarter revenue increased 35% to $131 million, which reflected higher demand across each of our target markets and incremental sales from acquisitions. Excluding FX, revenue was up 42% and organic revenue growth was 18.3%. Revenue in the aerospace and defense market grew 197% from organic growth, program timing, and incremental acquisition demand. Industrial market sales growth was 46%, reflecting strong end market demand in industrial automation, material handling, and electronics. We saw 8% sales growth within our vehicle market, largely from commercial automotive, trucks, and powersports demand. While medical markets benefited from surgical-related markets, in medical pumps, there were offsetting pressures due to lower pandemic-related sales. The distribution market, while a small component of our total revenue, increased 22% during the quarter. As Dick highlighted, our full year results are also strong, with revenue growth of 25%. On a constant currency basis, revenue was up 30% for the year, which included 12% organic growth. Sales to US customers were 58% of our total compared with 54% for 2021, with the balance of sales to customers primarily in Europe, Canada, and Asia-Pacific. Sales to industrial markets were up 43%, driven by the verticals noted on the slide. Industrial has seen nice growth over the last year and continues to be our largest market, making up 38% of our total sales. Vehicle grew slightly, as strong truck and commercial vehicle demand offset lower sales in construction and powersports. Medical market revenue was nearly flat on a full year basis, reflecting similar impacts in the fourth quarter. While acquisitions contributed to the Aerospace & Defense growth, we were also driving solid organic growth and benefiting from defense market program timing. Our fourth quarter gross margin was 31.1%, up 240 basis points from the year ago period. Higher volume, margin accretive acquisitions and pricing more than offset continued global supply chain disruptions and rising material and labor costs. Consistent with our stated objectives, you can see the progress we are making by executing our strategy in the annualized chart on the right, as we achieved a record annual gross margin level of 31.3%. While our recent M&A activity is certainly helping, we also quite this performance to our global team that continue to drive higher-margin solution-based sales. Fourth quarter operating income more than doubled to $8.2 million or 6.2% of sales, which was up 210 basis points. Operating costs and expenses as a percent of revenue were 24.8%, up a modest 30 basis points, largely attributable to our second quarter M&A activity. Operating costs for the full year were also elevated due to M&A activity, which resulted in higher engineering and R&D costs, intangible amortization expense and business development costs. Overtime, we expect to fully leverage those expenses with continued sales growth. On Slide 9, we present GAAP net income and adjusted net income, along with our adjusted EBITDA results. Our net income and diluted EPS have been adjusted for certain items, which we believe provides a better understanding of our earnings power, inclusive of adjusting for non-cash amortization of intangible assets, which reflects the company's strategy to grow through acquisitions as well as organically. Fourth quarter adjusted net income was $6.9 million or $0.43 per diluted share, up 43% from the adjusted $0.30 per diluted share in the prior year period. Adjusted EBITDA increased 47% to $16.6 million, or 12.7% of revenue, which was up 100 basis points from the fourth quarter in 2021. For the full year, adjusted EBITDA was up 31% to $65.5 million and as a percent of sales was 13%, up 60 basis points. We used about $44 million in cash to complete the three acquisitions in the second quarter, net of cash acquired, which was largely funded with debt. At the end of 2022, debt, net of cash was about $205 million, or 48.7% of net debt to capitalization. During 2022, we generated $5.6 million of cash from operations, a decrease from the prior year due to high levels of inventory and working capital timing. Based on our cash flow projections, we expect to deliver over time in a manner that aligns with and is consistent with our historical performance, and you can see the strong cash generation during the recent fourth quarter. Inventory turns were 2.9 times in 2022, a slight change from our 2021 performance as our teams continue to manage our inventory to meet increasing customer demand and combat sourcing and lead time challenges. As highlighted on Slide 12, fourth quarter orders of $145.6 million drove a book-to-bill ratio of 1.1 times and record backlog of more than $330 million at year-end. While there are still some components with long lead times, generally speaking, we are seeing sub stability within our supply chain. While a heightened level of macroeconomic uncertainty remains, we believe we are in a position of strength and are confident we can continue to execute our strategy by capitalizing on the many growth opportunities and positive underlying demand trends within our targeted markets. Specifically, demand is expected to continue at relatively strong current levels within our industrial markets, which should continue to benefit from our increased market presence around industrial automation, material handling, and as well as oil and gas tailwinds. Aerospace & Defense is expected to be bolstered by our recent acquisitions, and we anticipate further organic growth given our exposure and program participation. Having gained greater traction in many of our served markets, we are creating a larger, more robust base of business to support continuous and sustainable organic growth well into the future. We are currently focused on maximizing our recent acquisitions, driving cash conversion, and paying down debt, while still grooming potential opportunities and building out our M&A pipeline. Lastly, we believe we can continue to enhance our margin profile as we demonstrated this last year by further expanding our multi-technology solution, opportunities, and driving continuous improvement through utilization of AST, our lean tool kit in all aspects of our business. With that, operator, let's open the line for questions. Please proceed with your questions. Revenues down a little bit sequentially, but maybe not as much as some of the past years. But I would say to you, Greg, one of the reasons that -- you're correct in -- as we've always said, fourth quarter is always a crap shoot. We're not sure what's going to happen based upon prior years of holding back from receiving orders, making inventory levels look better for year-end for many of our customers, and delaying things until the new year starts. So, I would say given the broader background and diversity of our company now, that's been minimized to a certain extent or it's been reduced to a certain extent. So, I think some of the seasonality that we expected to see in Q4 may have been partially offset by ability to drop in the backlog as well from a sales perspective. Heading into Q1, we haven't really seen any change in the order patterns to a significant degree. I think larger macroeconomic events are at play, so maybe a little weakness from the European side in terms of forward-looking. But generally speaking, as we've stated pretty much all year long, it's just a little surprising the level of demand and support out there. You're not pushing as much volume through your shop floor and generating absorption, if you will, to boost that putting into inventory. So I think the good team over the years has done â\u0080\u0093 a good team doing a good job, raising selling prices to offset, what we've seen from a cost perspective, but it's a constant battle, and it has ebbs and flows. Please proceed with your questions. One, I'd like -- maybe we could talk a little bit about Aerospace & Defense. There was an interesting article in the Journal several weeks ago, kind of talking about there has not been, let's call it, a ramp in defense orders relative to maybe expectations going through 2022. Well, I would say to you, Ted, that the article is pretty accurate from the standpoint of while there has been inquiries to -- and quoting, looking at the higher volumes, we have yet to see those higher volumes come through with actual orders for delivery with assigned delivery days. So I think there's certainly the front-end work is being done to determine what's available, what they can get under and what timing. So even though we could deliver, all right, if everyone can't deliver, they're going to reshuffle and reschedule because it doesn't make any sense to have three quarters of a device sitting there and not being able to ship it. What's interesting, we've seen some shuffling that says, okay, what can we get on a current basis to handle some real, let's call it, more urgent requirements, which actually resulted in pushing other equipment out, so that they could free up capacity. And again, not from our standpoint, from the complete supply chain that's required to fulfill the requirements of whatever that device might be. We have not seen -- all we can be assured that inventories are being depleted, and the demand is there. Correct\n Next one, just on the top line is spending through the K, it looks like Polaris was about 11% of revenue, call it, $55 million. You've done a really nice job in terms of trying to sort of diversify, bring down the exposure to Polaris. But I mean, it's still a pretty important customer. And as I recall, I think they're even talking about the side-by-side market. And I wanted to sort of -- with that as a backdrop, square against your view in terms of your modest growth in the vehicle, like where -- if Polaris is really, let's just say, not really an avenue of growth, maybe I'm wrong on that. I mean our business with Polaris has remained strong, and it has been through diversification in other markets and the overall growth of the company. Obviously, we don't want to see the volume within Polaris get reduced. I would say to you that, that whole market is had some really boom years during COVID. But as you noted, it won't have as huge of an impact given the level of sales and diversification of the customer base that we have as it would have had in the future. So other -- the other vehicle markets that we're in, we are seeing some strength. And we've had some major programs that we've invested in the past, whether it's construction vehicles and buses or automotive or trucks and so forth. So we have some good emerging applications that we've been getting designed in on the last several years that are starting to take off, and it's all involved in electrification. And then we do see that, that is -- the schedules are firming up and getting stronger. But that industry still has some challenges with certain components, which are keeping lead-times low, but we do expect from our standpoint based upon schedules that we'll see an increase there. So, a little offset -- definitely an offset to what we might see on the -- from the sports -- utility sports market. And I would like to say when you mentioned ATV and side-by-side, think of ATV as more as the residential type of product, whereas the side-by-sides are used in many different applications, industrial, commercial, so forth. You have -- could you have some kind of sense in terms of what your exposure to like the construction equipment and heavy equipment businesses because I will tell you that if you listen to the players in that world, there is a lot of backlog for them to work through. It's -- again, it's the whole vehicle market, it's -- for us, it's quite diversified other than the large player. So -- and so we do have exposure in construction, agricultural, which is -- has been strong, and we think should continue to be strong, trucks. I have a whole list, but I'm going to get out of line because other people don't want to talk. On the backlog, you had a nice pickup in backlog, it's healthy. We're so far -- for us, we're already two-thirds of the way out of the first quarter. So, as we're looking at it, we're kind of looking at the whole backlog relative to the rest of--\n I'm not. But to characterize the backlog, I would say it's -- again, because lead-times have gotten stretched over the last couple of years, I would characterize the backlog as predominantly in the next six to nine months. So, for Q3, I'm not sure -- I would do that. Yes, I mean, as we said, we've seen continued strength of incoming orders. We know we're going to get asked that in the future, we'll have to prepare. But I think it's kind of -- we don't -- obviously, we don't get into forward-looking. And I know it's -- as we said, two-thirds of the way through. Well, that's actually, that's very helpful. So I do have more questions, but I'm going to step out of queue, and I'll come back in at that at a later time. Obviously, there's concern's out there on kind of how the broader macro environment could unfold. But we're also hearing from folks on just kind of the historic reindustrialization that's taking place in the US in part supported by some of the federal spending streams, some of the recent inflation Reduction Act, CHIPS and Science Act, IIJA. As a matter of fact, I mean, there's a backlog that sits out there that we we'll be working on into the future. But I would just say to you that, I agree 100%, the -- a number of factors come into play industrialization in the US, but I mean, we're a global supplier. So I agree that, there's some strength well out into the future here. Please proceed with your questions. Again, I said, there's ebbs and flows. And I would say, late last year, I would call is caught up in the sense that we had contractual agreements, which automatically allowed us to pass things through. As I think we've talked in the past, there's usually about a three to six month lag and all that being processed and pushed through and seeing it in results. It's a zero-based pass-through to a large degree, which doesn't help your gross margins as well. My only cautionary note was that, hey, in our reports you're seeing it as well you just continue to see prices increase. So at some point in time, we're going to come to a crossroads here where demand and inflation kind of battle each other here, and we're not going to be able to pass it through as easily. So it's -- like I said, it's just a constant battle. And I'd say, I agree exactly what Mike said from the standpoint of -- we would have expected to start to see some slowing, but we haven't. And I do agree that at some point I mean, as the prices keep going up and up and up and get the pass-through and who's paying them, and there's going to be pushback. If you're contractually bound by commodity price increases, you just whether it's plus or minus, you're going back to the contract, but it's these labor cost increases, too, that are in contracts. And the days of where the expected cost downs in the future, signing up for long-term contracts where cost downs are occurring, to follow the market where we're in today, I think anybody would be foolish to do that. So it's not just a battle that you're having to get, let's call it, constant challenge to make sure that you're staying hold, but you got to be careful that you're not putting yourself in a rough position in the future because the norms of cost outs and some efficiency improvements are not necessarily achievable. But -- and I'm not sure how much detail you want to go into this, but I'm just curious, one of the main themes is moving from component sales to solution sales and it's been an ongoing I guess, progression and will continue to be a progression. But any way you can sort of bracket out how much those sales have changed over the -- any given period of time, one, three, five years type of thing. Well, we've discussed this in multiple calls where the question is how have we transition the business from component sales to solution sales. And we said that if you go back, let's call it, five years, what was the percentage of our sales, what we would call components and what we call solutions today. We also mentioned in previous calls that it's a little more difficult because what we would have considered a solution sale back then, that is, let's say, adding gearing to a motor. That's just a normal sale versus adding electronics, adding some kind of feedback and a more sophisticated software-based solution and so forth. We are getting some very, very interesting projects that we're working on in programs. And we start adding up the number of opportunities that we've won as part of this solution-based selling, it's a significant portion of our new business. We'll be saying, that's never going to be shifted out, but there is definitely a shift in a trend where we're doing more and more system-based solutions with integrated solutions. But we go beyond just that now, too, where the company has transitioned, where it was like, okay, you got a motor, let's add a drive to it. And we invested in the group that we call -- we started out by saying global electronics team, it now expanded at the global engineering team, where we take on these major programs. So I would hesitate to just â\u0080\u0093 as I come back, my numbers would be a little bit inaccurate and even that our classifications would be. But I can tell you that more than 50%, I would say, certainly, in the â\u0080\u0093 with the global team, it's almost 100% is in the system sale opportunity, where multiple technologies being applied to a higher level solution. And yes, the margins are higher, that caution us on that, too, because when you start getting into these larger, more sophisticated solution sales, their software being developed. Well, it's really your investment that went into these products that we could be millions of dollars that have to be amortized over more like a software business and/or a high-end electronics product. And I know it's not a major driver of top line performance, but I know it's an area that you have been focused on in terms of growth, and you really are seeing some nice growth there. I would say to you, Ted, that conscious decision for one of our acquisitions, which sells 100% through the distribution channel. It's interesting is we don't report it through the distribution channel, because we're knowing -- we know what's the end markets that they're serving. And we are seeing the opportunity, and we're working on growing some, let's call it, some opportunities that can go through the channel that we're not participating in today. And it hasn't reached that and because of the broad customer base and other products that are going into it, it's a real opportunity for us to increase and expand our business from a channel standpoint. Is that growth coming as you're bringing more of your products into existing distribution partners, or do you see your future growth being driven by expanding your distribution partners in terms of the system...? I would say to you to start with, it's looking to leverage the distribution partners that we have today expand our reach with them given our existing products. That's the best way for us to, Iâ\u0080\u0099ll love to call it, test the market, test the waters about, do we have the right solution/product mix that you can successfully take through the channel. But I think our focus initially -- I don't think I know, our focus initially will be on looking forward to seeing what the opportunity is for us to bring more product into the existing channel. And then just two last questions, really kind of a little bit more around the guidance touch on. It is a little bit more than, I guess, you would say, well, I had in my model doesn't mean that we noted run your business. And then just kind of on a side note on the income statement, your business development expense, if you could just give a little guidance with regards to how you see that in 2023. So the CapEx has a little ebb and flow in the sense that, right, we didn't probably execute all the projects we had lined out for 2022, simply because of the supply chain, delivery of product from vendors to allow us to complete projects. So I would tell you, you see probably a little bit lighter on the 2022 side. And also, obviously, the additional business is being added to the mix, while not capital intensive, right, they add to that as well. So it's supporting a new product line with aligning one of our factories, adding tooling, adding capacity to our equipment to meet growing future demands on existing programs. I would say that, that's the nature of the majority of what we spend, from a maintenance CapEx standpoint, safety CapEx and the like, we're -- again, I think we've talked before, we're not -- we don't have significant expenditures. So, yes, what he's covered would be -- and he mentioned, some of the things get delayed for supply chain, and that's correct. There's other reasons to that, that occurred. I mean, delayed program launches when -- so in addition to supply chain, yes, not necessarily anything that we were doing, but we're one element of an overall solution. Another item that I think we see is that, we've had some success -- some early on success with some new opportunities we've been working on and they're starting to ramp. And as they're ramping, we're finding that they're expanding as well. So, well, we've allowed in there some program expansion beyond original estimates that do require capital investments, because that's one of the things that we looked at, and we've mentioned that efficiencies and costs and so forth and quality, all of that comes into play. Another thing that I'll mention to you, that has caused some additional and some expected additional spending is localization of manufacturing. And our belief is that, we need to be close to our customers, so that there's been some, I'll call it, duplication, but duplication from the standpoint of there's enough demand in, letâ\u0080\u0099s call, in Europe and enough demand in North America, and we may be putting in redundant systems in both and some of our planning has been around that. And they're sized appropriately, so it may not be one large capital expansion in one geographic region, it may be multiple ones. And there's reasons that the payback on those come back, they're very quick, and we had a program that we're ramping up right now. Highly automated, highly sophisticated and we can produce the product that we needed and -- but that's the end customers going into Europe. And then, we started looking at our internal transportation cost and we realized that we could with a little over a year payback duplicating some of the capital and put it in Europe and eliminate those transportation costs. And I hate to say it, but transportation costs always are going in at best method, everything ideal and then something happens and you're air freighting things in that could be quite heavy in cost of problems. And one of our facilities does another fantastic job, which is look at it and says, hey, I need six more full-time equivalents in production. So that â\u0080\u0093 those are other reasons why, and I think those will continue, and they're definitely good and strengthen our company for the future. Again, those â\u0080\u0093 that's the lesser side of things from a cost standpoint. As we've talked before, we're focused at the moment on paying down debt, but we are always growing opportunities and the timing of such opportunities are not always aligned with some of those priorities. So we'll continue down that path and dependent on how those opportunities develop and what our means to fund them are, it will drive the M&A expenditures. And so, if we were to assume that you had no M&A kind of would be a sort of a steady state of that line item within your P&L and why I ask is because we do actually for pro forma back it out. And since it's really not something that's not operational expense that we see, it's kind of hard to model with that a little bit of guidance. I mean, you see it like a $400,000 a year kind of steady state, absent any kind of M&A as you kind of work towards constant reevaluation and efficiency stuff 500,000 a year. I think rather than just shooting a number to you right now, I mean, we could do a little bit of mark here and come up with something that would be more representative of what we really think is going to be in the future here. I think we just be looking at, okay, here's what we did. So if we say, it's how to do it six, we're going to do two. We're going to do three, instead of whatever. Well, thank you, everyone, for joining us on today's call and for your interest in Allied Motion. Otherwise, as always, please feel free to reach out to us at any time, and we look forward to talking to you -- with all of you again after our first quarter 2023 results."
}