{
    "symbol": "AMOT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 10:59:03",
    "content": " Dick and Mike are going to review our second quarter 2022 results and provide an update on the companyâ\u0080\u0099s strategic progress and outlook, after which we will open it up for Q&A. As you are aware, we may make some forward-looking statements on this call during the formal discussion as well as during the Q&A. I want to point out as well that during todayâ\u0080\u0099s call, we will discuss some non-GAAP measures, which we believe will be useful in evaluating our performance. Our industrial markets saw strong demand, resulting in market growth of 40% over last year. We are benefiting from new solution offerings, acquisitions and continued economic recovery in broader end market verticals, including industrial automation, oil and gas, material handling, HVAC and instrumentation. Recent acquisitions also contributed to the aerospace and defense market, which doubled from the year ago period. While we are doing well in the top line, the highlight of the quarter was the improvement in our gross margin performance, which is consistent with our stated objectives as we achieved a record level of 32.4%. Our M&A activity is certainly helping, but we also equate this performance to our global teams that continue to manage multiple headwinds as supply chain issues and inflationary pressures on logistics, energy, material and labor continue to persist. Even at the operating level, our performance was solid as we continue to invest for future growth and taking into account the costs associated with the acquisitions that have not yet been fully leveraged. We achieved adjusted net income per share of $0.36, up 9% from $0.33 per share in the prior year period. Our pipeline of opportunities remains high and order levels continue to be strong with a book-to-bill of 1.1x in the second quarter, yielding a record backlog of nearly $324 million. If you turn to Slide 4, we highlight the three acquisitions we completed in the quarter. Located in Camarillo, California, ThinGap expands our precision motor capabilities by providing industry-leading high-performance zero cogging slotless motors for use in applications in aerospace, defense and medical that require precise motion and a compact high-torque-to-volume package. We also see the potential to advance our total solution capability into robotics, semiconductor and instrumentation markets. FPH brings technically advanced, reliable and cost-effective electrical drive systems and light weighting technologies or existing and future ground-based vehicles in the defense industry. A company was over 70 years of history, providing high-precision electromagnetic solutions, including linear and rotary motor technology for aerospace and defense, life sciences, semiconductor and other industrial applications. Their patented winding technologies, combined with robotic manufacturing, assures best-in-class linear motors as they provide the highest linear force density in the industry and have been selected and utilized in our own Alio solution offerings for many years. In reviewing the six acquisitions, which is some of the highlights is, one, they add significant new engineering resources to our growing global engineering capabilities. They bring proven and established relationships and certifications to accelerate our expansion into important markets, including aerospace and defense, automation, robotics, life sciences, semiconductor and medical. Ultimately, Allied is better positioned to create higher value solutions for our target markets and our customers. In 2023, we expect the collective contribution of the 6 acquisitions to exceed $100 million in revenue with gross margins in the high 30% range and EBITDA margins in the high teens range. The purchase price of all six acquisitions, including future payments, was approximately $160 million and was made up of approximately 70% in cash and the remainder in AMOT stock. We further believe the new acquisitions will provide Allied with significant new opportunities, and we are focused on integrating each into the global Allied platform. While we have now provided additional color surrounding the six acquisitions, I will caution you that we will not be providing individual unit performance information in the future as we will focus on leveraging the full One Allied potential and opportunities. As a reminder, our results include a partial quarter of contribution from the acquisitions noted on Slide 4, as ThinGap was completed on May 24, FPH on May 30, and Airex towards the end of the quarter on June 17. Second quarter revenue increased 21% to $122.7 million, a record level, which reflected strong demand in the industrial markets, as Dick discussed, and incremental sales from acquisitions. The recent acquisitions contributed to the aerospace and defense growth as that market vertical doubled from a year ago, partially offsetting were lower sales in the vehicle market of 3%, largely due to broad supply chain challenges within commercial automotive. And medical markets, which declined less than 1% due to the lapping of the strong prior year period that was still benefiting from some pandemic-related sales. Sales to U.S. customers were 58% of our total compared with 55% in last yearâ\u0080\u0099s period, and the balance of sales were to customers primarily in Europe, Canada and Asia Pacific. Vehicle markets were down 4% as strong truck, agricultural and construction vehicle demand was offset by the broad supply chain challenges in other market verticals. As noted, acquisitions contributed to the aerospace and defense growth in the quarter, which drove the TTM performance. As depicted on Slide 7, our gross profit was 32.4%, a record level and up 170 basis points from the year ago period. Higher volume, pricing, margin accretive acquisitions as well as selling price increases more than offset continued global supply chain disruptions, rising material and labor costs and non-cash acquisition costs. As Dick noted, you can see the significant improvement over the sequential quarter. Moving on to Slide 8, second quarter operating income was $7.5 million or 6.1% of sales compared with $6.7 million or 6.6% in the year ago period. Operating costs and expenses as a percent of revenue were 26.3%, up 220 basis points. As we have stated, we anticipate growing our margins over the long term with the disciplined execution of our lean toolkit, AST, combined with leveraging higher volume and continuing to evolve as a systems provider. Second quarter adjusted net income, which excludes business development costs and other nonrecurring items, was $5.7 million or $0.36 per diluted share compared with $4.8 million and $0.33 per diluted share in the second quarter of 2021. Adjusted EBITDA was $16.2 million or 13.2% of revenue, which was up 100 basis points. During the quarter, we used $44.8 million of cash to complete the three acquisitions. The debt increase also reflects a new finance lease that was highlighted during the first quarter of 2022 for our manufacturing facility expansion in Germantown, Wisconsin to support continued growth. At the end of the second quarter, debt net of cash was about $200 million or 49.9% of net debt to capitalization, and our bank leverage ratio was approximately 3.7x. We generated $13.1 million net cash from operations during the quarter and utilized $3.9 million on capital investments, which largely focused on new customer projects. Inventory turns were 3x in the second quarter consistent with our 2021 performance as our teams continue to manage our inventory to meet increasing customer demand, combat sourcing and lead time challenges. Orders were more than $139 million in the quarter, representing a book-to-bill ratio of 1.1x. Our backlog hit another record, increasing 12% over the sequential first quarter and up 90% over the prior year period to approximately $324 million. To reiterate, we have been busy on the M&A front, having now completed six acquisitions over an 8-month period. And as previously mentioned, we have now added approximately $100 million annually of new business that will be fully realized in 2023 with a measurably higher margin profile. Equally important to the collective financial contributions, our overall technology offerings are enhanced and our competitive positioning in target markets is strengthened. As we look forward, we are excited to leverage our stronger competitive position across our targeted markets. Specifically, demand is expected to remain strong across our many industrial end markets and in particular, industrial automation, oil and gas and material handling. While headwinds remain, we are confident that we can continue to anticipate and make the necessary adjustments to mitigate potential impacts and remain highly confident in our ability to enhance both our top and bottom line performance in the future. We do expect and given itâ\u0080\u0099s summer in Europe and typical in summer in Europe, you see some slowdowns in business and potentially, of course, the FX headwinds that we are seeing in potentially the impacts of Ukraine war. As far as the contribution of the acquisitions versus the core business, letâ\u0080\u0099s call it, clearly, the acquisitions, as we mentioned, the margin profile is higher, and it did have an impact. I will also say though, that we have seen some improvement in our core technology units, as we call them, our business units. We have also shifted some product lines around during the quarter, and thatâ\u0080\u0099s going quite well. So, overall, I see the operating team doing an excellent job in working with what they have, and yes, it is â\u0080\u0093 itâ\u0080\u0099s a positive impact, but the majority of the impact for the margin increase clearly comes from the higher margin generating businesses. They were near, quite frankly, near the end of the quarter that those occurred from a percentage standpoint, clearly were higher. I would add â\u0080\u0093 and concur and add that the collective six acquisitions delivered as expected from a margin perspective and delivered, I think we said collectively in the past that they would largely deliver our goal of the 100 basis point improvement in margin. So, I think that was another strong comp contributor to the quarter besides the acquisition is our success in passing along those selling price increases and neutralizing, if you will, to some extent, the supply chain impact. So, I mean if I think about the go forward, I mean you will now have sort of a full run rate contribution from the higher-margin acquisitions. And then if you assume that supply chains continue to improve, I mean it would seem logical that what you saw in Q2 can probably be improved upon in future quarters. And we would caution you that we do have one of the acquisitions that is still lagging and not contributing to the levels that we had initially planned, and we see it moving to the right. The backlog is very strong, but thatâ\u0080\u0099s been â\u0080\u0093 and thatâ\u0080\u0099s one where itâ\u0080\u0099s been impacted by supply chain and electronic components. And we would say, I will say, specialty vehicle because we â\u0080\u0093 our solutions are quite special in those applications. I suspect that with Spectrum Controls, and I know you donâ\u0080\u0099t necessarily call out business units, as you said earlier, but that Spectrum was one that you did say it was going to be a little bit slow in terms of hitting targets just because of some supply chain issues. But I mean the second, the follow-up to that is obviously, I mean itâ\u0080\u0099s still very bullish on the technology it brings to the team, obviously. So, I think â\u0080\u0093 and I look at that, and I would say to you, Gerry and everyone else is that even without that, we performed fairly well. I mean the whole idea of one of the, I guess key themes, I believe at Allied Motion was to shift more towards, from component sales to solution sales. And I think the best way to answer that is I am just, I want to look at and then point you to a slide here and mention to you that if you were to look at say a similar slide in prior years, itâ\u0080\u0099s the system solutions that we are actually offering today, okay. Yes, Slide 5 in the slide deck, what we call the solution in the past and the first product thatâ\u0080\u0099s shown on the left, top left there, the automated GPS-guided vehicle steering module, thatâ\u0080\u0099s a motor with embedded electronics and connectors and cabling and so forth. And that was the bulk of the Allied system solution offering, something that would look like that would be embedded , would have electronics and/or gearing embedded. And what I will say to you in the future, and we have talked about this internally is thatâ\u0080\u0099s becoming part of our culture that itâ\u0080\u0099s going to be the exception when we are shipping a component, letâ\u0080\u0099s just call it, just a motor, and itâ\u0080\u0099s going to be more about the motor and the electronics and/or the gearing, which we use â\u0080\u0093 we call solution is a relatively lower level solution compared to the rest of the pictures that you are seeing here on that same Slide 5. So, that system solution, and let me just throw numbers out without giving out too much information with a motor and electronics or something, we are talking in the range of an ASP of, letâ\u0080\u0099s say, anywhere from $100 to $500, $600. You are going to see more embedded software, more informatics, more Allied transitioning into a solution provider that can do model-based design and simulations and very precise high-level solution packages that are with ASPs that are much higher. We feel thatâ\u0080\u0099s core to our future technology, and we will not abandon that because we can leverage that into our other markets, and we continue to do that. They are still, even in those motor and electronic solutions is a tremendous amount of IP, software, and it just continues to develop and evolve and very sophisticated, okay. Itâ\u0080\u0099s getting at a much higher level, including much more embedded software, much more communications capabilities. I am going to, I have a couple of other questions, but I want to say them for a follow-up call, but I appreciate it and congrats on a really great quarter. Thank you, operator and thank you everyone for joining us on todayâ\u0080\u0099s call and for your interest in Allied Motion. As always, please feel free to reach out to us at any time and we look forward to talking with all of you again after our third quarter 2022 results."
}