{
    "symbol": "WK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 22:55:24",
    "content": " Before we begin, I would like to remind everyone that during today's call, we will be making forward-looking statements regarding future events and financial performance, including guidance for the second quarter and full fiscal year 2020. We had strong new logo growth adding 93 net new logos and delivering a 27% increase from Q1 2021 in the number of customers with contract values over $100,000. We generated total revenue in the first quarter of $129.7 million, showing growth of 24.4% from Q1 2021. Professional services revenue was $22.6 million in Q1 2022, up 16.9% from the same quarter last year. The number of contracts valued at over $150,000 totaled 603 customers in the first quarter of 32% from Q1 2021. Breaking out gross profit, subscription and support gross profit totaled $89.4 million equating to a gross margin of 83.4% on SMS revenue, a contraction of 160 basis points compared to Q1 2021. Professional services gross profit in the first quarter was $10.7 million, a contraction of 30 basis points versus Q1 2021, equating to a 47.3% gross margin. Research and development expense in Q1 totaled $32.7 million, up 35% from Q1 2021 due to new headcount investment; compensation related expenses and increased server usage versus Q1 2021. Net use of cash from operating activities in Q1 2022, totaled $900,000 compared with cash provided of $11.5 million in the same quarter a year ago. So would love to maybe just touch on that what's embedded in that guidance and then specifically just touching on one, the tough headcount environment, right, in terms of whether that's elongating sales cycles, implementation cycles, two, the geopolitical impact on spending intentions, especially in Europe and then three, obviously any changes specific to that capital markets component or the ESG component versus the guidance you're given in February would be helpful. And then on the ESG demand, I know in Q4, you had said this was a top four solution, just wondering you probably the core product probably was lower this quarter, just wondering as, have you seen even more activity in Q1 particularly with the SEC comments – now comment period, not underway and maybe on that topic, when you think about how potentially to package it alongside financial reporting, how do you – how should we think about that, let's say fast forward to when this ruling comes out."
}