{
    "symbol": "SLP",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-26 21:28:04",
    "content": " After the close, we reported fourth quarter and full year revenue growth of 19% and 16% respectively exceeding our fiscal 2022 guidance of 12% to 15%. Fourth quarter capped off a good recovery in our services business with 13% growth and finishing the year with a backlog of $16 million, 22% greater than the end of last year. Our revenue outlook for the fiscal 2023 remains consistent with our long-term organic growth rate of 10% to 15%, which translates to $59.3 million to $62 million. From a quarterly perspective, we expect Q1 revenue to be about 20% of full year revenue and Q2, three and four to be more evenly distributed for the remaining 80% of revenue. Total gross margin for the fiscal year increased to 80%, reflecting the higher software revenue mix. Software gross margin increased to 91% from 88% last year, while services margin increased to 63% from 61% last year. Regarding key services metrics, total services projects increased 8% this fiscal year compared to last year, and backlog increased 22% from $13 million last year to $16 million. Income from operations increased 299% to $0.7 million and operating margin was 6% compared to 2% last year, reflecting the leverage in our business model. Income tax benefit was flat from last year at $0.1 million, while the effective tax rate decreased from negative 74% to negative 8%. Adjusted EBITDA for the quarter was $2.3 million, and adjusted EBITDA margin was 20% compared to adjusted EBITDA of $1.7 million or 18% margin last year. For the fiscal year income statement, total R&D costs for the year were $6.4 million or 12% of revenue compared to $6.9 million or 15% of revenue last year. Capitalized R&D for the year was $3.2 million or 6% of revenue compared to $2.9 million, also 6% of revenue in the same period last year. Over the last five years, weâ\u0080\u0099ve seen annual R&D expense generally range from 6% to 8% of revenue. Income from operations was $14.9 million, an increase of 32%, and operating margin expanded to 28% from 24% last year, reflecting increased revenue, expense management and the leverage inherent in our software and services mix. Adjusted EB increased by 24% to $21 million this year, while adjusted EBITDA margin expanded to 39%."
}