{
    "symbol": "FOSL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 22:43:14",
    "content": "  Company Representatives: Kosta Kartsotis - Chairman Chief Executive Officer Jeff Boyer - Chief Operating Officer Sunil Doshi - Chief Financial Officer Greg McKelvey - EVP, Chief Commercial Officer Christine Greany - Blueshirt Group\n Good afternoon, ladies and gentlemen, and welcome to the Fossil Groupâ\u0080\u0099s Second Quarter 2022 Earnings Call. Please note that you can find a reconciliation of actual results to constant currency results and other information regarding non-GAAP financial measures discussed on this call in Fossil's earnings release, which was filed today on Form 8-K and is available in the Investors section of fossilgroup.com. As a result, our quarterly sales were down 10% versus last year or down 5% in constant currency. There were also signs that higher levels of inflation impacted discretionary spending, especially against the backdrop of last year's stimulus in the United States. Also, ongoing COVID-19 restrictions pressured sales significantly in Mainland China. And lastly, foreign currency headwinds intensified and accounted for approximately $18 million or 430 basis points of impact to net sales in the quarter. In the Americas, Q2 sales were down 4% in constant currency. Traffic was up nicely in our physical stores with comps up nearly 20%, while e-commerce show declines due to the tough comparisons from last year. From a consumer perspective, traffic in average dollar sale has been positive versus last year in our stores and online, while the conversion is lower. And from a category lens, we have seen some category growth data that suggests that the overall traditional watch market is down versus last year, but up versus 2019, indicating to us that last year stimulus activity drove higher sell through. In Europe where constant currency sales declined 3%, consumers were out in physical stores with much lower COVID driven restrictions during the quarter. Offsetting the growth in physical locations with a decline in digital sales, both our owned e-commerce sites and pure-play accounts, primarily driven by lower traffic and as expected, FX headwinds contributed significantly to our overall sales results. More broadly, category sales data in key markets continue to highlight that our brands are seeing some modest improvements in market share. Turning now to Asia, constant currency sales declined 6%. As we anticipated, ongoing COVID restrictions in both digital and non-digital channels continued to dampen sales in Mainland China. Beyond China and India, other markets in the Asia region including Japan, Malaysia, Singapore and Australia have returned to more consistent and predictable revenue growth as countries have reduced their COVID restrictions. Net sales for the Fossil brand were up 7%, an increase double-digits in traditional watches. In our license brands traditional watch sales were down particularly in Mainland China where COVID restrictions persisted, creating a year-over-year headwind. While the declines have been sharply impacted by COVID driven restrictions since Q4 of 2021, the market potential for fashion watches in the region remains large over the long term and we are well positioned to capture growth as the conditions improve over time, particularly through our digital first capabilities. Our jewelry category remains robust and we have seen a nice trend for several quarters including Q2, with broad based growth across brands and channels. Our revised outlook which Sunil will cover in more detail, reflects that our wholesale business will remain challenging and that we have reduced our prior expectations for a return to normalcy in our China business this year. Our digital investments which are being directed to both technology and talent are expected to drive a number of significant enhancements in the coming quarters that will not only increase our active customer list, but also fuel deeper engagement with our existing file, while helping us attract new customers. Q2 net sales came in at $371 million, down 10% year-over-year and down 5% on a constant currency basis. Our direct-to-consumer channels led the region with 6% total growth, which was driven by comp store sales of nearly 20%. Consumer traffic in the U.S. and Canada were up even greater and spending was strong versus last year, particularly in watches, leathers and jewelry. From a wholesale perspective, net sales declined 10% in constant currency in the region. Many of our wholesale partners entered the quarter, with elevated inventory levels compared to last year, particularly in our license brands reflects a fewer than expected replenishment orders during the quarter. Sellout trends in the channel were down 10% versus last year, but up versus 2019, which we attribute to lapping last year's stimulus driven activity. Exiting the quarter, inventory levels within our key wholesale partners have come down significantly relative to the start of Q1, but are still higher than last year. Moving to Europe, constant currency sales declined 3%. DTC sales increased 13%, with store cost over 50% as consumers rotated from online shopping to brick and mortar. A key call out here, net sales into traditional brick and mortar wholesale were positive versus last year as many wholesale accounts across the Eurozone replenish inventory to support consumers who were shopping the channel post COVID-19 restrictions. Offsetting brick and mortar games, we saw a reduction in shipments into key wholesale digital account, which included a timing shift for Amazon's European Prime Day event from Q2 last year into Q3 of this year. Other markets that have historically benefited from Mainland Chinese tourists, such as concessions in Korea, and travel retail throughout the region, were also down compared to last year. And as Kosta mention, sales in India were robust, up triple digit to last year's COVID impacted level, and up sequentially versus Q1 of 2022. From a channel perspective, global digital sales decreased 21% versus a year ago and represented approximately 35% of our total sales mix. Similar to last quarter, our digital sales were down in our Asia region in Q2, primarily from Mainland China, where the majority of our sales are digitally driven and the impact of public policies have shifted consumer spending away from our category. Second, in Europe and the Americas traffic declined to our owned e-commerce sites and digitally based wholesale accounts have contributed to our digital sales declines in the quarter, as consumers pivoted more strongly to physical stores with eased COVID restrictions. However, as Kosta mentioned, global costs in our retail stores were up over 30% as we were able to capture consumer demand that pivoted back to brick and mortar. We ended the quarter with 349 company owned stores, down 10% versus a year ago, as we continue our program to rationalize our store base and improve our overall store profitability. Turning to category performance, in Q2 traditional watch sales decreased 7% in constant currency, with double-digit growth in the Fossil brand, offset primarily by declines in our largest license brands. Sales in Armani were down year-over-year due to sales declines in Mainland China, despite retaining its leading position on key digital platforms. While consumer demand was softer than last year and contributed to the sales declines, we also maintained pricing in our core platforms better than last year, which partially offset the sales declines with improved margins. Q2 net sales in our Jewelry category increased 12% in constant currency, with broad-based over growth across most of our major owned and licensed brands. Net sales in our leathers category increased 12% in constant currency, as improvements in our in-stock positions drove better selling in our DTC channels. Moving down the P&L, second quarter gross margin was 51.6%, down 240 basis points versus 2021. The year-over-year decline is primarily attributable to three factors; approximately 170 basis points from the non-recurrence of a prior year benefit due to a change in duty costs into the United States; approximately 130 basis points of higher freight costs as both ocean and air freight versus last year; and higher inventory costs in our European and Asian subsidiaries due to a stronger dollar this year versus last year. Turning to expenses, total operating costs were $202 million, down 3% versus last year. Both impairment and restructuring costs were down versus last year, as we wound down costs under the Fossil, New World Fossil 2.0 transformation program. SG&A costs which excludes impairment and restructuring costs were $199 million, down 1% versus last year. As a percentage of sales, SG&A costs were 53.7%, up 490 basis points versus the prior year period. Looking at the balance sheet, inventory balances at the end of Q2 were $438 million, up 24% versus last year. This reflects increased receipt flow, as well as higher levels of in-transit inventory as we pulled some inventory receipts forward early in the quarter due to extended transportation lead times and to mitigate potential COVID driven restrictions from our primary supply base in Mainland China. With the first half of the year behind us, we are taking a more cautious outlook on global consumer demand in the second half of the year. We expect that sustained inflation on core goods like food and energy and the reversion of spending toward more historical levels of services will moderate consumer demand in our categories, primarily impacting our sales outlook in the Americas and Europe. We also expect that consumer spending in Mainland China will not fully recovered this year, primarily due to the effect that COVID policies have had on discretionary category, and we have also taken into account prevailing currency rates, which has seen the dollar strengthen relative to our previous guidance. So taken together, we now expect full year revenue to be in the range of minus 5% to minus 8%, down from our previous guidance of flat to 3%. Using the mid-points of our current and previous guidance, our change in forecast can be quantified as follow:  First, from a constant currency standpoint, our revised revenue guidance is approximately 650 basis points lower than our previous guidance as we expect moderation in consumer demand to impact all of our operating divisions versus just the international operating division that was assumed in our prior guidance. In addition, we have reduced our expectations for a return to growth in Mainland China, based on the impact that COVID restrictions will continue to have on consumer discretionary spending in 2022. Second, prevailing currency rates have added another 150 basis points of headwind to our net sales versus our prior projection. While year-to-date currency rates have created approximately 340 basis points of impact to net sales, we estimate that prevailing rates will create approximately 500 basis points of headwind in the second half of the year. So for the full year, thatâ\u0080\u0099s approximately a 450 basis point impact on our sales. From an adjusted operating margin perspective, our revised revenue outlook, coupled with lower than expected gross margins, we now expect adjusted operating margin to be in the range of 2% to 4% for the full year, compared to our prior guidance of 5.5% to 6.5%. While revenue translates at a lower rate, our expenses also translate at a lower rate and our hedging program largely offsets the impact of higher inventory costs associated with our foreign subsidiaries purchasing inventory in U.S. dollars. Our Fossil business has been relatively strong overall, and we've been investing in additional design and merchandising capabilities and expect to see ongoing improvements in our watch, leather goods and jewelry businesses. First on revenue, broadly speaking and excluding the impact of foreign exchange rates and currency, we do expect that the outlook on consumer demand and some of the issues we talked about in Mainland China will lead us to see contraction revenue in each region in the back half of the year. In Mainland China, revised outlook reflects only a modest improvement versus Q2, even as we lap the fourth quarter of â\u0080\u009821, negative 20% that we saw. These markets that Mainland China and those markets that are mostly, most directly impacted by Chinese tourism, that's about 50% of the sales mix in the region. Conversely in India, our forecasts haven't changed from prior guidance and trends from the first half of the year continue to show strong underlying demand. Please note, in India for the third quarter we will expect more of a flat, possibly slightly negative growth rate as we lap a very strong snap back from last year's COVID restrictions in that country. In the Americas and Europe our revised outlook assumes that consumer spending in discretionary categories, particularly ours, will experience some pressure due to sustained higher levels of inflation and the some normalization of spending towards services and therefore a limit traffic across the channel. Conversely, our inventories are more weighted towards leathers and jewelry versus last year, and we will be bringing online some new capabilities that Kosta mentioned from our additional investments. Then lately as I mentioned, from a revenue perspective prevailing rates are expected to be about a 500 basis point headwind for the balance of the year. We ended the second quarter up 24% versus its prior period, which reflect a little bit more of that pull forward, as well as achieving lower sales in the quarter. With that backdrop, we don't expect our inventory growth rate to accelerate from Q2 to Q3 and we would expect our inventory growth rate to come down by the fourth quarter. Looking forward, and with the more cautious outlook that we provided, we are calibrating our future flow and will continue to manage down our overall inventory levels through the first half of next year. Second, we're highly focused on distorting and investing in our most profitable businesses, with increased sales effort, opened by allocation and marketing spend. As a result of the solid performance in our air freight channel and the extended planning horizon we used on product delivered on the water, our on-time delivery of our new products are seasonal offerings and standard replenishment skews has been very good, well over 90%. To maximize our sales potential and minimize inventory risk, we have continued to focus our inventory on our stronger selling products."
}