{
    "symbol": "CSR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 14:55:12",
    "content": " 05:26 All of this good revenue and wage news comes at a cost and we are also monitoring expense growth, which was 9.6% higher in the first quarter than the same period last year. Last night, we reported Core FFO for the first quarter ending March 31, 2022 of $0.98 per diluted share, an increase of $0.03 or 3.2% from the same period last year. The increase in year-over-year Core FFO is primarily attributable to strong same-store results and the accretive acquisition of 23 properties since the beginning of 2021, offset in part by higher G&A and property management expenses from the investment we made in our operating platform to service a growing portfolio. 07:06 Total G&A was 4.5 million for the current quarter, an increase of 15.2% compared to the 3.9 million in the same period last year, which was primarily attributable to an increase of 473,000 in compensation expenses and 273,000 in professional and consulting fees, offset by a decrease of 377,000 in technology related expenses, mainly driven by the relatively larger investment in the early stages of the Yardi implementation last year. I mean, in some markets, we kind of wish everyone else run revenue management, because that might help move market rates, but in Minneapolis specifically, I think it is KMS where that portfolio really was under-optimized on the revenue side, and outside of that, I would say it's a combination of probably us being a little bit more focused. So, going forward, we would expect expense growth to moderate on a year-over-year basis as the impact of some of the expenses that have hit us harder in the first quarter due to seasonality, just kind of becomes a lower proportion of our overall expense structure. And for energy, as I said, the impact that we felt for utilities cost was, because the price per unit went up in Q1 versus the prior year, but then the price kind of stabilized in last year's overall going forward from an expense standpoint, we don't really expect that to drive much of the expense increase, most of the expense increase is going to come from items such as compensation, which overall, we're expecting to be up about 5% year-over-year for the rest of the year."
}