{
    "symbol": "OPTN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-13 19:40:55",
    "content": " CS is diagnosed approximately 10x more frequently than nasal polyps, and in the current health care environment where off-label use is increasingly constrained by payers, we believe the new indication will allow us to access a significantly larger physician and patient audiences to drive growth. Before reviewing performance for the third quarter of 2022 and a revised guidance for full year 2022, I'd like to take a moment to remind everybody that we continue to believe there are multiple factors to support future growth of XHANCE. First and foremost, we believe approval of XHANCE as the first and only FDA-approved treatment for CS, should we achieve that, we'll create a tenfold opportunity based on the number of patients diagnosed and treated for nasal polyps versus those diagnosed and treated for chronic sinusitis. Based on our experience in nasal polyps, we believe the compelling clinical data from the Phase III ReOpen program may lead to not only a new indication in late 2023, but also ultimately to recognition by physicians, payers and patients of the clinical and economic value of using XHANCE to treat the large population with these serious chronic nasal inflammatory diseases. At that time, we believe that the fall allergy season would drive a market rebound and the new promotional materials, including exacerbation data from the ReOpen program, filling vacant sales territories and other initiatives would enable us to increase market share and deliver the prescriptions necessary to achieve $85 million to $92 million of XHANCE net revenues for full year 2022. In third quarter 2022, there were approximately 28,000 new prescriptions for XHANCE, a modest increase compared to third quarter 2021, while the market which includes INS prescriptions written by any physician, for any condition, a large component of which our prescriptions for allergic rhinitis increased 1% over the same period. Regarding depth, the number of physicians who had more than 15 XHANCE prescriptions filled by the patients in the quarter grew as well, with that number increasing by 2% from the third quarter of 2021 to third quarter 2022 with approximately 1,500 physicians in this segment. Based on available prescription data purchased from third parties and on data we received directly from our preferred pharmacy network, XHANCE average net revenue per prescription for the third quarter of 2022 was $232 a decrease of 8% compared to $253 of revenue per prescription in the third quarter of 2021. As we discussed on our second quarter call, we made a change to our co-pay assistance program at the start of 2022 that was intended to increase net revenue and average net revenue per prescription by reducing the number and proportion of prescription fills by commercially insured patients and plans that have a high deductible. which is giving the -- our sales force and then the doctors, the tools they need to make sure that the written prescriptions ultimately get filled because we have good data, Isaac, that when -- where we have a significant number of physicians, the 1,500 physicians that we mentioned in that -- in our what we call our believer group, they're writing a lot of prescriptions for a large audience."
}