{
    "symbol": "OPTN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 11:29:03",
    "content": " As I mentioned, we're off to a good start with 35% year-over-year growth in Q1 which will enable continued strong focus on our two core business objectives driving enhanced revenue growth and success and successfully completing the chronic sinusitis pivotal trials. As we highlighted in our fourth quarter earnings call in March, an approval could roughly triple the number of target patients for whom we can promote XHANCE and are currently called on ENT allergy specialty universe from approximately 1 million diagnosed Nasal Polyp patients to 3 million diagnosed chronic sinusitis patients. The total number of enhanced prescriptions in the first quarter of 2022 was approximately 80,600 which represents 11% growth over the first quarter of 2021 in a market environment that increased 8% over the same period. Regarding Breath, first quarter 2022 approximately 7,690 physicians had a patient fill at least one prescription for XHANCE, an increase of 11% compared to first quarter 2021. Regarding deaths, the number of physicians who had more than 15 XHANCE prescriptions filled by their patients in a quarter who's slightly faster, with that number increasing by 14% from first quarter 2021 to first quarter 2022 with nearly 1,500 physicians now in the segment. Based on available prescription data purchased from third parties, and also on data we receive directly from our preferred pharmacy network, XHANCE average net revenue per prescription for the first quarter of 2022 was $183, an increase of 21% compared to $151 of revenue per prescription in the first quarter of 2021. This change for Co-Pay Assistance Program is important going forward, as it was intended to increase ongoing revenue and average net revenue per prescription by reducing the rate of growth in prescriptions filled by commercially insured patients earn plans that have a high deductible, while sustaining the rate of growth in covered plans, where prescriptions are profitable. Second, with respect to XHANCE average net revenue per prescription, we expect to see improvement over the remaining three quarters of 2022 and to exceed $220 for the full year of 2022."
}