{
    "symbol": "OPTN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 14:22:05",
    "content": " We believe the future approval of XHANCE as the first and only FDA-approved treatment for CS has potential to increase the number of patients for whom the product can be promoted by tenfold, because claims data suggests that an order of magnitude more patients are currently diagnosed and treated for chronic sinusitis than are diagnosed and treated for nasal polyps. For the full year 2022, there were approximately 113,100 new prescriptions for XHANCE, a slight increase compared to full year 2021, while the INS market I just described increased by 7% over the same period. In fourth quarter 2022, there were approximately 86,200 total prescriptions for XHANCE, a decrease of 8% compared to fourth quarter 2021, while the market, which includes INS prescriptions written by any physician for any condition, a large component of which our prescriptions for allergic rhinitis increased by 3% over the same period. Regarding depth, the number of physicians who had more than 15 XHANCE prescriptions filled by their patients in a quarter, decreased by 8% from fourth quarter 2021 to fourth quarter 2022 with approximately 1,450 physicians in this segment. Based on available prescription data purchased from third parties and on data we received directly from our preferred pharmacy network, XHANCE average net revenue per prescription for the fourth quarter of 2022 was $242, an increase of 1% compared to $240 of revenue per prescription in fourth quarter of 2021. As we discussed on prior calls, we made a change to our co-pay assistance program at the start of 2022 that was intended to increase average net revenue per prescription by reducing the number of proportion of prescription fills by commercially insured patients and plans that have a high deductible. I mean, David, just for a sense of scale, I think when you think about the number of specialty like primary care physicians and our current call on the universe we're talking about a number that's a few thousand as opposed to when you look at the broader opportunity in primary care, I think historically, we've looked at -- there's potentially an audience of somewhere around 50,000 physicians who are kind of the higher-value prescribers in the chronic sinusitis space."
}