{
    "symbol": "ASPS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 11:44:02",
    "content": " Despite the difficult origination market and our revenue decline, we reduced our Origination segment's adjusted EBITDA loss compared to the second quarter and had strong sales wins that we estimate represent $10 million of annualized revenue on a stabilized basis. In Corporate, our costs declined by $5.9 million or 25% over the third quarter of 2021 from the sale of the Pointillist business, cost savings initiatives and the assignment of our sales and marketing employees to the business segments. In addition to the 3 market factors I just discussed, should delinquency rates rise above pre-pandemic levels, which is looking more likely in this economic environment, we would expect foreclosure starts and sales to exceed 2019 pre-pandemic levels and support further growth for our Servicer and Real Estate segment. As you can see on the left-hand side of the slide, during the quarter, we won an estimated annualized $10 million in new business on a stabilized basis and ended the quarter with an annualized average weighted sales pipeline of $23 million at the midpoint. As a result, we reduced the Origination segment's adjusted EBITDA loss by $600,000 or 25% compared to the second quarter despite the decline in service revenue as we benefit from our cost reduction initiatives. Finally, we continue to maintain cost discipline in our Corporate segment with costs down by $5.9 million or 25% over the third quarter of 2021 from the sale of the Pointillist business, cost savings initiatives and the assignment of sales and marketing employees to the business segments. So while the fourth quarter is normally a seasonally slower period for us, we think revenue will be roughly flat to maybe slightly down, but we think earnings will be -- adjusted EBITDA will be better as we benefit from the full quarter of expense savings in our Origination segment in the fourth quarter and as we make some changes in our Servicer and Real Estate segment that will get partial benefit from in the fourth quarter."
}