{
    "symbol": "DIBS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 14:15:08",
    "content": " Good morning, and welcome to 1stdibs earnings call for the quarter ended June 30, 2022. David will provide an update on our business, including our strategy and growth opportunities and Tom will review our second quarter financial results and third quarter outlook. Before we begin, please keep in mind that our prepared remarks include forward-looking statements including, but not limited to, statements regarding guidance and future financial performance, market demand, growth prospects, business plans, strategic initiatives, evaluation of alternative, business and economic trend dynamics, including e-commerce growth rates and our potential responses thereto, international opportunities and competitive condition. A reconciliation of non-GAAP to GAAP measures is included in today's earnings press release, which you can find on our Investor Relations website, along with a replay of this call. Lastly, please note that all growth comparisons are on a year-over-year basis, unless otherwise noted. Amid a challenging operating environment for e-commerce and home goods, we delivered GMV and revenue within our guidance range and EBITDA margin above our guidance range, as we manage expenses in light of continued soft consumer conversion. We strengthened our balance sheet and streamlined our business with the sale of Design Manager for $14.8 million, generating a healthy $9.7 million return on our purchase price. Lastly, we're pleased with early signs of traction in our key strategic initiatives, auctions, international expansion and supply growth. During the quarter, some business trends remain resilient, as compared to our last earnings report, while others softened. Supply growth remains healthy, helped by our pricing test, we're adding new sellers at three times last year's monthly run rate. While metrics are moving in the right direction, these efforts are in the early stages, and GMV contribution isn't yet large enough to offset softening new buyer conversion. Most importantly, consumer growth, which is historically 70% to 75% of GMV declined further due to conversion softness, particularly for new buyers. While we're bringing more traffic to the marketplace, it's not converting at historical rates. In addition to economic uncertainty, consumers are spending less online in favor of out-of-home experiences such as travel and dining out. In addition, we are seeing a traffic mix shift towards mobile web, which is a lower converting device type. With two thirds of our GMV from furniture, we're at the intersection of e-commerce and home goods, two areas negatively impacted by increased mobility post-COVID and heightened economic uncertainty. At the same time, what encourages us is that with the exception of new buyer conversion, we believe the long-term drivers of our competitiveness and the value we provide to buyers and sellers remain healthy. Traffic growth accelerated in the second quarter, our organic traffic mix increased supply growth is robust and sell churn is low. Additionally, 50% of auction buyers in the second quarter have never purchased from 1stdibs before. Lastly, while we intend to continue to invest responsibly in auctions, international expansion and supply growth, we are reprioritizing projects and continuing to identify cost efficiencies so that when demand for home categories rebound, our business will be more efficient and in a stronger, more competitive position. Alternatives may include buy and sell-side M&A, capital return strategies and partnerships, as well as revisions to our operational objectives and priorities. Similar to the first quarter, top of funnel activity remains healthy with traffic, registrations and item favorites, it's growing by double digits. Organic traffic mix increased by over 5 percentage points year-over-year, driven by continued strength in SEO coupled with a pullback in paid spent. Our largest lever is improving conversion, particularly for new buyers and on mobile web. In addition to our strategic initiatives, we have a number of projects and tests underway focused on this. During the second quarter, we prioritized projects to increase checkout entry and reduce purchase friction. For example, we launched improvements for low inventory pages, tested increasing the visibility of items with lower shipping costs and search and improve the discovery of auctions listings, which have higher sell-through and conversion rates. On the supply side, our seller team launched the bulk upload tool, savings sellers time and supporting listings growth. Additionally, we rolled out inventory life cycle recommendations, which suggest age and engagement-based actions to help sellers optimize sell-through. We also made meaningful progress in our strategic initiatives, which I'll review in more detail below. Bidder better activity, order volume and GMV continued to grow sequentially. In June, for example, auctions accounted for over 5% of total orders as compared to 1% of supply, and this trend carried over into July. In addition to higher sell-through rates, another strategic rationale for building auctions was activating new buyers. During the quarter, 50% of bidders had never made a purchase on 1stdibs. Auctions average order value was under $1,000, less than half of the AOV in our marketplace overall. We added 20,000 new auction listings in the second quarter, up 100% from the first quarter. However, that's just a fraction of our 1.4 million listings. Since launch, we've enhanced the auctions product experience through weekly updates. The focus this quarter was building features that optimize for value and urgency to drive bid participation by, for example, displaying the original list price and search and browse and on product pages to highlight value. Additionally, our work to boost supply and set competitive auctions pricing is ongoing. Given the success we're seeing, we are evaluating shifting existing resources to auctions. Users in these countries can now search in local languages, see search results to prioritize items located in Europe and experience a fully localized customer journey, including currency, customer service and shipping. While it's still early, we believe we're seeing promising performance in both markets. Given the highly considered nature of our purchases, our first priority is growing traffic from performance marketing and SEO. Traffic from French IP addresses grew 60% year-over-year during the quarter, while traffic from German IP addresses grew over 75% year-over-year, even though these sites launched late in the quarter. Building an international business is a multiyear process, and we're off to a great start. For the rest of the year, our international focus will be optimizing foreign language paid marketing, building SEO authority and introducing product enhancements, like incorporating real-time machine translation into our message center. Today, about 40% of our sellers, one third of our traffic and one fifth of our buyers are located outside the United States. Because supply begets demand for two sided marketplaces, accelerating supply growth is another priority. Our goal is to aggregate the world's most beautiful items regardless of where they're located, while maintaining our curatorial standards. Supply drives traffic, makes search results more robust and increases the chances that will make a match. Given our long tail of one-of-a-kind listings, providing buyers with more options should ultimately translate into higher order volumes. Our new seller production test, which launched in January continued to perform well. We signed over 700 new sellers in the second quarter, ending June with over 6,100 seller accounts. Consistent with the first quarter, we expect the pace to slow during the summer when many sellers take vacation. As a reminder, we launched the pricing test for new sellers in January. Despite material growth in our seller base, the absolute number of churn sellers declined year-over-year. As I mentioned above, while we believe the metrics for auction, international and supply growth are trending in the right direction, these efforts are in the early stages, and GMV contribution isn't yet large enough to offset softening demand. While we continue to believe in the long-term promise of the digital art market, given the reduced near-term outlook, we have paused incremental investment in our NFT platform. During the quarter, GMV growth rate softened month over month from April through June, and this trend has carried over into July. Given the slowdown, we're focusing on what we can control and taking actions to better align expenses to demand. For example, we have drastically reduced the number of open roles, limited hiring to critical positions and increase the efficiency targets on our performance marketing spend. However, fundamentals like traffic and supply growth remain healthy, and our strategic initiatives are gaining traction, which we believe in turn sets us up for future success. When e-commerce growth rebounds, we expect to be more focused, more efficient and poised to capitalize. GMV was $104.8 million, down 2%. In the first quarter, we saw strong top of funnel engagement but software conversion. While traffic growth accelerated, conversion softened, particularly for new buyers. This was partially offset by returning buyer conversion, which improved modestly year-over-year. We believe pipelines and project volumes remain healthy, but we expect to see a return to normal seasonality in the third quarter, which is historically slower for trade. As a reminder, when we reference trade GMV or consumer GMV, we are speaking about the subsets of on-platform GMV attributable to each of these buyer groups. Turning to vertical performance, new and custom furniture and jewelry GMV grew while all other verticals declined. Consistent with recent quarters, vintage and antique furniture accounted for less than 50% of GMV and the majority of our first-time orders continue to come from newer categories like art, jewelry and new and custom furniture. Average order value growth moderated in part due to a mix shift to auctions, lower AOV for auctions is a conscious part of our strategy and has many benefits, including higher sell-through, conversion and new buyer activation. We ended the quarter with approximately 69,300 active buyers, flat year-over-year and down 3% quarter-over-quarter. On the supply side of the marketplace, we closed the quarter with over 6,100 seller accounts up 40%. Transaction revenue, which is tied directly to GMV growth was approximately 70% of revenue with subscriptions making up the bulk of the remainder. Given the Design Manager sell closed on June 29, second quarter results included a full quarter of contribution. Gross profit was $16.6 million, down 4%. Gross margins declined year-over-year due to higher hosting and co-location costs, payroll and benefits and stock-based compensation. The higher hosting and co-location costs were the result of accelerated traffic growth, which were not offset by higher GMV and revenue due to softening conversion. Additionally, our operational teams make up approximately 30% of cost of revenue. Given current demand, we're seeing negative operating leverage here. Lastly, payroll and stock-based compensation expenses reflect a full quarter of our annual merit increases and stock-based compensation refresh, which went into effect in March. In addition to cost of revenue, these annual merit increases impact headcount-related expenses across all operating areas. Given softening conversion, we pulled back on performance marketing during the quarter. Technology development expenses were $6.6 million, up 45% driven by higher stock-based compensation and payroll and benefits. These reflect both hiring to support strategic initiatives, as well as our annual merit cycle, as mentioned above. As a percentage of revenue, technology development was 27%, up from 18%. General administrative expenses were $7.5 million, up 58%. The increase was mainly driven by expenses related to public company costs, including D&O insurance and increased headcount, higher stock-based compensation and approximately $300,000 of onetime legal fees related to the sale of Design Manager. As a percentage of revenue, general administrative expenses were 31%, up from 19%. Lastly, provision for transaction losses were $1.6 million, 6% of revenue, flat year-over-year. Combined, other company costs and headcount supporting strategic initiatives, primarily in technology development were approximately $4 million in the second quarter. Excluding these expenses, our second quarter adjusted EBITDA would have been a loss of roughly $2 million, an improvement versus last year. We ended the quarter with a strong cash and cash equivalent position of $162.7 million, including the proceeds from our sale of Design Manager for $14.8 million. We forecast third quarter GMV of $88 million to $95 million, down 19% to 13% year-over-year. Net revenue of $20.7 million to $21.9 million, down 19% to 14% year-over-year and adjusted EBITDA margin loss of 37% to 33%. GMV guidance reflects a number of converging factors, including shifting consumer behavior, ongoing economic uncertainty and conversion headwinds and the GMV contribution from our strategic initiatives will increase sequentially, but it won't be enough to offset broader conversion softness. Guidance reflects a softening demand environment and a sequential decline of approximately $3 million in revenue at the midpoint, resulting in negative operating leverage. Lastly, starting in the third quarter, results will include Design Manager, which generated less than $1 million in quarterly revenue and was operated at approximately EBITDA breakeven. During the second quarter, we began taking steps to align our cost base to current demand, we expect that this work will continue in the third quarter. To date, we've limited hiring to critical positions, increased our efficiency targets for performance marketing spend and started rationalizing non-headcount costs. Additionally, we are actively marketing our New York office space with the goal of reducing our real estate footprint, some of these actions are immediate, while others will take time to impact the income statement. In summary, our expectation is that e-commerce will revert to historical growth rates over time. That's why we continue investing in options, international expansion and supply to drive long-term growth, while managing expenses elsewhere. As always, we intend to adjust as needed, announcing long-term growth and EBITDA margin expansion. First, given the current environment, it would seem that your balance sheet gives you a pretty sizable competitive advantage versus some of the privates in the space. So first, in terms of M&A, we do think this environment potentially does great opportunities, especially among smaller private companies that may have challenges in raising capital. But overall, again, I don't think it's â\u0080\u0093 you know, I don't think it's any fundamentally different than any other market environment. Second, in terms of auctions, as I mentioned in the script, we are very pleased with our growth in auctions. Order volume, for example, in Q2, was up 49% versus Q1. Your line is now open. And then a second question on kind of shifting preference to mobile or mobile browser, I think is what you said. In general, the way I would characterize our kind of top of funnel activity is that, you know, the top of the model of traffic and engagement metrics, including things like favoriting and registrations and so on have been very healthy, as healthy as they've ever been in the business. When we look at conversion, the softness in conversion is concentrated or specific to new buyer conversion. So - and as you correctly point out, that softness in turn is driven largely by a mixed set in favor of mobile web and lower converting channels. Our strategy is there, again, are not that different from what they've been in the past, which is a combination of, on one hand, incremental, kind of always on improvements to the core user experience, things like figuring out how to optimize, how we present shipping prices and changing around the format on mobile web, landing pages and so on. With respect to your second question in terms of AOV, we have seen relative strength actually in lower AOV orders, which for us below $1,000. Auctions has an AOV that's kind of in that zip code, and then we're seeing at the same time strength in the non-auction marketplace at those price points as well. Your line is now open. You're seeing a lot of accounts added, but obviously, GMV is slowing. In terms of supply, so yes, because you correctly point out, we're adding sellers at roughly 3 times the rate that we added them historically. However, given the length of the sales cycle on 1stdibs, there is a pretty substantial lag time between when we add sellers when they add supply, right, because that's - there's a cumulative effect as they add more supply over time. But obviously, most of that supply has not yet converted into orders, but that's in line with the experience of all sellers on 1stdibs, and we'll have a much better sense of how the inventory performs over the next 6 to 9 months. It's the one product we have that creates urgency, its also a value oriented product, which I think is - works well with the macros that we're currently in. Our non-transaction revenue, it's been relatively flat year-over-year. It's primarily subscription-based revenue, excluding our Design Manager, which clearly, we sold in quarter. So year-over-year trends, excluding design manager have been flat, relatively flat. So first, in terms of auctions and when they move the needle, I mean to some degree, they have. So in Q2, for example, auctions were roughly 5% of our total order volume. But as on as we continue our current momentum, I think it will obviously continue to grow and impact over time. In terms of the correlation of our sales with the housing market in general, we're much more levered to the luxury housing market, and we have seen continued strength in trade, trade had a good quarter in Q2. Trade growth rates, GMV growth rates softened a little bit versus the prior quarter, but were still very healthy. And what we hear back from our designer clients is that sort of in Q3 - Q3last year, we were comping a quarter where there wasn't typical seasonality. So its sort of hard to know whether secular trends, how they relate to economic cyclicality, but everything we hear from our customers, at least over the near-term horizon is positive. Your line is now open. So just to recap, I mean, July was our first full month where we had a kind of a sequential comp for international. And what we saw was traffic from German, French IT domains, meaning it's not necessarily only the new sites that we launched. But overall from those countries, we're up between the two of them, well over 50%. So we're pleased with our progress there, particularly since our first priority is to grow traffic. In terms of both the roadmap for other countries and then also kind of the overall impact, I mean, in terms of the roadmap for other countries, first priority is to make sure that we develop the playbook via scaling France and Germany. So that's both growing traffic organically and inorganically and then obviously, converting that into orders. And as soon as we feel like we have a good handle on that, then the cost, we'll then apply that to new markets. I know it's a small part of your business now, but you have kind of a hybrid, as you may did weigh in the capacity you'll buy now and auction format. So on the demand side, I wouldn't call it resistance, but I mean auctions don't really work as well with trade - with the interior designer business model. They operate on schedules and almost definitionally, of course, auctions don't really correspond to customer buyer schedules. On the consumer side, obviously, and some level it appeals to everyone, particularly people who are focused on value. So we do see, occasionally, for example, designers who appreciate value or because they appreciate value buy, but usually, they're buying for their own account rather than for their client accounts. I mean, we've been in business for almost 20 years in one form or another without options. So kind of growing awareness among both our existing buyers that we have this format and understanding how it works, as well as, marketing to people who love auctions, interactive auctions buyers, but because we haven't had auctions haven't been for zip customers is, I think, the second challenge. On the supply side, again, I would say - I wouldn't really call anything in obstacle, I mean sellers have adopted auctions. And actually, we saw a very substantial acceleration in supply growth in Q2 versus Q1 from our sellers. Part of the reason why auctions are so compelling, is that in the - whereas in the marketplace, pricing - sellers price typically at a slight premium to where they anticipate the market clearing price end up or given you know, because we support negotiations. So that's somewhat counterintuitive you know, pricing strategy for our sellers and very different than the way they price on 1stdibs for a long time now. Your line is now open. If I could, last quarter, you talked about improvements in shipping loss provisions. And then maybe just you know, kind of turning to expenses, excuse me, it sounds like you're making some improvements both on the short term and maybe a little bit longer-term in duration. The shipping expenses in the second quarter were minimal less than k $100,000, as we do continue to increase our pre-quotes to reflect the changes in shipping prices. As far as on the expense side, yeah, we're committed to calibrating our expenses to the current demand environment, and we're evaluating all of our options. During Q2, as you mentioned, we did begin to make some concrete actions to align our expenses to demand. Additionally, we're renegotiating aggressively on all new contracts as they come to come up. We're moving quickly to adjust our plans, and we would expect you to see substantially more financial progress, which will flow through primarily in Q4. I will say, I'm not satisfied with the EBITDA margins that we reflected in the third quarter guidance, and we're focused on identifying and realizing more incremental savings. However, we do want to be careful not to trade off future growth drivers. So we continue to resource our key strategic initiatives, the ones that David has been talking about on this call, auctions and international and the supply expansion."
}