{
    "symbol": "DIBS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 08:47:03",
    "content": " Good morning and welcome to 1stdibs earnings call for the quarter ended September 30th, 2022. David will provide an update on our business, including our strategy and growth opportunities and Tom will review our third quarter financial results and fourth quarter outlook. Before we begin, please keep in mind that our remarks include forward-looking statements including, but not limited to, statements regarding guidance and future financial performance, market demand, growth prospects, business plans, strategic initiatives, evaluation of alternative, business and economic trend dynamics, including e-commerce growth rates and our potential responses to them, international opportunities, and competitive condition. A reconciliation of non-GAAP to GAAP measures is included in today's earnings press release, which you can find on our Investor Relations website, along with a replay of this call. Lastly, please note that all growth comparisons are on a year-over-year basis, unless otherwise noted. Despite a challenging environment for e-commerce and home goods in general, we delivered GMV revenue and adjusted EBITDA margins above the high end of our guidance. Strength in jewelry and high-value orders bolster GMV, while adjusted EBITDA margins benefited from cost cuts. Additionally, we continued making progress on our strategic initiatives, auctions, international expansion, and supply growth. For the past two quarters, we have aligned expenses to lower demand by drastically curtailing hiring, increasing performance marketing efficiency targets, and reducing headcount by approximately 15%. As a result, adjusted EBITDA margins improved sequentially despite quarter-over-quarter declines in revenue. Traffic growth was healthy, organic traffic mix improved four percentage points due to continued strength in SEO combined with higher efficiency targets on performance marketing. Once again, returning buyer conversion increased, but this was offset by softness in new buyer conversion. Auctions represented 6% of total orders in the quarter, up from 4% in the second quarter. Traffic growth to our localized French and German sites accelerated sharply, and we added new sellers at three times last year's rate. Through the end of the second quarter, we had seen average order value grow for the prior seven quarters. However, AOV declined in the third quarter. At the same time, order growth rates improved month-over-month throughout the quarter. We believe AOV declines are driven by two factors; first, the growth of auctions, which has a lower AOV than fixed price purchases; second, an increasing percentage of overall orders under $1,000. Over the past two decades, 1stdibs has become synonymous with high-quality one-of-a-kind items. You won't see a line item for trust on our income statement or balance sheet, but it underpins everything we do. For example, in spite of overall AOV declines, we saw a record number of orders over $100,000, driven by jewelry. We are committed to reaccelerating GMV growth and enhancing shareholder value and are reviewing multiple paths to help us achieve these objectives, including our ongoing review of various strategic options for the business with our financial advisers at Allen & Company. Turning to operations, we remain focused on the drivers of our business, improving conversion, realizing efficiencies, expanding supply, growing auctions, and expanding internationally. Today, subdued home goods demand, economic uncertainty, a traffic mix shift from returning buyers to new buyers and a device mix shift from desktop and app to mobile web are conversion headwinds. Everything we do is focused on overcoming these, including our strategic initiatives and day-to-day product and marketing enhancements. During the third quarter, for example, we added more product recommendations to low inventory pages, improving conversion for those pages. So far, approximately two-thirds of Klarna checkouts have come from first-time buyers. For example, this quarter, we completed a number of initiatives to improve operational productivity. Through product enhancements and operational improvements, we reduced overall client service inbound volume by over 20%, while maintaining high customer satisfaction. Our supply team made efficiency gains as well, working cross-functionally with product management, we launched a new self-service onboarding experience for sellers, allowing us to onboard higher volumes of sellers without adding headcount. Our goal is to aggregate the world's most beautiful items regardless of where they're located, while maintaining high curatorial standards. Supply growth is a strategic priority because it drives traffic, makes search more robust, and increases our ability to make a match between buyers and sellers. We signed over 650 new sellers in the quarter, ending September with over 6,700 seller accounts, up over 40%. Because we're a marketplace of one-of-a-kind items, breadth matters. For example, one of our new dealers, a specialist in fine minerals, made their first sale, a high-value order to a collector in September. The payer have subsequently connected on additional orders, an example of how adding supply drives GMV. Looking ahead, we're focused on inventory life cycle management, which is targeted at helping sellers succeed on the marketplace by providing guidance on pricing and choice of purchase format. We continued seeing great traction in auctions with bidders, orders, GMV, and supply all growing double-digits sequentially. We had 41,000 unique auction listings, up from 25,000 in the second quarter. Since launch, art and jewelry have been the top-performing verticals, accounting for approximately 70% of orders, highlighting the value of operating across multiple verticals. Auctions AOV remains below $1,000. Additionally, about 30% of first-time bidders registered and placed their first bid on the same day. Even if they don't win the auction, bidders provide their contact information, payment details, and signal about what they're interested in. During the third quarter, we improved discovery with new on-site touch points and increase the visibility of existing auction modules. In the fourth quarter, we're beginning work to refine pricing recommendations and provide sellers more guidance around what categories and listings perform best. Turning to International, this was our first full quarter operating localized sites in Germany and France. Traffic from German and French IP addresses grew over 375% year-over-year, albeit off a low base, driven by two factors. First, we started testing local language performance marketing in French and German. Second, we're starting to see SEO benefits from our pages being indexed in local languages. Given our consideration cycle is about 100 days, it will take time to convert this traffic into orders. Our international product team incorporated on-the-fly machine translation into the messaging center, allowing buyers and sellers to communicate in the language they are most comfortable with. Despite a difficult environment for e-commerce, our platform displayed its unique value this quarter. When demand rebounds as we believe it will, we will have a leaner cost structure and more growth drivers, including auctions, localized marketplaces, and increased supply. Additionally, we are encouraged that despite lower AOV, year-over-year order growth rates improved throughout the quarter and into October. Unlike the current demand environment, our trusted brand and world-class supply are durable assets, giving us confidence in the future. -- strength in jewelry and high-value orders, we delivered GMV, revenue, and adjusted EBITDA margins above the high end of our guidance range. Despite lower revenue, adjusted EBITDA margins improved sequentially as a result of our cost reductions. GMV was $99.2 million, down 9%. Similar to the first half of the year, traffic growth remained strong, while conversion softened, particularly for new buyers. Consistent with recent quarters, trade growth was relatively stronger. Jewelry, our second largest vertical behind vintage antique furniture has grown every quarter since mid-2018. Strength in jewelry was helped by a record number of high-value orders, highlighting the benefit of spanning multiple verticals. Consistent with recent quarters, vintage and antique furniture accounted for less than 50% of GMV. Nearly 60% of our first-time orders can categories, jewelry, new and custom furniture, art and fashion. Over the past seven quarters, average order value grew. In the third quarter, it declined 3%, driven by a mix shift to auctions as well as an overall higher percentage of orders under $1,000. Additionally, our median order value, which is insulated from quarter-over-quarter fluctuations in high-value orders, has declined on a monthly sequential basis since June. While average order value and median order value declined, order growth rates improved month-over-month throughout the quarter, a trend that continued into October. During the quarter, median order value was approximately $1,250 and over 40% of orders were under $1,000. We ended the quarter with approximately 68,000 active buyers, down 5% year-over-year and 2% quarter-over-quarter. On the supply side of the marketplace, we closed the quarter with over 6,700 seller accounts, up over 40%. During the second quarter, we began taking steps to align our costs to current demand. In late September, we made the difficult decision to reduce our headcount by approximately 10%. Starting in the fourth quarter, we expect this headcount reduction to generate approximately $1.5 million of savings on a quarterly basis or roughly $6 million annually. Between our September reduction and limiting backfills for attrition, headcount is down 15% from the second quarter peak to the end of October. To-date, we reduced headcount, limited hiring to critical roles, drastically reduced the number of open positions, lower performance marketing spend by increasing efficiency targets, and started rationalizing non-headcount costs. At the end of the second quarter, we also streamlined our business and strengthened our balance sheet by selling Design Manager for $14.8 million. We continue to look for other cost savings opportunities, including actively marketing our New York office, where rent expense is approximately $4 million per year. Relative to the second quarter, adjusted EBITDA margin improved by roughly one percentage point despite sequential declines in revenue. If you exclude one-time severance charges, operating expenses declined 8% sequentially. Compared to last year, GMV declined approximately $10 million and revenue declined by $2.8 million. Despite this, adjusted EBITDA was approximately $100,000 lower year-over-year as we modeled back expenses. This reflects expense reductions in the second and third quarter, but does not include the impact of our late September headcount reduction, which will start to be reflected in the fourth quarter. Turning to the P&L, net revenue was $22.7 million, down 11%. Transaction revenue, which is tied directly to GMV, was approximately 70% of revenue with subscriptions making up the bulk of the remainder. Pro forma for the sale of Design Manager, revenue was down approximately 9% year-over-year and 4% quarter-over-quarter. Gross profit was $15.5 million, down 14%. Gross margins were 68%, down from 71% a year ago. Gross margins declined as payroll and benefits, hosting and co-location costs and stock-based compensation increased as a percentage of revenue. Similar to the second quarter, higher hosting and colocation costs were a result of stronger traffic growth without offsetting GMV. Sales and marketing expenses were $11.1 million, down 14%, driven by lower performance marketing spend, partially offset by one-time severance payments related to our September restructuring. Similar to the second quarter, we pulled back on performance marketing and increased our efficiency thresholds due to softening conversion, an example of recalibrating expenses to match demand. Sales and marketing as a percentage of revenue was 49%, down from 50% a year ago. Technology development expenses were $6.4 million, up 33%, driven by higher stock-based compensation and higher salary and benefits, including one-time severance payments related to our September restructuring. As a percentage of revenue, technology development was 28%, up from 19%. General and administrative expenses were $6.7 million, up 11%, driven by higher stock-based compensation and payroll and benefits. We realized over $200,000 in savings on D&O insurance as we continue to aggressively negotiate contracts as they renew. As a percentage of revenue, general and administrative expenses were 30%, up from 24%. Lastly, provision for transaction losses were $1.2 million, 5% of revenue, flat year-over-year. We forecast fourth quarter GMV of $96 million to $103 million, down 19% to 13%. Net revenue of $22.2 million to $23.3 million, down 18% to 13% and adjusted EBITDA margin loss of 24% to 20%. GMV guidance reflects a number of conversion factors, including shifting consumer behavior, ongoing economic uncertainty, conversion headwinds, particularly for new buyers, and limited visibility. Turning to adjusted EBITDA margins, guidance reflects savings from our third quarter headcount reduction and ongoing expense management. However, some of the savings from our September headcount reduction will be partially offset by seasonal expenses in marketing and operations. As always, our goal is to grow GMV and drive operating leverage with the ultimate aim of growing free cash flow per share. We're already starting to see tangible results, with adjusted EBITDA margins improving sequentially despite lower GMV and revenue. Your line is open. I mean, one, the simplest is when you look at the market landscape, there are comps out there, companies that are kind of at least from a high level, reasonably similar to ours in terms of both supply and demand. They're in the kind of, I don't know, $600 million to $800 million range, we believe. So, the balance between those two things, all of our research says the primary reason why our sell-through rates are what they are is that the price is perceived to be too high. On the demand side, conversion rates are significantly higher for new buyers than they are for the marketplace. We're still in the process of both learning ourselves and teaching our sellers and how to work with auctions and then lastly, had to grow awareness among buyers. On international, I know you -- this was the first full quarter for France and Germany. Right now, it's not a material part of our GMV. I don't think that we'll be breaking it out probably into the first half at least of next year as it becomes larger, will we consider that. Your line is open. First, just given the current business mix and contemplating the ongoing cost savings, I think you mentioned because of the reduction of $4.5  million Q-on-Q improvement, also potentially subleasing the New York office space. I guess at a high level, is there a certain level of GMV or revs that we should be thinking about, at which point you've reached that EBITDA breakeven. In September, we've made the difficult decision to reduce our head count by about 10%. At the end of October, our headcount was down 15% versus the second quarter peak. Operating expenses declined approximately 6% quarter-over-quarter and that's despite lower revenue, adjusted EBITDA margins improved sequentially. And lastly, we expect our September headcount reductions to reduce quarterly operating expenses by about $1.5 million a quarter or $6 million annually. So, we're also redeploying our resources to the highest potential projects. For example, we moved engineering resources from NFTs to auctions and projects that increased conversion and engagement. And kind of going forward, we are focused on identifying and realizing additional efficiencies and diligently managing our expenses. I just want to remind everyone, reaccelerating GMV growth is a precondition to us achieving that breakeven mark. As we've discussed on prior calls, we have an asset-light business model with high operating leverage. So, in terms of declining GMV and revenue, there is pressure on EBITDA. When GMV growth returns, though, we will be well positioned to realize the operating leverage in the model with a high percentage of additional revenue hitting the bottom-line. So, it sounds like kind of embedded in that though is at some point, you need to see some GMV recovery to reach that pack to breakeven. Second question, just on the seltzer boarding for more sellers -- how do you balance that lower touch versus your historically higher touch betting process, which buyers maybe view as a bit more of an endorsement that these are credible sellers. That's what's resulted in the tripling of our -- kind of, the rate at which we're adding suppliers. Your line is open. On marketing efficiency increases, I think you talked about getting better performance. So, what we've done is we analyze every channel that we have paid spending within marketing. Just in terms of softness in new buyers, which is obviously a large lever to getting you back to accelerating GMV. I mean, listen, overall, as we look at the funnel, as we've said in past quarters, and it remains the case, most parts of the funnel are very healthy. So, traffic growth is very strong, as strong as it's ever been. But we've also seen a significant shift in traffic in favor of our lowest converting channel, mobile web. We added Klarna, adding the number of items on search results pages when people get to 1stdibs from Google, from SEO. And of course, our primary strategic initiatives, auctions, international supply growth are all pointed at conversion. I would say, to add to that, there was another kind of interesting dynamic that we saw for the first time in a couple of quarters, this past one, which was -- which had to do with the relationship between AOV and order volume. So, what we had seen for the seven quarters leading up to the third quarter was increases in the year-over-year growth rate of AOV. For each month, since July through October, we've seen declines in AOV, pretty significant declines. And for example, the kind of product range that we've seen the highest growth in orders has been the sub-$1,000 price range. Conversely -- and probably not unrelated, beginning at the same time, we've seen sequential improvements each month in year-over-year order growth. To the extent that in October, order growth was actually positive on a year-over-year basis. So, again, those two things are likely related, but it's encouraging to us because that order -- the sort of resilience of the order number suggests that, again, this platform retains its relevance might even possibly be growing share in the face of a weak overall e-comm market and ultimately expands our TAM. In September, as an example, we had our all-time record high month in terms of the number of orders over $100,000. Your line is open. Jewelry, just as a reminder for those who may not be aware, Jewelry is our second largest vertical and did have a strong quarter. In fact, jewelry has grown GMV on a year-over-year basis every quarter since the third quarter of 2018. And I think it's just sort of in terms of the fundamentals, it's well suited to what we do. Shipping costs are low, returns are fairly straightforward, and it benefits from the consumer trust, which we think is one of our strongest competitive advantages. So, I don't know if I'm really in a position to kind of attribute that strength to any very specific kind of temporal factor, I think instead, it's likely more a function of just the sort of macro industry factors that I mentioned before. So, in the fourth quarter, what we're going to see is the savings were -- sorry, in the fourth quarter, we're going to see muted seasonality savings that we're going to see. But some of that will -- that savings will be offset by some seasonal expenses that we have in kind of long lead-time marketing projects, such as like our holiday catalog. And as well, we're expecting to see some seasonally higher logistics costs. Your line is open. First, as we try to think about conversion stability, it sounds like traffic is growing nicely, kind of overall conversion is down. I mean, we have seen some encouraging trends in conversion recently. But I mean, you make a good point, which is if we can -- the goal is to continue growing traffic at the same rate and stabilize conversion. And if we do that, that will result in healthy order trends, which, again, as I mentioned before, is what we've seen over the last couple of months and which culminated in positive order growth in October. So, I think it's a little early for us to call with any degree of confidence when that inflection point is. And does that kind of impact kind of users able to find what they're looking for, like if they come on for something they find out Google and then they need to get somewhere else or some they realize they want something else. The -- certainly, the more items we have on the marketplace, the higher the burden there is on us to improve ways to find relevant inventory for a given user. That said, we are a marketplace of long tail one-of-a-kind items. So, for example, one of the phenomena that I described earlier that's contributing to our decline in new buyer conversion rates is the increasing proportion of traffic that we're getting from Google via SEO. So, a big part of the motivation in adding supply and as well as other product changes that we're making, including adding recommendations and so on, on those pages is to increase the number of items on those pages and in that way, decrease the conversion rate. So, it's somewhat counterintuitive, but I think the headline is in a marketplace of kind of long tail, hard-to-find items, increasing supply actually, we believe, can help conversion. Your line is open. And then second, last quarter, you kind of noted a number of headwinds to the business. I think you had economic uncertainty, consumers spending less or more -- sorry, an out-of-home experiences, lower overall furniture spend as well as kind of traffic mix shift to mobile. As we announced last quarter, we did retain Allen & Company as our advisors, and we are working with them to explore the full range of ways to enhance shareholder value. Those alternatives, of course, will -- could include everything from a kind of sell-side transaction to buy-side transactions to kind of a redeployment of cash. So, that's kind of the summary on the strategic review process. In terms of changes to the underlying drivers, I think probably the biggest one is on the negative side, as I mentioned, AOV with the exception of jewelry is -- started to decline beginning in July in each of our verticals. On the positive side, order growth, as I mentioned before, the kind of year-over-year change in order growth has started to increase beginning in July, got better every month culminating in the best month it's had in a while in October. And I'd say the other thing is the other data point that I mentioned, which is new buyer conversion rates. And then, of course, lastly, new buyer -- I mean, sorry, returning buyer conversion rates and trade buyer conversion rates remain constant and we're actually marginally positive in the quarter."
}