{
    "symbol": "BALY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 15:42:06",
    "content": " After the speakers ' presentation, there will be a question-and-answer period. I'd now like to turn the call over to Bobby Lavan, Chief Financial Officer for Ballyâ\u0080\u0099s. Good morning, everyone and thank you for joining us on today's call. With me on today's call are Lee Fenton, Chief Executive Officer; George Papanier, President, Retail; and Robeson Reeves, President, Interactive. Before we begin, we would like to remind everyone that comments made by management today will contain forward-looking statements. These forward-looking statements; include plans, expectations, estimates and projections that involve significant risks and uncertainties. In addition, during today's call, management will refer to certain non-GAAP financial measures. Today's call is also being broadcast live on our Investor site, and will be available for replay shortly after the completion of this call. We are one year on from bringing Gamesys into the Bally family, and the industrial logic remains as strong as ever. The Casinos and Resorts segment is going from strength to strength, as the portfolio of properties goes into the next phase of integration. The Interactive business have a tough COVID-driven comps to overcome, and has been impacted with negative FX swings through â\u0080\u009922. As promised, we continue to deliver strong free cash flow from what is now a globally and channel-diversified business. The optimal integration of our combined assets remains unfulfilled for now as we still have work in progress, but we have made significant strides towards fulfilling that vision. The awareness of the Bally brand continues to grow, and employees from table dealers to tech developers, identify as Bally team members. Integration beyond the brand on the casinos and resort side has begun, and we're starting to see the fruits of that labor. Ballyâ\u0080\u0099s Chicago is a gamechanger for the group, and the early performance at Tropicana Las Vegas has been encouraging, and we're delighted to finally have a presence on the strip. New Jersey iGaming climbed to a 3.5% market share in the quarter, with CPA significantly below our peers, as we broaden the options available to our bricks and mortar database. For the third quarter, we had tremendous results in Casinos and Resorts. Lincoln outperformed, finishing just shy of double-digit revenue growth, coupled with a continued focus on margin and initial growth of the IGT JV. That JV goes from 23% to 40% on January 1, and will drive incremental earnings into 2023. Atlantic City had $9.5 million positive EBITDA, to bring the year-to-date result to positive $1 million. We've seen further growth in the higher tiers of our database across the portfolio, helped by a more aggressive push on tables in our more recently acquired properties. Our EBITDA margin, ex AC, was ahead of expectations at 39.5%. With a more integrated portfolio, we are now benefiting from cross-marketing, cost efficiencies from purchasing power, and increased centralization, proving out our strategy to bring the properties together. In International Interactive, the UK was slightly up year-over-year on a constant currency basis, delivering a record number for our UK business, and the first positive quarter Since Q3 â\u0080\u009921. We expect that Q4 will also be positive, in the range of high single digits. Performance was driven by more targeted marketing spend, more dynamic jackpot strategies, and enhanced customer journeys powered by machine learning. And while ongoing delay brings some unwelcome uncertainty for the industry, it has given us ample time to prepare our business for a range of potential outcomes should the white paper be forthcoming in the near future. Asia continued some of the weakness we saw in the second quarter, being down 3.3% year-over-year on a constant currency basis. And the sportsbook there has launched in time for the World Cup, and the customer funnel is supported by free-to-play games from our SportCaller team. New Jersey and $12 million of GGR and $8.3 million of NGR from our iGaming offer in Q3, showing discipline in bonusing, and giving us a contribution margin in the mid-30s. We are targeting six to eight points of market share in 2023 after the implementation of omnichannel rewards, along with improvements in payment processing and marketing tools. Our Bally branded app in New Jersey continues to deliver a very attractive cost of acquisition for depositing players, even before the marketing tech stack improvements that will be coming in 2023. Different States will have different characteristics, and our focus is on creating the blueprint for States of a similar type before we invest in rollout. As I said, iGaming States are our priority, and we will focus resources in markets, including Pennsylvania, Ontario, as well as States that we believe will regulate our gaming in 2023. Our progress on sports has taken longer than we expected, and we will not support the sports-only markets with marketing dollars until we are comfortable that we've got the user experience and the technology where we want it. Yesterday, in Ontario, we launched our first combined casino and sportsbook app. We will continue to focus on being iGaming-led in Ontario, which we expect to become one of the most significant markets of scale in the North American footprint. Our focus remains on the continued development of our product and the market blueprint, rather than being overly aggressive on rollout. Now, let me turn it over to Bobby to give you the financial highlights for the quarter. Excluding Atlantic City, EBITDA margin was 39.5%, in line with our targets of high 30s. Adjusted EBITDA for the quarter excludes $3 million of rent to GLPI, associated with the purchase of Tropicana Las Vegas, which we closed on September 26. With the closing of Tropicana, we'll begin reporting $5.6 million per quarter of rent as part of the operating rent going forward. The UK was plus 0.1% year-over-year, and Asia was minus 3% on a constant currency basis. As we discussed, marketing was reduced in UK by 30%, as we focus on profitability and highly efficient spend. In the quarter, there was approximately $7 million of EBITDA drag from non-core assets, which we are taking a hard look at. This is a $4 million drag to 1Q plus 2Q, and a $6 million drag to 3Q plus 4Q versus budget and previous forecast. The cash outflows were budgeted to the balance sheets, and we are just adjusting the timing of taking these expenses. We have updated our 2022 financial forecasts to reflect the adverse FX headwinds, reset Atlantic City, and actual results for the first nine months of the year. At current FX rates, we expect revenues to be $2.25 billion, and adjusted EBITDA to be $540 million, which includes $75 million of North America Interactive EBITDA losses. We continue to focus on profitability and cutting costs, but some of those cost cuts will only occur with two months left in the year. Pro forma for the tender common shares outstanding at the end of the quarter were $47 million, and we have incremental warrants, options, and other dilution of $13 million shares. So, $60 million shares outstanding is the right way to look at our shares outstanding. We have ample liquidity to fund all of our announced projects, and continue to invest with care in North America Interactive. Our long-term commitment is to be sub 5x debt to EBITDA, which we expect to hit in mid-24, and we expect the Biloxi Tiverton transaction with GLPI to close in January of â\u0080\u009923. With that, Operator, let's open up to Q&A. So, Casinos and Resorts is a continuation of the trend that we've seen in Q3. Well, listen, as you know, we pulled together a fairly large number of assets in a pretty short spaced time, and we've now had 12 months of looking at that and knitting that picture together. The assets that are not showing us a near-term path to profitability will be of course under the microscope, as they should be. So, we're evaluating how that all knits together and we'll make the decisions quickly in terms of what doesn't work now that we have our stack pulled together. But the - we have a new minister, Paul Scully, who's the minister for the gambling white paper, also the Minister for Tech. They have a big at DCMS, but I think the first impression is a positive, pro-business guy, and nothing to concern us. Expectations in terms of where it sits in the packing order, it is difficult to call. You may have seen that the new Prime Minister has said that he's there to deliver the manifesto promises that were given before by the Boris Johnson elected government, and that included the gambling reviews. So, we expect them to push on, but we don't necessarily expect it to be the top of the priority list. I mean, we have - right now, the focus is Chicago, but long-term, we think that acquisitions in the casino space will continue, and we think that there's opportunities outside the US from a profitable perspective on the Interactive side. But as we continue expanding, we'll look to a potential sale leaseback on Lincoln, but thatâ\u0080\u0099s a few years down the roads. Starting on the brick-and-mortar segment, really nice performance on the margin side. Looks like up, call it 300 bps quarter-on-quarter. Bobby, I was just hoping you could sort of break down the sequential drivers there a bit more. I mean, the biggest step-up is Atlantic City has really turned around. So, that's exciting for us. We implemented some cost restructuring in August that's flowing through, but also the property just really outperformed. The other margin step-up is, as the IGT JV continues to roll in, thatâ\u0080\u0099s ultimately a significant margin driver for us because the EBITDA comes in without revenues. Ultimately, this is the first quarter where we have a full year. You remember we closed Evansville, Quad, and Montbleu in the second quarter of â\u0080\u009921. We've started centralizing a bunch of the different back-office functions, and we're really focused on just the portfolio as a whole. Yes Bobby, you've stated it pretty accurately. In addition to that, we've been able to maintain the labor reductions, primarily through FTEs. I think weâ\u0080\u0099re arranging around a 25% reduction since 2019, and thatâ\u0080\u0099s pretty sticky. So, we've been able to maintain that other than the site offsets from increases in wages. I know we've talked about some impact as consumers play in USD, but live in yen. Yes, I think it's largely macro factors which are driving that Asian region. We've operated in Asia for many years, and you see different slowdowns from time to time, whether it's macro, whether it's sometimes sentiment from gaming gets the occasional dip, but then that makes your marking more challenging. But somewhat the nature of the beast in pretty regulated markets, and more confident that the region will be in growth. I just want to go back to - thank you for taking my question, and I'd like to go back to the margin question. 39.5, excluding Atlantic City, is pretty good, but as we look forward, are there more levers to pull, or is there any more room for margin improvement at this point? The biggest one is the IGT JV, which is $15 million plus of EBITDA, will have no revenues next year. So, it's a 60/40 JV with IGT. So, weâ\u0080\u0099re going to see a good step-up. On the cost side, we are very focused on centralization, and we've started trying to bring our teams together, whether it's procurement, finance, HR, and so we can really support the casinos more aggressively. I would also say, Atlantic City is zero EBITDA on $150 plus million of revenues. So, as that continues to have more profitability, we're very excited about what it does to our margins. You said you will refocus your efforts in North America Interactive, especially on the sports side. So, continues to form part of our plan, and we think we get tremendous best-of-branding benefit from it. The reality is, I said earlier, we haven't gone as quick as we would've liked on our own sports product, and we need to have that in a position that we're excited about to really take full advantage. No, I think that thatâ\u0080\u0099s still very much on the cards for us. I mean, obviously, they've got you make some decisions and some choices. I mean, our focus right now is laser focused on the property side, on the development of the temp in Chicago, but we're very much looking at the long-term plan for the Tropicana property, and that includes whether or not we could put a diamond in the middle. So, yes, but we would be very keen to see iGaming in Rhode Island, as we would in any other State. But of course, Rhode Island is very close and where we're headquartered. So, we'd love to see iGaming rolled out there, and we think there is positive sentiment towards that happening. Hey, good morning, everyone, and thanks for taking my questions. So, Bobby on North America Interactive, you guys are forecasting now a $75 million loss in 2022. But it sounds like at the same time you guys are kind of pivoting more, at least publicly, to focus more on iGaming and sports. As we called out, there's about $7 million in the third quarter of losses that we view as non-core slash we need a plan to make them at least flat to positive. Very excited about early results in Ontario, a lot of iCasino in Pennsylvania next year, and we'll be minimizing the losses related to sports betting. And in the end, that's what North America Interactive should be. And so, the trajectory is positive, and we're feeling very confident about that. We just need to really look inside at that $7 million of losses and have a pass because just burning money for moneyâ\u0080\u0099s sake, that was where the market was a few years ago, is not where we're going in the future. Hey, guys, thank you so much for taking the question. I was wondering if you could provide the regulatory EBITDA for leverage calculation purposes, and the leverage compared to the one that you report to Rhode Island. Sorry, the - I'm sorry, the EBITDA is 650. In terms of when you think about your project next year and the current state of the capital market, is there a way in which you guys could rethink about the $1.1 billion loan with any other funding sources that you guys think that maybe you would be required to put in more equity into the project? If you could comment on how much more equity would you guys be willing to put in just to kind of lower the rate or make the transaction a little bit more feasible, given the current set of capital markets, that would be very helpful. I have $1 billion of liquidity when we close the Biloxi Tiverton transaction, which should be very beginning of January. So, if the capital markets don't clear up, right, then I can put more capital in, and at some point, I'll be able to get a construction loan. Obviously, I want that because we want to maintain as much liquidity at the parent for flexibility for M&A and other strategic options. Weâ\u0080\u0099re close and focused on a land sale leaseback in Chicago, because we think that's a core part of the capital structure, which we talked about before. But really, we are not dependent on the capital markets as it relates to Chicago until â\u0080\u009924, â\u0080\u009825. Again, we have $1 billion of liquidity after those share repurchases. We are - as I've expressed to the investing community, we are preparing for it in â\u0080\u009823 from a cost-cut perspective. And ultimately - but if the macro changes hard, the priority is funding Chicago. We remain interested in many opportunities, and New York's one of them. And then back on the International Interactive, squarely focusing on the UK, clearly, we've been watching that market, and there's been reports of just higher inflation and maybe a weakening consumer. When you guys talked about clearly tells a slightly different story, but can you just kind of give us any trends in terms of if you saw any differences throughout the quarter, if it got better, if it was stable. I mean, it sounds like this is something you're pretty comfortable with given your history in the market and visibility, but just wanted a little bit more color there. So, Chad, I think that we're well steeped in the UK market and have a very long-term customer base here. And so, I guess the term I would use is ultra-optimization in terms of everything that we're doing in the UK. Maybe, Robeson, you can give a little more color in terms of what you've seen. So, as Bobby said, we've cut marketing - acquisition marketing by 30%. We've made significant other optimizations, which have essentially driven more winning experiences for all of our players across the player base, which has driven up active days, driven up ARPUs in a sustainable way, and driven up retention, which gives me a lot of comfort that we have growth in Q4. That will be positive, and I expect to see continuing great margins there. And actually, ARPUs in Q3 â\u0080\u009822 only very slightly ahead of ARPUs in Q3 â\u0080\u009821. Ladies and gentlemen, this concludes today's conference."
}