{
    "symbol": "WTRH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 20:06:08",
    "content": " I would like to welcome all of you to the Waitr Holdings, Inc. First Quarter 2022 Conference Call. With us today are Waitr's Chief Executive Officer; Carl Grimstad; and Chief Financial Officer, Leo Bogdanov. By now, you should have access to the company's earnings press release. Before I turn the call over to management, I would like to remind you that certain statements and projections in this call about future business and financial results constitute forward-looking statements. These statements are based on management's current business and market expectations, and actual results could differ materially from those projected in the forward-looking statements. Finally, please note that on today's call, management may refer to non-GAAP financial measures. I would now like to turn the conference call over to Waitr's CEO, Carl Grimstad, who will give an overview of the company's business activities and developments for the first quarter of 2022. He will then turn the call over to Leo Bogdanov, who will provide an overview of the company's operating and financial results. Hello, everyone, and welcome to the first quarter 2022 earnings call. In the first quarter, we focused on the continued build-out and optimization of several key integrations with third-party aggregators such as Google food ordering and Olo dispatch. We anticipate these integrations will be finalized in the second and third quarters of 2022 and provide access to over 2,000 serviceable QSR locations. These partnerships, along with our existing integrations with point-of-sale systems such as It's CheckMate. Charlie, Olo Rails, Ordermark and Otter have provided access to thousands of new restaurants to the platforms and should bring increased visibility, increased diner access and increased order flow. As such, we continue to expand our deliver anything initiative with the progression of instituting direct connections with several online ordering platforms to facilitate last-mile delivery services. As consumer demand drives the necessity for faster delivery of a broader range of products, this will expand the total addressable market and open the door for increased revenue potential through various channels. We have successfully implemented this technology into our existing application, and this has already resulted in streamlined in-stadium dining experiences in several stadiums across the South, including the University of Alabama, LSU, and the New Orleans Saints home of the Super Dome. We now provide payment processing services for over 2,300 merchants, and we expect this to continue to grow on a monthly basis. During the first quarter of 2022, we hired 2 industry veterans in the company's first-ever Chief Information Officer and Chief Technology Officer positions. We continue to experience adverse effects of the current macroeconomic environment, particularly within our core Southern markets, most notably due to rising gas prices and inflationary pressures. With that, I'd like to turn the call over to Leo, our Chief Financial Officer. Cash on hand totaled $54.9 million as of March 31, 2022. Total outstanding long-term debt as of March 31, 2022, was $84.5 million, consistent primarily of our $35 million term loans and $49.5 million of convertible notes. As of May 9, 2022, we have amended the terms of our debt agreement and have agreed with our lender to pay down a portion of our outstanding debt balance by $20 million to approximately $65 million as well as extending the maturity of both debt instruments to May 15, 2024. It's just, generally speaking, food costs have just continued to rise. And we've traditionally been an independent restaurant-focused business, and it's hard to argue with the fact that it's more expensive at an independent restaurant than QSR. So I think that between the ordering platforms and the direct integrations with a lot of the POS companies that are embedded in these QSR organizations, we should start to really see some results or at least balancing in the third quarter. The problem is it's still -- even at the $2.5 million on a $10 million run rate, it's still small to the overall revenue base of the business. The volatility has been crazy, but now that you have kind of a clear baseline, I assume there's ways to kind of rightsize operations to fit the trajectory here. And given how friendly your lender has been, I would assume that that's probably overall not really a major issue at this point unless things drastically change between now and, say, the next 24 months. And at the end of the day, the focus has always had to be controlling and strengthening that balance sheet because that's the only thing that can kill us. It might not be as exciting about talking about some of these other things, but we inherited that balance sheet, and we're quite proud of the fact that we've reduced it by 50% because that is the one thing that you can't lose track of. For whatever it's worth, Carl, you actually came in slightly ahead of what I thought you'd do in Q1, so actually pretty good results, I think, in this environment. Ladies and gentlemen, with that, we'll conclude today's question-and-answer session. We continue to -- as we've put forth in the earnings release, there's a lot of projects that we've been working on that will pay dividends in the future. It's just not necessarily dividends, but it should lead to higher revenue and profitability in the future. Ladies and gentlemen, with that, we'll conclude today's conference call and presentation."
}