{
    "symbol": "MNTS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 00:16:08",
    "content": " Highlights included, retiring regulatory issues that we previously experienced and obtaining US government licenses, completing assembly and ground testing of the Vigoride 3 orbital transfer vehicles, conducting the first launch of the Vigoride orbital transfer vehicle, deploying two customer satellites from Vigoride 3 during the second quarter and four more in the third quarter for a total of six customer satellites deployed from Vigoride 3 so far. And finally making solid progress on the preparation, assembly and testing of our next Vigoride orbital transfer vehicle that we plan to launch on the SpaceX Transporter-6 mission targeted for November of 2022. Momentus has made substantial progress on technology development during the second quarter, achieving some major milestones, such as conducting our first launch of our Vigoride orbital transfer vehicle, we completed remaining ground testing on our first spacecraft Vigoride 3, we then integrated customer payloads and shift the spacecraft to the launch site at Cape Canaveral, Florida. While the primary objective of our first demonstration mission was to learn as much as possible, we also carried nine satellites onboard Vigoride 3 and another payload for testing in space for a total of three customers. As I said on our last earnings call, this third-party deployer system cannot provide last mile transportation service to precise customer like Vigoride designed to do, however it meets the needs of some of our customers and potential customers, particularly those who don't need to get to a precise orbit and have less complex requirements and are looking for a lower cost way to reach low earth orbit. We continue to believe it is important for us to eventually develop a reusable Vigoride vehicle as this has the potential to reduce our two largest cost items, manufacturing costs and launch costs, while also allowing us to add new revenue streams, such as in-orbit refueling, maintenance and deorbiting. And two, the performance specifications that we have in mind, we are implementing some enhanced ground testing on the Vigoride vehicle and its components to provide some even additional testing beyond the rigorous testing we did for Vigoride 3 to incorporate the lessons learned and to make sure that the corrective actions we've implemented to address the anomalies we experienced at Vigoride 3 are accomplished. We continue to believe it's important on the issue of the Vigoride vehicle, we do continue to believe it's important to develop a reusable version of the Vigoride as this has the potential to reduce our two largest cost items as I mentioned, the manufacturing cost and the launch cost, because you're reusing the vehicle several times. Through close collaboration though with the solar panel provider analysis and additional verification ground testing, we believe we've identified the root cause of the issues we experienced with those deployable solar arrays during the Vigoride 3 mission and we've replicated those issues during ground tests."
}