{
    "symbol": "HIL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 13:05:35",
    "content": " Consulting fee revenue rose 12.5% to $81.4 million from $72.4 million in the prior year period, and was our first $80 million quarter since the first quarter of 2018. Operating profit improved to $1 million from an operating loss of $154,000 in the first quarter of last year. Our net loss narrowed significantly from the prior year's quarter, and adjusted EBITDA rose to $3.2 million from $741,000 in the same period last year. Our backlog increased for the second consecutive quarter to $736 million, its highest level in over 2 years. Revenue increased 17.4% in the quarter, coming in at $102.2 million compared to $87.1 million in last year's first quarter. CFR for the quarter increased 12.5% to $81.4 million from $72.4 million in the first quarter of '21, reflecting an increase in project activity to pre-COVID levels. SG&A Included nonrecurring and noncash income of $0.1 million and expenses of $0.4 million in the '22 and '21 first quarters, respectively. Excluding these nonrecurring and noncash expenses, expenses were $29.6 million in the first quarter or 91.3% of gross profit, which compares to $27.3 million or 100% of gross profit in last year's first quarter. As Raouf mentioned, we have reduced the run rate of G&A expenses by approximately $4 million annually, the initial impact of which is expected to be realized in the current second quarter ending June 30, '22. Operating income improved to $1 million from an operating loss of $154,000 in the first quarter of '21, driven by higher CFR and improved gross profit, offset by an increase in foreign currency exchange losses and higher SG&A to support our growth initiatives. On an adjusted basis, Adjusting operating profit improved to $2.4 million from adjusted operating profit of $161,000 last year. Net loss for the quarter narrowed to $544,000 or $0.01 per share compared to a net loss of $2.7 million or $0.05 per share in the year ago period. Adjusted net income improved to $864,000 from adjusted net loss of $2.4 million from last year's first quarter. Adjusted EBITDA for the '22 first quarter improved to $3.2 million, up from $741,000 in last year's first quarter. As Raouf noted, our total backlog growth for the consecutive quarter, improving to $736.1 million from $729.4 million at December 31, '21, reflecting our positive book-to-burn during the quarter. The low end of the guidance, if you take off or remove the first quarter CFR, that leaves about $86 million per quarter of CFR to achieve the low end, where it's closer to $90 million per quarter to achieve the high end for the remaining 3 quarters."
}