{
    "symbol": "TNP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-22 16:06:03",
    "content": "  Operator: Thank you for standing by, ladies and gentlemen and welcome to the Tsakos Energy Navigation Conference Call on the Third Quarter 2022 Financial Results. We have with us Mr. Takis Arapoglou, Chairman of the Board; Mr. Nikolas Tsakos, President and CEO; Mr. Paul Durham, Chief Financial Officer; and Mr. George Saroglou, Chief Operating Officer of the company. Please go ahead, sir. This morning, the company publicly released its financial results for the third quarter and 9 months ended September 30, 2022. In case you do not have a copy of todayâ\u0080\u0099s earnings release, please call us at 212-661-7566 or email us at ten@capitallink.com and we will have a copy for you e-mailed right away. Please note that parallel to todayâ\u0080\u0099s conference call, there is also a live audio and slide webcast, which can be accessed on the companyâ\u0080\u0099s website on the front page at www.tenn.gr. Also, please note that the slides of the webcast presentation are user controlled and that means that by clicking on the proper button you can move to the next or to the previous slide on your own. This year the company is celebrating its 20th anniversary of listening on the New York Stock Exchange, and on December 9, we look forward to having with us in New York the management of TEN and Dr. Tsakos of joining the Capital Link Invest in Greece Forum on December 9 in New York. Please go ahead, sir. Real congratulations to management for historical second best quarterly performance, just below the highest ever in Q4 â\u0080\u009807 of $52 million. It proves once again the strategy â\u0080\u0093 TEN strategy model, protects us in bad times, fully response in good times and allows us to serve our obligations to pay dividends and generate cash for new business. And in particular, Iâ\u0080\u0099d like to congratulate management for the successful new business with another blue chip customer, Total, on the first deal ever on very successful business. Thank you for being here and supporting and following TENâ\u0080\u0099s 20-year performance on the New York Stock Exchange and at 30 years, next year, which is going to be our 30th year anniversary since the company was established on the Oslo Stock Exchange. So â\u0080\u0093 and hopefully, our share price will be above $30, we are hoping to be well above $20 in the remaining of the year. So, we worked on $10 or $20 in the next year, itâ\u0080\u0099s going to be $10 or $30 at least, but thank you for bringing us where we are. As the Chairman said, this really was our best quarter in the last 15 years. Paul is working on it already and our chartering team at the same time in the fourth quarter of this year things look to be even stronger or rosier and this is a time that the TEN model proves it works, because we can work at difficult times, but also much better times. We have, as George Saroglou is going to point out, we have, this is our fifth crisis that we are coming out from, for the tanker market based on geopolitical events and market-related events and economic events and our aim is always to have a sustainable growth. Now, we are enjoying 6-figure returns or revenue time charter revenues in a majority of our Aframax, Suezmax, and VLCC fleet which hopefully will be portrayed on the fourth and the first quarter. And what gives me comfort is right now, we are in a situation where very little new building supply is coming in and so this good market perhaps not at these high levels as always, but it will be sustainable for at least the next 3 years. In TEN, we use the low markets to be able to purchase new modern assets as we have done and then charter them out when the times are better for long-term to be able to cover the cyclical markets that we might â\u0080\u0093 the cycle that the market might bring. And with this, I would like to ask George Saroglou not to take too much of his time to give us a little description of the last 9 months and focus on the subsequent events, which we will talk also after the â\u0080\u0093 during the question time. Starting with Slide 3, we see that since TENâ\u0080\u0099s inception in 1993, we have faced five major crisis and each time, the company has come out stronger, thanks to its operating model. The market fundamentals, record low order book, and an aging fleet, even without the tragic war were positive for the tanker industry. However, it is expected to sustain the lengthening of voyage distances which coupled with normal winter factors like weather delays and an increase in oil demand due to gas-to-oil switching as a result of higher natural gas prices in Europe is expected to keep the freight rates in the tanker market serve through this winter and the months ahead. With record low order book and the redesign of the global energy map for both crude and oil product trades, we expect the tanker industry to go through a sustained strong markets in the years to come. 40 out of the 66 vessels or 61% of the fleet in the water has market exposure, a combination of spot contract of affreightment and time charters with profit sharing. Year to date, we sold 2 vessels, 2003 built Panamax tanker and the 2006 built of our 2 Aframax tanker, and took delivery of 3 modern vessels. Two new buildings in January, we took delivery of LNG carrier TEN Energy and in July of the shuttle tanker quarter. In fact, today we announced the start of the three-year time charter with profit sharing for DS1 to a significant oil major. On the newbuilding front, we announced today a project with a major energy concern to build and Time Charter up to 3 shuttle tankers against minimum 5-year up to 15-year contracts. This is in addition to a note that we have in place for 4 newbuilding Aframax tankers, which we expect to start taking delivery from the fourth quarter of â\u0080\u009823. As you see, we have a blue chip customer base, consisting of all major global energy companies, refineries, commodity traders with Equinor currently topping the list as our largest charter with 9 vessels and 4 new buildings all on long-term time charters. We try to have our Time Charter vessels generate revenues that cover the companyâ\u0080\u0099s cost expenses, which means paying for the vessel operating expenses, finance expenses, overheads, chartering costs, and commissions and we will add the revenue from the spot trading fleet contribute to the profitability of the company. Despite the prevailing inflationary pressures, we want to highlight the purchasing power of our technical managers and the continuous cost control efforts by management to maintain a low OpEx average for the fleet, while at the same time keeping a high fleet utilization and quarter-after-quarter, year after year. Despite 14 special surveys, some are ahead of schedule in preparation of the anticipation and the anticipated market upturn we achieved an OpEx overall utilization of 93.7% for the fleet. And thanks to the profit sharing element, for every $1,000 increase in spot rates, we have a positive $0.29 impact in annual EPS based on the number of vessels we currently operate in the spot market. In addition to paying down debt, in Slide 8, we see that dividend continuity is important for common shareholders and management. For the year, oil demand is expected to grow by 2.1 million barrels per day. Next year, we expect growth to be 1.6 million barrels per day. On the supply side, we have the recent OPEC+ cuts, the sanctions and self-sanctions on Russian crudes and that will play out in 2023, and further releases currently from the OECD strategic petroleum reserves. The order book starts â\u0080\u0093 stands at a little over 4% over the next 3 years, which is the lowest that it has been in more than 30 years. At the same time, a big part of the fleet is 32% is over 15 years and we have 8.3% that is currently over 20 years. And with that, I will ask Paul to walk you through the financial highlights for the third quarter and the 9 months of the year. In this quarter our vessels reaped an extra $92 million revenue over the prior quarter three, resulting in a total revenue of $224 million, a 70% increase, mostly from spot earnings of $103 million as rates surged. In addition, our time charter vessels in quarter three, including $14 million profit share generated over $120 million covering most of our operational expenses. While in the 9-month period, EBITDA totaled $236 million. From the start of this year to the end of September, TENâ\u0080\u0099s revenue reached $590 million, while net income in the 9 months amounted to over $130 million with profit share of nearly $21 million. We anticipate these reserves will provide us new opportunities, such as those created by the company over the past months, such as, in particular, the new LNG carrier, the shuttle tanker, and more recently the new VLCC. So I think what we have accomplished is a bigger fleet, a much more modern fleet with much less obligations and weâ\u0080\u0099ve been doing this through thick and thins through the good times, the bad times, perhaps weâ\u0080\u0099re one of the few companies out there that we have never delayed or renegotiated any of our banking relationships. Instead, and this is why we have always been offered very good terms, very competitive terms in growing the business at difficult times. I mean, the picture that Paul and George are showing to us is a picture of a strong market, a sustainable market going forward. This is what we want to do, but we always protect the companyâ\u0080\u0099s downside as we have done in the past and we may need to further decrease our debt and increase our dividends to the shareholders. I mean our spot from Axis many of them are above the $100,000 a day level together with our Suezmaxes which is significantly higher, weâ\u0080\u0099re in the third quarter was, and for sure the first 9 months. And again itâ\u0080\u0099s not growth for growth, itâ\u0080\u0099s growth for accretive transactions that will get our earnings that there are above the $3, $4 level per share, I mean. So protection of a strong balance sheet, which if you go back over the years, we always maintain a strong liquidity because the only time you actually appreciate your strong liquidity is required you do not have it and TEN has never been in this situation in 30 years, and increase in dividends. And as I said, I mean if you look on Slide 7, that was put up there in the presentation, we have done a dramatic deleveraging considering that in 2016 the company was â\u0080\u0093 did not have the quality of the fleet that we have today, or the valuation of the fleet and we are determined to do this. And according to Paul, I think, by 2024 we will be a significantly under the $1 billion in debt. Again, as I said, we are looking and I think this is the first time we feel significantly strong about that weâ\u0080\u0099re looking at a sustainable positive future for the tanker and energy industries. We hope that our next â\u0080\u0093 our next announcement, which would be in the first quarter coming up for the fourth quarter and first full year results we will have even better news and better prospects."
}