{
    "symbol": "PRPH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-28 15:35:04",
    "content": " Tell me another company that raised â\u0080\u0093 and we raised $37.5 million in January 2 years ago and now we have over $40 million in net working capital and thatâ\u0080\u0099s after spending tens of millions of dollars in stock buybacks, tens of millions of dollars between stock buybacks, dividends and acquiring several companies that we are now going to build out that hopefully my goal is it turns us into a multibillion dollar company. With that CPT code, we believe we would be reimbursed $1,000 to $2,000 per test and our initial target is 2 million people who have Barrettâ\u0080\u0099s esophagus who get endoscopies once per year. We are working with key opinion leaders, major cancer institutions who are all getting more and more involved in this, and this is going to, I believe, look more and more like a reality as the year goes on and look at our market cap, just how much of that is reflected in our market cap right now given the potential and given how real this is and given the time frame for commercialization. What makes it complicated is that weâ\u0080\u0099re writing this off at year-end and even though itâ\u0080\u0099s related to testing activity in the first half of the year when, frankly, if we did $5.9 million less revenues in the first half of the year, it wouldnâ\u0080\u0099t have been â\u0080\u0093 it would have been negligible. From an insurance companyâ\u0080\u0099s point of view, we believe they are going to be motivated because people right now that are diagnosed with Barrettâ\u0080\u0099s esophagus are getting endoscopies every year, which cost the insurance company $2,000, $3,000, $4,000. Itâ\u0080\u0099s like if you found a leading Internet company 20 years ago, you didnâ\u0080\u0099t know what in advance and you just wrote it for a few years, itâ\u0080\u0099s amazing how much money we are going to pay. So, it is possible down the road that I could IPO Nebula, I would rather do that and sell it if I think itâ\u0080\u0099s going to be worth so much more in 1 year, 2 years and 3 years, I wouldnâ\u0080\u0099t want to sell it because the company does need the money right now, all of our shareholders for the most are long-term shareholders."
}