{
    "symbol": "PRPH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 21:02:04",
    "content": " Before we begin today's call, I want to advise everyone that today's call will contain forward-looking statements, including statements relating to our plan expectations, future performance and future events, including statements regarding projected financial results for the third quarter of 2022, our expectations regarding the COVID-19 pandemic, future waves of the pandemic and continued demand for diagnostic testing, purse of funding; our plans to grow our diagnostic business, and expand our lab services, and our plans to grow our genomics businesses, our plans to develop and live  and Equinor and our expectation regarding efficiency of our cash and working capital. Please somebody on this call, find me one company out of the 10,000 Nasdaq companies in the universe, you know, they're not on micro cap, find any, any micro cap company that can claim to have done all the things that we continue to accomplish, because I can't find one, that can grow, that can make smart new acquisition so that we have the future while at the same time earning money in the present. You know, Monica helped take our company from a $10 million company to $100 million company to $200 million company now we want to take it to a billion a multi billion dollar company, and I believe  So that's just - and that's just touching the surface on our team and we really have a fantastic team here. So I've been pointing out to everybody who's been so bearish the last few months, I've been pointing out that because we've been in a bear market for a year and a half the light side companies don't be so sure that they're going to continue to drop. There's going to be an enormous amount of school testing, but that school testing will start you know, maybe the very last week of August, you know, into September, when we're getting into, you know, the fourth, you know, as we go into the fourth quarter. The complicated part is the logistics on where we're doing the whole genome sequencing and what price we're doing in that we are negotiating, I think I've mentioned - I know I've mentioned before, we're negotiating with a company in the in the UAE and this multibillion dollar company, and they love us, they don't have a presence in the United States and they want to work with us and so you'll hear or more about that in the coming months, there's not a doubt in my mind about that. But you know, you're saying that our stock is, you know, severely undervalued, I can simply point out that even though it's severely undervalued, at today's prices, it's dramatically outperformed, you know, virtually every biotech and life science company over the last year. Plus, given that we've been in a significant bear market, it appears we're just coming out of that now, it doesn't mean we're not going to back and Phil, but it's not just that the biotech and life science companies have trended higher over the last six, eight weeks, it's the fact that deals are starting to happen and big deals are starting to happen. And, you know, we're generating enormous capital, and I've always operated the company from the point of view, we're going to build value on a per share basis, the stock price will take care of itself as long as we continue to build value. I can't tell you on a month to month basis, What's going to happen, but I can tell you that, you know, over the next year and a half between the potential nebula and the potential of ProPhase Biopharma while diversifying our diagnostics business, there's still significant upside from where we are now. And in the meantime the risk frankly is pretty minimal given that our four operating businesses, as a whole are growing year-over-year and very profitable and our PIP1  our biopharma division has probably more upside then anything else weâ\u0080\u0099re working on and the amount of capital in my mind is virtually around you know, what weâ\u0080\u0099re going to spend to develop it."
}