{
    "symbol": "CBU",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 14:32:04",
    "content": " On a full year basis, fully diluted GAAP earnings per share were down $0.02 per share or less than 1% while operating earnings per share were up $0.09, or 2.6% despite a $23.6 million, or $0.34 per share increase in the provision for credit losses, and a $15.4 million or $0.22 per share, decrease in PPP related revenues. Adjusted pretax pre-provision net revenue or adjusted PPNR per share, which excludes from net income the provision for credit losses acquisition related expenses, other non-operating revenues and expenses and income taxes was $1.29 in the fourth quarter of 2022 up $0.20 or 18.3% over the prior year's fourth quarter. Net interest income increased $16.5 million or 17.2% over the prior yearâ\u0080\u0099s fourth quarter due to market interest related tailwinds, strong loan growth and investment security purchases between the periods while non-interest revenues decreased $0.2 million or 0.4%. The company's average interest earning assets increased $905.5 million or 6.5%, while the tax net interest margin increased 28 basis points from 2.74% in the fourth quarter of 2021 to 3.02% in the fourth quarter of 2022. Net interest income was also up $1.8 million, or 1.7% over the linked third quarter results while the tax equivalent net interest margin decreased one basis point. Although interest expense was up $8.8 million over the prior year's fourth quarter, the company's average cost of funds was up just 24 basis points from nine basis points in the fourth quarter of 2021 to 33 basis points in the fourth quarter of 2022, given a 425 basis point cycle to date increase in the federal funds rate. The $0.2 million 0.4% decrease in non-interest revenues between the comparable annual quarters was driven by a $2.6 million or 5.6% decrease in the financial services, business revenues offset and in part by $2.4 million or 14.5% increase in banking management's revenues. The Company recorded $105.9 million in total operating expenses in the fourth quarter of 2022, compared to $100.9 million in total operating expenses in the prior yearâ\u0080\u0099s fourth quarter. Occupancy and equipment expense increased $0.9 million, or 8.9% due to inflationary pressures the Elmira Acquisition in the second quarter of 2022 offset in part by branch consolidation activities between the periods. The company's average earnings and assets increased $905.5 million or 6.5% over the prior year, from $13.96 billion in the fourth quarter of 2021 to $14.87 billion in the fourth quarter of 2022. On a linked-quarter basis, average earning assets increased $254.6 million or 1.7%, while average deposits decreased $154.4 million or 1.2%. Ending loans increased $265.8 million or 3.1% during the fourth quarter and $1.44 billion, or 19.5% over the prior 12-month period. Exclusive of $437 million of loans acquired in connection with the second quarter acquisition of Elmira, ending loans outstanding increased $998.7 million or 13.5% over the prior 12-month period. During the fourth quarter, the company originated almost $560 million of new loans at a weighted average rate of just under 6%. Asset quality remains strong in the fourth quarter at December 31, 2022 non-performing loans were $33.4 million, or 0.38% of total loans outstanding. This compares to $32.5 million, or 0.38% of total loans outstanding at the end of the linked quarter 2022 and $45.5 million, or 0.62% of total loans outstanding one year earlier. During the fourth quarter, the company reclassified certain U.S. Treasury securities with a book value of $1.42 billion and a market value of $1.08 billion from its available for sale investment securities portfolio to its held to maturity investment securities portfolio, while the reclassification has no economic earnings or regulatory impact, enables the company to be more to more effectively manage overall capital levels if interest rates rise above year-end levels in the coming quarters. The only thing I would add, just as it relates to funding overall, in the first quarter of the first half of the year, we'll have $400 million or $500 million of the securities portfolio maturing at fairly low yields, which we will likely use to pay down our overnight borrowings with a probably 300 basis point delta on costs."
}