{
    "symbol": "ABCB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 13:54:02",
    "content": " We reported net income of $92.6 million, or $1.34 per diluted share, and $91.8 million, or $1.32 per diluted share on an adjusted basis when you exclude this quarter's MSR recovery. We had another solid quarter of revenue growth, where net interest income increased over 11% from last quarter to this quarter, the second consecutive quarter. We improved our deposit mix once again this quarter and now, non-interest-bearing deposits are representing almost 43% of total deposits. Our revenue growth, in addition to discipline expense control, resulted in an improved efficiency ratio of just over 50% for the quarter, and we're now at 53% efficiency ratio for the year, which is exactly in line with 52% to 55% that we had previously guided. And for year-to-date, we've grown tangible book value by $2.36, or over 12% annualized. We invested approximately $300 million into our bond portfolio, and organically grew loans by $1.2 billion during the quarter. For the year-to-date, we've grown our bond portfolio by $713 million, and reduced our mortgage loans held for sale by $957 million. We stated the previous quarters that our strategy was to use our mortgage loans held for sale in lieu of buying bonds at previously anemic rates that would negatively affect our capital when rates increased, and that's exactly what we did. For our annualized net charge-off ratio, it's 11 basis points of total loans for the quarter, and our non-performing assets as a percent total assets, was adjusted 55 basis points. And as you can tell, we remain focused on a lot of fundamentals here regardless of what the economic landscape is, and I think this quarters a clear example of that and also the hard work our teammates have put forth to achieve the results that you saw for the quarter. And this Ameris team, when you think about it, has really built an extremely solid deposit base, low deposit betas, strong loan growth, solid asset quality, diversified income streams, with no dependency on any one vertical, and obviously top tier performance metrics. As you mentioned, for the third quarter, we're reporting net income of $92.6 million, or $1.34 per diluted share. On an adjusted basis, we earned $91.8 million, or $1.32 per diluted share, when you exclude the servicing asset recovery, some hurricane expenses, and a small BOLI gain. As Palmer mentioned, we ended the quarter at $28.62, an increase of $0.73 or 10.4% annualized. Also, this quarter, we had only $0.55 of dilution from the increase in unrealized losses on the bond portfolio, compared to $0.16 of AOCI last quarter. For the year-to-date period, we've grown tangible book value by $2.36 or 12% annualized. Our tangible common equity ratio increased to 8.75 at the end of the quarter, compared to 8.58 at the end of last quarter. Our net interest income for the quarter increased $31.7 million over last quarter, and $61.3 million from the third quarter of last year. In comparison, our interest expense only increased $10.1 million this quarter compared to last quarter, and only $9.9 million compared to third quarter of last year. Because of that, our net interest income for the quarter increased $21.6 million, which was driven mostly in the core bank segments. Our yield on earning assets increased by 49 basis points, while our cost of interest-bearing liabilities increased by just 34 basis points. About 20 basis points of that 31-basis point margin improvement was from the deployment of excess liquidity into higher-earning assets, and then the remaining 11 basis points of expansion was due to what I would call true core margin growth. I mentioned at the end of the second quarter that we were slow to increase deposit costs in 2Q, and that our first raise went into effect the last day of the quarter. Due to competitive pressures, we've been a little bit more aggressive with raising deposit costs, in addition to that late 2Q raise, as the Fed raised rates this quarter, but we're still below our model deposit betas. However, even with this anticipated expense, we continue to be asset-sensitive, with NII increasing about 3% in an up-100 environment. We recorded a $1.3 million servicing rate recovery, compared to $10.8 million last quarter. So, excluding that MSR activity, our total non-interest income decreased $9 million, all in the mortgage division. This represents about a 20% decline in mortgage revenue, as production declined to $1.3 billion, and the gain on sale margin declined to 2.1%. Expenses in the mortgage division declined by $6.6 million, or about 14%, and that represents about 68% to 70% of the revenue decline due to the variable expenses within that division. Purchase business has returned to historic levels, at about 85% to 90% of total activity, and we're prepared for continued success at our pre-pandemic and pre-refi boon levels. Just to emphasize what Palmer said earlier, retail mortgage originations as a percentage of our pre-provision pre-tax income, really continue to normalize, representing just 2.3% of the total this quarter. As I just mentioned, expenses in the mortgage division declined by $6.6 million. So, excluding the mortgage division, non-interest expense increased about $3.5 million, the majority of which were compensation benefits, including incentives, benefits, and wage inflation. This represents about a 4% increased expense, but compared with the 15% increase in NII, we had our efficiency ratio continue to improve, reaching a low of 50.06% for the quarter, and that brings us to 53.44% for the year. We continue to look for expense reduction opportunities, and we anticipate an efficiency ratio same guidance as before in that 52% to 55% range going forward. On the balance sheet side, assets were relatively flat at $23.8 billion, compared to $23.7 billion last quarter. We deployed the remaining $1.4 billion of excess liquidity into higher-earning assets to include about $300 million in the bond portfolio, and $1.2 billion of organic loan growth spread among really all categories of our loan portfolio, as you can see on Slide 16. Due to the softening market conditions and reduced pipelines, we do not anticipate the same level of loan growth in the next few quarters. While 2022 loan growth is going to come in higher than we originally guided because of the remixing of the balance sheet and the excess liquid deployment, we do anticipate 2023 loan growth to continue to slow and kind of be more in line with our prior guidance of upper single digits, that 7% to 9% window. However, we grew non-interest-bearing deposits by $80 million, and some of our higher cost interest-bearing deposits we ran off, declined about $298 million. The change in deposits is such that our non-interest-bearing deposits are now 42.86% of our total deposits, almost 43%. And our total non-rate sensitive deposits, that includes non-interest-bearing now and savings, they represent over 66% of our total deposits. I appreciate everyone's time today, and I'm going to turn the call back over to Darius for any questions from the group. We also - the growth that we anticipate next year, we do anticipate that kind of across all metrics. So, not having - I know last quarter we put $500 million. So, we do anticipate that slowing kind of going into the fourth quarter and first quarter. Just for perspective, at the end of the second quarter, they were at 4.7% of the total portfolio, and they, at the end of the third quarter, were about 4.8%. You mentioned how last few quarters have been very impressive expansion and - but you alluded to the fact that deposit costs, deposit beta is probably accelerating from here. A lot of banks have alluded to maybe there's further expansion, but not at the pace we saw this quarter. So, anticipating a 75-basis point rate hike in November, you would expect our margin to increase five to seven basis points, and that's being pretty aggressive with our deposit betas. However, so we - so again, kind of looking at margin going forward, we continue to be asset-sensitive for at least the next two quarters, and then depending upon what the Fed does in December and how lagging our deposit betas are going to be. Maybe just to keep with that train of thought, so I guess the margin's up for the next couple of quarters with your asset sensitivity. Brady, you know, I typically don't like to give guidance out more than two quarters, so I don't want to extend too much, but I think your thinking is right. And even though when you look at kind of straight call report beta, and we look kind of in that very heavy on fixed rate, there's a large portion of our portfolio that reprices on short term basis, our construction book. So, even though itâ\u0080\u0099s technically a fixed-rate loan, it's going to reprice. So, we're a little bit more asset-sensitive on the loan side from a variable rate perspective. And we do anticipate, if the Fed stops increasing, let's say they go November and December and then they pause, will our loan side continue to reprice probably as fast as what potentially the deposit side. So, if we're thinking about a two raise in the fourth quarter and then a lag for a long period of time, I think there is an opportunity for the margin to kind of stabilize. However, if there's a very short lag before they start declining as we are moving our balance sheet to become more asset-neutral, we're preparing ourselves for that. I think that is a possibility, but I really don't like to give too much definitive guidance after that, because there's so much deposit behaviors that could alter that. We continue to look for ways to self-fund that, and not only the wage side, but also technology is one of the things that really has driven our really diligent expense control is that we use - we are looking for ways to use technology. And I think as we get back to a tighter labor market, that should reduce some of that increase in the expense because it becomes obviously competitive now to retain talent, but at the same time, we are not in a position we're having to go out and acquire talent to hit our objectives. I'd say that's really predicated on the Fed because when you look at right now, and you can see it in the NDS market too, the desire to buy mortgage has tapered off primarily because a lot of people are anticipating the fact that rates are going to be pulled back down next year. I think that's a bit premature personally in their thinking, but if they do, then they're going to refinance. So, the annualized - even though it was up a little bit this quarter and not that materially, it annualizes eight points. So, I think this year's still going to finish out probably in a pretty abnormal low number, but I think you could start seeing it normalize again. I would tell you, it's not so much buckets as it is particular asset classes perhaps, and not a concern so much from our portfolio as it is that when we look at that lending on a go-forward basis, is making sure we've got a focus on companies that have operating cash flow, more C&I lending. And when I look at the asset quality there, it's held up better than we had anticipated, but then again, the FICO scores there continue to inch up and the performance is still solid. So, we do watch that one because I think it's a good predictor when you're looking at smaller businesses. Maybe just following up on the asset quality side, we saw a modest uptick in criticized and classified, and it looks like Balboa's ratio has actually improved quarter-to-quarter. The uptick, because of our increase in loan balances, our classifieds on that chart on Slide 20, it's still about the best it's been in the five quarters that we're reflecting on that. It's just really companies that I anticipate will probably improve over the next couple of quarters, and aren't really long-term watchlist sitters, but just because of some numbers I saw this quarter, I felt the need to put them on the watch list. But it is no way really impacted our borrowing with them because we have $300,000 average mortgage loans that still pay off within 20 days of being on the line. And I mean, look, the non-interest-bearing deposit growth was great to see this quarter. So, when you look at a year-end balance sheet, we typically have elevated deposits. But then we also - we continue to be very diligent on the deposit side and the funding side, and our focus has really been growing core deposits and relationship banking, and it's been that way. We had branch managers meeting customers in parking lots in their cars six feet away, and we continued to open accounts and sell deposits, and we didn't shut down to the pandemic. Just - everybody talks about a potential capital downturn, and you see some liquidity, some other banks having tremendous outflows of deposits. And then we also, again, I want to reiterate our bond portfolio, that you can look back kind of in 2019, our bond portfolio was close to 10% of our earning assets. So, when people kind of look at our loan to deposit ratio, you have to remember that we don't have - as a percentage of earning assets, our bond portfolio is much smaller than some of our peers. So, we've deployed some of that through the balance sheet and through loans as opposed to the bond portfolio, and we anticipate that leveling out over the next couple of quarters as well. And then maybe last one, just touching on Premium Finance, had a strong quarter, and that's a segment that doesn't get much attention. And obviously, from a credit risk standpoint, it's got very minimal risk as you're dealing with - we have upfront premiums that are paid for us that we have in reserve. So, the charge-offs running in better than what we anticipated this time last year when we were kind of forecasting it out. But one of the things when you look next year through our hiring process, if you will, the majority of the new hires that we have budgeted, which will probably reallocate some resources to accommodate the expense for it, is on the treasury management side. But I think that's probably where we're seeing most of the lift next year, but we'll still continue to try and penetrate the Balboas and the mortgage operation for deposits. And right now, mortgage does a fairly good job of bringing in deposits, because we've got a lot of escrow and tax money obviously that comes in."
}