{
    "symbol": "ABCB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 14:22:05",
    "content": " For the fourth quarter, we reported net income of $82.2 million or $1.18 per diluted share, and for the year we earned net income of $346.5 million or $4.99 per diluted share. We had another quarter of margin expansion where our margin improved by six basis points to just over 4%, and then our net interest income increased over 5%. One of the metrics weâ\u0080\u0099re really proud of is for the full year of 2022, our growth in net interest income was over $145 million and more than replaced the decline in revenue that we experienced from the mortgage industry refi boom and the PPP income from 2020 and 2021. As a company, our pre-tax, pre-provision increased 13.9% in 2022 to $524.8 million from $460.7 million in 2021. Our PPE ratio was 8.67 at the end of the year, and weâ\u0080\u0099ve consistently said weâ\u0080\u0099re focused on tangible book value growth which we believe is a main driver for building shareholder value, and we grew tangible book value this year by 13.9% to end at $29.92 per share. Loans grew over a billion dollars during the quarter, which includes an asset purchase of approximately $472 million of cash value life insurance-secured loans. Excluding this purchase, organic loan growth was $576 million or 12% annualized for the fourth quarter. The total deposits were relatively flat for the quarter and ended at $19.5 billion compared to $19.7 billion last year, and our total non-interest bearing deposits still represent about 41% of our total deposits. Weâ\u0080\u0099re going to continue to work diligently to protect these relationships, and we still have less than 1% in broker deposits or brokered CDs. We recorded a $33 million provision expense this quarter due to loan growth and our updated economic forecast, and none of this provisioning expense was due to credit deterioration. Our annualized net charge-off ratio improved to only 8 basis points of total loans for the quarter and the year, and our non-performing assets excluding the Ginnie Mae guaranteed loans as a percent of total assets was 34 basis points. As you know, with deposit betas are better than modeled, weâ\u0080\u0099re going to continue to target a pre-tax, pre-provision ROA greater than 2%, as it was 2.2% this year, as I mentioned earlier, and weâ\u0080\u0099re also projecting an ROA in the 1.30 to 1.40 range and an ROTCE above 15%. Weâ\u0080\u0099ve got a diverse revenue stream among other lines of business and geography with over 73% of our net income coming from the core bank segment, and weâ\u0080\u0099re going to continue to accrete capital and we expect to have double-digit tangible book value growth. As you mentioned, for the fourth quarter weâ\u0080\u0099re reporting net income of $82.2 million or $1.18 per diluted share. For the full year â\u0080\u009922, weâ\u0080\u0099re reporting net income of $346.5 million or $4.99 per diluted share. On an adjusted basis, we earned $329.4 million or $4.75 per diluted share, and that brings our full year ROA to 1.39 and our ROTCE to 16.92 for the year. We ended the quarter with tangible book value of $29.92 per share - thatâ\u0080\u0099s an increase of $1.30 this quarter, and for the year-to-date period we grew tangible book value by $3.66 or almost 14%, as Palmer mentioned. Moving onto net interest income and margin, our interest income for the quarter increased $39 million compared to third quarter and increased $95 million when you compare the fourth quarter of last year. In comparison, our interest expense only increased $28 million this quarter compared to last quarter, and just $38 million when compared to fourth quarter of last year. For the full year â\u0080\u009922, our interest income increased $191 million while our interest expense only increased $45 million, so we had a net increase in net interest income of about $146 million or just over 22% year-over-year. Whatâ\u0080\u0099s really important there is we have to remember that that included the headwind of the PPP run-off, so when you look at the core bank segment, net interest income in the core bank increased $188.7 million or 41.2% this year. On the margin expansion, we increased 6 basis points this quarter from 3.97% last quarter to 4.03% this quarter. Non-interest income for the quarter decreased about $17 million, and $14.6 million of that was in the mortgage division. Purchase business stabilized this year closer to historic levels at 82% of total activity, and we really are prepared for the continued success  pre-pandemic, pre-refi boom levels. Our adjusted efficiency ratio improved to 49.92% this quarter from 50.06% last quarter, and for the full year our efficiency ratio was 52.54% compared to 55% last year. We continue to look for expense reduction opportunities, and although there is always a cyclical first quarter bump, we still believe we can maintain an efficiency ratio in the low 50s next year, even with these slight non-interest expense increases. On the balance sheet side, we ended the year with total assets of $25.1 billion compared to $23.8 billion last quarter and $23.9 billion last year. We were pleased with  unit growth of $576.1 million or 12.25% annualized for the quarter, and for the year that was $3.5 billion or 22% for the full year. Total deposits were relatively flat at $19.5 billion for the quarter, and our non-interest bearing deposits still represent over 40% of our deposits, 40.74% to be exact. Then our total non-rate sensitive deposits, we include non-interest bearing now in savings, they represent over 65% of our total deposits, and as Palmer mentioned earlier, weâ\u0080\u0099ve got minimal--less than 1% of our deposits are brokered. Maybe first starting, Nicole, you mentioned, I think a 15% cumulative deposit beta versus your 23% model. When you look at--and again, that is modeled all in, so thatâ\u0080\u0099s including interest bearing and non-interest bearing, and so for the cycle, weâ\u0080\u0099re at about 15% compared to that original 23 and our current model beta is about 21%. We are asset sensitive, still slightly asset sensitive, about 2%; but what I would say is with every rate hike, we have seen--definitely seen competitive pressure in the market, and so we would guide the margins to be peaking or near peak at this point and that, even though we are asset sensitive, if the Fed moves next week and they have one or two more moves, that we really have that extra beta, that catch-up beta to be able to protect our deposits. I will say that with the latest move there, itâ\u0080\u0099s going to be in CDs, and that our overall CD costs--I mean, I think our money markets and all of those are fairly consistent with what we reported for the quarter, but our CD costs for the spot costs--so our money market spot costs at the end of the year were about 2%, now theyâ\u0080\u0099re about  for a total of about 1.53%. Maybe walk us through the strategy just with FHLB borrowings and, I guess, talk more broadly about total funding costs versus just deposit costs, and also your appetite for FHLB versus broker deposits and how it kind of applies to the loan growth guide and also the loan purchase this quarter. The fact that we--when you look at our FHLB borrowings at 1.5 at the end of the year, a third of that was really to fund that portfolio purchase, which is accretive to ROA. But had we instead of doing brokered deposits--Iâ\u0080\u0099m sorry, instead of doing FHLB advances, if we had done broker, which we had room to do that because our brokers were less than 1%, so if we had booked those as brokered deposits instead of FHLB advances, our loan to deposit ratio would have been less than 95% because we would have grown that denominator. I think what weâ\u0080\u0099re all experiencing as an industry is really the mortgage space has obviously moved because of higher rates back more into a pattern of seasonality year-over-year, which is where we were pre-boon, pre-pandemic, so itâ\u0080\u0099s kind of a nice shift, quite frankly, to level set and reset everything in the industry, but I think what youâ\u0080\u0099re going to find across the board is that thereâ\u0080\u0099s going to be more seasonality that we were accustomed to. First quarter of each year is always typically the weaker quarter, and then second quarter generally picks up because of spring selling season, and then third quarter is typically your highest quarter, and then fourth quarter, assuming that rates kind of moderate, weâ\u0080\u0099ll continue to see some improvement there. We think the Fed will have long term rates moderating probably around 2.6, 2.85 in the 10-year, bringing kind of long term rates to a steady 5% for Fannie and Freddie-type products into 2024. I think the outlook right now in 2024 is actually pretty positive for the housing market, so thatâ\u0080\u0099s kind of what I think weâ\u0080\u0099re going to all experience, which weâ\u0080\u0099re glad to see, itâ\u0080\u0099s just some more moderation and getting back into that pattern of seasonality. Thereâ\u0080\u0099s been so much noise between 2019, â\u0080\u009920 and â\u0080\u009921, and so when you kind of go back and look at fourth quarter â\u0080\u009919, which is post Fidelity but itâ\u0080\u0099s also a fourth quarter, itâ\u0080\u0099s a really good comparison quarter in that itâ\u0080\u0099s post Fidelity, itâ\u0080\u0099s pre-COVID, pre-boon, and itâ\u0080\u0099s a fourth quarter, so youâ\u0080\u0099ve got the cyclicality of that fourth quarter. When you look at that, our production is down about 40% this quarter over--Iâ\u0080\u0099m sorry, 30% this quarter over fourth quarter â\u0080\u009919, but our profitability is greatly improved, and a lot of that has to do with all of the things that the mortgage group learned and did because they had to during that refi boon, so theyâ\u0080\u0099ve definitely become more efficient. Then when you look at their contribution to the company in â\u0080\u009919, they were about 19% of our net income, and this quarter theyâ\u0080\u0099re about 13% of our net income, so they continue to be efficient and they continue to monitor all of that, and so if they can stay on that projection and be able to kind of make up for that loss of gain on sale, when gain on sale comes back, itâ\u0080\u0099s just going to be gravy for us. When we think about production for next year, I would model about mid-$4.5 billion to $5 billion of production, thatâ\u0080\u0099s probably $1 billion in the first quarter and fourth quarter and then about $1.5 billion in the second and third, so that gets you to about--between $4.5 billion and $5 billion in production. Our office portfolio is primarily--we kind of mentioned it on the slide, but really three categories, I guess youâ\u0080\u0099d call them: essential use, meaning that a company needs that facility for a call center or a headquarter building or something along those lines, medical office, and/or credit tenant. It kind of broke in the second quarter of 2022 and weâ\u0080\u0099re continuing to work out strategy on that, but thereâ\u0080\u0099s not been anything sort of widespread as far as any cracks that have developed thus far in that portfolio. If I look at cash to average earning assets, I think itâ\u0080\u0099s about 5% today, that was 18% last year at this time. In the fourth quarter, we bought about $100 million a month, and so weâ\u0080\u0099ve been growing that bond portfolio. That ties into your cash question, that we really kind of--we take our bond portfolio and our cash, because remember we donâ\u0080\u0099t have all the unrealized loss in the bond portfolio that some of our peers have, and so our bond portfolio is sellable with very little impact to regulatory capital because of our AOCI position, and so we are able to consider our securities and our cash in our liquidity ratio, so we keep that liquidity ratio in that 10% to 12%. I would expect to see cash kind of staying at that 5% and then, depending on what the market does with the bond portfolio, I think it would stay kind of in that 7%, possibly growing to 9%, but thereâ\u0080\u0099s so much uncertainty in the market today. Then on the liquidity funding side, our brokered CDs, I think weâ\u0080\u0099ve already said it probably twice, but we really have minimal brokered money - itâ\u0080\u0099s less than 1%, and our FHLB borrowings are less than 6%, so we have room on the liquidity side, and like I said earlier, if we had not done the FHLB advances and we had gone the brokered deposit route instead, that loan to deposit ratio would be less than 95% and it wouldnâ\u0080\u0099t be quite the outlier. But I would say at this point that anything thatâ\u0080\u0099s cash flows off the bond portfolio, I would consider reinvesting that into the bond portfolio to kind of still keep it at that 7%. Yes, and because we had moved our bond portfolio down to less than 3% of assets and weâ\u0080\u0099ve really added that bond portfolio back in over the last six to eight months, the cash flow on that is not as aggressive as you might expect. Our continued focus on obviously deposits, but more importantly on C&I kind of growth too, is that weâ\u0080\u0099re getting a lot of really good opportunities on the C&I front, so I think youâ\u0080\u0099ll continue to see strong growth there on core organic kind of C&I, in addition to the equivalent finance type of activities. Weâ\u0080\u0099ve kind of got three pillars for 2023 that weâ\u0080\u0099re focused on, with the first one being deposits-deposits-deposits, and fortunately for our company thatâ\u0080\u0099s nothing new, but all our incentive plans have been adjusted to reflect that across the board at a more intense level. Those are really our three main focuses for next year, and I think thatâ\u0080\u0099s going to serve us well as we navigate through the remainder of 2023. The momentum and the discipline that weâ\u0080\u0099ve positioned ourselves, I think this year and last year, is going to bode well for us as we move forward, and Iâ\u0080\u0099m reminded every day of the importance of teamwork and want to give a big shout-out to the entire Ameris team for all of their hard work and allowing us to deliver this type of performance."
}