{
    "symbol": "NVT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 16:22:05",
    "content": " After today's presentation, there will be an opportunity to ask questions. Thank you, and welcome to nVent's fourth quarter 2022 earnings call. We will provide details on our fourth quarter and full-year performance, an outlook for the first quarter and full-year 2023. Before we begin, I will remind you that any statements made about the company's anticipated financial results are forward-looking statements subject to future risks and uncertainties. I also want to add, that we look forward to hosting our next investor day, the morning of Tuesday, March 7 in New York City. We successfully executed on our strategy, focusing on high growth verticals, new products, global expansion and acquisitions. As a result, full year sales grew an impressive 18% with adjusted EPS of 22%. This was another year of outstanding performance and value creation, and we're well positioned to do it again in 2023. Slide four, summarizes our Q4 and full year performance. Adjusted EPS grew 32%, and we generated $180 million of free cash flow, up 77% Our fourth quarter results were terrific. Turning to organic sales by geography, we continue to see broad-based growth in North America, up strong double-digits. Lastly, orders in Q4 were flat year-over-year. Recall a year ago we had 37% orders growth, a tough comparisons. Also, as we discussed in our Q3 earnings call, we expected orders to moderate as distributors returned to seasonal destocking. For the full year, we had record sales of $2.9 billion, an increase of 20% organically and segment income also grew 20%. For the full year, we generated over $350 million of free cash flow. First, we launched 59 new products and our new product vitality is now 20%. Second, with our focus on high growth verticals, infrastructure is now approaching 25% of our sales, up from low teens at spit. Infrastructure includes data solutions, power utilities, renewables and e-mobility to name a few. For example, data solutions now represents $375 million in sales, and grew over 35% in 2022. Lastly, we have added more than $300 million in annual sales from acquisitions since then. And in 2022, sales growth from acquisitions exceeded overall nVent growth. While we did not complete any new acquisitions in 2022, we remain disciplined in our approach and built a very healthy pipeline of opportunities. Looking at the macro trends, we expect electrification, sustainability, and digitalization to continue to accelerate. On verticals, we expect industrials to see continued growth with investments in automation and supply chain resiliency. Infrastructure will benefit from investments with the electrification trends in power utilities, renewables and e-mobility. We expect continued strong growth with our portfolio and liquid cooling for data centers, given the energy efficiency benefits. However, the need for more labor saving solutions will drive demand for our products as well as growth in power and data infrastructure. Residential is expected to be soft, but represents less than 5% of our portfolio. In energy, we expect to see continued growth with MRO, and projects supported by decarbonization with LNG, clean fuels and carbon capture. While supply chains remain challenging, we do expect them to gradually improve. Overall, I am proud of our nVent team and the record results we delivered in 2022. I'm pleased to share another quarter of great execution with double-digit sales growth, strong return on sales expansion, double-digit EPS growth and robust free cash flow. Sales of $742 million were up 11% compared to last year, or 15%. Overall, sales grew across all segments and verticals. volumes were up modestly compared to last year, and price added 15 points to growth. Fourth quarter segment income was $144 million, up 31% with strong incrementals of 47%. Return on sales was 19.4%, up 290 basis points year-over-year. In addition, we continue to make investments in R&D, digital and sales and marketing for growth and productivity. Q4 adjusted EPS with $0.66, up 32% and above the high end of our guidance range. On cash, we delivered significant working capital improvements in the quarter, resulting in $180 million of free cash flow, up 77% year-over-year. Now, please turn to slide six for discussion of our fourth quarter segment performance, where you will see continued sales strength across all three businesses. Starting with enclosures, sales of $376 million increased 17% organically with both price and volume contributing. Enclosures fourth quarter segment income was $72 million, up 67% return. Return on sales of 19.2%, increased an impressive 620 basis points year-over-year, driven by strong execution and catching up on price cost. For the full year, ROS expanded 80 basis points to 17%. Sales of $194 million increased 16% organically with strong price contribution, while volume was down slightly. Electrical and fastening segment income was $53 million, up 18%. Return on sales was 27.5%, up 120 basis points compared to last year on solid execution and price costs. Sales of $172 million grew 9% organically, with both volume and price contributing. Geographically, North America lead with MRO and large projects, while Europe grew modestly impacted by Russia and commercial resi headwinds. We ended the year with record sales of $2.9 billion, up 18% or 20% organically. Segment income grew 20% to $524 million, and return on sales expanded 30 basis points to 18%. Adjusted EPS for the full year was $2.40, up 22%. And free cash flow was $351 million, up 5% with 87% conversion of adjusted net income. First, volume contributed six points to sales growth. Second, all segments grew organic sales, double-digits and expanded margins. On slide eight titled balance sheet and cash flow, you will see we exited the year with $298 million of cash on hand and $600 million available on our revolver. Turning to slide nine, we continue to prioritize growth and execute a balanced disciplined approach to capital allocation. In 2022, we returned $183 million to shareholders, including a competitive dividend and share repurchases of $66 million. We believe we have ample capacity and strong cash flows to execute on our growth strategy, including M&A and deliver attractive shareholder returns. This assumes low single digit volume growth, and roughly three points of price. While we expect sales growth and positive price each quarter, growth is expected to be stronger in the first half given a robust backlog and pricing carryover. Our outlook for full year adjusted EPS is $2.51 to $2.61, which represents growth of 5% to 9%. First, we expect price plus productivity to more than offset persistent inflation. Second, we anticipate stronger year-over-year margin performance in the first half given comparisons, and favorable price cost. And third, we will continue to invest in new products, digital and capacity for growth. Lastly, we expect free cash flow conversion of approximately 95%. A few 2023 below the line item assumptions we'd like to call out include higher net interest expense of approximately $40 million due to higher rates on our variable rate debt, a tax rate range of 18% to 18.5% and shares of approximately 168 million. Additionally, we anticipate corporate costs of approximately $95 million and CapEx of $55 million to $60 million. For earnings per share, we expect adjusted EPS in the range of $0.56 to $0.58 up 12% to 16% year-over-year. In closing, our team delivered another year of outstanding results in 2022. Over the course of the year, our ability to respond to strong demand and overcome supply chain challenges was appreciated by our customers. As you can see on the slide, we're highlighting a few of the many recognitions we received for our commitment and partnership to our customer success. These recognitions weren't just about product delivery, these extended to innovation and safety, performance measures we value in nVent. For the second consecutive year, we were again awarded a Silver Sustainability Rating from Ecovadis. Our overall score improved placing us in the top 9% of companies assessed in our industry, and the 85th percentile of all companies assessed. I'm very proud that our board of directors is 70% diverse, and we were recognized by 50-50 women on boards. Turning to slide 13, I look forward to our upcoming Investor Day next month, and sharing how nVent is building a more sustainable and electrified world. Wrapping up on slide 14, 2022 was another year of outstanding performance for nVent delivering differentiated value for our customers and shareholders. We are well-positioned with the electrification of everything, sustainability and digitalization trends. But I think in 2022, right, you said price offset all inflation. And I think for 2023, you said price plus productivity offsets inflation. And 2022, price needed to offset inflation as well as some of the negative productivity we saw, just due to the supply chain inefficiencies. So in essence, it took us -- cost us more to service our customers with the robust demand we were seeing and a strong volume growth. And so, as we walk in and 2023, we would expect price to offset cost. But we've talked about this in our last call, we're really focusing on those supply chain investments to help remove some of those areas that we've constrained in, as well as focus on productivity and the factories that provide that productivity improvement over the course of 2023. As we had discussed on our Q3 call, we expected to see some return to normal seasonal destocking. However, what we did see was strong demand and sell-through from our distribution partners. Now, as we turn to this year and January, we've seen those orders increase. And so I think there was some management of that inventory level, if you like, but they still are sharing with us that they've got good backlogs, good demand. And so, we believe we're going to see that pick up here as we go through 2023. So obviously, the 2023 fill on and 2022 price contribution was about 14%. Well, let me just start by talking about price. There's still supply chain challenges, there's inflated labor, energy costs, et cetera. However, it's not at the same level as we were last year, as s Sara shared with your assumption as we go forward. Maybe just one point to add to that, in terms of kind of that stickiness. And then, maybe I'll just expand a moment on the inflationary environment to give a bit of a color on that piece of it. Something to keep in mind is if you look at our total cost structure, that's roughly $2.3 billion. And so, metals specifically are less than 20% of that overall cost structure. So while we are seeing some easing on the inflationary side, as it relates to metals, we're seeing inflation and everything else. So as Beth alluded to, you've got components, you've got electrical electronics, labor, logistics, energy, professional services, that is where we're seeing that inflationary pressure. And so, like we've consistently demonstrated in 2021, in 2022, we're going to consistently and keep front footed and manage that price cost equation going into 2023. So one of the things we commented on is if you look at the quarters, how we progressed with enclosures, that was our segment that had the most challenges in terms of demand and supply chain inefficiencies. So to some extent, we had some inefficiencies, we improve that towards the backhand -- back end of the year and some ketchup on price cost. And so, we don't expect that margin to be at that level going into Q1. And it also kind of sounds like, because you believe the backdrop is going to be inflationary, there is some likelihood that you'll put additional pricing increases through. As we said in our prepared remarks there, Joe, I mean, that three points of price, that's part of that 4% to 6%, organic growth, much of that is really carryover, as well as things that are already announced. But as the year progresses, we're going to continue to manage that price cost equation as we've done in years past. And then just thinking through the volumes, right, your demand backdrop still sounds like it's very good. And yet, you're calling for volumes to be, maybe up low single-digits. When it comes to both the infrastructure bill and the inflation reduction act, most of the infrastructure bill, some of that funding, it's very -- it's moving through the states, and it's allocated for roads and bridges and transportation and water and broadband and ports and airports, as you know. And we look at all that and say, okay, here's where our enclosures are EFS business where we're positioned, where we could expect to see some growth. When it comes to the it's the Inflation Reduction Act, some of that is going to start to drive demand in areas where we have like renewables and solar and some areas where we're working on e-mobility. So I think you've guided those may be up about sort of 50, 60 bps for the year. Just after the fourth quarter, you had very different sort of year-on-year margins by segment. Are we seeing a bigger increase, maybe in thermal and then enclosures is more flattish. I would start by saying kind of that ballpark, margin, if you kind of just back into that from a segment income perspective, it's in the ballpark, Julian. First, we're confident in the year that next year is going to be or this year, right 2023 is going to be another year of margin expansion. Yes, that's going to come from the contribution from volume, but also positive price cost productivity. It's one just given, our comparisons of a year ago. We're lapping here in the first set half, some of that negative productivity and just high cost to serve, right, from a supply chain perspective. But also, we're carrying forward, as you saw in Q4, some stronger price cost. So, if you look at that from a segment perspective, we continue to expect really the largest expansion from enclosures, building off of that 17% ROS that they exited the year with in 2022. So again, expecting that price cost to benefit enclosures here in Q1 in the first half, and continue to expect to see gradual improvement from a productivity standpoint. I would also say that we expect to see margin expansion, both in enclosures and thermal management, just left so. And then with thermal management, still expect margin expansion just a bit more modest given some of the mix pressures as projects really come back on board here and grow strongly. And just to focus on the sort of price and net productivity buckets for a second, when we're thinking about 2023. So I think you've colored it in rather well, Julian. I mean, I think in terms of a price cost perspective, we do expect price to offset inflation, but to a narrower degree than what we saw in 2022, and some of that, again, was catch up, right, in terms of quarters past. And then productivity, while productivity embedded in that $290 million headwind, if you will, that was negative $65 million, with a balance of that being inflation. So not right at the gates here in Q1, but we continue to see good gradual improvement for supply chain, even from Q3 to Q4. So we see that a little bit more weighted towards productivity than price cost, but both contributing positively to that bar in 2023. Sara, I was hoping you just take us through some of the dynamics in free cash flow, really strong finish to the year. And if you look at Q2 to Q3, that inventory was flat, even while sales grew. But still, I would say, it's very surgical. But there's -- yes, there are still some areas that we're not or where we want to be in our service levels, and know that we've got to make some of the some of those investments. We know that there's continued progress we can make as that supply chain improves, but we're going to continue to take a very surgical approach to it to make sure that we're also investing in those areas that we need to that are constrained or that have more challenging lead times. When we look at that growth, I would say, in data solutions into two areas. And when we do sell those off, and we're selling those with racks and enclosures and fastening solutions, but we've talked about this before where liquid cooling is a more efficient way -- energy efficient way of cooling data centers, and with data centers, and chips getting hotter, it's really the direction that we're seeing across all data center applications. The other area, I would comment on where we saw growth is from our power distribution units. So as we think about how our growth outlook here, it really is all of what we do, but led predominantly by liquid cooling and our power distribution units. I think Beth you said, that you would not expect that to repeat. I know maybe there's some seasonality, dynamics, et cetera. I mean, in the quarter, right, from a Q4 perspective, some of that price was really catching up from the early part of the year. And so, when we looked at Q4 stand alone, excellent, impressive return on sales. As you well know, usually, we have sort of a seasonal downtick in ROS, but that was very strong sort of quarter-to-quarter sequentially. So as we look at, maybe I'll put in the context of the full year, we exited the year at 17% return on sales for enclosures. And so, we would expect to build upon that and see the strongest margin expansion heading into 2023. Because comparing that, its kind of where thing stood in Q1 of year ago as well. It seems like there's a lot in the backlog, but some kind of emerging concerns, just around data center, and particularly, some of the hyperscale guys kind of cutting people and cutting back a little bit. And because we're seeing this technology conversion to liquid cooling, which actually reduces operating expenses, we're seeing demand for these types of solutions increase in despite of that backdrop of or everything else going on. And so that conversion, and we think is going to continue to extend across multiple data center applications, both new and retrofit. Would you say, your data solutions business is kind of running above that three points. Well, I would say that the three points about growth is broad based across EFS and thermal, but for enclosures significantly, it's both on the power distribution side and the data center cooling that we're seeing that higher than three points of growth from those in products. Well, Scott, I would say it's both of those things. And now, as we've progressed in 2023, order rates have picked up again in January. But I do think, remember, we were seeing crazy order rates in Q4 of just 2021. So, at that point, we were definitely saying, our customers and our partners, placing more orders on us to give us visibility to demand so we could respond. So I think we're seeing that, that as supply chains improved, they're not placing those orders, six months out to give us visibility. And so, I think that's just part of the gradual supply chain improvements that we're seeing. Thank you for that. And I'm just wondering what the 3% looks like in 2023, if you could hazard a guess there. Yes, we don't really -- the way we think about new products. So they're reducing labor, or they're driving energy efficiency or better operational performance. So therefore, we launched new products with a higher margin expectation, because of the value that we're creating. So that's how we think about it versus pricing, right. And I would say, as we go into, or as we're in 2023, we always look to launch at least 50 new products. We look to launch them with faster cycle time, improved margins, we always want to get at least one point of growth. And, but I think, we're going to continue to strive to have great differentiated products were like this year, if we can drive higher volume and growth from them, we will. My question would be about your R&D spend, and maybe your think has -- the thinking about that going forward. So, this was a record year for your R&D spend, up towards 25% or so. And I thought it was interesting that each quarter, the four quarters of 2022 had the highest -- four highest quarterly spends on R&D. To me, it seems like, I am wondering if maybe there's been an evolution and you're thinking in some direction about the goals were the priorities within your R&D spend. Well, we've always stated that we were going -- our intent was to always increase our R&D spend, because we thought as a percent of sales when we spot it was on the low end. In some cases, it may be a specific customer, but we tried to think of a developing platform products that can serve multiple customers in a particular application. So that when we launch a new product, we have way of getting it positioned more quickly through our distribution partners, we've got inventory, we've got digital collateral, right, you just can't launch a product without having the digital product information available. And, we'll continue to invest there as we see great returns. Thank you for that. And I'm just wondering if you wouldn't mind qualitatively, maybe just calling out the top couple of areas where discretionary capital will be spent in 2023 to maybe alleviate some of those constraints or alternatively to exploit some opportunities that you see. Maybe I'll start by saying, we've talked about our data center solutions and our liquid cooling is growing so significantly. And that also involves us having some expansion within Mexico, where we need to add an additional plant to our campus or extended campus to be able to have the capacity for some of these high growth areas and high growth verticals. I mean, our CapEx really is focused on new products, digital transformation, high growth verticals. We believe our supply chain is in a position of strength for us here in 2022, in terms of enabling us to deliver for our customers and do it very, very well. But building that out in Mexico, particularly in our enclosures, addressing some of these bottlenecks that we're seeing. It's also increasing our investments in automation, as well as modernizing some of what we have in our factory to really allow for better output and frankly, more efficient output as well as we go forward. Thank you for that. And then just last question, about the new products. You started out a couple years ago, Beth, I think with a target of 50 new products. And it depends on the types of products, whether they're brand new platforms, whether in our fastening business, we tend to have more types of fasteners, which are faster or smaller projects. But I think what we're striving for as at least 50 new products a year, reducing that cycle time, higher margins, and then having at least driving a point of growth, if not more."
}