{
    "symbol": "NVT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 12:00:05",
    "content": " Thank you, Jason and welcome to nVent's third quarter 2022 earnings call. Today we'll provide details on our third quarter performance, an outlook for the fourth quarter, and an update to our full year 2022 outlook. Before we begin, I will remind you that any statements made about the company's anticipated financial results are forward-looking statements subject to future risks and uncertainties. Our nVent team delivered exceptional results by serving our customers, responding to strong demand and overcoming supply chain challenges. Our strategy to focus on high growth verticals, new products, global expansion and acquisitions, combined with strong execution continues to drive our success. We believe we are well-positioned with the electrification of everything, mega trends. Our third quarter performance was a new record for both sales and adjusted EPS, and once again exceeded our guidance. Given our strong third quarter results and expectations for Q4, we are again raising our guidance for full year sales and adjusted earnings per share. Sales in the quarter were up 20% organically, with double-digit growth in all segments and key verticals. We generated $126 million in free cash flow, up 17%. Orders grew high single digits, on top of 43% orders growth a year ago. We continue to have a robust backlog, up strong double-digits year-over-year that gives us confidence going forward. Year-to-date, we've launched 42 new products and expect to deliver 50 again this year. Looking at our key verticals, they all delivered strong double-digit organic growth. Looking at our organic sales performance by geography, we continued to see broad-based growth in North America, up 28%. Looking ahead, we are raising our full year sales and EEP guidance, reflecting our third quarter performance and expectations for Q4. I'm pleased to share with you another quarter of strong execution with double-digit sales growth, return on sales expansion, and improved free cash. Overall, sales growth was broad-based with double-digit growth across all segments and key verticals. Volume contributed -- continued to be strong, adding five points to growth and price adding 15 points. Segment income was $144 million, up 22% with return on sales of 19.3% up 210 basis points sequentially and improved 90 basis points year-over-year, all better than expected. Volume and price contributions more than offset the impact from roughly $55 million of inflationary cost pressures, supply chain inefficiencies and FX headwinds. In addition, we continue to make investments in R&D, digital, and sales and marketing for growth and productivity. We generated $126 million of free cash flow in the quarter, up 17%. We are actively managing working capital, while supporting robust demand in a challenging supply chain environment. We expect cash flow momentum to continue in the fourth quarter, reflecting our seasonal strength and working capital improvements. Now please turn to slide six for discussion of our third quarter segment performance, where you'll see continued sales momentum and strong margin performance. Starting with Enclosures, sales of $388 million increased 20% organically, with both volume and price contributing. Sales growth was broad-based across all verticals, led by infrastructure and industrial. Enclosure's third quarter segment income was $72 million, up 27%. Recall this business was most impacted by inflation and supply chain challenges, and we pointed to ROS improvement in the back half of the year. Now moving to Electrical & Fastening, sales of $209 million increased 28% organically with both volume and price contributing. Electrical & Fastening segment income was $61 million, up 26%. Return on sales was 29.1%, up 50 basis points relative to last year on strong execution and price offsetting inflation and supply chain headwinds. Turning to Thermal Management, sales of $148 million grew 13% organically with both volume and price contributing. All verticals grew double-digits, led by industrial with particular strength in chemicals. Geographically, North America was strongest with growth in MRO, chemicals and clean fuels. Overall, orders were flat in Q3 largely reflecting what we what impacted sales. Return on sales expanded 140 basis points year-over-year to 24.2%, driven by improved price/cost and positive mix contribution from industrial MRO. Also, we exercised our delayed draw option on our $200 million term loan and ended the quarter with $600 million available on our revolver. We ended the third quarter with a net debt to adjusted EBITDA ratio of 1.7 times, just below the low end of our target range of 2 to 2.5.Year-to-date, we have returned $96 million to shareholders, including a competitive dividend and share purchases. We believe our strong liquidity and robust cash flow position us well to continue to invest, execute on M&A and deliver attractive shareholder returns. Moving to slide nine, you will see our updated 2022 full year outlook. Our year-to-date performance has been strong, with sales up 21% and adjusted earnings per share up 18%. As Beth highlighted earlier, we are again raising our full year sales and earnings outlook. For organic sales growth, we now expect a range of 18% to 19% versus our prior guidance of 15% to 17% for the year. For free cash flow, we now expect conversion to be approximately 90% at the low end of our prior range due to higher working capital to support our strong sales growth. A few other full year call outs, we now expect a four point FX headwind to the top line. Looking at our fourth quarter outlook on slide 10, we expect reported sales to be up 4% to 6% and organic sales to be up 9% to 11% with an FX headwind of about 5%. Our orders and backlog give us confidence in Q4 and into next year, and adjusted EPS is expected to be between $0.56 and $0.58. Wrapping up, we continue to execute well with strong sales growth, ROS expansion, and improved free cash flow. With the macro trends of the electrification of everything and the increasing importance of sustainability, we are seeing increased demand for our products and solutions. As the world moves through the energy transition, we see investments being made in infrastructure, renewables, energy storage, and electric transportation. When it comes to electrical connections, our nVent air flex FleXbus can reduce the installation time and cost up to 50% and 20%, respectively. In addition to the strong value propositions of our products, we are committed to developing them in a responsible manner with a focus on eco-friendly materials, lower environmental impact, and end user safety. By 2025, we expect greater than 90% of our new product introduction funnel to have a positive impact in at least one of these categories. When it comes to acquisitions, our focus is on companies positioned to grow with the electrification of everything. We've strengthened our portfolio in data solutions, industrial automation, and renewables. These acquisitions have grown 30% year-to-date, outperforming and growing faster than overall nVent. We had an outstanding quarter, with sales and adjusted EPS exceeding our guidance. And for the full year, we expect double-digit sales and EPS growth. While the macro environment is uncertain and supply chain challenges persist, we believe the electrical secular tailwinds position as well to outperform GDP. Stock was down double-digits, I think partly because of the leverage that the company was taking on. And so I know, Beth, in your opening remarks, you mentioned M&A and your focus on the electrification of everything. Our M&A pipeline is very robust, and I think a couple of things. I think one thing I would say is, we have a strong balance sheet and cash flow position, which we think gives us optionality. And I'd also say this, we have demonstrated such strong execution and integration of our acquisition targets, and as I mentioned, better than our overall nVent performance, that gives me confidence, then we could do a larger deal than the ones that we've had. But of course, we're going to remain disciplined and certainly, we have our models that we ensure that we can meet all those targets and hurdles. There is some concern that non-residential investment activity is going to follow residential, doesn't seem like you're seeing the signs of that across your portfolio. And so, maybe just provide a little bit more color on how you're thinking about your end markets as you head into 2023. Now, I think -- and as we initially head into 2023, as I mentioned, we think infrastructure is going to continue to be very strong, and that's really because of the investments that are being made. As we look at industrial, we see that we have a really strong backlog there, particularly in our Enclosures business. And there's a lot of focus on industrial, automation and reassuring or just the fact that everyone has had so many labor constraints and challenges. And so, we think going into next year with our backlogs, we believe we'll have some strength there. I think on the commercial and residential, residential is not a big piece of our portfolio and certainly, we've seen that slower. On the commercial side, if you look at where we have -- the most of our business in our Electrical & Fastening solutions, a lot of what we do in commercial is related to power and data infrastructure. So anytime that you are retrofitting a building or looking to have more content, you think of the hotel room and all the different outlets and plugs and things like that, it drives for more of our solutions. We come out with new products that are labor savings, given the labor shortage in the contractor market, that also plays well to our strength. And then finally, energy, we think that we'll see some continued strength there, just because of energy and dependency, the switch to clean fuels, biofuels, et cetera. So just for the -- your fourth quarter revenue guide, I guess two parts to it. One is that, I think your guide implies sales are down mid single digit sequentially and normally they're flattish in Q4. And then, when we look year-on-year at organic sales, I think you said you should get volume growth in Q4, so maybe just frame how much pricing is stepping down from that very big tailwind in Q3. Let me first start, Julian, with just how we thought about the quarter. And so one of the things for us as we looked at our orders and our backlog, but we also were cautious with not knowing what our distribution channel partners would do with their inventory positions. And remember, there's a significant portion of our business that is really short cycle. And while demand is still very strong and the output through our channel partners is strong, our thinking there is that they may tend to modify their inventory positions as we go out of this fourth quarter. We don't know, but that was one of the -- our views in just being cautious on how we looked at Q4. And I think the other maybe thing to add to that on the sequential side is, what Beth said and then you flagged it I mean, it's currency, currency is paying a piece of that in terms of that downtick. And then, from overall standpoint, I mean that 9% to 11%, as we said in our prepared remarks, includes both an expectation of volume and price. Obviously, it's going to be a bit more skewed to price, but still not volume. Well, here's what I would say. Q4, we do expect another strong market performance and good incrementals. We would expect it to look a little bit more normal in terms of that sequential downtick in ROS, but significantly better than what we saw in Q3 to Q4 a year ago, really based on better price costs and productivity. And then, from a margin perspective, I guess I would characterize it like this, we would expect Enclosures to be the largest driver of that year-on-year margin improvement and see more kind of modest margin performance to platinum EFS and thermal. I mean, it's really more of a function of the strength of that margin performance of a year ago than anything else. For Europe, just given all the anxiety about the potential slowdown, you're not seeing it in your headline numbers here today from third quarter, but anything changes at the margin quote activity. So starting with Europe, as we mentioned our Europe -- European performance continued to be strong. When you look at China, and remember China's only mid single digits in terms of our overall portfolio. And we were really impacted, and these COVID lockdowns vary by region and our plant was impacted in the quarter and Q3, so we're working to recover from that and I expect we're going to see some improved performance there in Q4 and on our Thermal Management business, it's also just some timing there. So, I think we're going to see that turnaround as we progress through the quarter. And then, for Sarah, on the -- you tweaked free cash flow down for the year and it sounds like it was all related to the higher working capital demands for this surgeon  and ongoing strength on the industrial side. And it simply is a function of the strong demand that we usually see in the quarter, amidst what is still a challenging supply chain. I think we see it getting modestly gradually better, but it's still challenging. So I think over the long-term, nothing changes in terms of our cash conversion goals of getting to that 100%. And I think prior to going into to this year with this strong demand against the challenging supply chain, we have a strong track record of converting at 100%, including in 2021. Material availability, I would say, again, better than where we started the first half, clearly better than what we're lapping here of a year ago. But there's still pockets, where we're still challenged. So, we're having to be very surgical and very focused in terms of where and how we're managing this working capital as we balance all the factors here. So going into Enclosures, obviously we're seeing some nice margin momentum through the year. And I would also say, materials, particularly when it comes to electronics, still is very challenging, but we're working our way both through that. And I would say on Enclosures, we're even looking at some more expanded capacity and looking at expanding our operations in Mexico just for the strong demand that we see. But as I mentioned earlier and in my prepared remarks, I just think, the backlog is strong for Enclosures, and we think we've got momentum with some of the infrastructure in the industrial electrification trends that we see going forward into 2023. And then to the thermal, obviously orders, I'm assuming there's some impact there from Russia, but just wondering, if you could maybe size that. We're seeing a lot of news around pipelines, but partners getting blown up, et cetera. We've talked about that for six consecutive quarters being very, very strong. We've seen a lot of focus on things like clean energy and biofuels and carbon recapture, so some -- energy transition areas. And I would say, another area for us is in the focus in chemicals and that has performed very well for us as we go forward. It hasn't caused any issue, but we definitely are strategically looking at this energy resiliency, energy and dependency, energy transition and making sure that we're well-positioned globally to serve some of the changes in demand here. And I think that going into next year, we'll see some strength. So, I just want to go back on productivity, because it seems like the price cost is getting better, but productivity still seems to be a challenge. Well, I mean, I would start from the standpoint of -- we've worked towards this equation, if you will, that price plus productivity is going to more than offset right inflation. And so, I think we've managed that well over the last couple of years. Productivity has been more of a headwind in the current environment, given some of the supply chain challenges. What I would say is that we're really focused on doing something differently than what we've done before in terms of onboarding, in terms of training, in terms of ensuring that we've got the right level of automation in our factories, putting in capacity and investments as Beth alluded to earlier. So, there's a lot that we're doing to drive that productivity improvement, along with looking to see that gradually improve just from an overall environment perspective. And I'd say that our demand -- first of all, we always look at the demand and the throughput, our distributors and that's very strong. So, I think it's good for us just to have a cautious view there. I think the thing to keep in mind is that even if we see some material price easing, we've got inflation in so many other areas. So, on balance, as I mentioned, we think next year is an inflationary environment and we're going to continue to manage that price/cost equation as we go into next year. And in particular, I'm sort of interested in how much of a productivity headwind you're fighting against some of these supply disruptions. So, on that $74 million, you've got roughly $55 million of that is going to be inflationary pressures. So that means you've got roughly $19 million, $20 million related to investments and productivity. Maybe a couple of things I would call out there, Jeff, is on the investment side, you can see it on the P&L. I mean we are investing higher dollars in terms of R&D, sales and marketing, and digital that shows up in that SG&A line. And so that's a significant year-over-year investment that we're making that we believe you're seeing the returns already on that in terms of the new product contribution, and what we're doing around digital capabilities to service our customers and to drive productivity. One would just be, we're not yet seeing that supply chain efficiencies that we would expect with the volume leverage that we're seeing. As we sit here today, we continue to have just strong demand. And so that means we're leveraging our global footprint, maybe unlike what we would normally do in terms of very in-region, for-region approach. We're flexing our capacity, engaging with some outside sourcing to help us service that demand. But again, as we drive for greater efficiencies in our factories, as we put in that more and more automation as we make some of those capacity investments, coupled with a backdrop of what we see as a gradually improving supply chain, we think that's going to consistently improve as the quarters progress. It sounds like it's mostly labor, but your capital spending actually is a little on the low end of what you were previously thinking. And for a lot of companies, it's price and not volume, but you've got both working. We've been able to manage our CapEx spending fairly consistently as a percentage overall, and I think that's true how we think about 2023. Having said that, for the last couple of years, we've always been able to make investments and expansion. As we're going into next year, we're going to expand in Mexico. And what that enables us to do is to strengthen our regional strategy as well as -- as we look at some of these areas for infrastructure growth, we believe that we do need to add some more lines to give us that capacity that maybe is constraining some volume growth today. I don't know, Jeff, that I would say that there's anything unique there, in particular. But for us, it's just been an area where our value propositions and our capabilities have just played well. I wanted to maybe drill down a little bit further into the impact of higher commercial loan rates and let's say your commercial buildings market, which is a pretty big market for you guys. I'm just wondering, though, if you thought through whether in a higher rate environment, perhaps some of that activity slows, maybe that market turns into more break and fix next year. I mean, I think that's right. You see -- I mean, certainly, you've seen the interest rates. Again, we're not really in resi, but you see it starting there with homebuilders right now. And I do think, on the commercial side, we would expect to see that flow. And our view is we're so broad-based in terms of the different types of buildings, warehouses, data centers, et cetera, that we support with our products and offerings. And they also, particularly with our EFS portfolio, a lot of what we're driving our labor saving solutions and power and data infrastructure is where we play. So, our view is as we keep coming up with new products that are labor savings that can be extended across medical or institutional or that we believe we're still going to manage to grow and outperform just because of the value propositions that we have. Happy to hear you contemplate that, because it seems like it kind of has to move the right at least pause. The other I wanted to ask you about was sort of the cadence of orders in the quarter, obviously continues to be very strong, but it also includes some pricing, a fair amount of pricing. Well, I think the one thing I would say as we look at the quarter, and just keep in mind that August is a big holiday period in Europe. And as we've gone into the fourth quarter, it's fairly consistent. So, there hasn't been any particular trend one way or another, just strong order growth. And, of course, it is both volume and price that we're seeing. But broadly speaking, I guess I'm interested in your thoughts about the vitality index or new product sales. But more to the point, last couple of years, you've kind of set internal targets for new product introductions, I think at around 50. And your company has been growing, as you pointed out, pretty -- at a pretty healthy clip and you are sharpening your focus on those high growth verticals. And secondly, maybe just to comment about going to market with new products. Maybe the last 12 months, you would probably say we were emerging or recovering from a downturn maybe over the next 12 months globally will be entering an economic slowdown. So, just maybe some thoughts about new product introduction pace. Well, I think with new products, this is an area where I think we've had really tremendous performance. And it really is a cross functional approach, right, that we think about what is the market opportunity, how do we differentiate, and then how do we launch through our supply chain and through our channel partners. So, you are correct to say, over the last couple of years, we've been able to launch about 50 new products. So, there -- we have differences in terms of the cycle time to create those new products. It could, but I think 50 is a good number for us. What we look to see is that the impact in terms of our cycle time, the revenue dollars, margin, all of those things, which is why we're seeing our vitality increase. And I would say, from a launch standpoint, I think we've gotten much more effective in the commercialization, because launching a new product effectively these days means that you have all the digital assets in place and not just that you launch a new product. And I think we've gotten really good with our channel partners and with our end users to engage them in our process so that we launch very effectively and have inventory on hand, et cetera so that we -- the time of revenue recognition from these new products is a lot faster. So, let's say we go into next year when things are slower. I don't think that changes our approach, because we're basing our new products on creating value and whether it's labor savings, or whether it's liquid cooling, which is energy efficiency. And this next question, I guess, I'm looking at slide 11 in the lower right-hand corner, where you list many of your recent acquisitions. So, I believe it was 3 percentage points of your growth this quarter came from M&A or inorganic sources. And maybe if there's one or two that are lagging, that would be helpful as well. Well, David, just to clarify, we had said that new products had driven three points of growth. And so, recall, overall, nVent has grown at 20%. So, our acquisitions are all outperforming our overall nVent growth rate. And so, what I would point to here is more from a -- if you look at CIS Global and WBT, these acquisitions have been focused on data solutions, data centers, so one of that infrastructure areas. When I look at our Vynckier acquisition, it's been focused on renewables and places like solar. So, we're seeing growth there. And I just use that as a -- to show that when we've done acquisitions, we know how to focus on high growth verticals, integrate them into our business and make them successful through our vertical and channel approach. We will continue to execute on our strategy to make nVent a top tier, high performance electrical company, delivering for our people, our customers, and our shareholders."
}