{
    "symbol": "CLFD",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-28 08:52:03",
    "content": " While revenue increased, sales bookings, again, continued their momentum in the first quarter of fiscal '22 resulting in a 1,036% year-over-year increase in our sales order backlog. Looking in more detail at net sales by our markets on Slide 8, our core community broadband market comprised 70% of our net sales in the first quarter of fiscal 2022. In Q1, we generated net sales of approximately $36 million in our community broadband, up 81% from the same period last year. In addition, for the trailing 12 months ended on December 31, 2021, our community broadband market net sales totaled $114 million, which was up 69% from the comparable 12-month period last year. In this market, we realized a 202% year-over-year increase in net sales to $9 million in the first quarter of fiscal 2022 and delivered a 92% increase in trailing 12-month net sales to approximately $25 million. On a trailing 12-month basis, net sales in our national carrier market totaled $13 million, which was down slightly from the comparable year ago period. Net sales in our international markets were up 87% year-over-year in the first quarter compared to the same period last year and up 160% year-over-year for the trailing 12-month period ending December 31, 2021, due to increased sales in our Canada and Mexico markets. As a percentage of net sales, operating expenses for the first quarter of fiscal 2022 was 19.4%, down significantly from 28.3% in the same year ago period. As a percentage of net sales, net income for the first quarter of fiscal 2022 was 20.3%, up from 11.7% in the same year-ago period and 16.4% in our fourth quarter of 2021. On the balance sheet side, we had $2 million in capital expenditures and increased our inventory $16 million to $44 million in the first quarter as we utilize our cash position to support the high demand for our products as represented in our sales backlog and also to invest in our production capacity and supply chain initiatives that Cheri will speak to in a bit. With the current visibility into our substantial order backlog as well as the pipeline behind it, we expect to deliver projected annual net sales of $176 million to $183 million in fiscal year 2022, representing growth of 25% to 30% over the fiscal year 2021 revenues. Our Q1 financial results set another quarterly record and our order backlog of $101 million, gives us the confidence to increase our guidance for the fiscal year."
}