{
    "symbol": "SWBI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-03 20:52:03",
    "content": " As you can see from the NICS data over the past 3 months, the firearms market, although still elevated and healthy with new entrants, has cooled significantly from the height of the pandemic surge, returning to more normal levels throughout our entire Q3 and with recent results from February, just released this week, now seems to be following the pre-pandemic historical demand patterns. Since the demand surge began in March of 2020, we have paid down $160 million of debt and are now debt free, bought back $200 million of stock, which reduced our outstanding shares by nearly 20%, paid nearly $20 million in dividends, invested nearly $40 million back into our business and today have a strong and healthy balance sheet with over $107 million in cash. Just in our third quarter, we launched our much anticipated M&P chambered and 10 millimeter, a brand-new CSX, a hammer-fired full metal frame conceal carry pistol that has been very well received and is in strong demand; our volunteer Rifle series, the next generation of our popular M&P 15 rifle line, and we also partnered with Vista Outdoor to co-launch their brand-new 30 Super Carry ammunition along with our very popular Shield EZ and Shield Plus chambered for this exciting new round with ballistics comparable to the extremely popular 9-millimeter yet with dimensions, which allow for increased round capacity in the same firearm footprint. While this represents a 31% decrease from the historic levels recorded last year, it is truly remarkable that we were able to achieve a $50.3 million increase in revenue this quarter versus 2 years ago on nearly the same number of units shipped. Operating expenses of $30.7 million for our third quarter were $1.4 million above the prior year comparable quarter, primarily due to $1.7 million of costs related to our planned relocation to Tennessee as well as increased marketing, trade show, travel and sales promotion costs, much of which is associated with a return to more normal business operations after pandemic restrictions began to ease."
}