{
    "symbol": "ADT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 19:02:07",
    "content": " ADT released our strong third quarter results this morning, driving top line growth 22% to $1.6 billion, and generating adjusted net income of $83 million or $0.10 per share. Our partnership's aspiration to bring state-of-the-art protection to State Farm's 14 million-plus customers, reducing the risk and severity of common perils for homeowners, delivering measurable net loss reductions for State Farm and accelerating subscriber and revenue growth for ADT. ADT's third largest owner is Google, who has committed an additional $150 million in success funds towards growing this new line of business. Our commercial segment has been affected by supply chain challenges more than any other part of our business, which you're seen partially reflected in our installation backlog growing by 25% year-over-year to $445 million. Our recurring monthly revenue, or RMR, subscriber base grew to $372 million or 4% year-over-year, a record for the company and a strong reflection of the benefits of our higher average pricing, growth initiatives and improved customer retention. First, a $158 million noncash charge associated with our tender offer, where the proceeds from State Farm's equity investment were used to repurchase an equal number of shares offsetting any dilution. Our consumer and small biz, or CSB segment, delivered total revenue of $1.1 billion, an increase of 7% or $75 million versus last year. Our Solar segment posted revenue of $179 million and an adjusted EBITDA loss of $6 million, driven by installation delays associated with a third-party lender's insolvency in the June quarter and cost inefficiencies from lower install throughput. Adjusted free cash flow is $145 million, up from $62 million last year on higher recurring revenue flow-through and lower net subscriber investments, partially offset by higher cash interest. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Ashish, if I could - one of my favorite charts is, to add on that what Jim was just talking about, if I rattle off the last four quarters for Commercial and EBITDA, which is one of the measures we look at for the business, $16 million, $24 million, $31 million, $34 million, so we love the shape of that chart. Please proceed with your question."
}