{
    "symbol": "BBCP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-10 22:21:06",
    "content": " Our US Pumping business increased 21% for the first quarter, driven by contribution from recent acquisitions and our continued market share gains in residential and infrastructure projects. In our UK segment, revenue increased 23% compared to the prior year quarter due to organic volume growth from the country's continued strong recovery from the impacts of COVID-19. In Eco-Pan our Concrete Waste Management business revenue increased 24% for the quarter, due to an improved sales approach and our team's ability to execute more in-person selling. Moving right into our first quarter 2022 results, we are pleased to report that revenue increased 21% to $85.4 million compared to $70.4 million in the same year ago quarter. Revenue in our US Pumping segment, mostly operating under the Brundage-Bone brand increased 21% to $63.1 million compared to $52.3 million in the same year ago quarter. Excluding the acquisitions of Hi-Tech and Pioneer, organic revenue growth for the quarter increased by approximately 8% to $56.4 million. For our UK Operations, operating largely under the Camfaud brand, revenue increased 23% to $12 million compared to $9.8 million in the same year ago quarter. Revenue in our US Concrete Waste Management Services segment, operating under the Eco-Pan brand increased 24% to $10.5 million in the first quarter of 2022 compared to $8.4 million in the same year ago quarter. Finally, adjusted EBITDA in the first quarter increased to $24 million compared to $22.4 million in the same year ago quarter. In our US Concrete Pumping business, adjusted EBITDA was $15.2 million compared to $15.3 million in the same year ago quarter, primarily due to inflationary pressures such as higher fuel and labor costs. In our UK business, adjusted EBITDA improved 20% to $3.3 million compared to $2.7 million in the same year ago quarter. For our US Concrete Waste Management business, adjusted EBITDA increased 33% to $4.9 million compared to $3.7 million in the same year ago quarter. As a reminder of our 2022, previously stated guidance, we continue to expect full year revenue to range between $360 million and $370 million, adjusted EBITDA to range between $115 million and $120 million, and free cash flow which we define as adjusted EBITDA less net replacing CapEx less cash interest to range between $55 million to $60 million. In the first quarter of 2022, we were pleased to report over 21% revenue growth across all segments and we continue to gain scale through organic growth, as well as strategic M&A. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}