{
    "symbol": "BBCP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-23 18:20:06",
    "content": " Looking at the full fiscal year of 2022, revenue increased 27% to $401.3 million, adjusted EBITDA increased 14% to $118.6 million, and net income increased $43.7 million to $26.9 million. In the fourth quarter of our 2022 fiscal year, revenue increased 31% to $114.9 million, compared to $87.8 million in the same year ago quarter. Revenue in our U.S. Pumping segment, mostly operating under the Brundage-Bone brand, increased 34% to 84.3 million compared to 63 million in the prior year quarter. On an as reported U.S. dollar basis, revenue improved 8% to $14.9 million, compared to $13.8 million in the same year ago quarter. Net income available to common shareholders in the fourth quarter increased 170% to $8.1 million or $0.14 per diluted share, compared to $3 million or $0.05 per diluted share in the same year ago quarter. Consolidated adjusted EBITDA in the fourth quarter increased 28% to 36.3 million, compared to 28.3 million in the same year ago quarter. In our U.S. concrete pumping business, adjusted EBITDA improved 29% to 23.4 million compared to 18.1 million in the same year ago quarter, driven by the throughput from our strong revenue growth. In our UK business, adjusted EBITDA was 4.7 million, compared to 4.2 million in the same year ago quarter, a strong revenue growth was offset by currency translation weakness and significant inflation from diesel fuel costs. For our U.S. concrete waste management business, adjusted EBITDA improved 42% to 7.6 million, compared to 5.4 million in the same year ago quarter, due to strong organic growth and revenue and disciplined operational efficiency. And the way to think about it, I mean, looking at the â\u0080\u0093 if we take the full-year, including obviously we have a business combination in there, the way you think about the 124 million investment for the full-year, there's like 36 million in replacement,   in organic growth and   in M&A."
}