{
    "symbol": "BBCP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-09 02:13:06",
    "content": " Before we begin, I would like to turn the call over to Mr. Slach to read the company's safe harbor statement within the meaning of the Private Securities Litigation Reform Act of 1995 that provides important cautions regarding forward-looking statements. Cody, please go ahead. Before we begin, I would like to turn the call over to Mr. Slach to read the company's safe harbor statement within the meaning of the Private Securities Litigation Reform Act of 1995 that provides important cautions regarding forward-looking statements. Cody, please go ahead. By reporting segment, revenue in our U.S. pumping business increased 33% in the third quarter, driven by our recent strategic acquisitions, strong share growth in our commercial end market, rate increases and pent-up industry demand brought about by the pandemic recovery. In our U.K. segment, in spite of foreign exchange headwinds, revenue increased 14% compared to the prior-year quarter due to organic growth given the country's continued strong recovery from the impacts of COVID-19. In Eco-Pan, our concrete waste management business, revenue continues significant organic growth with an increase of 26% for the quarter due to an improved sales approach and our team's ability to execute more in-person selling. We expect our East Coast strategy, which includes acquisition of Coastal, our greenfield in D.C., and our Eco-Pan synergies to generate approximately $25 million of revenue in fiscal year 2023 with similar margins as our existing business segments. Excluding the acquisitions of Hi-Tech and Pioneer, Organic revenue growth for the quarter increased 21% to $70.2 million. Revenue in our U.S. concrete waste management services segment, operating under the Eco-Pan brand, increased 26% to $12.8 million in the third quarter of 2022 compared to $10.1 million in the same year-ago quarter. To give an order of magnitude of the material impact of these inflationary pressures versus Q3 of last year, we estimate our gross margin in the third quarter was impacted by more than $3 million or approximately 330 basis points due to the higher cost of diesel fuel. The improvement was due to the strong contribution from acquisitions and organic revenue, as well as an approximate $7.4 million gain from the change in fair value of outstanding warrants this quarter versus Q3 of last year where we recorded a $260,000 gain. Excluding the impacts of the change in fair value of outstanding warrants in each comparable period, net income increased in the third quarter to $6.6 million from $3.8 million last year, or an improvement of approximately 74% year over year. In our U.S. concrete pumping business, adjusted EBITDA grew 21% to $22.4 million compared to $18.4 million in the same year-ago quarter, driven by our strong revenue growth. In our U.K. business, adjusted EBITDA was $3.9 million compared to $4.1 million in the same year-ago quarter as strong revenue growth was offset by significant inflationary pressures, primarily diesel fuel cost. For our U.S. concrete waste management business, adjusted EBITDA improved 6% to $5.7 million compared to $5.3 million in the same year-ago quarter. So, if you did 29% revenue growth in the third quarter, and that's inclusive of 30% revenue growth in your U.S. concrete business, are you saying that those are the kind of rates that you'd expect to see in the fourth quarter as well?"
}