{
    "symbol": "SI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-17 14:35:04",
    "content": " Turning to our core offerings, the Silvergate Exchange Network, or SEN, despite the significant decline in deposits, transfer volume on the SEN was $117 billion, an increase of 4% on a sequential basis, demonstrating that our platform continues to serve as critical market infrastructure for the digital asset industry. As we disclosed earlier this month, total deposits from digital asset customers declined to $3.8 billion during the quarter, compared to $11.9 billion in the third quarter and $14.1 billion in the fourth quarter of 2021. At the end of the fourth quarter, we held total cash and cash equivalents of $4.6 billion, which is in excess of deposits from digital asset customers. Looking ahead, we expect to sell a portion of these securities estimated to be $1.7 billion in early 2023 to reduce wholesale borrowings, which resulted in the recognition of impairment charge of $134.5 million in the fourth quarter related to the unrealized loss on those securities expected to be sold. The increase sequentially and year-over-year primarily resulted from $196.2 million impairment charge on developed technology assets we acquired earlier in the year, as well as increases in salaries and employee benefits attributable to a $3.7 million restructuring charge related to exiting the mortgage lending product during the fourth quarter of 2022. As a result of losses incurred during the quarter, we've established a deferred tax asset balance of $342 million and applied a 100% valuation allowance against this asset. So Dave, as far as that valuation allowance goes, so in the near-term, I mean it's -- as I said earlier, we've got a deferred tax allowance or deferred tax asset balance of $342 million driven by both, the losses that we've incurred in the fourth quarter and some of the accrued losses that we anticipate in 2023. And I think I've said, if I didn't say it on the -- in the Q&A session of the last call a couple weeks ago, I certainly addressed this question in follow-up calls, which is that your observation is correct when -- if you just zoom out -- and the way I frame it is, let's not make it specific to Silvergate, but let's just talk about the fact that in general banks like to have their core deposits in excess of their non-core funding, which is, you've alluded to, wholesale funding, whether that be short term borrowings or brokered CDs. I would just go back to everything I've said already, and I don't want to repeat it all for everybody, but we are managing the balance sheet to make sure that our customers know that they have access to a 100% of their deposits. But I think one thing that's different now is you've sold a lot of the duration in the balance sheet and looking ahead, it seems like the strategy of maintaining a lot of digital currency deposits are all in cash, presents a lot of downside interest rate risk, if we see rates kind of normalized back to -- well, something approximating what, you know, what we see in the current forward curve today. Maybe the last thing I'll say is that -- and I think it is important to highlight that while we expect to offboard some of our non-core customers, we do expect that if there's a negative impact to deposits fee income and send metrics, that it'll be less significant than you might expect because these are smaller relationships overall and tend not to use our core products."
}