{
    "symbol": "ICCC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-22 11:37:06",
    "content": " Additional information regarding these risks and uncertainties is available under the cautionary note regarding Forward-Looking Statements or better known as a Safe Harbor statement provided with last nightâ\u0080\u0099s press release and with the companyâ\u0080\u0099s quarterly report on Form 10-Q for the three-month and nine-month periods ending September 30, 2022, along with the companyâ\u0080\u0099s other periodic filings with the SEC. So a summary of the third quarter and year-to-date financial results are now available to you from last nightâ\u0080\u0099s press release and the details are available from the Form 10-Q for the quarter ended September 30, 2022 that we also filed last night. As we look at the longer periods of time, sales were up 6% or $858,000 and 15% or $2.56 million during the nine-month and 12-month periods ended September 30, 2022, respectively, compared to the same period during the prior year. Prior to our introduction of the newest extension of the First Defense product line in late 2017 and its popularity with our customers, namely Tri-Shield First Defense, annual production capacity of about $16.5 million was adequate to cover sales promptly without an order backlog. A new investment that is referred to as Project H in our SEC filings represents an investment in building, modifications and equipment to further increase our annual First Defense production capacity from the $35 million level to approximately $47 million during the second half of 2024 with options for further expansion. For example, by running at 80% of maximum capacity, Project H could increase our annual production output from approximately $27.7 million at the end of this year to approximately $37.3 million during the second half of 2024. EBITDA, which is an important non-GAAP financial measure for us given the high level of non-cash depreciation that we carry decreased to approximately $1.3 million during the nine-month period ended September 30, 2022, from almost $2 million during the nine-month period ended September 30, 2021."
}