{
    "symbol": "NYT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 13:10:34",
    "content": " Adjusted operating profit at The New York Times Group was approximately $149 million, an increase of $40 million compared to the prior year while The Athletic had adjusted operating losses of approximately $7 million. In the fourth quarter, the company added 240,000 net new digital-only subscribers and 240,000 net new digital-only subscriptions, with, as Meredith noted, continued strong growth in adoption of our bundled products. Total subscription revenues increased approximately 11.5% in the quarter, with digital-only subscription revenue growing nearly 23% to approximately $252 million. Digital-only subscription revenue grew primarily as a result of the large number of subscribers whose introductory promotional subscriptions graduate to higher prices, the new subscriptions we've added in the past year and the inclusion of subscription revenue from Athletic standalone subscriptions. Other revenues increased approximately 9.5% compared with the prior year to approximately $72 million primarily as a result of higher Wirecutter affiliate revenue, higher live event revenue and higher licensing revenue despite the expiration of the Facebook licensing agreement. Inclusive of the extra 6 days, adjusted operating costs were higher in the quarter by approximately 8.5% as compared with 2021, primarily due to the addition of costs associated with The Athletic while costs at The New York Times Group were approximately 1% higher. Cost of revenue increased approximately 11% as a result of the impact from the additional 6 days in the quarter, growth in the number of employees who work in the newsroom and higher print raw material costs. And general and administrative costs were higher by approximately 11% due to an increase in the number of employees needed to support the growth in our business over the last several years, higher enterprise technology costs and onetime building maintenance costs, partially offset by a lower incentive compensation accrual as compared with last year. Total subscription revenues are expected to increase 6% to 9% compared with the first quarter of 2022, with digital-only subscription revenue expected to increase approximately 13% to 16%."
}