{
    "symbol": "PNM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 12:51:17",
    "content": " Thank you, Vaishnavi and thank you everyone for joining us this morning for the PNM Resources first quarter 2022 earnings call. Joining me today are PNM Resources’ Chairman, President and CEO, Pat Vincent-Collawn and Don Tarry, our Senior Vice President and Chief Financial Officer. Before I turn the call over to Pat, I need to remind you that some of the information provided this morning should be considered forward-looking statements pursuant to the Private Securities Litigation Reform Act of 1995. We caution you that all of the forward-looking statements are based upon current expectations and estimates, and the PNM Resources assumes no obligation to update this information. For a detailed discussion of factors affecting PNM Resources results, please refer to our current and future annual reports on Form 10-K, quarterly reports on Form 10-Q as well as reports on Form 8-K filed with the SEC. Before we get started, I would like everyone to join me in congratulating the newly promoted Lisa Goodman, our new Executive Director of Investor Relations and Shareholder Services. We have all heard the phrase that not all heroes wear capes, and around here that holds true for everyone in our offices and in the field who are holding strong to our values and doing the right thing for our customers and communities. Earlier this month, we filed our Brief-in-Chief with the New Mexico Supreme Court that makes our arguments on the items previously laid out in the statement of issues. At TNMP, we received approval for our first 2022 semiannual transmission cost of service filing at the end of March, reflecting a $14.2 million annual increase. TNMP also made its annual filing for recovery of distribution investment in early April, and we expect to implement new rates associated with this filing in September. While these filings may seem fairly routine, our teams have consistently done a thorough job in making these filings to support the needed investments on our system, and we look forward to working with staff and other interveners for a successful outcome. At PNM yesterday, the New Mexico Commission issued an order in our decoupling docket originally filed back in 2020. Parties to the docket disagreed on the changes made by the legislature in 2019 that we believe were intended to allow for a full revenue decoupling, and we asked the Commission to provide their interpretation through a petition for Declaratory Order. Despite opinions expressed by the Commission’s General Counsel, the Commission issued an order specifying that decoupling only applied to changes in customer usage tied to utility’s approved energy efficiency plans. We will be reviewing the order to evaluate our options, which do include an appeal to the New Mexico Supreme Court. Turning to Slide 5, remember that the Four Corners appeal is part of our strategy to exit coal as we fully eliminate carbon emissions from our generation portfolio. And this transition is about more than just environmental benefits, it is also designed to reduce cost to customers and to support the communities impacted by the exit from coal. This was the intent of New Mexico’s landmark legislation, the Energy Transition Act that takes a comprehensive approach on moving the state forward into the clean energy future. As an owner and the operator of the San Juan coal plant, we recognized the significance of closing down such a major economic contributor for Northwest New Mexico and the surrounding area. Once the Supreme Court upheld our approval in January of this year, we were able to move forward with getting these funds where they were intended even earlier as the Energy Transition Act had contemplated. The constitutionality of the Energy Transition Act, particularly the portion governing recovery of undepreciated investment, was challenged first at the onset of the new law and then again through the appeal of securitization approval for San Juan. We filed with the commission to extend one of the San Juan units for 3 months to provide sufficient reserve margin throughout our summer peak, and they responded that this planned extension did not require approval. We had planned to file our next rate review in 2020, but delayed the recovery on our growing rate base, recognizing the impact of rate increase would have on our customers during the midst of a global pandemic. Then as part of our negotiations with parties in our merger filing, we agreed to further delay the filing until after December 1, 2022 again for the benefit of customers. We are now targeting the end of 2022 for a filing based on 2024 costs, reflecting the changes at San Juan. The commission has taken up a motion to look at separating the San Juan cost reductions from other rate updates, essentially asking us to continue delaying any new recovery while carving out the offsetting San Juan reduction. Our plans to exit coal are right for our customers, our communities, our environment and our shareholders. You can see on Slide 6, we worked over the past several months to develop a new PNM Pueblo Scholarship Endowment Fund, continuing our support for tribal communities and also our focus on education. I am going to pick up on Slide 8 with year-over-year results for the first quarter, where we saw an increase in each of our segments. We continue to see higher network demand and new customers, including the Western Spirit contract that began in December of 2021. In both utility segments, we saw load growth and colder temperatures also contributed to increases and offset came from higher depreciation and property tax expense associated with new investments. At corporate, the refinancing of debt at a lower rate in May of last year provided year-over-year savings for the first quarter. First, let’s turn to Slide 9, and I will show what we are seeing in terms of load growth across our service territories. Some of this growth is coming in a little slower than we expected as customers are experiencing a slower ramp up, although we still expect these load increases to materialize. During just the past month and a half, a bioscience company announced its plans to add 274 new employees. Northrop Grumman announced an expansion, and Universal Hydrogen was the big announcement with plans to invest over $250 million and hire at least 500 people over the next 7 years. Compared to the first quarter of last year, residential load is lower and commercial load is higher, which we expected as more individuals working from home last year have returned to offices. While oil prices have spiked, investments from the oil and gas industry has been more focused on new service to existing drilled wells as opposed to adding new drilling rigs. On Slide 11, we have included our capital investment plans, which support our earnings growth target of 5% through 2025. If these shifts have result in changes to our investment plans, our rate base expectations, we will provide those updates in future quarters. So, again, don’t want to get ahead of any kind of commission decision or the hearings, which will happen in May 22nd, 23rd timeframe. There are – as we have also discussed, there are ways for the commission to ask us to bring the case back. And those would not happen, I don’t think, until next year. We just kind of been where the key corporate sponsors of the United States Hispanic Chamber of Commerce first ever energy summit, we had a big Earth Day event. I think by the end of September, early October, they would provide a list of minimum five potential commissioners to the Governor."
}