{
    "symbol": "PNM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 17:19:12",
    "content": " I would now like to turn the conference over to Lisa Goodman, Executive Director of Investor Relations. Thank you, Melys and thank you, everyone, for joining us this morning for the PNM Resources third quarter 2022 earnings call. Joining me today are PNM Resources' Chairman and CEO, Pat Patricia Vincent-Collawn; President and Chief Operating Officer; Don Terry; and Senior Vice President and Chief Financial Officer, Lisa Eden. Before I turn the call over to Pat, I need to remind you that some of the information provided this morning should be considered forward-looking statements pursuant to the Private Securities Litigation Reform Act of 1995. For a detailed discussion of factors affecting PNM Resources' results, please refer to our current and future annual reports on Form 10-K, quarterly reports on Form 10-Q as well as reports on Form 8-K filed with the SEC. Good morning, everyone and thank you for joining us today on both National Jersey Friday and National Candy day. But since it's also a lobby lawyer day, we're going to let that slide. and ongoing earnings increased in the third quarter over the prior year, bringing year-to-date ongoing earnings to $2.54. As a result, we are raising our guidance for 2022 ongoing earnings to a range of $2.63 to $2.68. We are maintaining our guidance for 2023 at a range of $2.60 to $2.75 based on the continued strength at the utilities, offset by higher interest rates. In October, PNM filed its application for a big modernization plan to bring smart meters and other system upgrades to our customers. I'd like to thank the teams at San Juan, who operated the plant safely and efficiently to continue serving our customers through one last summer. On the regulatory front, the New Mexico Commission had ordered us to begin providing rate credits associated with the retirement of San Juan. The governor will select 3 commissioner appointees, who will begin their terms on January 1, 2023 and serve staggered terms of up to 6 years. As I've already mentioned, the shift out of San Juan significantly reduces the amount of coal in PNM's generation portfolio and marked significant progress in the full elimination of carbon emissions from our generation. Our first interim target was for a 60% reduction by 2025 and we have reached this target ahead of schedule, along with significant reduction in NOx and SO2 particularly important here in New Mexico, this closure also significantly reduces the majority of our freshwater consumption. We've also had a number of social highlights this quarter, as we were finally able to return to some community activities in New Mexico that hasn't happened in person for some time. Our employees coordinated and volunteered at the event and nearly 300 customers and families received over $100,000 in assistance. In recognition of Indigenous Peoples Day in October, we gathered to view a documentary about the recognition of Pueblo independence and the struggle for sovereignty by New Mexico's '19 Pueblos . I'll start on Slide 7, with our loan growth by service area with PNM first. And as temperatures soared in early July, PNM set a new system peak, our first since 2013, in terms of overall load, our growth has been coming in slightly lower than our original expectations. With these overall shifts in load, we have reduced our 2022 retail load growth expectations to 0.5% to 1.5%. Looking ahead to 2023, our expectation is for industrial customers to move through their delays and get back to the original forecast of 2% to 3%. Economic development efforts in New Mexico have increased the number of continuing inquiries coming from companies looking to relocate or expand in our state particularly from those who are looking to achieve their own clean energy goals, we play a key role in working with these companies to plan for their energy needs. And as a result, we anticipate growth in our system in the years to come. On demand-based load, usage from crypto mining customers has pushed growth up to double-digit levels. Without crypto mining usage, demand-based load has grown consistent with our expectations for the year of 2.5% to 3.5%. For this year, our demand-based load should come in around 14% to 16%. TNMP's peak demand, however, has grown nearly 40% since 2011 and hit its most recent peak at the end of September. As Pat mentioned, PNM filed its grid modernization plan with the commission in October. Legislation passed in 2020, encourages utility investments in grid infrastructure to meet the evolving needs of customers today and into the future. With these investments, customers will be able to gain insight into their own energy usage and make real-time decisions to impact their bills. Newer technology can also facilitate more demand response programs, something that has been requested by our commission. We requested approval for our investment plan by July 1, with implementation for a rate rider beginning in September which is after summer rates and customer bills are lower. This contract is a new transmission line, one of the only new lines constructed in New Mexico in decades. In addition to this contract, we've also seen higher overall system demand, resource constraints across the West have driven up market prices as well as demand for transmission to move energy across our grid. As power prices increase, we see greater interest in higher frequency, short-term transmission purchases to meet specific needs at the lowest cost. As demand remains elevated across the West, we expect to see a corresponding level of transmission activity. We will file this review with the 2024 future test year, so there will be 6 years of rate base investments to recover our original plans to file rate cases in 2020 and 2021 were deferred because of COVID and the merger proceedings. The rate base additions in this case will show steady investments in T&D infrastructure to improve red resilience, enhance reliability and support the transition to carbon-free resources, new substations, meters and power lines directly enhance service to our customers. In addition, PNM's participation in the Western energy imbalance market provides offsets to fuel costs and this year has benefited customers $23 million through September. As a result, PNM's customer bills have remained well below the regional and national averages. Through our July 2022, the average annual residential bill at PNM was $83 compared to our regional peers of $117. At TNMP, we have implemented new distribution and transmission rates for timely recovery of over $225 million of new rate base investments. As Don mentioned, load and weather increased earnings this year, particularly in Texas and the TCOS and DCOS rate mechanisms increased earnings on our capital investments at TNMP. Continued resource constraints in the West, increased market prices and FERC transmission demand at PNM in addition to earnings from the new Western Spirit transmission line. At PNM, lower market performance on our decommissioning and reclamation trust reduced earnings compared to last year. These long-term trust along with our pension, remain well funded despite the challenging market conditions in 2022 and we don't anticipate making any cash contributions to these trust in our current plan. We have also taken steps to improve our equipment standardization , identify critical equipment and where possible, we have put in earlier orders for long lead time equipment. At PNM Retail, we continue our transition out of coal plant investments and the rate base remains stable over the period. In addition, investments made associated with PNM's grid mod program are expected to be recovered through a rate rider, resulting in approximately 7% to 5% of our rate base growth being recovered through formula rates, annual filings or riders. At PNM, the proceeds from securitization bonds next year will reduce the need for new debt to fund near capital investments. At TNMP, we have been accessing the capital market each year and these issuances will be included in future rate filings. In the meantime, we have taken steps to mitigate the impact of rising short-term interest rates. We now have $850 million hedged, fixing the variable rate portion of our debt at an average rate of 3.5% through 2023. Beyond 2023, we are focused on investing in the business while being mindful of customer impacts and maintaining investment-grade credit metrics across our business. Over a longer-term horizon, we would look to optimize our financing needs based on current market conditions as we have done in the past. As I've indicated before, we intend to implement an ATM program before the year-end and you will see that filing come across shortly so that we have another tool available to meet future equity needs. Turning to Slide 15, I will wrap up with our forward-looking guidance. For 2023, a we are maintaining our range of $2.06 to $2.75. For the 2023 guidance that was maintained, can you walk us through what the impact was from the higher interest rates that were hedged that you highlighted in terms of the impact that was offset by other factors. I think one of the key things is our core demand growth continues at that 2.5% to 3.5% and the cryptos on top of that, so. Ryan, like we've said, we have identified up to $200 million of equity needs by the end of 2023. And -- and like I said before, we put an ATM in place to make sure that we have ample of tools in the toolbox. For the appendix, it looks like above normal weather year-to-date has been $0.11 favorable. Should we be thinking that weather is what really drives the midpoint to midpoint '22 guidance increase, whereas the higher non-weather-related demand is offsetting the interest expense headwind. I mean I think the core business, I think there's a couple of things, Jonathan. And then yes, those things are the strong utility performance, both at TNMP and PNM have helped to offset some of that corporate debt interest. And so of course, you're going to see the growth being a little lower between 2022 and 2023 as a result. Yes, Jonathan, it's actually included in the legislation -- so it provides that avenue to be able to file an earring. So assuming the commission upholds the legislation might be the question in New Mexico but hopefully, that will be I guess, a little better if -- or when the new commission. Yes, Jonathan, this will be heard in March, the time frame will be the hearings and decision next year under a new position. Ryan, no, there isn't really any update on that but the Attorney General has filed and spoken out that they believe that appeal is not based on anything. Just -- again, I know you guys are going to come up with this later. You had some equity needs in the plan or the legacy plan, I'll call it that. You've updated your CapEx and rate base through '25  here, 8% CAGR versus 7.7% earlier. Again, this is more of a cash flow question versus the earlier equity needs. And beyond that, we will optimize our financing plans based on market conditions. I mean just how do you think about that time line, both the filing and ongoing prosecution of both or all 3 efforts here as they come to some fruition here in '23, each of them. The rate case will be filed as we said, this year in December, it will go on the normal schedule where it gets expended in hearing set, et cetera, et cetera. And as we said in the merger agreement -- or excuse me, in the settlement with the interveners, we wouldn't file a rate case until December of this year. And then the -- the merger if the commission decides they'd like to hear it again and bring it back to the Supreme Court, that's kind of on their timetable. And conversely, the rate case or the grid mod wouldn't get a way of having the merger herd early in the year, so. In terms of the IRA, will it help -- yes, the issue is the rules haven't been written yet. And underestimate what a gain will be for your service territory and the opportunities that affords your customers, specifically when you are saying that. Climate in general -- I'm sorry, that wasn't a particular statement about us, so. I would like to turn the conference back over to PNM's CEO, Pat Vincent-Collawn for closing remarks."
}