{
    "symbol": "VAC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 12:45:27",
    "content": " As you saw in our earnings release last night, during the call â\u0080\u0093 during the quarter, we aligned the contract terms for vacation ownership sales across our Marriott, Westin and Sheraton brands resulting in the acceleration of $46 million of revenue. Despite higher inflation, the volatility in the stock markets and rising interest rates, we generated $483 million in contract sales in the third quarter, up 27% from the prior year with first-time buyers representing a third of our contract sales in the quarter. VPG remained elevated, increasing 1% year-over-year to $4,350, 26% higher than the third quarter of 2019, illustrating the continued demand for leisure travel and the relevancy of our core product offering, especially in today's inflationary environment. We continue to capitalize on strong demand for leisure travel during the third quarter, driving a 27% increase in year-over-year contract sales with tours growing 24% and VPG improving 1%. With strong growth in contract sales, adjusted development profit increased to $132 million, a 36% year-over-year improvement. Profit in our rental business was $24 million in the third quarter, unchanged compared to the prior year as a 17% increase in revenue per available key was offset by greater owner and preview package occupancy, which reduced transient rooms available to rent. As a result, adjusted EBITDA in our vacation ownership segment increased 19% to $255 million in the third quarter and we delivered adjusted EBITDA margin of approximately 33%. In total, excluding VRI Americas, adjusted EBITDA in our Exchange & Third-Party Management segment increased 18%, compared to the prior year and adjusted EBITDA margin increased 350 basis points to 58%. For the quarter, total company adjusted EBITDA increased 17%, compared to the prior year to $240 million and was 27% higher, compared to the third quarter of 2019. For the fourth quarter, we also expect adjusted EBITDA to grow roughly 8% at the midpoint, including a $6 million benefit related to the alignment, partially offset by a $5 million decrease due to the impact of Hurricane Ian. Looking forward, despite the economic backdrop and the volatility in the markets, fourth quarter tours are expected to approach 2019 levels for the first time since the pandemic began, and our 2022 full year adjusted EBITDA is expected to be the highest we've ever achieved. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}