{
    "symbol": "VAC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 15:06:06",
    "content": " As you saw in our earnings release last night, as a result of aligning the contract terms for our Vacation Ownership sales across Marriott, Westin and Sheraton brands last year, we recorded an additional $12 million of revenue in the fourth quarter. As a result, we grew contract sales by 12% in the fourth quarter compared to the prior year and expanded our adjusted EBITDA margin, illustrating the resiliency of our business model and the desirability of our product offerings. With the growth in contract sales, adjusted development profit grew 13% to $126 million and margin was, again, over 31%, 500 basis points higher than 2019. As a result, transient keys rented declined 10% in the fourth quarter, partially offset by a 3% increase in revenue per available key and rental profit in our Vacation Ownership segment declined year-over-year to $15 million. For the fourth quarter, adjusted EBITDA in our Vacation Ownership segment grew 12%, excluding the $7 million impact from the hurricanes with margin improving 110 basis points to nearly 35%. As a result, adjusted EBITDA increased 9% year-over-year, excluding the impact of the hurricanes and margin improved by 120 basis points, demonstrating the continued demand for leisure travel and the strength of our leisure-focused business model. We also completed our second timeshare receivable securitization of 2022 in the fourth quarter, issuing $280 million of notes at an overall weighted average interest rate of just under 6.6% and the 98% advance rate illustrates the market's continued belief in the strength of our owners. As we enter 2023, despite concerns about a potential recession, to date, we've not seen any weakness in demand in our forward bookings and are targeting 5% to 9% contract sales growth this year with VPGs continuing to normalize and tour growth largely coming from in-house and preview packages. While contract sales are expected to be the primary driver of growth in the Vacation Ownership segment, rental profit is expected to increase more than 10% this year, though we do expect it to be lower in Q1 compared to the prior year due to higher owner and preview utilization. As a result, we expect to generate $950 million to $1 billion in adjusted EBITDA this year implying 6.5% year-over-year growth at the midpoint of our guidance, excluding the $51 million alignment benefit we recorded in 2022. We generated more than $1.8 billion in contract sales, added more than 20,000 new owners in our Vacation Ownership business, grew interval membership by 21%, expanded margins across the board and returned more than $800 million to shareholders."
}