{
    "symbol": "VTGN",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-10 22:46:01",
    "content": " Among the milestones we achieved during the second quarter of fiscal 2022 was the initiation of PALISADE-2, the second major Phase 2 trial in our PALISADE Phase 3 program for PH94B in social anxiety disorder or SAD. Like PALISADE-1, PALISADE-2 is the U.S. multi-center, randomized, double-blind, placebo-controlled Phase 3 clinical study designed to evaluate the efficacy, safety and tolerability of our PH94B nasal spray for the acute treatment of anxiety in adults with SAD. In the coming quarters, we plan to initiate additional small exploratory Phase 2A study to assess PH94B's potential and populations suffering from anxiety disorders beyond SAD and adjustment disorder, where we believe the current treatment alternatives are inadequate. Regarding our other clinical stage drug candidates, PH10 nasal spray, and our oral pro-drug AV-101, we are on plan to initiate our Phase 2b study for PH10 as a potential standalone rapid onset treatment of major depressive disorder in mid-2022 and to initiate our drug, drug interaction study of the combination of AV-101 with probenecid near the end of this calendar year. We believe our current cash position is sufficient to advance our CNS pipeline well beyond the steady stream of potential data and regulatory catalysts from our PALISADE Phase 3 program for PH94B and SAD, not only in calendar 2022, but into calendar 2023 as well as other important clinical opportunities across our pipeline. For the second quarter of our fiscal year 2022 ending on September 30, 2021, VistaGen recognized approximately $0.4 million in non-cash sublicense revenue from the $5 million upfront payment that we received in the second quarter of fiscal 2021 related to our PH94B development and commercialization agreement with AffaMed Therapeutics. This increase results primarily from conducting our PALISADE Phase 3 program for PH94B and SAD with the continuation of PALISADE-1 and the initiation of PALISADE-2 and PALISADE long-term safety study, as well as the initiation of our Phase 2A study of PH94B for the treatment of adjustment disorder with anxiety, while we continued nonclinical development and outsourced manufacturing activities for both PH94B and PH10. Salaries and benefits expense for the quarter ended September 30, 2021 increased by approximately $1.6 million versus the expense for the comparable prior year quarter, primarily due to the hiring of additional senior management and other personnel focused on clinical operations, outsourced manufacturing activities, and regulatory affairs. Please proceed with your question. Please proceed with your question. I'll let Mark add a little more color to that, but our purpose here remember these are small exploratory Phase 2A studies to try to get some information to be able to assess potential to move into Phase 2b as we want to see additional indications for PH94B as we build on top of what we hope to be the initial first and foremost focus in social anxiety disorder. Please proceed with your question. Please proceed with your question. Shawn maybe – or Mark, maybe you guys can talk a little bit about your thoughts on the mental health space, particularly what happened after the compass readout the other day and the views of the space around the need for safety for some of these drugs, it was a big deal on the psychedelic side, but there's a lot of positive safety aspects around 94B and the drugs that you're developing. Please proceed with your question."
}