{
    "symbol": "VTGN",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-12 19:18:11",
    "content": " As I've mentioned many times before, at our core, we're change makers, a team at VistaGen that's committed to improving the mental health of individuals around the world, with new medicines that go beyond the inadequate current standard of care for anxiety and depression disorders. Against the backdrop of the substantial progress, we made throughout fiscal 2021, and now through the first quarter of this fiscal year, we are confident and excited about the potential of our CNS pipeline to make meaningful changes in the lives of those impacted by mental illness related to anxiety and depression. Our most significant milestones during the quarter was the initiation of our PALISADE Phase 3 Program led by PALISADE-1, our US Phase 3 multicenter, randomized, double blind, placebo controlled clinical study, to evaluate the efficacy, safety and tolerability of PH94B for the acute treatment of anxiety in adults with social anxiety disorder or SAD. During the quarter, we advanced significantly on our plan to initiate by calendar year end several additional clinical studies in our PALISADE Phase 3 Program to enable the eventual submission of a PH94B new drug application to the FDA, should the program be successful. We also made significant progress with the FDA to enable the initiation of our exploratory Phase 2a clinical program for PH94B, program that will include activity and at least for additional anxiety indications, the first of which will be adjustment disorder with anxiety. VistaGen recognize $0.4 million in sublicense revenue pursuant to its PH94B development and commercialization agreement with EverInsight therapeutics, which is now AffaMed therapeutics, during the first quarter of fiscal year 2022, which ended on June 30, 2021, compared to none in the first quarter of fiscal year 2021, ending on June 30, 2020. This increase is primarily due to expenses related to the commencement of our PH94B PALISADE phase 3 program, Notably, the initiation of the PALISADE-1 phase three clinical trial, but also including expenses for the preparation for and execution of other clinical and non-clinical development, outsource manufacturing and regulatory activities for both PH94B and PH10, which in aggregate accounted for increased spent expenses of approximately $2.7 million during the fiscal 2022 first quarter. Salaries and benefits expense for the quarter ended June 30, 2021. increased by approximately $1 million versus the comparable prior year quarter, primarily due to the hiring of additional senior management and other personnel focused on clinical operations, outsourced manufacturing activities and regulatory affairs. Our net loss for the first quarter of fiscal 2022 ended on June 30th, 2021, was approximately $7.7 million versus a net loss of $3.1 million for the comparable period of fiscal year 2021."
}