{
    "symbol": "VTGN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-23 22:14:05",
    "content": " During the second half of calendar 2022, we anticipate reporting key topline data readouts in our PALISADE Phase III program for PH94B in Social Anxiety Disorder, or SAD as well as the expansion of other important clinical programs moving us closer to our goal of transforming the way that anxiety and depression are understood and treated One Mind at a Time. Several recent advancements provide opportunities to unlock shareholder value and our PALISADE Phase III program for PH94B in SAD, we reported a major clinical milestone yesterday with the last patient's completion of the study protocol in our PALISADE-1 trial. This increase is primarily due to the preparation, initiation and continuation of the various clinical trials in our PALISADE Phase III program for PH94B in SAD as Shawn just described as well as the preparation and advancement of our exploratory Phase IIA study of PH94B for treatment of adjustment disorder with anxiety and the continuing non-clinical and pre-clinical development and outsourced manufacturing activities for both PH94B and PH10, as well as the hiring of multiple senior management personnel during fiscal 2022. And Michael isn't just a nominal PI, Michael has personally interacted with each of the PIs in the study and that's been very valuable not only for the PIs, but certainly gives us a lot of confidence that the things that we've done in terms of setting up and designing and executing this study as the – really the most appropriate study for a drug with the unique properties that we think PH94B has in the acute treatment setting. And at the end of that assess whether we think there's sufficient basis to move forward, and we'll just have to see what the data show and have some further discussion about whether it makes sense to move into – there's multiple different neurological indications, where that might be appropriate based on preclinical work we've done in levodopa-induced dyskinesia in pain, in even possibly epilepsy, MDD."
}