{
    "symbol": "SPPI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 19:20:06",
    "content": " After the speakers’ presentation, there will be a question-and-answer session. I would now like to hand the conference over to Mr. Michael Grabow, Senior Vice President of Corporate Strategy and Operations. Joining me on the call today from Spectrum Pharmaceuticals will be Tom Riga, President and CEO; and Dr. Francois Lebel, Chief Medical Officer. Before we get started, I would like to reference the notice regarding Forward-Looking Statements included in today’s press release. Such forward-looking statements necessarily involve known and unknown risks and uncertainties, which may cause actual performance and financial results in future periods to differ materially from any projections of future performance or results expressed or implied by such forward-looking statements. With that, let me hand the call over to Tom Riga, CEO of Spectrum. The year is off to a strong start as we anticipate FDA approvals later this year for our late stage assets Poziotinib and eflapegrastim, both are under active review with the agency. In the first quarter, we continued to make progress on our core business objectives, which are one, gaining FDA approvals and further advancing our two late stage assets. Two, streamlining our company and optimizing our cash burn and three, ensuring we are prepared to successfully launch both products. Our NDA is under active review, and the agency has set a PDUFA date of November 24, 2022. With the initial indication for the treatment of patients with previously treated locally advanced or metastatic, non-small cell lung cancer harboring HER2 exon 20 insertion mutations. This product is a fast track designation, and there are currently no approved treatments for this indication. In the first quarter, we initiated a global confirmatory study in support of our application. Additionally, we presented positive frontline data at the AACR meeting, which is our second successful cohort in their HER2 exon 20 insertion mutation space. Finally, we announced today that the FDA plans to host in ODAC meeting in connection with its review of the Poziotinib NDA. In the quarter, the FDA accepted our resubmitted BLA and assigned a PDUFA date of September 9, 2022. Furthermore, we have kicked off our commercial readiness efforts and our enthusiasm to enter this market remains high. Our commercial leadership infrastructure is in place and ready to engage key customers through purchasing organizations and third-party payers to ensure we optimize the launch trajectory, if approved. We began the strategic restructure of the organization in January, and we continue to evaluate ways to optimize our cash burn and streamline our operations, while investing in our future success. Additionally, we announced last week that Ms. Brittany Bradrick has also joined our Board of Directors and will serve as our audit chair as of the second quarter. Ms. Bradrick is a seasoned executive with 25-years of experience in the life sciences sector, including M&A, investment banking, finance, strategy and corporate development. Given this, I would like to review our financials for the quarter. SG&A expenses were 9.9 million in the quarter, compared to 14.3 million in the same period of 2021, driven by our recent restructuring. The net loss for the quarter was 15.4 million or $0.09 per share, compared to net loss of 35.7 million or $0.25 per share in the comparable period in 2021. On a non-GAAP basis, the net loss was 9.6 million or $0.06 per share, compared to a non-GAAP net loss of 29.4 million or $0.20 per share in the comparable period in 2021. We ended the first quarter with approximately 89.2 million in cash plus marketable securities, compared to 106.6 million at December 31 of 2021. As previously reported, we received a strategic equity investment from Hanmi in January of $20 million, which is included in the ending balance. With that, I will now turn the call over to Dr. Lebel for a more detailed update on our political development progress. The filing is based on our positive data from Cohort 2 of ZENITH20 clinical trial, which consisted of patients with locally advanced or metastatic non small cell lung cancer, harboring HER2 exon 20 insertion mutation with fail previously. We believe Poziotinib has the potential to be the first to market for this specific indication, an area of great unmet medical need. Following progression on docetaxel patient will be allowed to cross over into the Pozi arm the primary endpoint will be progression free survival, with overall survival objective response rate, duration of response, disease control rate and safety at secondary objectives. Separately, I would like highlight that are Pozi clinical pro has now achieved two positive cohorts as demonstrated more recently by the positive results of Cohorot 4 and first line patients that were presented in March at the ESMO TAT Congress by Dr. Sun from the British Columbia Cancer Center. This data from the ZENITH20 study included a total of 70 patients, who receive 60 milligram per day of oral poziotinib. The first 48 patient of the cohort received 16 milligrams once daily, and an additional 22 patients receive 8-milligram BID, the primary endpoint was ORR evaluated centrally by an independent image review committee using resist 1.1 criteria. Pozi met the primary endpoint in these seven new frontline patients with an ORR of 41%, including one complete response. And then a valuable patient ORR of 50% safety profile was consistent with the TKI class, notably on target adverse events were reduced with BID dose. Treatment related grade three or higher adverse events were as expected, with rash, stomatitis, diarrhea and paronychia being the most common. Now, let me shift to a presentation at the recent AACR meeting in New Orleans a few weeks ago. These new data will provide further evidence of a correlation between a decline and ctDNA with a clinical response to Pozi treatment and cover a longer observation therapeutic, so stay tuned. As you can see, we continue to make solid progress on our two late stage development programs and regulatory strategy. Your line is now open. So the, obviously, we are quite confident that we can be docetaxel. The extent of the establishing the superiority was, you know, given to you by the number of patients and parameters that I have declared to you. And there is small retrospective study, you know, the average PFS, in the order of four months or less. I can’t recall there was another aspect to your question, I believe. So, obviously, the language of the fancily enroll is does not actually have a definition. It is a rare disease and we will be able to demonstrate that we have made a very strong effort to recruit patients that we are anticipating adding potentially in excess of 100 sites globally, and we are actively engaged in opening the site as we speak. So we think we will be able to, demonstrate by the time at PDUFA date that we have made tremendous commitment and progress to bring a new drug with benefits for patient who currently have no drugs to rely on. So this is the second line or more study and it will be essentially platinum base core initially when they fail and plus or minus checkpoint inhibitor, because there is depending on which country you are talking about and within U.S. practice differ and we will allow potentially other with a proper washout period additional type of therapy, including experimental therapy. Thanks for taking my questions. Hey Tom, thanks for taking my questions. So maybe just switching to eflapegrastim, we have talked many times in the past about the changing market and the G-CSF. Overall share of biosimilars versus the innovator product sits at 40% today, really with two new drivers of that penetration. We really believe today that having a novel agent that is not a biosimilar that we can bring customers, payers and patients, a solution that is not restrictive to some of the inherent realities of the reimbursement dynamics, as well as some of the patient offerings we can bring puts us in a position to be competitive. I mean, ultimately, we need to get the product approved, which that is our internal focus. But when we think about this commercially, we remain enthusiastic. And we believe that the core leadership infrastructure that we have kept, even post our restructuring carries a lot of the industry’s best talent and we think that is scalable, should we need it. But I think when you look at Salesforce sizing today, and oncology, there is a lot of consolidation in the business as well as some post-COVID realities from access standpoint that we believe we could get done our launch in a very lean and efficient manner. But our base commercial infrastructure will be our first line of defense as we engage both group purchasing organizations and large customers out of the gate to get the product off the ground, should it get approved. And just a question on the restructuring and you had mentioned the, I guess the charge back to Hanmi. As I mentioned in my prepared remarks, not only did we solidify an equity investment from Hanmi, but there were also changes to the licensing and the supply agreement. And this is ultimately some of the fruits of those agreements, which enables us to free up near-term cash flows from just a supply standpoint. So that that reversal, I think, is the first you are seeing of some of the fruits of the second half of that statement on the licensing and the supply agreement. As it relates to run rate, so I think if you think about the first quarter, it is usually our highest burn quarter. So if you look period-over-period, it was 34.5 million or so a year ago, and today we announced 30.3 million, that has one time charges in it. So the impact of the FTE change, I think will continue to show itself in subsequent quarters. But I also think as we get to our action dates, and we start launching these products, you will see a rise in the back half of the year in the SG&A line just to prepare an execute on those on those launches. Thanks Tom and perhaps the last question, just regarding the ODAC meeting. So here is how we are thinking about it, we are looking forward to the opportunity to bring this to an advisory committee and really share the full benefit that Pozi can bring in this high area of unmet need. So if you think about even at the acceptance, we had made some statements that the FDA had questions about the status of the confirmatory study, as well as questions on to dose. And today we announced the PINNACLE study, which has a dose of 8-milligrams BID, which is different than the 16-milligram QD registrational data. It is very logical that the FDA, could have additional questions on dosing and wanting to hear from industry experts on how to bring that issue to resolution. But that is us looking at where we have been, what the discussions have been with the agency. But, as the date gets closer, we will gain more clarity from FDA and obviously be prepared to represent the full NDA. Your line is now open. I was just curious between now and ODAC, how much we will learn from your ongoing studies and what might be the data you are able to present to the panel on the 8-mig and then how do you how do you reconcile you know a full approval and a different dose with accelerated approval with a sort of different delivery schedule. And this is my final question was on the path for first line approval, given you have some data there in BID dose. Mayank, you got a couple of questions in there. So the registration or the filing is based on Cohort 2, as you mentioned is 16-milligrams given QD and the PMR is at 8-milligrams BID, so both are 16-milligrams per day. So I think that conundrum that you mentioned, is likely a topic that FDA would like to hear from industry experts at the ODAC panel. Yes, so exactly, the NDA is based on core to 16-milligram and taken once per day. At during the early phase of discussion with the agency, we have indicated to them that we had gathered additional data in Cohort 5, and that we had explored - and it was exploratory, we had looked at different dose, different frequency, et cetera. And, basically, ask them if they would be interested in seeing this data or not. And it is always very sensitive, because if once you seek an indication, you don’t want to add additional data, unless it is asked by the FDA. So thankfully, the agency probably out of concern or of interest for patients felt okay, please send us the additional data. Essentially, we have provided them the data and during the 120-day update as well, we provided all the updates, it is pretty clear that when you give dosing and BID, we can improve the safety profile, which is obviously of great interest to physician and their patient and the FDA, for that matter. 60-milligram as Tom has said it is safe and effective on the basis of what we have submitted in the NDA, but the agency may be interested in getting the opinion of various academic experts and industry et cetera at the ODAC. We are obviously thrilled with the second cohort specific to HER2 exon 20 insertion mutations, demonstrating positive results. But our aspiration for the asset extends both beyond just the initial indication, but also beyond even the frontline in HER2 evaluating rational combinations and others. And then actually, the question I had was also on ACR data and some of the circulating tumor DNA work you are doing. But this is data that has been accumulated in the scientific literature that you can use or possibly can use a biomarker that is easy on the patient, meaning it is a peripheral blood sample, as opposed to an invasive tissue diagnostic or biopsy and you can actually or potentially monitor a therapy. And the first thing you have to establish is, did they correlate the impact of therapy modified ctDNA level, and that is kind of what we have shown as ACAR. And that could become a very important tool for us, as we go further in development with our program, especially in combination therapy. Because you have when you do combination, you have a lot of dosing question, other matters, you got to resolve and any early biomarker that gives you indication of activities always very helpful. So it is an expletory design, but nonetheless can become very important in the future. Actually, just maybe a follow-up on the you know, that reminds me of the Dr. Heymach’s presentation from last year. Thanks for taking my questions. Later this month, we will also be attending Jefferies and JMP in New York. And we look forward to speaking to many of you then and if there is any other questions in the meantime, always feel free to reach out."
}