{
    "symbol": "CSWC",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-02 12:45:06",
    "content": " As of the end of the quarter, our equity co-investment portfolio consisted of 44 investments with a total fair value of $89.5 million, which included $26.6 million in embedded unrealized appreciation or approximately $0.97 per share. Our equity portfolio, which represented approximately 9% of our total portfolio fair value as of end of the quarter, continues to provide our shareholders the participation in the attractive upside potential of these growing lower middle market businesses, which will come in the form of NAV per share growth and special dividends over time. As illustrated on slide 10, our on-balance sheet credit portfolio as of the end the quarter, excluding our I-45 Senior Loan fund, grew 9% to $865 million as compared to $794 million as of the end of the prior quarter. Capital committed this quarter included $136 million in first lien senior security debt committed to six new portfolio companies, including four in which we also co-invested a total of $3.1 million in equity. As of the end of the quarter, the total portfolio of fair value was weighted to 85.4% to first lien senior secured debt, 5.1% of second lien senior secured debt and 0.1% to subordinated debt, and 9.4% to equity co-investment. For the quarter, our investment portfolio generated total investment income of $22.5 million, producing a weighted average yield on all investments of 9.1%. As of the end of the quarter, there were four loans on non-accrual with an average fair value â\u0080\u0093 with aggregate fair value of approximately $16 million, representing 1.6% of the investment portfolio at fair value. On July 1, 2022, one of the non-accruing loans with a fair market value of approximately $13 million was restructured in the transaction that resulted in Capital Southwest equitizing a portion of its debt, providing Capital South led significant participation in the company turnaround and reinstating the remainder of our quarter-end debt hold as debt on the new company. Outside of the special dividend, the primary driver of the NAV per share decrease for the quarter was investment portfolio depreciation, which consisted of $5.9 million of depreciation at I-45, most of it was mark-to-market quote activity in the syndicated market."
}