{
    "symbol": "CSWC",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-31 15:12:03",
    "content": " In addition, due to the continued excess earnings being generated from by our floating rate debt investment portfolio, our Board of Directors has again declared a supplemental dividend of $0.05 per share for the March quarter, bringing total dividends declared for the March 23 quarter to $0.58 per share. On the capitalization front, we raised a total of $104.3 million in gross equity proceeds during the quarter at a weighted average price of $17.99 per share, or 109% of the prevailing NAV per share. We believe our track record of consistently growing our dividend, the solid performance of our portfolio, as well as our company's sustained access to the capital markets has demonstrated the strength of our investment and capitalization management strategies, as well as the absolute alignment of our decisions with the interest of our shareholders. And so the end of the quarter, our equity coinvestment portfolio consisted of 48 investments with a total fair value of $112.1 million, which was 60% over our cost, representing $41.8 million in embedded unrealized appreciation of $1.21 per share. Our equity portfolio, which represented approximately 10% of our total portfolio at fair value is at the end of the quarter continues to provide our shareholders participation in attractive upside potential of these growing lower middle market businesses, which will come in the form of NAV per share and supplemental dividends over time. As illustrated on slide 10, our on balance sheet credit portfolios of the end of the quarter, excluding our I-45 senior loan funds, grew 10% to $990 million as compared to $903 million as of the end of the prior quarter. Based upon our current UTI balance of $0.34 per share, the ability to grow UTI each quarter organically by overrunning our dividend and harvesting gains from our existing $1.21 per share in unrealized appreciation on the equity portfolio, we are confident in our ability to continue to distribute quarterly supplemental dividends for the foreseeable future. The company's NAV per share at the end of the December quarter decreased by $0.28 per share to $16.25 cents, representing a decrease of 1.4% before giving effect to the supplemental dividend paid for the quarter. The primary drivers of the NAV per share decrease for the quarter included $8.5 million of net unrealized depreciation on the on balance sheet debt portfolio, $1.2 million, unrealized depreciation on the equity portfolio, and $3.3 million of unrealized depreciation on the I-45 portfolio. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}