{
    "symbol": "XPER",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 22:32:12",
    "content": " While the macroeconomic environment continued to be challenging throughout the second quarter due to supply chain challenges and broader inflationary trends, our financial results were good and demonstrate the strength of our business model and market positions, factors that will have a long-term positive impact as we move forward on an independent basis as separate product and IP companies. Total revenue for the second quarter was $234 million, an increase of 5% from $222 million in the second quarter of last year due to contributions from both the IP and product businesses. IP revenue in Q2 was $108 million, up 6% from the second quarter of 2021, principally due to upfront revenue received as part of our long-term renewal agreement with a leading consumer electronics and OTT service provider. Revenue in our product business was $126 million, up 5% from $120 million in the year ago period, primarily attributable to the resolution of a long standing contract dispute with a mobile imaging customer, reaffirming the value of our imaging technology. The Pay-TV product category, which represented 48% of total product revenue in the quarter, generated $60 million of revenue, down $6.8 million compared to the year ago period as healthy growth in our IPTV service offerings was more than offset by a one-time metadata deal that occurred in the year ago period as well as from churn in our classic guides business. Moving to the consumer electronics category, revenue of $39 million in the quarter accounted for 31% of total product revenue, up $16.8 million from the year ago period. And for the final product category, Media Platform, revenue for the second quarter was $5.5 million, down $2.5 million from the year ago period as growth in monetization was more than offset by a contract renegotiation for stream 4k that created a one-time benefit in the second quarter of 2021. Non-GAAP adjusted operating expense was $123.6 million, up 14% from Q2 2021 due primarily to higher personnel costs, including from the MobiTV acquisition last year, and from increased personnel costs in the IP business as we prepare for separation. We are increasing annual non-GAAP operating expense by approximately $50 million at the midpoint to a range of $510 million to $530 million and are lowering the top end of our operating cash guidance by $10 million to a range of $210 million to $230 million, due primarily to the impact of rapidly increasing interest rates on our variable rate debt, along with the incremental debt from the Vewd purchase, we are increasing our interest expense estimate by $8 million to approximately $44 million for the year. So, what we've built and where we're going is -- is a Linux based operating system and media platform that will enable TV manufacturers to have a best-in-class UX experience, great personalized content and discovery along with access to a monetization platform that down -- as we move downstream, and those units get in place, we think will generate meaningful revenue, not only for us, but for the TV manufacturer."
}