{
    "symbol": "GEF",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-02 13:34:04",
    "content": " Actual volume trends in both businesses came in below our low original expectations, and the net impact was a challenging first quarter result relative to fiscal 2022, though it was the second best first quarter in Greifâ\u0080\u0099s 145-year history. Paper packaging's first quarter of sales declined by approximately $50 million in the quarter due to lower mill and converting volumes throughout the quarter, despite year-on-year pricing tailwinds. The first quarter of 2023 was Greifâ\u0080\u0099s second best start to the year ever, bested only by our record Q1 â\u0080\u009822, which included the $12 million EBITDA contribution attributed both to FPSs, which was sold in April of 2022. Net sales were down $293.3 million in the fiscal first quarter, driven primarily by volume declines and the impact of $89.4 million of prior year net sales attributable to the FPS business, which we divested last April. Gross profit declined by $38.1 million, primarily due to lower volumes and the impacts of the previously mentioned steel price cost headwinds in our GIP business, which we expect will abate in the second half, as price trends have stabilized. Adjusted EBITDA was $164.5 million in the quarter, down $32.3 million year-over-year, though only down approximately $20 million when factoring in the prior year contribution of FPS, with consolidated EBITDA margins of 12.9%, a 30-basis point improvement versus Q1 22. On an overall basis, we've reflected volume impact in the low end guidance of $42 million in our GIP business, and $62 million in our PPS business, relative to the midpoint of our prior guidance range inclusive of 1Q results. As mentioned in Oleâ\u0080\u0099s opening remarks, even with the $300 million acquisition of Lee Container, and a slower first quarter, we are still towards the low end of our target leverage ratio range. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}