{
    "symbol": "CCS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 20:05:05",
    "content": "  During the fourth quarter, we focused our sales efforts and incentives towards available homes with near-term deliveries to monetize these homes, even though they carried lower margins due to inflated direct construction costs, given their start dates earlier in the year. As a result of the efforts, we generated $382 million of operating cash flow during the fourth quarter and reduced our net debt to net capital ratio down to 23.5%, the lowest year-end level in our history as a public company. Revenues from home sales were $1.2 billion, the highest quarterly level in our history; while our average sales price increased by less than 1% on a year-over-year basis to $397,000 consistent with our goal of building affordable homes. Consistent with our strategy of prioritizing the sale of complete and completing inventory, we expect our margins in the first quarter of 2023 will be consistent with those of the fourth quarter of 2022 as the homes delivering will be burdened with similar elevated construction costs, given their start dates earlier last year and higher incentives than historical norms. We have seen improvements in our direct costs throughout the construction cycle, which declined by roughly 9% in the fourth quarter, versus the high watermark in the second quarter of the year, an average of approximately 16,000 per home. Going forward, our strategy remains consistent: Continue to find market prices for completed and completed homes that were started earlier last year with elevated costs, manage land spend and generate operating cash flow that will be reinvested in new homes with improving margin profiles that will be started in the first half of 2023 and beyond. During the fourth quarter of 2022, net income was $79.5 million compared to $165 million in the prior year quarter or earnings per diluted share of $2.47 compared to $4.78 in the year ago period. At quarter end, our backlog of sold homes was 1,810 valued at $671 million, with an average price that had decreased by 8% year-over-year. As we discussed on our last quarterly call, this reduction in margin percentage was expected and primarily resulted from our strategy of generating cash and reducing our leverage profile by focusing our sales efforts and incentives on near-term deliveries, even though they carried elevated construction costs due to their start dates earlier in the year. During the fourth quarter, financial services captured 65% of the closings, generating $23.1 million in revenues compared to $31.2 million in the prior year quarter, primarily due to forward commitments entered into in prior quarters, fewer loan originations and increased competitive pressures. As a reminder, in the first three quarters of this year, we invested  in repurchasing 2.3 million of our common stock at an average share price of approximately $52.32 or a roughly 23% discount to our year end 2022 book value of $67.67 per share. This expected decrease is due to the fact that we delayed community openings, started fewer homes in the second half of 2022 as the market softened and successfully executed in the fourth quarter on our strategy of prioritizing the sale of near-term deliveries, leaving us with a limited number of completed spec homes."
}