{
    "symbol": "CCS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 21:56:04",
    "content": " 03:21 These home deliveries produced record first quarter pretax income of $189 million and a pretax income margin of 18.6%, a 560 basis point increase from the prior year quarter and our eighth sequential quarter of improvement. Net income in the first quarter increased 40% to $142.5 million or $4.20 in earnings per diluted share, both first quarter records. Our backlog at quarter end consisted of 5,247 sold homes valued at $2.2 billion, increases of 28% and 37%, respectively, both company records. 11:43 For example, in the first quarter, we achieved adjusted gross margins of 29.5%, our seventh sequential quarter of improvement, a pretax income margin of 18.6%, our eighth sequential quarter of improvement and a return on equity of 33.7%, our 12th sequential quarter of improvement, all company records. During the first quarter of 2022, net income increased 40% to a first quarter record $142.5 million or $4.20 per diluted share, compared to $101.7 million or $3 per diluted share in the prior year quarter. The business captured 77% of the closings and contributed $11.2 million in pretax income, compared to $15.3 million in the prior year quarter. 15:12 We ended the quarter with a strong financial position, including $1.8 billion in stockholders' equity, a 33% year-over-year increase, $1.1 billion in total liquidity, $254 million in cash and no borrowings outstanding on our $800 million unsecured revolving credit facility that does not mature until April 2026. 16:52 Considering our first quarter results, backlog homes under construction and our current development pipeline schedules, we are reaffirming our 2022 guidance of deliveries in the range of 11,500 to 12,500 homes, home sales revenues to be in the range of $4.3 billion to $4.9 billion and ending selling community count to be in the range of 240 to 250 selling communities with the clear majority of our new community openings occurring in the third and fourth quarters. Second quarter, probably going to experience a backlog conversion that's similar to what we had in the first quarter and last year, so somewhere between that 50% and 60% backlog conversion is where I'm going to be coming in, in the second quarter."
}