{
    "symbol": "CACI",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-26 11:49:04",
    "content": " I think weâ\u0080\u0099re on the right path to get onto that on-ramp at the right time and weâ\u0080\u0099re really working on expanding into--you know, already into future related markets that are going to include some airborne systems, potted and non, and then really working on pulling the synergies together between LGS and our SA Photonics business. Look, let me start off with saying that weâ\u0080\u0099re really happy with our first half performance - I mean, 5% organic, 10.4% adjusted EBITDA margin, so I like how that sets us well going forward. Weâ\u0080\u0099re not in these high growing, very important markets by accident, so I like the fact we have a full government fiscal year â\u0080\u009923 budget that supports where we want to head, and weâ\u0080\u0099re going to continue to focus on a long term strategy that delivers consistent value, no matter what that commentary happens to be. I really want to focus on this year and finish strong, get the share buyback executed, look for places where we still think weâ\u0080\u0099re not highly valued enough, and going to take some opportunistic stabs at taking some additional shares out and really trying to position us well for our guidance call that comes along August of â\u0080\u009923. Yes, look - weâ\u0080\u0099ve been on a long term strategy here of bidding larger jobs, and for a company like ours, we have to contrast that against winning a lot of work that gets you a nice revenue pop, doesnâ\u0080\u0099t do much with margins, and if you find yourself in that grey area where youâ\u0080\u0099re bidding programs with tighter and tighter rates, the reward for that - trust me - is you get to re-compete on that work even sooner. Weâ\u0080\u0099ve been building it over the last decade, so weâ\u0080\u0099re going to stay with that strategy because once you win something like that, not only do you deliver the long term tech tail but then you get into the  with those programs and that moves us into really nicely positioned expertise work."
}