{
    "symbol": "CRS",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-26 12:14:05",
    "content": " As we look ahead to the balance of fiscal year 2023, we expect corporate cost to be $19 million to $20 million per quarter. When excluding the impact of special items in the prior year quarter, adjusted operating loss was $29.8 million in the same quarter last year, and operating income was $8.3 million in our recent first quarter. SAO reported operating income of $30.3 million in our recent second quarter, a significant improvement versus our recent first quarter and prior year second quarter results. On a year-over-year basis, SAO adjusted operating income improved $49 million largely due to higher sales, coupled with an improving mix. On a sequential basis, operating income improved $10.4 million, which is in line with the expectations we set last quarter and driven by increased volumes as we continue to ramp our operations to meet the strong demand that we are seeing across our end-use markets. Based on current expectations, we anticipate SAO will generate operating income in the range of $41 million to $45 million in the upcoming third quarter of fiscal year 2023. Net sales, excluding surcharge, increased 17% from the same quarter last year and were up 12% sequentially. This compares to adjusted operating income of $3.2 million in the same quarter a year ago, and operating income of $6.3 million in the first quarter of fiscal year 2023. In the second quarter of fiscal year 2023, we spent $18 million on capital expenditures. Given the timing of certain projects and ongoing delays due to extended lead times, we expect fiscal year 2023 capital expenditures to be in the range of $85 million to $90 million, which is down slightly from our previous guidance of $100 million. With those details in mind, we used $114 million of free cash flow in the second quarter of fiscal year 2023. Those combined with estimated corporate costs, results in a total company projected operating income range of $30.5 million to $37 million for the third quarter, a strong sequential increase."
}