{
    "symbol": "APPS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-08 20:01:07",
    "content": " For our near-term results, I'm going to break my remarks into four areas: First is some commentary on our consolidated results for the quarter, including a breakout of each of our segments; second are some real-time operational updates; thirdly, we'll update on the strategic integration progress of One Digital Turbine; and finally, provide some commentary on the current events going on in our industry and economy such as regulations, supply chains, inflation, Apple's IDFA impact and others. Turning to our December quarterly segment results, our On-Device Media business set all-time revenue records and generated over $134 million in revenue, which is 43% growth year-over-year. After trying for many years, we proved in 2021, there's a real business with SingleTap as the growth broke out in a major way as revenues increased 800% year-over-year. The Performance business, which is contracted in the prior September quarter by 18%, primarily driven by Apple's IDFA changes, rebounded nicely with nearly 25% growth in the December quarter. While it's still a small percentage of overall revenues at approximately 15% of our total AdColony and Fyber revenues, but is that we add more synergies and devices in the region, we're excited about the growth prospects in that part of the world. On the product front, our revenues from Dynamic Installs grew by over 20% year-over-year in the December quarter, but now only represent 15% of our total consolidated revenues compared to over 50% last year, as the company has been repositioned to a monetization over the life of the device company versus just the monetization first activation company. Before intercompany eliminations, our on-device media revenue, which represents existing revenue derived from the company’s Application Media inclusive of SingleTap, DST and Content Media platform products increased 43% year-over-year to $133.6 million. I’m very pleased that our operating leverage and consistent EBITDA growth is being achieved even as we continue to make a number of focused near-term investments, primarily within our sales force and technology teams to support new partners and products to drive future incremental revenues on the platform."
}