{
    "symbol": "APPS",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-02 20:08:05",
    "content": " Tonight, I'm going to break my prepared remarks into four areas: first is some commentary on our consolidated results for the quarter, including a breakout of each of our segments; second, are some real-time operational updates; thirdly, some updates on the strategic integration progress of Wind Digital Turbine; and finally, I want to provide some commentary on the current events going on in our industry and economy such as regulations, supply chains, Apple's IDFA impact and other consolidation and M&A activities. And to support this point, I want to call out our all-time record of $40 million of free cash flow generated from the September quarter as a proof point of the strong operating dynamic and the health of our overall business model. First, on our On-Device Media business, it set all-time revenue records in the September quarter and generated over $129 million in revenue, which is 73% growth year-over-year. Our U.S. revenues in our App Media business in the last three September quarters has gone from $30 million in 2019, $40 million in 2020 to over $60 million this past quarter. In particular, the AdColony brand business, which is highly strategic for our One Digital Turbine efforts, showcased approximately 40% year-over-year growth and accounts for the fastest-growing portion of AdColony revenues. On the product front, our revenues from our dynamic installs grew by 25% year-over-year in the September quarter, but now represent approximately 15% of our total consolidated revenues compared to over 50% last year as the Company has been repositioned to a monetization over the life of a device company versus just a monetization at first activation company. On Device Media revenue, which represents existing revenue derived from the Company's Application Media, inclusive of SingleTap, DSP and Content Media and platform products, increased 73% year-over-year to $129.4 million."
}