{
    "symbol": "APPS",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-31 19:37:11",
    "content": " Now as we close out our fiscal year and stepping back from the macro situation, I think it's important to highlight one year ago, we reported our annual results for fiscal '21 that included revenues of $314 million, $75 million of EBITDA and $0.74 of non-GAAP earnings per share. For the fiscal year 2022, we reported $747.6 million in revenue, growing 138% as reported and 31% growth on a pro forma basis. We generated $195.2 million in adjusted EBITDA, an increase of 158% over prior year, and delivered $170.6 million in adjusted net income or $1.66 per share as compared to $0.74 per share prior year. We experienced continued impressive expense scale in the platform as cash expenses were $39.8 million in Q4, flat year-over-year on a pro forma basis, while revenues were up over 19% in the period. I'm proud that our operating leverage and consistent EBITDA growth is being achieved even as we make continued focused near-term investments, primarily within our sales force and technology teams, to support new partners and products and to drive future incremental revenues on this platform. As we consider the ongoing macro environment, we currently expect revenue for Q1 to grow between $183 million and $187 million and adjusted EBITDA to grow to between $49 million and $51 million and non-GAAP adjusted net income per diluted share to be between $0.34 and $0.35 based on approximately 105 million diluted shares outstanding and an effective tax rate of 25% on our non-GAAP adjusted net income. And then today, I think one of the things we wanted to spend a little bit more time talking about, as Darren just asked about, was on the SingleTap licensing side and how we see actually to get towards the broader $100 billion addressable market app installs today, and that's more likely for us to get our piece of that through the licensing part of the business versus trying to only do that on a direct basis through our demand side platform."
}