{
    "symbol": "PFGC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-17 13:12:06",
    "content": " I would now like to turn the call over to Bill Marshall, Vice President, Investor Relations for PFG. We are here with George Holm, PFGâ\u0080\u0099s CEO; Jim Hope, PFGâ\u0080\u0099s CFO; and Patrick Hatcher, Vistar President and Chief Operating Officer. We issued a press release regarding our 2022 fiscal fourth quarter and full year results this morning, which can be found in the Investor Relations section of our website at pfgc.com. During our call today, unless otherwise stated, we are comparing results to the same period in our 2021 fiscal fourth quarter and full year. As a reminder, in the second quarter, we changed our operating segments to reflect how we manage the business. Good morning, everyone and thank you for joining our call today. It is a dynamic time for our industry and economy, but we believe we are very well positioned to continue to produce strong results and maintain the momentum we saw as we closed out the fiscal year. Importantly, as we shared with you just over a month ago at our Investor Day, we believe our company is uniquely constructed to do well and create value for our shareholders in a range of economic climates. Our company has been resilient during challenging times in the past and our recent strategic activity, including the Core-Mark acquisition, have only increased our ability to weather various challenges. But as you saw in our press release earlier today, we have not yet seen significant impact from what some believe may continue to be a more difficult environment for the consumer. In particular, the continued rebound of our Vistar business, which experienced strength in the movie theater and vending channels along with consistent performance from our convenience segment, helped offset modest slowing in some of our chain restaurant business. We are seeing the benefit of return to more normal activities, including vacations, business travel and family outings to the movies, sporting events and other group activities. For several quarters, we have discussed how certain areas of our business, particularly at Vistar, would extend our recovery and build upon the strength we have seen in restaurants. We believe there is still room to improve, which gives us confidence in the duration of our strong top line results. We watch our inbound fill rate closely and during the last week of July and early August, we are pleased to see our fill rates from Performance Foodservice suppliers reach the highest level in over a year. There is certainly more room to improve, but we are hopeful that this is an indication that we are heading in the right direction and we believe another reason why we feel confident for the future. Similarly, the labor market has slowly improved, better labor trends, along with a focus on our cost structure and favorable product and channel mix produced another strong quarter of year-over-year margin expansion. Considering all of these factors, we feel very good about the potential to continue to grow revenue and profit, as shown by the fiscal 2023 guidance we set this morning. However, we believe inflation will remain high for the next several quarters, particularly as shortages in certain grains, feed and fertilizer, impact the supply of center-of-the-plate items. We will continue to work with our customers to find alternatives to keep costs down, but allow for the same high-quality meals that their consumers are looking for. As we shared at Investor Day, Performance Brands often provide a win-win situation, where our customers are able to find high-quality products at a lower price. For PFG, the increased sales of our own brands, improves customer loyalty and gives us better control of the supply chain. Through the fiscal year, inbound fill rates of our company brands have been generally higher than for national brands. In the quarter, Performance Brands grew 8.4%. While we do not have the ability to predict the likelihood of this happening, we do plan for a range of outcomes that could impact our business. Through this process, we believe that we are well-positioned to handle a softer economic landscape. In fact, we believe that we are moving towards a more normal supply chain environment which we expect would lead to better productivity and higher profit margins going forward. In the restaurant space, our strength in pizza continues to pay dividends as we have once again gained significant share in independent pizza during the fourth quarter. As we saw during the depths of the pandemic, pizza and Italian cuisine tend to perform very well in difficult times as an affordable meal option for families. In fact, during the quarter, we gained share in all 15 of our largest independent categories. This includes very strong share performance in seafood, Hispanic and C-store concepts in addition to the pizza games I just mentioned. Overall, our year-over-year independent restaurant share gains improved sequentially each month of the fourth quarter, demonstrating our leadership in this important area for our business. Within Vistar, the value store channel and vending have also been bright spots. We believe that both of these lines of business are also very recession-resilient, particularly value stores. In vending, our micro market business remains one of the more exciting growth initiatives at our company. If you are interested in more details, I would point you back to our Investor Day presentation, which gives good insight into the micro market opportunity. Our theater business will fluctuate depending upon a variety of factors, including the quality of movies being released, but we are very encouraged by the consumersâ\u0080\u0099 willingness to return to the theater when there is good content in the market. Finally, we have all seen the consistent performance that convenience store channel has provided, not only during the pandemic, but also through previous economic downturns. We see no reason for this to change in the future and believe that our emphasis on food, foodservice and related products, elevates the opportunity that this channel provides. In the fourth quarter, dollar sales of food, foodservice and related products into our convenience channel increased 17.6%, reflecting the benefit of inflation, same-store sales growth and market share gains. This compares to sales of nicotine products, which were down 3.5% in the quarter. Since closing the Core-Mark transaction, we have highlighted several of these new business wins. Taken all together, we are pleased with our segmentâ\u0080\u0099s ability to collaborate and create new business opportunities, while also providing diversification, which reduces volatility created by external factors. Before turning it over to Jim, I wanted to make a few comments about the announcement we made last week that Jim will be retiring at the end of the calendar year and transitioning the CFO role to Patrick Hatcher. For the past 5 years, Jim has guided PFGâ\u0080\u0099s financials through some of the most challenging conditions and multiple acquisitions. But through it all, Jim was the consummate professional has achieved the monumental task of creating an either stronger financial position than inherited when he took over. At the same time, I am incredibly excited to see Patrick Hatcher rise into the CFO role. Patrick has been with our organization since 2010, holding a number of leadership positions at Vistar, including the CFO of that division. Like Jim, Patrick has excelled in both financial and operating roles. As we transition the role from Jim to Patrick over the next several months, there will be many more opportunities to interact with Patrick. As George mentioned, we had a strong close to our fiscal 2022 and we entered fiscal 2023 with solid momentum and a strong capital position. We closed the fiscal year with $4.3 billion of net debt, which is a leverage ratio of 4.0x trailing 12-month pro forma adjusted EBITDA. As we highlighted in June, reducing our leverage is a key financial priority for the company and we have made significant strides both by growing our EBITDA along with targeted reduction in our outstanding debt balances. At the end of the fiscal year, we had $2.2 billion of available liquidity. I am proud of our teamâ\u0080\u0099s efforts to maximize our balance sheet and financial position, while continuing to invest behind growth opportunities. This milestone reflects improved buying power with suppliers, operations and logistics efficiencies and corporate cost reductions. As always, we will continue to look for efficiencies and cost savings opportunities across all of our business units. With that, letâ\u0080\u0099s quickly review some highlights from our fiscal fourth quarter and full year business performance. At the enterprise level, PFG net sales increased 57% in the fourth quarter to $14.6 billion, which was at the upper end of our implied guidance range. Total case volume increased 17% in the fourth quarter, including the contribution from Core-Mark and merchants. Excluding the impact of the 53rd week last year, organic independent cases increased 4.7% in the fiscal fourth quarter. This also represents a favorable mix shift, which drives profit growth, margin expansion and high-quality earnings. Total PFG gross profit increased 40% compared to the prior year quarter, including the addition of the Core-Mark business and the independent case growth, which I just mentioned. Total company cost inflation was up about 13.6%, representing high single-digit increases in the convenience and Vistar segments and high-teens increases in foodservice. There are a number of ways we are managing the higher rates of inflation, including using our scale to improve our buying power with suppliers and helping customers find value through our range of product offerings and performance brand portfolio. In fact, the fourth quarter represented the first time in 2022 that we saw a benefit in year-over-year cost associated with the temporary and contract workers. In the quarter, our temporary contract labor costs decreased $21 million compared to the prior year period, which includes both direct contract labor costs and associated travel costs. This reflects some improvement in the external labor market, but was also driven by the tireless efforts of our team in the field in recruiting and retention, which continues to improve. Excluding that extra week, our contract labor costs were down about $17 million compared to last year. In our Foodservice segment, June experienced the largest monthly headcount gain for all of fiscal 2022. With that said, there are still some select markets where there is room to improve on labor, even as we approach a more normal run-rate. In the fourth quarter, PFG reported net income of $76 million, adjusted EBITDA increased 69% to $357.1 million, diluted earnings per share was $0.49 in the fourth quarter, while adjusted diluted earnings per share was $1.07. As we build upon momentum at the close of our fiscal 2022, we expect another strong year of top and bottom line results in fiscal 2023. To reflect this, we have set guidance for the upcoming fiscal year as follows. In the fiscal first quarter of 2023, we expect to achieve net sales in a range of $14.2 billion to $14.5 billion. For the second quarter, we anticipate $13.5 billion to $13.8 billion in net sales and $245 million to $265 million of adjusted EBITDA. Not only do we anticipate high rates of inventory gains in the fiscal first quarter, but we are also lapping sizable gains in the second quarter of last year, impacting the year-over-year comparison. However, over the past year, we have seen much larger and more frequent pricing actions by consumer goods companies driving additional benefit. And with our strong balance sheet and combination of Core-Mark and Eby-Brown, we are in better position to take advantage of these benefits. In addition, we are modeling slightly lower inflation benefit in the second quarter compared to the first quarter with modestly decelerating inflation as we progress through the year. For the full year, we anticipate net sales in a range of $56 million to $58 million and adjusted EBITDA in a range of $1.15 billion to $1.25 billion. In summary, we are extremely pleased with our quarterly and fiscal year financial results. This is reflected in the strong outlook for the full year, particularly on adjusted EBITDA, demonstrating our commitment to margin improvement. Our company is positioned to build on our strength, driven by our constant focus on our existing customer base while adding high-profit new accounts across all channels. The Core-Mark integration has proceeded well, both culturally and from a business perspective. Our balance sheet remains strong, providing flexibility to invest in value-creating projects to drive organic growth. We believe these factors will allow us to achieve our three main objectives: sustained profitable sales growth, EBITDA margin expansion and lower leverage. Before turning it over for your questions, I wanted to say a few words about my upcoming retirement and my time at PFG. For the past 8.5 years, this has been with Performance Food Group. Thinking back over this time, it is amazing how far weâ\u0080\u0099ve commenced an organization. In 2015, we went public with approximately $16 billion in net sales and market cap of less than $2 billion. Today, weâ\u0080\u0099ve reported net sales of over $50 billion, and our market cap recently passed $8 billion. These achievements would not be possible without the hard work and dedication of thousands of PFG associates, customers, suppliers and in addition, our partners across the world. Our company has got a strong financial position today, but I have no doubt that some of PFGâ\u0080\u0099s best years are ahead, and Patrick is the perfect leader to guide the finance organization. Your line is now open. And Jim, I just wanted to say that you will absolutely be missed by the investment community. And just around OpEx per case, labor productivity. I think it is for our company, our industry, probably most industries. We have a lot of people that are on a learning curve more than we normally would, and they are climb in that curve and our productivity is getting better. We have some markets where weâ\u0080\u0099re just back to kind of normal pre-COVID era, and we have some markets where weâ\u0080\u0099ve got a long way to go yet. I think in some respects, thatâ\u0080\u0099s encouraging for the future because we know we will get there. And then just a follow-up, and this is for Jim, I guess, you canâ\u0080\u0099t get off the call, Jim, without answer some questions. As we think about free cash flow, you made investments in inventory thatâ\u0080\u0099s been kind of a drag on free cash flow in the past year. I mean, because it does look like you could see a nice bounce back in free cash flow, but Iâ\u0080\u0099m not sure if Iâ\u0080\u0099m missing anything as it relates to that. And no, I donâ\u0080\u0099t think youâ\u0080\u0099re missing anything. This was an important year for Performance Food Group as we saw really multiple years of really strong come back in revenue and top line, a lot of growth, really positive developments in market share gains. And I think the field actually did a very good job managing inventory, but weâ\u0080\u0099re getting close to the point where weâ\u0080\u0099ve got inventory calibrated with sales and revenue growth and I think weâ\u0080\u0099ve been through the hardest part of that cash burn, so to speak, related to that. And yes, I would think that part of the pressure on free cash flow would start to subside. Your line is now open. The simplest way to think through it is if â\u0080\u0093 and I know youâ\u0080\u0099ve seen across the last four quarters, we made a point of giving you the contract labor premium costs so you could see how much more of an increase there was that we had in contract labor. And now weâ\u0080\u0099re saying, as we expected, that number is really now below last year. And as weâ\u0080\u0099ve talked about in the past, we would see contract labor improve, which has had, which it has. And we start to see over time increase, thatâ\u0080\u0099s happened, and then we would expect over time to start to come down to a more normal rate. Itâ\u0080\u0099s nice to see us building staff, and we need to work on reducing turnover, as George mentioned. Well, we do feel that the cost of fuel has had a negative impact on the business. Even in convenience, where typically people will be in more frequently, people that buy a certain amount of gas at a time and purchase more product, but we havenâ\u0080\u0099t experienced this kind of increase in fuel before, and weâ\u0080\u0099ve actually seen less traffic in convenience but a higher ticket. As far as the trending goes on the Foodservice side, we have seen some uptick in July and early August on a comparison standpoint to the previous year. But I think if you look at our fiscal fourth quarter, calendar second quarter. The reason I say that is, first of all, we had mid-50s independent case growth last year versus the previous year. But if we go back to 2019, which is I think the last time we saw anything which approached normalcy, our fiscal 2022, each quarter was very similar in that mid to high teen case growth over 2019. But quarter four, we were only, I believe, 4.7% was the number. So if you go back and you look at the fourth quarter of last fiscal year, you had a lot of things going on. First of all, you have many markets opening up and coming back very strong, you had stimulus money that ended up a lot of that became discretionary income and a lot of it went into restaurants, and people wanted to get out that continued in July and August of last year, and then it started to taper. Your line is now open. My first is on the 2023 guidance and when you gave the â\u0080\u009825 guidance at the Investor Day, you kind of qualified that in the low end with a mild recession. Certainly, with Q1, weâ\u0080\u0099re clearly a little closer to that time period now than we were with the 3-year guidance, where weâ\u0080\u0099re giving something way out in the future, and we wanted to caveat it with thoughts around the macroeconomic environment. With Q1, what you see is probably a little more of a traditional high and a low end of a range. I would kind of wrap that comment up with I think you know us, we feel very confident about the guidance weâ\u0080\u0099re providing today. Weâ\u0080\u0099ve also experienced in our Vistar business, a great change in mix of business more towards where we get a higher margin. But weâ\u0080\u0099ve also had unusually high, as we talked about with Edâ\u0080\u0099s question, weâ\u0080\u0099ve had unusually high labor costs, particularly in warehouse and delivery. And if that continues the trend that itâ\u0080\u0099s on now, those two, the one headwind and the one tailwind will kind of offset each other. Your line is now open. Jim, Iâ\u0080\u0099d also like to extend my congratulations on your retirement. And what weâ\u0080\u0099ve seen is that our new business is real stable, the percentage of our business thatâ\u0080\u0099s accounts that we didnâ\u0080\u0099t sell the previous year. And the ones that are opened when thatâ\u0080\u0099s higher, youâ\u0080\u0099re going to have more options and people are going to see some decline in traffic. What gives us encouragement there that, that is temporary and more to do with the big volumes last year is that our line is really up. So weâ\u0080\u0099re selling more items to the customers that weâ\u0080\u0099ve had this year and last year, and they are just not buying as many cases per line item. For us, those sales show up partially in Foodservice and partially in convenience, depending on the level of commitment that the convenience store has from service and the number of SKUs that, that involves. And our approach to the marketplace, I think weâ\u0080\u0099re refining that, and weâ\u0080\u0099re getting a better and better feel of which one of our businesses should be pursuing that business. But when we see these kind of declines, which are a little bit unusual in tobacco, a little more than normal, I just look at that, that it just takes these convenience customers where our Core-Mark and EV people have great relationships. And I think that, that just bodes well for us. Your line is now open. Also, congratulations, Jim and Patrick. Well, thatâ\u0080\u0099s really a good question. So I donâ\u0080\u0099t want to imply that, but that has been weaker for us, and weâ\u0080\u0099re seeing a little bit more success kind of in that fast casual and better lower-priced menu casual diners. So, thatâ\u0080\u0099s about 10% EBITDA growth or so. Itâ\u0080\u0099s continued improvement in mix, continued improvement in labor. And I will tell you, we are basing our projections internally based on trends that we already see today that we feel confident in. Your line is now open. I wanted to see if you could maybe just unpack a little bit in terms of your overall revenue growth for this year, the 12%, I think at the midpoint. I assume below, but maybe some insight on how you are thinking about those businesses growing. Well, the Cedar business has always been kind of choppy because itâ\u0080\u0099s so dependent on the quality of the content. We see a little bit of a lull period right now, but there is some great content coming out and we expect to have a real good kind of late fall and early winter season. Vistar still has some  business that havenâ\u0080\u0099t come back entirely that office coffee being one that we are not sure will come back entirely, but itâ\u0080\u0099s certainly going to improve from the levels itâ\u0080\u0099s at now. And then our retail business, itâ\u0080\u0099s been quite strong, and we donâ\u0080\u0099t see anything thatâ\u0080\u0099s going to reduce the performance there. So, we look at the next couple of quarters as this start being a good grower for us. When you get to convenience, that business tends to come in chunks. So, we feel good about that being a growth business for us. And then when it comes to our food service business, if you look at our national account business, we were actually for fiscal â\u0080\u009822, we were negative for the year. And obviously, it helped a great deal in margins, but we have got a good funnel there. So, we are confident that we are going to have a better growth year in Foodservice in â\u0080\u009823 than we did in â\u0080\u009822. We didnâ\u0080\u0099t provide a number as part of guidance, but we certainly added some commentary and color that we expect it to slowly subside, but we do expect continued inflation in 2023. Your line is now open. Well, we have seen a continued improvement in our inbound fill rate, and we have always been able to provide a higher fill rate to our customers than we are getting from our supplier just through experienced purchasing people and running higher inventories as we are today. When you get to our convenience and our Vistar business, it has been more difficult. And I think thatâ\u0080\u0099s because so much of its packaged product that has several ingredients and the more ingredients there are, the more likely that there is something thatâ\u0080\u0099s not available at the time. But in Foodservice, we do believe that having higher available product is going to help us. And then if we just think about the guidance, I mean giving two quarters has been something that you guys usually do. No, it was primarily the inventory benefits and we wanted to provide the Street a little more clarity on the inventory gains that we are very confident in and happening in Q1, and make sure that folks had the calibration between the two quarters and they saw it in a manner consistent with us. Your line is now open. One, just following up on the inflation, I know the past couple of quarters, itâ\u0080\u0099s been stable in that 13% to 14% range. And I think you mentioned you expect it to slowly subside, but nothing too crazy. I am just wondering if you can maybe walk us through high level, the implications of if it stayed at double-digit versus the potential for your basket to be down to single-digit, or some people dream of potential deflation. We certainly donâ\u0080\u0099t want to see inflation rates continue to be where they are at today, and we didnâ\u0080\u0099t model in this type of inflation into how we are planning out this next year. We just donâ\u0080\u0099t have a great feel for that, but we donâ\u0080\u0099t expect to see a deflationary period of time. I know Jim, you mentioned earlier, big gains in recent years. But we feel confident that we have taken market share and we continue to grow in a very healthy manner, both from an organic as well as an inorganic perspective. Yes, I think itâ\u0080\u0099s difficult to determine the size of the market in our business. But I donâ\u0080\u0099t want anybody to think that we know what our market share is with the total market that involves everybody in distribution, we do not. Your line is now open. I also wanted to echo my congrats to Jim, Patrick and Scott. George, at the Investor Day, I think you indicated that sales in Foodservice were still pretty healthy, but you were seeing a significant amount of volatility week-to-week, a lot more than usual. Things have been very stable, not at the level we would like to see that, but itâ\u0080\u0099s been very stable. But once again, I go back to what I said earlier, if you compare fiscal â\u0080\u009822 to fiscal â\u0080\u009819, the increases were pretty much the same all four quarters. So, that tells me that when you go back to that stable period of time pre-COVID, that we are at that same kind of level of stability. Well, let me â\u0080\u0093 first of all, just talk Vistar and Core-Mark. Those type of packaged goods, in all my years in the business, I have never seen them lower prices, okay. But when you look at the amount of cattle out there, we know that we get into next year, probably even this fall, there is going to be some fairly significant price increases. So, I donâ\u0080\u0099t think anybody really knows, but we follow it close. We have people that follow it much closer than we as a management team do that we get advice from, and I think itâ\u0080\u0099s going to continue to be inflationary. Your line is now open. I know people have asked about this, but you did reference how July and August are doing with respect to June. No, not really a lot different, but I wouldnâ\u0080\u0099t call June normal from a comparison standpoint. I think it was a fairly normal month, but the comparison versus last year was very difficult. But our June, like the quarter, the increase over 2019 was pretty consistent with what itâ\u0080\u0099s been all year long. We have seen a slight uptick in our case growth in July and early August, but I still look at last year in that period of time as being a very strong period of time, tough comparisons, I guess is what I am saying. So, Jim, you mentioned inorganic investments and the use of free cash flow, and thatâ\u0080\u0099s a pretty broad place to put a brush. But could you guys just sort of talk about maybe some of the key areas of focus, either for â\u0080\u009823 or beyond, whether itâ\u0080\u0099s hiring more salespeople or where are you at with just personnel in general. Look, what we are referring to is we are going to continue to invest back into the business to support growth. But I feel like we are in very good shape, of course, from the standpoint of the balance sheet and our ability to invest back into the business. And I donâ\u0080\u0099t know if you are â\u0080\u0093 just a couple of modeling questions here kind of a little bigger than â\u0080\u0093 so the last few quarters, you had a couple like both quarters had showed $11 million, it looks like other income. We do quite a bit of probably an appropriate amount of fuel hedging to offset the rising cost of diesel fuel, and thatâ\u0080\u0099s what you are seeing there, the cost covers that we were on. Certainly appreciate and respect that question, falls under the category of one that we are not going to share at this time. So, as I mentioned earlier, thatâ\u0080\u0099s one of the main reasons we provided two quarters to show you there was a little more heavier mix of the inventory gains in Q1. Your line is now open. Good morning and congratulations from us as well, Jim. Just a question on the margins, I recall from the Analyst Day in June, I believe, Jim, you expected all three segments to contribute to the margin expansion over the 3-year period. But as you look at this year aside from the inventory gains which you called out, which is helpful. If you have any follow-up questions, please contact us at Investor Relations."
}