{
    "symbol": "CTLT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-02 00:09:09",
    "content": " The segment experienced organic net revenue growth of 59%, driving an EBITDA increase of more than $60 million over the second quarter of last year. To highlight the company's transformation over the last few years, you'll see that the company represented 52% of our net revenue in Q2 of the fiscal year compared to 44% in Q2 of fiscal 2021 and 31% in Q2 of 2020. Biologics net revenue in Q2 of $638 million increased 60% compared to the second quarter of 2021, with cell therapy acquisitions adding 1 percentage point of growth. Looking to the back half of the year, as we discussed last quarter, we expect the Biologics segment revenue growth rate to decelerate in the second half of fiscal 2022 as we begin to compare against the higher levels of COVID-19 related production that started in the back half of fiscal 2021. Softgel and Oral Technologies net revenue of $329 million increased 36% compared to the second quarter of fiscal 2021, with segment EBITDA increasing 73% over the same period last fiscal year. After factoring out the net impact from divestiture of our blow-fill-seal business and the acquisition of Acorda spray drying assets, organic net revenue grew 5% and segment EBITDA was up 24% over the second quarter of last year. EBITDA margin improvement was driven by organic net revenue growth, as well as favorable comparison to our second quarter fiscal 2021 when we booked charges related to a customer September 2020 voluntary recall of a respiratory product. As shown on slide 12, our Clinical Supply Services segment posted net revenue of $99 million, representing 7% growth over the second quarter of fiscal 2021 and segment EBITDA growth of 9% over the same period. For full-year adjusted EBITDA, we expect the range of $1.25 billion to $1.30 billion, representing growth of 23% to 27% over fiscal 2021 compared to our previous estimate of $1.225 to $1.295 billion. We expect full-year adjusted net income of $650 million to $700 million, representing growth of 18% to 28% over the last fiscal year compared to our previous estimates of $630 million to $695 million. Again, we see terrific ability to be number 1 in those spaces, specifically for cell and gene therapy from a CDMO standpoint, as well as to have the capacity that our customers need, which, by the way, is what kind of really made us the go-to player, if you will, during COVID with regards to vaccines and therapies because we have much coveted capacity that our customers wanted and needed, specifically the high technology of under isolator drug product, filling assets that Catalent was putting online and was able to secure even through the pandemic. So, the fact that we saw very high levels of COVID-related contributions in Q3 and Q4 of fiscal 2021, we're now expected to see more normalized growth within the Biologics segment in Q3 and Q4 in fiscal 2022 in comparison to those prior-year quarters. So, that's really what I can provide here in terms of the dynamics we're seeing within Biologics as we enter the second half of the fiscal year and seeing growth return to that more normalized level that we would expect."
}