{
    "symbol": "CTLT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-03 13:02:14",
    "content": " Our biologics segment was again the top contributor to Catalent's financial performance as it experienced organic net revenue growth of 30%, driving an EBITDA increase of $41 million over the third quarter of last year. These will all be critical drivers for Catalent to deliver our long-term targets I outlined last quarter, including the fiscal ‘26 targets of more than $7.5 billion in revenues and adjusted EBITDA margin of approximately 30%. To highlight the company's transformation over the last few years, we will see that the segment represented 55% of our net revenue growth -- net revenue in Q3 of this fiscal year compared to 52% in Q3 of fiscal 2021 and 33% in Q3 of 2020. At the factoring out the net impact from the divestiture of our Blow-Fill-Seal business and the acquisition of the Acorda's spray drying assets, both of which annualized in the third quarter of this fiscal year, net revenue grew 4% and segment EBITDA was up 64% over the third quarter of last year. 24:20 As shown on slide 12, our clinical supply services segment posted net revenue of $101 million, representing 3% growth over the third quarter of fiscal 2021, driven by growth in our manufacturing and packaging service offerings in North America. 25:15 Moving to our consolidated adjusted EBITDA on slide 13, our third quarter adjusted EBITDA increased 24% to $339 million or 26.6% of net revenue, compared to 26% of net revenue in the third quarter of fiscal 2021. We now expect full fiscal year net revenue in the range of $4.8 billion to $4.9 billion, representing growth of 20% to 23% versus our previous estimate of $4.74 million to $4.86 million. 28:58 For full-year adjusted EBITDA, we expect a range of $1.265 billion to $1.305 billion, representing growth of 24% to 28% over fiscal 2021 compared to our previous estimate of $1.25 billion to $1.30 billion. We expect full year adjusted net income of $665 million to $705 million, representing growth of 21% to 28% over the last fiscal year, compared to our previous estimate of $650 million to $700 million. 30:20 Finally, I'll close by reiterating Alessandro's comments on our initial estimate at the top line for fiscal 2023, which projects growth in line with our publicly announced long-term organic constant currency net revenue growth rate range of 8% to 10%. Among the factors we've considered in formulating this estimate are increased utilization of recent investments across the company, including those highlighted earlier this call, organic growth through current assets, a shift of some of our fungible biologics assets currently producing COVID vaccines to other customer projects, including recently signed large commercial tech transfer programs and as a risk mitigation fact there, assuming a considerable decline in revenue from our COVID-19 product programs. 42:12 So, we expect that the revenue growth is going to be fairly rapid, but of course, it's going to take some time to get these assets to full utilization, which is good news, because it is going to give us runway in the next -- at least for the next two, three years and be able to continue to grow our biologics segment over and beyond the utilization of the current assets. And as I noted in my comments around our revised fiscal 2022 guidance, there is a significant amount of cost that we were inheriting as well as continuing to invest in here that is absorbed in our fiscal 2022 guidance, that was approximately an $8 million headwind between the two deals at the EBITDA line that's included in our new fiscal 2022 guidance and we'll give more specificity around the contributions of these two additional sites as part of fiscal 2023, when we update our guidance, we'll provide more specificity around our guidance in the August call. That being said we've clearly laid out four or so key drivers of the fiscal ‘23 revenue growth of 8% to 10% including increased utilization of recent investments across the company, if you talked about on this call that are very much biologics focused . I refer to the traditional drug substance strains that came online earlier this year in the Madison campus, some additional capacity is coming online as we described in our gene therapy campus in the Baltimore and the BWI airport, the additional capacity that came online in Limoges, some expansions we've done in Anagni, there are a number of different assets on which we've been announcing investments which came online in the last few months which will be surely instrumental to the progression of the company into fiscal year ‘23 and beyond. I would expect the ‘23 outlook to be, as I said elevated, we're not going to give specifics to what that means in terms of percentage of revenue, but we did purposefully say in my section of the prepared remarks that we do need to get back to an 8% to 10% normalized level in the years to come and we absolutely will do that."
}