{
    "symbol": "NDSN",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-21 11:30:21",
    "content": " On Slide number 5, you'll see first quarter fiscal 2023 sales were $610 million comparable to the prior year's first quarter sales of $609 million. Excluding the amortization of acquired inventory step-up, gross profit totaled $333 million or 55% of sales, a 3% or 150 basis point decrease compared to the $342 million or 56% of sales in the prior year first quarter. Adjusted operating profit excluding these nonrecurring items, was $155 million in the quarter or 25% of sales, 2% below the prior year adjusted operating profit of $157 million. EBITDA for the first quarter was $181 million or 30% of sales, which is in line with our long-term target profitability level and comparable to the prior year first quarter. Tax expense was $27 million for an effective tax rate of 20.5% in the quarter, which is in line with the prior year first quarter rate and the forecasted full year rate for 2023. The organic growth of 1% was driven by steady demand across most product lines and regions, offset by softness in Asia Pacific particularly product assembly China due to the timing of Chinese New Year and labor shortages from the spread of COVID-19. Operating profit in quarter was $102 million or 33% of sales, which is a decrease of 1% compared to the prior year adjusted operating profit of $104 million. First quarter operating profit was $39 million or 26% of sales, which is a decrease $10 million compared to the prior year operating profit of $49 million. You'll see Advanced Technology Solutions sales were $145 million, a 14% increase compared to the prior year first quarter. First quarter adjusted operating profit, excluding the inventory step-up and acquisition transaction expenses was $27 million or 19% of sales, which was comparable to the prior year first quarter operating profit. Free cash flow in the quarter was $114 million, or a conversion rate of net income of 109%, an $8 million improvement over the prior year first quarter free cash flow. Second quarter earnings are forecasted in the range of $2 to $2.15 per share reflective of the anticipated sales mix, which is comparable to the first quarter of 2023, while we remain financially prudent in this environment, we are adopting a balanced approach and will remain invested in innovation, differentiated service experience for our customers in strong core businesses. Your line is open. If you look at our industrial precision solutions, we're running at or above our long-term growth rates, increasing demand in automotive, steady demand in industrials and consumer nondurable product lines, packaging and product assembly, particularly pretty -- doing fairly well in Americas and Europe with some softness in China. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}