{
    "symbol": "PFMT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 20:43:06",
    "content": " In the first quarter of 2022, we reported our strongest ever first quarter for healthcare revenues, driven by the continued growth from our fully implemented statements of work, as well as contributions from some of the 33 program implementations, we've announced over the past five quarters. Our total customer care outsource services revenues were $3.6 million for the quarter, which was flat one compared to the first quarter of last year, consistent with our expectations. Within healthcare revenues, claim space, also known as claims auditing revenues in the first quarter of 2022 were $9.2 million, an increase of over 70% of the $5.4 million in the first quarter of 2021, representing growth, both from new implementations, as well as volume increases from earlier depressed levels. Within expenses, operating expenses in the first quarter were $28.6 million, which was $5.9 million lower compared to Q1 of last year, primarily driven by decreases in operating expenses related to the seating of activity within our recovery markets and offset by continued investment into our healthcare markets; specifically, the addition of human capital, which we expect to increase our expense and capital levels. Last quarter, I mentioned that we expected cash usage in 2022 to be in the range of $4 million to $8 million, which would leave us ample flexibility between cash on the balance sheet and revolver availability to pursue additional product development and/or larger organic opportunities. And so, I think to some degree you'll still see payers tackle some components of it, but when you think about prompt payment loss, just as one example of the need to be able to get these reviews done in a timely manner, make sure that you do it without provider abrasion, it's a difficult task and I think that's what really gives Performant an opportunity to provide these services across the whole multitude of payment plans -- healthcare plans from some of the smaller ones to the mid tiers, to the large national plans and certainly the things that we're doing with CMS on an absolute national scale."
}