{
    "symbol": "AXTA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 12:13:05",
    "content": " Net sales were $1.2 billion, an increase of 9% year-over-year for the fourth quarter while constant currency net sales increased 14% driven by pricing actions and strong market recovery in Mobility. Turning to slide 12, Performance Coatings Q4 net sales increased 2% year-over-year and 8% ex-FX driven by a 12% price mix benefit, volumes for the segment were slightly lower as refinish share gains were offset by Russ-Ukraine impacts and headwinds from a slower than expected recovery in China. Mobility Coatings reported Q4 adjusted EBIT of $18 million versus negative $4 million in the prior-year quarter as volume and price mix growth were partially offset by raw material inflation, higher fixed costs, and the negative impacts of foreign currency translation. The sequential increase to adjusted EBIT was also noteworthy increasing from $4 million in the third quarter to $18 million in the fourth quarter, driven mostly by an inflection in the price cost environment as pricing increased by mid-single-digit percent and variable costs were largely stable throughout the quarter. These headwinds together drove adjusted EBIT 9% below 2021 levels, though we're ending 2022 on a positive trajectory, adjusted EBIT improved by 11% in second-half year-over-year, and 22% year-over-year in the fourth quarter, price mix increased 10% year-over-year in 2022 with a low single-digit percent sequential improvement every quarter. Typical seasonal refinish buying decline that is expected to result in lower sequential Performance Coatings EBIT despite a better industrial EBIT contribution from the fourth quarter and a stabilizing raw material environment, though pressure is anticipated to continue in specialty raws like non-TiO2 pigments, labor and energy costs. Your line is now live. Your line is now live. Got it, fair enough. Got it, fair enough. Your line is now live. Your line is now live. Your line is now live. Your line is now live. We don't call out specific years for maintenance CapEx, but over time it's $30 million to $50 million, Jeff, on average in a given year, I'd say 2020, 2021, we certainly underspent from a CapEx perspective, so we're expecting a little bit more of an uptick, closer to that $50 million to $60 million in 2023 within maintenance, and then we'll get back to the normal, more normal run rate in 2024. Your line is now live. Your line is now live. Your line is now live. Your line is now live. And you can see even with our numbers, right, so we're going from $82 million, up to $83 million to $84 million in '23, but if you look at the external forecasters there at $85 million, so we do have some op upside here, but again we are being cautious primarily, if you think about China, if you think about Europe, we want to make sure we have a fixed cost model that is slightly lower and then we are prepared for the upside here. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}