{
    "symbol": "AXTA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 12:02:10",
    "content": " 03:52 These include: first, the rapid pace of variable cost inflation, which we experienced across most cost categories and well above what we had factored into our original Q1 guidance construct; second, raw material and labor shortages, which created a difficult operating environment constraining many customers in our ability to fully serve a healthy consumer demand environment; and finally, direct and indirect impacts from geopolitical and macroeconomic issues, including the Russia-Ukraine conflict, as well as the effects of zero COVID policies in China. 04:27 Despite the approximately $22 million in earnings headwinds these three items created versus our January guidance framework we were still able to deliver a solid quarter and exceed our sales guidance, as strong pricing and better volumes yielded better-than-expected 10% year-over-year organic ex-FX growth, and also delivered EBIT at the top end of our range. Net sales of $1.2 billion increased 10% year-over-year for the first quarter, while constant currency net sales increased 13%, driven by pricing actions, demand strength across most of our businesses, and benefits from two acquisitions we completed in 2021. 19:53 First quarter Adjusted EBIT was $120 million versus $183 million in the prior year quarter, reflecting pricing actions, strong demand, and volume trends across all end-markets except Light Vehicle, which was more than offset by substantial increases in raw material and logistics cost inflation realized versus the first quarter of 2021. Performance Coatings Q1 net sales increased 15.1% year-over-year and 18.6% ex-FX, driven by 2.5% higher volumes, a 10.7% increase in average price-mix, up from the 4.6% reported last quarter, and a 5.4% increase from acquisitions. 21:17 Industrial Q1 net sales increased 14.5%, or 17.3% ex-FX, driven largely by mid-teens percent improvement in average price-mix, as well as a low single-digit acquisition contribution, and slightly positive volume growth. 21:46 Performance Coatings reported Q1 adjusted EBIT of $95 million versus $117 million in Q1 2021, driven by ongoing volume growth and drop through benefits of price-mix, which were more than offset by headwinds from higher variable costs. Please proceed with your question. Please proceed with your question. But once we get back to sort of that 89 million, 90 million builds, you know, coupled with the fact of pricing traction you're going to see the effect into Chris Parkinson's earlier question, the volumes are camouflage and all the progress we've made from a cost structure perspective, so it's really going to help margins when we get back to those levels. Please proceed with your question. We saw volume improvement also within the performance side of the business and then the other bright spot is clearly pricing we were initially expecting around 7% price, we got upwards of 9%, but that has actually offset the impacts that we saw with Russia and the China dynamics, as well as the fact that we saw incrementally about $20 million in variable logistics and variable raw material costs. Please proceed with your question. Please proceed with your question. Please proceed with your question. And in Refinish, as we've highlighted the mainstream in the economy segments have been areas of focus for us and we've made in particular good inroads there in Latin America with a new business model, as well as with China and U-POL only allows us to further leverage that position, because most of U-POL sales and distribution network goes to more mainstream and economy sites, which has allowed us from a cross-selling perspective to more deeply penetrate with our Refinish products, as well as getting our U-POL products into more of our distribution, as well as some of our larger body shops in Europe and in the US. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}