{
    "symbol": "AXTA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 11:58:03",
    "content": " In Refinish our industry-leading aftermarket auto coatings business, we had a strong quarter with volumes up 4% and price-mix 12% better year-over-year. Net sales were $1.2 billion, an increase of 14% year-over-year for the third quarter, while constant currency net sales increased 20%, driven by pricing actions, demand strength across most of our businesses, and benefits from our U-POL acquisition we completed in mid-September of 2021. Third quarter volume improved 9% year-over-year with positive contribution from three of four end-markets, offset by a mid-single digit percentage decline in Industrial volumes, due to supply chain constraints as well as the macroeconomic and geopolitical headwinds within our European and China regions. Performance Coatings reported Q3 adjusted EBIT of $122 million versus $123 million in the third quarter of 2021, as benefits from price-mix and modest volume contribution were more than offset by headwinds from FX, Russia-Ukraine, China COVID-19 lockdowns, and higher variable and fixed costs. Mobility Coatings reported Q3 adjusted EBIT of $4 million versus negative $3 million adjusted EBIT in the prior year quarter, as volume and price-mix growth were partially offset by raw material inflation and incremental fixed costs and FX. Please proceed with your question. I think thereâ\u0080\u0099s a strong commitment in the company within the teams that we have to bring this back to, like the numbers you just said, $30 million a quarter is what we used to do, and you will see some improvement in Q4 in this business. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}