{
    "symbol": "AXTA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 12:30:24",
    "content": " In Refinish, our industry-leading aftermarket auto coatings business, we had a strong quarter with volumes up 3% year-over-year and 13% sequentially despite the aforementioned geopolitical headwinds in EMEA and COVID lockdowns in China. We expect sequential market growth through year-end with Q4 production nearly at 22 million builds, 17% above second quarter rates, and an annualized run rate in the high 80 million builds, which was last achieved in 2019. In Industrial, second quarter price-mix improved by 15% year-over-year or 20% on a two-year stacked basis, which for the first time in this inflationary period is fully offsetting the impact of inflation. Moving on to our second quarter results, net sales of $1.2 billion, an increase of 10% year-over-year for the second quarter, while constant currency net sales increased 15% driven by pricing actions, demand strength across most of our businesses and benefits from two acquisitions, which were completed in 2021. Second quarter volume improved 3% year-over-year with positive contribution from three of four end markets offset by a mid-single-digit percent decline in Industrial volumes, which was hindered by supply chain constraints as well as the macro and geopolitical headwinds within our EMEA and China regions. Performance Coatings second quarter net sales increased 6% year-over-year and 12% ex-FX, driven by a 9% increase in average price-mix and a 5% increase from acquisitions with volumes remaining largely flat. Industrial second quarter net sales increased 6%, or 11% ex-FX, driven largely by mid-teens percent improvement in average price-mix as well as a low single-digit acquisition contribution, partly offset by modest volume declines. Performance Coatings reported second quarter adjusted EBIT of $125 million versus $140 million in second quarter of 2021, driven by drop-through benefits of price-mix and acquisition contribution, which were more than offset by headwinds from FX as well as higher variable and fixed costs. Moving to Slide 11, Mobility Coatings constant currency net sales increased 21% in the second quarter, including a record high 12% price-mix benefit, up from 5% last quarter. Fourth quarter, you're going to see a bigger decline, like we said in our opening remarks, when you look at the two year cumulative stack, we're expecting about $600 million in cumulative inflation across both raw materials and variable freight."
}