{
    "symbol": "FSV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 15:32:04",
    "content": " Moving on to FirstService Brands, revenues for the quarter were up 22% with organic growth at 12% and the balance from acquisitions over the last year, including the six tuck-unders we reported towards the end of 2021, five in restoration and one in fire protection. We continue to incrementally add capacity and although we are facing ongoing supply chain challenges, we expect to show sequential growth in Q2 and another quarter of 20% plus year-over-year growth. Adjusted EBITDA was $62.3 million, up 4% versus the prior year's $59.8 million. FirstService Residential generated revenues of $394 million, up 12% over last year's first quarter while EBITDA was $30.4 million, a 3% increase over the prior year. When comparing the division's margin to Q1 2020, the last pre-pandemic quarter encompassing more normalized labor market and revenue mix dynamics, our 7.7% margin this quarter was 70 basis points better. Shifting to our FirstService Brands division, we reported revenues of $440 million during the first quarter, up 22% over last year's first quarter. EBITDA came in at $36.1 million, an 8% increase over the prior year quarter. Turning to our consolidated cash flow, we generated more than $50 million before working capital changes, a modest increase over last year's first quarter. We expect total CapEx for the year to come in at $85 million to $90 million lower than the $100 million target we provided at the outset of the year, with the normalized portion in the $65 million to $70 million range and tracking within our typical 20% of EBITDA level. We ended the first quarter with net debt of $515 million, resulting in leverage as measured by net debt to trailing 12 months EBITDA at a conservative 1.5 times and relatively in line with year-end. Your line is open. Your line is open. Your line is open. I mean, home improvement, Century Fire, all over 20% plus and at First Onsite more a headwind in fact grew modestly organically even in the face of $35 million of Texas freeze work last year. Your line is open. Your line is open."
}