{
    "symbol": "JKS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-26 11:54:05",
    "content": " Total solar shipments in the second quarter were 10.5 GW, module shipments in the second quarter were 10.2 GW, up roughly 27% sequentially, and the total revenues were USUS$2.81 billion, up 27.6% sequentially. According to the Statistics and Analysis of China's customâ\u0080\u0099s export data by InfoLinks, China's exports of modules in the first half of the year reached 8.7 gigawatts, a year-over-year increase of well 2%. The 16 gigawatts of TOPCon cell capacity that started production at the beginning of the year, reached full production at the end of the second quarter with mass production efficiency of over 24.8% and yield rates and integrated costs in line with our expectations. Due to significant increase in the company's stock price in the second quarter, we recognized a loss from a change in fair value of the convertible senior notes of US$ 80 million in this second quarter. Excluding the impact of the convertible senior notes and the share-based compensation expenses, adjusted net income attributable to the JinkoSolar Holding Co., Ltd. ordinary shareholders in the second quarter was US$ 55 million, improving sequentially. The increase is -- will mainly attribute to an increase in shipping costs for solar modules, an increase in disposal and impairment loss on property, plant and equipment, and an increase in share-based compensation expenses Total operating expenses accounted for about 16% of total revenues in the second quarter, up from about 15% in the first quarter and a 13% in the second quarter last year. Due to the continued appreciation of the U.S. dollar against RMB, we realized a net foreign exchange gain, including change in fair value of foreign exchange derivatives of approximately US$34 million in the second quarter this year compared with a net gain of US$12 million in the first quarter. As I look at the unit shipments that you had in the second quarter and compare them to the unit shipments in the first quarter, it seems that your average price realized per module went down quarter-to-quarter and quite significantly by almost -- by about US$0.01 or maybe more than US$0.01. But the way we are pricing the product is to sharing the benefit together with the customer, itâ\u0080\u0099s not a competitive -- competition for, let's say, gaining negotiation, its really a benefit sharing model, which means that approximately, as I say, around -- by using Tiger Neo N-type products, the customers project can get additional benefit of around US$0.025 to US$0.03 per watt. Lastly, about the polysilicon prices, we believe in the long run, like Charlie is saying in the previous conversations, we believe the polysilicon will become -- will be debottlenecked in the next coming, let's say, quarters, and -- which will create a bigger market for solar installation in the downstream, especially for the utility project, which has been significantly delayed due to the CapEx a problem."
}