{
    "symbol": "JKS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 12:14:05",
    "content": " Managing from a capacity release and higher client acceptance shipments for N-type modules were roughly 3-gigawatt in the third quarter, an increase of nearly 160% sequentially. Despite short-term headwinds such as power reasoning measures and earthquake, I total shipments in the third quarter were 10.9 GW, of which approximately 95% were module shipments doubling year-over-year on the back of the strong global demand. Solar module shipments to the Chinese market during the third quarter increase of five times year-over-year, while emerging market grew approximately 180% a year-over-year, and the Europe over 60%. In the third quarter shipment for Tiger Neo modules approach the approximately 3-gigawatts and increase of 160% sequentially, acceptance from where risk client types and markets for the Tiger Neo further increase. With gradual release of N-type capacity and increasing acceptance for Tiger Neo, shipments and the penetration for Tiger Neo continued to grow in the fourth quarter and the shipment proportion for Tiger Neo is expected to be about 60% of our total shipment in 2023. For business layout, EG demand remains strong in some market including Europe emerging markets in China, and EG business accounted for nearly 60% in the third quarter, about 10% higher than the last quarter. In terms of the growth for next year, I think, Gener, you talked about a 50% growth that matches with your year-end module capacity roughly. So incrementally, we are thinking next year and the China will dominate take maybe 40% or 50% from the incremental value, the volume, and the second one is the U.S. and the European markets, but U.S., we donâ\u0080\u0099t believe it is demand concerns. So based on our initial evaluations, we think we are able to deliver around 60% N-type TOPCon module next year. I would like to know on what percentage you expect your fourth quarter shipment will be shipped to China, because I can see that in the third quarter it is around 40 something percent, maybe close to 50%."
}