{
    "symbol": "LHX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-28 10:43:06",
    "content": " Please proceed with your question. But just to give a little bit more color in terms of margins, how it's playing out in 2022 and how we're thinking about 2023, to Chris' opening comments, we did reduce our guide to 15.5 from an overall segment perspective, really driven by two things. Higher input costs, whether it be supply chain, labor, inflation, along with things like redesigning parts internally to ensure we can continue to meet our customers' critical missions, all of that is equating to about a $250 million incremental cost headwind for us in 2022, of which we are doing what we can to control the controllables, and we've been able to successfully offset about 70% of that increased cost across the overall ecosystem. Please proceed with your question. And so as we went through our strategic plan over the last month, along with the updated DoD budgets, and really aligning with what we've been highlighting the areas of focus from a customer perspective to what we're seeing within our overall product portfolio, this is really just a continuation of two of our legacy businesses where we've highlighted risk associated with these businesses as we're investing in areas from a DoD perspective, like space and cyber. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. But as we think about going into next year, what does that look like is we're going to -- we're assuming that it's going to continue to be volatile. And so I think that's one of the advantages that we have, given our shorter cycle nature, but it also plays into how are we thinking about guidance for next year and going back to -- there's multiple variables that we're taking into consideration, that being one of them. And to your supply chain question, I should have emphasized we're continuing to redesign our existing products, in the old days, I think a lot of companies had a process that focused on design for cost, given the focus on affordability. Please proceed with your question. Please proceed with your question. I think it's important to note with these two businesses that, we've been illuminating for a while that they're on the lower end of the portfolio from a growth perspective."
}