{
    "symbol": "ODC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-14 15:15:03",
    "content": " Aaron Christiansen, Vice President of Operations, Chris Lamson, Group VP of Retail and Wholesale, Jessica Moskowitz, VP and General Manager of Consumer Products Division, Wade Robey, VP of Agriculture & Amlin Marketing, Laura Scheland, Vice President of Strategic Partnerships and General Counsel, David Atkinson, VP Controller and last but not the least Leslie Garber, our Manager of Investor Relations. On today's call, comments may contain forward-looking statements regarding the Company's performance in future periods. In our press release and in our SEC filings, we highlight a number of important risk factors, trends and uncertainties that may affect our future performance. And before I turn it over to Susan for a financial review of the highlights of the quarter, Iâ\u0080\u0099d just like to say youâ\u0080\u0099re seeing a good â\u0080\u0093 we delivered a good quarter. We still have a long way to go, given the pandemic, the war, supply chain disruption, high inflation, and everything else that's going on in the world, we felt good that we finally got our prices, not where they need to be, but at least strong enough to return us to profitability and earnings. Well, we only made just under 19 points in the quarter. So well, we clearly feel good about the income we made. Trust me, we are not done, we still have to get the business back to where it was. And it's really in everyone's best interest, not just our shareholders and our teammates, but our customers, because we need to have the financial health to continue to invest in our business, you can see almost every segment is growing rapidly. And that growth not only requires more working capital, but also a greater capital expenditure focus on our plants. And as I mentioned in the release, very hopeful, cautiously optimistic that the momentum will carry off over into the first quarter of what is fiscal 2023. So in responding to some of your prior feedback, I'm going to keep my comments really brief and leave more time for Q&A. As we exited the third quarter, we started talking about momentum that we were seeing and we continued to see that in during the fourth quarter and into the first. You'll note our fourth quarter results revenue of $93 million, or 19%, year-over-year, so the momentum continued. And if I dive into that just a little bit to give you an idea, about 75% of that was based on pricing the other 25% on volume. If we talk about that a little bit by segment in retail and wholesale 87% of their growth during the fourth quarter on the revenue line was based on pricing, 13% on volume, whereas in B2B it was more balanced, it was 51% price, 49% volume. So we continued to achieve improved gross profit during the fourth quarter, moving that back up to 18.8%, still below our pre pandemic levels, but definitely with the momentum moving in the right direction. We continue to seek price increases to cover the inflation we are experiencing on multiple fronts, like many others in raw materials and energy, transportation, labor and even other areas. So those are kind of the key highlights in the momentum we knew don't focus on, there was a note in there about a subsequent event. But at a high level, basically, our most recent actuarial value indicates that our plan is essentially fully funded. So as we move to terminate, we expect that there'll be no material cash draws on the company, and that we'll be able to pay most of the liabilities settle most of that with assets that are in our pension. We've actually shifted those assets into a presentation mode to make sure that as we're trying to wind this pension down, we don't get hit with equity market losses. We expect that this will be terminated within the next 12 months, so just a little highlight there on what's going on. You can also submit questions if you want using the after question field on the webcast and select, click submit. Okay, our first question comes from Bob  from Center for Performance Investing. And his question is, during the last call, you referenced budgeting $40 million in revenues for fiscal 2023 for Amlin. And look, as I said, Even last quarter, it was very much a startup mode, and it's hit or miss. We have a lot of trials, we have repeat business. So I don't know if that helps you, Bob, but we're still cautiously optimistic. We've got a bunch of trials going on, and the initial results are very positive. So Aaron Christiansen, our VP of Operations will answer that, but there's a second part to his question. And that the second part was, what is the status of share buybacks and Susan Kreh will take over after Aaron's done. The first element of your question, we are seeing flattening of input costs, and even some signs of mild compression, notably in a number of areas of our packaging costs, similar in the area of utilities, natural gas and diesel, which are key cost drivers for us. So it's fantastic to be in a place we absolutely have seen flattening, and there's some hope and expectation that we continue to see mild compression. To your question about freight availability and cost, I need to really split my answer up into two parts. Export freight continues to be extraordinarily expensive and unavailable, not unique to Oil-Dri. We are trying to adapt and overcome in ways where we carry more local domestic freight to ensure we can be ready to ship when the equipment's available, and the same on the other end. In order of our cash priorities, that's one of the lower ones. And you see our commitment to capital spending, ratcheting up a little bit year-over-year as we can fund some of these growth opportunities for Amlin and other growth initiatives. And in order to support some of our foreign businesses, Aaron mentioned the logistics for some of those are longer and longer. So I'd say at this point in time, we don't have any plan to do any but that's always just something we evaluate on an on-going basis. The function of both strong demand and yes, our demand is strong, especially across the more strategic segments of our business to include lightweight litter, but also the supply chain malaise that was certainly not unique to us, right. As you see in the results, of course, volume has been tempered a little bit, by the pricing marketplace, the category showing a little bit of elasticity amount of time. So as we as we think about that, going forward, we are starting to reinvest in trade, and do it in a rational way that the drives good pay out for us. And candidly, we're able to see that across our competition as well. So when we look into Nielsen, we see the other players in the cat litter category, doing the same, getting back into trade promotion, as the supply malaise is has lifted and specifically for us, Aaron and his team have done a fantastic job getting us back into a position where we can we can fully meet demand and promote the business. You know, Leslie, your audio was really rough, I'll read the question. As it relates to Amlin, do you feel that F â\u0080\u009823 will be the true inflection point leading to continued accelerated growth in absolute terms, if not percentage-wise. But when we look around our key markets and outreach products and what they can do, I donâ\u0080\u0099t think that a great fit. As we look around the world, as Dan said, You see in spite of the pandemic, and other things that have been going on obviously over the over the last year, we see a continued growth in the consumption of protein, by folks by people. Our products are very well positioned for those markets, we not only pursue the poultry industry and swine industry, kind of as a first targets of interest. As you know, we've also launched a portfolio in the U.S. as well, which is one of the largest markets in the world, obviously in a number of those species. So we're excited about the growth prospects, the market is a very large opportunity for Amlin, not only in the traditional markets of grain preservation or preventing micro toxicosis, but also an antibiotic replacement as more and more customers more and more regions of the world remove drugs, other pharmaceuticals, like antibiotics, and seek to pursue natural solutions. From John Bear, geographically widespread Avian Flu outbreaks in the U.S. this year has resulted in the culling of large numbers of poultry flocks, but has not been widely publicized. Yes, its part of the reason it's not as widely publicized is that this is not an infrequent thing that happens. Every few years we tend to have outbreaks of Avian influenza, and specifically H5N1 which is the common one we have here. As you know, we've had about little over 47 million birds impacted and with Avian influenza, when that happens, depopulation is really the only thing you can do and then repopulation as you know. We, when these sorts of situations are occurring, there's quarantines that exist. And so that has made it a little bit more challenging, but I don't believe has really significantly impeded our ability to penetrate the market. But the repopulation is very rapid, the United States and frankly, other regions of the world have very strong ability, very quick ability to repopulate their flocks, their herds. So market is pretty stable, we're actually going to see hopefully some growth in the U.S. in the coming year. So no, it really hasn't impacted our business in a negative way. So I'll just synthesize them, what impact what a recession if and when it comes in the United States have on your business. As you know, we're very domestically focused 90% ish of our business occurs in the United States. Maybe I'm a little high on that, but it's definitely in the in the high 80s. And so but the good news is that our products are primarily focused on pets, food, and renewables, all which are fairly recession proof, as they have been in the past. If you zero in on the pet segment, which is our largest business, the market really bifurcates; you get the people who are going to trade down to try and save money. And then you actually get the people who go for a super premiumization, because they're just afraid to make a mistake. But on the value side, our brands are popularly priced; a lot of them are OPP, the opening price point where they are. We are definitely weighted heavily towards retailers who focus on value like Walmart, and the dollar stores and so forth. But lately, with the advent of lightweight litters, we have a large share of the lightweight private label business in the United States and Canada. But we don't feel it would have a real negative impact on our business, and could possibly even create some additional opportunities. All right, we'll go with -- can you give me a number for the total addressable market, TAM and a more narrow this will get relating to Amlin by the way, and a more narrow, realistic manner than the broad numbers that have been bandied about, and what might be a market share figure you are looking for to capture of that TAM in the next few years. So when we talked about the market opportunity in the animal and nutrition and health business, we've tried to be clear in that it's very broad the opportunities very large across the world. There are, there are different levels of market opportunity in the various world areas. But as we look at a market like grain preservation, which is kind of in the core technology area that that Amlin has pursued with our cloud based minerals. Now we obviously don't, we don't focus on the front end crops in the field or in storage. When we look at the replacement of antibiotics or the removal of other pharmaceuticals, whether it be again antibiotics or even in cereals that's a very large market around the world. It's been bandied about that that's closer to 5 billion, 6 billion now that has come down a bit as people have removed antibiotics but it's still a an enormous market. No, we're focusing in world areas like the United States, Latin America, Asia. So some of that is not available to us, but it's still a multibillion dollar opportunity. As we look at market share, there's a lot of players in this space. So if we conservatively look at a, 8%, 10% market share in time, obviously, that would be a substantial business for Amlin and for Oil-Dri. We hope we can grow larger than that, but that will take more additions to our portfolio, and broader participation in some of these other markets, we're not focusing on today. But a lot of headspace, a huge opportunity for the company as we grow our portfolio and demonstrate the efficacy of our products. I'm going to ask you one more, and then I have one for Chris Lamson. I, just the second part of Ethan's question we already covered. The first part is primarily but how was Amlinâ\u0080\u0099s participation in recent industry conventions, trade shows, helped drive interest in and awareness of its product. Recently, we were part of the World Dairy Expo last week in Madison, Wisconsin, itâ\u0080\u0099s another industry sector we're targeting. On the dairy side, again, tremendous interest we did, I think a dozen interviews with the media, a lot of engagement with customers. As we look out into the future, we'll be again having a prominent exposition at the International poultry show in January in Atlanta. And then again, VIV in Asia in Bangkok in March, which will really supplement what we do at IPPE and really give us a global impact in the coming year. Jessica, maybe you'll take it first. And I'll add, using Canada as a beta site, we kind of know how high itâ\u0080\u0099s up there. So just to maybe talk a little bit about what's going on in Canada, and then what the share is in the U.S., and then what things we can do to help close the gap. Yes, so we've seen a great case study in Canada where lightweight has significantly taken over the market and continues to gain share of the overall Canadian market. We view that as a significant opportunity where, our share within the U.S. is closer to 18% to 20%. The lightweight overall share of the market, and we do a couple of things in terms of being able to really close that gap to Dan's point. As Dan like to say, who wouldn't switch to lightweight if price were, if price value were equal and quality were equal, what consumer wouldn't want to switch to lightweight cat litter just given that key pain point of having to lift a heavy jug of cat litter to and from the store as well as in your in your home and upstairs. And Jess, part the only thing I'd add maybe a little bit more tactically and near in and I won't name names. We have a case study recently where we had a retailer that from a per use perspective was pricing their private label, lightweight, higher than their private label heavyweight. And, lo and behold, there, they've now aligned price them on a per use basis. And, and the lightweight business there as private label, lightweight business has grown faster than ever. She talked about product, there's price value on the shelf, and we're looking to what we don't control that influences. And then I would add, sometimes it's better to be lucky than good. And we're both on this one because the global trend, and then the specific trend in the United States towards ESG is only growing, and that genie is not going back in the bottle. And if the whole United States converted to lightweight, you can reduce the carbon footprint by about 40%, which is huge. And I know using the liquid detergent switch to concentrate, which I've referenced before in the past, that's what gave us the idea for lightweight. And once Walmart saw that it was here to stay and working, they actually forced the retailers to convert, they basically just said we're going concentrated and you either eat you have 12 months to reformulate, or you're going to be off our shelves. Say look, it's clearly here to stay. So you're talking about the primary markets for cat litter, the Northeast, the Southeast, and there's no sodium bentonite, east of Wyoming pretty much. And I think if you factored in the freight, you would probably even get a greater than 40% carbon footprint reduction. So anyway, we're very bullish on lightweight. It's also good for the consumer, and it's also good for the environment. I want to thank everybody I do like this format, we're able to answer more questions, stay more focused."
}