{
    "symbol": "PERI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 12:52:06",
    "content": " For the revenue side, we are showing a 30% year-over-year growth in 2022 that demonstrates once again that we are able to follow the trends in media spending, for example consumer awareness of privacy and the increase of viewers that watch live sports events on their smart TVs, leading to huge demand for high impact live CTV. Ad campaigns using SORT represented $26 million, up 82% quarter-over-quarter, reaching 21% of advertising revenue. Revenue for the fourth quarter was $209.7 million, reflecting 33% year-over-year growth. The revenue of the fourth quarter of 2022 was $209.7 million, an increase of 33% year-over-year, reflecting a strong continued three-year CAGR of 33%. The revenue of the full year 2022 was $640.3 million, an increase of 34% year-over-year, reflecting a strong continued three-year CAGR of 40%. Fourth quarter display advertising revenue increased by 24% year-over-year to $123.8 million, 59% of total revenue. Fourth quarter search advertising revenue increased by 49% year-over-year to $85.9 million, driven by a growing trend of advertising favoring our high intent direct response advertising. Fourth quarter adjusted EBITDA was $48.2 million, reflecting 67% year-over-year growth. Adjusted EBITDA margin was 23% compared with 18% last year, while adjusted EBITDA to revenue excluding TAC increased from 45% in the fourth quarter of 2021 to 55% in the fourth quarter of 2022. On a CAGR basis, fourth quarter net income was $38.7 million or $0.79 per diluted share, an increase of 119% compared with $17.7 million or $0.44 per diluted share in the fourth quarter of 2021. On a non-GAAP basis, fourth quarter net income was $44.7 million or $0.19 per diluted share, an increase of 77% compared with $25.3 million or $0.62 per diluted share in the fourth quarter of 2021. Fourth quarter operating cash flow was $38.2 million compared with $28.8 million in the fourth quarter of 2021, reflecting 32% year-over-year growth. The other thing is if advertisers would be willing to spend more because we believe that the demand will be higher, it will increase the RPM, so with those two factors by itself, and Iâ\u0080\u0099m not here talking about any kind of technology cooperation or something that weâ\u0080\u0099re able to do this, only by that, I have no doubt that we will benefit from I think what Microsoft Bing is doing, and itâ\u0080\u0099s all about giving a fight to Google and become more dominant from the 3% market share that they have today, so thatâ\u0080\u0099s clear."
}