{
    "symbol": "PERI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 14:23:10",
    "content": " So earlier today, we've been reported that the first quarter of 2022 was a record for revenue and EBITDA, revenue first, but I very much would like to emphasize on this call that even though it's a huge growth, it is definitely not the onetime event. And that's the reason I would like very much to share with you that in the last three years and that's the reason I highlighted here the first quarter of 2029 -- the first quarter of 2022 the first quarter of 2029 the 2021 and of course, the current quarter, where you're able to see that this is a sustained and predictable business model, which is very much the theme of my presentation today. Just to give you an example of the changes and how we supply to our business from a diversification standpoint, you're able to see the shift that is happened in the company between last year and this year, while last year, search advertising was 58% of our business and display was only 42%. And I use the same type of format, which we're not just talking about the 158% year-over-year growth between the first quarter of 2021 to the first quarter of 2022. I would like to emphasize the point that this is the continuous growth of our EBITDA and very much has to do with two main drivers that help us to increase our net margin to get them to a point where we were on below 20% of EBITDA to revenue ex-tax to a number which we're so proud of, that our EBITDA percentage is 42%, EBITDA to revenue, excluding media cost, 42%. And I would very much would like to focus because it's a key differentiator for our company, the ability very much to connect all assets, demand and supply into a central intelligent Hub, iHub, that allows us to drive scalable operational efficiency and improved media margin, as Maoz will talk about it in his presentation. From a search advertising standpoint, the numbers, we grew our business by 10% between the first quarter of 2021 to the first quarter of 2022. Adjusted EBITDA of $22.7 million, 18% from revenue compared to 10% last year, a new record with 158 year-over-year growth, the highest first quarter adjusted EBITDA ever. Display advertising revenue was $68.6 million, during the first quarter of 2022, up 80% an increase of 52% on a pro forma basis. Sales advertising revenue was $56.7 million during the first quarter of 2022, an increase of 10% year-over-year. Adjusted EBITDA increased by 158% year-over-year to $22.7 million in the first quarter of 2022, representing 18% of revenue compared to $8.8 million, representing 10% of revenue in the first quarter of 2021. Net cash provided by operating activities was $23.6 million compared to $13.5 million in the first quarter of 2021, reflecting a 75% year-over-year growth. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live. Your line is now live."
}