{
    "symbol": "VECO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 23:05:06",
    "content": " Revenue for the full year was $646 million, 11% growth over 2021. Revenue came in at $154 million on strength in our semiconductor market, and we achieved non GAAP operating income of $24 million, leading to diluted non-GAAP EPS of $0.38. Now breaking down our full year revenue of $646 million by market, our semiconductor revenue was $369 million, which represented 57% of the total and an increase of 50% over the prior year. Compound semiconductor revenue was $121 million, up 13% from 2021 and made up 19% of the total. In line with our expectations, as hard disk drive customers slow their pace of capacity additions for magnetic head manufacturing and scientific and other revenue was $68 million, an increases 12% from 2021 and made up 11% of total revenue. And now looking at our full year revenue by region, our Asia Pacific region, excluding China made up 36%, driven by semiconductor customers, the United States made up 31% of total revenue, driven by semiconductor and data storage customers. Now turning to full year 2022 non-GAAP operating results, we achieve gross margin of 42%, which is in line with our annual guided range, our operating expenses increased to $171 million, reflecting the R&D investments we've been making in semiconductor and compound semiconductor to execute our growth strategy. GAAP net income of $167 million included a tax benefit of $116 million, primarily from the reversal of our valuation allowance in the fourth quarter After considering recent significant positive evidence, including a consistent pattern of earnings in the past three years as well as forecasts of future earnings, it was determined that evaluation allowance was no longer required for US Federal and certain state net deferred tax assets. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}