{
    "symbol": "CHTR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-27 12:02:07",
    "content": " It's about having the fastest connectivity and products and pricing and packaging that's difficult for customers to replicate, and putting that all together so that we provide more product into the household, more penetration across our passings and then marrying that with high-quality service with fewer service transactions and lower churn. Residential revenue per customer relationship was flat year-over-year, with promotional rate step-ups and rate adjustments, offset by a higher mix of non-video customers and a higher mix of lower-priced video packages within our base. Other revenue grew by 4.9% year-over-year, mostly driven by higher rural construction initiatives subsidies, partly offset by lower processing fees and lower video CPE sold to customers. Programming costs declined by 3.3% year-over-year due to a decline in video customers year-over-year, and a higher mix of lighter video packages, partly offset by higher programming rates. Cost to service customers increased by 5.8% year-over-year, driven by higher labor costs, higher fuel and freight costs and higher bad debt, partly offset by productivity improvements. Fourth quarter capital spending of $2.9 billion rose above last year's fourth quarter spend of $2.1 billion, primarily driven by higher line extension spend driven by our rural construction initiative. Capital expenditures, excluding line extensions, increased from $1.6 billion in last year's fourth quarter to $2 billion this quarter, driven by investment in network evolution, higher customer premise equipment spend on advanced WiFi equipment and timing of spend. If you use the cost per passing that I mentioned a moment ago, a high broadband penetration assumption, which we think is reasonable, our current ARPU, excluding mobile, a high incremental margin based on low incremental overhead costs and a reasonable terminal multiple or perpetuity growth rate, you can clearly see the very attractive IRRs associated with our rural builds. So 75%, 80% of the lines came from existing Internet customers upgrading, which means they're paying lines, maybe get the second line for free or the third line paid for the majority of those being paying lines, which means the inverse of that is that new connects are also attaching with mobile as well. For programming per sub cost, the reason that they remain flat year-over-year that, that's our expectation, really has to do with customer mix and whether customers are taking sort of packages that have larger channel sets or more premiums or whether they continue to be priced out of those packages and come into some skinnier packages where the programming cost per sub is less."
}