{
    "symbol": "PDCO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-03-02 12:44:01",
    "content": " 04:29 Even in light of the Omicron impact in the quarter, our team remained focused on delivering value to our customers, highlighted by a number of key factors including delivering solid top line growth, and gross margin expansion across our total overall business, driving gross margin and adjusted operating margin improvement in both our Dental and Animal Health business segments, and achieving adjusted earnings per share for the quarter of $0.55 and year-to-date adjusted earnings per diluted share of $1.56. These results were primarily driven by favorable contributions from vendor rebates, driven by our continued revenue performance, improved product mix with stronger sales of our higher margin products including private label products, software and value-added services, and overall, strong execution across the business even in light of the disruption from the Omicron variant and the ongoing industry wide supply chain challenges in the core equipment category. 20:02 Adjusted operating expenses as a percentage of net sales for the third quarter of fiscal 2022 were 16.7%, an increase of 40 basis points compared to the fiscal third quarter one year ago. 20:25 In the fiscal 2022 third quarter, our consolidated adjusted operating margin was 4.4% and down 20 basis points compared to the third quarter of last year. 25:02 Adjusted operating margins in dental were 10.1% in the fiscal third quarter and up 70 basis points from the third quarter of last year, driven by improved gross margin and continued expense discipline. Adjusted operating margins in our Animal Health segment were 3.4% in the fiscal third quarter, an increase of 10 basis points from the prior year. Your line is open. Your line is open. In terms of your question around margin enhancement, look, I think it also gets back to this discussion earlier Michael's question around mix, we continue to focus our teams across both of our businesses and mix and in the animal health space many similar opportunities around private label, equipment, technology, software and services and our teams are really focused on driving mix improvements to expand margins over time. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. So opportunities to make obviously outright acquisitions we've spoken on some of the things that we would prioritize their areas that would strengthen our value proposition, build and expand our presence in margin accretive product, software service areas, looking to build scale in our core business just several examples, or maybe the types of areas that would be a good fits for us, but also the idea of how we can partner with manufacturers or new companies that are entering the space that have products or services that could really take advantage of the scale and reach that Patterson has across both our Dental and Animal Health businesses. Your line is open."
}