{
    "symbol": "PDCO",
    "quarter": 1,
    "year": 2022,
    "date": "2021-09-02 12:00:11",
    "content": " We will also discuss free cash flow as defined in our earnings release, which is a non-GAAP measure, and also use the term internal sales to represent net sales adjusted to exclude the impact of foreign currency, changes in product selling relationships, contributions from recent acquisitions and the extra week of selling results in first quarter of fiscal 2022. Turning now to our animal health segment, as I mentioned earlier, our animal health segment also had a strong first quarter achieving internal sales growth of 17% year-over-year led by internal sales growth of 23% in our companion animal business with strong performance across both the US and the UK and internal sales growth of 8% in our production animal business. Consolidated report and sales for Patterson companies in our fiscal 2022 first quarter were $1.61 billion, an increase of 29.6% versus the first quarter one year ago. If we compare the dentals consumable performance to the pre-pandemic period of the first quarter of 2020, internal sales of dental consumables in the first quarter of fiscal 2022 increased 13.7%. When you look at our dental equipment performance compared to the pre-pandemic period of the first quarter of fiscal 2020, sales in the first quarter of fiscal 2022 increased 15.1% over that period. In the first quarter of fiscal 2022, internal sales for Animal Health business increased 16.5% compared to the first quarter of fiscal 2021. For some additional context on our performance that's also back two years ago to the comparable period before the impact of the pandemic, animal health internal sales for the first quarter of fiscal 2022 were up 16.2% compared to the first quarter of fiscal 2020. Adjusted operating margins in our animal health segment were 3.5% in the fiscal first quarter, an increase of 30 basis points from the prior year, even with the unfavorable comparison to the salary savings and furloughs last year. Your line is open. Please ask your question. Your line is open. Please ask your question. Your line is open. Please ask your question. And then just last one, I could ask maybe on dental equipment, just we continue to hear about some supply constraints, I think, especially on the basic equipment side, and especially with one manufacturer you do business with, I think, one or two others that you have a lesser exposure to, but just kind of, what's the state of supply out there heading into the last few months here of the calendar year anyway, and how to think about those supply constraints and how they might or might not impact the next quarter or two for you. Your line is open. Your line is open. Please ask your question. Your line is open. Please ask your question. Your line is open. Please ask your question. Your line is open. Please ask your question."
}