{
    "symbol": "PDCO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-29 14:42:04",
    "content": " Patterson Companies had an excellent fourth quarter fiscal '22 culminating a year of top-line growth, operating margin expansion and continuing to return cash to our shareholders. In our fourth quarter of fiscal '22, we achieved year-over-year internal sales growth of over 5% driven by double-digit growth in the dental equipment category. For the full '22 fiscal year, Patterson delivered record sales performance, post the internal sales growth over 9% year-over-year, with nearly 6% growth in dental and over 12% growth in animal health. During the fourth quarter of fiscal '22, we grew dental revenue nearly 3.5% driven by particularly strong performance in our equipment category. In our non-infection control portfolio products, Patterson achieved year-over-year revenue growth of 3% in the fiscal fourth quarter. As we grew the top-line, our dental segment also posted a strong 10% adjusted operating margin in the fiscal fourth quarter as a result of several key factors. In addition to top-line growth, the animal health segment achieved adjusted operating margin of 5% in the fiscal fourth quarter, an increase over the prior year of nearly 60 basis points. Consolidated reported sales for Patterson Companies in our fiscal '22 fourth quarter were 1.64 billion, an increase of 4.9% versus the fourth quarter one year ago. Internal sales for fiscal 2022 which are adjusted for the effects of currency translation changes in product selling relationships, contributions from recent acquisitions and the extra week of selling results in the first quarter of fiscal '22 increased 9.1% compared to fiscal '21. Our fourth quarter fiscal '22 adjusted gross margin was 21.2%, an improvement of 170 basis points compared to the year ago period. For the full fiscal year '22, our adjusted gross margin was 20.6% and improvement of 20 basis points compared to fiscal '21, similar to the fourth quarter gross margin, we achieved this expansion despite a 20 basis point headwind related to the impact of marking our equipment portfolio to market value. For the full fiscal year '22, adjusted operating expenses as a percentage of net sales were also 16.2% compared to 16.1% in fiscal '21. As a reminder, our adjusted operating expenses as a percentage of net sales for fiscal '21 benefited by 40 basis points from pandemic related salary reductions and furlough activities in the first quarter of the fiscal year. In the fiscal fourth quarter, our consolidated adjusted operating margin was 5.0% and improvement of 190 basis points compared to the fourth quarter of fiscal '21. Reported net income attributable to Patterson Companies Inc., for the fourth quarter of fiscal '22 was 63.9 million, or $0.65 per diluted share compared to 28.8 million or $0.30 per diluted share in the fourth quarter of fiscal '21. Adjusted net income attributable to Patterson Companies Inc., in the fiscal fourth quarter of fiscal '22 totaled 70.4 million or $0.71 per diluted share. For the full year of fiscal '22 reported net income attributable to Patterson Companies Inc., was 203.2 million, or $2.06 per diluted share, compared to $156 million or $1.61 per diluted share in fiscal '21. Adjusted net income attributable to Patterson Companies Inc., in fiscal '22, which excludes gains on investments, inventory donation charges, deal amortization, legal reserves and integration and business restructuring expenses totaled 223.7 million or $2.27 per diluted share, compared to $185 million or $1.91 per diluted share in the prior fiscal year. During our fiscal '22, fourth quarter internal sales of dental equipment and software increased 14.3% compared to the fourth quarter of fiscal '21 with double-digit growth of digital technology and CAD/CAM products and low single-digit growth of core equipment. Internal sales for our companion business increased 5.1% in the fourth quarter fiscal '22 compared to the prior year fourth quarter, and increased 14.9% for the full fiscal year '22, compared to fiscal '21. Adjusted operating margins in our animal health segment were 5.0% in the fiscal fourth quarter, an increase of 60 basis points compared to the fourth quarter of the prior year. If you remove the $0.04 per share benefit of the 53rd week from our fiscal '22 adjusted EPS performance, or fiscal '23, adjusted EPS expectations of $2.25 to $2.35, implies 3% year-over-year growth at the midpoint and 5% year-over-year growth at the top end of the range. Finally, we have modeled our adjusted earnings per share guidance for fiscal '23 to be more heavily weighted to the second half of the fiscal year than in fiscal '22, due to the extra week of sales in the first quarter of fiscal '22 and the timing of certain other factors. We delivered an excellent fourth quarter in fiscal '22 culminating a year of top-line growth, operating margin expansion and effective capital allocation. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}