{
    "symbol": "PDCO",
    "quarter": 2,
    "year": 2022,
    "date": "2021-12-01 13:52:18",
    "content": " As a result of the rapidly improving market from a year ago, coupled with the great execution by our team, Patterson delivered internal sales growth of 12% in the second quarter of fiscal ‘21, including strong performance in our consumables category driven partially by the spike in demand and pricing for infection control products. Given these dynamics in the year ago period, we believe it’s helpful to refer to some 2-year comparisons back to the pre-pandemic period of the second quarter of fiscal ‘20 to provide additional perspective regarding the underlying strength of Patterson’s financial performance. During the second quarter of fiscal ‘22, internal sales of dental consumables were down less than 1% compared to the prior year, yet increased 17% compared to the pre-pandemic period of the second quarter of fiscal 2020. On the equipment side, internal sales declined 3% during the second quarter of fiscal ‘21 compared to the second quarter of last year, but increased 2% when compared to the pre-pandemic period of 2 years ago. Turning now to our Animal Health segment, our Animal Health team continued their positive momentum and delivered a very strong second quarter, achieving fiscal ‘22 second quarter internal sales growth of 16% year-over-year and 24% growth compared to the second quarter of fiscal ‘20. As I mentioned at the start of my comments, we are very pleased with the results of our second quarter and through the first half of fiscal ‘22 across both our segments and all three of our end markets and proud of the continued focus and dedication of our entire Patterson team. As we did last quarter, due to the comparison dynamics to the market recovery from COVID-19 in the prior fiscal year, I will also refer to how our business is performing relative to the pre-pandemic period of the second quarter of fiscal 2020 as a more helpful way to understand our business performance as we have successfully managed through the pandemic within our respective markets. Consolidated reported sales for Patterson Companies in our fiscal 2022 second quarter were $1.65 billion, an increase of 6.2% versus the second quarter 1 year ago. Compared to the pre-pandemic second quarter of fiscal 2020, internal sales for our fiscal ‘22 second quarter increased 18.1%. In the fiscal 2022 second quarter, our consolidated adjusted operating margin was 4.5% and down 80 basis points compared to the second quarter of last year. In the second quarter of fiscal ‘22, internal sales for our Dental business decreased 2.0% compared to the second quarter of fiscal ‘21. As we planned out our fiscal ‘22 year, we knew the fiscal second quarter would be a difficult comparison relative to the dental market recovery last year when we grew our Dental business by 12%. On that basis, Dental internal sales for the second quarter of fiscal ‘22 are up 9.8% compared to the second quarter of fiscal 2020. In our fiscal 2022 second quarter, sales of our infection control products decreased by 13% year-over-year. On that basis, internal sales of Dental consumables in the second quarter of fiscal ‘22 have increased 16.7% compared to the second quarter of fiscal ‘20. And if you exclude the impact of infection control products, our non-infection control category in the second quarter of fiscal ‘22 increased 9% compared to the pre-pandemic period 2 years ago. In the second quarter of fiscal ‘22, internal sales for our Animal Health business increased 16.2% compared to the second quarter of fiscal ‘21. The Internal sales for our companion animal business increased 20.8% compared to the second quarter of last year, and internal sales in our production animal business grew 11.3% in the second quarter compared to the prior year. And for our production animal business, second quarter fiscal ‘22 internal sales increased 13.6% over the second quarter of fiscal ‘20. Adjusted operating margins in our Animal Health segment were 3.4% in the fiscal second quarter, an increase of 50 basis points from the prior year. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}