{
    "symbol": "FSR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 13:32:06",
    "content": "  Operator: Hello, everyone, and welcome to the Fisker Fourth Quarter and Full Year 2022 Earnings Call. Hello, and welcome, everyone, to Fisker's earnings call. As the operator mentioned, my name is Frank Boroch, VP of Investor Relations and Treasury here at Fisker. Joining me on today's call are Henrik Fisker, our Chief Executive Officer; Dr. Burkhard Huhnke, our Chief Technology Officer; and Dr. Geeta Gupta-Fisker, our Chief Financial Officer and Chief Operating Officer. We'll reference our financial measures that do not conform to generally accounting GAAP principles today -- during today's call, including non-GAAP operating expenses. Good morning, everyone, and thank you for joining us today. It's a little earlier than our usual timing, but we moved the call as we are all headed back to Austria this afternoon to continue our hands-on manufacturing and supplier engagement. I want to thank all the stakeholders, teams and partners for an amazing progress we have made in 2022. Of course, 2023 is an inflection year for Fisker as we reached industrialization and pivot from vehicle development to customer deliveries. The 850 strong Fisker team is hard at work readying our inaugural Fisker launches and Center+s, integrated with our trade-in and after sales service and repair partners, and uplifting our initial mobile service vans among many other key initiatives. These strengths were signed through this year, and it really is the basis for our business model. We will utilize a third-party vendor for customer title and registration services in the U.S. and EU, which will be integrated into Fisker's customer journey. We are also planning initial pop-up delivery sites, specifically in areas where we may not have opened delivery centers yet. Our flagship launches in Los Angeles and Munich, which are slated to open in mid-Q2, as you may remember, they were a bit delayed because of COVID, will be complemented by quickly expanding Center+s, including Vienna, Copenhagen and Stockholm, where we will offer test drives, services -- service and deliveries of our vehicles. We are currently in negotiations on more than a dozen properties for additional launches and Center+s, vehicle processing centers and service and pickup locations in the U.S. and Europe. Externally, we have nominated partners for after sales service and repair in key U.S. and European markets, providing broad geographic coverage for Ocean customers, right from the beginning. In addition to service partners, we have quickly expanded the Fisker collision repair network in the U.S. and Europe for certified high-quality EV repairs. Now, let's come to the Ocean update. The Ocean homologation testing is expected to be completed in March, which will be followed by regulatory approval processes. I had expected us to be farther along when we last spoke in November, but we encountered some testing delays due to weather and COVID absences and some complicated retest that slowed our process. We took on a lot by doing both U.S. and Europe homologation at the same time, but the ability to sell the Ocean in so many countries an important derisking strategy gives us the opportunity to increase sales and shift to whichever market offers the strongest growth. But I think once this is done, it's a huge advantage for us because we have also built out our complete service and sales network in Europe, so it really opens up endless possibilities for growth. And this reinforces our expectation that the Ocean will have the world's longest range of any SUV or Crossover priced below $70,000 or â\u0082¬70,000, and Burkhard would go into that detail later. And I would just say, I think it's going to be closer to 360 than 350. We obviously can't announce the exact numbers yet because they have to be verified by the two agencies, but we have run all these tests. And I want to say congratulations to our engineering team because they've done an amazing job in refining every little detail that attributes to getting this long range, more than we originally had expected because we actually use some of these vehicles from our start-up production to actually refine and refine and refine. And of course, there's not one element alone that makes this long range. It's really the genius, I would say, of our engineering team that has created this. And being a company that launched its first vehicle and achieved the world's longest range, I think, is pretty amazing, specifically because it's also an affordable vehicle. And I'm super excited when we get the final ratings, but they're going to be good. I, along with other senior leaders, have been based in Europe actually for the past few months, working closely with all our partners, preparing for production ramp, ensuring we deliver the highest quality possible Ocean from day one. And I have to say, I love walking around on the production line, talking to the skilled Magna people and employees about the product, about the quality, doing reviews right there with the cars as they come off the line. It's just fantastic to actually stand there with people, who has built cars, some of them for 20, 30 years, amazing high-quality cars. And they actually -- I would say, is the other way, almost learn from them exactly how you make such an amazing quality car. And I'm super excited about that, quite frankly. Last week, I oversaw the final extreme cold weather testing for powertrain and chassis systems. We also had our race car driver there Abbie Eaton, and of course, our engineers there as well. And I think what you really do on a lake like this, you actually push the car to an extreme and probably no normal customer will rarely ever do and it really shows how safe, how predictable, how well this car handles. And part of that is not just electronics and everything else, itâ\u0080\u0099s also the actual proportions of the vehicle. And if you don't get it optimized, you can do a lot of tricks with electronic suspension. But at the end of the day, this vehicle fundamentally has the right proportional setup, and that's something that is just making an amazing experience when you drive it. Geeta will discuss the supplier ramp in more detail, key risk we are managing and how we are working with our partners to support the ramp. We are confident we will be ready for customer deliveries once we have received the required regulatory certifications, and we maintain our 2023 production target of 42,400 units. Now, this is important because -- of course, supply chain has to deliver, and of course, there can be hiccups. And that is because of the amazing ability of Magna to ramp, and I'll give you the example. Yes, we only made 56 cars since November last year, but that was on purpose. Today and actually even last week and weeks before, Magna can already make 20 cars a day on average. That's 100 cars a week, already now. So, the key here -- the key takeaway is that when we are ramping up, specifically in Q2, we are going to have such a strong ramp that any units that may have been lost early on can easily be caught up later in the year. And that's why we maintain our guidance of 42,400 vehicles for the year, extremely important note here. Net reservations and orders now total approximately 65,000 for the Fisker Ocean, reflecting the large and growing global addressable market for a well-appointed electric SUV. As we start deliveries, we expect increased brand awareness to drive even more customer considerations and demand for the Ocean. We priced Ocean extremely competitively, considering the many proprietary features such as class-leading range, California Mode, solar sky, solar roof. Of course, the amount of horsepower in this vehicle for the price is amazing, the 17.1 inch rotating screen and digital 4D radar and on and on, I could keep on, on that. And as consumers have opportunities to interact in person with Ocean, we expect this value to increase and really resonate and drive even more sales. Our pop-ups continue to be very popular with the reservation holders and prospective customers, many of whom drove long distances to get their first glimpse of the Fisker Ocean, which shows how passionate and committed our customers are to the brand. And since our last earnings call, we also took the Ocean to six states in the U.S., Texas, New York, Florida, Las Vegas, Utah and California and also did pop up as many European countries. And I know there's been, of course, a few videos on social media about it, but those were all early preproduction versions of this user interface. The final user interface, I just want to tell you, it's amazing. When I go in the car -- and let me tell you, I actually hate computers, quite frankly. I'm really not good at and I don't know when I use them, they always break down. But I want to tell you, when you get in this car and use it, you don't need any instruction on how to use it. And that is what's really cool about this user interface, and that was all developed in-house. Now, also what is super cool, and I'm really impressed about what we have done in-house is the Ocean over-the-air update capabilities, and they are now complete. And then finally, the Ocean will come with advanced ADAS controller and sensor suite which is designed to be continuously updated through our OTA platform. It obviously also gives us endless opportunities to bring some really cool features to market later because the foundation is so advanced, like the digital radar, for example. We achieved our goal of a drivable PEAR prototype before year-end last year, which you may have seen me driving around in L.A., was quite fun actually. And then the vehicle sits a bit higher off the ground, and you also have a high seating position, even though it looks quite sporty. And that's really as perfect, specifically for city driving. And that is combined with this big canopy that huge round window, which I think today might be the most advanced front windscreen on a modern car because there's a lot of new rules and regulation on how to do front wind screens. So, we don't see these super round windscreens anymore that we used to see in the 60s, but we have actually achieved that. Finally, the dynamic shape has already undergone extensive aerodynamic testing in the windtunnel. We will offer two different battery packs because I also think because of the price and the size of the payer, this may be a second EV for many EV buyers that already love CVs and drive CVs. And therefore, they may not need to carry around a giant expensive battery if they're only using as a city car. We also have some super excited different interior variations, but we'll talk about that later. And that's important, the new automotive specification, because that's how we achieved the base price of $29,900. We did release some new images today, so maybe that'll pop up a bit as well. And then finally here, I want to talk a bit about our future product portfolio, because at the end of the day, we do have our goal to reach 1 million vehicles per year. So, later this year at our inaugural Investor Day event, we expect to showcase our future -- at least some of our future product portfolio with several durable prototypes. And they will all be in new segments, and we are we are still keeping our promise of always having at least four unique features in each vehicle. So, we will showcase the PEAR, which has some amazing features never been seen before on any vehicle. There's another cool thing about this pickup truck and that is that we actually are able to use a lot of the Ocean components in that vehicle, which means we're going to be able to do it faster and more affordable. It's going to look really, really tough, but still beautiful. Anyway, I can get carried away when I talk about products. Additionally, as we prepare for our next annual ESG impact report, we have completed our life cycle assessment for the Fisker Ocean. And based on our foundation of transparency and to lead the auto industry, we expect to publish this LCA or life cycle assessment during the first half of this year. We are super excited to share the results, furthering our leadership in sustainability. In addition, based on all our hard work and public disclosures, Sustainalytics -- the Sustainalytics recently upgraded Fisker 40 spots in global automotive industry rating. So, I want to come back and say, I am super excited. I'm excited to get on the plane back to Magna, see the cars. But I want to say one thing that's really the surprise here, and Geeta will go into details on that. And just think about this for a moment, because what we could do, not that we want to, but we could essentially just abandon all our future programs and just live up the Ocean. And there is no other start-up that I'm aware of that makes EVs that is profitable from the get-go, from the first year. So, I'm going to hand it over to Burkhard to talk some more about other exciting things. Out of the entire vehicle development process, the final stage that we are currently in has always been my passion, encompassing aspects such as EE integration and final ADAS validation. Getting into the details of final tuning, especially around software debugging, excites me, as I see the tangible progress we are making each day towards completing the development of a truly spectacular product. Beginning with the Fisker Ocean, final engineering testing and validation has progressed quite well over the last few months. We are currently in the Ocean certification process to confirm all safety requirements, and we continue progressing through the homologation phase. I want to commend our teams who have been fully committed to the extensive homologation testing process over the past few months, which has taken longer than originally expected. Let's unpack the homologation process a bit, which comprises multiple phases. We start with supervised testing followed by documentation, some of which can be done in parallel with a testing component. Then, we submit final testing results to regulators followed by regulatory review and approval, then assurance of certificates, which is U.S. EPA certificate on conformity in the U.S., the European Whole Vehicle Type Approval certificate that enable us to sell vehicles. First, we are the only startup that is homologating an advanced vehicle simultaneously in both North America and Europe that will apply to approximately 20 countries. There are over 100 regulations and around 270 various tests, covering everything from crash testing to software readiness and requires coordination with multiple regulatory authorities. But once this is achieved, it gives us the opportunity to launch in various markets, derisk the total addressable market and grow our brand in these critical markets. Whatâ\u0080\u0099s more even stricter regulation supply for model year 2023, including increased safety standards and cybersecurity rules requiring hardened performance, all of which we now have to fulfill. The new regulations became effective for this model year, including cybersecurity rules requiring hardened performance, spanning every level of control unit to the pipeline and the cloud to ensure functional safety resilience. We expect both, European WVTA testing and U.S. FMVSS self certification testing should be completed in March. Through our various final testing, we have confirmed that the Ocean's performance is amazing as we planned. We've taken early feedback on driving dynamics, also for instance, from automotive genres and have implemented those changes into the vehicle. Vehicle dynamics and ride tuning is complete, firmed with serious parts and tires in both warm and cold weather conditions. With the 56 vehicles we have produced post SOP, we saw there were certain areas where we needed to improve and strengthen the software at supplier level and in terms of integration, which is crucial for seamless high-quality experience. Unlike the hardware aspect of the vehicle, we expect continual innovation and progress with the vehicle software. We are taking advantage of the valuable time we have until homologation certification is complete to deep dive into all possible customer scenarios, debug and perform additional testing to provide customers with the best experience upon delivery. For example, the Ocean comes equipped with a great set of base ADAS features. The Oceanâ\u0080\u0099s ADAS functionality is very competitive and comparable to that seen in premium German brands, as Henrik alluded, too. However, there is more validation work needed to finalize our FI pilot ADAS system in the Ocean. In terms of OTA readiness, we have successfully implemented OTA updates of key domain controllers, like ADAS, including its sensor set or vehicle control unit or cockpit computer, to name a few. All of the OTA components from ECU component level to Fisker pipeline and cloud have been reviewed by a third party and have been proven to be functionally safe and ISO 26262 compliant and furthermore, cybersecurity compliant following ISO 21434. Similarly, the Ocean multimedia integration is quite impressive. And in cooperation with a leading sound studio, our multimedia experience has been optimized for low NVH and implemented with our unique UI, so users can enjoy a premium hassle free experience. While we are currently focused on launch activities for the Ocean, PEAR engineering continues to ramp up, and we have made great progress by utilizing our India lab. The PEAR will have a truly revolutionary electrical architecture with the many ECUs in the traditional vehicle consolidated down to just a few central computer units, which we call the Blade computer. This enables us to execute a fully next-generation electrical architecture for Fisker PEAR, which will be a software-driven car of the future. We have organized ourselves very well to collaborate seamlessly across our Los Angeles, Europe and India teams and time zones and to fight the ongoing impact from COVID. I'm extremely excited to be here today, and I want to start my remarks by thanking the entire Fisker team and all our partners and suppliers for continued hard work and persistence to launch an amazing vehicle. Building an innovative global EV brand is challenging, and our team remains focused on execution, no matter the obstacles and on delivering a very high-quality disruptive vehicle. I guess, that's more of my COO hat than my CFO hat, and quite frankly, I'm loving it. During the year-end holiday shutdown, at Magna Steyr, we completed the final modifications on equipment processes and structure and facility installation and integration work that involved 25-plus vendors and over 300-plus construction workers. In parallel to manufacturing plant readiness, we had an increased presence of various suppliers in January and February on site at Magna Steyr, who are committed to supporting us during this launch phase. We have completed EDI integrations with all our suppliers and collars issued for near-term Q1, Q2, along with '23 calendar year annual rolling forecast that has been released. Long-lead material ordering commitments for critical items, such as batteries and drive units have been confirmed with suppliers. Material planning and preproduction teams are in constant communication, sometimes on a daily basis, multiple times a day with suppliers in EU, China and North America to make sure parts ordering is on schedule based on lead times and management of delivery to support the logistic modes Ocean truck and rail. And our China consolidation center is fully operational, executing Q1, Q2 material received and shipping out of China to Graz to support our production schedule. We expect to begin receiving parts in March in Graz, most likely spread out over the month as suppliers ramp up, and we synchronize just-in-time logistics for all the parts. As we start getting initial parts and subsequentially ramp up in Q2, any part shortages may now become more obvious. And as Henrik mentioned, the slow ramp-up was a very good decision to allow suppliers to ramp up parts with high quality. Specifically, one of our TS one suppliers is constrained during this ramp-up period, and we are working jointly with them to try and compress this time line. We are partnering with logistical experts to manage the timing and flow of our components for all parts out of Europe and North America, Magna Steyr is executing logistics and managing shipping patterns based on plant production schedules. For critical components like batteries with long lead and long transit times, we have partnered with a professional service provider Maersk who is managing our end-to-end shipments from China, including storing the batteries in Europe and managing the on-time delivery to the assembly plant. Whilst I was in Austria I visited the state-of-the-art 3,000 square meter battery storage facilities, which is only 40 miles from Magna's plant, and it supplements battery safety stock on site at Magna. Now, we've seen continued improvements in commodity and logistics costs. Battery raw material prices, such as nickel and cobalt are down meaningfully from peaks, while lithium carbonate has started to ease in recent months. I had an excellent discussion with our partner CATL in China, and they have assured us that Fisker will get the best prices as material prices come down. Now, we are even starting to hear industry watchers discuss potential oversupply of battery materials in the future. Logistic costs and container prices have reduced meaningfully as more container capacity has become available, and we frankly saw this as Maersk were shipping batteries from China to Graz. For example, Ocean freight costs are approximately 70% lower than a year ago. As a digital direct-to-consumer brand, our online ecosystem is a critical platform for interacting with our customers and connecting them with their vehicles. The benefits of the new Fisker app are as follows: Number one, new My Fisker account profile management hub for reservations and orders, which I personally architected with the team. Number two, new Ocean ordering process, including a price estimator with delivery, trade-in and financing choices, which is an excellent task force that was done between marketing, between finance teams, between IT teams, a seamless collaboration completely developed in-house. And finally, an enhanced 3D configurator with the most up-to-date product information, packages, options and accessories, and I must say it is one of the most easy-to-use configurators out there. Fourth quarter revenue totaled $306,000 driven by sales of Fisker branding, home charging solutions and merchandise. As of year-end, in 2022, these vehicles were still on our books as we built them in December. In January, Magna started using these vehicles for data collection, improvements and validating additional features to be added in months to come. Due to planned vehicle use, revenue recognition per GAAP does not apply. Our Q4 operating expenses were $178 million or $176 million ex stock compensation expense, while capital expenditures came in at $34 million for the quarter. Full year OpEx and CapEx of $702 million, excluding stock compensation expense, came in below the low end of our guidance range of $715 million to $790 million. SG&A was modestly lower on strong cost control and lean operations and also because we needed to do less marketing overall, since Henrik talked about the excellent reservation numbers we have. CapEx was also well contained, again due to disciplined management due to certain benefits with respect to FX, some real reductions in CapEx, which we didn't need, and also certain payments moved into 2023. On the other hand, R&D was higher as we started to reach industrialization and certain key milestones, which actually triggers accruals of certain ED&D. In addition, in order to keep our program timing on track, we also made a decision to utilize some low-volume tooling during this period, which also increased R&D. We finished Q4 with over $736 million in cash, better than we had expected and higher than consensus forecast due to deliberate cost management and opportunistic ATM usage. For reference, this is approximately $100 million higher than consensus average as we see it. This excludes approximately $28 million of VAT receivables, which are delayed to 2023 and would have added to cash balances if we had received them last year. During the quarter, we brought in approximately $57 million from our $350 million at-the-market equity program, which is part of the $2 billion shelf. Again, I want to highlight, in 2022 -- our 2022 OpEx may seem higher than expected, but overall, CapEx, taking into account we are way ahead. Our overall non-GAAP SG&A, R&D plus CapEx guidance for 2023 stands at $535 million to $610 million range. If we decided to focus only on Ocean, as Henrik mentioned, we can enhance liquidity further in case capital markets are tighter. We have engaged an investment bank to secure non-dilutive capital, and I'm pleased to say that we have received a couple of initial terms and are in discussion with lenders for working capital facilities for later this year as we go into see production. We are targeting 2022 production of up to 42,400 units, provided our supply chain delivers as forecasted, and we received homologation in a timely manner. Similarly, we expect 2023 gross margins in the range of 8% to 12% and potentially positive EBITDA. Fisker continues to strategically strengthen our in-house technical capabilities, total team members now over 850. Our technical center of excellence in India has accounted for significant hiring in the past few quarters, providing Fisker with round-the-clock technical expertise. I'm extremely proud of the Fisker team, our partners and suppliers for all these accomplishments we've made in 2022 and already in early '23 and the unwavering focus on launching an amazing vehicle. So, maybe two questions, one for Henrik and one for Geeta on gross margins. I think investors seem super focused on 65,000 net orders is great, but it's only a couple of hundred down. But if you can talk about order conversion and how you're monitoring customer engagement, that would be great. So I mean, first of all, as I think most people know, we have already converted quite a lot of orders. One, we had a limited 5,000 Ocean Ones, where we took a nonrefundable $5,000 deposit. We actually have 1,000 people under waiting list to get an Ocean One. We then also have sold or fully firm orders for several, several thousands of other vehicles out of the U.S., which were -- came out of the IRA where we had that one week where we took the opportunity to offer people to make a firm commitment. So, that's already gone. Now, the next step is we're going to open up for firm reservations starting with the Extreme very shortly, both in Europe and U.S., and we have a lot of people who are super excited about doing that, so they can obviously make a firm order, start putting in their colors and wheels, et cetera. So, at this point, I think we're seeing a really, really firm commitment from most of our reservation holders. We also don't want to innovate them with stuff from us, but we keep them up to speed with what's going on. I think the fact that we have not raised prices, we have been firm with our pricing. I also think once we get this vehicle on the road or even people who can go and actually try it, I actually think that's going to be the ultimate conversion weapon when somebody gets into the vehicle and go, wow, this thing is amazing. But the fact that we continue seeing a growth in our reservations, I think, really shows the unique product that we have because not everybody keeps seeing growth when you see more competition coming and somebody lowering prices, et cetera. So I think that the 8% to 12% gross margins that we have outlined, these are actually GAAP accounting base. So I think from my point of view, to achieve these gross margins, I don't frankly see a risk unless battery prices trouble. So, I don't frankly see a risk on achieving the gross margins. And I think I've highlighted that multiple times in multiple earnings calls, and that is because of our asset-light strategy, and we don't have those huge factory billions of dollars of cost to account or amortize against. So Chris, when it comes to battery prices, our battery contract is already set in stone. And what changes is the certain material prices which are linked to indexes, so which are common to everybody, not just us. So as Henrik mentioned, as our opportunity to grow increases, I'm expecting, as I discussed with our partner, CATL, volume can also have an impact. I think we've seen the highs of the highs, and I'm expecting that we are now going to get tapering off with respect to battery prices. In terms of opportunities, if input prices keep going down, I see that as an opportunity for us to improve our gross margins. Also, I think that we have an opportunity here to look at a very sustainable product with respect to all the components and commodities. Now, let's look at contract manufacturing. So, contract manufacturing, again, I think we've talked about it many times, and you were in the plant, and you saw on your own why we don't have the inefficiencies. So, that's the first thing. So any fixed cost they apply for next year, so we have a fairly defined manufacturing agreement. Of course, there's been an increase with respect to inflation. Last quarter, you had given some helpful commentary on what you thought production would be by quarter. As long as we get -- like I mentioned earlier, we are starting to get parts. So, as long as parts keep coming in, we can produce the cars, no problem. Now, let's come to production itself. We can produce Henrik mentioned 20 cars a day, and we have a very clear plan with Magna Steyr on how to increase this production capacity week on week on week, all the way through to December this year. So, the numbers we had -- the guidance we had given hasn't changed in terms of what we can produce. So, as I alluded to, certain suppliers, they feel they need a little bit more time for their own feedback processes, high-quality feedback processes, and we will monitor what that means between March, April, May in terms of where they get to peak production. But I'm expecting that by June time frame, all the suppliers are fully ramped up to our production needs, which is more or less 5,000 a month at this point in time. So Dan, when a company starts up operations, you have a certain level of inefficiency, and that's why we have a lot of outside suppliers and we have relied on Magna to do some of the engineering. Also, we relied on certain suppliers do some of the engineering, which is why you saw a higher ED&D bill for Ocean. Now, as we go into the second vehicle, on one hand, we have enhanced our own internal team, including a pretty significant employee base in India which, as we know, is a much reduced cost than hiring here in California. So, that accounts for some of the reduced costs where we brought some of the R&D in-house. So for example, the OTA pipeline that Burkhard talked about, once those investments are in place, we don't have to repeat them. Henrik talked about UI/UX, once the development, the base UI/UX experience is developed, now you're doing a spin-off, you're going to modify that. So, there are many, many, many areas, including, I can talk about in EE architecture where we have the capability to take over certain components from certain suppliers and carry over and use those over our second vehicle. We have a team that works together, smarter, just far more efficient when it comes to next year. And Dan, maybe just to add to that, you mentioned Alaska. We're going to call it the FT 32 platform, but it's really a derivative of the Ocean. And that's also why we can have -- we can create a driver of prototype really quickly because when we created the first driver prototype of the Ocean, there was nothing there. Dan, I hate to say the final comment, but frankly, there is a price point per new startup. So first, what I mentioned was a new way to specify a vehicle. And what I mean by that is that when anyone, anywhere in the world creates a car, it is a set of spec books, and spec books means that every part could be the mirror. For example, there's a spec book on the mirror and that spec book, for example, on the mirror might contain 20 different things from the light has to be -- to glass, the cap on the mirror, everything that's in that mirror, a little electric motor whatever. And what normally happens is you create that spec book, specifically as a start-up together with suppliers, sometimes. What happens with normal OEMs or traditional OEMs thatâ\u0080\u0099s been added for a while, they take the spec book from their previous car and they apply it to the next car, which essentially -- I mean, it's just like a recipe in a bakery when the son or daughter takes over, they will use the same recipe as the mother and father did and nothing really changes. In our case, we decided with a PEAR to actually completely redo these spec books. We obviously had all the experience with the Ocean, and we fine combed through it. And certain elements that are great at the Ocean that we can use real use, but other things may be too premium because at the end of the day, the Fisker Ocean is a premium vehicle that goes all the way up to $70,000. But when we looked at the PEAR, we wanted to come up with some ideas that has never been done before to achieve our goal of being able to sell this vehicle for $29,900 as the base price and make money on it. Now, I'm not about to show our menu, just like Coca-Cola doesn't show their ingredients, there's laying in some safe somewhere and so it does here at Fisker. But believe me, it's a pretty exciting program, and it will come out at $29,900. So in original -- or in traditional car manufacturers, we have many ECUs, which are now consolidated to just a few. With this saying, the complexity to consolidating into less computers is playing in that advantage, not just in regards to owning the software on one hand side and all the features and functions being implemented in those fewer computers but also reducing the complexity with suppliers, reducing the complexity on cost, reducing the complexity of wiring harness. Just a few centralized computers allow you actually to reduce extremely the cost from components to buying harness to ED&D, and that is we are doing currently consolidating into this new architecture, which really becomes now a software-driven car where we see the future-going. Specifically for PEAR, it allows us to reduce drastically the BOM cost from the EE architecture, although the complexity of the domain computers are increasing, this is the advantage of the future EE architecture, which we are implementing into the PEAR. So, Dan, just to highlight between Henrik and Burkhard, overall, the car has a fewer parts whether it's electrical components or its mechanical components. Less material means less cost, also means that you have less integration, both electrical and hardware, means that your prototyping costs are less, means that your overall -- overall complexity is less. So the way we look at PEAR, we are engineering the entire EE architecture in-house. And then, when it comes to the actual body and chassis, the development is being done in-house completely. First, hoping you could just talk a little bit about the cadence you expect for gross margin this year. I think you mentioned earlier that, this is a launch year and maybe there's certain, I guess, treatment of fixed costs. But I don't see minor launch costs, but I would not -- if you're putting a model together, I would not simulate it based on other vertically integrated EVs. At overall vehicle level, it's enormous. But what I can tell you is that we are starting to develop the entire vehicle from the basis of the EE architecture because at the end of the day, you decide which ECUs to virtualize, but more importantly you also start to impact supply chain and you start to create a more beneficial supply chain and you also need less complexity in purchasing. So, I think that for us, this is really critical to get a very, very sophisticated EE architecture. Although the BOM cost is being reduced, the high-performance compute allows you future features and functionality, which is even beyond anything you could imagine. The one item I do want to add Itay is, if in the future, you want to upgrade the vehicle, the more and more that sits on the application layer means you have less cost for model year changes or upgrades because they are software-driven rather than hardware-driven or black box driven that comes from suppliers. And as you see, the guidance is $535 million to $610 million. I think year-on-year, we've shown that we are always at the lower end or below guidance. This was a super exciting earnings call, but I will be jumping on the plane back to Austria to make sure we get full speed in the production. And as soon as homologation is there, we're going to start delivering a bunch of cars. Ladies and gentlemen, this concludes today's call."
}