{
    "symbol": "FSR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 21:43:02",
    "content": " Joining me on todayâ\u0080\u0099s call are Henrik Fisker, Chief Executive Officer and Chairman; Dr. Burkhard Huhnke, our Chief Technology Officer; and Dr. Geeta Gupta-Fisker, our Chief Financial Officer and Chief Operating Officer. Despite the ongoing global turbulence, we have successfully navigated a challenging environment, closely collaborating with our partners to protect our start of production timeline. The Ocean program is on track for start of production in a couple of weeks to be exact, November 17. We now have over 62,000 reservations and orders for the Fisker Ocean. Customers are really responding to the Fisker Oceanâ\u0080\u0099s class-leading and industry-first features and we have got quite a few of those and sold out of calendar 2023, the U.S. allocation for Ocean Ultra and Sport trims in response to the IRA. We are driven by strong growth in India, which gives us around-the-clock capabilities to design the software and services that will go into our vehicles pre and post-production. We also debuted the Ocean in various regions of the U.S., both on the East Coast, New York, Washington, and then in Texas and internationally in Sweden as well. On the Ocean update, our priority number one has been to launch a high-quality Fisker Ocean that has class-leading features and class-leading range. To the manufacturing update, as I noted a moment ago, the Ocean SOP is on November 17. Our start of production signifies high-quality hardware built at Magna, with all the investments we have made and getting to a place where we can increase ramp month by month. Getting to high-quality and stable high volume ramp up, production typically takes about 12 months. Our 2023 quarterly production plan is as follows: Q1 over 300 units; Q2 ramps quickly up to over 8,000 units; and Q3 again ramps even higher to over 15,000 units. However, of course, if everything goes as planned, which I expect it to do, we would try to see if we can together with our suppliers, increase the volume in the end of the year. On the Ocean demand, it has been strong as we approach SOP and continue to build awareness through organic marketing efforts. Reservations continued to increase more than 62,000 reservation and orders for the Fisker Ocean. We are also focused on ramping up suppliers to support increased production numbers, as I mentioned earlier. Just before the inflation Reduction Act was signed into law, we acted quickly and enabled Fisker Ocean reservation holders to enter into a binding contract to potentially retain eligibility for the old federal EV tax credit. In less than a week, we sold out our U.S. allotment of Fisker Ocean Sport and Ultra trim levels. We support solutions that provide more choice for consumers and level playing field as we look to grow the eBay market in the U.S. and continue to advocate for a meaningful transition period, which drives us to a clean future for all. So, what that really means in sort of layman words is that of course everyone in the U.S. got told about the Inflation Act in about August this year and that was going to take effect in January â\u0080\u009823. Obviously, nobody can plan for a U.S. manufacturing plant in 4 to 5 months. And we are seeing that already our discussions between EU and U.S. to maybe loosen some of these rules, which I think will be meaningful. Last month, we revealed many new features of the Fisker Ocean that are super cool, the user interface. Taco trays, for example, for driver and passenger seat, hidden glove box, rear seat controls, which is really cool for â\u0080\u0093 if this vehicle is used for ride hailing, etcetera. And also, we have a digital rearview mirror where you really donâ\u0080\u0099t need to care about your rear window if itâ\u0080\u0099s clean or not or if you have filled up the truck, you can always see out through the rear, a super cool feature. And as we get closer to SOP and continue to be increasingly transparent with respect to our product and what customers are getting and for what price, our extensive human-centered design process led us to update our web and mobile experiences and we will rollout a new Fisker-connected app on November 17 this year with continual updates into the spring. We will also introduce our new 3D configurator on November 17, redesign navigation, vehicle order and transaction flow as well as the seamless ways for our customers to interact with the vehicles. In addition to opening the reservation process to these large global markets, we have started to examine opportunities for local production in India, which I recently visited, where we see significant potential for the Fisker PEAR. We are going to â\u0080\u0093 we are going out in phases, which will help plan our production forecast and after-sales infrastructure build-out. While the PEAR is already planned to be manufactured in the U.S. with Ocean, we are in exploratory discussions about U.S. manufacturing with several parties. In the interim, we continue to advocate, as Iâ\u0080\u0099ve mentioned earlier, for consumers to have more choices and also to see that we can get our manufacturing plan here in the U.S. at the right time. On target with the cost of this vehicle, signed off concept and phase exterior design fully signed off and interior signed off now into execution, continue to transition engineering and purchasing teams to PEAR. PEAR production and sales are expected to start in 2024 and the base version is still expected to be priced under $30,000. And the way we are able to do that is by looking at the PEAR as a mobility device rather than a traditional car, which allows us to prioritize different things in the vehicle and lowering the cost in certain areas of vehicle that wouldnâ\u0080\u0099t have been normal if you thought about it as a typical car development process. So, coming back regarding to the IRA, we have started examining with Foxconn factory investments needed to position PEAR production for IRA compliance over time. Our production partner, Foxconn started planning for lean production system, our reduction â\u0080\u0093 so our reduced product and process complexity will lead to a more profitable vehicle. All core manufacturing processes will be done in-house, stamping, body, paint, GA and PT. Final phase of production readiness will be process control, verification and quality control check. Let me talk a little bit about marketing, events and experience centers and partnerships, due to our strong Ocean demand pipeline and on certain macro environment, our marketing spend has become more targeted and shown increased effectiveness. And thatâ\u0080\u0099s really due to this targeted marketing, digital marketing that we are doing in-house. We recently shared that our first launches will open next year, while the construction delays are unfortunate, the later launch opening bolster liquidity, if only Magna could build launches too. Ocean road tour connects with customers in multiple cities and states, including several debut locations. In light of our strong reservation and order pipeline and the ongoing global market turmoil, we have moderated our marketing spend to certainly focus on remaining 2003 trim allotments. And I know itâ\u0080\u0099s exciting to see of course a lot of incredible marketing from us, but it really wouldnâ\u0080\u0099t make sense to spend millions of dollars in marketing knowing that we are pretty much sold out for next year. We are proud that the Ocean will be produced in Magnaâ\u0080\u0099s carbon-neutral plant in Austria and Ocean will contain over 50 kilos of recycled polymers and bio-based materials, more than any other vehicle we know currently on the market. In August, we published our inaugural ESG impact report in advance of the Fisker Ocean November 2022 SOP date, demonstrating our foundational commitment to the environment and social responsibility and transparency. I canâ\u0080\u0099t wait to go to Magna next week, where we actually have invited journalists and also analysts that would be able to drive our vehicles â\u0080\u0093 very excited to see what the outside world think about our vehicle. And I am looking forward to host journalists and analysts next week at Magna on their test track and of course, get a tour of the plant as well and seeing Oceans being built on the assembly line. Beginning with Fisker Ocean, final engineering testing and validation has progressed quite well over the last few months. On October 17, we achieved engineering sign-off for production start effectively transitioning our efforts from engineering the vehicle to manufacturing and ramping production. We have been following the cybersecurity engineering process, a holistic guideline for secure automotive software development, which has been developed by international standard of organization. Furthermore, we are complying with the functional safety integrity levels of ISO, which have been assessed during Ocean architecture and development phase and have been implemented. In the next couple of weeks, we will enable the automation in order to achieve short commissioning times, automate and parallelize poster sequences of the vehicle electronics at various process locations. For the past couple of months, I, along with several of the other Fisker technical leaders, have been in Graz, Austria, working directly with Magnaâ\u0080\u0099s team. As I mentioned on the last earnings call, in August, we entered the PTO build phase, which is done on this U.S. manufacturing line and is the final build before a production. We have been using these PTO builds for final validation and testing of complete vehicle performance, comfort and functions. The Oceanâ\u0080\u0099s class-leading 17.1 inch rotating screen enhances the user experience and allows the user to enjoy videos, gaming and other rich content. Similarly, the over-the-air systems has been in place and running in our preproduction vehicles, which we have been using to optimize and improve vehicle performance and reliability characteristics. Fisker OTA platform will be capable of reaching every vehicle and allows for flexible update strategy tailored to each legal owner and their preferences in a safe, secure and compliant manner, truly aiming to deliver on the concept of software-defined vehicles. In addition, Fisker will continue to build on our existing over-the-air updatable platform supported by 5G and Wi-Fi 6, including digital life cycle management, with the highest level of security, always updated with the news in our software and technology improvements with our seamless compute from cloud edge, the car becomes smart and even safer its lifetime. As an example, last month, we completed the U.S. roof crush test with production body and performed successfully as we had expected. This month, we will conduct the U.S. and European range testing, with range results expected next month. We had originally planned in earlier customer software release only for Europe, but weâ\u0080\u0099ve decided to skip this software drop to reduce any risk and focus on highest product quality, reliability and software stability at launch. Consequently, we decided to synchronize all final functional safety relevant software releases with the certification process and will update software for all customer cars, which we are producing from now until February. And as Ocean gets closer to SOP, we are transitioning more and more resources from the Ocean program to the PEAR program. The consolidation of ECUs and the addition of SmartZone and gateway compute adds tremendous capability, but also low mass reduces complexity of the wiring harness and lowest overall bill of material cost. This development of competence and supply chain partnerships, leveraging advanced silicon and software solution is enabling us to execute a fully next-generation electrical architecture for Fisker PEAR. In the current volatile market backdrop, we have demonstrated resilience, discipline, ability to manage complexity and find solutions whether itâ\u0080\u0099s supplier issues, solving problems or balance sheet management with just a couple of weeks until SOP, our number one priority is ensuring our final testing, certification and homologation time lines remain on track. We expect retail customer deliveries following European and new homogation, as Burkhard mentioned, in February 2023, and providing us with time to bring all suppliers along for ramp readiness. Our program and supply chain task force conducts regular reviews with critical suppliers on-site, off-site to confirm tools, part maturity and ramp readiness impact on suppliers from energy and inflation crisis or part shortage so we can support suppliers with alternative ideas or pivot to completely different solutions. For example, steel, which is more important for the Ocean than aluminum is down 60% year-on-year with respect to battery specific raw material prices, while lithium carbonate has continued to rise, we donâ\u0080\u0099t believe this trend will continue as seen with some other key battery raw materials like nickel and cobalt. As a reminder, our contracts factor in commodity prices, inflation, productivity and foreign exchange, some of these critical elements that will be calculated on a quarterly or annual basis as we ramp up production. A forecast for slower economic growth next year come to fruition, we would expect further commodity and supply chain relief. As weâ\u0080\u0099ve mentioned before, 2023 production will be back-end loaded, reflecting our deliberate early production strategy to ensure we deliver a high-quality vehicle to our customers. When we start production on November 17, we begin with the same high-quality production we will have at scale but at a much lower volume. Over the next several months, we will work with suppliers to ensure we have the same quality at higher volumes as we will in the initial low phase. Apart from these tools have to meet the dimensional pick finish and appearance standards, parts dimensions and parents are checked and confirmed within the plant and the cubing event where cubing is an aluminum body master with zero tolerance. Product audits will focus on 2,500 plus statistic checkpoints and the vehicle intensive test will focus on validation of vehicle functions with 1,600-plus function checks, including driving dynamics, acoustics, infotainment and other features. Supplier readiness is integral to hitting our next stage of ramp in Q2, and we have assembled a great team of specialists from SQN material planning to manage suppliers. This team is responsible for supplier readiness supplier production tool delivery to home line, manufacturing equipment and process implementation, including debug and end-of-line measurement and testing plan for achieving the required quality and part production rate to meet our volume ramp. And then finally, during this first stage, we will establish successful completion of process verification in the plant where plant production readiness will be confirmed and proven. Stage 2 is in Q2 2023, and targeting an assembly of 200 to 700 vehicles a week and as Henrik mentioned, targeting over 8,000 units during the quarter. 100% quality check like water test, dynamic driving, vehicle inspection will be done on all vehicles. Introduction of new variants, the Sport, Ultra and right-hand drive will be integrated into supplier production sites and erection process will start for this new content. Also manufacturing, integration, validation and confirmation will start for these new variants. In Q3, we will start a steady state of ramp to achieve our annual 42,400 units of production next year for our 2-wheel, 4-wheel, all the trims, right-hand drive and left-hand drive with launch in all our launch markets. Stage 4, a ramp above 50,000 annual units to meet higher demand in both Europe and potentially U.S. until a U.S. production solution is established, as Henrik talked about, developing new features with OTA launches, further manufacturing efficiency activities to improve output and quality. Again, to recap what we mentioned in todayâ\u0080\u0099s press release, by quarter we plan to produce over 300 units in Q1 2023, over 8,000 units in Q2 2023, over 15,000 units in Q3 2023 and Q4 the remainder to achieve the total plan of 42,400 units. To ensure successful SOP of Fisker Ocean on November 17 and support production ramp up thereafter, our Fisker IT team implemented several integrated digital platforms and solutions including product data management system to seamlessly integrate real-time manufacturing needs with vehicle production, intelligent solutions to forecast demand and manage supply chain procurement for over 160 suppliers and 2,000 parts globally. Solutions to accurately streamline customer orders to manufacturing orders, solutions to track vehicle manufacturing and delivery progress and provide real-time updates to customers as part of our digital ecosystem to provide seamless and best-in-class sales and service experience to our customers, we are developing a scalable global digital retail storefront platform for all our customers. This platform supports a multicurrency and localization need and is integrated with our Fisker app in car HMI, our website and our partner EcoSys systems to enable end-to-end services to our customers. This platform will be enabled in phases beginning December 2022, and it will continue to evolve, adapt and advance as our customers provide feedback on their preferences. Some of the services that are availed by the platform to the customer in excess of Fisker app are as follows: scheduled test drive; vehicle delivery, pickup and service appointments at pre-selected Fisker sales or service center or at a requested location, including your home; real-time interaction via Fisker app with our sales and service advisers and technicians for follow-ups; approved recommended repairs, sign and pay invoices; accessing our partner services for roadside assistance, collision repairs. Some of them are as follows: predelivery inspections of vehicles sold or service for our customers; manage all sales and service work orders; coordinate triage of service issues among engineers and service technicians to find solutions; tracking service provided by our partners for roadside, collision and providing frequent updates and seamless experience to our customers. Weâ\u0080\u0099re excited with the Ocean program progress to date, and we look forward to sharing our progress each quarter against a comprehensive road map I just outlined. Now turning to our Q3 results, balance sheet and 2022 outlook, our Q3 operating expenses of $140 million or $128.8 million ex stock compensation expense was consistent with our internal expectations and full year spending guidance. We finished Q3 with over $824 million in cash, better than we had expected due to a weak euro, disciplined spending and opportunistic ATM usage. As demonstrated in our prudent year-to-date cost management, we remain focused on executing against our plan while preserving adequate liquidity. As noted in the press release, we expect to be at the lower end of the 2022 overall non-GAAP OpEx plus CapEx guidance of $715 million to $790 million, driven by disciplined cost management, leveraging our India software and engineering center, lower part spend, as Henrik mentioned, as we brought in-house a lot of the development work and a favorable FX. As a reminder, bulk of this yearâ\u0080\u0099s spend is launching the Ocean plus costs of running the business along with minor pay R&D expenses. Iâ\u0080\u0099m proud of the entire Fisker team for all the accomplishments year-to-date and the unwavering focus on launching an amazing on-time vehicle, which will come to fruition in just 2 weeks. Next week, very excited to welcome journalists and analysts to see and drive the discretion and also experience our production line at magnetized plant in Austria. Your line is open. I was asking on â\u0080\u0093 for Burkhard, who alluded to get homologation that there were some software updates between now and February that needed to be done. And then the second part of the question was just on â\u0080\u0093 I think there was reference to potentially licensing the Ocean for a U.S. manufacturing facility, which Iâ\u0080\u0099d assume would be CapEx favorable to you, but I just wanted to understand how the mechanics of something like that would work. We are running currently through the certification process, which is the homologation process for Europe and U.S. And we are waiting for the official certificate. So, we have been already in detailed discussions with a couple of groups, big OEMs, international carmakers about licensing our platform and jointly producing this platform in the U.S. One version would be of the other OEM that they obviously would design their own top hat, etcetera, on it. And yes, of course, that would be favorable to us because there would already be an existing plant. And obviously, we have great value in the Ocean IP that would offset some of these investments that we would normally have to do. Secondly, we have looked at licensing, the Ocean platform just separately without silting  to manufacturing. And then finally, we are looking at a strategic partner as well for the peer program to kind of introduce the PEAR in some unique markets that we havenâ\u0080\u0099t announced yet. So, a lot of stock is going on, but itâ\u0080\u0099s â\u0080\u0093 I think some of these discussions and negotiations might have been a sort of a little bit of a reaction to the Inflation Reduction Act where probably a few companies feel they need to get quicker to the table with an EV made in America. And as everybody knows, if you start development of a car from a clean sheet of paper, especially if you are a traditional OEM is your own processes that normally takes you 4 years. Of course, if we license the Ocean platform, we could probably get that vehicle to market in 22 months or less for a much lower price. So, I think there is some interest there we have seen, and itâ\u0080\u0099s something we definitely would like to be opportunistic about. And I am very confident that we will have U.S. manufacturing because, of course, as you know, also our manufacturing partner, Magna have also talked about potentially setting something up in the U.S. So, I think we have enough different options that we can choose between over the next couple of months to make sure that we get Ocean manufactured in the U.S.\n Thatâ\u0080\u0099s great to hear. Your line is open. And team, thanks for the detail on the production plans, I â\u0080\u0093 and the cadence of that. I was curious, though, how we should think about delivery times, especially from Austria to the U.S. and presumably most of thatâ\u0080\u0099s on the West Coast. Is it two weeks, three weeks or because obviously, there is going to be a lag between whatâ\u0080\u0099s produced and when the vehicle is delivered and recognized. And obviously, the advances in Europe, if we would have had to ship them the other ways that we are shipping from grad straight into all the European countries with being able to deliver the next day or a few days later. I just want to add that we are looking at four ports here in the U.S., both in the East Coast and the West Coast, and that will maximize our capability to make use of logistics, both East Coast and West Coast. And of course, we are thinking exactly what you are thinking when you realize or recognize those vehicles. So, an ideal scenario will be that early in the quarter, the production will be routed for North America, and the later quarter will clearly recognize in Europe. So, we are working those fine logistics out and the aim would be that as we progress the ramp during the year, we also get to increase our efficiency between production and deliveries. But then I guess, just â\u0080\u0093 and I know itâ\u0080\u0099s sort of just timing, but 300 units produced in the first quarter and you are talking about retail deliveries in February. No, because we can ship â\u0080\u0093 so we are producing vehicles starting 17th of November this year. And as soon as we have produced vehicles, we can ship them over to the U.S. and they can be here for mid-February, and we can just flash the vehicles. So, a majority of the vehicles will be in that Q1 will be, as Geeta just mentioned, delivered in Europe because to us end of each quarter, we will prefer to deliver vehicles in Europe. And then just going back to Henrik, some of your comments on U.S. manufacturing plan. Your line is open. And I am sorry if I just missed this, if you could answer to Joeâ\u0080\u0099s question, how should we be thinking about in the second half of next year, the split across Extreme, Ultra and Sport trim levels in terms of that production. So, we have our launch vehicle, which is the Ocean One and thatâ\u0080\u0099s a volume of 5,000 units. In the recent few weeks, we have seen an increase in configuration on a configurator for the Extreme, and that is obviously our highest Trim level. And what we are anticipating is as we deliver Ocean Ones between Q1 and Q2, we will start to convert in January customers who want to take the Extreme since we believe that itâ\u0080\u0099s a phenomenal value for money. We have done a detailed benchmark study on whatâ\u0080\u0099s out there on offer in both Europe and U.S., and we canâ\u0080\u0099t see any other vehicle that actually competes with what we are offering. In addition to that, we also think that this is a community of customers that are not that strongly impacted by rising interest rates, and they are looking for a great product. Obviously, as we open up the configurator in Q4 and we start taking up Extreme orders, I think you will get more color on that probably in the earning calls, and we will disclose that quarter-on-quarter-on-quarter as we convert customers. I mean I think just to add to that, I think you would have seen other manufacturers prioritizing only the high-end model, and itâ\u0080\u0099s my view that we could probably have sold only Extremes next year, but we created a small allotment for Sport and Ultra simply because we had some very early reservation holders, and we thought it would be nice for them to be able to get their vehicle next year. But itâ\u0080\u0099s clear that a vast majority of our sales next year will be extremes and, of course, the Ocean One to start with. And that also means that our average selling price will be pretty close to $70,000 in the first year, which is very high. I think that we were very smart to go out and offer the opportunity for people to actually close a deal on our vehicles and get that $7,500, and there was quite a lot of people who did that. I am not so worried next year because as Geeta mentioned already, I think the customers who is buying the Extreme maybe â\u0080\u0093 I donâ\u0080\u0099t think that customer is going for a vehicle just because they get that tax reduction, they wouldnâ\u0080\u0099t buy a vehicle they donâ\u0080\u0099t like just because of a tax reduction. Secondly, itâ\u0080\u0099s my opinion that I think that Europe and U.S. will come to some agreement of a transition period for the EV incentives specifically in the IRA and I would expect that to be a couple of years, and I think that will give another leeway. And we are also seeing an up kind of a fast growth, I would say, in Europe on demand. Next question, what are your production delivery volume targets for â\u0080\u009822 and â\u0080\u009823 and any updates on U.S.-based manufacturing notion? So, as I walk through my script, I laid out a plan on how we get to 42,400 units in 2023, which is based on a very detailed four-state supply ramp-up in vehicle assembly plan from November 17th till the end of next year. And as I also mentioned, we are delivering a small fleet of 15 Fisker Oceans to Magna in December. We expect U.S. and EU homologation in February and then, of course, retail consumer deliveries to follow thereafter. Then with respect to U.S. manufacturing, I think as Henrik mentioned earlier, we have been approached by several OEMs who are interested and excited, both in Ocean and PEAR platforms. And since Ocean is near-term, itâ\u0080\u0099s obviously a very exciting product. And as Magna, our production partner have also publicly announced that they are also looking at potential U.S. production of EVs in general. But I can imagine in the next couple of years, we will have a plan to have U.S. manufacturing for the Fisker Ocean. As I have mentioned earlier, there will be a huge update on November 17th, both on our website, our mobile app, and we will have our new interactive configurator. So, all this will be updated on November 17th, and then we will actually continue updating it, specifically both the app and the configurator, there are some real cool new features and we will continue adding to that. And obviously, once you become an owner of an Ocean, then you will be able to use your app and interactive vehicles. Last question, it looks like reservations have slowed down, currently the lowest month-over-month gain in the last 2 years. So, I think I mentioned earlier, again, that we are purposely lowered the spend on marketing. And obviously, that will make a lot of sense because at that point, we will have multiple Fisker launches thatâ\u0080\u0099s open, where people can actually go and see the vehicle, order the vehicle, book a test drive. Itâ\u0080\u0099s kind of wasted money if you spend too much marketing money right now because people are going to come and ask where can I test drive the car, where can I see it, and it just doesnâ\u0080\u0099t make sense. I think itâ\u0080\u0099s the right approach to start, as I mentioned, spending serious marketing dollars in Q2 next year. I am really super excited to go into Magna here on Saturday flying over, see journalists and analysts next week, get them in the car. We have got a tremendous vehicle, and I am looking forward to host the lucky people that are over there. We obviously canâ\u0080\u0099t invite everyone, but I am sure throughout next year, other people will get the chance to drive the vehicle as well."
}