{
    "symbol": "DLPN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 22:28:03",
    "content": " Now the third reason, why this acquisition was so strategic for Dolphin after giving us scale and access to take advantage of the fast-growing influencer marketing industry generally and in our verticals specifically, the third reason why this acquisition was so strategic for Dolphin is because at the elite levels of Socialyte and Be Social, the influencers on rosters themselves hadnâ\u0080\u0099t as large enough followings to where they are celebrities in their own rights and many have ambitions to be positioned to â\u0080\u009ccrossoverâ\u0080\u009d into traditional media and many more have launched a wide array of consumer products and business centers. The categories of beauty, lifestyle and fashion are particularly well suited to influencer product launches as demonstrated by the countless examples in recent years, perhaps the highest upside growth opportunity for Dolphinâ\u0080\u0099s scale is Socialyte and Be Social and itâ\u0080\u0099s the focus on pitching, facilitating and sharing and the revenues created by influencer brands and content to generate further recurring revenue and value for Dolphin and its shareholders. Operating loss for the quarter ended September 30, 2022 of $1.1 million includes non-cash items from depreciation and amortization of $415,836, a gain in the change of fair value of contingent consideration of $5,000, as compared to an operating loss of $1.1 million for the quarter ended September 30, 2021, which included non-cash items from depreciation and amortization of $475,207, and a loss in the change of fair value of contingent consideration of $1.1 million. Net income for the quarter ended September 30, 2021 of 141,651 includes non-cash items from depreciation and amortization of $475,207, a loss in the change of fair value of contingent consideration of $1.1 million, a loss in the change of fair value of warrants and convertible notes of $278,923 and a net gain of $1.7 million for the extinguishment of debt."
}