{
    "symbol": "TWI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 17:26:05",
    "content": " It's also good to see our financial performance translating into strong free cash flow, which was $40 million for this quarter and that puts us at $69 million year-to-date, that's a whopping $96 million year-over-year increase in free cash flow. We had net sales of $531 million in Q3, which represents the strongest Q3 in our history, and the first time it's exceeded $500 million in a third quarter. As a result of further debt paydown this quarter, our net debt dropped to $330 million, down from $368 million last quarter and our net debt leverage now stands at 1.4 times trailing 12 month adjusted EBITDA coming from the dramatically improved profitability and our continued focus on working capital management. Agricultural segment net sales were up about 50% of total sales this quarter and were at $289 million, an increase of $45 million or 18% from Q3 last year. The agricultural segment gross profit for the third quarter was $46 million, up from $33 million in the prior year, representing a 38% improvement year-over-year and gross margins were strong for ag at 16% in Q3, up from 14% last year. Gross profit within our EMC segment for the third quarter was $35 million, which represents an improvement of almost $14 million or 64% from gross profit last year. Our capital spending in the third quarter was also within expectations of $13 million and the full year capital expenditure target continues to be at around $45 million to $50 million, which is the same as our original guidance for the year. I wanted to ask -- address some of Paul's early commentary, which seem to -- I know you're reporting a little bit later this quarter, so we've heard from your customers, and it seems to match up a lot with what we're hearing from the customers, which is order books on ag remains healthy but maybe not growing at this point after a very strong year, whereas heavy construction appears to be very, very strong, which would seem to be counterintuitive given global recessionary concerns."
}