{
    "symbol": "PETV",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-15 18:03:05",
    "content": " Before we begin, I would like to remind everyone that comments made during this conference call by PetVivo's executives may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and are subject to risks and uncertainties. Any statement that refers to expectations, projections or other characterizations of future events, including financial projections or future market conditions is a forward-looking statement. PetVivo's actual future results could differ materially from those expressed in such forward-looking statements for any reason, including those listed in its SEC filings. PetVivo filed its 10-Q and earnings release with the SEC today, which provided detailed discussion of our financial results. Now, I would like to turn the conference over to John Lai, the CEO and President of PetVivo. Thank you, John and walk them through our first conference call as a NASDAQ company. Our key highlights last quarter were we raised $11.25 million approximately, and a registered public offering of units, which we closed on August 13th, 2021, up listed to NASDAQ in connection with the registered offering. So, one of our key hires with Brandy Meyer became the Chief Operating Officer from the manufacturing standpoint, John Dolan, VP of Business Development and Corporate Counsel, Mark Middleton, National Director of Sales. He has 35 years of veterinary sales experiences, his last company Animal Health International. Russ Siakel, our Director of Marketing comes from Pfizer Animal Health, which is latest Zoetis and also Boehringer Ingelheim, BI, second largest veterinary products company in the world. And he has a strong, over 30 years of experience in marketing of veterinary products. She is our Senior Vet for companion animals, small animals, once again, over 30 years of practice experience, and dealing with dogs and cats and other smaller animals. He's dealt with our particles for many years and was at several very large medical device manufacturing, where they had to deal with similar particles and products in syringe fulfillment and delivering a product. I would now like to turn over to Bob Folkes, our Chief Financial Officer, who will discuss our recently completed register offering and financial conditions. Now, we are using the net proceeds from this offering to expand our sales and marketing efforts to gain vet acceptance and generate revenue from the sale of Spryng. John has already commented on the team we added during the quarter, and we also engage Kick as our advertising agency across multiple marketing services disciplines. So, I like to talk more about the future, the strategy and the key focus areas for the second half of 2022. Kick was instrumental in helping us determine that we needed to change the name from Kush to Spryng, because too many people associated with cannabis products. And that with Kick helping us launch into multiple trade shows, we have, I believe, about 19 trade shows that we're looking to schedule to attend, because that was one of our key focuses with the raise of this capital was to spend it on sales and marketing. We're all -- we're still on path to hire multiple salespeople under Mark, with these salespeople will have extensive sales experience. And these shows initially will be focused more on equine, but the major show in Orlando is the VMX, which is the largest show of the year, and that would be the second week of January. So, we'll have a full staff of small animal as well as equine, salespeople and management team down there to help spread the word on the product, because there's an educational process that's going on. We're going to also be looking at expanding sales channels to partnerships, doing additional studies beyond the Colorado state study for both equine and canine. And we also started launching commercials about a week ago on -- to the consumers on CNN, MSNBC, Fox, Fox Business, as well as Newsmax. Basically we'll have 15 second commercials running, on those boards so that we believe all these strategies will help drive the consumer as a call to action, to contact events. And with that, I'm going to call to a conclusion of this shareholders conference call unless somebody raises their hand in the next 10 seconds. Well, John Dolan, I'm going to turn it back to you to call the end of the conference call. If you'd like to rehear this webcast, the log-in -- that you ended up log-in into is the log-in that you can end up rehearing what Mr. Folkes and Mr. Lai stated today."
}