{
    "symbol": "MAC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 17:04:08",
    "content": " This was $0.05 or nearly 13% higher than the first quarter of 2021 at $0.45 per share, and represents a $0.04 increase over consensus FFO estimates of $0.46 per share for the quarter. Primary factors contributing to these quarterly NOI and FFO gains are as follows; one, the quarter included a $15 million increase in minimum rents, resulting largely from the elimination of pandemic-driven abated rents, which were heavy during the first quarter of 2021. We anticipate that our 2022 common area income results will surpass pre-pandemic levels as we previously reported to you; three, an $11 million of savings and interest resulting primarily from the dramatic debt reduction in 2021, during which we reduced our debt by $1.7 billion or 20%; four, a $9 million increase in lease termination income, driven by a few large termination settlement within the quarter. Offsetting these factors were the following: one, a $10 million decrease in noncash straight-line of rent income resulting from the high level of pandemic-driven rental assistance granted to our tenants last year in the first quarter of 2021; secondly, a $9 million quarter-over-quarter relative decrease in valuation adjustments pertaining to our retailer investments. Those were a positive $0.05 in the first quarter of last year in 2021, and a more moderated positive $0.01 FFO benefit in the first quarter of this year in '22; and lastly, three, the first quarter included a $0.16 in -- $0.16 negative impact in FFO per share, resulting from the increased share count due to common stock sold by the company in '21 through our ATM programs. Last Friday, on May 6, we closed a 2-year extension of The Oaks Mall at a fixed rate of 5.25%, and we are currently transacting and refinancing Danbury Fair Mall with an expected $185 million 5-year loan that we anticipate closing later this quarter. Derek, I think what we're seeing right now is we've got our occupancy to sort of an inflection point where we've taken enough supply off the table, that -- and we started this really in the fourth quarter of last year that we can really focus on driving rent and driving rate."
}