{
    "symbol": "SI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-18 15:17:04",
    "content": " Against this backdrop, Silvergate delivered record net income available to common shareholders of $40.6 million, an increase of 13% compared to the second quarter driven by our diverse revenue streams and progress on our strategic initiatives. At that point in time, Silvergate had fewer than 1000 digital asset customers, $2.6 billion of average digital asset deposits, and only $59 billion of spend volumes. By contrast, this quarter we have more than 1,600 customers, average deposits of $12 billion and SEN volumes of $113 billion, which is a testament to the strength of our platform over the last 2 years and the dedication of our team. Now, moving to our key metrics, average deposits from digital asset customers declined to $12 billion in the third quarter compared to $13.8 billion last quarter. Turning to SEN Leverage, our Bitcoin collateralized lending product, we saw continued strong demand for the product, with total approved commitments growing 9% to $1.5 billion compared to $1.4 billion at the end of the second quarter. Against the challenging backdrop in the overall digital asset industry, Silvergate reported another quarter of record net income available to common shareholders reaching $40.6 million or $1.28 per diluted common share compared to $35.9 million or $1.13 per diluted share in the second quarter and up from $23.5 million or $0.88 per diluted share in the third quarter of 2021. Revenue of $89.3 million was up 12% compared to the second quarter and up 73% compared to the same quarter a year ago driven by higher net interest income, which I will discuss in more detail later on. Next, on Slide 6, average digital asset customer deposits were $12 billion in the quarter, down 13% compared to last quarter. Turning to Slide 7, net interest income was $80.9 million in the third quarter, an increase of $10.3 million compared to the second quarter and $43.2 million compared to the third quarter of 2021 as we continue to benefit from our asset sensitive position within a rising interest rate environment. And in fact, if you go back and look at the last time, we experienced a â\u0080\u0093 the beginning of a bear market, which was in 2018, we saw very similar activity on the deposit side with a drop from the high to a drop of about 12%, 13% going from kind of the peak in the first quarter of 2018 to the second quarter of 2018."
}