{
    "symbol": "SI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 15:40:04",
    "content": " We started off 2022 on a strong note, with first quarter net income available to common shareholders of $24.7 million, an increase of 94% compared to the first quarter of 2021. Turning to SEN leverage, our Bitcoin collateralized lending product, total approved commitments grew 88% to $1.1 billion compared to $571 million at the end of the fourth quarter. Average deposits from digital currency customers also continued to grow during the first quarter, reaching a record $14.7 billion driven by our customers that require the ability to move U.S. dollars in real time, 24 hours a day, 7 days a week on the SEN. Starting on Slide 5 with our key financial results, Silvergate reported first quarter net income available to common shareholders of $24.7 million or $0.79 per diluted common share compared to $18.4 million or $0.66 per diluted share in the fourth quarter and up from $12.7 million or $0.55 per diluted share in the first quarter of 2021. On a year-over-year basis, total loans were up $50.5 million or 3% driven by increased SEN leverage and mortgage warehouse balances partially offset by the sale of the real estate loans I just mentioned. Net interest income was $50.5 million in the first quarter, an increase of $12.3 million compared to the fourth quarter and $27.5 million compared to the first quarter of 2021, driven by higher securities balances. And so we’re not currently contemplating any significant move in deposits from the stablecoin initiative in 2022, assuming we get the pilot launched later this year as planned, that will be a small controlled pilot with a handful of customers, and we will make sure everything is working well. And this is just a really strong example of what we’ve said consistently over the years, which is our new product launches are very much driven by customer need by helping our customers solve problems, remove friction and this is something that I think we may have even talked about in the past on some of these calls, the fact that a couple of years ago, our customers were saying to us, hey, we love the SEN for the U.S. dollar."
}