{
    "symbol": "SNDR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 17:51:02",
    "content": " For further context, last year's third quarter included $32 million of equipment gains while this third quarter contained only $11 million Adjusted diluted earnings per share was $0.70 in the third quarter as compared to $0.62 in last year's third quarter. And like we signaled on the last earnings call, if there's anything under review, it's our logistics segment margins, and there would be an upward bias in how we view those targets, but I think we remain quite comfortable with where we stand in the Truckload segment and Intermodal segment margin profile. Could you maybe kind of help us think through some of the items where you're seeing some of the greatest levels of inflationary pressure and maybe some areas where you can look to offset that, whether it's through better equipment utilization or maybe driver wages beginning to plateau -- would just love to kind of get some thoughts on that. Just want to get a sense of roughly speaking, how you're approaching â\u0080\u009823 from a price cost perspective/\n So Chris, as you think about -- as we think about the truck side of the business, clearly, dedicated more stable and we have escalators and how we deal with inflation and area cost, particularly around the driver. And so what we're really focused on, as Steve mentioned, there is how do we bring fluidity back as customers aren't sitting on equipment as long, how do we start to see our self-help items be focused around asset utility and asset utilization on both the truck, the trailer, the container -- and that's one of the things that every day we're coming in, looking and focusing on to bring a self-help item to the business. As it relates to our intermodal business, there's 2 things that just while dealing with all the complexities of the quarter, we still grew order count 4%, but we also had a significant shrinkage of our regional part of that business because of the rail labor concerns that shippers had, particularly on those shorter length of hauls -- and so we had a step back in volume on our regional play there that we didn't actually anticipate going into our guidance again, that's starting to rebound, but that puts -- it doesn't just happen for a day or 2. So we're starting to see some recovery in those volumes onto -- and as Steve mentioned, we'll have some other expenses this quarter as we get to the final push on the transition, but that really started in earnest new facilities, new drivers optimizing between the 2 railroads around your chassis and containers. And I think that's yet to be seen because of the wage inflation, because of the equipment costs, so the major drivers up and down the income statement are the ones that are experiencing the highest level of increase or have -- even though we may moderate on some of the variable costs like getting after driver recruiting and others."
}