{
    "symbol": "SNDR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 14:42:03",
    "content": " In Dedicated, more of that improvement was realized in asset productivity as our new business startups mature, more than 100% of the improvement in network was price related as asset productivity in the network was affected the most by the temporary system outage we experienced in the quarter due to a vendor hardware failure as well as COVID-related impacts on driver availability early in the year. As it relates to current market conditions, the first quarter contract renewals and price adjustments in dedicated and network remain highly supportive of the inflationary costs in the business, particularly around driver compensation and direct cost areas such as new equipment acquisition, equipment maintenance and replacement parts. And as far as the mix of the equipment, the tractor count, if you will, now versus end of this year, if we see growth, I would expect it to be in dedicated configurations or supporting our Intermodal dray fleet and kind of a maintenance mode with the Truckload network component of it. So we would expect that those mix elements that we're seeing change will continue to be the trajectory in the truck business, which as you think about the dedicated mix being longer-term contracts as well as more consistent volumes, we think that bodes well for resiliency of our truck segment. We're executing well and in the differentiation that we're bringing to market so that we can offer that service relative to own truck, owned container and owned chassis to give a great experience to our customers, we think, will continue to be received very well in the marketplace, regardless of the business cycle. I think with things that we offer, differentiation is that -- from a business model standpoint, we have the ability to leverage whole organization and enterprise to the benefit of our customer, which allows us, I think, to grab share because we're playing in truck, we playing an Intermodal, and we're helping them on some of the other lanes that don't fit other people's networks, which is so well how our logistics model plays. As you look at the network side of the business, in the truck side, we have a 19% improvement in revenue year-over-year with well over 100% of that being on the price line because of some of the throughput issues that I highlighted in my earlier comments, so in reflective of where the market is and the value that we're providing. As we have kind of assessed what we believe how we want to allocate capital, but where we believe the market will best reward the things that we do well, Ken, is that we've focused our strategic growth driver and thus, our capital allocation around the dedicated truck; Intermodal, both container chassis and power when we say Intermodal; and then technology and increasingly more trailers for Power Only in our Logistics business. The lower income folks feeling obviously a bit more stress as it relates to the cost performance, the inflationary impacts, but really through their data suggested that the large middle is still very much intact in spending and well positioned, and they're quite confident relative to their mix of customers that they're going to do okay with what's going on. I don't know how to quantify this, but just from a macro level, I think that there was some form of a pull forward, especially large customers that have global supply chains that took place maybe in the fourth quarter and created a little bit of this dynamic that we're seeing here that happened late in the first quarter and into the early second. But I think that based on Mark's earlier comments about our -- how we view the ongoing growth prospects and the various tools and capabilities that we have in the market, that we're optimistic that the margin and revenue profile that we've experienced here lately will continue throughout this year."
}