{
    "symbol": "SNDR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 20:24:09",
    "content": " We do expect our logistics, in particular our brokerage element within Logistics to be one of the fastest growing parts of our portfolio and even in what we would consider a more moderated market they had record volume growth -- had a record volume in the second quarter from an order count standpoint really across our configuration will be live, live, our core, our emerging Power Only. Yes, absolutely part of the attraction of dedicated it is from a driver condition standpoint more stable and consistent and the work patterns which the drivers prefer, but also from a company standpoint, it's more resilient through whatever freight cycles may or may not occur in the future and our portfolio now being at least 60% by the time we come out of the year bake there -- we think that as much more defensible. Well, pitch points are -- we have seen and even in our truckload trailer pool, our dwell time at customers now are back to even above peak COVID times and I think that's a condition of still we're not all through the labor constraints or seasonality of vacations and a reoccurrence of COVID that we are experiencing around other countries. Specifically, while we're very pleased from a supply chain standpoint, we've been able to get our container volume increases into the fleet, we have yet and we are working on the back half of this year to get caught up on our chassis to cover -- our chassis increases to cover those increases and so we've got some built-in inefficiency in the short-term with that, which we expect to remedy in the second half of the year, but outside the well-documented rail places or the -- maybe two other places, I would point you towards. Yes, well, maybe I point to where our investments are from a technology standpoint to do that in certainly digitizing and automating our business particularly around the transaction level has been a significant focus and we're seeing it start to bear fruit, particularly in our logistics business, but we're bringing those same digital tools to get to the long tail shipper and carrier in our other segments, whether it'd be bulk trucking Intermodal, so that we can get after the long tail more efficiently and more effectively from a cost of acquisition standpoint of volume. I also would add to that that I think that there, if there were to be some sort of air pocket that we go through that could create ironically some opportunities for improved efficiency especially in our truck network, as people have a chance to -- our customers maybe have a chance to catch their breath and become more fluid at their locations, because that's been one of our biggest pinch points within our network on the truck side. And Scott, maybe just commentary as opposed to maybe 2023 comments, but certainly as we got to the second quarter, renewals are -- our Intermodal pricing improvement really led the way across the enterprise, so consistent whether that holds all the way through 2023, we think there is room for that, but we're not making comment there just yet."
}