{
    "symbol": "SNX",
    "quarter": 1,
    "year": 2023,
    "date": "2023-03-28 13:57:02",
    "content": " This allowed us to grow revenue for the quarter on a constant currency basis, expand margins, deliver non-GAAP EPS growth towards the high end of our previously guided range and return meaningful cash to our shareholders. Overall strength in advanced solutions and high growth technologies helped to offset the declines in endpoint solutions, and the overall business saw 4% constant currency growth in gross billings in the first quarter. In closing, we expect to see a continuation of the trends we saw in the first quarter play out in our fiscal Q2, with demand for endpoint solutions likely seeing continued pressure and opportunities for continued growth in advanced solutions and high growth technologies. Despite this additional pressure, our broad diversified portfolio, coupled with our focus on margin accretive high growth technologies, allowed us to grow gross billings and revenue on a constant currency basis and expand margins, despite the lower than expected revenue growth in the quarter. Non-GAAP operating income was 443 million, up 11 million or 2.6% year-over-year, and non-GAAP operating margin was 2.93%, up 14 basis points year-over-year, primarily driven by increased mix shift to high growth technologies and cost synergy attainment. As Rich had mentioned, we expect to see a continuation of the trends we saw in the first quarter with a stronger weighting towards advanced solutions and high growth technologies. The 4% decline in net revenue is driven by an incremental gross to net adjustment year-over-year, as we continue to grow in advanced solutions and high growth technologies. We are seeing stable and consistent margins to the fiscal year outlook we provided last quarter and continue to feel confident we will deliver on our previously guided 1 billion plus in free cash flow, a large portion of which we expect to be returned to shareholders through continued share buybacks and dividends. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. I understand maybe not expanding on the revenue piece of it, but stripping out gross versus net and all that sort of stuff and just looking at the actual earnings of the company, I think you would have come to a conclusion of an earnings for around $12 for the year based on your comments of 3% to 5% growth, 2.6% to 2.8% operating margin, that's kind of where we all landed for the year. Your line is open. Your line is open."
}