{
    "symbol": "FNB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-24 13:50:05",
    "content": " FNB's fourth quarter operating earnings per share totaled a record $0.44, increasing 13% on a linked quarter basis and bringing the full year operating earnings per share to $1.40. In the fourth quarter, total revenue grew 10% linked quarter to $416 million with net interest income as the primary driver contributing 13% growth. FNB ended the year with nearly $44 billion in total assets and $30 billion in loans and leases, a 5% increase linked quarter. Total loans grew by $5.3 billion year-over-year, 21% through strategic combination of footprint wide organic growth and the completion of two accretive acquisitions, bringing total assets to $44 billion. Despite the challenging economic environment, we grew total deposits to an all-time record of $35 billion and reported average balance growth in all four quarters of 2022, while also maintaining a favorable deposit mix comprised of 34% non-interest bearing deposits. We generated over $1.1 billion of net interest income, up 24% year-over-year, driven by solid loan growth, the favorable deposit mix and the asset sensitive portion of our balance sheet. Net charge-offs from Q4 totaled $11.9 million or 16 basis points on an annualized basis with full year net charge-offs for 2022, totaling $16.2 million to stand at a very solid 6 basis point for the year, consistent with 2021 levels also at 6 basis points. This was largely driven by the $1.5 billion linked quarter increase in spot loans and leases, which included organic growth of $824 million or 11.4% annualized and the $651 million of UB Bancorp acquired loans as of the December 9 acquisition date. Full year total loan growth was a robust $5.3 billion or 21.2% on a year-over-year spot basis, roughly half of this growth was related to the previously discussed Howard and UB Bancorp acquisitions with the remaining half due to strong organic growth capping-off three sequential quarters of double-digit organic growth across the footprint. Average deposits totaled $33.9 billion for the fourth quarter, increasing $301 million or 1% including UB Bancorp acquired deposits over the last three weeks of the year. When excluding UB Bancorp deposits, average non-interest bearing deposits declined only 1% linked quarter $11.7 billion and we maintained a favorable deposit mix at year end with 34% non-interest bearing deposits, demonstrating the strength and granularity of FNB's deposit base. Record quarterly revenue of $415.5 million were driven by record net interest income totaling $334.9 million, a linked quarter increase of $37.8 million or 12.7%. On a full year basis, non-interest income totaled $323.6 million, a 2.1% decrease from 2021 primarily reflecting a significantly lower mortgage banking operations income, which was partially offset by several other fee based businesses, again demonstrating the importance of our diversified business strategy. On an operating basis, non-interest expense totaled $195.8 million, a 1.5% increase from the third quarter and an increase of 8.3% from the year ago quarter which is primarily driven by the acquired Howard and Union expense basis in occupancy and equipment and outside services. Fourth quarter's operating pre-provision net revenue totaled a record $219 million, representing an 81% increase from the year ago quarter. On a full year basis, operating pre-provision net revenue was $669.2 million, an increase of 31.7% in 2021. Full year guidance for non-interest expense on an operating basis is $830 million to $850 million, which assumes an additional $8 million in FDIC deposit insurance costs, reflecting higher assessment rates, it may remain in effect to the deposit insurance fund reserve ratio meets the FDIC's long-term goal of 2%. Please go ahead with your question. Please go ahead with your question. We have as Vince said, we have capital flexibility that we've never had before, which could mean a number of things and we did become more aggressive in buying shares back if loan growth slows, if you look at the dividend payout ratio on an operating basis, we're down to 34% unheard of it. Please go ahead with your question. I think if you look at the loan-to-deposit ratio, what's in our guidance and kind of in our plan, we get down to maybe 90% -- or up to 90%, 91% by the end of the year, which is still a very comfortable level for us. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question."
}