{
    "symbol": "FNB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 13:35:22",
    "content": " However, it's our team's proven ability to respond and adapt to the changing economic environment that resulted in the record net interest income of $254 million as 35% or $11.7 billion of our deposits are noninterest-bearing and 59% of our loans possess variable or adjustable interest rates. Total loans and leases excluding PPP reached $28 billion, demonstrating record linked-quarter growth of $1.3 billion or 19.5% annualized, making this the fifth consecutive quarter of positive loan growth. Building upon the first quarter, spot loan growth totaled an impressive 11.2% on a year-over-year basis excluding PPP and the Howard acquired loans. This resulted in an ending June reserve of $378 million or 1.35% of loans at quarter end, which represents a three basis point decrease versus the prior quarter ,remaining directionally consistent with our favorable credit quality results. On the income statement, net interest income totaled a record $253.7 million, an increase of $19.6 million or 8.4% due to growth in average earning assets and benefits from the higher interest rate environment which was partially offset by a $5.8 million decreased contribution from PPP as those balances wind down. On an operating basis non-interest expense decreased $3.9 million or 2.0% of compared to the prior quarter, excluding merger-related expenses of $2 million in the second quarter of 2022 and merger-related expenses of $28.6 million and branch consolidation costs of $4.2 million in the first quarter of 2022. Our CET1 regulatory capital ratio declined approximately 25 basis points to 9.7%, primarily due to the significant loan growth in the quarter, as well as putting more cash to work in additions to our securities portfolio. Positive credit quality is expected to continue throughout 2022 with provision guided to $20 million to $40 million, this range does not include the initial $19.1 million of provision related to Howard and is dependent on net loan growth for the remainder of the year. In summary our team delivered exceptional quarterly results in a fluid economic environment, while fulfilling a number of key strategic objectives, such as record loan growth, record total revenue, a 15.5% return on tangible common equity, solid efficiency ratio of 55% with disciplined expense control and a dividend payout ratio at 39%. I would start, as we continue to target a CET1 ratio around 10% than the level weâ\u0080\u0099re testing, it did come down about 25 basis points this quarter, given strong loan growth increased investments that I mentioned, gets advantage of higher yields. Hey, good morning, guys. Hey, good morning, guys."
}