{
    "symbol": "FNB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 13:19:02",
    "content": " While we have not seen any material impact to our credit portfolio at this time, we remain vigilant and have tailored our credit decisioning approach to address the impact that these various factors could have on a borrower's EBITDA, and margin levels, including the effects of fluctuating operational and supply costs, as well as potential interest rate sensitivities that may lead to increased borrowing costs. But excluding PPP and Howard loans as of the acquisition date, which is more reflective of underlying loan growth, period end total loans increased $259.7 million or 4.3% annualized on a linked-quarter basis, including an increase of $81.7 million in commercial loans and leases, and a $178 million in consumer loans. Turning to Slide 8, net interest income totaled $234.1 million, an increase of $10.8 million or 4.8% from the prior quarter primarily due to growth in average earning assets and initial benefits from the higher interest rate environment, partially offset by the $4.2 million decreased contribution from PPP. On an operating basis, salaries and employee benefits increased $8.1 million or 7.8% linked-quarter, primarily related to normal seasonal long-term compensation expense of $6.2 million in the first quarter of 2022 as well as seasonally higher employer pay payroll taxes. And maybe switching gears here, thinking on the -- about net interest income and obviously we're in a much different rate outlook environment now than we were last quarter and you've updated guidance to reflect that. The cash position we have is benefiting, while we still have around $3 billion -- $3.2 billion, that was earning 50, now it's earning 40, and then we would expect that to move up by the time the Fed moves, so that would be another 50 basis points to get 50, so that's helping. If you look at where we're putting money to work, so far this quarter we've invested $150 million so far in April at yields closer to 3%. Within our guidance for 2022, as we mentioned in January, was a $10 million cost savings target.. We have the cost savings from Howard still to be realized given the timing in the quarter and some of that's been realized for on track for what we initially said early on. The deposits keep growing, PPP  another $180 million of forgiveness and that goes into the coffers too, so I would think that's probably too low at this point and we'll see how the year plays out, Brian, but we've already started moving down, and we've been saying that for six quarters now."
}