{
    "symbol": "FNB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 13:36:04",
    "content": " Funded provision expense totaled $10.1 million, up $3 million linked quarter to support strong loan growth, as well as some model build tied to updated macroeconomic factors and a continued decline in forecasted prepayments. On the income statement, net interest income totaled a record $297.1 million, an increase of $43.4 million or 17.1%, reflecting growth in average earning assets and benefits from the higher interest rate environment as our net interest margin increased 43 basis points to 319. Please go ahead with your question. I mean, over the course of 2022 with various strategies since our exposure to downside rates as you look ahead here, we've reduced our cash position, added asset duration in the loan side to mortgage and securities books plus we've executed about $1 billion or so in receipt fixed swaps to protect us on the downside in the midst of, kind of, looking at potential other opportunities to put some more derivatives on pottentially protect us from downside  rates next year is expected. So it happened organically outside of that $0.5 billion and I think the way we're positioned today, there's still a good amount of benefits to come from the expected movement in rates as we get into the fourth quarter and then into next year and we'll capture that obviously in the guidance for â\u0080\u009823. Please go ahead with your question. So I mean, when I -- when we give guidance for next year, obviously, we'll give you a kind of an outlook for the full-year, as well as the quarterly path, but I think there's still upside. Please go ahead with your question. Please go ahead with your question. Please go ahead with your question. So the new rates where they're coming on, as you would expect, significantly higher, which bodes well for my comments earlier about kind of the margin as you get into the fourth quarter and continue building net interest income there. Please go ahead with your question. Please go ahead with your question."
}