{
    "symbol": "TDOC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 20:54:05",
    "content": " While the broader operating environment remains challenging across the economy, during the quarter, we made meaningful progress against our strategy, including 4 areas I want to briefly highlight: first, driving better outcomes and lower costs for our chronic care populations; second, continued momentum in our Primary360 product with clients and members; third, closing meaningful new deals; and fourth, delivering strong performance at BetterHelp. The biggest driver of that growth was BetterHelp, our direct-to-consumer mental health brand, which grew over 35% as compared to the prior year's quarter or approximately 7% sequentially over the second quarter and in line with our expectations. The total number of our members enrolled in one or more of our chronic care programs was 791,000 at the end of the third quarter, an increase of 66,000 or 9% over the prior year's quarter and a sequential decline of 7,000 enrollees as compared to the second quarter. I would also add that while the client's decision resulted in a higher-than-expected attrition rate in the third quarter, even including this loss, our full year member churn is still trending in line to slightly better than the past 2 years, a testament to our efforts to drive better member engagement. Average U.S. revenue per member per month was $2.61 in the third quarter, up 9% from $2.40 in the prior year's quarter. For the fourth quarter of 2022, we expect revenue of $625 million to $640 million, representing growth of 13% to 15% year-over-year. As I sat down with some of our largest employer clients, some of the things that they were most moved by was not just the things that I talked about, the data points that I talked about relative to treating members with chronic illnesses, but especially the fact that what we're seeing is 60% of our Primary360 members who engage with a virtual primary care relationship haven't seen a physician in the last -- in at least 2 years. In terms of your question around what does this mean for the full year adjusted EBITDA and the ramp for Q4, the way we -- I'm thinking about it is the following: we have -- when we talked about our full year adjusted EBITDA expectations last quarter, we expect it to be near the low end of our prior guidance range. But if I just take a step back and think about the Q4 adjusted EBITDA performance and therefore the full year, it still calls for the sequential ramp that will be largely driven by the seasonally -- the seasonal lower advertising expense in the fourth quarter."
}