{
    "symbol": "TDOC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 20:55:03",
    "content": " Fourth quarter consolidated revenue grew 15% year-over-year to $638 million, near the high end of our guidance range. Our key strategic priorities remain our whole person suite of services, including our virtual primary care offering, Primary360, our suite of chronic care management solutions and our mental health products, and continued growth in our BetterHelp consumer brand. For the full year 2023, we expect revenue of $2.55 billion to $2.675 billion, representing year-over-year growth of 6% to 11%. During the fourth quarter, consolidated revenue increased 15% year-over-year to $638 million. Integrated Care segment revenue increased 6% year-over-year to $357 million in the quarter, driven primarily by growth in Chronic Care Management and Telemedicine product revenue. Integrated Care added 5.8 million U.S. members over the prior year, representing 7% year-over-year growth and 1.4 million sequentially to end the year with 83.3 million total U.S. members. Total Chronic Care program enrollment exceeded 1 million programs in the fourth quarter, representing growth of 16% over the prior year's fourth quarter. The total number of individuals enrolled in 1 of our Chronic Care programs was 805,000 during the quarter, an increase of 10% over the prior year's fourth quarter. Fourth quarter adjusted EBITDA from the Integrated Care segment grew 31% year-over-year to $43.7 million, while margins expanded 230 basis points to 12.2%. For the full year, integrated segment revenue grew 6% to $1.4 billion, adjusted EBITDA declined 6% to $135 million driven primarily by increased technology and development expense. BetterHelp segment's revenue increased 29% year-over-year in the fourth quarter to $277 million, primarily driven by growth in BetterHelp membership. Consolidated guidance assumes year-over-year adjusted EBITDA margin of flat to up 50 basis points for the Integrated Care segment, and an increase of 100 to 300 basis points for the BetterHelp segment. For the first quarter of 2023, we expect revenue of $610 million to $625 million, representing growth of 8% to 11% year-over-year. First quarter consolidated guidance contemplates low- to mid-single-digit revenue growth for the Integrated Care segment, and mid- to high-teens revenue growth for the BetterHelp segment. Well, remember, Stephanie, that Primary360 is off a very small base in '22, which I think we were consistent about saying over the course of last year, and we've given an indication of the growth rates of both the Integrated Care segment as well as the BetterHelp segment."
}