{
    "symbol": "TDOC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 20:17:18",
    "content": " Although I'll spend most of my prepared comments discussing how the market dynamics we are currently seeing in the direct-to-consumer mental health and chronic care markets have influenced our revised outlook for 2022, I do think it's important to do so in the context of our broader business. While the dynamics in the direct-to-consumer market were only a modest drag on our first quarter revenue, given the persistency of these trends over the past several weeks and the broader economic backdrop, we've incorporated this updated view into our forward outlook, including an assumed 10% lower revenue yield per dollar of ad spend for the full year. When comparing the impact to guidance from the items we've just discussed, approximately three quarters of the reduction to our 2022 revenue outlook is driven by lower expected growth at BetterHelp with the remainder primarily attributed to the lower expected revenue from our suite of chronic care products. For the second quarter of 2022, we expect revenue of $580 million to $600 million, representing growth of 15% to 19% over the prior year’s quarter, as discussed on our last earnings call, in contrast to prior years, we continue to expect the cadence of new chronic care enrollees to be more heavily weighted to the back half of the year. You can go ahead. And then thirdly, if I look at the revised EBITDA and the margins being down roughly 300 basis points versus what your expectations were before, are you spending even more incrementally when we think about that customer acquisition cost on the mental health side as I -- I know you and Mala called out that two thirds of the impact is coming from BetterHelp. You can go ahead. You can go ahead. You can go ahead. You can go ahead. You can go ahead. You can go ahead. Given it seems that BetterHelp and chronic care pressures will persist for the remainder of the year, I'm curious how you're thinking about the quarterly cadence of margin expansion in the latter half of the year. You can go ahead. You can go ahead. You can go ahead. You can go ahead. You can go ahead. You can go ahead. You can go ahead. You can go ahead."
}