{
    "symbol": "EQRX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 11:51:06",
    "content": " We look forward to next month's ASCO Annual meeting, where new data will be presented for our aumolertinib and sugemalimab, including an oral presentation featuring sugemalimab in relapsed or refractory ENKTL array type of lymphoma with no FDA approved therapies, as well as the first presentation of sugemalimab interim overall survival data from a pre-specified analysis in previously untreated stage four non small cell lung cancer. To further dwell on sugemalimab's body of evidence, we are planning to initiate a US-led randomized clinical trial that is intended to support a future U.S. filing in consultation with the FDA, which will provide comparative data for sugemalimab with other approved immune checkpoint inhibitors and into diverse and inclusive population of non-small cell lung cancer patients. We also continue what we consider to be a constructive dialogue with the U.S. FDA regarding conditions under which sugemalimab may be filed for approval in the U.S. Understanding that there are concerns about the applicability of single country ex-U.S. data to current US practice, we're committed to addressing these concerns and working with the FDA to find a path forward for aumolertinib. As you heard during the call today, these include our first regulatory submissions outside the U.S. for aumolertinib and sugemalimab, the planned initiation of our first comparative studies, additional data presentations and readouts, including those at the upcoming ASCO meeting and continuing to add members to our Global Buyers Club. We wanted to focus today on aumolertinib and sugemalimab, given just how important those are, and of course, the questions that have come up previously around what the path forward is both outside the U.S. and in the U.S. Our team is firing on all cylinders and on all of the aspects of our business we've continued to make great progress, despite the fact as Chris rightly said, these are challenging times for any biopharma company."
}