{
    "symbol": "FNA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 19:37:09",
    "content": " And I'm really excited about that because I think once you see it, you're, it's hard to unsee it and you're really going to start to appreciate what the benefit can be to the foot and ankle surgeon and more importantly to patients as we're improving outcomes there. The soft tissue is a little bit different in that I think there's a soft tissue component that you can expect to see in almost every indication around foot and ankle and so the soft tissue portfolio, something you're going to continue to see expanding over time. And I'm really excited about that because I think once you see it, you're, it's hard to unsee it and you're really going to start to appreciate what the benefit can be to the foot and ankle surgeon and more importantly to patients as we're improving outcomes there. The soft tissue is a little bit different in that I think there's a soft tissue component that you can expect to see in almost every indication around foot and ankle and so the soft tissue portfolio, something you're going to continue to see expanding over time. And I'm really excited about that because I think once you see it, you're, it's hard to unsee it and you're really going to start to appreciate what the benefit can be to the foot and ankle surgeon and more importantly to patients as we're improving outcomes there. The soft tissue is a little bit different in that I think there's a soft tissue component that you can expect to see in almost every indication around foot and ankle and so the soft tissue portfolio, something you're going to continue to see expanding over time. And I'm really excited about that because I think once you see it, you're, it's hard to unsee it and you're really going to start to appreciate what the benefit can be to the foot and ankle surgeon and more importantly to patients as we're improving outcomes there. The soft tissue is a little bit different in that I think there's a soft tissue component that you can expect to see in almost every indication around foot and ankle and so the soft tissue portfolio, something you're going to continue to see expanding over time."
}