{
    "symbol": "FCN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 17:38:20",
    "content": " For a discussion of risks and other factors that may cause actual results or events to differ from those contemplated by forward-looking statements, investors should review the safe harbor statement in the earnings press release issued this morning, a copy of which is available on our website at www.fticonsulting.com, as well as other disclosures under the heading of Risk Factors and Forward-looking Information in our quarterly report on Form 10-Q for the quarter ended March 31, 2022, our annual report on Form 10-K for the year ended December 31, 2021, and in our other filings with the SEC. To me if you look at our history, the most powerful point it shows that if we don't overreact to global macro factors, but instead focused on doing the right things to build our business, things like hiring aggressively when talent is available, betting behind that great talent in the segments regardless of we're busy in that segment this quarter or not and investing behind capabilities we believe are core or positions we believe in our key adjacencies. In Corporate Finance & Restructuring, record revenues of $253.3 million increased 12% compared to the prior year quarter. The increase in adjusted segment EBITDA was primarily due to higher revenues, which was partially offset by an increase in SG&A expenses and higher compensation compared to the prior year quarter. Excluding acquisition-related revenues, revenues decreased $0.7 million or 0.4% in the quarter, primarily due to lower demand for data and analytics and dispute services, which was partially offset by higher realized bill rates and demand for investigations services. The decrease in adjusted segment EBITDA was primarily due to higher compensation, which includes the impact of a 10.7% increase in billable headcount and SG&A expenses compared to the prior year quarter. The decrease in revenues was primarily due to lower demand for M&A-related antitrust services, which was partially offset by higher demand for non-M&A-related antitrust services compared to the prior year quarter. Despite this, we generated a revenue increase in the first quarter of 2022, which was primarily due to higher demand for information governance, privacy and security, cross-border investigations and litigation services, which was nearly offset by a decline in demand for M&A-related second request services compared to the prior year quarter. The decrease in adjusted segment EBITDA was primarily due to higher compensation, which includes the impact of a 17.3% increase in billable headcount and higher SG&A expenses. Sequentially, Technology revenues increased 24.6% and adjusted EBITDA improved $5.6 million primarily reflecting increased demand for M&A-related second request and cross-border investigations services. The increase in adjusted segment EBITDA was primarily due to higher revenues, which was partially offset by an increase in SG&A and compensation expenses, which includes the impact of a 10% increase in billable headcount."
}