{
    "symbol": "FCN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 13:29:16",
    "content": " And that's a bullish point I'd like to close with, because I'd like to close with sharing my view that right now in every segment and every geography around the globe, we are continuing to build the teams and the capabilities we need to win for our clients and our firm, we're attracting and developing people who can help our clients on the most sophisticated issues and my experience is that when we do that, those short-term factors can either bully a quarter as it did this quarter or hit a quarter as it has sometimes in the past. The one, I automatically keep in mind and tend to be focused on not just on quarterly times but always which is what is a nice but you have to look past the quarter, you have to look past the quarter to say where are we with respect to the multi-year trajectory that we aspire to for this company, the goal of always building an ever-stronger company, an ever more powerful company, more capable company, one that's focused on the right parts of the market, being able to deliver for our clients, to attract great talent, to develop talent and therefore build the company that performs for our clients, that attracts performs for our people, and performs for you our shareholders. Year-over-year revenue growth, a lower tax-rate and an increase in FX remeasurement gains more than offset the impact of higher compensation, SG&A expenses and weighted-average shares outstanding or WASO, and billable headcount grew 414 professionals or 7.4% sequentially. Net income of $77.3 million compared to $69.5 million in the prior year quarter, the increase in net income was primarily due to higher revenues, a lower effective tax-rate, an increase in FX remeasurement gains, and lower interest expense which was partially offset by an increase in compensation which included the impact of a 12.4% increase in total headcount as well as higher SG&A expenses. In Corporate Finance and Restructuring, revenues of $265.4 million increased 6% compared to the prior year quarter. Excluding FX, revenues increased 9.6%, the increase in revenues was primarily due to higher demand for restructuring and business transformation services which was partially offset by lower demand for transaction services and a decline in success fees. The increase was due to higher revenues, which was partially offset by an increase in compensation, which includes 9.3% growth in billable headcount as well as higher SG&A expenses compared to the prior year quarter. The increase in revenues was due to higher realization primarily from the recognition of revenue previously deferred and higher demand for non-M&A-related antitrust services, particularly in North America, which was, partially offset by lower demand for M&A-related antitrust services compared to the prior year quarter. Adjusted segment EBITDA declined year-over-year as the increase in revenues was more than offset by higher compensation, which includes the impact of a 16.4% increase in billable headcount and higher SG&A expenses compared to the prior year quarter."
}