{
    "symbol": "AERI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 09:49:05",
    "content": " During my first investor call back in February of this year, I outlined what we see as the three strategic pillars for Aerie's long-term success: number one, driving sustainable growth of the commercial business; number; two, making smart choices with our capital and advancing our pipeline; and number three, reducing our annual cash burn rate to maintain a solid financial position. I'm pleased to report that in the second quarter of 2022, Rocklatan and Rhopressa revenues grew by 23% over the second quarter of 2021 driven mainly by strong growth in total prescriptions of 15.6%, which is well above the glaucoma market growth of 2.7% during the same period. Research and development, or R&D, expenses increased by $1.6 million or 9% compared to the prior year period and reflect continued investment in our clinical programs, including the initiation of two Phase 3 efficacy studies for AR-512. Our financial guidance for the remainder of 2022 and beyond, as outlined by Raj, is: Number one, for the glaucoma franchise, we are reiterating our guidance for 2022 net product revenues of between $130 million and $140 million; number two, for our net cash used, we are updating our guidance to be less than $20 million per quarter on average for the balance of the calendar year; number three, we expect to achieve cash flow breakeven during 2024. Looking out to the rest of 2022 and beyond, we expect to deliver continued revenue growth in our glaucoma franchise driven by our refreshed branding strategy; continued enrollment in the COMET-2 and COMET-3 efficacy studies and initiate enrollment in the COMET-4 safety study for AR-15512 in the fourth quarter of this year; submit the IND filing for AR-14034; and continue to drive operational efficiencies to strengthen our balance sheet, reduce our net cash burn and become cash flow breakeven during 2024. Your line is now open. Your line is now open. Your line is now open. I think, Annabel, these studies are done to continue to generate real-world data and put the product into the hands of physicians at the community level so that they can see what we're talking about in terms of how Rocklatan as first-line and Rhopressa add-on generally tends to align with the key messaging that we have. Your line is now open. Your line is now open. Your line is now open. Your line is now open. So I think this is a onetime I feel that it's medically the right thing to do to position Rocklatan as first line because of its efficacy and because it has the highest ability to reduce vision loss in patients with glaucoma, but it also aligns very well from a business perspective because the economics favors Rocklatan more than Rhopressa."
}