{
    "symbol": "AERI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 03:48:06",
    "content": " In summary, we’re pleased with our first quarter commercial glaucoma franchise growth, and we believe that the updated brand strategy with greater clarity in positioning and refreshed messaging and increased pull-through opportunities on our broad formulary coverage could position Aerie to achieve our revenue growth targets in 2022 and beyond, and importantly, fund our journey to a bright future. I am going to review the clinical pipeline and then briefly provide updates on ongoing global studies, our medical affairs program, and close with an update on some of our recent medical meeting presentations AR-15512 or 512 is entering Phase 3 development as a differentiated, novel, first-in-class product candidate for the treatment of the signs and symptoms of dry eye. Combined Rhopressa and Rocklatan net revenues in the first quarter of 2022 totaled $29.8 million, a 30% increase over the first quarter of 2021. In terms of the cash runway, we didn’t give guidance before, but I can tell you that based on the cash balance that we had, we basically had provided guidance in terms of our net cash burn, which is around 15% less than 2021 around $85 million to $86 million this year. Your line is now open. Your line is now open. So again, from – it’s a little too early, but our message, like I said in the press release and in my prepared remarks, the initial feedback from prescribers from our field force has been quite encouraging, which is a very distinct positioning for Rocklatan, asking for first line or first switch business and positioning Rhopressa from an MOA perspective and potentially as an adjunct, but really asking for the business to Rocklatan. Your line is now open. Your line is now open. Your line is now open. Your line is now open. And although, we didn’t hit our primary endpoint, when we look at all the signs and symptoms that were hit with significance, and we are very comfortable to be able to hit signs and symptoms, multiple signs and symptoms, including the unanesthetized Schirmer’s test, which was highly statistically significant in the Phase 2b study, as well as staining and redness that hit significance at day 84, as well as three symptoms of SANDE score, the dryness score and the discomfort score that hits significance the SANDE score from day 14 and the dryness and discomfort score at day 84 as well. Your line is now open."
}