{
    "symbol": "HL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:39:04",
    "content": " At the Lucky Friday, we produced an excess of a million ounces for the second consecutive quarter, all while executing a very significant capital plan which is going to allow us to further increase throughput and reliability. With Keno Hill expect to be in production next year, Lucky Friday's growth and Green Streets consistent performance, we now expect to produce in the range of 17 million to 20 million ounces of silver by 2024. Cash costs and all in sustaining costs for the third quarter increased to $2.65 per ounce, and $8.61 per ounce respectively, driven by lower biproduct production, lower biproduct prices at tight labor market that require the use of subcontractors primarily in maintenance. Moving to Slide 7, Lucky Friday silver production exceeded 1 million ounces in the last two consecutive quarters. For the first nine months of the year, in mine produced 3.2 million ounces of silver, which already is 90% of last year's production. All and sustaining costs increased to $1,738 per gold ounce due to higher sustaining capital expenditures associated with a design change and the expansion of the tailings storage facility and increased exploration spending. Turning to Slide 12, third quarter revenues were $146 million 30% from silver 42% from gold with zinc and lead at 28%. Due to the revenue reduction capital spend of more than $37 million for the quarter transaction costs incurred from the Alexco acquisition, refinancing of our revolving credit facility and working capital changes related to the deferral of revenues, as well as interest payments of $18 million in the third quarter a free cash flow for the quarter was negative $62 million. Even with relatively lower silver prices and a reduction in both the biproduct prices and production, we continue to see solid cash flow and margins from our silver assets, where we had a consolidated all and sustaining cost of just over $10 per ounce year to date, with a margin of more than $11 per silver ounce. And as Russell has described, we have this inflationary pressure but we're able to affirm our cost guidance and we're also maintaining our capital guidance, because we're lowering capital expenditures of the Lucky Friday and Casa to offset the development expenditures that we have at keynote at $10 million to $12 million that we mentioned. So you've seen about 3.6 million Keno in the quarter, and you're expecting $10 million to $12 million of spend in q4, which gets us from 30$ to 50% of development complete? Particularly, there's 1 million out so level, we're Lucky Friday tops out in this 2,500 tons a day a level where greens Greens Creek tops out where can those productivity gains continue and help you keep costs under control."
}