{
    "symbol": "HES",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 13:54:06",
    "content": " Our fourth development, Yellowtail, is expected to come online in 2025, with a gross production capacity of approximately 250,000 barrels of oil per day. A plan of development for our fifth development in Uaru with a gross production capacity of approximately 250,000 barrels of oil per day was submitted to the Government of Guyana in November and final approval is expected by the end of the first quarter. In the fourth quarter of 2022, company-wide net production averaged 376,000 barrels of oil equivalent per day, excluding Libya, which was above our guidance of approximately 370,000 barrels of oil equivalent per day. For the full year 2023, we forecast net production to average between 355,000 and 365,000 barrels of oil equivalent per day, an increase of approximately 10% compared with 2022 production of 327,000 barrels of oil equivalent per day, excluding Libya. For the first quarter of 2023, we forecast company-wide net production to average between 345,000 and 355,000 barrels of oil equivalent per day. In the Bakken, fourth quarter net production of 158,000 barrels of oil equivalent per day was below our guidance of 165,000 to 170,000 barrels of oil equivalent per day, reflecting severe winter weather impacts in December, which limited our new wells online to only 15 in the quarter. For the full year 2022, net production averaged 154,000 barrels of oil equivalent per day. For the full year 2023, we forecast Bakken net production will average between 165,000 and 170,000 barrels of oil equivalent per day. First quarter net production is forecast to average between 155,000 and 160,000 barrels of oil equivalent per day, reflecting weather contingencies and the carryover effects from the severe winter weather in December. Net Bakken production is forecast to steadily grow over the course of â\u0080\u009823 and â\u0080\u009824 and average approximately 200,000 barrels of oil equivalent per day in 2025. Moving to the offshore, in the Deepwater Gulf of Mexico, net production averaged 35,000 barrels of oil equivalent per day in the fourth quarter and 31,000 barrels of oil equivalent per day for the full year 2022. For the first quarter and full year 2023, we forecast net production in the Gulf of Mexico will average approximately 30,000 barrels of oil equivalent per day, reflecting normal field declines and planned maintenance. In Southeast Asia, net production from the joint development area in North Malay Basin, where Hess has a 50% interest, averaged 67,000 barrels of oil equivalent per day in the fourth quarter and 64,000 barrels of oil equivalent per day for the full year 2022. For the first quarter and full year 2023, we forecast net production in Southeast Asia, the average between 60,000 and 65,000 barrels of oil equivalent per day. Net production from Guyana averaged 116,000 barrels of oil per day in the fourth quarter of 2022 and 78,000 barrels of oil per day for the full year 2022, both above our guidance. For the first quarter and the full year 2023, we forecast net production in Guyana to average approximately 100,000 barrels of oil per day. Your line is open. Your line is open. Hi, good morning, everyone. Your line is open. Hi, good morning, everyone. Your line is open. Your line is open. Your line is open. Your line is open."
}