{
    "symbol": "SLF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 13:46:06",
    "content": " At this time, I would like to welcome everyone to the Sun Life Financial Q1 2022 Financial Results Conference Call. After the speaker's remarks, there will be a Question and Answer session. The host of this call is Yaniv Bitton, Vice President, Head of Investor Relations and Capital Markets. And good morning, everyone. We will begin today's call with an overview of our first quarter strategic highlights from Kevin D. Strain, President and Chief Executive Officer. Following Kevin's remarks, Manjit Singh, Executive Vice President and Chief Financial Officer, will present the financial results for the quarter. I draw your attention to the cautionary language regarding the use of forward-looking statements and non - IFRS financial measures, which form part of today's remarks. Turning to slide four, Sun Life delivered a solid start to 2022, driven by our diversified business model, prudent risk management practices, and strong capital position. COVID-19 continued to impact our businesses and while headwinds from COVID-19 remain, as of March, we serve to see an improvement in U.S. COVID related death, which should drive more favorable mortality experience in the second quarter. And in most of our markets, we're seeing a transition as COVID becomes less of an impact, and populations have increased immunity. This doesn't mean COVID is over, but it does suggest smaller impacts in terms of claims and business interruption going forward. We're also pleased that in both of our markets are offices are now open, and we have people working flexibly, both in the office and virtually as their day allows. With the war in Ukraine impacting economic conditions, supply chains, and energy costs, the world is now facing new challenges with heightened geopolitical pressures and central banks raising rates to curb higher-than-expected inflation. We're expecting pressure on equity markets, credit and expenses due to inflation. We're also pleased to announce a 4.5% increase to our commentary dividend, demonstrating our commitment to deliver value for our shareholders. Turning to slide five, we continued to deliver on our purpose and our ambition in the quarter as we saw continued progress in delivering on our client impact strategy. Sustainability is a key component of our strategy and in March we released our annual sustainability report, which outlines the areas were Sun Life can have the greatest impact, including increasing financial security, fostering healthier lives, and advancing sustainable investing. The report outlines how being sustainability driven is core to Sun Life strategy and how we're making an impact on sustainability for our clients, our employees and advisors, our communities and future generations. In Hong Kong, we announced Stellar, the first ESG savings plan in the market that actively integrates ESG concepts into its investment strategies. Stellar allocates funds to sustainable investments such as renewable energy, sustainable buildings, energy transition, and water and waste management with a particular focus on assets with relatively low carbon intensity. This is a great example of bringing us a sustainable solution to market by leveraging the strength of SLP management and our affiliated companies, InfraRed Capital Partners and BentallGreenOak, as well as our local investments team in Hong Kong. Under the new agreement, Sun Life will be the provider of insurance solutions to CIMB Niaga customers through all channels starting in 2025. Indonesia is the largest economy in Southeast Asia with a young emerging middle class, one of the world's largest working age populations, and low insurance penetration. Turning to asset management, we continue to see strong momentum at SLP management were in the first quarter, we raised $5.7 billion of capital, reflecting the strength and diversification of our alternative investment capabilities. We're also excited that starting next season, Sun Life will be the official health and wellness partner of the Toronto Raptors basketball team. As part of this extended partnership, our goal together is to find new opportunities to help Canadians live healthier life. In Canada, we launched Prospr by Sun Life, delivering a simple and intuitive client experience. Prospr by Sun Life is a first-of-its-kind hybrid advice solution that provides all Canadians at digital tool to identify, track, and reach their protection, wealth, and health goals all in one place. The tool provides access to life benefits counselors, and direct links to their employer's online enrollment, and offers employees a guided path to learn about their benefits through the year so they can choose the right benefits package for their needs. And in Asia, our predictive modeling tool, Next Best Offer helps our advisors recommend the right products at the right moment to our clients. These are just a few examples of how Sun Life digital leadership is delivered on our client impact strategy, while also generating business growth. We're looking forward to Denta Quest becoming part of the Sun Life family, and welcoming their employees and 33 million members to Sun Life. Before I hand the call over to Manjit, I want to stay our hearts and thoughts remained with the people of Ukraine and everyone effected by the senseless invasion and war. Together with the global community, we're concerned about the ongoing humanitarian crisis in the country and surrounding regions, and the threats to global peace and security. Sun Life, its companies and affiliates including BentallGreenOak and InfraRed Capital Partners, along with our employees, have donated more than $1.1 million dollars to various charities that are providing direct humanitarian support in Ukraine. We also know that people are struggling with mental health concerns, which have been exasperated by both the ongoing pandemic, as well as concerns related to world security and peace. As a result, in partnership with Dialogue, we are currently providing free access to self-guided online therapy to anyone in Canada struggling with mental health issues. In our mix of Asset Management insurance, businesses are well-positioned to deliver on this purpose, but also to manage through these economic headwinds. With that, Manjit will now take us through the financial results for the first quarter. And good morning, everyone. Underlying net income of $843 million, an underlying earnings per share of a $1.44 were down modestly from the prior year. Earnings for the quarter were supported by strong fundamental business activity, partially offset by COVID related impacts in the U.S. and Asia. Earnings from surplus of 65 million was lower this quarter, primarily driven by higher external debt costs and lower AFS gains. At the same time, these factors can also provide trading opportunities which can generate investment-related gains. Assets under management were 1.35 trillion at the end Q1, this was down from the end of last quarter, reflecting declines in equity markets and rising interest rates. Both value per share was up 7% over the prior year, excluding impacts and other comprehensive income, which includes foreign currency translation and changes in the available for sale. MFS reported net income of us $228 million, which was up 23% from the prior year, reflecting lower fair value changes on share-based payment awards. Compared to the fourth quarter of 2021, the operating margin declined by four percentage points due to lower average and assets and seasonally higher compensation expense. AUM declined 8% during the quarter to U.S. $637 billion, largely reflecting the decline in equity markets and U.S. $5.4 billion up fund outflows. MFS continues to deliver strong long-term fund performance for our clients in the annual bearings rankings released in February, MFS ranked in the Top 10 for the five and 10-year periods across its U.S. fund lineup. One of the key metrics is fee-related earnings, which represents the profitability for managing the assets before items such as real life performance fees. Fee-related earnings were up 38% year-over-year, reflecting strong capital raising activity and deployment into fee earning AUM over the past 12 months. Once invested, these assets can generate annualized fee revenue of more than a $150 million. On slide 12, Canada reported net income of $263 million was down 35% year-over-year, mainly due to market-related impacts. And insurance sales were strong, driven by new group benefits mandates and higher non-par life sales. This has allowed us to process over 60% of life policies without lab testing, further improving our overall client experience. Turning to slide 13, U.S. reported net income of U.S. $133 million was down 20% from the prior year, reflecting a decline in the underlying net income. Underlying net income for the first quarter of U.S. $93 million includes $30 million of COVID related impacts, mostly driven by elevated to group mortality. Compared to the prior quarter, earnings were up $37 million driven by favorable stop-loss mobility and a 17% decline in working age population debts partially offset by higher long-term disability claims. Looking forward, we expect pandemic related mortality headwinds to moderate as U.S. debts have continued to decline since early March. Similarly, we expect there will be some normalization of favorable stop-loss morbidity experience as healthcare utilization starts to increase. More importantly, the core fundamentals of our U.S. business remains strong as we continue to generate high persistency, good premium growth, and achieved solid pricing margins all while making investments in our product and digital capabilities. Reported net income was a $161 million down 16% from the prior year in constant currency, reflecting market-related impacts. The first quarter results included lower sales in Hong Kong, driven by heightened corporate-related lockdown measures. Excluding Hong Kong insurance sales were relatively consistent with prior year, which highlights the benefits of our diversified markets and products across Asia. Wealth net flows at nearly $300 million reflected strength in the Hong Kong NPS market, where we continue to rank second overall for net flows. Looking forward as COVID restrictions are slowly lifted in our Asia markets, we are optimistic that sales activity will pick up. Altogether, our businesses delivered solid financial results against a challenging macroeconomic backdrop. Although we expect headwinds to continue over the near term, we believe our diversified business model, along with our strong capital position, provider resilient foundation to manage through the current environment. We will also maintain our focus on executing on key strategic priorities, and we will continue to invest in our businesses for future growth. Overall, Sun Life as well prepared for the transition to IFRS 17. Your line is open. In terms of mortality, we're certainly seeing significant improvement as you saw with the first quarter was better sequentially than the fourth quarter. If you look at external estimates, there were about a 160,000 total deaths in the U.S. in the first quarter and the external estimates are predicting an average of about 30,000 total population deaths in the second quarter. Unfortunately, we don't think that COVID is going away completely and we do think there will be elevated mortality for a significant period of time. We are building that into our pricing as we've mentioned before, it does take a full 3 years to cycle through the entire book of business. But certainly we have ways to go until that pricing catches up, but that's probably about a mid-single-digits impact. On stop-loss as you noted, we had quite favorable experience in the first quarter. We do think over the next few quarters, utilization and hospitals will return close to normal levels, but that will take a few quarters. It remains a highly competitive market and so on a case-by-case basis, we still see pretty intense competition. Your line is open. I mean, clearly, as we made our way through Q1 year-over-year results were up pre -tax was up over last year, but as A&A is continued to come down in the second quarter relative to last year. The guidance we provide over time, is it a normal environment we think a net margin in the 35 to 40 range we were at the higher end of that. And well over that it's late last year, given the market at all-time highs. But you should expect that if the market stays where it is for the year, obviously the margins going to be pressured relative to last year. The good news is although this is a little more anecdotal, we are seeing recoveries in long COVID. But there is some overall elevation in LTD experience that's non COVID-related, as well as it's modest, but it's real. We think that's related to some of the second order effects of the pandemic, including the recent moves by some employers to require employees to return to the office. We think some of that will persist, but maybe not long term, that maybe a few quarters impact as the labor market and employers find their equilibrium of how they want to work in the future. However, like in our group life business, we are raising prices in our disability business as well to reflect these impacts. Coincidentally, it's the same mid-single-digits kind of range. Your line is open. As you know, the overall investment activity gains are largely driven by a couple of things. And obviously we had some pretty good conditions in the quarter and our investment teams took advantage of that to invest in good quality, higher-yielding assets, and that's what drove the gain in the quarter. On the IFRS 17 question, we'll handle that in our May 31st session that we have upcoming so we'll give you more details then. Your line is open. So specifically, FRE  net income target that you update as last quarter. And maybe -- maybe going down to the margin, we don't think we're prepared to do an FRE target. I think over time you're going to see the main difference between FRE related earnings and operating income is going to be that under -- between those two, you're going to have performance fees and income from seed investments that will be the difference we are putting in income and FRE margin. I think with our margin for the quarter, we're on track for the margin parts that we set out for 2025. And some of the fluctuation you'll see in margin quarter-to-quarter, even year-over-year can relate to things like catch-up fees, which could impact the margin or marketing costs. We have a big fundraising and you expense marketing costs and a given quarter, but you haven't earned the revenue yet because that will play out over time as the money is invested. So you are going to going to see you a bit of fluctuation in that, but we do think we're on target for -- on track for our targets. And where have you seen work well, seeing what's happening in the public markets, but the private markets are your all platform. I would say the first quarter fundraising, we feel really good about we haven't really seen examples of investors pulling back from these asset classes. Really picks up, you could see that we haven't seen it yet. So little too early to see with the longer-term impacts our, but I think it cuts a couple of different ways. Good morning Paul, it's Dan Fishbein again. Obviously the fact that we may see somewhat elevated mortality, although certainly nowhere near what we've been seeing in over the past couple of years, in the short-term could affect margins. But as we reprice for that, and we should be able to reprice for that, that would put us back at the same margins. As I mentioned in the last call, overall, our group benefits business is in the best condition that it's ever been. We've had significant gains in expense efficiencies, introduced new products, capabilities, and digital programs into the marketplace. He noted a couple of strengths of the business, which is obvious, we're seeing valuations drop. And we all, we always keep buybacks as an alternative if we see that the level of capital is more than what we need, we give it back to shareholders. So at this point in time, it's a combination of economic conditions, uses we have for capital and we continue to look at all of the uses. Your line is open. And I guess this question is for Jacques, I think group morbidity experience in Canada was adverse once again. And I think that's been recurring theme for a while here, just -- and I know that you've you're taking actions, putting through price increases. And that was to do with the fact that when it comes to incident, our view in our models were suggesting that the trend up was what I would call durable trend. Now, unlike incidence on duration we don't see this for now as a durable trend. It's taking -- part of this is COVID, access to care has been an issue. But at this stage, we think that's not the case. And then just a question on the Asia business, there is a large India state for an insurance company in India going public and which is interesting to talk about. It's an amalgamation in 1956/1957 of all the insurance companies, I think being a public company provides a level of discipline and transparency which is probably long-term good for the industry. Your line is open. I look back at the model to see the last time that was true, I think I have to go back to Q3 2019, though, you talk a little bit about why it would flip signs this quarter and then on a related note, the other expense or the other experience was rather negative. Is that expense -- I mean, should we be looking at those two together is what I'm getting at. Good morning, Mario, it's Manjit. On the first item, the credit you see in expenses, this quarter is largely due to some compensation adjustments that happen as part of the year-end process. So that drove -- that was a recovery in the quarters, that's what you saw. On the other expenses that you mentioned, we do have some investments that we make in businesses over time that are reflected in that line. And one of those investments, obviously that's happening right now as IFRS 17. Along with some smaller investments, we're making the BG group so that's what's in that line. I appreciate that you're doing your update -- IFRS update in 2000 --sorry, later on this month. Again, I think in a merit, it's as you say, there's a different components to that. Your line is open. Just with respect to an expected dividend increase, it kind of just shows there's some recently good capital generation here. I don't think we've heard anything about kind of excess capital generation, since you gave us an $800 million annual figure several years ago. It's Manjit, I'll take that. So as you know, we've maintained a strong capital position for many years and that's really underpinned by our disciplined approach to capital management. And as you say, an important component of that disciplined approach is generating strong capital from our diversified portfolio of businesses. And if you were to take a look at that for the past year, that would have been about a billion dollars before those market related items. And Just with respect to some of the discussions with on group morbidity, is thinking that we should be looking at your more just confirming that might be more short-term related is in more COVID related, should the focus that would be more on unemployment. Tom, I think we can let Dan answer that first for the US and Jacques answers second for Canada. Similar to Dan, I would say, we don't see employment levels as being a material issue at the moment to what we're seeing. It's really about duration, as I said earlier. With the access to care, it's really an issue of how quickly we can get people back to work. And at the moment I would say we don't expect that be durable a trend, but we're obviously watching it very closely, Tom, since it has obviously an impact on our results. In the quarter, if there's any color you can shed with respect to that and how we should be thinking about credit going forward. I think overall, you will see another positive credit release this quarter, albeit down from prior quarters. Your line is open. Does this feel like $100 million targeted is achievable in this market backdrop, I guess -- I guess the reason I have asked the as it you have to really go back like over a decade, defined a few quarters during up. Earnings on surplus this week, depending comments would be helpful. Good morning, Lemar, it's Manjit. We also had some higher debt costs reflecting the higher float rates on floating-rate debt, as well as the debt that we issued to fund DentaQuest, and as you mentioned, a lower AFS gains. And given the current environment that we're in, and as I mentioned in my prepared remarks, you'd expect the AFS gains to be more muted, which could result in surplus number below the $109 million range that we've been seeing previously. If we look at DentaQuest it is the second-largest acquisition we've ever made, but it's got a great management team. And if you remember, it's really bringing a larger dental business into a smaller dental business alongside of ours. And Manjit actually mentioned we've got the debt costs running through our earnings right now, but we don't have the benefit of the earnings coming through. But from the overall capital position, it's obviously going to use a big chunk of the $4.7 billion we have at the Whole Co. We obviously see that we're in stressed times right now, and if you look at the economic conditions. But we continue to have an eye on things that will improve the business, but we're -- we had that financial discipline will not change. Our next question comes from Nigel D'Souza, Veritas Investment Research. But I would say if it goes into the third year in a given fund, you've invested most of the assets by that time. I'll turn it credit, its infrastructure where you raised money in a fund and then you drive down and as you drive down and invest money, you start raising the fees. I'm not sure I prepared to give out a specific margin on that, but I would say that across our platform, those would be the higher fee assets that we manage. And therefore you know there are some additional costs to go those assets, but those would generally be are higher margin assets as well. And then the next question that I had was on your -- in fact, in investment activity, its favorable experience this quarter. It's Randy Brown, I'll take that. Some of -- what you heard in prior quarters is that we had built some dry powder coming into this period with the expectation for the observation that credit spreads were near all-time adjusted lows, real rates were at all-time lows, equities were an all-time highs so we took some risk off the table and built dry powder. Some of that dry powder was deployed this quarter, some of that dry -- this past quarter. And we are seeing that continue in Q2, its matter of deployment on the balance sheet in terms of how they flow."
}