{
    "symbol": "SLF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 19:57:05",
    "content": " Combined, we expect to generate more than $7 billion in total annual U.S. benefits revenues as one of the largest providers of specialty benefits in the U.S. Over the past decade, we have transformed the U.S. business from a mostly retail individual life and annuities business to a high-performing market-leading benefits business. These changes have transitioned Sun Life U.S. from a capital-intensive to a capital-light business with strong cash flow generation, from businesses with long-term risk profiles to mostly short-term risk and fee-based businesses, from slow-growth markets to higher growth markets and from ROEs in the single digits to a return on tangible equity in the high teens. Underlying net income of $344 million was up 19% from the prior year, underpinned by good business growth and favorable mortality, morbidity and credit experience. Underlying net income of $121 million was up from $93 million in the prior quarter, reflecting one month of earnings from DentaQuest and more normalized group life mortality. Of course, we've also entered a strategic management partnership with Phoenix, and we expect that we will get a good chunk of the $25 billion they're planning to deploy over the next five years into the North American sort of asset management space, and that will provide an income stream that will make up some of the lost revenue. While I got you, Kevin, one of your -- well, the big U.S. life insurers booked a big reserve charge for lapse risk in the mill last guarantee business line that they're -- I don't think selling anymore. I would say that both of these items have been headwinds for us in the comparative quarters that you're talking about, Mario, and so you can see that in a way is us taking management actions in the case of Jacques and then a big change in the COVID death rates in the case of the U.S. business that you're seeing. But we think there's a lot of potential in the DentaQuest business on multiple fronts to continue to win new government contracts in Medicaid, to expand significantly in Medicare advantage, which is really a relatively new area for them, and to put their capabilities and our legacy capabilities together to make a first-class commercial dental business as well."
}