{
    "symbol": "PHI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 20:22:03",
    "content": " We are showing Telco Core net income of PHP 8.2 billion, which is I think, if I’m not mistaken, all-time -- a quarterly high since 2015. In terms of net service revenues, all-time high for net service revenues of PHP 46.4 billion, which is a 3% growth versus same period last year or PHP 1.5 billion increase, and this was driven by the following segments. For sure, the one driving the major growth -- the major driver for revenue growth is Home at PHP 13.6 billion, which is also quarterly high for Home, 25% increase in revenues or PHP 2.7 billion. And for our enterprise, the 2 growth pillars of our business beyond connectivity, obviously, are the cloud licenses, which increased 36%, and data center as we focus on this side of the business and as we actually launch the -- we broke ground in the first quarter in 11 data -- hyperscaler data center in Santa Rosa, Laguna. And we’ve actually, again, launched or ground broke VITRO Santa Rosa this quarter and the hope is for us to complete that by the latter part of next year as we continue to address the demand in this space, and we continue to push cost -- our businesses with hyperscalers. Just to show the way our revenue has been building up over the last 9 quarters, you see that from PHP 41.5 billion starting point in the first quarter of 2020, we now have registered PHP 46.4 billion of revenues. And the increase also from fourth quarter to first quarter was PHP 0.2 billion versus what usually happened, like last year, for the first quarter dip versus the fourth. So you’ll see that from a PHP 9.2 billion quarter base in the first quarter of 2020, we’re now at PHP 13.6 billion, having added subscribers last year of over 1.1 million and now another 213,000 of fiber net adds in the first quarter of the year. For Enterprise, solid performance of PHP 11.6 billion or 7% year-on-year growth, increasing adoption of cloud data center racks in service and of course, corporate broadband connections, particularly as business returns back to the office. So overall, when you look at it from capped with data and nondata, so data broadband clearly drives the growth at an 8% increase in the first quarter versus last year and now contributing 79% to the total revenues for the period. But with that, though, just kind of normalizing for Odette, our EBITDA actually been higher by 12% or PHP 26.1 billion in the first quarter had Odette not happen. Our CapEx for the first quarter was PHP 15.8 billion, PHP 3.3 billion of that was in direct support of our install requirements for the new fiber customers that we connected, about PHP 11.6 billion was really put behind the network to allow our network to remain superior over competition. So for the last quarter, even as we were getting ready, and I’ll talk about the Maya Bank launch and the whole rebrand of our PayMaya, we were building our core businesses on the consumer side of the house, which is where we serve people through our e-wallet or app and also an on-ground network. And in terms of data usage, if you remember, sometime 3 quarter of last year, we actually had to compete in the market by launching our unlimited data propositions initially priced at PHP 499."
}