{
    "symbol": "PHI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 10:41:03",
    "content": " We've made gains across each of the 5 key pillars, strategic pillars that we focus on: elevating customer experience; improving our standing as a Philippine premier workplace; establishing industry-leading operational excellence; growing profits in core business, and we're also looking at new businesses and capabilities that will also be attractive for us moving forward; and making PLDT Group the region's leading ESG telco. So if you add those 2 contracts, plus the 2 contracts we completed last year, there's -- we have sold 7,500 of our sites, and the total amount of that sale is at PHP 98 billion in total. PLDT reported all-time high service revenues of PHP 190.1 billion in 2022, higher by 4% from last year. Looking at the segment performance, our business -- rather, our Home business continued to lead the charge, growing 20% to PHP 57.4 billion in 2022, a historic high. The outperformance of our Home business can be attributed to, next please, PLDT's superior network quality and extensive cable footprint, strong brand equity, improved installation capabilities as well as having a fixed and wireless portfolio, which allows us to offer varied technologies and price points to address market affordability considerations. As a result of our aggressive network upgrade, PLDT booked accelerated depreciation of about PHP 51.2 billion in 2022, which includes shortening of the estimated useful lives of the following assets: PLDT and Smart transport assets affected by modernization program; migration of VVDSL network to fiber; initiative to sunset 3G technology; replacement of existing aerial cables with underground; and the write-down of legacy network equipment at the Makati headquarters. It seems like a big number, right, like $1 billion of impairment... Because if you look at the breakdown, you've got PLDT and Smart transport assets affected by the modernization program, that's already PHP 19.2 billion. Second point, or if you look at the trends quarter-on-quarter, 42% of the decline actually happened in quarter 1, and that's around PHP 1.7 billion, and PHP 1.3 billion of that is actually Smart prepaid."
}