{
    "symbol": "PHI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 13:15:01",
    "content": " So for the first half, we closed Telco core net income in the second quarter at PHP 8.8 billion, which is 14% versus the same period last year of PHP 7.7 billion. So â\u0080\u0093 but if you add up our Telco core for the first half, it's PHP 17 billion, up 12% versus last year's PHP 15.2 billion. In terms of revenues, all-time high in terms of quarter ended the second quarter of 2022 of PHP 47.9 billion and first half service revenues of PHP 94.3 billion, also an all-time high, which is 5% higher than last year's PHP 89.9 billion. Having grown by 5% in terms of expenses, we are able to manage our expenses by only increasing it by 1% to PHP 43.8 billion, due really to lower provisions, but again, just to plan we give on second half, this is something that we have to continue to take a look at as headwinds can actually come up to the business because of economic conditions that we are experiencing, not only the Telco industry, but that globally, this affects all the businesses. Happy to report also that the first half EBITDA is at PHP 50.5 billion, which is also all-time high, 8% higher than last year's PHP 46.6 billion and if you add up the last four quarters, I think PLDT has reached the PHP 100 billion of EBITDA in the past four quarters in the second half of last year in the first half of this year and I think this is a good milestone that the company has achieved. And I just want to also highlight that we have fully transformed the business and today, 79% of our business will be driven by data and wireless, in terms of revenue terms, the highest contributor of PHP 35.7 billion, a growth of 2% or in peso terms, growth of PHP 700 million from last year. The fastest growing, of course, for us is Home, which is now at PHP 24.6 billion, increase of 22% for PHP 4.4 billion in peso terms compared to last year. As we have said in our announcement earlier today, despite very tough market conditions out there, PLDT is quite pleased that we are able to a record high in terms of our service revenues of PHP 94.3 billion for the first six months of this year, up 5% versus a year ago. Home continues to lead the charge in the PHP 28.1 billion revenue achievement in the first half, growing 24% year-on-year and within the Home business, the Fiber revenues now account for PHP 23.2 billion of the Home revenues and that is growing at a clip of 62% year-on-year. Enterprise also has performed very well and has also achieved an all-time high of PHP 23.2 billion for the first semester, having garnered a 9% increase year-on-year. In peso amount that was PHP 1.5 billion increment in the first quarter and it's almost double at PHP 2.9 billion, a year-on-year increase for the second quarter. Breaking it down again by the major business segments, Home increased PHP 14.5 billion in the second quarter, compared to PHP 13.6 billion in the first quarter, so that's almost PHP 1 billion higher in 2Q and it's up by PHP 2.7 billion in each of the quarters relative to last year. Enterprise has increased the growth momentum from 7% in the first quarter to 11% in the second quarter and in the case of the Individual Mobile business, you'll see here that the second quarter results are better by about PHP 0.5 billion over the first quarter, PHP 20.4 billion to PHP 20.9 billion and in terms of this comparison versus prior year, the decline less than 4% compared to 8% that was happening in the first quarter. This next chart breaks the same numbers into data versus non-data revenues and as indicated earlier, 79% of our revenues in the first half are from data and in fact, already 80% in the second quarter coming from about 70% at the start of 2020 and data having grown at 10% higher year-on-year higher compared to overall growth of 5%. EBIT of PHP 26.1 billion, a 27% margin, that's up 15% year-on-year and Telco core PHP 17 billion which is 12% from PHP 1.8 billion better than the same period last year. So in terms of our other items that affect our P&L, we did pick up our share in the Voyager losses equivalent to about PHP 1.6 billion, offset by some gains and by interest of PHP 0.5 billion and then the other items, one-offs that we have in the first half included, one, the gain from the sale and leaseback of our towers, PHP 16.5 billion; the income from the prescription of the preferred share redemption liability of 7.8, which we already reported in the first quarter; and then against that, we have accelerated depreciation of PHP 16.5 billion, MRP cost of about PHP 4.8 billion for the manpower early retirement program we have and in some ForEx loss as a result of the depreciation of the peso to PHP 54.97 by the end of June. So all told, our reported income is at PHP 16.7 billion, it's a good 30% up versus the PHP 12.9 billion in the prior year period. So in terms of the proceeds that we have received PHP 7.1 billion is used to prepay debt  to repay another PHP 9 billion debt and then substantial portion is going towards the funding of our cash CapEx and other requirements, so that effectively represents an avoidance of additional borrowings for this year equivalent of about PHP 14.5 billion already, but we need about PHP 27.2 billion. So these ones are, one, 3G assets that we have which we have already shortened the life to 2024, but given that the remaining usage of 3G is down to 3% to 4% of the market, we took the opportunity to just accelerate the whole 3G asset base of PHP 8.7 billion and in terms of the plan is that we will recover the shutdown and optimize the use of the spectrum from 3G to LTE and eventually 5G. So, again about PHP 5.9 billion of accelerated depreciation as a result of this decision to migrate earlier the VVDSL customers, there will be some additional add-on depreciation in the second half of this year, about PHP 1 billion and another PHP 1.3 billion next year to finish the full migration of the VVDSL asset reach. So Telco core income, we maintained the guidance of PHP 33 billion, as we expect a robust increase in our EBITDA, possible reduction in our financing costs resulting from the sale of our towers, but also balancing it out to the effects of prolonged pandemic in a challenging market environment that we see today that are really affecting the consumer wallet of our consumers and increasing our operating costs and CapEx in terms of â\u0080\u0093 45% our CapEx is actually US-denominated so we might see some increases in terms of CapEx. For CapEx guidance is PHP 85 billion but as I mentioned, maybe we prepare so on the FX rate impact this amount and I think numbers indicated maybe PHP 2 billion to PHP 3 billion that might weak due to the CapEx and as we continue to aspire for re-delivering positive free cash flow and aiming to deleverage back to two times really improving our position on paying special dividends."
}