{
    "symbol": "LITE",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-09 11:41:03",
    "content": " Today's call will include forward-looking statements, including statements regarding our expectations, regarding our recent acquisitions, including NeoPhotonics, such as expected synergies, and financial and operating results, macroeconomic trends, trends and expectations for our products and technology, our markets, market opportunity and customers, and our expected financial performance, including our guidance, as well as statements regarding our future revenues, our financial model, and our margin targets. As expected, sequentially higher revenue from Telecom and Commercial Lasers customers in the quarter offset the anticipated reduction in revenue from certain cloud customers due to inventory digestion and at a major consumer customer due to reduced smartphone unit production. Revenue was especially strong in products which play into the industry's transition to 400G-and-above speeds in next-generation networks, including narrow-linewidth tunable lasers, tunable transceivers for network edge applications, high-speed coherent components and modules, as well as our latest ROADMs. Turning to segment details, second quarter Optical Communication segment revenue at $448.8 million decreased 1% sequentially, primarily driven by a decline in industrial and consumer which is mostly offset by growth in Telecom and Datacom. When we acquired NeoPhotonics, we highlighted $50 million in synergy opportunities with $20 million in annual operating expense opportunities within the first fiscal year and then another $30 million cost of sales synergies as we exit the second fiscal year, we have already exceeded our $20 million cost savings target in annual operating expense synergies over the last six months of integration activity, we have executed well on our operating expense reduction plans, and are confident we will exceed our initial synergy targets. And as we highlighted in the prepared remarks, we're broadening our technology, or product offering, within the Datacom portion of our Telecom and Datacom business, we've been really focused on EMLs and DMLs that's what we had, when we got out of the module business, but over the past couple of years, expanding the axial photo diode, high power lasers for silicon photonics and CPO architectures to live a broader product offering as that plays into this very rapidly expanding interconnect dense or rich AI architecture. But I think as we look ahead, our focus is on one, continuing to do well and the customers innovation partner of choice in the consumer space, but as well broadening out into other new applications, we've got extended reality, we've got automotive, and then what's perhaps even more exciting over a longer timeframe is in the industrial markets, where sensing technologies will impact manufacturing factories, warehouses, and that's an area where not only can we supply lasers, but we can supply modules and subsystems, leveraging a much broader base of technologies that Lumentum offers."
}