{
    "symbol": "LITE",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-08 12:35:25",
    "content": " The impact of COVID-19 on our business and continuing uncertainty in this regard, macroeconomic trends, trends and expectations for our products and technology, our markets, market opportunity and customers and our expected financial performance, including our guidance as well as statements regarding our future revenues, our financial model and our margin targets. First quarter non-GAAP operating margin was 27.1%, which decreased sequentially and year-on-year due to product mix, including NeoPhotonics and our DSP investment with the IPG Telecom acquisition and was above the high end of our guidance range. So yes, so quarter-on-quarter, moving into Q2, we're seeing negative seasonality on our 3D sensing business, quite certainly that's dropping greater than 25% going into Q2 versus Q1. In terms of the comments around demand and disruption, if you will, to the earlier question, that was really focused on the incremental changes in our outlook that we're talking about this quarter relative to last quarter versus the overall envelope of our revenue, which we had highlighted last quarter would come down 40% to 50%, and that's -- now we're at the higher end of that given the incremental changes that have happened in the demand environment. Yes, that we're not seeing anything unusual that, as Alan highlighted in his comment about Datacom, certainly with the competitor in the mix, and new chips that are in the second year, competitor catching up, that adds to pricing declines year-over-year, but we're not seeing anything accelerating or unusual at the current time and don't expect that really to be a major factor moving forward throughout the remainder of this fiscal year. But in addition to that, as we look at some of the chip-based businesses coming down in demand outlook, both on the 3D sensing side and on the Datacom side, that's having more than a negative impact on our overall operating margins versus the growth we're seeing in Telecom just because of the product mix of that business."
}