{
    "symbol": "TCON",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 22:43:02",
    "content": " During today's call, we will be making certain forward-looking statements, including statements regarding expected timing of clinical trials and results, regulatory activities, future expenses and cash runway, our development plans and strategy and the timing and results of our arbitration with I-Mab. Our goal at the time of interim analysis, therefore, is to overcome the futility bar and to report a double-digit preliminary response rate across the two cohorts irrespective of patient weight knowing that the preliminary response rate will be based on a maximum of only two scans for many of the 36 patients analyzed and may increase with additional follow-up. It is important to understand the sales potential in sarcoma with ENVA at parity pricing is not solely the forecast of $200 million in peak annual ENVA revenues expected in the initial indications of refractory UPS and MFS, and the $100 million in annual revenue in rare sarcoma subtypes where the activity of checkpoint inhibition has been demonstrated. This financing extends our cash runway to support the robust accrual of the pivotal ENVASARC trial while we await the outcome of the ENVASARC interim efficacy analysis, the binding arbitration with I-Mab, and notification from I-Mab regarding their option to terminate the TJ4309 agreement for $9 million. TRACON's research and development expenses were $4.1 million and $10 million for the three and nine months ended September 30, 2022, respectively, compared to $2.7 million and $8.1 million for the comparable periods of 2021. First, this month, we expect to complete the TJ4309 Phase I trial, permitting I-Mab the opportunity to exercise their stated desire to terminate the agreement for a payment to TRACON of $9 million. So first is to exceed the futility threshold which requires a single response in each cohort among the first 18 patients, but also we expect to report an aggregate response rate with the expectation being that a double-digit response rate will be perceived by management is very encouraging given that's basically, the endpoint of the study as a very low double-digit response at 1.25% and knowing that, that will be reported as a preliminary response."
}