{
    "symbol": "TCON",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 23:36:02",
    "content": " Recall that in December, 2021, the Independent Data Monitoring Committee recommended doubling the ENVA dose to 600 milligrams after noting that ENVA dose at 300 milligrams was well tolerated and demonstrated a significantly higher objective response rate in lower weight patients. At that time, the Data Monitoring Committee will apply a formal futility rule that requires at least one response in 18 patients enrolled into each of the two cohorts at the 600 milligram ENVA dose. Following the Phase 1 portion of the trial to assess the tolerability of the combination of ENVA and YH001 doublet, as well as the triple therapy that includes doxorubicin, we will assess the response rate of common and rare sarcoma subtypes to combination treatment, with the intent of demonstrating superior response rates compared to historical data using standard of care agents. So at the 600 milligram dose we're using currently in the trial after the 36 patients enrolled, which would mean 18 patients in each cohort, meaning 18 patients who receive single agent ENVA and 18 patients receive ENVE and  (0:18:51). Once those 18 patients in each cohort is gone three months and had two scans then we will assess the preliminary objective response rate and present that to the data monitored committee, knowing there's a futility rule whereby we need one response within each of those 18 patients in each cohort in order to continue rolling that specific cohort. I would also point out that the increased dose of envafolimab we're using of 600 milligrams is still a dose that's well, within the maximum tolerated dose parameters of the drug, in the sense that in Phase 1, testing this drug was dose as high as the equivalent dose of 2,400 milligrams every three weeks. The 70 patients that enrolled at the lower dose, Joe, I don't expect we'll release data independent of the final data for the trial, but it's important everyone understands how valuable those patients are with respect to informing on the clinical pharmacology of envafolimab. And those patients dosed at 300 combined with the now 160 patients, we expect to be dosed at 600 is going to give us a broad, if you will exposure a broad-base of patients that have various exposures of envafolimab that I think will be incredibly useful to really, if you will prove to the FDA that we're using the right dose, which is the 600 milligram dose that we expect to file for approval. So in other words, Soumit just to clarify, so we expect the total number of patients enrolled in the trial now will be 230, 70 patients already enrolled at the lower dose of ENVA and then the 160 patients of which more than 10 are already enrolled as I speak, that will be enrolled in the two cohorts at the higher dose."
}