{
    "symbol": "PHX",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-09 16:29:04",
    "content": " On the working interest side, production volumes declined to 22% sequentially to 587,330 Mmcfe in the December 31st, 2022 quarter as a result of the sale of our legacy Fayetteville working interest wells in late September 2022 and the natural decline of reserves. However, as Danielle reported, royalty production in the quarter was impacted by a short-term disruption in the Haynesville due to temporary shutdowns of a few high interest wells to accommodate frac completions on a set of offsetting wells, a common industry practice and fewer new wells coming online due to typical seasonal volatility or lumpiness as also explained by Danielle a moment ago. So, total corporate production, which we stayed at for the last three years, right, is going to consist of growing royalty volumes, and decreasing working interest volumes, because we're monetizing, or just allowing the working interest to deplete, right. And so speaking of growing royalty volumes, this quarter-over-quarter drop, to be clear and to highlight it, we're a victim of our own success because we -- this particular four set of wells that was shut-in, we had a very high net revenue, interest, royalty interest in those four wells. And that's why we've have consistently said over the last three years they use, you kind of have to use a 12 month period, whether it's a rolling four quarters or year-over-year to really compared the performance because in this situation, right, there were wells that were on production, but we just couldn't book them, right. So, I think you're going to see a smaller average deal size in the 331 quarter, right, and then we sort of get back to normal as we move forward as that bid asks spread on, the average package size in that $2 million to $3 million range that, we saw at the beginning of last year, right kind of becomes more reasonably priced and we can achieve our return targets."
}