{
    "symbol": "BDN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-02 16:05:06",
    "content": " And as such, it's worth noting that our Philadelphia, Pennsylvania suburbs and Austin portfolios, which comprise about 93% of our NOI are 91.7% occupied and 92.7% lease, spec revenue of $35.7 million exceeded the midpoint of our $34 million to $36 million range. In January, we did complete a five-year $245 million secured financing with an 8.75% coupon that's collateralized by seven wholly owned properties. As we noted on page 13 in our SIP, based on our full development spending projections, our 2023 business plan execution after fully funding our remaining development spend all TI leasing and capital costs, we expect to have about $590 million of available capacity at yearend â\u0080\u009823. We also have about $0.08 per share decrease in our contribution from joint ventures, primarily due to higher interest rates, and initial projected losses from several development projects coming online and not being stabilized until after â\u0080\u009823. In looking at development, we currently have $1.2 billion under active development, of that our wholly owned development aggregates $302 million and is 30% Life Science and 70% office. At 2340, our redevelopment project is now 92% leased with $45 million of remaining funding and a mid-year coming online at that lease -- for those leases. While not really including many in our plan for â\u0080\u009923, we do anticipate continuing to sell non-core land parcels and looking at our joint ventures $458 million of our debt levels or about 19% of our total debt is coming from our joint ventures with about $416 million of that coming from our operating JVs. We also swapped our $250 million unsecured term loan through its June 27 maturity date, and our consolidated debt is now 96% fixed at just over 5% rate, only our floating line of -- only our line of credit and trust preferred securities are floating rate on the balance sheet. Most of that is due to 2340 and 405 Colorado, having incrementally higher NOI as we go through the year, we expect continued leasing of our life science development at 250 King of Prussia to be about $5 million. So all-in-all we thought we'd probably be closer to 90.7, which would have been about 34,000 square feet off of our 91% bottom end the outlook for â\u0080\u009822 is probably again, close to a 90% average occupancy, that really being driven twofold, in Pennsylvania and CBD Philadelphia, we're going to average about a 93% occupancy levels for the year, but in Austin in DC, only an 82%."
}