{
    "symbol": "EPC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-10 10:19:01",
    "content": " Importantly, in the face of an increasingly challenging operating environment, we remain committed to investing in our brands, spending just under $240 million, or 11% of net sales for the year in advertising and promotion, while improving the productivity of our spend, especially as we further shifted our focus to digital activation. Our outlook calls for organic growth of approximately 4%, largely driven by price execution and underpinned by Billie's retail expansion; compelling innovation in Sun and Grooming; continued strong distribution outcomes that reinforce our brand's growing strength on shelf; and continued improvement in market share trends, most notably in Wet Shave, reflective of our leading portfolio of women's brands in the United States and strong performance in key international shave markets. Despite continued inflation and meaningful incremental currency headwinds, through a combination of continued execution of our productivity initiatives across cost of goods and increased price realization across most of our portfolio, we will return to a core pillar of our business model, delivering 30 basis points of gross margin accretion for the year on a reported basis or 120 basis points of accretion on a constant currency basis. Since our Investor Day in November of 2020, we have now delivered consecutive years of 4% organic growth, meaningfully strengthened our portfolio with the additions of Cremo and Billie, improved our position on shelf and stabilized or even grown market share across our key markets, all while operating in the most challenging macro environment many of us have ever seen. As mentioned, organic net sales increased 1.2% or 2.7% excluding, Wet Ones while cycling about 8% organic growth last year, as price gains were partially offset by volume declines. North American organic net sales decreased just over 3% as strong growth in Men's Grooming and Shave Preps and modest growth in Sun Care and Fem Care were offset by declines in Wet Ones, Women Shave and Disposables. Looking deeper into our segments, Wet Shave organic net sales decreased just over 1%, and reflecting the previously mentioned phasing of orders that benefited Q3 as well as cycling the strong growth from the fourth quarter last year. Sun Care organic net sales in North America increased nearly 2%, despite cycling 55% growth last year and the shift in certain orders into Q3, where we grew 14%. Men's Grooming organic net sales increased about 13%, despite cycling nearly 21% growth last year. Operator, next question, please. Operator, next question, please. Operator, next question, please."
}