{
    "symbol": "EPC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-14 11:05:21",
    "content": " Organic sales growth was driven by Sun Care, which increased 28% and gained 3 points of share in the United States as well as women shave and men's grooming, each of which grew about 6% organically in the quarter. Despite these supply chain challenges and transitory headwinds to our organic growth in the quarter, consumption trends strengthened, and we gained market share in both women's shave and the fem care categories in the U.S. Dan will take you through specifics shortly. Just a few weeks ago, we launched an exciting new fem care tampons, Playtex Clean Comfort with organic cotton and 40% less plastic, building on our recent strength in Playtex Sport, which is now the #2 Tampon brand in the United States and has been the fastest-growing tampon brand over the last 13-week period, growing 2.7 share points in the quarter. Consumption growth on our branded business in the U.S. was over 10% and led to branded portfolio share gains of 70 basis points, with widespread gains across Wet Shave, Sun, Skin, and fem care. However, the external environment grew increasingly challenging in the quarter, and our organic growth rate in the U.S. lagged our consumption gains as supply chain disruption increased and certain raw material availability became stretched, both of which negatively impacted organic sales and to a degree, product availability on shelf, most notably in fem care and women shave. As mentioned, organic net sales in the quarter increased 2.1%, equally driven by price and volume and inclusive of about 170 basis points of negative mix and higher trade spend and a 130 basis point drag from Wet Ones sales declines. North American organic net sales increased 2.4%, driven by strong performance in Sun Care and Grooming, while fem care and women shave were negatively impacted by the aforementioned supply chain disruptions in the quarter. Looking deeper into our segments, Wet Shave organic net sales decreased 2.1% in the quarter as growth in Women's Systems was more than offset by declines in Men's Systems. Our Women's Systems business delivered organic sales growth for the seventh consecutive quarter, increasing 6%, led by Hydro Silk and Intuition as well as private label, which grew 27% in the quarter, while cycling 66% growth last year in Q2. International Wet Shave grew 1% as Women's Systems organic net sales grew nearly 15% for the quarter and disposables grew over 5%, both of which will remain a catalyst for growth in half 2. For the 13-week period, Edgewell consumption outpaced the category and total portfolio market share increased 30 basis points, while branded share increased 70 basis points, driven primarily by market share gains of 160 basis points in women's branded shave and disposable share growth of 100 basis points. A&P expense increased $1.5 million this quarter and was 12.8% of net sales, reflecting strong support of sun season execution, the Schick Masterbrand launch and Playtex Sport execution, and continued investment behind commercial activation in Japan and the U.K. SG&A, including amortization expense, was $101.3 million or 18.5% of net sales. Adjusted EBITDA is now expected to be in the range of $330 million to $345 million, and adjusted EPS is now expected to be in the range of $2.38 to $2.66. Adjusted EBITDA is now expected to be in the range of $330 million to $345 million, and adjusted EPS is now expected to be in the range of $2.38 to $2.66. But our confidence level for half 2 is really underpinned by the distribution outcomes that we've talked about earlier, which we're excited that the category health, the share gains that we have seen, and obviously, the incremental pricing I mentioned on the earlier question, all of that gives us a really good line of sight and a high confidence in our ability to execute what will be about a 5% organic growth in half 2."
}