{
    "symbol": "EPC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-06 14:17:03",
    "content": " Billie contributed approximately 370 basis points to top line growth, driven by continued strong execution in Walmart, where the brand has maintained its nearly 19 point share of the women's shave category. While organic growth this quarter was strong, currency headwinds increased significantly in the quarter, negatively impacting reported sales by $22 million in the quarter, which is nearly $9 million or 150 basis points worse than our previous expectations. As mentioned, organic net sales increased 9%, while cycling about 13% organic growth last year, driven by both volume and price gains and inclusive of about 150 basis points of combined headwinds from negative mix and higher trade spend. North American organic net sales increased just over 9%, driven by strong performance in Sun Care, Fem Care and Women's Shave. International organic net sales increased just over 8%, driven by strong growth in Wet Shave and Sun Care. Notably, our Women's Systems business delivered organic sales growth for the eighth consecutive quarter, increasing about 10% while cycling 12% growth last year. Women's private label grew 44% in the quarter despite cycling 31% growth last year, reflective of accelerated growth with DTC partners, new distribution and modest price increases. Sun and Skin Care organic net sales increased about 13%, driven by strong global Sun Care results and solid Men's Grooming performance. Sun Care organic net sales in North America increased nearly 14% despite cycling almost 50% growth last year, driven by continued strong execution on shelf and aided by a slight shift in sales to 3Q in response to strong early season consumption. In the U.S., the Sun Care category declined nearly 1% for the quarter, and our brands meaningfully outperformed the category, led by Banana Boat, which delivered consumption growth of 11% and gained 200 basis points of market share. Wet Ones organic sales increased about 8% in the quarter, while category consumption declined 29% as the category further resets from the COVID-driven demand spikes in the prior year. Fem Care organic net sales increased about 11%, largely driven by heightened category demand and improved product availability on shelf. I think the other thing we have to keep in mind is we're cycling a Sun Care season last year that had a really strong Q4, consumption-wise, almost 20% consumption growth in the quarter."
}