{
    "symbol": "INVZ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 15:03:04",
    "content": "  Operator: Good morning, and welcome to Innoviz Second Quarter 2022 Earnings Conference Call. I would like to remind everyone that this call is being recorded, and will be available on the Investor Relations section of our website at ir.innoviz.tech. Before we begin, we would like to remind you that our discussions today will include forward-looking statements that are subject to risks and uncertainties relating to future events and the future financial performance of Innoviz. For discussion of some of the important risk factors, that could cause actual results to differ materially from any forward-looking statements, please see the Risk Factors section of our Form 20-F filed with the SEC on March 30, 2022. I'm very excited to have you today on our second quarter of 2022, we had a very successful quarter following recent announcement on our new customer Volkswagen which we are obviously very excited to talk about. Other than that we have substantial progress on key programs additional, key programs, then we've actually already met or exceeded all of the targets that we have set for 2022. Last week, Innoviz was proud to announce that we will serve as the direct supplier of LiDAR sensors to several brands within the Volkswagen Group while integrating our perception software to carry out automated driving spec. As the program progresses, we expect more brands within the Volkswagen Group to be incorporated. BMW is the second largest car maker with more than 10 million cars sold annually with multiple brands including Audi, Porsche, Volkswagen, Skoda and many others. We expect revenues from the program already in the coming years as the development of and testing processes of our customers require 100s to 1000s of units in the next three to four years which are priced several times greater than the official stock of production SOP. Following SOP, we expect an exponential ramp-up for the life time of the project which is 8 to 10 years. Innoviz received multiple RFQs from all over the market, Volkswagen's set of requirements were the most demanding and we've seen and eventually pushed us to design the best-in-class LiDAR to-date. The first, the exceptional price and performance that our new product InnovizTwo is offering for achieving high-speed highway autonomous driving. The third, the maturity level that InnovizTwo product is already at and the last is the tier one value proposition and capabilities that we offer. With the new Volkswagen win as a tier one, these four growing assets are the reason we are confident of our ability to win many more programs in the market. While we are working closely with multiple OEMs to become their LiDAR supplier, we value the importance of strengthening the collaboration with the leading platform vendors. Innoviz is hosting partners, customers, and analyst event on the September 19. And Dr. Richard Rau, VP of Autonomous Driving, Sensors, Integration Platforms and Cooperation at BMW Group. Our second event on October 23, Innoviz and NVIDIA was selected to host a 3D perception workshop during the European Conference on Computer Vision ECCV. Volkswagen is our second nomination for serious production of passenger vehicles, the first being BMW. With this win, Innoviz is now servicing two of the world's leading car makers which together represent 15% of the entire automotive market. From the inception of Innoviz, our strategy has been to focus on prominent industry-leading car makers, which is well-known that the German car makers set the standards in the industry. Our proven track record of success in Germany has given us the maturity and global recognition of other car companies based in Europe, the U.S., Japan, and China, allowing us to offer our solution as a tier 1. As you can see from the chart on the right as a direct supplier of tier 1, you can provide customers with a low averaging price while increasing our revenues and keeping . In these videos, you can see the production line we design for the InnovizOne. As you can see, there are several machines that were developed to automate the production and testing of the first product. The same is true for InnovizTwo, we are developing full automation of the InnovizTwo production and testing lines. Once those machines are designed, built and tested, we plan to ship them to third-party contract manufacturers with automotive grade facilities to manage the operation of the production worldwide. I'm confident, our tier 1 capabilities including our ability to manage mass production manufacture ability, automotive grade quality, hardware validation, and computer vision validation will serve as a differentiating factor as other OEMs selects their direct LiDAR supplier. Innoviz has recently moved to our new offices which include our production lines, testing facilities, and a 300 meter underground laser testing track, the longest in Israel. Having the new production lines of InnovizTwo at Innoviz will help to enhance the process and save development cost, eliminate any risk of travelling restrictions that might slow the ramp-up and reduce the production cost until volume ramps-up. In parallel, we are working to establish the InnovizTwo production line in the new offices to support volume ramp-up beginning of early 2023. Highlighting further our strong momentum with non-automotive partnerships, we recently announced a cooperation agreement with Joowon Industrial who will serve as a distributor for a wide range of Innoviz applications across the industries from industrial machinery to have equipment in the Korean market and beyond. As we win additional volume contracts and establish ourselves as a leading direct supply in the automotive market, we will manage our expenses accordingly in a varied all options available to us to ensure we're optimally positioned to continue executing our strategy. We'll continue to invest in technology and perception software and are in the process of ramping up to give one sample which will include performance improvements, although the busy role but more importantly is designed for volume production. In parallel, our innovation team is working on the final design details of the Innoviz360 with most parts already in production. As you will see in the video, the InnovizTwo has outstanding results that leave our customers very impressed and excited. I truly believe is the best LiDAR out there today and since it has a very attractive price point in performance, I feel very confident in its ability to be widely sourced by many car makers making the decisions in the near future. In terms of volume production, the Volkswagen group holds about 10% of the market share which translate to over 10 million vehicle sold annually. With expectation to see growing take rate of 1% to 14% over the course of the program, starting with the more premium brands and car models and trickling down over the years to the less expensive car brands and models. We maintain a high liquidity level of approximately $246 million in cash, short-term deposit restricted cash and marketable security as of June 30, 2022. We're using our resources responsibly, staying within our expense budget for the second quarter of 2022 and maintaining a robust cash position which gives us both the flexibility to execute our 2022 strategy and provide us with a runway to invest in our new and innovative products and technology. Our revenues in Q2 this year were InnovizOne related, we are also targeting to stand the first samples of InnovizTwo later this year. Automating expenses for the first quarter of 2022 were $28.8 million, a decrease $170.7 million in the second quarter of 2021. Operating expenses in Q2 2022 included $4.4 million of share-based compensation compared to $49.9 million of share-based compensation in Q2, 2021. The decrease in operating expenses in Q2, 2022, compared to Q2, 2021, was primarily due to a decrease in share-based compensation partially offset by an increase in headcount during the second quarter of 2022. Research and development expenses for Q2 2022 were $21.9 million, a decrease from $32.1 million in Q2, 2021. Research and development expenses in Q2, 2022, included $2.7 million attributable to share-based compensation compared to $17.6 million attributable to share-based compensation in Q1, 2021. To conclude, we maintain a strong position in the market place as evidenced by our recent design win with Volkswagen Group and we believe that we are well-positioned to gain additional market share during this year and the years to come. Before I open up for questions, I'm happy to share that we will be back to New York during the week of September 5, taking part in both cities Global Technology Conference as well as the Evercore ISI Annual Technology Conference. Yes, first question is a better understanding on CARIAD and do you think there's been media reports around some software challenges at the CARIAD and I think some of the brands, according to the media we're rethinking any of what they wanted to use from CARIAD but maybe doing some stuff themselves. I think the order book calculation of $4 billion was pretty conservative, if I understood it correctly and if anything perhaps of chances to expand the number models that you're on but maybe if you could speak a little bit more in terms of how confident the different brands are. And to your last comment, I am actually very optimistic that additional brands would be included as following the discussions we are having done. And for my second question, you mentioned that two to three programs could be decided in the next 6 to 12 months in the automotive market. But with I would say the level of discussions and the nature of the details that are now discussed, I would say that I'm all the whole positive. And having the volume in our economic of scale, allows Innoviz to be very competitive even with programs of car makers that are not at the size of Volkswagen. So with this new agreement, the expectation is for revenues to start wrapping up, I think in between three and four years, I think initially. But once that takes place, the expectation is that the sensors will be used in over 10 million vehicles per year. We definitely target that number but no, I mean we're talking about the penetration rate from 1% to 14% of the total volume out of the 10 million. So, the total eventually of the entire program is calculated based on sum of roughly 6 million cars for the duration of 8 to 10 years. In regards to the 12 prospectic customer agreements that you were working off of which it sounds like most of them are for passenger vehicle programs, so that's great. Look, I believe that in any one of them Innoviz is going to be or already is on the shortlist. I would probably say that since we have increased our chances due to the recent win, I would probably at least take a 50% probability for my perspective. I mean, before you had the ability to talk about how design win with Volkswagen is a direct supplier. And therefore we've already kicked off with some car markers we're already kicked off the process to become a tier 1 meaning that eventually a car maker in order for them to add you to their supplier system, you need to go through a process and make sure that you meet their group standards. And funny enough, now that we are a tier 1 to the Volkswagen group, and we are on their system as a tier 1. But it shows that once youâ\u0080\u0099re qualify tier 1 to the car company, basically it opens a door or you can say connects a breach between you and the car maker to offer the different technologies. Meaning, if a certain client needs a certain capacity, he is paying for the specific line that he's using. In order to build the LiDAR, basically there are two machines that we developed. And the capacity of every machine is quite high, it's in the order of a 100,000 or 200,000 LiDARs a year. And as Eldar said, eventually we can place them in different locations in the world where it's convenient for the different customers. The footprint is small, the portion of the production is simple because it's automatic."
}