{
    "symbol": "INGN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 21:33:02",
    "content": " Total revenue for the fourth quarter of 2022 was $88.1 million, 15.3% year-over-year growth from the fourth quarter of 2021. Rental revenue increased 14.4% to $14.9 million in the fourth quarter of 2022 from $13 million in the fourth quarter of 2021 as the investment in our prescriber initiative continue to bear fruits, resulting in increased billable patients. Direct-to-consumer sales decreased 23.4% to $25.3 million in the fourth quarter of 2022 from $33 million in the fourth quarter of 2021, driven primarily by lower volumes due to fewer inside sales representatives and a higher mix of un-tenures sales reps as compared to the prior period. On a constant currency basis, full year total revenue increased 6.9% over 2021.  International B2B sales increased 27.3% to $101.2 million for the full year 2022 from $79.5 million in 2021 as we prioritized shipments to Europe ahead of EU MDD certificate expiration in Q2. Domestic direct-to-consumer sales decreased 5.4% to $133.3 million for the full year 2022, from $140.9 million in 2021, driven by lower volume due to a lower number of sales represented and increased percentage of non-tenured sales reps, partially offset increased average selling prices. Domestic B2B revenue decreased 5.8% to $86 million for the full year 2022 compared with $91.4 million in 2021, primarily due to supply chain constraints that limited our ability to meet all customer demand during the first half of the year, partially offset by higher average selling prices. Sales revenue gross margin was 29.3% in the fourth quarter of 2022, declining 990  basis points from the comparable period in 2021, driven primarily by channel mix, increased material costs, including premiums made for semiconductors and higher warranty costs. For the full year, sales revenue gross margin was 38.3% in 2022, declining 980 basis points compared to 2021, driven primarily by higher premiums paid for components. Operating expenses decreased to $35.8 million, primarily due to lower general and administrative and sales and marketing costs, partially offset by higher research and development costs. For the full year 2022, total operating expenses increased to $238.8 million compared to $167.2 million in 2021. For sales and marketing, we had a total spend of $120.8 million, an $8 million increase, primarily remaining of the rate as well as professional and consulting fees partially offset by lower commissions and expenses and media and advertising costs. To further help provide context for models, given the time to ramp sales renewability and productivity in the B2C channel, we are expecting the first quarter to be the lowest revenue quarter of the year and below levels that we saw last year due to the continued evolution of the D2C model as well as returning to normalized order patterns in the B2B channel."
}