{
    "symbol": "AMH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 16:25:04",
    "content": " This is primarily driven by forecasted growth in average monthly realized rent in the 6.5% area, which includes a low 4% earnings from last year's leasing activity and the partial year contribution from 2023 blended rate growth expectations. Looking ahead to core property operating expenses, next year's same-home growth outlook of 9.75% at the midpoint reflects another year of elevated property taxes and insurance, which Chris will speak to in a moment. Beginning with our operating results, we closed out 2022 with another strong quarter of consistent execution with net income attributable to common shareholders of $87.5 million or $0.25 per diluted share and $0.40 of core FFO per share in unit, representing 6.7% year-over-year growth. Subsequent to year-end, we settled the remaining 8 million Class A common shares from last year's forward equity sale agreement, receiving net proceeds of $298.4 million, which was partially used to pay down our credit facility with remaining proceeds funding a portion of our 2023 capital plan that I'll discuss more in a couple of minutes. As some additional color, at the midpoint, our expectations contemplate same-home core revenues growth of 6%, which Bryan discussed a few minutes ago, along with same-home core property operating expense growth of 9.75%, driven by property tax growth in the 9% area as we have now completed our year-end property tax forecasting process and believe that 2023 property tax growth will likely remain at the same peak levels as last year, driven by the impact of multi-year revaluation states continuing to capture backwards-looking home price appreciation. From a funding standpoint, we expect this year's $900 million AMH Capital plan to be funded through a combination of retained cash flow, $200 million to $300 million of recycled capital from dispositions, and net proceeds from our forward equity shares settled last month, and modest leverage capacity utilization from our balance sheet, leaving a couple of hundred million dollars of dry capital capacity to take advantage of additional growth opportunities should market conditions change. Please proceed with your question. Please proceed with your question. Please proceed with your question. But before Bryan shares any other color, I just wanted to remind everyone, when we're thinking about expenses in 2023, don't forget that because our Texas property taxes were under accrued for the first nine months of 2022, which were trued up in the fourth quarter of last year, our 2023 expense growth is going to be lumpy this year with higher growth in the first nine months, which will then normalize in the fourth quarter into our expected guidance range. When you look at 2022, 2023 and margins, shrinking a number -- a fair amount of it can be attributed to timing, timing of property taxes where we've seen significant growth in revenues and HPA in prior years and property taxes, as we know, is a lagging measurement tool. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And then very importantly, during times of public capital market uncertainty and volatility like right now, they strategically provide access to high-quality, long-term forms of capital, which is exactly the thought process and strategy behind the recent agreement to upsize our joint venture with JPMorgan Asset Management, which -- as a reminder, provides nearly $300 million of increased JV capital capacity that enables us to remain opportunistic on incremental land and development opportunities that might not make sense right now relative to our current on-balance sheet cost of capital. Please proceed with your question. Please proceed with your question. Please proceed with your question. I think what you're seeing is today, there are a number of individuals, households that over the last couple of years have acquired very favorable mortgage notes -- loans, maybe in the 2% range. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}