{
    "symbol": "VIAO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-28 10:02:09",
    "content": " In today's call, we will cover our fourth quarter and full year 2022, as well as share our outlook for 2023. Total revenue for the fourth quarter was EUR54.9 million, an increase of 18.6% from EUR46.3 million in the fourth quarter of 2021. We were pleased with our fourth quarter results, capping an important year in which our team has demonstrated resolve -- overcoming challenges presented by the broader macroeconomic environment, including supply chain efficiencies and ongoing effects of the COVID-19 pandemic, which impacted our operational results in 2021 and 2022. With that said, I'd now like to turn the call over to Markus for a review of our fourth quarter and full year 2022 performance and the full year outlook. For the fourth quarter, total revenue of EUR54.9 increased by 8.6% from EUR46.3 million in the fourth quarter of 2021, driven by further growth in our display solutions segment, supported by strength in the automotive end market. Gross profit margins increased to 16.6% from 13.7% in the fourth quarter of 2021 due to our actual product mix, favorable FX effect and customer related onetime effect. Display Solutions gross profit margin increased compared to the fourth quarter of 2021 despite margin pressure linked to increases in material costs, inflation, logistic expenses, as well as an overall competitive environment. Selling, general and administrative expenses decreased compared to the fourth quarter of 2021, due to further improvements in the administrative cost structure in favor of onetime effect the fixed costs could be held overall stable. Display Solutions EBITDA increased compared to the fourth quarter of 2021, driven by operational performance and nonrecurring events. Sensor Technologies revenue decreased compared to 2021, due to especially -- sorry, the Sensor Technologies revenue decreased compared to 2021, due to lower demand, especially in the third and fourth quarter of 2022 in the consumer end markets after a record turnover in the prior year."
}