{
    "symbol": "ABMD",
    "quarter": 4,
    "year": 2022,
    "date": "2022-04-28 11:54:11",
    "content": "  Operator: Hello, and a warm welcome to today’s Abiomed Fiscal Year 2022 Fourth Quarter Earnings Call. This is Nicole Nath, Manager, Investor Relations, and I’m here with Mike Minogue, Abiomed’s Chairman, President and Chief Executive Officer; and Todd Trapp, Vice President and Chief Financial Officer. The format for today’s call will be as follows: first, Mike will discuss fourth quarter business and operational highlights, and then Todd will review our financial results which were outlined in this morning’s press release. Finally, I would like to remind everyone that today’s call includes Forward-Looking Statements. With that, let me turn the call over to Abiomed’s Chairman, President and Chief Executive Officer, Mike Minogue. In the fourth quarter, Abiomed delivered a company record of 270 million in revenue, up 12% year-over-year, with record revenue across the U.S., Europe and Japan. To note, this was a record quarter following a record Q4 last year with 17% growth and a record Q3 last quarter with 13% growth despite COVID and hospital labor shortages. In addition to reaching another record revenue month, in March, we supported more patients than ever before by executing our Abiomed 2.0 playbook. For the full fiscal year 2022, we delivered 1.032 billion in revenue, up 22% year-over-year and delivered yearly record results in a challenging environment. We achieved top-tier gross margins of 82%, revenue growth and operating margins of 22% to 25%, while investing 163 million in research and development, an increase of 34% from the prior year. As a result of our ongoing investment in innovation, our IP portfolio increased to 1,408 Impella patents with 1,416 patents pending. Our balance sheet also strengthened and we ended the year with 979 million in cash and maintain zero debt, while funding multiple strategic investments. In fiscal year 2022, Abiomed invested at record levels in innovation, advanced clinical evidence, and further strengthened our premier commercial field team. We also generated 279 Impella publications, enrolled over 200 patients in RCTs and early feasibility study, and opened 646 sites globally with Impella Connect. Commercially, we hosted 20 live cases in the U.S. and Europe through our world-class interactive training platform, CAMP PCI, trained over 3,000 customers virtually and in person, launched our patient therapy awareness initiative, and added 278 employees to our company. At Abiomed, we are helping to solve a health care crisis for the heart, lungs and kidneys, while helping to minimize the disruptions caused by COVID variants and hospital labor shortages. For today’s call, I will highlight our leadership and innovation to create the field of heart recovery and our fiscal year 2023 strategy and goals. I will cover highlights on Impella 5.5, Impella ECP, Impella RP and our newest heart pump, Impella BTR. We are expanding a number of conditions and patients we can treat as we simultaneously increased the number of physicians utilizing our technology in the cath lab, surgery suite and ICO. First, the Impella 5.5 is a breakthrough product that grew 95% in the year and transformed our relationships with heart surgeons and heart failure cardiologists who are embracing this technology around the world. We recently announced the first Impella 5.5 with smart assist procedure in Japan at Osaka Hospital when an 82-year-old man suffered cardiogenic shock, but recovered, thanks to the Impella 5.5. In addition, we hit our 5,000th Impella 5.5 milestone when Dr. Tamer Attia at Emory University Hospital in Atlanta used Impella to treat a 41-year-old woman with cardiomyopathy and helped successfully bridge her to heart transplant. We also received FDA approval for the Impella Bridge To Recovery, or Impella BTR early feasibility, IDE study, and I’m happy to announce that the first patient enrolled is currently being supported with this breakthrough technology. The Impella BTR will provide patients a minimally invasive, forward flow, smart heart pump with the potential to allow home discharge and durability of over one-year. Between the Impella 5.5 and BTR, Abiomed projects a $4 billion total addressable market based on an additional 100,000 U.S. patients. Its 9 French size may enable more physicians to provide critical hemodynamic support to coronary artery disease patients enabling safer PCI procedures and more complete revascularization with an ultimate goal of improving their ejection fraction or heart function, now shown in PROTECT I, PROTECT II, PROTECT III and RESTORE EF, as well as other papers and studies in Italy, Germany and other parts of Europe. As a reminder, our investor event on Impella ECP, including presentations from Dr. Amir Kaki and Dr. Chuck Simonton, are now available on our investor website. Earlier in the year, we launched Impella RP with SmartAssist in the U.S. Within the quarter, we also filed a PMA supplement for the Impella RP with insertion through the internal jugular vein or IJ in the neck. This insertion technique allows patients to get up and walk while on support, also called ambulation, which improves outcomes and thus is preferred by heart surgeons. PROTECT IV will be the most extensive study ever done in the cath lab, not just on high-risk PCI, but on PCI overall and will lay the foundation with success for a Class 1 guideline. Each year, there are over 100,000 patients in the cath lab that are staged for multiple PCIs or receive incomplete revascularization or suffer acute kidney injury or are readmitted to the hospital within 90-days. Additionally, there were over 300,000 patients in the U.S. each year that are turned down for CABG surgery and not referred to an interventional cardiologist or PCI. In a 2020 study published in Circulation Heart Failure, authors reviewed testing for coronary artery disease in older patients with new onset heart failure and found that 61% of patients hospitalized with this condition did not receive testing for coronary artery disease, either during the index hospitalization or in the 90-days before or after admission. As a reminder, our PROTECT II and PROTECT III patients, on average, are 70-years old, so relatively young and many years ahead that can benefit from the quality of life improvements with an improvement in ejection fraction. To be clear, the reason smaller devices are important is because they lower the risk of bleeding and vascular complications, which we believe will increase Impella utilization, especially with the late majority. Second, coming out of COVID, we plan to accelerate enrollment in key clinical studies, prioritizing Impella ECP Pivotal, STEMI DTU, and PROTECT IV. And last, in leading the field with clinical publications like PROTECT III and RESTORE EF that add to our extensive prospective database of real-world evidence. Lastly, we remain focused on commercial excellence, including engagement with the heart team, physician education and patient identification for multiple FDA-approved indications. Upon arrival, physicians identified that Bobby was in cardiogenic shock due to myocarditis with a severely low ejection fraction of below 10%, a life-threatening condition. Bobby’s condition improved, and he was able to walk in the unit while on Impella support. Just months after this life-threatening condition, I got to meet Bobby as he visited Abiomed headquarters in early April as a guest speaker to share the story of heart recovery to all our employees at our Global Annual Company Meeting. In conclusion, as we start fiscal year 2023, Abiomed has flywheel momentum. I’m thankful for our employees and customer’s courage, dedication and leadership during fiscal year 2022. In Q4, we delivered record revenue of 270 million, up 12% on a reported basis and 13% in constant currency versus prior year, with double-digit growth across the U.S., Europe and Japan. As Mike mentioned, we were able to deliver these results and achieve our innovation, clinical and commercial milestones, despite the ongoing pandemic by executing our Abiomed 2.0 playbook. In the U.S., revenue grew 11% to 218 million. Within the quarter, as we executed our playbook and Omicron cases declined, we saw positive impact on performance with monthly sequential improvement and delivered a record revenue in patient months in March. As of the end of fiscal Q4, in the U.S., the Impella CP is in 1,588 sites. While the Impella 5.5 is now in 396 sites, up 47 sites versus the prior quarter. U.S. Reorder performance in the quarter was slightly above 100% and an average combined inventory at the hospitals for the Impella 2.5 and CP with 4.9 units per site, consistent with the inventory levels we saw in Q3. In Q4, total revenue was 52 million, up 22% in constant currency versus prior year due to strength in both Europe and Japan. Our European revenue increased to a record 35 million, up 18% year-over-year in constant currency. In Japan, we delivered a record revenue quarter of 14 million, up 34% year-over-year in constant currency. As mentioned during our last call, we saw Omicron cases escalate to record levels in Japan in the month of January, and hospital restrictions were put in place. Despite these headwinds, our Japan business remained resilient, delivering 29% growth in patient utilization versus prior year. Moving forward, gross margin for Q4 was 80.9%, flat compared to prior year due to higher production volume which offset investments in operators to support our future growth. R&D expense totaled 44 million, an increase of 37% from the prior year. The increase was driven by strategic investments to advance our clinical evidence through PROTECT IV and STEMI DTU randomized controlled trials and our game-changing technologies like Impella ECP, Impella RP IJ, Breethe, Impella BTR and preCARDIA. SG&A expense for the quarter totaled 110 million, up 9% versus prior year. The increase was due to targeted investments in our distribution team, our patient therapy awareness campaign, and continued training and education. In the quarter, non-GAAP operating income grew 4% to 65 million, translating to an operating margin of 24.1%. In Q4, we generated 79 million of operating cash flow and approximately 285 million for the year. As a result, we ended the fiscal year with no debt and 975 million in cash, up 131 million or 15% versus last year, while making multiple strategic investments. For fiscal year 2022, we delivered revenue of 1.032 billion, up 22% year-over-year, which exceeded the high end of our original guidance. Throughout the year, we were able to deliver double-digit growth each quarter and set revenue records in three out of the four quarters despite the ongoing headwinds. By geography, U.S. revenue grew 21%, while Europe and Japan revenue grew, in constant currency, 27% and 28%, respectively. Non-GAAP operating income for the fiscal year was 257 million, up 12% compared to the prior year, which equates to a 24.9% operating margin. As we said at the beginning of our fiscal year, we will continue to be all-in in investments in innovation, clinical research and building a premier distribution team as we continue to pursue our goal of becoming the global standard of care. In fiscal year 2022, we invested 163 million in R&D, up 34% year-over-year. Lastly, turning to guidance for fiscal year 2023. As noted in this morning’s earnings release, we expect full-year revenue in constant currency to be in the range of 13% to 17% growth. Our foreign exchange assumptions in our forecast are the euro rate at 1.08 and a Japanese yen rate at 1.28, which will impact year-over-year reported growth rates by approximately two percentage points. As we typically do when issuing guidance, I would like to provide some color on our expectations to the seasonality of our fiscal year. In Q1, our global finance team came together to celebrate the year and had extensive in-person annual training. As a result, we expect Q1 2023 to be around 277 million, up 12% on constant currency. In Q3, we typically see significant sequential lift based on increased hospital activity and physician engagement and in Q4, our March quarter, we have our best results as we end our fiscal year. We expect our fiscal year 2023 margin to be in the range of 23% to 24% as we remain focused on innovation, advancing Impella clinical evidence, and building out our premier distribution team. In fiscal year 2023, we expect to accelerate enrollment in key clinical studies, including Impella ECP Pivotal, STEMI DTU and PROTECT IV, which will drive a significant portion of our investment. In summary, fiscal year 2022 was a record year for the company despite tougher-than-expected macro conditions. We are pleased to have delivered over 20% top line growth, a second consecutive year of growth during the pandemic. Additionally, we remain fiscally disciplined achieving top-tier non-GAAP operating margin of 24.9% and increasing our cash position to almost $1 billion, all while continuing to make the necessary investments to drive Abiomed’s long-term sustainable growth. We look forward to a new year driven by innovation, robust clinical evidence and continued execution as we build the new field of heart recovery. Just for starters, Todd, a little bit more on the guidance for the year, on the constant currency side of things. And we expect to see growth pick up in this area, especially in the second half, given our distribution team expansion, our direct-to-patient campaign, all the training and education initiatives and just more clinical publications, for example, around P3 and RESTORE EF that clearly highlight the benefits of a complete revascularization in a single setting. And if you remember, three or four years ago, that was about 6% of our business, today, it is close to 18%, and grew about 60% in fiscal year 2022. Again, we are in only 60% of the 5.0 sites and 36% of the hospitals with surgical suites in the U.S. And so today, that is close to 20% of our business now is outside the United States, and it continues to grow faster than the U.S. And so we are launching 5.5 in Europe and in Japan, which should help augment our growth rates as well as continued penetration within existing products, given our low penetration rates. So the low end of the range factors these growth initiatives in at a more measured pace over the course of the year, and the high end assumes traction earlier in the year from these initiatives. And I think the big difference is, today, we are a heart team company, and heart recovery has arrived as the primary goal, whether it is high-risk PCI or cardiogenic shock from heart attacks or myocarditis or even acute and chronic heart failure with cardiogenic shock. And the flywheel, what it means is we have - personally, I have worked 18-years to get to this coming fiscal year, where we have got the best products and the most momentum on engineering. So we feel very confident about the fact that we can enable better outcomes for patients, we can also use our playbook to help hospitals with their labor shortages. I did want to ask one more here on sort of the U.S. procedure recoveries, and maybe more specifically on the high-risk PCI cases. Yes, Marie, I would say that if you went back and looked at our high-risk PCI volume in January, it was probably the lowest, from a patient perspective, all year. And I think when you looked at it, sequentially from January to February to March, we definitely saw significant sequential improvement over those last two months. Again, given the fact that these patients aren’t \"truly elective.\" And what we have seen over the last two years really is that when we see these hotspots pick up, these patients come back into the system. Sometimes the timing is tough to call, but we did see them come back into our system, I would say, late February and absolutely in the month of March. Are you willing to give us any hint at potential time lines for that and also, a two-parter here on sort of the larger RCTs that you are running longer term. I don’t think people need to wait relative to the fact that Impella is exclusively approved by the FDA, safe and effective for high-risk PCI and all forms of cardiogenic shock. The PROTECT III data shows that the newer contemporary patients are sicker, older, and they are having better procedures, they are leaving less ischemia, they are having lower vascular complications, lower bleeding and a higher improvement in their ejection fraction. In fact, if you look at the history of PCI studies with stenting, you see symptomatic relief, but we have now multiple studies, including FDA studies that demonstrate consistently an improvement in ejection fraction, which is how you improve their quality of life. I think anyone on this call that has done research over the years would insist on a high-risk PCI patient having support with Impella, so that the patient doesn’t have to be staged or risk acute kidney injury or any type of hemodynamic failure. The only thing that we are working for the future that we don’t have now is a Class I guidelines, but I’m not aware of a single medical device in the field that has all of those components at one. So we are going for the gold bar for Class 1, but in the meantime, there is tremendous amount of evidence and validation from the FDA that our technology for these patients that is what makes them safe and effective. So we also did a summary slide that is posted on the website, because we do have the opportunity to - we have multiple studies, we are continuing to enroll in ECP. So the IDE pivotal protocol was approved in March, we now have to do the - we have to get - I’m sorry, the IDE, the FDA approval was in March, we have to get now IRB approval at the hospitals for this protocol. And in April, we saw the best two weeks we have had in enrollment for both STEMI DTU and PROTECT IV, and we think the hospitals are getting back in the flow of enrolling. But in the meantime, we give a summary every quarter of every study, where we are on patients for the quarter, total patients and also a number of sites. And maybe just talk through what gets you to the high end and the low end of the range and maybe in particular, talk about some of the macro topics that are pretty pertinent today. We have our core U.S. Interventional Cardiology business, we have our U.S. Surgical business that we expect to see some nice growth on, as well as continued outpaced growth in the U.S. And really, the low end of the range assumes that the factors these growth initiatives come in over the course of the year at a more measured pace. And so if you think about our core U.S. Interventional Cardiology business, I mean, we have made significant investments over the last 24-months, in the areas of distribution team expansion and our direct-to-patient campaign and training and education and I would say more and more of these clinical publications. I guess just even staffing, obviously, kind of one of the topics in the medical device space today, just dealing with staffing and then even just inflationary pressures, because even the wage inflation is kind of impacting the staffing scenario as well. But we have a lot of things to offer them, so we offer them bedside support, we have phone support 24/7 as well, and then we have 95% of our U.S. patients running in the cloud, which makes us more productive, it makes the hospitals more productive. And I think that what we are continuing to see is kind of a partnership where they work with us and are establishing - we are seeing a stronger trend now and momentum around the - especially the U.S. to establish shock protocols because there has been publications showing the improvement in outcomes, reduction of length of stay. And there really is, I think, the COVID protocol mindset is transferring over, and we are seeing more and more hospitals work on shock teams and heart teams for utilizing our technology. But I think our sourcing team overall is aggressively working to minimizing inflationary pressures, they are looking to negotiate some of the way, we have locked in prices in certain cases for up to a year and we have actually pre-bought some raws and components before the price increases went into effect. So we are seeing some pressure as well on wage inflation, but I think have taken that consideration in our operating margin guide for the year based on the visibility of what we see today. Please go ahead, your line is now open. Good morning everyone, thank you so much for taking the question Congrats on really strong into the year, and it looks like great momentum going into fiscal 2023. First, Mike, in the past, you have talked about some building momentum at the spoke hospitals as the hub hospitals manage COVID patients or keep beds open. As COVID surges are waiting, as Omicron came off in the back half of the quarter, did you see what we had hoped to see, which was the spoke hospitals sort of sustain the volumes or anything you can say about the hubs versus the spokes and the growth that you saw in the quarter and then just one follow-up on the cardiac surgery business. And it is really been a great benefit in our distribution, but also in the flow of patients. So a spoke hospital can put an Impella in and receive pay, and the hub hospital can accept the patient on Impella support, manage that patient, explant the device and also receive DRG 268 where they are compensated for the management of the patient and the explant of the Impella and the ICU. But also most importantly, it is improving outcomes in these regional markets for cardiogenic shock patients. And then on the cardiac surgery business, I mean, that has just been a phenomenal growth driver over the last two years and even during a pandemic. And a $4 billion TAM, I’m just curious, Mike, as you take a step back here and look at the business in three to five years, it has gone from 6% to 18% of the business. I don’t look at percent, because I expect to have significant growth in high-risk PCI and shock and definitely on the surgery business and being at ISHLT all week, the surgeons will tell you, the heart failure cardiologists will tell you that this is a crisis, heart failure is a crisis, whether it is acute on chronic heart failure, which will address with preCARDIA and Impella, or if it is chronic cardiogenic shock or long-term heart failure itself with the 5.5 and BTR. So we have put a slide up on the quarterly series and you will see actual scale, how small the Impella BTR pump is and what it means. One, we are seeing with the 5.5 the best outcomes we have seen in these kind of chronic patients. We are also seeing a large percent get back to baseline and have their kidneys recover and then longer term, what the BTR allows is to get - not give up on recovery and allow patients to go home being discharged. So we are getting actual pressure in the left ventricle and the aorta, which means we can wean the heart back scientifically, which is you are not able to do with any conventional LVAD. So besides the fact that it is smaller, it is smarter and it is more connected, the ultimate goal for these patients that are 70 and above that are not able to get a transplant is to really get them back to baseline, protect their kidneys and go back to quality of life at home. I’m wondering how contributory clinical trial revenues are in your guidance, both ECP and BTR and also whether you have had any clarity from FDA regarding continued access registry for PCP. We went from early feasibility into this pivotal protocol, which will become the overall pivotal as we ramp up to 217 patients. The continuing access protocol will happen when we are done enrolling or where we lock it down and yes, then we will continue to keep those centers open and continue to treat patients at those centers. First on gross margin, when you look out three to four years and presumably ECP dominating your percutaneous pump business are there any reasons to think like gross margin profile should change versus the current 2.5 in terms of any differences in manufacturing or componentry or things like that versus the current business? So what we think is that the Impella ECP will be an ideal protected PCI product that likely eliminates the balloon pump in the cath lab for many of these patients, especially for those physicians who are uncomfortable with access closure of a 14-French hole with a 9-French catheter on Impella CP. We see the 5.5 is the best device for that longer-term chronic patient that gets up and walks around and then, of course, BTR can be a goal of over a year where the patient has the option to be discharged home. So that is the way we are going to manage our gross margins, but we have been, for over the last 10-years, in the top companies as far as best-in-class on gross margins, and we take great pride in that and it shows the value of this technology overall. Obviously, this year is going to be a big investment year just given the multiple clinical trials going on in international expansion, et cetera. Well, Imron, I just provided guidance for fiscal year 2023. But I think when I look at fiscal year 2024, at some point in time, these clinical trials will start to moderate and then start to come down. And so when I look at R&D as a percentage of sales this year, it is going to be close to 18%. Hopefully, if we are able to execute on our clinical trials in terms of enrollment and site openings post-COVID, it is going to be a big year. And then hopefully, starting next year or maybe the year following that, it will start to moderate and come back down. And then longer-term R&D, we will get back into that 12%, 13% of sales. And like we have seen over the last two years, they do come back and it comes back in the next few months. So I would say very little backlog, in my opinion, as we get into fiscal year 2023. So I know based on the government website update, there is probably at least 1.5 years out until we see some sort of potential approval, but just curious if you have any early thoughts on ECP pricing versus the other models, assuming stable reimbursement. Please go ahead, your line is now open. I guess I’m surprised it is - 2% is big, because when you look at where the euro rate was last year, it was 1.12% on average. And more importantly, the yen last year averaged 1.16% in the month of April then went up to 1.28%. For the Breethe product, we expect to be second half, we are working on upgrading some of the electronics on the consoles itself, we feel confident and very positive about the clinical outcomes, we are finding a little bit more IP, we are making some improvements to the products as we are waiting to go back through this process. And in Europe, we have already validated the software for Auto ECPELLA, which allows the Impella console to know there is an ECMO device being utilized, so we can differentiate the pressure coming. So between ECPELLA and Breethe coming out in the second half, we feel like we are going to be well positioned not only to recover hearts and save lives, but to recover hearts and lungs and save lives. Todd, what is a reasonable adjusted tax rate input for models this year and the guidance, just to level set there. You had very impressive high 20s growth there, both in Europe and Japan as we were exiting the year. Wanted to touch on the Japanese market in particular and Todd, if you could give us any color there in terms of are you at an inflection point or just think about like just the launch of the Impella here in the U.S. in terms of its adoption curve or is it just a function of just critical mass in terms of the facilities? As we mentioned in our prepared remarks, we had just another really strong quarter in Japan with record revenues and record patients despite some of the headwinds there. So we delivered 14 million, which was up 34% on a constant currency basis, pretty consistent with what we saw last quarter, patients were up 29%, 7% quarter-over-quarter. And as you know, we are excited to really launch the 5.5 there in this upcoming fiscal year. And so we are at 20 sites in LMR and again, we are really excited to bring this technology to Japan and expect another strong year out of Japan in fiscal year 2023."
}