{
    "symbol": "ABMD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-03 19:35:01",
    "content": " From a financial perspective, we achieved a 25% operating margin while investing $41 million in research and development as we remain fanatical and focused on creating breakthrough technologies, advancing clinical research and guidelines and improving real world outcomes by supporting hospitals with a premier clinical team and our long term outlook is robust and strengthened by our balance sheet with $932 million in cash and zero debt, with over 1300 patents and over 1300 patents pending. Recently, a cardiogenic shock 24-hospital multicenter U.S. observational study published in JACC demonstrated that centers with shock teams were more likely to obtain invasive hemodynamics, use advanced types of mechanical circulatory support like Impella and less IABP, resulting in lower risk adjusted mortality for patients. R&D expense for the quarter totaled $41 million, up 24% versus Q3 of last year, driven by accelerated investments and breakthrough technologies like Impella ECP and preCARDIA and randomized control trials, such as STEMI DTU and PROTECT IV. Despite the rise in Omicron, and ongoing hospital labor shortages, given our performance in Q3, we have increased the lower end of our fiscal year 2022 revenue guidance to $1.025 billion to $1.03 billion, representing 21% to 22% growth versus prior year. And last is we have built a premier field clinical team connected real time in the cloud with Impella Connect and we're using all that data to process Artificial Intelligence algorithms that help us see how the patient is going to do, protect right heart failure, and measure hemodynamics from the pump itself. And you're also seeing the Impella used for those patients as well, specifically around the shock and again, giving them the ability to get up and walk around. And we also think that the model is working with and without COVID, with and without the resurgence we're able to provide a solution for hospitals to treat their sickest patients to support them in the Cath lab, in the surgical suite, and also most important to help support the nurses and physicians and train people on site or online. So if a patient doesn't want to drive into the city to the transplant center, which might be that COVID hub, they can do the procedure there whether it's high-risk PCI, or if it's a Shock patient, they can put an Impella device in that patient, stabilize that patient, and then transfer that patient if there's a bed available to the ICU at the transplant hospital. And after they put the Impella 5.5. in, now they have options and therapies that they can utilize, whether it's some patients are sent to the EP lab for VT ablation, some go on for open heart surgery, and some go to the Cath lab and have a PCI depending on the protocol there. So, again, I think what you're going to see over time is that all the transplant centers will be reliant on the Impella 5.5 and most important start to think about native heart recovery are getting the patient back to baseline compared to the options they have today."
}