{
    "symbol": "GNW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 11:11:06",
    "content": " U.S. GAAP net income was $149 million for the first quarter, while adjusted operating income was $131 million or $0.25 per share. U.S. Life reported an adjusted operating loss of $4 million for the quarter, driven by an operating loss of $79 million and life insurance, mostly offset by strong performance and LTC insurance and annuities. While the first quarter statutory results are still being finalized, we expect strong pre-tax statutory income of approximately $210 million for the first quarter. After reducing our debt to $900 million by fully retrying the 2024 debt, we will have an interest coverage ratio, inclusive of cash tax payments of approximately 8.8 times and a debt-to-capital ratio of 10.3% which would be among the lowest debt-to-capital ratios in the life insurance industry. Because of the positive free cash flow outlook and balance sheet improvements enabled by the Enact IPO, as well as our continued strong operating performance, the Genworth board has authorized a new share repurchase program of up to $350 million, representing over 15% of Genworth’s current market cap. As Tom indicated earlier, the first quarter served as a strong start to the year as shown on slide four of the investor presentation with net income of $149 million and adjusted operating income was $131 million or $0.25 per share. Results in the current quarter reflect adjusted operating income of $135 million from Enact, and $9 million from our runoff segments partially offset by adjusted operating losses of $4 million from the U.S. life insurance segment, and $9 million from corporate and other. As shown on slide four, Enact’s adjusted operating income to Genworth was $135 million, an increase of 8% from the fourth quarter. In our LTC insurance business, adjusted operating income was $59 million, compared to $190 million in the prior quarter and $95 million in the prior year. The pre-tax balance of our GAAP only profits followed by losses reserve, which covers projected losses in the future increased by approximately $200 million pre-tax to approximately $1.5 billion, reflecting the strong LTC results on the quarter. As a result, we reduced our previously established COVID-19 mortality reserve by $9 million pre-tax in the quarter, decreasing the balance $225 million, LTC claim mortality remained elevated consistent with nationwide COVID-19 mortality trends and reflected the surge of the Omicron variant as well as seasonal mortality patterns of experiencing high mortality in the first quarter. The resulting $101 million in annual premium rate increases approved in the first quarter brings the total net present value from achieved LTC rate actions to $20.4 billion since 2012, up approximately $800 million since year-end. As shown on slide nine, the first quarter adjusted operating earnings from in-force rate actions of $304 million after tax includes a favorable impact related to the Choice 1 legal settlement. Turning to slide 12 in our life insurance product, we reported an adjusted operating loss of $79 million, compared to operating losses of $98 million in the prior quarter and $63 million in the prior year. In fixed annuities, adjusted operating income was $16 million compared to $20 million in the prior quarter, reflecting the impact of lower net spreads from a decrease in bond calls and commercial mortgage loan pre payments and continued block runoff. In the runoff segment, our adjusted operating income was $9 million for the first quarter compared to $16 million in the prior quarter, and $12 million in the prior year. First, based on the expected cash flows from Enact’s regular quarterly dividends, we will have approximately two times coverage on our debt service costs of $40 million per year and no principal due until 2034."
}