{
    "symbol": "GNW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 12:51:03",
    "content": " U.S. GAAP net income was $104 million for the third quarter, while adjusted operating income was $159 million or $0.31 per share. U.S. Life reported adjusted operating income of $11 million, driven by LTC and fixed annuities, partially offset by losses in life insurance. U.S. Life companies had combined pre-tax statutory income of approximately $10 million in the third quarter, which has improved versus the prior quarter, driven by smaller equity market declines, which require us to increase statutory reserves and our closed block variable annuity business. On a U.S. GAAP basis, the life businesses and Runoff together had adjusted operating income of $20 million in the third quarter. The estimated PMIERs sufficiency ratio of 174% or approximately $2.2 billion above published requirements remained strong and was up first quarter, driven primarily by the execution of a new excess of loss reinsurance transaction, business cash flows and lower delinquencies. The segment reported adjusted operating income of $11 million, reflecting adjusted operating income of $25 million from LTC and $19 million from fixed annuities, partially offset by an adjusted operating loss of $33 million in life. In our LTC business, adjusted operating income was $25 million, compared to $34 million in the prior quarter and $133 million in the prior year. The resulting $200 million in incremental annual premium increases brings the total net present value from achieved LTC rate actions to $21 billion since 2012, up approximately $1.4 billion since year end. We reported an adjusted operating loss of $33 million, compared to operating losses of $34 million in the prior quarter and $68 million in the prior year. In the current quarter, total term deferred acquisition cost or DAC amortization was $24 million after-tax, which was higher than the prior quarter and prior year, primarily from term lapses as the 20-year term block issued in 2002 entered the post level premium period. We recorded a $10 million after-tax charge for DAC recoverability testing in our universal life insurance products related to continued Runoff of the block and unfavorable mortality experience, compared to $12 million in the prior quarter and $30 million in the prior year. Regarding fixed annuities, adjusted operating income was $19 million, compared to $21 million in the prior quarter and $28 million in the prior year, reflecting lower net spreads from lower bond calls and commercial mortgage loan prepayments, as well as continued block Runoff. Our Runoff segment comprised mainly of variable annuity products, reported adjusted operating income of $9 million for the current quarter, compared to $2 million in the prior quarter and $11 million in the prior year. Rounding out our results for the quarter, we reported an adjusted operating loss in Corporate and Other activities of $17 million, compared to a $14 million adjusted operating loss in the prior quarter and $1 million of adjusted operating income in the prior year."
}