{
    "symbol": "TJX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-02-23 14:13:02",
    "content": " As Ernie mentioned, U.S. open-only comp store sales grew 13% over a strong 6% increase in the fourth quarter of fiscal '20. For the full year, Marmaxx delivered an outstanding 13 open-only comp store sales increase and segment profit dollars increased more than $340 million or 10% versus fiscal '20. For the full year, HomeGoods delivered a phenomenal 32% open-only comp store sales increase and segment profit dollars increased more than $225 million or 33% versus fiscal '20. Lastly, for modeling purposes for the full year, we're currently anticipating a tax rate of 25.8%, net interest expense of about $50 million and a weighted average share count of approximately 1.2 million -- billion. And then maybe just, Scott, near term, on the positive 1 to 3 comp guide for the quarter -- for the first quarter, is it fair to say you've seen February reaccelerate back to November's mid-teens comp or just anything that provides you confidence as we head into the 20% plus March, April on near term, I think, would be helpful. So Matt, to answer your question, we can't give you specific, but I think the most important thing is that -- is what I said in the script, that we're currently comping against low to mid-single-digit U.S. comps where then, again, it accelerates to that strong plus 20 in the  period. So that's why our guidance of the $11.5 billion to $11.7 billion is -- in rough terms, is 14% to 16% increase because as our -- and the other thing is we are starting to see some of the restrictions in Europe be lessened and hopefully, that will give us some room for improvement there as well. And we continue to buy and ship the right values at the different retails that we're talking about in significant categories of goods, I think we're going to offset the lion's share of those expense headwinds in the fairly short term here, which is as in this coming year, which is why I think we get to approach double digits on our operating margin. I do think, as you've heard on other retailers report, that this will persist for much of the year, but we do believe that the first half is -- has the higher year-over-year increases or incremental costs and it will moderate as we move to the back and particularly in the fourth quarter where everything peaked due to some of the actions we did. So overall, we would expect when you get past this year, that the sum of all of the expense pressures will be significantly less, not back to our pre-COVID levels but with a level -- we would need a significantly less average retail increase to be able to cover that compared to what we're seeing this year. We could have some -- we could have some average retail driving that really in the Marmaxx, for example, and we could actually be down slightly in units but drive our comp with ticket based on what's going on in the environment and the mix of goods within the store that we're going into."
}