{
    "symbol": "TJX",
    "quarter": 1,
    "year": 2022,
    "date": "2021-05-19 15:58:05",
    "content": " Your line is open. Your line is open. Your line is open. Your line is open. And Scott, I think, started to allude to this as we go forward even into the back half, we’re looking like it’s going to moderate even more, because we’re seeing some more best brands goods coming in on order as we get to the third quarter, which is going to help our average ticket and that should help our expense on processing come down a little bit. Your line is open. Your line is open. In terms of your question on SG&A, I’d actually have to get back to you in terms of, we’re up about 4% on a per store basis versus 2020, but it’s -- this quarter, it’s a little difficult to have to segregate that out because you don’t -- you have still have a fair number of expenses in Europe and Canada without the typical type of sales that you might expect and then we had the outside sales in Marmaxx and HomeGoods. Your line is open. And then with all the noise and you laid out the closures, I think, as we take the inputs you gave us, you probably excluding the closures would have been about $2 billion higher on sales versus first quarter fiscal 2020 and then when we add back your $0.21 to $0.24 that you pointed to, which was, I think, only for the closures, you’d be at about a 9.9% to 10.4% margin in the quarter, compared to the 10.1% in first quarter two years ago? Your line is open. So, obviously, when we looked at the first quarter and it’s tough to measure we can’t get at all that data specifically, we do believe the stimulus checks, et cetera, were part of it and clearly a pent-up demand issue, right, from people not having shopped and then we have the -- something we talked about, I think, it was in last call, you do have that revenge shopping aspect that I think comes out where people are passionate and want to get out there and we are entertaining. And one thing we said when we’re generally running well is the both at HomeGoods and Marmaxx, the consistency of the sales regionally, the consistency of the sales based on household income as best we can determine, consistency, in terms of the age of our stores -- our stores whether it’s at HomeGoods and Marmaxx that are over 10 years and depending -- even going up as is all the 20 years and 30 years are doing significant comps. Your line is open. We expect our margins to get better as we move into the back half and we would expect them to get, significantly better next year to be -- we’ll have to see what level our sales get to in the back half and then what, how some of these costs on freight and supply chain and wage pressure to determine what level of margin we’re going to actually settle in at."
}