{
    "symbol": "FELE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 12:17:13",
    "content": " Favorable price and mix contributed to Fueling Systems fourth quarter operating margin of 28.4%, an increase of 30 basis points compared to the prior year quarter. Worth noting, the company's fourth quarter 2021 results included a $6.5 million or approximately $0.12 earnings per share bargain purchase gain, which I called out last year as a onetime event and nonoperational in nature. Fourth quarter 2022 consolidated sales were a record $489.4 million, a year-over-year increase of 13%. In the fourth quarter 2022, sales from businesses acquired since the fourth quarter of 2021 were $3.9 million. Water Systems operating income was $44.6 million for the fourth quarter of 2022, up $8.2 million or about 23% versus fourth quarter of 2021. Overcoming weather related headwinds at the end of the quarter, Distribution's fourth quarter sales were a record $148.9 million versus fourth quarter 2021 sales of $116.9 million. In the fourth quarter of 2022, organic sales increased 12% compared to the fourth quarter 2021, and sales from businesses acquired since the fourth quarter of 2021 were $17.5 million. The Distribution segment's operating income was $2.9 million for the fourth quarter, a year-over-year decrease of $2.7 million. Fueling Systems operating income was $24.3 million, a fourth quarter record driven by higher sales compared to $22.2 million in the fourth quarter 2021. Franklin Electric's consolidated gross profit was $166.2 million for the fourth quarter 2022, a 14% year-over-year increase. Consolidated operating income was $56.2 million in the fourth quarter 2022, up $9 million or 19% from $47.2 million in the fourth quarter 2021, despite an unfavorable foreign exchange translation headwind of approximately $3.2 million. In industrial pumps Walter, what we're seeing again is that we've been growing the Pioneer brand product line, that business was actually started by its founders 25 years ago with sales of zero and now that's a business that is well north of $100 million."
}