{
    "symbol": "FELE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 12:56:06",
    "content": " We gained momentum in the second quarter leveraging strong demand around the globe in a normal seasonal uptick resulting in record results including the highest consolidated net sales, operating income and EPS for any quarter in Franklin Electricâ\u0080\u0099s history. In Water Systems, we experienced overall revenue growth of 26%, operating income growth of 42% and operating margin of 15.8% for the second quarter. Our U.S. distribution business delivered another strong quarter with overall revenue growth of 32% operating income growth of 46% and operating margin of 12.2% driven by solid demand in the U.S. groundwater water market, price realization and the acquisition of Blake Equipment at the beginning of the year. Consolidated sales were a record $551.1 million compared to 2021 second quarter sales of $437.3 million, an increase of 26%. Water System sales in the U.S. and Canada were up about 38% compared to the second quarter of 2021, due to acquisition related sales, price and volume. In the second quarter of 2022, sales from businesses acquired since the second quarter of 2021 were $12.9 million. Water Systems record operating income was $49 million in the second quarter of 2022 up $14.4 million, or about 42% versus the second quarter of 2021 and operating income margin was 15.8%, an increase of 180 basis points. Operating Income margin improved due to leverage on fixed costs from higher sales, price realization and cost management. In the second quarter of 2022, sales from businesses acquired since the second quarter of 2021 were $19.6 million. The distribution segment operating income was record for the second quarter, at $23.3 million compared to the second quarter of 2021 operating income of $16 million. Fueling systems operating income in the second quarter was $26.1 million, a new quarterly record compared to $18.5 million in the second quarter of 2021 driven by higher sales. Operating Income margin improved due to leverage on fixed costs from higher sales, price realization and cost management."
}