{
    "symbol": "FELE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 13:28:05",
    "content": " Turning to our segments, Water Systems delivered record third quarter sales and operating income with overall revenue growth of 12% and operating income growth of 25% led by strong organic growth in all geographies. Our U.S. distribution business also delivered record sales for any quarter in its history, as well as record third quarter operating income, growing 38% and 54% respectively. Our Fueling Systems business delivered record sales and operating income for any quarter in its history with overall revenue growth of 11%, operating income growth 20%. Third quarter 2022 consolidated sales were a record $551.7 million, compared to the 2021 third quarter sales of $459 million, an increase of 20%. Water Systems sales in the U.S. and Canada were up about 16%, compared to the third quarter of 2021 due to acquisition-related sales, price and volume. In the third quarter of 2022 Sales from businesses acquired since the third quarter 2021 were $5.6 million, Water Systems sales in the U.S. and Canada grew 13% organically in the third quarter. Distribution achieved record third quarter sales at $193.2 million in the quarter, versus the third quarter of 2021 sales of $140.2 million. In the third quarter of 2022, sales from businesses acquired since the third quarter 2021 were $21.7 million. The Distribution segment operating income was a record for the third quarter at $19 million, compared to the third quarter of 2021 operating income of $12.3 million. Fueling Systems sales in the U.S. and Canada increased by about 11%, compared to the third quarter of 2021. Fueling Systems operating income in the third quarter was $28.6 million, a new record for any quarter, compared to $23.9 million in the third quarter of 2021 driven by higher sales. The third quarter of 2022 operating income margin was 31.7%, compared to 29.5% of net sales in the prior year. Consolidated operating income was $80 million in the third quarter of 2022, up $23.4 million or 41% from $56.6 million in the third quarter of 2021 despite an unfavorable foreign exchange translational headwind of an estimated $3.8 million. So Walter Iâ\u0080\u0099d say this, generally, distribution business, as you may recall from the second, third quarters are our best volume quarters as we get the most operating leverage, mix quarter-to-quarter is a little bit hard to parse out because it really depends a little bit on how much of commodity types or commodity-based products are going through distribution versus, what I call, non-commodity. So, the distribution business gives us a little bit of a closer view to the end-market in the U.S. groundwater space, which is a portion of our overall business and as we see it right now, we saw that the non-commodity products going through distribution were up about 10% in the quarter, as compared to last year organically."
}