{
    "symbol": "FELE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 13:21:05",
    "content": " Picking up right where we left off in 2021, we again delivered record results, which included the highest consolidated net sales, operating income and EPS for our first quarter and by segment in Franklin Electric’s history. Our open order balance grew from $175 million at year end to approximately $290 million at the end of the first quarter, which included an approximate $50 million increase from large dewatering pumps and Water Systems in addition to increases in other Water Systems and Fueling Systems products. Turning to our segments, in Water Systems, we experienced overall revenue growth of 38% for the first quarter, reflecting strong demand, record backlog and a contribution from strong acquisition growth. Our U.S. Distribution business again delivered a strong quarter with overall revenue growth of 41%, alongside operating income growth of 370% and operating margins of 7%, continuing to highlight the segment’s role as a growth engine for the company. First quarter 2022 consolidated sales were a record $451.5 million compared to 2021 first quarter sales of $333 million, an increase of 36%. Water Systems sales in the U.S. and Canada were up about 38% compared to the first quarter of 2021 due to acquisition-related sales, price and volume. Water Systems record operating income was $33.2 million in the first quarter of 2022 compared to $31.3 million in the first quarter of 2021, while operating margin decreased by 360 basis points compared to the prior year quarter. Fueling Systems operating income in the first quarter was $17.7 million, a new first quarter record compared to $14.9 million in the first quarter of 2021, driven by higher sales. Operating income margin in the first quarter decreased in Fueling Systems, primarily due to inflationary pressures and supply chain challenges, which the company continues to work to offset with pricing and to some degree, an unfavorable product mix. The company’s consolidated gross profit was $145.3 million for the first quarter of 2022, an increase from the first quarter of 2021 gross profit, the $115.5 million. Across the company, in the first quarter, we’ve announced generally between, I would say, 5% and about 20% increases depending on the region, the location, the product line between Water and Fueling in some areas are – need to catch up a little more than other areas."
}