{
    "symbol": "LEN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-15 16:14:05",
    "content": " Market conditions continue to deteriorate in the fourth quarter as the now well-documented interest rate driven sales slowdown and pricing correction intersected with the still stressed supply chain, high labor and material costs and elongated cycle times to make for a very complicated landscape to bring the year 2022 to a close. We fundamentally believe that this price to market strategy reflects our balance sheet for its focus, where we can maintain starts and sales, generate cash flow, and keep our home building machine going. We focused on pricing to market, turning inventory and thus generating cash as we -- and we also focused on preserving cash by matching our starts pace with our sales pace, and as Jon mentioned, reevaluating every land deal in our pipeline to ensure the underwriting aligned with today's market conditions. My first question is, with starts leading orders, could you comment on how you balance the unit economics of, let's say, the lower margin, 5% versus the incremental cash flow of selling that unit as your land goes down 20% or perhaps 50% when your actual inventory units decline because I think the idea is the income statement is nice, but the cash flow that comes from these choices is much more cyclically important. If we're going to be the ones out there to do -- starting homes, we're going to get cost concessions, bringing cost concessions from our trade partners, from our land partners, and we're just going to continue, as Jon said, value engineer and re-specify product in order to make it more affordable, so we can have more higher margins. Look, we're clearly in the early innings because as the homebuilding industry is completing the fourth quarter of the year, you have for all builders really the largest production quarter, so labor has been -- has remained very busy while the market has slowed down prior to the fourth quarter."
}