{
    "symbol": "LEN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-03-17 12:47:04",
    "content": " Today’s conference call may include forward-looking statements, including statements regarding Lennar’s business, financial condition, results of operations, cash flows, strategies, and prospects. I’m here in Miami, joined by Jon Jaffe, our Co-CEO and President; Diane Bessette, our Chief Financial Officer; David Collins, our Controller and Vice President; Bruce Gross, CEO of Lennar Financial Services; and of course, Alex, who you just heard from; and we also have Rick Beckwitt, Co-CEO and President on the line with us, and he's joining us from Colorado. After my introductory remarks, Rick's going to talk about market strength and land and community count. Our operating results reflect both the extraordinary focus and determination of Lennar's management and operating teams, as well as the general strength in the housing market. As questions abound given geopolitical turmoil, inflationary pressures building both around the globe and domestically, and interest rates are rising, the housing market remains very strong in all of our major markets. As our team from around the country reviewed our weekly sales starts and closings on Monday for our regions and our divisions, the unanimous view was that our sales pace range in each market from strong to very strong. Buyers are seeking shelter and they are seeking shelter from inflationary pressures as scarce rentals see rents escalating and escalating housing costs can be controlled with an owned home with a fixed rate mortgage, while wages are going up, so too our housing costs. While demand is strong, supply is short and constrained, the ability to actually build and deliver homes has been slowed by the supply chain that is all but broken, by the workforce that is short in supply and the intense competition for scarce and titled land assets. Accordingly, we're pleased to report operating performance that reflects the general strength in the housing market. Setting aside for the moment, our noncash mark-to-market gains last year and losses this year, our operating performance is consistent and very strong. While deliveries increased 2% year-over-year to 12,538 homes, our gross margin improved 190 basis points to 26.9% and our SG&A improved 90 basis points to 7.5%, which drove net margin to 19.4% and drove net earnings from operations to just over $800 million and almost 20% bottom line improvement from operations. Although deliveries have been constrained by the supply chain disruption, efficiency in our operations continues to drive strong bottom-line improvement and very strong cash flow. Additionally, our financial services group continues to perform exceptionally for the company, adding $90 million of earnings, while supporting the closings of every possible home and making the closing process as joyful as possible in the current, very difficult environment. First, with the lengthening of our cycle times by 6 to 8 weeks over the past year, driven by supply chain disruption, we have more capital invested in our inventory, as we are increasing starts and taking longer to deliver homes, even as we are significantly reducing the amount of land held on our books. Next, we're continuing to pay down debt as it comes due, with the next tranche available for paydown in August, and that's $575 million that we expect to pay down from cash flow. And of course, we have continued to repurchase stock with another 5.3 million shares purchased in the past quarter and another $2 billion authorized by our board just yesterday. With strong performance and cash flow, we have fortified our balance sheet with $1.4 billion of cash on book, nothing drawn on our revolver and an 18.3% debt-to-total cap ratio as compared to 24% last year. We expect our results to continue to strengthen throughout the year, as our already increased start pace results in more deliveries and as we use our size and scale and our builder of choice relationships to alleviate and resolve some of the supply chain friction. To that end, last quarter I noted that Jon and Rick, our co-CEOs have not chosen to sit idly in difficult times, but instead, they went to the problem and visited each of our 38 divisions over a six-week period. Monitoring Jon and Rick came this quarter, I noted that on top of regular in-the-field operations reviews at division offices, they have jointly with Kemp Gillis, our esteemed Head of Alfen  Supply Chain, gone to the problem and visited approximately 10 of our most strategic manufacturers at their offices to engage directly the problem-solving process. These investments are also the tip of the spear in identifying and engaging our substantial industry-leading sustainability initiatives from solar on the rooftop to microgrid technology across the community, from water conservation to sustainable cement, our LenX strategy is setting the course from Lennar's sustainable future. For example, in Q1 2021, we reported a $470 million mark-to-market profit, and in Q1 of 2022, this quarter, we reported $395 million mark-to-market loss. On the other hand, these investments have been stepping stones to our higher gross margins, as well as our never been lower SG&A at 7.5% in the first quarter, which is now the lowest we have ever seen in the first quarter. These are non-monetary and non-operational profits and losses, and they really do not reflect the state of the housing market, or the operating performance of the company within that market. Now, finally, let me talk briefly and update our progress on SpinCo and are focused on becoming a pure-play homebuilding company. Nevertheless, given the choppiness of the capital markets and the work that is still being completed, we're pushing our expectations for the actual execution to the third or fourth quarter of this year. Many of the assets targeted for SpinCo will be either part of the limited balance sheet of SpinCo or are currently being monetized in the form of assets under management that will be housed within the private equity verticals of SpinCo, or they're being resolved and monetized in other ways. Additionally, while we are taking more time to execute the spin, we continue to migrate assets from the Lennar balance sheet into the assets under management that will comprise SpinCo. And as of the end of our first quarter, had approximately $10.7 billion of gross capital under management and is very close to our first closing for our third fund. LSFR, our single-family for rent platform, has grown from approximately $1.2 billion of assets deployed at the end of 2021 to approximately $1.9 billion deployed as of the end of our first quarter. And our land strategies platform, which is still being refined for SpinCo, expects to have $4 billion to $5 billion of assets under management at the time of the spin. As I've noted in the past, the remaining Lennar Corporation will drive higher returns on our assets and equity base and the spin will not result in a material reduction of either our bottom line or our earnings per share. So let me wrap up and conclude by saying that we're extremely well-positioned financially, organizationally and technologically to thrive and grow in this evolving housing market. We also know that difficulties in the supply chain present challenges for Lennar and for the industry, and that land and labor are in short supply. Strategically, we remain focused on orderly targeted growth, with our sales pace tightly matched with our pace of production. As we look to the remainder of 2022, we expect continued strength in the market and double digit growth for the company. As noted in our press release, we are projecting 16,000 to 16,300 deliveries in the second quarter at a 28% to 28.25% margin. And we are now projecting 68,000 deliveries for a year-end at a 27.25% to 28% margin for the year. As you can tell from Stewart's opening comments, the housing market is very strong. During the first quarter, we started 4.7 homes per community, sold 4.3 homes per community, and we ended the quarter with less than 180 completed unsold homes across our entire footprint. This production, margin driven and sales focus program will continue to improve margin and lead to increase deliveries and profits in fiscal 2022. In the first quarter, new orders, deliveries, gross margins were solid in each of our operating regions. As Stuart said in his opening remarks, all of our markets are strong right now, but here's some color. Florida continues to benefit from core local demand as well as in migration from the Northeast, Midwest, and West Coast, which is driving both sales pace and price. The hottest markets in Florida are Naples and Sarasota in the Southwest, Miami, Dayton, Broward in the Southeast in Tampa, Orlando is also a robust market benefiting from a significant rebound in tourism. All of these markets -- in all of these markets, we are the leading builder with the best land positions. Atlanta continues to see strong and steady growth, driven by limited inventory, relative affordability, and strong job creation. During the first quarter, we entered the Huntsville, Alabama and Florida, Alabama coast markets. Both markets are experiencing strong demand, driven by limited inventory and quality of life. Huntsville is especially thriving due to significant employment growth fueled by an influx of many diverse industries attracted by a world-class airport, a supply of educated workers, and a relatively affordable home price. The state's pro business, employer-friendly economy is driving corporate relocations and exceptional job growth, especially in the technology sector. The Colorado market continues to gain momentum, benefiting from strong in-migration and solid job growth. The Pacific Northwest continues to be a strong market, as significant land use and development restrictions limit production to meet growing demand. Portland and Seattle are experiencing outstanding job growth, with both markets ranking in the top 10 in the country. With strong demand and limited supply, we continue to see strong price increases. The California markets remains very strong, driven by the state's severe housing shortage, there was more demand than supply even with much of the out migration from the state. The Inland Empire, Sacramento and East Bay Area have remained some of the strongest markets, with homebuyers looking for affordability. During the quarter, we also saw a resurgence in the core markets of the Bay Area, as employees are returning to work. As I said, as Stuart said, these are some of the strongest markets, but there is broad strength across the country. During the first quarter, our community count increased 4% year-over-year as we focused on growth in our existing and new markets. We expect our community count to build throughout the year, and are still projecting to end 2022 with a low double-digit increase in community count year-over-year. While supply chain issues and inspection delays are impacting the timing of some of our community openings, we are in an excellent position for strong growth in 2022 and 2023. Our land pipeline remains robust, with plenty of land in the queue to meet our growth goals over the next several years. We continue to see great buying opportunities in all of our markets and are confident this pipeline will produce strong community count growth for the next several years, as we pursue deals to backfill beyond the near-term deals that are already owned or controlled. We are also pleased with the excellent progress we are making on our land-light strategy, as evidenced by our controlled home site percentage increasing to 58% at the end of the first quarter from 45% last year. We ended the quarter with $1.4 billion in cash, no borrowings on our $2.5 billion revolver and a homebuilding debt to capital of 18.3%. As Stuart said, we repurchased 5.3 million shares of our common stock for $526 million. These repurchases, combined with our significant earnings contributed to a return on equity of 19.5%, which was a 180 basis point improvement from the first quarter of last year. This morning, I'll discuss how our first quarter was impacted due to supply chain disruptions, inflationary impacts on construction costs and on cycle time increases, as well as our team's ability to manage through these challenges. Some of the supply chain disruptions were like the ones, we faced in our fourth quarter, where we experienced intermittent disruptions affecting different trades, at different times and in different geographies. In response to the ongoing disruptions and future unknown risk of new disruptions, our divisions are more closely managing the inventory of local trades and adding additional labor by onboarding new trade partners, while our regional and national teams stay in constant communication with manufacturers and suppliers in support of our divisions. Their extraordinary efforts enable Lennar to deliver over 12,500 homes to eagerly awaiting homeowners in our first quarter. As we look at the balance of the year and our guidance to deliver 68,000 homes, we are strategically focused on accelerating starts to give us more inventory under construction. This will provide a cushion against expanding cycle times, allowing our management teams more opportunities to complete homes in line with our plans. As you are aware, lumber dramatically increased again, up almost 100% since December 1 to $1,400 per thousand board feet. Despite operating in this cost inflationary environment, our first quarter direct construction costs as a percent of revenue were stable at 43%, which is basically flat compared to 42% both sequentially and year-over-year. Our execution is an ongoing refinement and improvement of our dynamic pricing and FIFO sales approach, allowing effective control of which homes are released for sale and at what price. In conclusion, it bears repeating that we remain disciplined and focused about our everything's included strategy and on being the builder of choice for our trade partners, a program, which is now entering its seventh year. Additionally, as Stuart aptly noted, Kemp Gillis, Rick and I are currently traveling the country, meeting with senior management of key supply chain relationships to explore how to solve issues that need immediate attention and how to think differently about the supply chain going forward. We also expect to achieve meaningfully improved efficiencies throughout the supply chain, providing for better control of both costs and cycle times. So, therefore, I'm going to spend a few minutes on the results of our other business segments and our balance sheet and then provide detailed guidance for Q2 2022 and updated high-level guidance for fiscal year 2022. For the first quarter, our Financial Services team produced $91 million of operating earnings, slightly above the high end of our guidance. And then, when you look at the details between mortgage and title, our mortgage operating earnings were $67 million compared to $100 million in the prior year. As we've indicated for several quarters, the mortgage market has become increasingly competitive for purchase business, as refinance volumes and resale inventory has declined. This was the primary driver of our first quarter, lower secondary margins as compared to the prior year. Excluding this gain, earnings increased this year, primarily as a result of higher premiums driven by an increase in average sales price per transaction. And then looking at our Lennar Other segment, as Stuart indicated, for the first quarter, our Lennar Other segment had an operating loss of $403 million. This loss was primarily the result of our non-cash mark-to-market losses in our strategic technology investments which, as we indicated, totaled $395 million. As we've mentioned before, we are required to mark-to-market many of our technology investments that are publicly traded, and that valuation will fluctuate from quarter-to-quarter. We ended the quarter with $1.4 billion of cash and no borrowings on our $2.5 billion revolving credit facility, for a total of $3.9 billion of homebuilding liquidity. During the quarter, we continued to focus on becoming land lighter. As a result, at quarter end, we owned 202,000 homesites and controlled 279,000 homesites for a total of 481,000 homesites. As Rick mentioned, our homesites controlled increased to 58% from 45% in the prior year, while our years owned stayed flat from the prior year at 3.4 years. Land transactions may fluctuate quarter-to-quarter, but progress is made year-over-year. And so, we are still on track to reach our goal of 2.75 years owned and 65% homesites controlled by year-end. During the quarter, we repurchased 5.3 million shares, totaling $526 million. Additionally, we paid dividends totaling $110 million during the quarter, which was the result of a 50% increase of our annual dividend to $1.50 per share that took place in January of this year. Our next senior note maturity is $575 million, which we will pay in August of this year, and we have no maturities due in fiscal 2023. The result of all these transactions with homebuilding debt to total capital of 8.3%, which improved from 24% in the prior year. And then just a few final points on our balance sheet, our stockholders' equity increased to $21 billion. As we look forward to the second quarter, we're assuming that market conditions remain similar to what we see today, strong demand and limited inventory driven by continued supply chain challenges. So with that backdrop, we expect Q2 new orders to be in the range of 17,800 to 18,200 homes, as we continue to moderate sales pace to match production cycle changing. Taking into consideration the continued supply chain challenges, we anticipate our Q2 deliveries will be in the range of 16,000 to 16,300, and our Q2 average sales price should be about 470,000. We expect to continue to produce strong gross margins in the range of 28% to 28.25%, and we expect our SG&A to be between 6.8% and 7%, as we continue to focus on simplification, efficiencies and leveraging our overhead. And for the combined homebuilding joint venture, land sale and other categories, we expect a loss of about $10 million. And then looking at our other businesses, we anticipate that Financial Services earnings for Q2 will be in the range of $90 million to $100 million as market competition for purchased business continues to increase. And for the Lennar Other category, we expect a loss of about $10 million. We expect our Q2 corporate G&A to be about 1.5% of total revenue and our charitable foundation contribution will be based on $1,000 per home delivered. And so when you pull all this together, this guidance should produce an EPS range of $3.80 to $4 per share for the second quarter. And then turning to full year guidance, we are increasing as mentioned our guidance for the year, we now expect to deliver approximately 68,000 homes more or less, which is an increase from our previous guidance of 67,000 homes. We believe our average sales price for the year will be in the range of $470,000 to $475,000. This would result in about $32 billion of homebuilding revenue, which would be an increase of more than 25% from fiscal 2021. We now expect our margins to be in the range of 27.25% to 28%, which is an increase from our previous guidance of 27% to 27.5%. And with our continued focus on technology and efficiency and an increase in volume, we expect our full year SG&A to be in the range of 6.6% to 6.8%. And for Financial Services, we're affirming our annual guidance of $440 million to $450 million. And so as we continue to execute our core operating strategies, maintain a strong balance sheet, and remain focused on cash flow generation and returns, we are in an excellent position to have a strong fiscal year 2022. So, first you mentioned that cycle-time extended a couple of weeks, but you increased your closings guidance and starts to remain relatively healthy. So let me start, and I'll hand it over to Jon in a second and say that -- as I noted, Truman, we are not just picking up steam, but we're picking up confidence and a lot of that derives from the focus on starts. It's not that the supply chain is quickly getting resolved, it's that we are putting more homes in the ground. But Truman, as you can imagine, if you sit down with CEOs and key executives of manufacturers, distributors for 4 to 6 hours, really opening up the thought process, how do we have a different approach to the products we buy, to the way that they're distributed, to joining together manufacturers and distributors to think through from the origin of the supply chain, all the way to the installation of our home. And as I mentioned, it's going to give us better cost control for both us and for our trade partners and give us much more clarity as to the delivery process. And it begins a lot with our technology and our ability to give forecasting information with real clarity to our vendors, which is critically important for them as they plan how to strategically supply us. And Rick, why don't you weigh in on market share and where we think the current supply chain programming brings us on ability to capture even greater market share. So, there's no question we continue to gain market share on the private builders and many of the larger or mid-market public builders. Because when we have 20% to 40% market shares, the land market needs to work with us. And then just the efficiency of our product, our Everything's Included program allows us to work much more efficiently with the supply chain and as a result of that, we're capturing more product. I think, that we'll be able -- we are certainly migrating in that direction with a greater portion of our land asset option versus owned and I think it will continue in that direction. First, I just wanted to kind of go back to some of the comments you made on demand, and you very much appreciate the fact that you kind of stated in a couple of different instances in the prepared remarks about how demand remains so strong. The builder kind of pointed to maybe the first-time or entry-level buyer taking a little bit longer to make a decision, maybe, a very slight pickup in cancellations and even taking a slightly smaller home or a home further out to adjust to the new interest rate backdrop. So in that context, I was just curious again, on the margin, if you've seen anything across that entry-level, lower price point, if any markets stand out in that regard as well. Interest rates and the upward movement that is -- I can never predict interest rates, but it's seemingly all but certainly moving up, and we recognize that there are potential cross currency here. This is really important as we look at first-time buyers and people coming into our welcome home centers, they're seeing significant increases in their rental rates and looking for a defense mechanism as stability measure that they can inject in their finances to at least hold steady one component of their cost structure. They can't really do much for gas prices and food, but their housing cost, they can fix with a 30-year fixed-rate mortgage. There's clearly demand across all our markets, where if we released more homes that they would sell. And I’d also point out one data point, which I think just supports the current state of what we're seeing, is that our web sessions online are over 20% year-over-year and the conversion of those to leads is up almost 50%. I assume the $4 billion to $5 billion is a part of that, but perhaps, there's incremental parts as well. And secondly, in terms of the fees that are made because, obviously, there's going to be an asset management business effectively. In terms of the assets that are flowing from Lennar towards SpinCo, I think that it's still good math to think in terms of $5 billion to $6 billion. But order of magnitude, from the assets that will actually be spun on the day of the spin to the assets that are being put into the SpinCo, it's in that order of magnitude. The multifamily component, year-over-year or from the end of the fourth quarter to the end of this quarter, we've gone from about $10 billion of assets under management to about $10.7 billion. I can't give you a percentage, but a sizable percentage of that increase in assets under management with actually, land and construction for multifamily that migrated into an asset -- an AUM asset management program. I still think that order of magnitude, we're looking in that $5 billion to $6 billion range of assets that will have migrated into that form of ownership, and you're seeing cash flow into Lennar reflective of some of that as we make the migration towards a spin-off day. And then secondly, we did an analysis where we looked at where -- how much land you either owned or controlled right before the pandemic hit, and we assume that you didn't walk away from many of your options. And if you do that and work that down from whatever closings you've done since then, I mean, you wind up with a very, very significant number of lots that I would think, are probably reflecting pre-pandemic pricing. I mean, our -- look, as I said in my comments, land purchases are -- they fluctuate quarter-to-quarter. It's just lumpy, and we're really focused on just making progress year-over-year. So you are right, a little heavier this quarter, but it's just lumpy and it fluctuates. And with regard to your question about pre-pandemic pricing and land opportunities, you're right, and I think that's why you're seeing our margins continue to improve. Yes, it would seem to suggest quite a bit of hang time here in terms of the margin opportunity, particularly with the fact that home prices are still going up. You -- we know that when you look at your average price and backlog, for instance, that that can be influenced by more shorter cycle-times for cheaper homes and longer cycle times for more expensive homes and that sort of thing. But if I look at your order price, the average price you took in orders this quarter, I would generally think that those mix shift effects should be very muted. And we noticed that your average order price was something on the order of $495,000 which was, I think it was up like 6% or something like that sequentially, which is a very, very strong number. And I was curious as to whether or not you believe that, that's a reasonable level that we could expect your closings in some quarter in the not-too-distant future could reach. It seems like it's baking in a fair amount of conservatism when you contrast it with the $495,000 you did this quarter. Well, so we're not guiding for a $495,000 ASP for the 2022. But given the overall mix of communities that we have for the balance of the year going in and the product that we've started, some of those are smaller homes that we just haven't released for sale yet, that are you going to blend that price. And maybe, that's why there's not that second half kind of move up in margins that some would have expected. Happy to have positioned ourselves into a new market, as Rick indicated, but it's very small. And then on the SpinCo, the land strategy, it seems like you guys are leaning towards spinning it and optioning back rather than, I think, at one time, there was some talk about possibly selling it and optioning the land back. I thought, and correct me if I'm wrong, that there was talk at some time of potentially not spinning the land, but actually selling it where there would be cash proceeds that would be received and they could be used for various things like funding working capital, buying back stock, things of that nature. As the assets started on our book, that is generating cash for Lennar and being redeployed into the business as stock buyback, debt retirement or whatever the strategy is. But the SpinCo process is already in progress right now and the migration of assets to the asset management verticals is happening both for Lennar multifamily, for SFR and for land strategies. And as we pull that together, I think it will be clearer that some of the assets are coming from our book and generating cash to the core and some of them are just avoiding cash that would otherwise be spent. I think -- remember, you're absolutely right, there was going to be a contribution of land. But as Stuart mentioned, as we refined the thinking and thought that having a land lighter balance sheet, a land-light balance sheet or asset-light balance sheet for SpinCo is the better way to go. That was the migration into assets under management for all of the components, not just the multifamily and the single-family rental, which were always going to be assets under management. And not only in the best interest of amount of time that has been taking to get SpinCo stood up, not to simply wait and then contribute and then reconfigure, we've just been doing it as we're going. Matt Zames as we've noted, has been working with us on this and has been an advocate for, let's not waste time. And so we have energized the program of converting assets into cash, turning cash into stock, buyback into debt retirement into increased inventory and increased certainty in deliveries and that's exactly what's been happening as we prepare to spend. So there's been some data points that suggest maybe, more in a global kind of a housing market scale that recently, the strength in sales, at least on a year-over-year basis, has been driven primarily by non-primary buyers. And the actual primary buyer activity has kind of stalled a little bit, and there's probably a lot of reasons for that, and maybe, that's not representative of the new home market, specifically. It's all basically primary, but done in a format that might be primary buyer owning their home or institutional buyer enabling someone to access a single-family lifestyle or just multifamily tenants. And across the board, you're seeing pretty aggressive escalation in prices because demand is strong and supply is constrained. Yes, I would say that probably, less than 5% of the homes in the last quarter were sold to folks that either are institutional renters of product. But it's a very small percentage, and most of what we're seeing out there are primary buyers. So the acquisition you made at Breland, I know you kind of talked about it being fairly small in terms of contribution for the overall business. But just curious, at this stage, you talked a lot about your views on likely continuing to take share from smaller private builders, and it's clear that you guys definitely have a real operating advantage in today's difficult kind of environment. So, let me just say that, I wouldn't -- Rick, you'll jump in, in a second, I know. But let me just add, I wouldn't say that we're seeing capitulation out there. The bigger issue or question for us is, we've identified markets where organically, we would like to step in and participate in those markets, and where we can find a first-class established management team and basically, make an organic step into a market, but with a management team. Those will be few and far between, because we're so focused on the quality, not just of the assets, but the people, as we step into new and unique markets. We're laser-focused on quality and professionalism, and that's exactly what the Breland opportunity brought to us. And one of the better parts of that opportunity was having the opportunity to create a land relationship on a go-forward basis with Louis Breland, who is an expert in finding land, entitling land, and it's just a continuation of our land strategies, business where we have that done, not on our balance sheet, but off balance sheet and controlling that pipeline. I don't think we've seen that yet, but earlier, the question was asked about picking up market share. We're not going to be engaging a lot of M&A as we grow our business at the large-scale side, but as we enter new markets, certainly on the table."
}