{
    "symbol": "BLCO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-06-08 13:41:06",
    "content": " Specifically, Bausch + Lomb is the most integrated eye care company operating today, the fastest-growing global contact suppliers in 2021, the company with the highest brand awareness in eye care and a global leader in consumer health outpacing U.S. market growth by approximately 1.7x since 2018. We have outlined 3 key areas of strategic focus for this important point in Bausch + Lomb development: One, accelerate growth in large addressable markets; two, invest in categories that are growing faster than the overall high health market; and three, expand into new product categories. We believe the company is well positioned for growth in large, durable markets driven by new products and favorable megatrends or tailwinds, such as the increasing prevalence of myopia and diabetes, an aging population and a growing middle class that are expected to continue driving demand for eye health products. Our focus on commercial execution and investment continues to lead to strong demand across our key franchises, which is reflected in the total company revenue of $889 million for the first quarter, up 1% on a reported basis and up 5% organically. Revenue for Division Care segment, which includes contact lenses and consumer products, grew -- by 4% in the first quarter, driven by 7% reported and 8% organic growth in eye vitamines and 35% reported an organic growth in LUMIFY. Bausch + Lomb has long-standing relationship with eye-health professionals as well as key retailers and e-commerce channels that reach a broad consumer B&L is a fully integrated eye health company that offers a comprehensive portfolio of more than 400 products to meet significant patient and consumer needs spanning everything from contact lenses, lens and eye care products, Ophthalmic Pharmaceuticals over-the-counter product and ophthalmic surgical devices and instruments. And Larry, if I can just add a few things to what Joe said and -- again, the launches is a very critical part in terms of how we think about where we are today and where we're heading into the future because I think there's a number of critical launches across all 3 segments that are going to be -- very important for us as we move forward from growth on the top line as well as from a margin contribution. So that's probably the -- I think, the first thing I talk about in terms of the overall growth is our performance, especially in the U.S. where we've seen some very significant growth in our contact lens business. All those reasons we think are suggesting it's a good time to invest in a business in eye health, whether it's the organic side that we've referenced in the prior part of the conversation or to the inorganic side, we think the markets are going to grow 4% to 5%."
}