{
    "symbol": "BLCO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 11:45:05",
    "content": " First, we believe the company is well positioned for growth in large durable markets driven by new products and favorable mega trends are tailwinds that are expected to continue driving demand for our eye health products. First, our continued momentum in key portfolios, reported revenue of Ocuvite and PreserVision grew by 14%, and we're pleased to report that PreserVision currently has an approximately 95% market share in the U.S. and the 14% organic growth in Surgical implantable was driven by the premium and standard IOLs. We're also well positioned to take advantage of the U.S. prescription dry eye market, which grew at a 24% CAGR from 2016 to 2021 and is expected to see double-digit growth from 2021 to 2027. Overall, we're very pleased with our 5% organic revenue growth in the third quarter and believe that the long-term fundamentals of our business and the eye care market remain highly attractive. As we previously disclosed, full year 2021 results did not reflect estimated stand-up costs of approximately $70 million, with total revenues of $942 million in the third quarter, we remain committed to our strategy to be fully invested in new product launches and in R&D while managing the impact of macro headwinds. Our investment in R&D continues to trend at roughly 8% of revenue, which is approximately $14 million or 160 basis points higher compared to prior year. Finally, on the right, Artelac, a $100 million growing dry eye global franchise grew organically by 11% compared to the third quarter of last year. In the U.S., LUMIFY is the number one redness reliever in the category with approximately a 49% market share, building on the phenomenal success of this product and using the power of our fully integrated eye care platform we are planning to expand the brand geographically and through line extensions. First, the continuing momentum of our portfolio; second, investing in categories that are growing faster than the market; and third, expanding into new product categories, to highlight a few, we are on track to deliver 4% to 5% organic revenue growth in 2022 due to, in part, the strong performance of our key franchises, including market share gains. To wrap up on Slide 24, as a fully integrated eye health company with the highest brand awareness of any eye care company, a global footprint in approximately 100 countries, a comprehensive portfolio of more than 400 products across all price points, Bausch + Lomb is uniquely positioned to meet the eye needs of patients and customers even in challenging economic environment. Everything for what's happening with the products like LUMIFY, which we see continued strong growth, as I mentioned, I've got a 4% to 9% share. I think all the fundamentals that we have seen in 2022 as being a base year for us coming out of an IPO and all the product launches and the growth on the top line and the commercial infrastructure that we built in 2022, we believe that all is going to give us the opportunity to be able to continue to grow margins as we go forward into 2020 and beyond."
}