{
    "symbol": "LL",
    "quarter": 4,
    "year": 2021,
    "date": "2022-02-23 10:56:07",
    "content": " We delivered an adjusted operating income of $53.7 million or 4.7% of net revenue, delivering on our commitment to significantly improved profitability over the past two years, with our 2021 adjusted operating income up $29 million and adjusted operating margin up 240 basis points compared to 2019. During the fourth quarter of 2021, we were very pleased to post double-digit growth in sales to Pro customers and a 6.4% increase in net service sales, reflecting continued momentum with pro and installation customers as we increasingly benefited from our strategic initiatives. We saw an 18.5% increase in our average ticket, reflecting a greater mix of installation sales, which grew to 13% of net sales from 11% in the fourth quarter of 2020 as well as a higher merchandise average ticket, driven by pricing and promotion strategies as well as favorable product mix as we sold more hardwoods and launched our new Duravana brand. Fourth quarter 2021 comparable store sales decreased 6.7% versus the fourth quarter of 2020, but increased 3.8% on a two-year stack basis. The 70 basis point decrease in fourth quarter 2021 adjusted gross margin versus 2020 primarily reflects significantly higher material and transportation costs, which were collectively up more than 800 basis points that we were able to partially mitigate through pricing, promotion and alternative country and vendor sourcing strategies. As a percent of net sales, adjusted SG&A for the fourth quarter of 2021 was 33.7%, an increase of 180 basis points from the fourth quarter of 2020 due to increased investment in customer facing and distribution center personnel that was largely offset by lower bonuses and commissions, as well as deleveraging on lower net sales. Adjusted operating income in the fourth quarter of 2021 was $10.8 million compared to $18.8 million for the prior-year period, due primarily to tough comparisons to the nesting phenomenon in 2020 and gross margin headwinds in 2021. Excluding the approximately $11 million one-time benefit for the retroactive exclusion of Section 301 tariffs in the fourth quarter of 2019, adjusted operating margin increased approximately 100 basis points compared to 2019. Excluding the impact of recognizing a $2.4 million benefit for state net operating loss adjustments, income tax expense for the fourth quarter of 2021 would have been $2.9 million, which represented an effective tax rate of 26.8%. This compared to an income tax benefit of $12.6 million or an effective tax rate of negative 68.5% for the fourth quarter of 2020, driven by the partial release of the valuation allowance in year-end deferred tax true-up, including the impact of the CARES Act. Adjusted earnings for the fourth quarter of 2021 of $10.2 million decreased by $20.2 million compared to the fourth quarter of 2020, due primarily to last year's partial release of valuation allowance on deferred tax assets of $20 million as well as tough comparisons to the nesting phenomenon in 2020 and gross margin headwinds in 2021. Net sales of $1.15 billion increased 5% compared to last year and 5.5% compared to 2019, with both increases driven by double-digit growth in sales to pro customers and net services sales that more than offset a decrease in DIY sales. Excluding the impact of a $2.4 million benefit for state net operating loss adjustments recognized in the fourth quarter of 2021, income tax expense for 2021 would have been $13.5 million, which represented an effective tax rate of 25.6%."
}