{
    "symbol": "LL",
    "quarter": 3,
    "year": 2021,
    "date": "2021-11-03 11:36:05",
    "content": " Last quarter we provided our outlook for slowing comparable store sales on a two-year stack basis for the second half of 2021 compared to Q2 given the combination of increasingly challenging supply chain constraints on inventory replenishment, potential consumer demand shifts, and the potential impact of the COVID-19 Delta variant. Both the third and fourth quarters of 2021% represent tough comparisons versus the strong DIY nesting phenomenon in the second half of last year, which helped drive comparable store sales growth of 10.9% in Q3 and 10.5% in Q4 of 2020. In closing, during the third quarter, we demonstrated strong Pro and installation sales growth versus the third quarter of last year, as well as significant sales and profitability improvements on a two-year basis. In the third quarter, net sales of $282.2 million decreased $13.6 million, or 4.6% versus the third quarter of 2020. As Charles noted, third quarter 2021 comparable store sales decreased 4.5% versus the third quarter of 2020, but increased 6.4% on a two-year stack basis. The 240 basis point decrease in third quarter 2021 adjusted gross margin versus 2020, primarily reflects significantly higher transportation and material costs, and higher tariffs, which were collectively up more than 700 basis points, that we were able to partially mitigate by pricing, promotion and alternative country and vendor sourcing strategies. Adjusted SG&A expense for the third quarter of 2021 was $93.5 million, compared to $88.6 million in 2020 and $93.1 million in 2019. The higher adjusted SG&A expense in 2021 compared to 2020 reflects increased investment in the field and our growth initiatives this year, as well as last year's one-time $2.5 million favorable final settlement of the business interruption insurance claims related to the August 2019 network security incident which was not repeated in 2021. As a percent of net sales, adjusted SG&A for the third quarter of 2021 was 33.1%, an increase of 320 basis points from the third quarter of 2020 due to the factors I just mentioned, as well as deleveraging on lower net sales. In the third quarter of 2021 we recognized income tax expense of $3.2 million, or an effective tax rate of 27% compared to income tax expense of $7 million or an effective tax rate of 31% for the third quarter of 2020. Adjusted earnings for the third quarter of 2021 of $8.5 million decreased by $11.1 million, compared to adjusted earnings of $19.6 million for the third quarter of 2020 and increased $6.6 million dollars compared to adjusted earnings of $1.9 million in 2019."
}