{
    "symbol": "LL",
    "quarter": 1,
    "year": 2021,
    "date": "2021-05-05 12:50:11",
    "content": " Turning to our positive results in the quarter, we delivered a 6.9% increase in comp sales, which was driven by continued execution on our transformation initiatives, strong demand from home improvement projects, and accelerating year-over-year growth in our installation business as well as the impact from the onset of COVID-19 shutdowns in March of 2020. On an adjusted basis, operating income increased $5 million to $14.4 million in the first quarter of 2021 or 5.1% of net sales versus 3.6% of net sales in the first quarter of 2020. In the first quarter, net sales of $283.5 million increased $16.1 million or 6% versus the first quarter of 2020 due to a 4.7% increase in net merchandise sales and a 16.8% increase in net service sales, which reflected accelerating year-over-year installation sales growth. In addition to what Charles shared about the impact of COVID-19 in our 2021 winter sales event compared to the sales events during the first quarter of 2020, we also estimate that inventory constraints from supply chain disruptions represented a potential $8 million to $9 million in lost sales during the first quarter of 2021. Turning now to gross profit, gross profit increased 10.1% in the first quarter of 2021 to $116 million from $105 million in the comparable period of 2020. During the first quarter of 2021, gross margin included a $6.6 million benefit from antidumping duty rate changes associated with applicable prior year shipments of engineered hardwood from China. When excluding this item from 2021, adjusted gross profit for the quarter was $109 million compared to $105 million in the prior year, and adjusted gross margin was 38.5% compared to 39.3% in the prior year. SG&A expense for the first quarter was $102.5 million or 36.2% of sales, up 20 basis points compared to $96.2 million or 36% of sales in the first quarter of 2020. When excluding these items from both periods, adjusted SG&A expense for the quarter was $94.7 million, $700,000 lower than the $95.4 million in the first quarter of 2020. For the quarter, we delivered operating income of $13.1 million compared to $8.8 million in the first quarter of 2020. Adjusted operating income in the first quarter of 2021 was $14.4 million, up $4.8 million from $9.6 million for the prior year period. In the first quarter of 2021, we recognized income tax expense of $3.3 million or an effective tax rate of 23.4% compared to an income tax benefit of $4.4 million or an effective tax rate of negative 55.2% for the first quarter of 2020. For the first quarter of 2021, net income decreased by $1.6 million to $10.6 million compared to net income of $12.2 million for the first quarter of 2020. Adjusted earnings for the first quarter of 2021 were $10.2 million compared to adjusted earnings of $12.8 million for the first quarter of 2020, reflecting the income tax benefit in 2020. On an adjusted basis, first quarter earnings per diluted share of $0.34 compared to adjusted earnings of $0.44 for the first quarter of 2020, reflecting the income tax benefit in 2020. So I think as we -- the lost sales that we think in first quarter was in the range of $8 million to $9 million, we continue to see constraints in the second quarter, and our current view is improving through the back half of the year."
}