{
    "symbol": "CRDO",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-01 22:05:01",
    "content": " Good afternoon, and thank you all for joining us today on our Fiscal 2023 Third Quarter Earnings Call. I'd like to remind everyone that certain comments made in this call today may include forward-looking statements, regarding expected future results, strategies, and plans, future operations, and markets in which we operate, and other areas of discussion. It's not possible for the company's management to predict all risks, nor can the company assess the impact of all factors on its business, or the extent to which any factor or combination of factors may cause actual results to differ materially from those contained in any forward-looking statement. Given these risks, uncertainties, and assumptions, the forward-looking events discussed during this call may not occur, and actual results could differ materially and adversely from those anticipated or implied. The company undertakes no obligation to publicly update forward-looking statements for any reason after the date of this call to conform these statements to actual results, or to changes in the company's expectations except as required by law. Also, during this call, we will refer to certain non-GAAP financial measures, which we consider to be an important measure of the company's performance. A discussion of why we use non-GAAP financial measures and reconciliations between our GAAP and non-GAAP financial measures is available in the earnings release we issued today, which can all be accessed using the Investor Relations portion of our website. During this call, I'll discuss Credo's FY '23 third quarter results and our updated outlook, along with the industry trends and customer engagements that have us optimistic about our future growth. Our current portfolio of high-performance and low-power connectivity solutions include, active electrical cables or AEC, integrated circuits, or ICs, SerDes Chiplets and intellectual property or IP. All of our product and IP solutions leverage our unique application-specific SerDes portfolio, enabling us to deliver optimized secure, high-speed solutions with better power efficiency and cost. Our customers include hyperscale data center operators, networking equipment OEMs and ODMs, optical module manufacturers, and others in the Ethernet ecosystem. While we primarily serve the Ethernet market today, we continue to expand into other standards-based markets as the need for higher speed and more power-efficient connectivity increases exponentially. For Q3, Credo reported revenue of $54.3 million, representing a 6% sequential growth and year-over-year growth of more than 71%. Prior to giving an update on our progress with our business, I would like to briefly discuss the 8-K we filed two weeks ago. This reduction in forecast, along with the overall macroeconomic headwinds in the market will impact our revenue in Q4 and fiscal 2024. Our long-term financial model remains unchanged, and we remain optimistic about our growth opportunities, given our ongoing engagements in several advanced programs with our largest customer and other hyperscalers, as well as 5G carriers. During Q3, our growth was driven by our AEC solutions, a product category we pioneered and which continues to gain broad industry acceptance. Our growing list of AEC customers are migrating to AECs for short in-rack cable solutions for various reasons, including the limitation of alternative solutions and a unique tailored feature set of our products. As data center and other network operators migrate to higher speed lane rates of 50-gig or greater, AECs offer better signal integrity and physical attributes compared to DACs and our AECs offer compelling benefits over AOCs across power, cost and reliability. Additionally, our AECs offer functionality our customers can use to innovate on rack architectures for servers in both compute and AI/ML applications, as well as for disaggregated switch racks. Industry analysts expect AECs to become a multibillion-dollar market within four or five years, as AECs become the most prevalent solution for in-rack connectivity. While we'll be shipping reduced volumes to our largest AEC customer in the near term, we continue to engage with them on future programs on the roadmap for both compute and AI server racks and we remain confident in the strength of this relationship. And although the detailed time line of their volume ramp is still developing, we expect meaningful contribution in fiscal 2024. We're also deeply engaged in developing advanced AEC solutions with this customer for their next-generation server rack and switch rack applications, as they move to 100-gig single lane speeds. Additionally, we continue to make progress with other customers as well. We're in flight with two additional hyperscalers for switch rack and AI server rack applications, using both 400-gig and 800-gig AECs. While hyperscalers remain our primary focus, we're engaged in meaningful opportunities with other data center operators and 5G carriers. Regarding our progress on optical solutions, Credo also leverages our differentiated SerDes technology to deliver disruptive solutions to the optical market. We've seen success thus far, securing wins with both optical module manufacturers, as well as with hyperscalers directly through joint development models. While the time to achieve our volume production revenue ramp has shifted in the current environment, we continue to play the role of disruptor in the optical market. Enabled by our superior SerDes technology, we remain confident we will gain share over time due to our compelling combination of performance, power and cost. Moving to our Line Card PHY solutions, Credo continues to extend our leadership in the Ethernet Line Card PHY market across hyperscalers and networking OEMs and ODMs. As we move to 5-nanometer, we expect to achieve a 40% decrease in power forcing our competition to move to 3-nanometer to compete and as a result creating significant time to market and cost advantages for Credo. While our IP business is variable due to recognition rules and the IP sales cycle, our customer funnel is robust. This again highlights our N minus one process advantage, which means to achieve the power efficiency of Credo's 5- and 4-nanometer IP solutions customers would need to move to 3-nanometer if considering our competition. Finally, regarding the SerDes chiplet opportunity, market trends including the advancement of the UCIE consortium suggests that SerDes chiplet market will become a meaningful long-term opportunity for us. In summary, Credo remains laser focused on the large opportunity afforded us by our differentiated solutions in a market that's demanding higher speeds and better power efficiency. Our N minus one process advantage gives us a distinct advantage across multiple competitive axes, but maybe most importantly in power. Clearly, we're disappointed about the adjustment in the near-term outlook given the disruption with our largest customer. However, the feedback from that customer as well as from other customers and the additional developments I just discussed, fuel our optimism about our growth prospects in the future. We remain committed to close customer collaboration, continued innovation and the expansion of our solution portfolio to address the ever-increasing needs for higher bandwidth and more power-efficient connectivity solutions. In Q3, we reported revenue of $54.3 million within our guidance range, up 6% sequentially and up 71% year-over-year. Sequential growth was driven by continued traction in our IP business, which reached $12.6 million in Q3, up 285% sequentially and up 145% year-over-year. IP remains a strategic part of our business, but as a reminder our IP results may vary from quarter-to-quarter driven largely by specific deliverables to pre-existing contracts. While the mix of IP and product revenue will vary in any given quarter over time, our revenue mix in Q3 was 23% IP above our long-term expectation for IP, which is 10% to 15% of revenue. Our product business generated $41.7 million of revenue in Q3, down 13% sequentially and up 56% year-over-year. With a strong IP result this quarter, our team delivered gross margin of 59.3% within our guidance range and up 438 basis points sequentially. Our product gross margin was 47.6% in the quarter, down 496 basis points sequentially and down 585 basis points year-over-year due principally to revenue mix. Our OpEx increase was driven by a 53% year-over-year increase in R&D, as we continue to invest in the resources needed to deliver innovative solutions. Our SG&A was up 26% year-over-year, as we built out public company infrastructure. We delivered non-GAAP operating income of $6.7 million in Q3, an improvement of $5.3 million year-over-year and up 97% sequentially. We delivered net income of $7.5 million in Q3, an increase of $5.1 million year-over-year and up 208% sequentially. Cash flow used by operations in the third quarter was $2.3 million, a decrease of $4 million year-over-year and a decrease of $4.1 million sequentially due largely to an increase in inventory. CapEx was $6.9 million in the quarter, driven by production mask spending. And free cash flow was negative $9.2 million, a decrease of $8 million year-over-year and a decrease of $5.3 million sequentially. We ended the quarter with cash and equivalents of $233 million, a decrease of $7.5 million from the second quarter. Our accounts receivable balance decreased 16.6% sequentially to $43.2 million, while day sales outstanding decreased to 72 days, down from 92 days in Q2. Our Q3 ending inventory was $50.3 million, up $2.5 million sequentially. We currently expect revenue in Q4 of fiscal 2023 to be between $30 million and $32 million, down 43% sequentially at the midpoint. And finally, we expect fiscal year 2024 revenue to be flat compared to fiscal year 2023. Your line is open. The second factor is really that they've seen pushouts in key programs, additional programs that use our AECs there's been delays of qualification and pushouts due to various factors. And then as my second question on the fiscal 2024 outlook, maybe for Dan or Bill for that matter. Prior to the 8-K, I think the Street was modeling somewhere in the low $300 million range for revenue. Can you sort of break out the individual sub-components, if you will, the drivers of that change the largest customer the dynamics that you just talked about if it's a push, I guess I would think and I would hope some of that revenue materializes in the second half of fiscal 2024, but how are you thinking about that? And then obviously you have a robust Line Card business, IP business as well. So starting with our largest customer, what you'll see in our Q as we file it in a day or so, our largest customer was 52% of our revenue in Q3, which was up from 44% in the prior quarter. We previously -- two weeks ago, we had described this FY 2024 reduction is about two-thirds related to this largest customer and then about a third of it due to just increased conservatism that we're applying across the board, based on just macroeconomic factors that we see. So if you do the math, our largest customer remains still a very large customer in FY 2024. But we're quite comfortable right now where -- with analyst estimates for the full fiscal year 2024, if that's helpful. One moment for our next question. And I guess a related question, it seems like there may be some confusion in the application of your cables. The â\u0080\u0093 so the applications as we understand it, where our AECs are being used is in the compute portion of their server deployments. We're â\u0080\u0093 from the standpoint of InfiniBand, there's not really an opportunity for us there. From a pure speed standpoint of course the speeds are something we would be able to negotiate, but there are specifics related to the protocol that are just not something that we've qualified. Just â\u0080\u0093 I've got a follow-up on InfiniBand but let me come back to the first part of the question which just six months ago, if you had an internal estimate of what you think AECs could reach at a steady state an annualized revenue opportunity at that customer has that changed given the customer forecast or the push-out and SKUs that you mentioned? And I would say, short-term look, I mean, we were â\u0080\u0093 our confidence was bolstered by the backlog I had at hand the forecast that I had at hand. And I don't think, this is something fundamental with the change in strategy on deployments. And so the way that, I felt about it maybe three to six months ago, was that our opportunity would be pretty aligned with the server deployments for the near-term compute portion of their spend. And so from the standpoint of how that will change over the kind of the short to mid-term, look that's really something that they're planning right now, but I don't think there's a fundamental shift in strategy. And I would say that, I'll go back to the fundamentals and say that, there's two main reasons why our AECs are being adopted at any given customer. And that's first of all functionality we're able to build innovative functionality into our solutions, which is why our first customer ramped, quite frankly, the white cable the switch cable that we're selling plays a role that no other cable solution in the market could accomplish. And there's a fundamental advantage with AECs, when we're talking about just a pure head-to-head competitive situation with AOCs, we're at a much lower cost, much lower power solution. And so the way, I see it playing out at our largest customer is that over time, our opportunity will really expand as they move from just compute to factoring in more of an AI spend. I see all of the server racks, whether they'd be compute or AI long term will be a really robust opportunity for us as speeds move from 25-gig to 50-gig and then ultimately 100-gig per lane where I think we'll see a very strong correlation between deployments and the AEC TAM. Maybe my numbers are up but Dan it looks to me that despite -- I know you're mix shifting to AECs, but the product gross margins look like even on the AEC they've probably come down over the past couple of quarters even though AECs have ramped pretty nicely and I would have thought there would have been some volume benefits to that AEC ramp. But the second item over the prior six quarters like you alluded to product margin has expanded quite nicely due to that increasing scale, but our overall product revenue was actually slightly down sequentially in Q3. And then finally, the last thing just to mention with product margin in general for Q3 is that our forecast recently declined for fiscal year 2024. So when you calculate things such as inventory reserves, the math changes because you're comparing against your forecast. I can't be specific about that, but I can tell you my thoughts are that I think first mover has been InfiniBand from a protocol perspective. One moment for our next question. Your line is open. Bill this is a bit of a longer-term question, but it's kind of like due to recent events. So, I think that -- I think our model -- I guess I would say that it really wouldn't impact the amount of inventory somebody would hold I would say. The second part of your question, I think we've talked about before it was a necessity for us to take ownership of the complete system. And we go back four or five years ago and it was really necessary for us to build a vertical organization, a group that was fully responsible for the AEC definition development, engineering, qualification, and ultimately, fulfillment, and support following production. And the scenario of us selling a chip to a copper cable company is not a scenario that exists, but we will be able to achieve a shift in business model that eliminates full margin stacking and that will play itself out in the future. I think there's a lot of focus on ASC, but you did highlight the chiplets IP, especially with some non-communications customers. Well, I would say that, our IP business remains something that's strategic to us. I think we will have success with other protocols as well, because we offer really unique solutions for those markets. And so the original -- I guess, the idea is that as PCIe lane rates move from 32 to 64 that's where we're going to enter the market. Thank you very much. One moment for our next question. Your line is open. And the different SKUs there's different components that change within the SKUs from the servers and mix that they're using to the Nick-to-ToR that they're using, but our AECs are consistent. So from a revenue perspective, it should be relatively linear throughout the year in terms of a steady progression. So if you kind of view something similar to that in Q1, to get to flat year-over-year, it shows pretty strong sequential growth throughout the year. One moment for our next question. Your line is open. So I think in fiscal 2023, AECs are roughly, I imagine about 40%, 45% of the sales mix. I don't know if I'm perfectly right, but it's probably in that ballpark. But â\u0080\u0093 and a lot of that really depends on the shape of the curve from the second hyperscaler, but right now, to get to flat year-over-year, I would expect it to be down a little bit, but that could change as we kind of get closer to entering FY 2024 and give more specific guidance. So the way we've looked at gross margin, we expect it to relatively be flat year-over-year. And the reason we say that or how we get there is we â\u0080\u0093 if you look at all the different things that are changing, we lose scale versus our prior expectations right for FY 2024, which obviously is negative to margin in terms of expansion by scale. Again, that's favorable to overall margin. So OpEx, we guided, the midpoint of our guidance for Q4 was $27 million. Your line is open. I think they're largely, unrelated. What's happening in our largest customer, is a function of their own planning. The second customer that we're in the early stages of ramping, the situation there is that I think the overall plan is coming together. The sequence that they go through, it seems similar with these large hyperscalers is there's a group of engineers, that are responsible for developing and qualifying it given the SKU and that -- when that qualification is complete, that SKU becomes available for different businesses to pick up and deploy. We've made it through the qualification portion, with our second customer. And now, I think the detailed forecast is going to be coming together, over the next several months. And so as we look at that program generally, we think that it can drive volume, but we don't want to be overly aggressive in how we're planning. And that's, why we've kind of stepped back a bit and put a more conservative look on it, until we've got really good visibility. Thank you very much. That's kind of a -- just a mathematical equation and how we -- based on our internal procedures, and how we reserve inventory. Speaking of the impairment though, you saw a $2.4 million impairment, and that was associated with the program that we terminated during the quarter. We've been -- if we look back in time, we've been very extremely fortunate, with our success across a lot of different investments that we've made over the years. So you can expect us to continue following just a very strict fiscal discipline, as we look at our various ROIs on products that we tape out. Thank you very much."
}