{
    "symbol": "EYE",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 14:07:12",
    "content": " For the second quarter, net revenue decreased 7.3% versus our record Q2 sales last year, and adjusted comparable store sales declined 12.4% compared to the record 76.7% increase in the second quarter of 2021. While exam capacity remains out of sync with our needs in many of our stores in certain markets, thereby affecting patient traffic, weâ\u0080\u0099re making sequential progress towards improved retention and strong hirings and continue to project exam capacity to gradually improve by year-end. In Q2 2022, net revenue decreased 7.3% compared to 2021 due to macroeconomic headwinds, constraints to exam capacity and exceptional growth last year. The updated fiscal 2022 outlook reflects the currently expected impacts related to macroeconomic factors, including inflation, geopolitical instability and risk of recession as well as the ongoing COVID-19 pandemic and constraints on exam capacity. Against the backdrop of what we know today, our updated 2022 outlook projects: net revenue between $1.99 billion to $2.02 billion; adjusted comparable store sales growth compared to last year in a range of negative 6.5% to negative 8%; adjusted operating income between $85 million to $100 million; and adjusted diluted EPS between $0.65 and $0.77, assuming 80.1 million weighted average diluted shares. At the high end of the ranges, weâ\u0080\u0099re assuming continued pressure on consumer demand over the remainder of the year, including a modest back-to-school season as well as gradual improvement in exam capacity. Compared to the previous fiscal 2022 outlook provided in May, our updated outlook includes lower projected ranges for comps and net revenue to reflect the deteriorating macro environment, exam capacity and current trends. For full year 2022, as a percentage of net revenue, we now expect costs applicable to revenue to increase 325 to 350 basis points versus last year, primarily due to the deleveraging of fixed costs as well as the lapping of last yearâ\u0080\u0099s record performance that benefited from product mix shift and an elevated ticket. Ladies and gentlemen, this does conclude todayâ\u0080\u0099s conference. Ladies and gentlemen, this does conclude todayâ\u0080\u0099s conference."
}