{
    "symbol": "NC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 14:05:24",
    "content": " I'm very pleased to report that our company once again delivered strong results, generating much higher operating profit, net income and adjusted EBITDA in the 2022 fourth quarter and full year than in the 2021 fourth quarter and full year. Our strong full year operating results were led by our Minerals Management segment, which more than doubled its operating profit and adjusted EBITDA from 2021. These improvements were driven by Minerals Management, which more than doubled its operating profit and adjusted EBITDA over the prior year quarter due to both increased production and substantially higher natural gas and oil prices. Conversely, operating profit and adjusted EBITDA in the Coal Mining segment decreased significantly. Looking forward, in 2023, the Coal Mining segment's operating profit and segment adjusted EBITDA are expected to decrease significantly year-over-year. In 2023, we expect North American Mining's full year operating profit to decrease significantly versus the prior year because final mine reclamation activities at Coteau Creek were substantially completed in 2022. Finally, at our Minerals Management segment, we expect '23 operating profit and segment adjusted EBITDA to decrease significantly from 2022. To summarize, on a consolidated basis, we expect full year '23 consolidated net income to increase significantly, largely due to the $30.9 million of pretax contract termination income recognized during '22. Excluding this settlement income, net income is expected to decrease substantially from significantly reduced royalty income in the Minerals Management segment and lower earnings in the Coal Mining segment. The Coal Mining segment expects increased profitability due in part to improvements at Falkirk and Mississippi Lignite Mining Company, and we continue to pursue activities which can strengthen the resiliency of our coal mining operations."
}