{
    "symbol": "NC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 14:33:15",
    "content": " Finally, Minerals Management segment second quarter 2022 operating profit and segment adjusted EBITDA more than doubled from the prior year results. As we expect -- we expect the Coal Mining segment's operating profit in both the second half and full year of 2022 to decrease significantly from 2021, both including and excluding the contract termination payments received from Bisti last year and GRE this year. We expect results at our consolidated mining operations to decrease significantly in the second half of this year from the prior year second half and the first half of 2022, primarily because of substantially lower earnings at Mississippi Lignite Mining Company driven by an anticipated reduction in customer demand from higher-than-average levels in the second half of 2021. Segment adjusted EBITDA, which excludes the contract termination settlement payments, is expected to decrease significantly in 2022 from last year, primarily as a result of the forecasted reduction in operating profit, partially offset by higher add-back of depreciation, depletion and amortization expense. The increase in the second half is primarily due to expected improved fourth quarter results, principally from a shift in mix of tons delivered to operations with higher margin contracts, partially offset by an anticipated increase in operating expenses. North American Mining segment adjusted EBITDA in 2022 is expected to increase significantly over the prior year because of the improved operating profit from higher reclamation income at Caddo Creek in the first half of this year and the add-back of higher depreciation expense. Excluding settlement income of $3.3 million recognized in last year's third quarter, we expect operating profit and segment adjusted EBITDA in the second half of this year to be comparable to the second half of last year but decreased significantly compared with the first half of 2022, primarily driven by current expectations for natural gas and oil prices and an anticipated reduction in production volumes. However, because of the substantial earnings in the first half of this year, we expect a significant increase in Minerals Management's full year 2022 operating profit over 2021."
}