{
    "symbol": "NRGV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 23:49:03",
    "content": " Just a few weeks ago, we finished our first year as a publicly-listed company, a year that saw us launch in February, while delivering our first $146 million in revenue throughout the year, $100 million of which was achieved in Q4 alone due to strong execution and customer focus by our people in our first start to deployments and project revenue. Starting the year having strategic investors like Korea Zinc and Atlas Renewable, step into the IPO with an additional $100 million of investment from the start, to then immediately breaking ground on our first EVx gravity system outside of Shanghai in March 2022 for the highlights of the first quarter. Turning to where there is much larger and immediate demand in the short duration energy storage market, our EVx team executed with velocity and quality and development of our energy management system, enabling the signing of about 1.6 gigawatt hours of battery, hybrid, and green hydrogen energy storage projects with multiple regulated utility companies and some of the largest leading independent power players in the world. And regarding Q4 we announced our 2022 revenue of approximately $146 million, which is within the midpoint of our pre-announced higher range of revenue with gross margins of approximately 16% reflecting a mix of gravity license revenue from regional expansions in Europe and the Middle East and execution on battery-related projects in the United States. And as evidenced in our 2022 project wins, we will continue to generate higher returns than the industry average because we are continuing to focus on large projects with unique needs that we can match with our high-energy storage solutions from a megawatt hour per acre high density and more efficient design for augmentation, as was the case with batteries, no degradation in the storage medium, as is the case for our gravity energy storage solution and for ultra-long-duration in small footprint, as we did with our hybrid green hydrogen solution for PG&E. We hold all of the factors above to influence our 2023 outlook, but have taken a very conservative baseline approach that we're adopting in how we forecast our business and felt it most prudent to take a very measured approach to 2023, especially given the significant second half revenue ramp that constitutes our range of $325 million to $425 million for the year. Importantly, however, there is a significant amount of leverage within our range as we ramp into the second half of the year, of between minus $15 million to positive $1.1 million, allowing us to potentially be adjusted EBITDA positive as we exit the year if revenue approaches the higher end of the range, and thus entering 2024 with a platform for positive operating cash flow. Given the rapid pace, that we are seeing with the energy transition and all the unique use cases and solutions required to meet our customer needs, we continue to believe our differentiated holistic solutions-based energy storage approach is the best one suited for this market and will set up Energy Vault for a very large and unique future, as a major leading player over the next five to 10 years. Turning to our financial results for the fourth quarter of 2022, revenue in the quarter was $100.3 million primarily reflecting $84.5 million in revenue earned from our battery storage projects and $15.6 million from EVx licensing deals. For the full year 2022, revenue was $145.9 million, primarily reflecting $85.6 million in revenue earned from our battery storage projects and $58.5 million from EVx licensing deals. We will also target adjusted EBITDA in the range of negative $50 million and negative$70 million with year-over-year difference, a result of the change in revenue mix as we roll off the margin tailwinds from the licensing and royalty deal signed in the first quarter of 2022. Interestingly, our first EVx deployments either are going to be done through the royalty license agreement model as Atlas is building out or projects that we are going to own initially in particular in the US market where as I mentioned Joe we see a lot of interesting upside from the IRA tied to gravity because it's on lithium for all the things I mentioned on the call that I know you know very well about the benefits of that and the economics that the IRA can help accelerate and create. And as I said, with IRA and given what we did in our first year of almost $150 million of revenue and 2 gigawatt hours in book deals and up to 5 in awards total of booked and awards, we have a lot, I think, we're going to be able to do in the year regardless."
}