{
    "symbol": "DINO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-24 12:02:16",
    "content": " Today, we reported fourth quarter net income attributable to HF Sinclair shareholders of $587 million or $2.92 per diluted share. In our Refining segment, fourth quarter EBITDA was $864 million compared to $25 million in the same period last year. In our Renewables segment, we reported adjusted EBITDA of negative $7 million for the fourth quarter and total sales volumes of 54 million gallons, driven by unplanned downtime. HF Sinclair owns 59.6 million HEP Limited Partner units, which following the acquisition of Sinclair Transportation, represents 47% of HEP's outstanding LP units at a market value of approximately $1.1 billion at last night's close. With respect to capital spending for full year 2023, we expect to spend between $250 million to $280 million in Refining, $25 million to $35 million in Renewables, $35 million to $50 million in Lubricants and Specialty Products, $20 million to $30 million in Marketing, $50 million to $80 million in Corporate, and $530 million to $630 million for Turnarounds and Catalysts. Mike or Tim, when you're looking at how is the -- it's a little bit surprised that you're saying it will take until the second half of this year to reach the normal noise runway given that you actually start up all the plan, say, one in the first quarter, the other one is in the second quarter. You've asked if we're ready to change our $50 million a year mid-cycle, I'd say probably not at this point. I think from an integration and optimization standpoint, we've got -- I almost feel like a kid at Christmas, we've got a lot of new opportunities, a lot of new assets, a lot of new people and capability that we still haven't tapped fully into and we're going to see more of that going forward in terms of trying to optimize, in particular, the Rockies area, the whole west area with Puget Sound in the Southwest. And then finally, what I would tell you is that the roughly $300 million run rate that we're seeing here in the fourth quarter, we think will play out as we continue here in 2023. We executed on some really key points, which would have included getting these acquisitions integrated, realizing that initial $100 million, completing our start-ups within renewable diesel and importantly, returning over $1.6 billion of cash to our owners, proving up our commitment to get this done and frankly, get it done early."
}