{
    "symbol": "AXS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 15:00:16",
    "content": " Indeed, even on the quarter where the industry is anticipating more than $70 billion of insured cat claims, AXIS is now generating positive operating income and for the year-to-date while our industry has already suffered aggregate cat losses in excess of $100 billion AXIS has increased its underwriting income by 75% and our operating income is up 30%. To help, in our third quarter financial supplement weâ\u0080\u0099ve provided additional pages where you can see what our company would look like without the reinsurance property and cat book that weâ\u0080\u0099ve discontinued. Excluding reinsurance property and property cat business from all periods on a pro forma basis in 2021 AXIS consolidated gross written premiums would have grown 16% with an ex-cat current accident year combined ratio of 92.6, which would be a 4 point improvement over the prior year and an all in combined ratio of 97.4. And the consolidated current accident year loss ratio ex-cat and weather was 57.1% an increase of about 1.7 points over the prior year quarter, which was driven by the change in business mix in both segments. When you review the additional pages in the financial supplement that Albert mentioned earlier, you will read that this quarterâ\u0080\u0099s loss ratio ex-cat and weather excluding the property and cat business has improved from the prior year quarter and this is due essentially to raid over trend. On a year-to-date basis, our average insurance rate increase was close to 10% and just as in prior quarters, we continue to see overall new business pricing metrics at least as strong if not better than renewal pricing. So what I would say is that in 2023, weâ\u0080\u0099re going to continue to look for efforts to find protection for the tail, whether itâ\u0080\u0099d be more reinsurance or a cat bond or sidecar I think, in one way, shape, or form, I think the number one driver of continued growth in cyber exposures for us is our greater confidence in managing the tail. And right now with the movement in shareholder equity due to interest rates, given where our leverage ratios are, I think I would take share buybacks off the table, at least for the next few quarters until we kind of see what that looks like going forward."
}