{
    "symbol": "SRAD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-17 14:45:07",
    "content": " We are pleased with our strong results in the second quarter, highlighted by a 23% revenue growth, which we believe showcases the power of our business model. On basis of our strong results year-to-date and the visibility of our business, we are increasing our revenue guidance for the year-to-year range from to 24% to 27% growth, that comes from 18% to 25% previously. The combination of our unique experience platform, network and technology, along with the worldwide sport rights we have acquired over the past 20 years history, we have combined and built a business that we believe will deliver long-term shareholder value through first, consistent strong revenue growth, next, growing profitability with business leverage and margin expansion over time. Revenue in the second quarter increased by 23% compared with the second quarter 2021, driven by the strong growth in the U.S., our managed betting services and our global ads business. Totally, the U.S. business accounts for approximately 15% of our revenue and while the EBITDA margin is negative it continues to improve each quarter. U.S. business has delivered 57% revenue CAGR between 2019 and 2021, driven by growth of online sports betting, acquiring key data rights from professional leagues and the proliferation of sports data used in the media. We reported adjusted EBITDA of $28 million for the second quarter, down 13% year-over-year, primarily due to continued impact of Russian-Ukraine conflict, investment in our technology and product and some impact of new sports rights contracts. We spent time on this earlier in the call, so I will simply summarize, we saw over 60% growth in betting, over 90% growth in audio visual, over 90% growth in our sports solution audio visual, over 90% growth in our sports solution driven in large by last year's Synergy acquisition. Purchase services and licenses in the second quarter of 2022 increased by â\u0082¬11 million to â\u0082¬43 million compared with the second quarter of 2021, primarily resulting from increased cost of content creation, and processing and in line with the revenue growth. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Strong growth driver, a strong growing market in the United States, now 15% of our total revenue increasing strongly very, very stable, high-growth betting business, main driver, the trading services and the platform services from a growth perspective and then very stable audio visual growing business. Your line is open."
}