{
    "symbol": "KIM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 12:49:09",
    "content": " In terms of interest expense, although it was only $700,000 higher, it includes a one-time $7 million benefit from the acceleration of the fair market debt amortization from the early repayment of two Weingarten bonds during the quarter. Based on the capital gain of approximately $250 million, we expect to pay approximately $61 million in capital gains tax , which would net Kimco approximately $240 million, which can be used for accretive investments and further debt reduction. Based on our strong year-to-date results and our expectations for the fourth quarter, we are again increasing our 2022 FFO per share guidance range to $1.57 to $1.59 from the previous range of $1.54 to $1.57. This new guidance range takes into account the one time benefits we derived during the year, higher interest expense from our debt refinancing completed during the third quarter, and the reduction in debt fair market value amortization, credit loss for the fourth quarter of zero to $1 million, positive same site NOI growth and the impact of the Albertsons monetization discussed earlier. Moving on to our dividend, based on our strong third quarter results and increased guidance range, our Board of Directors has again raised the quarterly cash dividend for the fourth consecutive quarter to a new level of $0.23 per common share. Again, credit loss income has come down significantly and as I said, as I mentioned, we really think that weâ\u0080\u0099ve come to the end of where weâ\u0080\u0099re having income from credit loss and it will start to revert back towards something more in line with what youâ\u0080\u0099ve seen previously, 75 basis points of credit loss over time. So just mathematically, if you look at it, if weâ\u0080\u0099re in this 75 to 100 basis point target area or expectation area because of where weâ\u0080\u0099re viewing the economy and the uncertainty in it, youâ\u0080\u0099re looking at something in a dollar range of around $18 million."
}