{
    "symbol": "UDR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 20:45:06",
    "content": " And second, annualized resident turnover ticked up year-over-year to 50% but of the 16% of residents that moved out because of rental rate increases, we re-leased those apartment homes at an average 30% higher effective rate. Relative to our prior full year 2022 outlook, the drivers of our improved guidance ranges are as follows: First, we expect full year effective blended lease rate growth of approximately 12% to 14% which is 300 basis points higher at the midpoint compared to our prior assumption from April. These have improved staffing efficiencies at our communities by 40% and increased the number of apartment homes managed per employee by 60%, improved resident satisfaction by 25% and resulted in controllable operating margin advantage of 325 basis points versus public peers at a similar rental. For same-store guidance, we have increased our full year revenue and NOI growth ranges by 125 basis points and 150 basis points, respectively, to 10.5% to 11.5% and 13.25% to 14.75% on a straight-line basis. External growth activity included: first, during the quarter, we acquired a 433 Home community in suburban Boston for approximately $208 million at a mid-4% cap rate. Last, our approximately $370 million of developments in lease-up have been a drag on 2022 earnings but are expected to benefit future earnings by approximately $0.05 per share based on a 6.5% weighted average stabilized yield. I mentioned in my prepared remarks of call it  around 85% of our leases for the year because we can basically see what's being sent out through September, October at this point, we see where our market rents are going. You talked about almost $13 million of bad debt recorded in the quarter which if I'm doing my math right, doing the math right, it's about 3.5% of revenue which just seems like a high number. If you go back to 2019 and look at where income growth has been throughout our markets, income growth has averaged 4% or 5% which is effectively right in line with where rent growth going back to 2019 days earnings with market rents up today, 15%, 16% within our portfolio versus pre-COVID."
}