{
    "symbol": "ADI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-16 13:45:03",
    "content": "  Operator: Good morning and welcome to the Analog Devices First Quarter Fiscal 2022 Earnings Conference Call, which is being audio webcast via telephone and/or the web. I’d now like to introduce your host for today’s call, Mr. Michael Lucarelli, Vice President of Investor Relations. With me on the call today are ADI’s CEO, Vincent Roche and ADI’s CFO, Prashanth Mahendra-Rajah. The information we are about to discuss includes forward-looking statements, which are subject to certain risks and uncertainties, as further described in our earnings release and our periodic reports and other materials filed with the SEC. Our comments today will also include non-GAAP financial measures, which exclude special items. With that, I will turn it over to ADI’s CEO, Vincent Roche. So once again, ADI delivered another record quarter, marking a strong start to the year. Our continued success was driven by our unparalleled high-performance portfolio and our team’s strong operational execution and intense customer focus, enabling us to better meet the growing demand for our products. Now, looking at our first quarter results, revenue was $2.68 billion, up more than 20% year-over-year on a combined basis. Growth was broad-based, with all segments up double-digits year-over-year, led by industrial and automotive. Adjusted EPS was $1.94, up 35% year-over-year. Now, it’s been nearly 6 months since we closed the Maxim transaction, overall, we have made great progress on the integration to-date. In the many exchanges I have had with our customers, they have expressed their enthusiasm for the combination recognizing the increased value that ADI and Maxim together bring to the market. Broadly speaking, ADI is viewed as a trusted, long-term focused partner that takes a customer-first approach to our engagements. We offer a unique combination of best-in-class engineering and unmatched domain expertise, with a high-performance portfolio that spans from microwave to bits, from nanowatts to kilowatts and from sensor to cloud. The acquisition of Maxim increases the breadth and depth of our high-performance portfolio, especially in power management. Here, our more comprehensive power portfolio allows us to better address opportunities across industrial, automotive, datacenter, connectivity and consumers. Similar to the cross-selling activity we implemented with the LTC portfolio, we are aggressively identifying areas to attach this power portfolio with ADI’s leadership positions in analog, mixed signal and RF. And with our extended sales and field organizations, we are better positioned to uncover cross-selling opportunities and serve existing and new customers who have an increased need for application and design support at a solutions level. And I am already seeing firsthand the benefits of our collaboration, from operations, to engineering, to sales, making me excited for what’s ahead. Turning firstly to our manufacturing operations, the analog sector is characterized by fragmentation, with diversity across products, customers, applications and markets. To tackle this complexity, we utilize a hybrid manufacturing strategy, providing us with vast capabilities across technology, processes and packaging necessary to create innovative solutions from 7 nanometers to 7 microns for our 125,000 customers. These investments will grow our capacity this year and into 2023, provides seamless product qualifications for our customers, and give us greater optionality between our internal facilities and foundry partners. Now ahead of our Investor Day in April, I’d like to preview some of the secular growth trends that make us most excited about the future of our industry and for our company. In the industrial market, we are seeing the compounding effect of many concurrent secular trends. For example, our instrumentation business, which is comprised of automated test equipment, electronic test and measurement and scientific instruments, is aligned with growth trends from connectivity, to EVs, to sustainability. The growing technology complexity of these applications requires ADI’s more advanced metrology solutions, enabling us to continue increasing our SAM. Here, we support tens of thousands of customers of all sizes with our precision signal chain, power management, sensing technologies, and robust wired and wireless connectivity solutions. In automotive electrification, we are the global leader in battery management systems for EVs, with double the market share of our nearest competitor. And in the last quarter, we have recorded several new design wins from premium European auto manufacturers. This vision requires green energy generation with a smart grid, which digitally monitors and adjusts performance and also energy storage systems, which mitigate intermittency issues related to variable user demand. Within automotive, we are also seeing manufacturers create a more immersive human experience by digitalizing the cabin. This requires increased bandwidth, lower latency and more efficient power management, creating new opportunities for ADI’s connectivity and power portfolios. For example, our audio system solutions with signal processing, A2B connectivity and road noise cancellation provide customers with the highest fidelity solution while also reducing the vehicle’s weight. In addition, our GMSL franchise and functional safety certified power management solutions are critical in architecting and efficiently powering advanced driver assistance systems. Overall, our market-leading positions in BMS, audio systems and GMSL, combined with our complementary customer bases, position our automotive franchise to deliver strong growth in the years ahead. Turning now to advanced communications networks, in wireless, ADI’s market leading software-defined transceiver portfolio is enabling next-generation communication systems from traditional 5G, to O-RAN, to low earth orbit satellites. In wireline, our optical control and power portfolios are critical to tackling the exponential growth in bandwidth and compute power of carrier networks and hyperscale datacenters. And with Maxim, our portfolio has increased in breadth and depth and we see even more opportunity than ever to capture additional market share. My comments today, with the exception of revenue, will be on an adjusted basis, which excludes special items outlined in today’s press release. ADI delivered a very strong first quarter, with record revenue, profitability and earnings. These results reflect the secular demand for ADI’s products, capturing synergies and effectively passing on inflationary costs. So for the first quarter, revenue of $2.68 billion finished near the high-end of our outlook, with double-digit growth across all end markets and geographies. Looking at our end market performance for the quarter, industrial, our most diverse and profitable market, represented 50% of revenue and achieved a new all-time high. Industrial has grown more than 20% year-over-year for five straight quarters, underscoring our strong market positioning, supported by numerous secular tailwinds, including automation, digital healthcare, sustainable energy, aerospace and instrumentation. Automotive, which represented 21% of revenue, achieved another record, with every major application posting double-digit year-over-year growth. Our battery management system offering continues to outperform and represents over 15% of automotive revenue, underscoring ADI’s leadership in electric powertrains. Additionally, secular content growth inside the cabin continues to drive both the A2B and GMSL connectivity franchises to new heights. We are in the early days of 5G deployments and expect global rollouts, led by North America, to accelerate in 2022 and beyond. And in wireline, demand remains strong as carriers and hyperscalers continue to upgrade their cloud infrastructure from long-haul to datacenter. And lastly, consumer represented 14% of revenue and was in line with seasonality. Importantly, we continue to grow year-over-year, supported by strategic investments aimed at diversifying our customer and application mix. The first quarter demonstrated our increased portfolio breadth as all segments achieved growth, including professional audio video, gaming, wearables, hearables and personal electronics. Now, looking at the P&L, gross margin increased 100 basis points sequentially and 190 basis points year-over-year, resulting in a record 71.9%. OpEx in the quarter was $702 million, better than anticipated due to faster synergy progress. All told, adjusted EPS of $1.94 increased 35%. And now moving on to the balance sheet, we ended the quarter with approximately $1.8 billion of cash and equivalents. Looking at cash flow items, CapEx was $111 million for the quarter and $387 million over the trailing 12 months. As a reminder, during fiscal 2022, we plan to invest 6% to 8% of revenue to significantly grow our front and back-end capacity and build a more resilient hybrid manufacturing model for the long-term. Over the trailing 12 months, we generated $2.78 billion of free cash flow or 33% of revenue. Over the same time period, we returned approximately $4.2 billion or more than 150% of free cash flow via purchases and dividends. And as a reminder, we target 100% free cash flow return. We aim to use 40% to 60% of our free cash flow to consistently grow our dividend, with the remaining free cash flow used for share repo. And just yesterday, we announced a 10% increase to our quarterly dividend, marking the fourth consecutive year of double-digit increases. Our ASR program concluded in the first quarter, and as a result, we retired approximately 14.4 million shares. Revenue is expected to be $2.8 billion, plus or minus $100 million. At the midpoint, operating margin is expected to be 46.5%, plus or minus 70 bps. And this outlook includes approximately $100 million of annual run rate synergies, split roughly evenly between cost of goods and OpEx as we exit second quarter. So based on these inputs, adjusted EPS should be around $2.07, plus or minus $0.10. We are holding our Investor Day on April 5, where we look forward to sharing ADI’s long-term strategy, our new financial model and a detailed update on all phases of our synergy road map. We hope to see many of you in person at our headquarters right outside of Boston, where we will offer unique customer-led interactive technology demonstrations and displays throughout the day. Vince, I was hoping you could maybe give us a readout of what you see as kind of the supply-demand balance in your different end markets. And if – as part of that, if you could help us understand what role is pricing playing in the industry today. Or will it need to revert back as there is more trailing-edge capacity that comes online, including from your other large U.S. competitor? Good morning, Vivek, I’m going to just do the setup for that on the supply and demand environment. As I said in the prepared remarks, all end markets, all geographies are looking strong. We’ve delivered eight sequential quarters of growth, and that’s supported by the manufacturing team continued to increase their ability to supply. And as I mentioned in the remarks, we expect that increase to be progressive over the balance of the year while they continue to debottleneck the process. From a supply standpoint, we’re going to continue to look at the balance here and keep an eye on how things are going. On pricing, that’s a longer question, so let me split that into two pieces. So from margins, we along with the rest of the industry have been passing on the higher costs that we’ve been seeing. So we’re not using this environment to take advantage of customers, but really targeting to maintain gross margins. But built into those margins is a number of items, including the synergy execution, which is coming in faster than we thought, some benefit of mix, higher revenue because we are actually shipping more units. So I think on a quarterly basis, unit shipment is up double-digits year-over-year. But to finish off on pricing, I’m going to pass to Vince to maybe talk about how we’re – how he’s talking to customers. I think also, pricing for us is more structural than cyclical. So I think, as Prashanth said, cost inflation, we’re in the post-Moore’s Law era, cost inflation, I think, is going to be a long-term facet of the economic dynamic of the semiconductor business. So I expect that cost increases will moderate, but there will be inflation, I think, for the medium to long-term here. So I think when you put it all together, the industry is in a better place to capture more of the value that it’s been generating over these many, many decades. And then I think we will benefit from that as a company based on the quality of our innovation, but also the new dynamics in the industry. Historically, pricing did x, and now we think it’s going to do sort of x plus. And because – and the reason why I asked the question is we look at your relative growth rates to some of the end markets that you participate in, and you’re clearly growing significantly faster. And so we look at inventory and revenue, we probably should be looking at it on units. So this year, pricing or – actually, I should say, for the current quarter, pricing counts for less than half the growth. And we had said on the prior quarter’s call that in 2021, we had cost increases that were coming at us faster than we were able to push price out because we were in the process of closing the deal on Maxim and beginning the integration. I’d say, John, one other comment. I’ve said many, many times before that for several years up to this step function increase due to inflation in prices and cost of goods and then prices, our pricing was – for many, many years, we had been – we had to fill a gap. I would say we were accentuating towards zero price reduction on the average, adding more ASPs to our products for the innovation that we’re creating. So that will be, I think, the primary dynamic for value capture for ADI for the years ahead. And that our customers are tilting the content, the semiconductor content towards premium models. And then long-term, we expect to be able to grow our business in the automotive sector as a multiple of SAAR. In cabin connectivity where we’ve got a very, very strong signal processing franchise, to which we’ve connected our A2B connectivity, road noise cancellations, a new value creator in the cabin. And we’re very excited by the GMSL, the connectivity portfolio, the high-speed connectivity portfolio that we have inherited from legacy Maxim. We are underrepresented in general in power management, I’d say, across the industry, and particularly in automotive and industrial. So, I think the combined portfolio of ADI and Maxim gives us a tremendous opportunity to tap in to what is actually the largest sector. Power is the largest sector of the analog market, and it’s growing at a compounded rate there. Prashanth, I wanted to ask about your synergy capture in the quarter and how to think about synergies going forward. In your prepared remarks, I think you talked about earlier than expected synergy capture. And then, I guess additionally, on Phase 2, I realize it’s kind of early. The – in the last call, we talked about $20 million of synergies was realized in fourth quarter. So, we are going to exit second quarter at about $100 million of that $275 million. And as I have said in the remarks, it’s roughly split between both cost of goods and OpEx. It sounds like it’s a revenue boost, but not so much a margin boost yet. But I just look at the company, ADI standalone was kind of 70 to maybe low-70s, Maxim was kind of mid to high-60s. Stacy, let me just clarify, that I would be incorrect to assume that there was no benefit from pricing in the gross margins. What I wanted to clarify earlier in the response was, embedded in that margin improvement is the synergy, the faster synergy execution, which I just answered in Toshiya’s question. The mix, which we talked about in the prepared remarks, again, very strong industrial at 50%, is great for us. And then higher unit volume, because we are up on a unit basis double-digits, and utilization, and then pricing also fits into that. In terms of how to think about the gross margin on a go-forward basis, we will share the new operating model or the financial model for the company in April. So, as we have met with investors, there is pretty uniform agreement that what they would like to see is higher revenue growth and make the trades that are necessary on margin to be able to deliver higher revenue growth. Gross margins, Stacy, and how it trends, we don’t guide gross margins, but I will give you some context around. If you look at 2Q, it’s usually up a bit. And then at the Investor Day, we will talk more about the long-term outlook for the business. The – well, first off, if we just take it from a high level, first, we have always utilized a hybrid manufacturing model at ADI. And it gives us the reach of process technology and capabilities that we need to support the sheer breadth of our portfolio, which is more than 75,000 unique product sets. And we are supplying 125,000 customers. So, I think when we think about the long-term, we will continue to use the benefits of this hybrid model for optionality, resilience and the availability of technology. So overall, the business that we are in, it is – and given that we are approaching the world with a hybrid mentality, our business is less capital intensive. And it also gives us, as I said, resiliency in terms of gross margin and long-term access to more options for process technology, etcetera, etcetera. Tore, I think your question was specifically related to CapEx. So, let me just – let me kind of size that at a high level. And we are targeting somewhere between 6% to 8%, which is above our historical long-term rate of 4%. On a GAAP basis, which is consistently how we measure for all companies, it’s pretty low versus the average and versus the long-term target that you have laid out. That is not the – not our balance sheet, but the inventory in the channel, that remains very lean, well below our seven-week to eight-week target. Within ADI’s books, our days of inventory are up slightly, primarily, as I mentioned that we are planning to see revenue increase sequentially for the balance of the year. So, you have the raw material and the WIP is in – is sort of in the middle of the process now before that comes out, and that is – that’s up. We also had a little bit of finished goods up, but that was purely timing on when the quarter ended versus where the goods were in the transit process. So, I wouldn’t read anything into our increase in finished goods, except to say it’s just – it happened to be when the Drawbridge closed for the quarter. If I look at cloud and hyperscale data center CapEx spending for this year, that’s expected to grow like 30%. And I know that in the data center end market, Maxim, for example, they provide the critical processor power management for NVIDIA’s data center GPUs. On the ADI side, you guys provide server power supply solutions and optical networking solutions. If you look at our comms business, it’s about 15% of total revenue. That’s split about evenly between wireless and wireline, about 50%, 50% in each of those. And if you look at the wireline piece, that’s where data center is embedded, it’s probably about 30% to 35% of that relates to the data center. But I will pass it to Vincent and Prashant, probably Vince to talk a little bit more about what the opportunity is in data center and why we are excited. Well, we have I consider, combined with Maxim, a strong position in optical connectivity as well as carrier networks, but also power management, whether it’s the power system monitoring, energy monitoring and actually power delivery itself."
}