{
    "symbol": "LEG",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 13:11:04",
    "content": " EBITDA margins in the segment were lower versus first quarter 2021, primarily from lower volume, lower overhead absorption as production and inventory levels were adjusted to meet reduced demand and continued investment in labor given difficulties in hiring and training, mostly offset by expanded metal margin and our steel rod business. In February, our Board of Directors declared a $0.42 first quarter dividend, $0.02 or 5% higher than last year’s first quarter dividend, at an annual indicated dividend of a $1.68, the yield is 4.7% based upon Friday’s closing price of $35.63, one of the highest among the dividend kings. We’re committed to enhancing lives through our people, our products and our processes by finding new ways to care for the health and wellness of our employees and their families, attract and retain talent, develop our employees to their fullest potential and advance our inclusion, diversity and equity efforts by striving to advance innovative sustainable solutions for our customers and the end consumer by continuing to aggressively pursue resource efficiency and conservation practices and by ensuring a culture of good governance and high ethical standards within our businesses. With that, any thoughts on how you’re thinking about capital structure, targeted debt levels, as you’ve obviously worked really hard to get that deleveraging through in the last couple years and now sit in a much better position overall. Now that we’re in a better leveraging space and looking at that target leverage range that we’ve been working on here, we felt like going through the first quarter, there were some opportunities to take advantage of the decline in our share price that we saw in recent months, which allowed us to get into the market and buy those shares that you mentioned. And I guess, just following up on that a bit, when you look at the pricing power, I mean, you’re continuing to see some really exceptional levels of pricing across the business, and especially coming up against some really tough comps in there, which I think really speaks to your ability to realize that and be able to offset the inflation in there."
}