{
    "symbol": "LEG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 10:12:19",
    "content": " EBIT decreased slightly versus last year's adjusted EBIT, primarily from volume declines and lower overhead absorption as production and inventory levels were adjusted to meet reduced demand, mostly in bedding. Raw material-related selling price increases, strong trade demand in steel rod and drawn wire and the addition of our Kayfoam acquisition made in the second quarter of last year were largely offset by volume declines from soft demand in US and European bedding markets. EBITDA margins in the segment were lower versus second quarter 2021 adjusted EBITDA margins, primarily from lower volumes and lower overhead absorption as production and inventory levels were adjusted to meet reduced demand, mostly offset by expanded metal margin in our steel rod business. Sales in our Furniture, Flooring & Textile Products segment were up 10% versus second quarter 2021, primarily from raw material-related selling price increases and volume recovery in work furniture, partially offset by lower volume in Home Furniture, Textiles and Flooring. Please proceed with your question. Please proceed with your question. And also, not just from the impacts of inflation and other things, but consumers shifting to spending on services, travel and some other areas like that, like Mitch said, what gives us confidence even as we watch consumer sentiment be at low levels, is that we've seen some step downs over the course of the last nine months or so, but it's been really consistent, especially as we move through the second quarter. And even if we think about the housing market softening a little bit, even in places like our Home Furniture business, for example, maybe less impacted consumer sentiment and people even if -- with all of the home traffic that has happened over the last couple of years, probably some return to that repurchasing cycle there. I think the good news there, as I mentioned on the call that we've been doing this since we first started to see demand slowing a little bit in the fourth quarter of last year in Bedding, as well as across our other businesses. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}