{
    "symbol": "SWIM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 15:09:08",
    "content": " Fourth quarter gross profit and gross margin declines were primarily driven by three factors; reduced sales and the impact of our fixed costs on lower seasonal volume, continued destocking of packaged pool inventory in the wholesale distribution channel, as well as the impact of inflation. One, the impact of macroeconomic uncertainty on consumer spending and demand resulted in anticipated declines in the industry for US new, in-ground pool installations in 2023; two, we continue to see destocking of packaged pool inventory at the wholesale distribution level and expect normalization of inventory levels to remain a headwind through at least the first half of 2023. We gave the 1Q guidance of what we think we'll see, I think if we look back at 2022, right, with new pool starts being down in 2022, we did see fiberglass volume up on a unit basis year-over-year what was a down full market. We've not given an indication of what we think fiberglass unit volumes will do for 2023, where all of our efforts and initiatives with new dealers sign up, driving the ability to have our dealers get more pools in the ground, the lead generation and more importantly, I think just the favorable economics of a fiberglass pool with lower upfront costs, total lower cost of ownership versus the concrete pool will benefit consumers as maybe they look to say, a concrete pool just gotten too expensive, far or less really great option for us. And then, just to go back in terms of the cadence of revenue into 2023, understanding the impact of the channel de-stocking happening in the first half, but obviously, the last three years have been unprecedented in terms of the demand for pool and obviously, it's hard for us to get a good sense of the historical seasonality this business had, let's say, prior to the pandemic. 1Q and what we've laid out for guidance, again, kind of when you think about revenue on a percentage basis of the full year, where we're sitting for 1Q with the guide, taking into account seasonality, but more importantly, does that continued destocking of the package pool piece of the business, 1Q would kind of frame back up to a normal quarter for us. And just quickly touch on the EBITDA aspect of that seasonality from the revenue, if you think about the cost basis of this business on the fixed side and the variable, right, we do carry higher cost in 1Q than 4Q on those much lower volumes, which is kind of knocking down the EBITDA level that we saw last year in 4Q and that we're indicating here in 1Q. It has trended down the last couple of years, I think, as we've seen the destocking in 2022 and the continued indication of that '23, so we really haven't disclosed those split, but it's still a big piece of that in ground segment for us. If we think about pool starts and depending on where the final number shakes out for 2022, we're still 40% -- call it 40% off the peak from 2005, so there's still a lot of upside opportunity to kind of return to that 20-year, 25-year historical average of pool starts, which would still be elevated above the 21% level from where we sit today. I think it comes down to preference, shape and size of the pool the homeowner wants, the design, on the market they sit in, and our view really is to continue to drive the awareness of fiberglass and all the benefits, because even we talk a lot about fiberglass versus concrete and the cost advantages, the same thing applies in the vinyl space, where the fiberglass pool maybe a little bit more expensive upfront."
}