{
    "symbol": "SWIM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 10:29:08",
    "content": " While we feel good about the results we delivered in the first half and the overall state of the business, we expect the softening of volume that we saw in the second quarter in our in-ground pool product category, which was driven primarily by packaged tools to continue through the balance of this year. Adjusted EBITDA was $97 million for the first six months of 2022, up 27% from the prior year period, and adjusted EBITDA margin increased 100 basis points to 24.2% from the prior year period. Net cash generated by operating activities was $42 million for the second quarter of 2022 compared to $55 million in the prior year period, with the reduction primarily driven by investments in working capital, mainly inventory to return to normalized lead times and the embedded impact of inflation on inventory. Capital expenditures totaled $10 million in the second quarter of fiscal 2022 compared to $8 million in Q2 last year, driven by the increased investment in fiberglass capacity, most notably the Kingston manufacturing facility project. What we're not seeing is the pools kind of re-stocking orders at the distribution level as they adjust inventory positions where they've probably been a little higher than normal, we'll see that correct through the back half of the year, and then we should be good as we head out to 2023. And I'll say dealers, and it's really balanced at the dealer region level where they have seen a slowing of leads and that's why we've really increased the lead generation efforts for those dealers in many of those markets. Hey, good morning, guys. Hey, good morning, guys. The things we're looking at high level, clearly is incoming order rate interactions with our dealers, what they're hearing in CN and really staying close to them from a lead generation demand standpoint, we don't disclose or talk about backlogs, but that's another good indicator of what we see out there on the consumer and dealer front as we work through those. And what I would say is what separates us from the rest of the pack a little bit is this digital strategy we have where we can dial up the demand kind of at a moment's notice for the dealers 90 million homes out there that want a swimming pool, and I've used this stat several times, and I love it."
}