{
    "symbol": "SWIM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-15 17:47:10",
    "content": " That's helpful, and then just my second question, how do you think about investing through downturn things like going after new dealers’ new capacity additions marketing dollars would you kind of continue to investor it in order to keep driving material conversion for what kind of people, sir. I guess first could you just sort of refresh us on where we're at maybe versus the start of the pandemic on kind of where the all-in price to a consumer is for a fiberglass pool versus where you think are GLI pool might be coming in just, just trying to see what kind of the relative inflation looks like and what may that GAAP has looked like over time. So the fact that we're sold out through the rest of the year with those boot camps tells you, we've got, we're good a healthy flow of new and existing dealers in the pipeline to continue to drive that capacity creation in the industry to get more pools in the ground for the whole. Other than let's say the doomsday scenario of a really deep recession down, but I think again, we would weather every single scenario that we could come through, and that's what's great about this team and if you think about the last three years how many challenges have been thrown at us and how the team has performed and the result this business is post over three-year period, that's a testament to the strength of our team, our dealers and the brand we have here at Latham. The average price point of let's say, the pool going into the backyard continues to increase -- and look, there's a couple of anecdotal points where a few dealers have said they've seen the average price point of the backyard pool install move up significantly by 20% to 25%, which could be an indicator that there is a strength at the higher income level or the higher net worth an equity level of homeowners willing to double down and invest in their yards. So, I don't think we really worry about it because just look at what happened 2019-2021, you keep pushing pools right up into Christmas, I think and that's where the fiberglass product can continue to be installed deeper into the winter months than the other two types of products that are out there, which gives us that confidence that a slow start won't hurt us long term for the season. One, it really is region-dependent where you sit and what I'll say, there's parts of the country right now where we've worked through the backlog, we're in really good position where if you, the consumer, went to your local dealer and you wanted a pool and this dealer had the open slot -- that's the key thing, if the dealer had capacity, had an open slot and had a crew, I could ship your pool tomorrow. So, it's really that dynamic and for the rest of the business, again back to the team, we've done a tremendous job getting back what I would call our world-class leading service levels across the industry -- covers, liners, the in-ground of vinyl business, we're in a really good position across the board there. We don't specifically break out radiant -- I'd just remind everybody, it's a relatively small business, I think we disclosed that last year and total sales were somewhere in the $35 million range and as pleased as we are with that performance, they also have a pretty full order book right now."
}