{
    "symbol": "LANC",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-05 13:41:04",
    "content": " At this time, I would like to welcome everyone to the Lancaster Colony Corporation Fiscal Year 2023 First Quarter Conference Call. Conducting today's call will be Dave Ciesinski, President and CEO; and Tom Pigott, CFO. Good morning, everyone, and thank you for joining us today for Lancaster Colony's Fiscal Year 2023 First Quarter Conference Call. Also note that the audio replay of this call will be archived and available on our company's website, lancastercolony.com, later this afternoon. For today's call, Dave Ciesinski, our President and CEO will begin with a business update and highlights for the quarter. I'll now turn the call over to Lancaster Colony's President and CEO, Dave Ciesinski. In our first quarter, which ended September 30, we were very pleased to report both record sales and higher profits. Consolidated net sales increased 8.5% to $426 million, while consolidated gross profit improved 7.2% to $99.1 million. As we foreshadowed on our Q4 call, our sales for the quarter were unfavorably impacted by our July 1 ERP go-live, which shifted an estimated $25 million of net sales into our fiscal fourth quarter. Advance ordering, ahead of our ERP go-live accounted for an estimated $11 million in retail net sales that were shifted into our fiscal fourth quarter. Retail net sales reflect the benefit of pricing actions taken to offset inflationary cost including our most recent round of pricing for retail dressings and sauces, which took effect in early August. Sales volumes measured in pounds shipped were down 15% as impacted by three primary factors: first, our decision to exit some less profitable product lines during fiscal year 2022; second, the advanced ordering ahead of our ERP go-live; and third, demand elasticity attributed to inflationary pricing. Excluding the product line rationalizations and advanced ordering, retail sales volume declined about 7%, which was in line with our expectations for demand elasticity. In summary, Q1 top line results for our retail segment reflect our pricing actions, strong performance from our Marzetti brand and additions to our licensing program which were offset by product line rationalizations, demand elasticity and advanced ordering ahead of our July 1 ERP go-live. In our Foodservice segment, net sales grew over 20%, driven by our pricing actions, along with volume gains for select customers in our mix of national accounts. Excluding the advanced ordering, our Foodservice segment volumes were down 1% in fiscal Q1, which compares favorably to NPD CREST data for the quarter, which showed restaurant industry transactions were down in the low to mid-single-digit percentage point range for the period. That said, we've made great progress through our pricing actions where our PNOC or pricing net of commodities was favorable versus the prior year as we've begun to recover some of the unfavorable inflationary cost impact we experienced last year. This progress is reflected in our Q1 gross margin, which reached 23.3%, a sequential improvement of 150 basis points versus our fiscal fourth quarter. I'll now turn the call over to Tom Pigott, our CFO, for his commentary on our first quarter results. The Company's strong top and bottom line results were driven by successfully implemented pricing actions that offset inflationary costs, as well as improved fundamentals. If you will recall, customers increased their orders for deliveries near the end of our fourth quarter to ensure they had adequate inventory prior to our SAP implementation on July 1. We estimate this shift of shipments reduced our first quarter net sales by $25 million; decomposing our 8.5% revenue growth, 16.2 percentage points were driven by pricing. This growth was offset by the customer pull forward of volume, which reduced revenue growth by an estimated 6.4 percentage points. If you recall, in Q1 of our fiscal '22, we had negative PNOC as we lagged the rapid run up in costs, particularly in our Foodservice segment. While our commodity inflation was approximately 25% this quarter, our pricing actions offset this increase in the majority of the prior year shortfall resulting in the improved performance. Second, through improved planning, scheduling and tactical execution,  head count was down for the quarter versus the prior year quarter. Third, inventory days on hand are down versus the prior year quarter, and our mix of inventory is better aligned with demand trends. Selling, general and administrative expenses declined 4% or $2.1 million. Expenditures for Project Ascent, our ERP initiative, totaled $9.2 million in the current year quarter versus $9.4 million in the prior year quarter. With regard to capital expenditures, payments for property additions in the first quarter totaled $24.6 million. For fiscal year '23, we are forecasting total capital expenditures of approximately $100 million. So to wrap up my commentary, our first quarter results reflect revenue growth driven by pricing that offset significant commodity inflation. In the coming year, we'll continue to address the inflationary costs with our revenue growth management program and maintain an ongoing focus on improving supply chain performance. One, accelerate core business growth; two, simplify our supply chain to reduce our cost and grow our margins; and three, to expand our core with focused M&A and strategic licensing. In our fiscal second quarter, we expect retail sales will benefit from our expanding licensing program, while in Foodservice, we anticipate continued volume growth from some of our QSR customers. Cost inflation will remain a headwind to our financial results, but previous pricing actions along with our cost savings initiatives will help to offset the increased cost. I'd like to note our second quarter results will also reflect some start-up costs, as we begin producing product in our newly expanded section of our dressing and sauces facility in Horse Cave, Kentucky later this month. I'm pleased to share that in early October, we successfully implemented Wave 2, which added our Sister Schubert's Frozen Dinner Roll facility in Horse Cave, Kentucky, and our Marzetti dressing and sauce plant in Milpitas, California to our new ERP network. Overall, Project Ascent continues to proceed in line with our plans, and we look forward to continued progress as we add more plants and warehouses to the network throughout fiscal year 2023. We don't have a specific number for Q2 that we're going to give you, but it will be, I would say, a modest headwind on the results as we look at our outlook for Q2. If we look out over the balance of the year, you're going to be -- your gross margin in 1Q was certainly above where it's -- where it was in Q2 through Q4 last year. So obviously, as you recall, last year, we were lagging the pricing impacts, and we had a significantly negative PNOC impact. But at the same time, we're going to have the benefit of being able to drive improved supply chain performance throughout the year. So we're obviously pleased with the results, but we're also cognizant that from a PNOC standpoint, Q1 was our easiest comp as we go forward. And then in the back half, what we're going to have is, the benefit of being able to execute more of our supply chain productivity initiatives. For example, with the Horse Cave facility starting up, we're going to be able to bring back in a volume that's being co-packed and make some other changes that I think are going to drive margin improvement into the business. So the only other thing that sort of structural headwind is the fact that when you look at inflation, we're continuing to see inflation on raw material and packaging at the 20% range for the whole business. So there will be sort of a structural headwind between that pricing point where we price for the dollars, as you're well aware of. So obviously, we're delighted with the performance of the Foodservice segment, and they benefited both from recovering the PNOC as well as managing out of some less profitable business, which allowed for that strong performance. As you go back in time, if you go back a few years, Foodservice was earning at a similar level to that $30 million. I think if we go back to 2020, it was around $27 million of operating income. I think we're keenly focused on the volumes and the top line, which is a key enabler. And just coming back to Tom's point there, what I would point to is really not just the EBIT, but the EBIT margin. And we feel like with the pricing actions that we've taken, we've sort of dug our way out of really what was a bit of a two-year drag on EBIT margins that we've been able to cover back against. So the only other headwind that's outside of our control, and we think it's likely to be a headwind is what happens on gas prices and what happens on the broader economy. And if it softens, we think it's going to result in some diminution on Foodservice business. If I could sneak one more in, Dave, just looking at the pullback in consumer promotion spend, I guess, in 1Q, I just want to make sure I understand the rationale behind that. And just kind of thinking about the balance here, you're getting the pricing, elasticities are hanging in there, but costs are rising. Well, here's maybe how I would think about it. So as we're entering the important holiday season for particularly our big businesses, Sister Schubert and maybe to a lesser degree, New York, what you're going to see is our promoted price points are moving up in line with a lot of what you're seeing from the rest of our peers. And that's an area where we're looking at our base price, we're looking at our promoted price, we're looking at the average price versus peers, and we're making sure we're capturing margin where we can. So as we think about margins throughout the year, I think you guys quantified an expectation for about 30% inflation in fiscal '23 last quarter. And so it sounds like that's really trending down towards about 20%, if I heard correctly. No, I -- when we're looking at raw material and packaging, we've been pretty consistently saying that's in the 20 -- low 20s, but we're around 20. Now when you look at other inflation that's out there, transportation, warehousing, labor, things like that, some of those are -- versus prior year, not necessarily sequentially versus where they would have been a quarter ago, those are running higher. As you get into Q2, we're seeing higher inflationary impacts in eggs and wheat that are going to impact that particular quarter. Connor, you didn't ask the question, but it really gets back to -- we are seeing the inflation, how do we feel about our ability to price. Our view now is, we feel like we have the inflation that we see in the business and for the immediate foreseeable future covered in our pricing that we have in place. Given the event, we continue to see things run that Tom is talking about, eggs, wheat and otherwise, we feel like there's room to go back to our customers and have more conversations about pricing. So from the data that we see, it looks like sales growth at retail across the licensed portfolio really accelerated throughout the quarter for all brands on both price and volume, despite a lot has been really difficult compares. What we're finding is consumers really, really like them. So I think that explains why even in the face of inflation, you're seeing them continue to grow. And I would share with you that we really believe that in the case of, let's say, Chick-fil-A sauce. We're encouraged by the early results, but it's in limited distribution, principally in Kroger and Walmart. As the Horse Cave facility is online, we're going to be able to drive much more aggressively. So driving for national distribution on large size of Chick-fil-A, national distribution on barbecue sauce for Chick-fil-A and their Sweet and Spicy Sriracha, the Olive Garden Caesar, we're already in distribution on Arbyâ\u0080\u0099s, but we think there's more room to continue to press. But back to your original question, consumer-relevant brands, and I think consumers are so finding it to be a value even at elevated price points. As you go forward, the way to think about it is as we've shared in the past, some of the SAP costs, the amortization of the software and the licensing costs will have started to revert back to the base business as we've gone live on SAP. And We've indicated that's about roughly $1 million to $2 million headwind this quarter, less than it will be going forward. So on the amortization of SAP, looking at your Q, it looks like it did not start yet, but it's going to be about $1 million to $2 million a quarter starting in the second quarter to go forward. And so the base business then had to absorb that $11 million, $11.5 million in the quarter and that is netted into our SG&A costs, excluding the SAP. Or is that net...\n No, I would include that -- include that because that's going to be an ongoing cost of the business. So we're trying to split out to say, here's what is going to be ongoing, and then here's what's temporary. And the reason we're doing that is because a lot of companies capitalize a lot of the SG&A related -- or the cost, a lot of the cost to implement SAP, they capitalize them on the balance sheet because they customize it the way we're implemented with the cloud-based system, the accounting guidance is that you have to expense it. So the overall -- when you adjust for the pull forward and the discontinued items that we talked about, volume is down about 7% or so, and that's very much in line with -- first of all, that's what you'd see in the  data out there, and that's very much in line with our expectations. And Andrew, we've been pleasantly pleased with how it's hanging in there for us and don't really see any reason for that to change at least in the immediate term. Historically, we didn't have much pricing if you go back several years ago, and the growth was really led by volume. Now we've moved into a season where given the inflation, manufacturers like us are passing on pricing and concepts are pricing themselves. That being said, if you look at transactions for the most recent period, they're down in the low to mid-single digits overall. And then you're pulling a part one more layer and what you find is there are concepts that are continuing to drive transaction growth, Chick-fil-A among them, Taco Bell among them and some others. So given our mix of QSR customers and then within QSR, our mix, we're continuing to see that hang in there for us. Now I would tell you that, what I watch most closely is what's happening with gas prices. And if you go back and you look at the trends over the summer on gas prices, as gas prices rolled up, March, April, May and then peaked in June, we could see a downturn in transactions that almost correlated perfectly across every customer, independent of their start point as gas prices spiked. So as we look at a period against period comparison, we and the rest of the industry swelled on headcount and overtime to keep up with that surge in demand and then we quickly realized that it wasn't going to be long lasting. But to Tom's point, in the earlier comments there, when you look at it period-on-period, we've made that adjustment. It's been a pleasure to spend some time with you this morning, and we look forward to getting together with you early in the next calendar year to share our Q2 results."
}