{
    "symbol": "CLAR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-27 21:58:05",
    "content": " We drove record revenue growth, grew our Precision Sports segment by 21%, deepened our specialty retail presence in our Outdoor segment by increasing sales in this channel by 31% in the second half of the year, grew our apparel by 31% and expanded our direct to consumer business by 26%, all while focusing on decreasing our inventory and paying down debt. In our Outdoor segment, our focus on Europe and our international global distributor markets, which aren't experiencing the same magnitude of inventory overhangs that the North American market has allowed us to drive constant currency growth in the fourth quarter of 15% in Europe and 7% in our international global distributors. Despite the marketing challenges and significant foreign currency headwinds, our Outdoor segment experienced a 400 basis point gross margin improvement in the fourth quarter due to activities previously outlined around new product introductions, pricing, channel development, sourcing and productivity initiatives. With the lack of microprocessor availability, this has hampered our  brand all year and foreign currency exchange headwinds lowered European sales by $2.3 million in the fourth quarter. Precision Sports sales increased 10% in the quarter to $30.3 million, strength in the international business continued in the fourth quarter as our Precision Sports team continued to do an excellent job in fulfilling demand, increasing production capacity and navigating a challenging sourcing environment. One thing to note, during the fourth quarter, we sold 5 million of nine millimeter ammo at lower margins than normal and that reduced -- we did this in an attempt to reduce inventory and generate cash as the demand for nine millimeter is expected to remain low compared to the supply during 2023. For the first quarter of 2023, we expect consolidated sales to be approximately $95 million, reflecting continued headwinds surrounding unwinding of inventory at our key North American wholesale partners. I think as we look to 2023 and beyond, this being a year that we're not as focused on M&A, which obviously was an area of our bandwidth in the past, is really accelerating the business, new NPI Innovate and Accelerate side along with the operational plans and strategic planning of accelerating the other categories, which we still believe have strong growth."
}