{
    "symbol": "CLAR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 01:11:07",
    "content": " Our second quarter results continued to showcase the value of superfan brands and their superfan communities, so let's summarize a few key highlights: One, we experienced demand and growth across all three segments: Outdoor, Precision Sports and Adventure, as the activity-based consumer continued to chase outdoorism as their escape. Given the continued outperformance in our Precision Sports segment, we are raising our full-year expectations in this business to now grow 16% to approximately $127.5 million. In addition, we still expect full-year capital expenditures of approximately $9 million but free cash flow is now expected to range between $30 million to $40 million for the year -- for the full year of 2022, primarily due to delays in being able to adjust inventory levels back to historical levels. The other side and why we continue to see strong EBITDA in this market, is because we have really focused on this acceleration of our capacity, both within bullets which is the mainstay of our business, right and the target run rate at Sierra of 350-plus million bullets by the end of the year at 120 million-plus at Barnes and then continuing to be as scrappy as we can and being opportunistic as we can in acquiring cases so that we can load ammo, remembering that ammo is 5x the valuations of the consumer as bullets. In the North American market, where we are 10 years behind, you know, 10% of the opportunity today accomplished and we're less than 1% of the market share, that's where we really drive towards accelerating on this and building the retail partnership, building the communication and touchpoints with the consumer and really driving towards what we think is this ever-expanding demand in the overland market. That's about $14 million of higher inventory and that's just necessary, primarily plus Black Diamond but also across the Precision Sports business, as that business has grown significantly this year. And then, we've also -- as we were starting to think about a plan for 2023 and the necessary inventory levels that we're going to need in kind of this uncertain environment that we continue to find ourselves in -- and we don't want we caught flat-footed as we enter '23 -- we're also planning to carry about $10 million more extra inventory going into the year."
}