{
    "symbol": "BTCY",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-14 18:20:07",
    "content": "  Operator: Greetings, and welcome to the Biotricity's Fiscal Third Quarter 2023 Conference Call. Good afternoon, everyone, and welcome to Biotricity's fiscal 2023 third quarter earnings call. As a reminder, Biotricity's third fiscal 2023 quarter ended on December 31, 2022. Today, Biotricity issued its fiscal 2023 third quarter results press release, which highlighted financial results. Before we begin the company's formal remarks, I'd like to remind listeners that today's discussion may contain forward-looking statements that reflect management's current views with respect to future events. Biotricity does not undertake to update any forward-looking statements, except as required. At this point, I'm pleased to turn the call over to Biotricity's Founder and CEO, Dr. Waqaas Al-Siddiq. As I prepared for this call, I reviewed my teleconference notes from our fiscal year 2022 third quarter a year ago, and reminds me how incredibly far we've come in just 12 months. It's easy natural that we momentarily lose sight of this when focusing on the day to day driving marketing initiatives and monitoring ROIs, building sales, interviewing for team expansion, evaluating distributors and negotiating contracts, all while closely watching our cash flow. Just a year ago, we were still finishing and introducing our new products, building out our cloud-based Biosphere, raising capital and training fresh team members. A year ago, we operated in 26 states. Over the past year, with our product launches and service introductions and upgrades, we have increased our total addressable market 35 times from $1 billion to $35 billion. Today, we are recognized as a leader in providing state-of-the-art remote cardiac monitoring devices combined with sophisticated cloud ecosystem for data aggregation and AI capabilities that meet the needs of customers, ranging from cardiologists to consumers, all of whom desire less expensive, more convenient, and deeper data on heart health and wellness. Today, our focus is largely on sales and marketing. And we have achieved an enviable customer retention of about 98%, which reflects the excellence of our proprietary hardware and cloud-based services, as well as our customer service support, which is an often-overlooked component of our success compared with other players in our space. As heart disease is typically chronic, and ultimately progressive, our customer retention rate is a valuable leading indicator for raising our customers' lifetime value. What has not changed in the past year, nor since founding Biotricity, is the passion I and everyone at Biotricity has for this business, to win, to disrupt, to succeed and to positively transform cardiac care, efficacy and outcomes. Strategically, our long-term goal remains unchanged from that stated a year ago. It collects cardiac services within clinics and hospitals into one ecosystem, our Biosphere, so that doctors are using our ecosystem not just to deliver diagnostics, but also for disease management, remote management, and telemedicine all in one place. In short, Biotricity has grown by huge leaps and bounds in the past 12 months, setting us up for increasing growth ahead. Technologically, we are increasingly leaning into AI with its data and predictive capabilities to create better and faster analytics and data delivery, targeting more pervasive forms of patient monitoring and lifestyle management. Over the past three months, our most important strategic development has been the signing of three distribution agreements; with two leading U.S. marketing and distribution partners and one group purchasing organization, otherwise known as a GPO. In total, just in the U.S. alone, they cover over $20 billion in yearly purchasing. While I regret not being able to name them at this time, I can tell you they are names everyone in the industry knows. We are also actively evaluating and, in some cases, negotiating with other medical device distributors that have geographic or vertical coverage that complements our existing distribution networks to further expand our distribution strategy. Additionally, to drive sales, we are actively engaged in marketing initiatives that include highly-targeted advertising, both in social and conventional media, in trade shows and industry conferences, and in direct marketing with our current engaged and prospective physicians, clinics and hospitals. Further, we are selectively adding sales professionals from the top of their field into our team to increase our market coverage and penetration. So, with COVID concerns largely faded, I now expect an increase in our sales team's number of in-person demonstration appointments with physicians and clinic and hospital purchasing managers that will help drive continued growth. In fact, past sequentially flat sales in part reflects a reluctance by clinicians to schedule in-person sales demonstrations. Further, I should add that our name recognition is infinitely higher than it was just one quarter ago, with Time Magazine naming our Bioheart device to its list of the Best Inventions of 2022, and with the prestigious NIH Grant awarded to Biotricity to further expand our technology. For the quarter just ended, revenue of $2.5 million was healthy 27.4% higher than the corresponding quarter of the prior year, up 25% on a year-to-date basis. The flat fee component of our technology-as-a-service subscription, recurring revenue from Biotres and Bioflux are continuing to ramp and grow both in gross terms and as a percentage of total revenue,  (ph) as a percentage of our revenue that we collect immediately after we invoice. Our gross margin in the quarter was 57%, which is in line with our historical average and well above the prior year corresponding quarter of 42.7%, which was affected by a one-time business mix impact that quarter. So, as we gain more granular internal sales and marketing data, we continuously scrutinize and plan for the ROI on our R&D as well as our marketing initiatives. With our suite of state-of-the-art products and services established, we balance our R&D spend with our drive to innovate and lead our industry. In our third fiscal quarter of 2023, we reduced our R&D expense by just under 3% from the year ago quarter to $876,000, following from higher R&D activity earlier in the fiscal year. Doing this, while supporting a 27% larger base of sales, admin and related marketing activity. At the bottom-line, Biotricity narrowed its year-over-year net loss by about one-third from $7.36 million or $0.149 per share to $4.82 million or $0.091 per share. Thank you, John, for that report, and for doing an excellent job managing our finances to reduce cash burn while we build the company and its sales to achieve positive cash flow. Our far higher marketplace name recognition and brand value may be difficult to quantify, but we are seeing it anecdotally in our internal sales and distribution reports from the field. With our recently implemented U.S. distribution agreements covering large slots of the $35 billion market, I'm quite confident of our position and outlook ahead. And the reason we say it's a leading indicator is because our customer retention rate, essentially, we're on a technology-as-a-service model. So, if our retention rate is high, and we continue to close customers, forward looking, it gives us an indication of maintaining that revenue for the 12 months forward looking. And do you have a comparison like maybe from a year ago or probably not, right, because it's... It's a good metric that we should start tracking, and we could probably go historically and do that. But that's a very good point and we'll take it under consideration, and I think that it would be useful for people to see. I know you're not comfortable releasing the names of your distribution partners, the new one, Waqaas, that you spoke to, the three of them. So, they're -- this is early days, and this is why we want to kind of see the traction of the distribution partners first before we start providing more information and guidance on it. So, they're aware of our customer list and we have to -- it's not an unorganized distribution relationship. It's a very organized, tightly integrated relationship. So, we're very excited about it. So, they have some commodity business distribution -- distributors are often selling product that is either a commodity or consumable. And what it gives to us is whereas our sales force is very focused on the cardiology network and specialty groups and the multi-care groups, there is application for cardiac diagnostics beyond those particular areas. Obviously, for those areas, the volume of cardiac studies is lower. And so, partnering with distribution partners that have a much wider scope and a lot more resources to go after the different types of clinics that exist. So, the -- even though the cardiac volume is lower, they have the ability -- they're selling other things in terms of their portfolio. So, it becomes more advantageous for us because those are markets that we weren't even looking at. So, the Holter product and the Bioflux, I can give you a great example, right. Like the GP market, right, the general practitioner market and the smaller clinic, we don't really focus on them simply because they don't have the volume. With the company of our size, we focus on the higher volume, lower hanging fruit, right, which is the cardiac centers, the specialty groups where we have higher volume. And so, that's advantageous for products like Bioflux and Biotres. If you're going into the hospital systems, right, the hospital system, you have to be on contract with them. So, they're using these products across multiple sites and the purchasing and the integration into their ecosystem and that whole aspect of getting on contract is a process. When you have a distributor that is already on contract that can move that product in, they understand how the supply chain works and they've got staff that is supporting that entire ecosystem and all their specialty in sub-clinics, it becomes a much easier and faster sales cycle for us. So, in our case, we can focus on the areas that we have relationships. And where we don't have relationships and the opportunity is -- and the sales cycle is longer, we can let our distributor take the mantle in those cases. We know that post COVID, it's -- everybody talks about how this is the trend. So, we know anecdotally, we know from what we're seeing that there is certainly a shift in the marketplace and that outpatient is the approach. Now, in terms of -- when you look at a market like that, yes, there are people that are getting attracted to the space or looking at it and they're trying to get in. If you look at the number of FDA clearances, the number of FDA filings that we do, we're constantly innovating, and we're upgrading, and we're making changes to our platform and our solution and it's an entire ecosystem. And I think that, that is very clear when you look at some of the awards and accolades that we've got in the space. And we have a lot of data which we are applying from a deep learning from an AI perspective, from optimizing our algorithms. So, it's been a space that we've been in. On the Bioflux side, they're still using a third-party cell phone to communicate through. In the Biotres device, we're seeing tons and tons of patch monitors, but they're all one channel devices. Yes, the customer electrodes are cheap, but it's still a problem in a manufacturing and a whole cycle that you have to deal with. We're focusing on three channels, which provides a better clinical quality and more data. And so, if you -- if everything is equal, a physician will always pick a three-channel device over a one-channel device, because your diagnostic yield is better. And so, if we focus on the clinic clinical aspects and the technical aspects, and we continue to keep our eyes on that, I think we'll continue to succeed. So far, we're a leader and that means that we cannot rest. So, we're seeing the opportunity. We're seeing other people jumping in, but so far, nobody has really come to us and beat us technically. Like, we've been in the market for about four years now. And the reason is because we are technically superior, we're clinically superior, we're constantly updating, and we're also going deeper into the accounts with our product portfolio. Because when we first launched our device, our data sets were based on data that was some clinical data and some data that was provided by the FDA. After hundreds of thousands of patients, we have our data set, which allows us to understand exactly how our algorithms are working with our devices, and we use that to understand and get insights and that allows us to update our algorithms and how that works. Because the more data you throw a physician, the less time they have. So, if you can make it more focused and more accurate, every little bit helps from a scalability perspective. The other area that we look at AI has nothing to do with our device and our technology, it's really about internal automation and making things more seamless and simplified from an internal process level. It is very operational and it's very efficiency oriented, and it's very specific to our business and our workflow and then, of course, to our technology. If there are any other questions that do pop up or that we can help answer, please feel free to reach out to us."
}