{
    "symbol": "BTCY",
    "quarter": 1,
    "year": 2023,
    "date": "2022-08-15 21:24:17",
    "content": " The majority of our revenue for fiscal Q1 2023 continue to come from Bioflux, our high precision single unit mobile cardiac telemetry device, real time monitoring and transmission of the patient's ambulatory ECG diagnostics. And so when you go to the hospital system opportunity, this is why you really need a holter specific solution for that network and with the Biotricity has that and so that's why we are now really looking at that, the Biotres product is truly a product that is designed for the IDN in the hospital system network, just because of the way the physician patient is set up there. Now, with the holter solution, Bioflux, could be used as a holter product, but many of these doctors were still using their commodity holter devices, because those devices are not capable as mobile cardiac comes in, they had already invested or they were using some other holter provider, just because they weren't really generating a lot of revenue of the holter as it was and so the Biotres really provides the same type of model where it actually becomes a profit center. So if you're asking about what is the success rate of mobile cardiac telemetry in a doctor, so if you have 2,000 physicians how, who else is sitting beside you on that shelf, I would say 85 plus percent of those doctors, if we, in their clinic, we control that shelf right now, it takes time, right, so one of our customers, here's a guy, it took us six months to convert, just because it's a very -- was a very big group. And so then they ended up making one, I think they were the first or second customers that came in and so that became a very complementary approach for them, right, where they have got a Bioflux, they're already using the portal, clinic is already familiar with our ecosystem, the Biotres all the same system, same environment, but now that device, and that economic play in terms of rotation device cost plus reimbursement that they're receiving, all of that started lining up just like the Bioflux to do with the MCD."
}