{
    "symbol": "RELX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-08-01 06:25:04",
    "content": " In Risk, underlying revenue growth was 7%, following particularly strong growth of 10% in the first half of last year. Returning to the group level financials, the adjusted income statement shows the constant currency growth of 13% in revenue and 16% in operating profit, which flowed through to growth in profit before tax of 17%. As we entered the second half, momentum remains strong across the group, and we continue to expect full year underlying growth rates in revenue and adjusted operating profit, as well as constant currency growth in adjusted earnings per share, to remain above historical trends. The 4% organic revenue growth that you've seen at both STM and Legal in the first half, a little better I think than most people were expecting. But what's underneath this today, the first half growth rate in Legal is a true improvement in the value of our products, our legal analytics product and our integrated research and analytics offering, which is very well received by our customers that is driving increased uptake and increased usage because of its increased value. Very strong growth in business services, and that's what's continued in the first half this year, even as we were lapping that last year, sort of almost one-off extra boost in the first half. The only thing that you have to take into consideration when you look at the comparison and growth to last year is that we had a period of a few months in the first half last year when you almost had an unusual one-off revenue boost from some exceptional activity in a couple of US little financial services segments that we didn't have before and we didn't have in the second half last year, and we don't have this year. Your question around growth, the way we see it right now is that our run rate in growth right now, second half last year, first half this year, if you just see that, we were lacking that one-off boost for a few months inside business services last year, which created the slightly higher growth last year in the first half. And, therefore, on top of that then, slightly lower relative growth this year, we don't see any reason right now to think that the â\u0080\u0093 what we consider normalized growth rates that we've seen historically in Risk, that we've then been seeing with this little one-off external revenue side, that we've seen now in the first half, we see that right now and we don't see any reason why that should be any different going forward. I think the way you should look at our cost growth in Risk and in the other divisions is that the cost base is really not directly linked to the revenue growth automatically, but we have made a decision that the way we manage our cost base is through constant process innovation, constant looking at alternative ways to use machine learning, AI technology, and other types of tools to keep evolving our cost base as well as we possibly can, so that we free up as much of our cost growth to focus on higher value add for our customers. Because we believe that the real value creation in Risk, when you have a business that's been growing on average 7% to 9% for many years organically, and you have very close to 40% operating margins and 100% cash conversion, very high return on capital, that the objective for us is to add more value to our customers, so that we can sustain our long-term organic growth in this range, in the high-single digits, for many years to come."
}