{
    "symbol": "TWO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 11:37:05",
    "content": "  Operator: Greetings, and welcome to the Two Harbors Investment Corp. Reports Second Quarter 2022 Financial Results Conference Call. Good morning, everyone, and welcome to our call to discuss Two Harbors Second Quarter 2022 Financial Results. Please turn to slide tree, at quarter-end, book value was $5.10 per share, representing a negative 4.7% total economic quarterly return. Following the historic bond market re-pricing in the first quarter, elevated market volatility continued through the second quarter. Inflation continued to exceed expectations, leading the Federal Reserve to accelerate the pace of monetary tightening and, in turn, raising the possibility of a recession. The risk-off sentiment across many asset classes, including mortgages, gathered steam during the quarter, and as a result mortgage performance in the first-half of 2022 ranked among the worst in decades. Entering the year with mortgage spreads standing near record tight levels, we added significantly to our MSR portfolio, while reducing RMBS balances and overall leverage to help protect against spread widening. While those actions significantly reduced losses during the last two quarters, we now find ourselves in the exact opposite situation, with mortgages currently standing at historically wide levels. Despite plenty of uncertainty surrounding the economy, the future path of interest rates and monetary policy, we believe there are significant opportunities in both RMBS and MSR, and we have repositioned our portfolio again to take advantage of the market environment by increasing our RMBS exposure and leverage. With the growth we have experienced in the MSR portfolio, bringing the servicing operations in-house will not only increase efficiencies and returns on our MSR asset, but enable us to better manage recapture and portfolio defense strategies, grow a third-party subservicing business, and position us to capitalize on other opportunities within the mortgage finance space. We will purchase RoundPoint for a preliminary purchase price which is comprised of RoundPoint's tangible net book value plus a premium of $10.5 million, subject to certain post-closing purchase price adjustments. Not included in the transaction will be an MSR servicing exchange, called RPX, and a retail origination platform, each of which RoundPoint will divest of prior to closing. Beyond that, we believe this will enable us to more closely work with our MSR flow sellers and develop deeper partnerships within the industry. Please turn to slide five, during the quarter, inflation continued to trend higher. As shown on figure one, the May and June CPI readings, at 8.6% and 9.1% respectively, marked the strongest annual inflation rate since 1981. As seen in the light gray lines, inflation expectations have consistently underestimated reality, which in turn has caused the Feds to increase the pace of monetary tightening. Indeed, the Fed has raised its benchmark rate by 225 basis points so far this year, including two 75 basis point hikes, one in June and one last Wednesday, which were the largest single-meeting hike since 1994. Chairman Powell has expressed his strong commitment to contain inflation, and the market is pricing in 100 basis points in additional increases which would bring the implied Fed funds rate close to 3.5% by the end of the year, as seen in figure two. As examples, the two-year treasury rate began the quarter at 2.34%, rose 109 basis points to peak at 3.43%, before falling 47 basis points to finish the quarter at 2.96%. As you can see, realized volatility continued to accelerate higher in the second quarter as the market adjusted to incoming economic data. In the last 20 years, only the Great Recession and the pandemic periods have had as much rate volatility as we saw last quarter. Please turn to slide six, in a quarter marked with so much volatility and uncertainty, mortgage performance, unsurprisingly, struggled. The index, which is heavily weighted to lower coupons and represents an unlevered hedge portfolio of RMBS, had negative 97 basis points of excess return for the second quarter, which was the fourth worst quarter in the last 20 years. In combination with the first quarter excess returns of negative 74 basis points, the first-half of 2022 is the fourth worst six-month period in the last 20 years as well. Given the underperformance of mortgages over the last six months, we now see a lot of upside to owning RMBS at these levels. As you can see in figure two, current coupon ZV spreads have moved from around 50 basis points at the start of the year, to 125 basis points at the end of June, and as of the end of July had tightened somewhat. For the ZV spreads approximately 50 basis points over the average of periods when the Fed is not conducting quantitative easing, nominal spreads are very high, and have rarely stayed at levels this elevated for long. However, as you can see in the chart, even option-adjusted spreads were 14 basis points above the average non-QE periods as of the end of June. One way to read this chart, that even if the high interest rate volatility of the second quarter continues mortgages are still cheap and should produce above-average positive returns absent further spread widening. Another important and interesting current market feature is that the range of tradable RMBS coupons has expanded greatly, creating significant relative value investing opportunities. In figure three, we show the OAS and ZV spreads as a function of mortgage duration along the X axis. Low coupons such as   were roughly 300 basis points out of the money and at $86 price as of 6:30, have very little convexity and therefore a very little option cost, meaning that the OAS and ZV spreads are reasonably close to each other. Indeed at the end of June, the ZV of Fannie 2s was 64 basis and the OAS was 41 basis points for a spread of 23 basis points, while Fannie 4.5s, for example, had ZV and OAS of 132 and 35 basis points respectively for a spread of 97 basis. Importantly, the fact that the OASs were similar to the low coupons as of the end of June anyway means that the projected high coupon return shouldnâ\u0080\u0099t be worse even if volatility stays elevated. And if you happen to think of volatility will eventually decline like we do, then there is a significant upside for higher coupons to tighten spread. As a result, we see the relative value offered by higher coupons to be considerable and similar to what it was in March in both ZV and OAS terms. For the second quarter, the Company reported a comprehensive loss of $90.4 million, representing an annualized return on average common equity of -19.1%. Including the $0.17 common dividend, results in a quarterly economic return of -4.7%. Moving on to slide eight, earnings available for distribution was $0.22 per share compared to $0.18 for the first quarter. Finally, our U.S. Treasury futures income was also lower reflecting a larger short position which was used to hedge lengthening mortgage duration. Turning to MSR, net servicing revenue grew by roughly $6.7 million to approximately $76.1 million in conjunction with a larger average MSR portfolio. Turning to page nine, the portfolio yield increased $94 basis points to 4.39% driven by our investment in higher coupon RMBS and higher yield on a larger average MSR portfolio. As noted on the bottom of the slide, beginning with the second quarter, we have incorporated the implied asset yield and financing of TBA. Similar to the first quarter, funding costs for Agency RMBS rose on an absolute basis. As I mentioned earlier, we grew our mortgage exposure during the second quarter deploying capital into RMBS and adding TBA which brought our portfolio leverage to what we would consider to be a neutral position at 6.4 times. With large re-pricing and mortgage spread since the beginning of the year, we felt that the historically cheap valuations currently available in the mortgage market no longer justified the underweight be had been carrying even despite continued market uncertainties. Overall, our specified pool and TBA positions both grew by $1.7 billion respectively as we increased portfolio leverage. During the quarter, we increased our total spec pool and TBA position in 4.5 and 5s coupons by over $7 billion while decreasing our position in 3 through 4 coupons by over $4 billion. Furthermore, after the material widening of lower coupons within the quarter, we increased our position in 2.5s by nearly $0.5 billion. Overall, we view these stories as providing cheap prepayments options with low absolute pay ups and trade at spreads that are wider than TBA. While all mortgages widened during the quarter, lower coupon suffered the most. As tenure rates rose towards 3.5% and mortgage rates approached 6%, a market wide rotation from lower coupons to current coupons caused that part of the stack to underperform 30 to 60 ticks. In contrast, the 3.5 through 5 coupons where our portfolio was positioned for the majority of the quarter fared much better using between 5 and 25 ticks. With most mortgage backed securities now trading at a discount, there is a point to remember that faster speeds are actually a cash flow advantage as more principal is returned at par more quickly. In furtherance of this fact, prepay speeds on TBA collateral are now below 5 CPR in most cases as those coupons reflect newly originated loans whose borrowers are just settling in and are very unlikely to prepay. As seen in Figure 1, our MSR portfolio declined by $3 billion UPB to $229 billion reflecting net portfolio runoff. During the quarter, we entered into agreements to sell roughly $21 billion UPB in the third quarter and intend to deploy the proceeds into historically attractive RMBS. Overall, prepayments speeds on our MSR portfolio declined by 30%, from 14.2 to 10.0 CPR. A moment ago, I told you about how faster speeds are a benefit for mortgage-backed securities, and slower speeds are detriment. For interest-only instruments like MSR, slower speeds are always better than faster speeds. Although, our MSR prepayment speeds are faster than newly-originated TBA collateral, that is just a consequence of having acquired our portfolio over time. The slow TBA speeds, as I mentioned, reflect newly-originated loans, and there just hasnâ\u0080\u0099t been enough time at these new rate levels to generate MSR off of those loans in any real size. Also over time, we will be able to purchase that newer at-the-money MSR, which will also increase our weighted average coupon. We project our portfolio speeds to decline another 20 plus percent to 6.9 CPR, and expect further slowing throughout the third quarter. Through a combination of our RMBS activity and the effect of the large sell-off in rates on our MSR, our exposure to mortgage spreads has increased significantly from where it stood for last quarter, and at the beginning of the year. As seen in the lower right panel, a 25 basis point widening in RMBS spreads would have an impact of negative 7.6%, up in magnitude from negative 2.8% in Q1, and negative 0.8% at the beginning of the year. With no rates on the MSR portfolio being so low, our portfolio coupon is 3.2%, while primary mortgage rates are around 5%. Importantly, when RMBS spreads are normal or tight levels, the offsetting risk of at-the-money MSR is a huge advantage, by reducing volatility with high yielding assets. In this unique period, with RMBS spreads so wide, you see the low sensitivity of the MSR asset as an advantage. We capture the upside if mortgage spreads tighten, while the MSR maintains a steady cash flow with low prepays. Over time, as we add new current coupon MSR, the duration and hedging effects of the MSR will return to normal. Interest rate sensitivity of the portfolio has little changed from the prior quarter, and is very low. With the MSR almost fully extended, it has very little duration, and so, the duration gap between our RMBS and repo must be hedged primarily with interest rate products. A 25 basis point parallel shock up would have an effect of plus 1.1% on book value attributed to the MSR asset, as seen in figure one. The RMBS position on the other hand had its sensitivity increased to minus 9.5%, and so, the rate hedge offset of 8.5% brings the total rate exposure in an up 25 basis point parallel move to a net positive 0.1%. In today's environment, with the Fed in motion, we have been particularly focused on the very front-end of the curve, and we have been very careful to keep exposure in that part of the yield curve as low as possible. In figure three, we show that our sensitivity changes in short-term rates are calculated to be 0.0%, impact the book value in an up 25 basis point there flattening shock. Finally, I would like to discuss our outlook for Two Harbors, and our return expectations for new investments, on slide 16. Projected returns on current coupon pools and TBA are in the mid-teens, having very wide spreads, and stand to benefit the most if and when rate volatility subsides. Despite the uncertainty and near-term drag from volatility seen during the quarter, the longer term outlook for Two Harbors is very positive. Historically, wide mortgage spreads present an excellent opportunity for investment, while the variety of tradeable coupons within the space allows us to take advantage of relative value opportunities. We expect interest rate volatility to eventually subside, and both the MSR and RMBS should benefit when that occurs. The interest rate volatility and the spread volatility of mortgages has continued through the Fed meeting, price performances throughout July has been moving up and down. Mortgage spreads, as you note, have been -- they can be a quarter-point, half-a-point wider one day, and the same tighter the next day. I still see -- well, in certain ways I think the higher coupons are certainly   what we show, both on the ZV and the OAS graph earlier in the presentation, as well as the returns that are on page 16. Please proceed with your questions. And it allows us to enter into the ancillary businesses, as I mentioned, such as subservicing and other ways to partner with our existing seller network and other counterparties in more meaningful ways as well. Please proceed with your questions. RMBS is attractive here, but MSR, having very little spread exposure and interest rate exposure and cash flowing as much as us, is also attractive in a different way with a different risk profile. My own view, obviously everyone can have their own views, but my view is that there's probably more possibility of speeds rising to the slow side than to the fast side here. So, we like having a bunch of servicing with low coupons and deep discounts, and exposed to turnover speeds here. So, when we talk about overall portfolio leverage, it's important to incorporate the amount of MSR that we have in our portfolio at any given time, right. So, more MSR because the leverage in that asset is lower than the leverage in the MBS asset will generally generate a lower overall portfolio leverage, right. But that would be like max overweight kind of thing, which, that's why I say, if you say that's one-and-a-half to two turns higher, go back one-and-a-half to two turns lower, that's what we were when we thought we were maximum underweight, right. Please proceed with your questions. As you point out, we are interested in recapturing other portfolio defense strategies, right, and other ways in which to partner in a complimentary way with our existing servicing seller network and other counterparties. Please proceed with your questions. So, a couple of things on the acquisition, there was question trying to denationalize the size of the acquisition, and it sounds like de minimis book value plus the 10.5 million. So, on an EPS basis we did disclose we expect incremental pre-tax income to be approximately 20 million once our portfolio has fully transferred, which on per share after-tax basis will be $0.45 accretive. And so, you are not going to see us -- and our experience has been, our history has been not that we have moved our capital or moved our MSR balances up and down 50% over any periods of time, it's been steady or growing, we expect that to continue, and as long as that's going to be continuing, then owning your own servicer is going to be more efficient, and more able for us to extract the value of the platform of the borrower on all the ancillary opportunities that we see."
}