{
    "symbol": "RDVT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-08 20:57:05",
    "content": " Now turning to the numbers, for the quarter, total revenue was $13.1 million, a 16% increase over prior year and a record fourth quarter for Red Violet. Platform revenue increased 19% to $12.9 million. We produced $10 million in adjusted gross profit, resulting in adjusted gross margin of 77% in the fourth quarter, up 3 percentage points. Adjusted EBITDA for the quarter was $1.5 million, up 16% over prior year. Our IDI billable customer base grew by 148 customers sequentially from the third quarter, ending the fourth quarter at 7,021 customers. FOREWARN added over 6,900 users during the fourth quarter, ending the quarter at 116,960 users. For the year, revenue increased 21% to $53.3 million, generating adjusted EBITDA of $12.9 million. We grew revenue by over 20% to $53.3 million in 2022, maintaining a 24% adjusted EBITDA margin, which produced $12.9 million in adjusted EBITDA. Platform revenue increased 19% to $12.9 million. We produced $10 million in adjusted gross profit, resulting in a margin of 77% in the fourth quarter, up 3 percentage points. Adjusted EBITDA for the quarter was $1.5 million, up 16% over prior year. Continuing through the details of our P&L, as mentioned, revenue was $13.1 million for the fourth quarter, consisting of revenue from new customers of $1.2 million, base revenue from existing customers of $10.6 million and gross revenue from existing customers of $1.3 million. Our IDI billable customer base grew by 148 customers sequentially from the third quarter, ending the fourth quarter at 7,021 customers. FOREWARN added over 6,900 users during the fourth quarter, ending the quarter at 116,960 users. Adjusted gross profit increased 20% to $10 million, producing an adjusted gross margin of 77%, a 3-percentage-point increase over fourth quarter 2021. The $7.1 million in general and administrative expenses for the quarter consisted primarily of $4.1 million of employee salaries and benefits, which included year-end bonuses as part of our companyâ\u0080\u0099s discretionary bonus plans, $1.4 million of non-cash share-based compensation expense and $0.9 million in accounting, IT and other professional fees. We generated $12.5 million in cash from operating activities for the year ended December 31, 2022, compared to generating $8.9 million in cash from operating activities for the same period in 2021. Cash used in financing activities was $6.1 million for the year ended December 31, 2022, mainly the result of two items; one, acquiring approximately 252,000 shares of company stock for $5.2 million from the net share tax settlement of employee restricted stock units; and two, purchasing 50,000 shares of company stock for $0.9 million under our stock repurchase program at an average price of $17.52 per share."
}