{
    "symbol": "NMM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 13:12:03",
    "content": " Four of the vessels are charted out for five years at an average net daily rate of $25,971, generating revenues of approximately $190 million. We have given the option to an investment grade counterparty to charter the vessels for five years at a net rate of $27,798 per day, plus additional five one year options at increased rates. We also contracted two of the LR2 Aframax vessels for five years at a net daily rate of $25,576 generating almost $95 million in contracted revenue. We also capitalized on the strength of the tanker market chartering eight product tankers for an average net daily rate of $24,045 and an average duration of 1.8 years providing contracted revenue of $125 million. On the chartering front, we created $112.6 million contracted revenue by chartering three of our cape size new building vessels for five years at an average net daily rate of $20,567. Moving to the earnings highlights in Slide 14, total revenue for the third quarter of 2022 increased by 41% to $322.4 million, compared to $228 million for the same period in 2021. Net income for Q3 2022 increased by 59% to $257.2 million, compared to $162.1 million for the same period in 2021. For the nine month period ended September 30, 2022, revenue is understated because of a $30.1 million adjustment requires for accounting purposes due to the straight line effect of containerships charters with de-escalating rates. The overall increase in revenue was a result of a 72% increase in available days to 35,394 compared to 20,521 for the same period in 2021 and an 8% increase in the fleet average TCE rate to $22,717 per day compared to $20,991 per day for the same period in 2021. In terms of sector performance, TCE rates increased 39% for containers to $30,486 and 18% for tankers to $17,834. EBITDA for the nine month period ended September 30, 2022 increased by 43% to $611 million compared to $426.2 million for the same period last year. Net income for the nine month period ended September 30, 2022 increased by 16% to $461 million compared to $398.6 million for the same period last year. In September 2022, we signed an $86.2 million credit facility with European bank financing two containers for delivery in 2023 at SOFR + 2%, and we completed the bareboat agreement at an effective fixed rate of 5.5% for the financing of one newbuilding Capesize for delivery in 2023. Currently, weâ\u0080\u0099re completing our first export credit agency facility for $161.6 million, financing four containers for delivery 2023 and 2024 at SOFR + 1.7% and the financing of a 2016 built Kamsarmax at Libor + 2%."
}