{
    "symbol": "NMM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 13:10:25",
    "content": " Pro forma for the acquisition of the 36 vessel fleet discussed by Angeliki, we have fixed 51.3% of an estimated 28,800 available days at an average rate of $28,966 per day. For the second half of 2022, contracted revenue exceeds total cash expenses by almost $19 million, and we have 13,997 available days with market exposure, providing additional operating costs. We then held our investment by entering into long-term credit worth of charter, generating about $710 million in contracted revenue for the 5.2 years duration of the related charters, providing an expected unlevered yield of 17.5%. The vessels have been chartered for 20 years at an average rate of $4,288 net per day, generating approximately $370 million in revenue. Two of the vessels are charted out for 5 years at an average year of $25,576 per day, generating revenues of approximately $93 million, providing expected unlevered return yield of about 10%. The increase in revenue was a result of a 56% increase in our available days to $11.269 compared to 7,242 for the same quarter last year and a 17% increase in the PC average rate to 2,823 per day compared to 20,296 per day for the same period in 2021. Net income for Q2 2022, increased by 18% to $118.2 million compared to $99.9 million for the same period in 2021. The increase in revenue was a result of a 96% increase in our available days to 22,497 million compared to 11,494 for the same period in 2020 and a 21% increase in the fleet time charter equivalent to 22,100 day compared to 2018 to $276 per day for the same period in 2021. EBITDA of Navios Partners for the six-month period ended June 30, 2021, was adjusted by $125 million gain from one-off non-cash items, while there were no such adjustments for the first six months of 2022. EBITDA for the first half of 2022 increased by 133% to $289.6 million compared to â\u0082¬124.1 million, adjusted EBITDA for the same period in 2021. Net income for the six-month period ended June 30, 2022, increased by 82% to $203.8 million, compared to $111.7 million adjusted net income for the same period last year. We are currently in documentation phase for an $86 million facility with a European bank, which finances two containers delivering in the second half of 2023 at an interest rate of SOFR plus 2%."
}