{
    "symbol": "NMM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 07:50:05",
    "content": " Moreover we have $2.8 billion in contracted revenue over approximately 35,500 available days for the remaining nine months of 2022, almost half are exposed to market rates. First result to 16-year-old vessels for $220 million, and second we had $620 million investment in ten new 5600 TEU containerships by entering into long-term credit working charters for these vessels. In the first quarter of 2022, NMM generated $236.6 million in revenue, $126.1 million in EBITDA, and $85.7 million in net income. The newbuilding VLCC acquired in 2020 delivering into our fleet in July 2022 was fixed on a two-year variable charter to an investment-grade rated Japanese oil major at a floating rate with a floor of $22,572 per day and a ceiling of $29,700 net per day. Our contracted revenue exceeds total cash expenses by almost $70 million, and we still have 15,829 days with market exposure that will provide additional operating cash. As per our chartering activity, we chartered out the newbuilding VLCC delivering in July 2022 on a bare boat basis for a period of approximately two years at a floating rate based on index with a floor of $22,572 and a ceiling of $29,700 net per day. We chartered out one 4250 TEU containership for approximately 5.2 years at an average net rate of $40,743 per day, generating approximately 76 million of contracted revenue. For the three months period ended March 31, 2021, EBITDA was affected by $124.9 million of one-off non-cash items. The increase in EBITDA was primarily due to an increase in revenue, partially mitigated by 50.2 million increase in vessel operating expenses, a $14.6 million increase in time charter and voyage expenses, and $9 million increase in general and administrative expenses, and $4.9 million increase in direct vessel expenses excluding amortization of deferred drydock's special survey costs and other capitalized items, and $0.9 increase in other expense net. Net income for the three month period ended March 31, 2022, amounted to $85.7 million as compared to $11.8 million adjusted net income for the same period last year. Our cash position has been mainly affected by the following items: $126.1 million EBITDA, $82.7 million working capital movement in accordance with a management agreement mainly relating to our tanker fleet, $19 million payment for our newbuilding vessels, $54.5 million net payments on our loan facilities and interest payments, $12.1 million payment for drydocks in additions to vessels, and $12.1 million payment relating to claims to be settled by insurances in future periods. So the containership and dry bulk markets remain firm, tanker rates are on the rise and NMM has $2.8 billion in contracted revenue and yet at $0.05 the distribution was just 1.8% of quarterly EPU, with units trading well below NAV."
}