{
    "symbol": "CMPR",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-26 12:35:03",
    "content": " As we outlined back in our September Investor Day, the fiscal year results for this year, we're going to be characterized by margin compression in the first half of the year as we annualized the impact of cost inflation that accelerated in the second half of last year also as we annualized the impact of last year's investments in Vista and we experienced some unfavorable shifts in our product mix from a margin perspective. And over the remainder of the fiscal year, we're going to be comping last year's Vista site migrations to our new tech platform in large markets like the U.S., like in France and Germany that we expect to support higher year-over-year growth as well. That said, gross profit did weigh on our year-over-year results and it's still impacted by both increased input costs net of the pricing increases that we've taken as we're still lapping cost increases that accelerated in the second half of last year. So for Vista, in addition to increased input costs year-over-year, as I mentioned before, gross margins were impacted by product mix as we had constant currency decreases in consumer and in digital product bookings, which represented a combined $7 million decline. One thing, Sean, and you can jump in and correct me if I'm wrong, but I think there was a thing I mean you just mentioned a moment ago that performance advertising, we've limited â\u0080\u0093 pulled back last quarter, it was 13% in the quarter versus 16% the year before. In Vista, of course, our largest business, thatâ\u0080\u0099s where weâ\u0080\u0099ve seen the most net impact, the timing of the ramp-up in those cost increases we talked about last year coincided with our technology migration that weâ\u0080\u0099re doing, some of our largest markets that delayed when we could start to put those pricing benefits in market. Well, I think in terms of this year, and there was a prior question about being above 5% constant currency growth in Vista this quarter, which is our prior guidance, and I said that was still the case. And also I think in terms of the why I go back to what I said in reference to a one of the recent questions, like I think the why here really is that weâ\u0080\u0099re committed to EBITDA expansion, weâ\u0080\u0099re committed to delivering, and we canâ\u0080\u0099t just rely on revenue growth, which is subject to factors that some of which are outside of our control. So the you know, if, just kind of going back to that picture of what FY 2023 was planned to look like in terms of first half of the year margin impression, second half of the year as we exit, EBITDA expansion if you think about that and would apply it to our liquidity also to our leverage, like he was always our expectation that weâ\u0080\u0099d have increasing leverage in the first and second quarter and then we would start to march down that curve."
}