{
    "symbol": "SFIX",
    "quarter": 2,
    "year": 2023,
    "date": "2023-03-07 23:09:07",
    "content": " And then maybe can you double click a little bit on your EBITDA margin guide of negative $5 million to positive $5 million and just help us that how you get there, obviously, I think you said gross margin should be around 42%, which really only leaves advertising sales and marketing and G&A as the other components. On kind of the focus and clarity, I think thereâ\u0080\u0099s, thereâ\u0080\u0099s innumerable examples that I could bring, I think, just at a very high level, as we thought about expanding the business and very ambitious way, we took a marketing approach that, that probably tried to bring people in to a variety of different customer segments. And so, I think a lot of what weâ\u0080\u0099ve been talking about internally is just how can we make sure that everything that we are doing with our valuable resources and time are really focusing again, delivering that for our clients and ultimately our shareholders and being able to deliver an experience that feels personalized for all of our clients and making sure that everything that we invest in achieves that goal. And so we â\u0080\u0093 I think weâ\u0080\u0099re able to do is to fine tune, I guess a little bit more at a more personalized level of where weâ\u0080\u0099re going to be deploying Fix Preview to be able to maintain that benefit that you mentioned, to keep rate an AOV for the populations for whom we know that that will occur, while at the same time reducing cancellations and making sure that we are retaining and engaging clients that in all of our cohorts by eliminating Fix Preview from those who we donâ\u0080\u0099t think will benefit from it. And I think the marketing team has done a tremendously good job of diversifying the channels, but then focusing on the efficiency and making sure weâ\u0080\u0099re bringing in the right clients, which we feel very good about. Thereâ\u0080\u0099s some macro headwind, but Iâ\u0080\u0099m not willing to accept that itâ\u0080\u0099s all macro, I think there are still opportunities for us to improve the customer journey for us to improve the ways that weâ\u0080\u0099re serving our clients so that they can have the best possible experience that then leads to LTV, it leads to shareholder value. I mean, weâ\u0080\u0099re always evolving to experience and so at a very high level like I really donâ\u0080\u0099t see a big foundational shift in the strategy I think the strategy of focusing on personalization and focusing on styling and focusing on the areas that we know are valuable areas of differentiation for our client, I think itâ\u0080\u0099s hard to imagine that we would deviate from that. But I would say that the investing is more around thinking more holistically around, what is the Fix â\u0080\u0093 what is the Stitch Fix ecosystem and how do all these pieces fill in together in order to drive the best LTV and experience for our clients, but then also, of course delivering results for our shareholders. I think just really being able to focus on the things that we already know that we are able to deliver on that we have a business thatâ\u0080\u0099s 10-plus-years-old, that has a history of profitability delivering on this business to be able to focus back on the things that we know and know that we can deliver is kind of the core thesis. And so I would say our hypothesis is that our existing clients that are in this ecosystem are relatively stable, like I think they are probably the headwinds a little bit on the customer acquisition side that hopefully, if things led-up, and as we see things turn up the other way that will alleviate and make things easier for us."
}