{
    "symbol": "MNST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 20:30:23",
    "content": " The company achieved record third quarter net sales of $1.62 billion in the 2022 third quarter, 15.2% higher than net sales of $1.41 billion in the 2021 comparable period and 20.2% higher on a foreign currency adjusted basis. During the 2022 third quarter, the company experienced a significant increase in cost of sales relative to the comparative 2021 third quarter, primarily due to increased ingredient and other input costs, including secondary packaging materials and increased co-packing fees, increased logistical costs, increased aluminum can costs and geographical and product sales mix. As a percentage of net sales, operating expenses for the 2022 third quarter were 25.6% compared to 24.4% in the 2021 third quarter and 24.5% in the 2019 third quarter pre-COVID. Distribution expenses for the 2022 third quarter increased to $83 million, which is an increase of 27.1% or 5.1% of net sales compared to $65.3 million or 4. Due to continued cost pressures, the company implemented a net sales price increase in the range of 6% market-wide in the United States, effective September 1, 2022. Sales of the company's energy brands, which include Reign, increased 11.8% in the 4-week period in the convenience and gas channel. According to Nielsen, for the 4 weeks ended October 22, 2022, the company's market share of the energy drink category in the convenience and gas channel, including energy shots, in dollars increased 0. According to Nielsen, for the 4 weeks ended October 22, 2022, sales in dollars of the coffee plus energy drink category, which includes our Java Monster line in the convenience and gas channel increased 11.4% over the same period the previous year. Sales of Starbucks Energy were 17.4% higher, Java Monster share, including Java Monster 300 and Java Monster Nitro Cold Brew of the coffee plus energy category, which primarily includes Java Monster, Java Monster 300, Java Monster Nitro Cold Brew, Starbucks Doubleshot and Tripleshot, Rockstar Roasted and Bang Keto Coffee for the 4 weeks ended October 22, 2022, was 52.1%, down 0.5 point, while Starbucks Energy share was 46.9%, up 2.4 points. According to Nielsen, in all measured channels in Canada, for the 12 weeks ended October 8, 2022, the energy drink category increased 15.8% in dollars. According to Nielsen, for the month of September 2022 compared to September 2021, Monster's retail market share in value increased in Argentina from 47.9% to 51.7%, and in Brazil from 37.7% to 41. According to Nielsen, in the 13-week period ending September 11, 2022, Monster's retail market share in value and as compared to the same period the previous year grew from 27.4% to 27. According to Nielsen, in the 13-week period until the end of August 2022, Monster's retail market share in value as compared to the same period the previous year grew from 15% to 18.1% in the Czech Republic; from 15.3% to 15.6% in Germany; from 28. According to Nielsen, in the 13-week period until the end of August 2022, Predator's retail market share in value as compared to the same period the previous year grew from 17.4% to 29.6% in Kenya; and from 11.9% to 17% in Nigeria. According to IRI in Australia, Monster's market share in value for the 4 weeks ending October 16, 2022, increased from 14.2% to 14.8% as compared to the same period the previous year. According to IRI in New Zealand, Monster's market share in value for the 4 weeks ended October 9, 2022, increased from 12.8% to 12.9% as compare to the same period the previous year. According to INTAGE in Japan, in the month ending September 2022, Monster's market share in value in the convenience store channel as compared to the same period the previous year grew from 53.9% to 55%. According to Nielsen in South Korea, in the month ending September 2022, Monster's market share in value in all outlets combined as compared to the same period the previous year increased from 60.4% to 61.5%. In EMEA, net sales in the 2022 third quarter increased 14.1% in dollars and increased 30.4% in local currencies over the same period in 2021. Gross profit in this region as a percentage of net sales for the third quarter was 34.7% compared to 37.7% in the same quarter in 2021, and compared to 26.7% in the second quarter of 2022. In Asia Pacific, net sales in the 2022 third quarter decreased 13.9% in dollars and decreased 1.5% in local currencies over the same period in 2021. 4% versus 43.5% over the same period in 2021, due in part to a product supply issue with an ingredient that impacted a number of our products in Japan, but which has now been resolved, net sales in the 2022 third quarter decreased 35.8% in dollars and decreased 21.2% in local currency. In South Korea, net sales decreased 8% in dollars but increased 4.4% in local currency as compared to the same quarter in 2021. In Latin America, including Mexico and the Caribbean, net sales in the 2022 third quarter increased 63.8% in dollars and increased 74.7% in local currencies over the same period in 2021. One, consumer demand remains solid, even with the pricing actions that have been taken in 2022; two, the company has increased its raw material and finished product inventories to better service its customers and ensure availability of its products; three, our AFF flavor facility in Ireland is now providing a large number of flavors to our EMEA region, enabling better service levels and lower landed costs to our EMEA region; four, we are pleased with the new additions to the Monster Energy portfolio; five, we are particularly excited for the launch of Monster Energy Zero Sugar in January 2023 in the United States."
}