{
    "symbol": "MNST",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 20:54:06",
    "content": " The company achieved record fourth quarter net sales of $1.51 billion in the 2022 fourth quarter, 6.2% higher than net sales of $1.43 billion in the 2021 comparable period and 11.9% higher on a foreign currency adjusted basis. The decrease in gross profit as a percentage of net sales for the 2022 fourth quarter as compared to the 2021 fourth quarter was primarily the result of: one, increased ingredients and other input costs, including secondary packaging materials and increased co-packing fees; two, geographical and product sales mix; and three, increased logistical costs. Gross profit as a percentage of net sales, excluding gross profit for the company's Alcohol Brands segment increased on a sequential quarterly basis to 52.5% in the 2022 fourth quarter from 51.9% in the 2022 third quarter. We estimate that of the increasing costs of sales in the 2022 fourth quarter, approximately $60 million, was comprised of one, approximately $39.6 million due to increased ingredient and other input costs, including primary and secondary packaging materials and increased co-packing fees; two, approximately $12.5 million due to geographical and product sales mix; and three, approximately $7.9 million due to increased logistical costs. As a percentage of net sales, operating expenses for the 2022 fourth quarter were 25.8% compared with 24.9% in the 2021 fourth quarter and 28.9% in the 2019 fourth quarter pre-COVID. According to the Nielsen reports for the 13 weeks through February 11, 2023, for all outlets combined, namely convenience, grocery, drug, mass merchandisers, sales in dollars in the energy drink category including energy shots increased by 13.1% versus the same period a year ago. According to Nielsen, for the four weeks ended February 11, 2023, sales in dollars in the energy drink category in the convenience and gas channel, including energy shots, in dollars, increased 15.1% over the same period the previous year. According to Nielsen, for the four weeks ended February 11, 2023, the company's market share of the energy drink category in the convenience and gas channel, including energy shots in dollars, decreased from 37.1% to 37%. According to Nielsen, for the four weeks ended February 11, 2023, sales in dollars of the coffee plus energy drink category, which includes our Java Monster line in the convenience and gas channel, increased 6.2% over the same period the previous year. According to Nielsen for the month of December 2022 compared to December 2021, Monster's retail market share in value increased in Argentina from 43% to 53.5%, in Chile, from 34.5% to 41.7%. According to Nielsen, in the 13-week period until the end of January 2023, Monster's retail market share in value as compared to the same period the previous year, grew from 14.2% to 15.2% in Belgium, from 30.7% to 31.8% in France from 29.5% to 31% in Great Britain, from 27.3% to 32.7% in Norway, from 27.7% to 27.8% in the Republic of Ireland, from 38.6% to 40.4% in Spain and from 15.1% to 16.5% in Sweden. According to Nielsen, in the 13-week period until the end of December 2022, Monster's retail market share in value as compared to the same period the previous year grew from 16.3% to 18.4% in the Czech Republic from 26.5% to 27.8% in Denmark and from 27.6% to 13.5% in Italy. According to IRI in Australia, Monster's market share in value for the four weeks ending January 29, 2023, increased from 13.1% to 16.1% as compared to the same period the previous year. According to IRI in New Zealand, Monster's market share in value for the four weeks ended January 22, 2023, and remained at 13% as compared to the same period the previous year. According to INTAGE in Japan in the month of ending December 2022, Monster's market share in value in the convenience store channel as compared to the same period the previous year grew from 53.7% to 54.7%. According to Nielsen in South Korea in the month ending December 23 to Monster's market share in value in all after it's combined as compared to the same period the previous year, increased from 60.2% to 64.2%. Net sales to customers outside the US were $542.5 million, 35.9% of total net sales in the 2022 fourth quarter compared to $508.1 million or 35.7% of total net sales in the corresponding quarter in 2021. In EMEA, net sales in the 2022 fourth quarter decreased 2.3% in dollars, but increased 14.7% in local currencies over the same period in 2021. Gross profit in this region as a percentage of net sales in the fourth quarter, was 33.9% compared with 32.6% in the same quarter in 2021 and compared to 34.7% in the third quarter of 2022. In Asia-Pacific, net sales in 2022 fourth quarter increased 0.5 point in dollars and increased 20.6% in local currencies over the same period in 2021. Due in part to a product supply issue with an ingredient that impacted a number of our products in Japan, but has now been resolved, net sales in the 2022 fourth quarter decreased 14.4% in dollars, but increased 10% in local currency. In Latin America, including Mexico and the Caribbean, net sales in the 2022 fourth quarter increased 45.2% in dollars and increased 57.7% in local currencies over the same period in 2021. In Brazil, net sales in the 2022 fourth quarter increased by 19.9% in dollars and 16.6% in local currency. Net sales in Chile increased 1% in dollars, but increased 16% in local currencies in the 2022 fourth quarter."
}