{
    "symbol": "MNST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 21:54:02",
    "content": " The company achieved record second quarter net sales of $1.66 billion in the 2022 second quarter, 13.2% higher than net sales of $1.46 billion in the 2021 comparable period and 16.9% higher on foreign currency adjusted basis. During the 2022 second quarter, the company experienced a significant increase in cost of sales relative to the comparative 2021 second quarter, primarily due to increased freight rates and fuel costs, including costs relating to the importation of aluminum cans, increased ingredient and other input costs, including secondary packaging materials and increased co-packing fees, increased aluminum can costs attributable to higher aluminum commodity pricing, geographical and product sales mix and production inefficiencies. The company estimates that of the increase in cost of sales in the 2022 second quarter of $250.3 million, approximately $164.4 million was comprised of; one, approximately $66.7 million due to increased freight rates and fuel costs, including costs relating to the importation of aluminum cans; two, approximately $45.9 million due to increased ingredient and other import costs, including secondary packaging materials and increased co-packing fees; three, approximately $27.5 million due to increased aluminum can costs attributable to higher aluminum commodity pricing; four, approximately $15.1 million due to geographical and product sales mix; and five, approximately $9.2 million due to production inefficiencies. Distribution expenses for the 2022 second quarter increased to $87.9 million, which is an increase of 36% or 5.3% of net sales, compared to $64.6 million or 4.4% of net sales in the 2021 second quarter and 3.4% of net sales in the 2019 second quarter pre-COVID. According to the Nielsen reports, for the 13 weeks through July 23, 2022, for all outlets combined, namely convenience, grocery, drug, mass merchandisers, sales in dollars in the energy drink category, including energy shots, increased by 8.2% versus the same period a year ago. According to Nielsen for the four weeks ended July 23, 2022, sales in dollars in the energy drink category in the convenience and gas channel, including energy shots in dollars increased 6.6% over the same period the previous year. Sales of the companyâ\u0080\u0099s energy brands, which include Reign, increased 5.6% in the four-week period in the convenience and gas channel, sales of Monster increased by 6.4% over the same period versus the previous year, Reign sales increased 0.9%, NOS was down 1.8% and Full Throttle was down 2.5%. According to Nielsen for the four weeks ended July 23, 2022, the companyâ\u0080\u0099s market share of the energy drink category in the convenience and gas channel, including energy shots in dollars decreased 0.4 point to 36.1%. According to Nielsen for the four weeks ended July 23, 2022, sales in dollars of the coffee plus energy drink category, which includes our Java Monster line in the convenience and gas channel increased 4.4% over the same period the previous year. According to Nielsen for the month of June 2022, compared to June 2021, Monsterâ\u0080\u0099s retail market share in value increased in Argentina from 46.9% to 49.2%. According to Nielsen for the month of June 2022 compared to June 2021, Monsterâ\u0080\u0099s retail market share in value increased in Brazil from 35.7% to 39.9%. According to Nielsen in the 13-week period ending July 17, 2022, Monsterâ\u0080\u0099s retail market share in value as compared to the same period the previous year, grew from 25.8% to 31.6% in France from 27.8% to 32.1% in Norway and from 37.6% to 39.7% in Spain. According to Nielsen in the 13-week period until the end of June 2022, Monsterâ\u0080\u0099s retail market share in value as compared to the same period the previous year grew from 15.3% to 16% in Belgium, from 15. According to Nielsen in the 13-week period ended June 19, 2022, Monsterâ\u0080\u0099s retail market share in value as compared to the same period the previous year, grew from 14.5% to 15.6% in Sweden, Monsterâ\u0080\u0099s retail market share in value compared to the same period the previous year declined from 8.5% to 6.6% in the Netherlands and from 29.3% to 28.1% in the Republic of Ireland. According to Nielsen in the 13-week period until the end of May 2022, Monsterâ\u0080\u0099s retail market share in value as compared to the same period the previous year grew from 15% to 17.5% in the Czech Republic and from 37.9% to 38.7% in Greece. According to Nielsen in the 13-ewek period ending May 22, 2022, Monsterâ\u0080\u0099s retail market share in value as compared to the same period the previous year grew from 25.7% to 27.5% in Denmark. According to Nielsen in the 13-week period until the end of May 2022, Predatorâ\u0080\u0099s retail market share in value as compared to the same period the previous year grew from 17.1% to 26.8% in Kenya and from 8.1% to 15.4% in Nigeria. According to IRI in Australia, Monsterâ\u0080\u0099s market share in value for the month ending July 3, 2022, increased from 13.2% to 14.2% as compared to the same period the previous year. According to IRI in New Zealand, Monsterâ\u0080\u0099s market share in value for the four weeks ended July 10, 2022, increased from 12.4% to 12.6% as compared to the same period the previous year. According to INTAGE in Japan, in the month ending June 2022, Monsterâ\u0080\u0099s market share in value in the convenience store channel as compared to the same period the previous year grew from 50.6% to 56.7%. Net sales to customers outside the U.S. were $649 million, 39.2% of total net sales in the 2022 second quarter, compared to $546.3 million or 37.4% of total net sales in the corresponding quarter in 2021. In EMEA, net sales in the 2022 second quarter increased 13.8% in dollars and increased 26.8% in local currencies over the same period in 2021. In Asia-Pacific, net sales in the 2022 second quarter decreased 1.1% in dollars and increased 8.2% in local currencies over the same period in 2021. In Japan, net sales in the 2022 second quarter decreased 9.6% in dollars and increased 3.3% in local currency. In Latin America, including Mexico and the Caribbean, net sales in the 2022 second quarter increased 66.7% in dollars and increased 69.7% in local currencies over the same period in 2021. In Brazil, net sales in the 2022 second quarter increased by 8.8% in dollars and 63.9% in local currency."
}