{
    "symbol": "FC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-01-06 20:36:05",
    "content": " Forward-looking statements are based upon management’s current expectations and are subject to various risks and uncertainties, including, but not limited to, the ability of the Company to stabilize and grow revenues; the acceptance of and renewal rates for our subscription offerings, including the All Access Pass and Leader in Me memberships; the duration and recovery from the COVID-19 pandemic; the ability of the Company to hire productive sales professionals; general economic conditions; competition in the Company’s targeted marketplace; market acceptance of new offerings or services and marketing strategies; changes in the Company’s market share; changes in the size of the overall market for the Company’s product; changes in the training and spending policies of the Company’s clients and other factors identified and discussed in the Company’s most recent annual report on Form 10-K and other periodic reports filed with the Securities and Exchange Commission. As you can see, as I mentioned there, in the first quarter, subscription revenue grew 31% or $6.7 million to $28.4 million and for the latest 12 months it grew 22% or $19.1 million to $106.2 million. As you can see, total subscription and subscription services revenue in the first quarter grew 32% or $10.8 million to $43.9 million and for the latest 12 months grew 31% or $39.4 million to $168 million. And revenue for the latest 12-month period through the first quarter, grew 26% or $48.9 million to $237.1 million, benefited partially from the fact that last year’s first quarter was impacted by the pandemic. As shown in slide 8, adjusted EBITDA for the first quarter increased $6.2 million, or 167% to $9.9 million, compared to $3.7 million in the first quarter of FY21. While pandemic-related challenges continue in Japan and in certain licensee locations, resulting in our total international direct office and licensee revenue still being somewhat below that -- those that we achieved in fiscal 2020 first quarter, we’re pleased that overall revenue in our international direct offices in the first quarter grew 24%, compared to the first quarter of fiscal 2021 and grew 36% for the latest 12-month period. This increase in new and retained schools, together with an increase in the number of coaching and training days delivered compared to last year’s first quarter drove strong performance in the Education Division, where revenues grew $4.2 million or 56% in the first quarter to $11.7 million compared to $7.5 million in the first quarter of fiscal 2021. Adjusted EBITDA in the Education Division in the first quarter increased $2.5 million to $200,000 compared to an adjusted EBITDA loss of $2.3 million last year’s first quarter. As shown in slide 12, our total subscription and subscription services sales grew 32% in the first quarter to $43.9 million, an increase of $10.8 million compared to $33.2 million subscription and subscription services revenue in the first quarter of fiscal 2021. For the latest 12 months through the first quarter, subscription and subscription services sales grew 31% or $39.4 million to $168 million. The sum of our billed and unbilled deferred revenue also grew substantially in the first quarter, increasing 24% or $23.7 million to $121.1 million compared to $97.4 million at the end of the first quarter of fiscal 2021. Our balance of deferred subscription revenue grew 19% or $10.8 million to $67.8 million in the first quarter compared to $56.9 million last year’s first quarter, and our unbilled deferred revenue grew 32% or $12.9 million to $53.4 million compared to a balance of $40.5 million in last year’s first quarter, reflecting the significant ongoing increase in the percent of our All Access Pass contract and contract value now represented by multiyear contracts. As shown in slide 13, in the Enterprise Division, All Access Pass subscription and subscription services sales in the first quarter grew 27% or $7.1 million to $33.1 million compared to $26 million in the first quarter of fiscal ‘21. And for the latest 12-month period through the first quarter, All Access Pass subscription and subscription services sales grew 29% or $26.7 million to $119.7 million compared to $93 million for the same latest 12-month period last year. As shown in slide 14 in the Education Division, in the first quarter, Leader in Me subscription and subscription services sales grew 51% or $3.6 million to $10.8 million, compared to $7.1 million in the first quarter of fiscal ‘21. For the latest 12-month period through this year’s first quarter, subscription and subscription services sales in the Enterprise Division grew 36% or $12.7 million to $48.3 million, up from $35.6 million for the same latest 12-month period last year. As shown in slide 16, for the latest 12-month period through this year’s first quarter, subscription and subscription services sales grew 31% to $168 million, representing $70.9 million of total latest 12-month sales of $237.1 million. For example, in North America, for the latest 12 months through this year’s first quarter, All Access Pass subscription and subscription services accounted for 84% of sales, and this is expected to increase to approximately 90% of sales over the next three years. As shown in slide 17, All Access Pass subscription and subscription services sales represented only 13% or $13.7 million of total sales in North America in 2016, when we first introduced All Access Pass. This dramatic, sustained, compounded growth since then has resulted in All Access Pass subscription and subscription service sales for the latest 12 months through this year’s first quarter growing to $104.9 million North America. As you can see there on the right side of slide 17, from having no subscription sales at all in these offices just five years ago, All Access Pass subscription and subscription service sales for the latest 12-month period through this year’s first quarter now account for 83% of total sales in the UK and 72% in Australia. Obviously, we recognize that with our strong first quarter performance, our latest 12-month adjusted EBITDA of $34.2 million would already put us within our full year guidance range, even without any further year-over-year improvement in adjusted EBITDA for the rest of the year. Maybe I’d just note that as you look at this report and the ongoing strength of the business, recognize that six years ago when we made the decision to transition the Company’s business to -- model to subscription, we expected, first, it would allow us to significantly increase our importance to our customers that it would be reflected in the significant increase in the lifetime value of our customers; second, it would allow us to increase both the scale, durability and visibility of our revenue; third, that it would drive increases in our gross margins, profitability and cash flow; and finally, that it would really allow us to unleash the collective passion, capabilities and dedication to our clients and our people."
}