{
    "symbol": "FC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-05 22:41:09",
    "content": " Forward-looking statements are based upon management's current expectations and are subject to various risks and uncertainties, including, but not limited to, the ability of the company to stabilize and grow revenues, the acceptance of renewal rates of our subscription offerings, including the All Access Pass and Leader in Me memberships, the duration and recovery from the COVID-19 pandemic, the ability of the company to hire productive sales professionals, general economic conditions, competition in the company's targeted marketplace, market acceptance of new offerings or services and marketing strategies, changes in the company's market share, changes in the size of the overall market for the company's products, changes in the training and spending policies of the company's clients and other factors identified and discussed in the company's most recent annual report on Form 10-K and other periodic reports filed with the Securities and Exchange Commission. Our revenue growth for fiscal '22 was especially strong increasing 17% to $262.8 million and the 17% growth benefited somewhat by comping against COVID-related quarters in the first and second quarters but also reflected the impact of COVID-related lockdowns and restrictions in China and Japan, both of which extended over the fiscal second and third quarters and even into a portion of the fourth quarter and also by the impact of foreign exchange. Also, as you can see shown in Slide 4, total subscription and subscription services revenue grew 29% in fiscal '22 and increased 23% in the fourth quarter, with All Access Pass subscription and subscription services revenue growing 28% for the year and 26% in the fourth quarter and Leader in Me subscription and subscription services revenue growing 29% for the full fiscal year and 18% in the fourth quarter. As you can see as shown in Slide 4, our year-end balance of deferred subscription revenue billed and unbilled increased 20% over last year's fourth quarter or $26 million to $153.4 million. And as shown in Slide 5, in our North America Enterprise operations, the percent of our All Access Pass contracts which are multiyear increased to 46% at year-end, up from 41% at the end of fiscal '21, and the percent of our All Access Pass subscription revenue represented by these multiyear contracts of at least 2 years increased to 61% of total contracted revenue at year-end, up from 57% at the end of fiscal '21. For the fiscal year, our gross margin grew 17% or $29 million to $201.9 million and our gross margin percent for the fiscal year remained very strong 76.8%, a level almost equal to that achieved in fiscal '21 even after considering a significant growth in subscription services just noted. The flow through of our growth in revenue to growth in adjusted EBITDA for fiscal '22 was 37%, reflecting the impact of strong gross margins and declining operating SG&A as a percent of sales and the flow through of growth in revenue to growth in adjusted EBITDA was 28% in the fourth quarter. As a result of this strong revenue growth and high flow-through, adjusted EBITDA increased 51% or $14.2 million for fiscal '22 to $42.2 million and grew 26% or $2.8 million to $13.3 million in the fourth quarter. But as shown in Slide 7, as a result of our strong top and bottom line growth in fiscal '23 and the strength of factors driving it, we're pleased that the $42.2 million of adjusted EBITDA achieved for fiscal '22 exceeds both our most recent adjusted EBITDA guidance range of between $40 million to $41.5 million and our original adjusted EBITDA guidance range of between 34 and $36 million. As also shown in Slide 7, while of course, some quarters revenue growth will be higher than others, we're increasing our revenue outlook for fiscal '23 and beyond from the expectation that our rolling 12 months revenue will grow in the low double-digits to our current expectation that our rolling 12 months revenue growth will now be in the low teens, call it 12% or 13-ish percent and we'll move toward the mid and then high teens in the years to come. North America Enterprises balance of deferred revenue, billed and unbilled, grew 20% to $110.6 million and the percentage of North America's All Access Pass contract revenue represented by multiyear contracts increased 61% as of fiscal year end, up from 52% last year. Second, as shown in Slide 9, while overall results in our international direct offices were slower than originally expected as a result of COVID-related impacts on our operations in China and Japan during much of our second and third quarter's, revenue growth in our offices in U.K., Ireland, Germany, Austria, Switzerland and Australia countries which together make up approximately 48% of total international sales and where All Access Pass makes up a substantial portion of those sales was very strong. Education's year-end balance of deferred subscription revenue grew 17%, and we retained 89% of our existing schools in FY '22 while adding a record 739 new schools, an increase of 157 schools or 27% compared to the strong 582 new schools we added in FY '21. The Leader in Me subscription offering's growth has been so substantial that in fiscal '22, Leader in Me accounted for $57.6 million or 93% of Education's total revenue and Leader in Me subscription revenues are continuing to grow rapidly. As you can see as shown in Slide 24, our balance of deferred subscription revenue billed and unbilled continues to grow significantly increasing 20% or $26 million to $153.4 million at the end of fiscal '22. We said that our objective is to be a relatively unique kind of company, a company that simultaneously generates revenue growth in at least the low teens accelerating to the mid and then high teens, generates annual growth in adjusted EBITDA in the range of 20% per year, and reinvest it's excess free cash flow into the business and high rates of return, while also returning substantial amounts of capital to shareholders. Our guidance for FY '23 is that in constant currency, our adjusted EBITDA will increase from $42.2 million in FY '22 to between 47 and $49 million in FY '23 even after making accelerated investments in sales force growth and in content and technology and in the context of current macroeconomic environment and the continued COVID impact in China."
}