{
    "symbol": "PSTG",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-01 21:12:08",
    "content": " All of our products, customers buying more, the fact that we have a stronger and broader portfolio now being brought into a much greater set of opportunities in large existing customers and a stronger brand that’s allowing us to penetrate net new logos and to penetrate with larger opportunities in larger companies as a net new logo. So I would say what we’re currently seeing -- what I’m currently seeing in the market through last quarter, continues to be strong demand by IT customers and then a greater acceptance for Pure overall, just the strengthening, if you will, of our brand and our value proposition -- and the breadth of our value proposition to our customers. I guess the first question I wanted to ask is that when I look at your gross margin at 70% on the product line, it would really imply that you’ve not seen any incremental deployments with one of your large hyperscale cloud customers. As I mentioned in my opening remarks, I’ve spent a lot of time this past quarter -- or actually over the last quarter and this quarter, in Europe and the Middle East, a lot of excitement by customers and our sales teams and partners in the product. And I would call out actually that international had a fantastic quarter along with U.S. And so to Charlie’s point on broad-based performance, we saw that from a geography standpoint, I was really pleased with what we saw in the international side, which really, when you normalize for the $60 million in the U.S., it’s really tracking with the U.S. growth rates. And customers have been used to buying storage as a commodity, used to substandard support and capability and assuming that all of them were alike, they’re learning very quickly that Pure is very different than the other vendors that we require far less labor, that we’re highly automated, that we require less space power and cooling and that they have a superior experience overall with our product, and that’s being now increasingly appreciated. I think I’d also mention that in this particular environment, we were chosen to replace what was initially a custom design built around open source software as customer had really tried to build out part of the environment themselves and then turn back to us to -- when they couldn’t achieve the reliability performance and really the ease of management and automation required of these very demanding environments."
}