{
    "symbol": "ARES",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 18:19:05",
    "content": " We ended the year with $352 billion in AUM, an increase of 15% from $305.8 billion at the end of 2021 driven primarily by fundraising of $57 billion, including more than $12 billion in the fourth quarter. In our US and European direct lending portfolios, we continue to see solid fundamentals, low defaults and resilience in our credit metrics with weighted average loans to value at year-end of 46% and 49.5% respectively, as well as continued strong EBITDA trends with last 12 months' comparable growth of 9% for both the US and European portfolios. The strong contribution from FRPR in 2022, of which about 94% was recognized in the fourth quarter reflects $164.3 million in annually measured performance income from our two non-traded REITs and $71.5 million in performance income from nearly 30 perpetual life credit funds that are eligible for two silent fee payments. Our realization activity increased in the fourth quarter, with realized net performance income totaling $91 million, an increase of 10% over the fourth quarter of 2021. Of this, $832 million of net accrued performance income at year-end approximately 65% was in European style waterfall funds. In 2022, we realized $114 million in net performance income from European waterfall style funds, which represented 79% of the total net realized performance income for the year. As an update since our Investor Day of August 2021, the expected aggregate future net realized income from European waterfall funds raised through year-end 2022 has increased by approximately $1 billion to about $2.5 billion. Based on the significant outperformance of our fee-related earnings relative to our dividends and our strong growth prospects, we've elected to increase our quarterly dividend to $0.77 per share of Class A and non-voting common stock, or $3.08 annual, a 26% increase from the $2.44 dividend per share in 2022, as Carl mentioned. As you will recall, we gave the market long-term guidance for 2025 at our Investor Day in August of 2021, including a target of $500 billion and more in AUM a run rate FRE margin of 45%, FRE growth of 20% per year and growth in dividends per Class A share of 20% per year. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}