{
    "symbol": "ARES",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 19:13:08",
    "content": " Despite prevailing market volatility and economic uncertainty, our second quarter results demonstrate the resiliency and durability of our business, highlighted by strong growth across our AUM and fee-related earnings, as well as our ability to generate attractive fund performance for our investors. During the second quarter, we continued to see strong demand across our investment groups raising $16.4 billion of gross commitments across more than 15 different funds and numerous SMAs, including more than $5 billion of capital raised in our perpetual capital vehicles. And on the new product front, we launched a new secondary private markets fund with more than $250 million of capital during the second quarter and we remain on file with a new non-traded BDC. We saw strong deployment across our US and European direct lending businesses, totaling $7.7 billion and $3.8 billion respectively, as we focus on the expansion needs of our incumbent relationships and larger higher-quality companies, which saw access to private capital while banks retrenched and the capital markets were largely closed. Our alternative credit business, which also invest opportunistically in diversified portfolios of cash flowing assets also deployed $1.7 billion taking advantage of increased demand for private capital across their target sectors due to a pullback from traditional capital providers. Of note, our $7.6 billion Ares Industrial REIT, which is a good proxy for our US industrial assets saw rent gains on new and renewal leases, up 42% on average in the second quarter and the portfolio was 99.5% leased at quarter end, illustrating the strong demand in the industrial real estate market. Our quarterly management fees increased 41% year-over-year to $525 million, driven by continued deployment and growth in our fee-paying AUM. Despite slowing transaction volumes as valuations recalibrated in the private markets we still generated over $26 million in realized net performance income in the second quarter, largely from credit and real estate. Our accrued net performance income declined 1% in the quarter to $839.5 million due to market value adjustments and realized distributions in the quarter, but was up more than 37% over the last 12 months. Several notable fundraising highlights during the second quarter include $1.6 billion in new CLOs an additional $1.5 billion in debt and equity commitments to our inaugural sports, media and entertainment fund, $1.3 billion in inflows through alternative credit funds. So, if you just look at it, generally speaking, over the last three years, we had very significant deployment -- probably accelerated deployment coming out of the heart of COVID, which had a lot of private equity GPs coming back to market earlier than they otherwise expected on the heels of significant performance, 40% 50% 60% type rates of returns last year."
}