{
    "symbol": "ARES",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 17:05:20",
    "content": " With a record $92 billion of available capital to invest, a robust fundraising pipeline over the next 18 months and compelling fund performance, we believe that we have strong visibility for continued growth in earnings over the coming quarters and years. During the first quarter, we raised $13.7 billion of gross capital as new and existing investors allocated funds across our broadening platform. Notable highlights for the first quarter, included additional closings for several commingled funds in the market, a $1.1 billion first close on our sixth European real estate opportunistic fund, $900 million for our sixth Asian special situations Fund, $1.1 billion across our two Landmark secondaries funds, $600 million for our special opportunities fund and $400 million for our new APAC direct lending fund. Deployment across real estate was also strong in the first quarter, up 90% year-over-year including the additional deployment we're seeing in our recently acquired industrial funds. We had a small amount of fee-related performance revenues in the first quarter from our managed accounts and credit, but as we've stated previously we expect 90% plus of FRPR will come in the fourth quarter, as our retail funds and perpetual managed accounts typically crystallize their fees at year-end. Other fee income increased to approximately $20 million in the quarter, more than triple from the previous year with the increase driven predominantly by property development-related fees from our non-traded REITs in addition to our typical capital structuring and origination fees in certain of our direct lending perpetual funds. However, our accrued net performance income increased 5.3% in the quarter and is up 100% year-over-year to $850.8 million, reflecting the strong performance of the portfolio and the growth in future realization potential. We ended the quarter with $58.2 billion of AUM not yet paying fees that's available for future deployment and if deployed corresponds to potential annual management fees, totaling $557 million, which represents over 30% of our last 12 months total management fees. Earlier in the first quarter, we opportunistically accessed the debt markets before the spike in interest rates and successfully issued $500 million of 30-year fixed rate senior notes with a coupon of 3.65%. And you look at what we did in Q1 across the entire platform, both drawdown and non-drawdown funds, we put about $16.2 billion to work, which is 25% plus higher than the first quarter of 2021. So we feel like we can really grow that greater than 5% from the sex percentage to a much higher number, which will allow us further penetration across their wallet gain wallet share and that's really driven things like the recent acquisitions we've made and the number of platforms that we have, that allow our LPs to come in and have a lot of different choices so that and to Mike's point earlier that it's not one commingled fund that we're really dependent on in our fundraising, but a number of different funds and a number of different offerings that we're able to penetrate our investor base into having a number of products with Ares."
}