{
    "symbol": "MRCC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:46:04",
    "content": " Turning now to third quarter results, we are pleased to report adjusted net investment income of $7.1 million or $0.33 per share, up from adjusted net investment income of $5.4 million or $0.25 per share for the second quarter. MRCC enjoys a strong strategic advantage and being affiliated with a best-in-class middle market private credit asset management firm, with approximately $14.1 billion in assets under management, and approximately 190 employees as of September 30th 2022. During the quarter, we made investments in five new portfolio companies with funding totaling $15.2 million. Now, turning to our results, for the quarter ended September 30 2022, adjusted net investment income, a non-GAAP measure was $7.1 million, or $0.33 per share, compared to $5.4 million or $0.25 per share in the prior quarter. When considering our target leverage, the rising interest rate environment a favorable percentage of our fund leverage at a fixed rate and the current credit performance of MRCC, we believe that on a run rate basis are adjusted NII will more than cover the current $0.25 per share quarterly dividend, all other things being equal. Total investment income was $15.9 million during the quarter, up from $13 million dollars in the second quarter to $2.9 million increase in investment income was primarily the result of a one-time benefit of $2 million representing previously unaccrued interest income from the repayment of our loan investment in Curion Holdings LLC during the quarter. In addition, during the quarter, we began to see the impact of increases in interest rates on our investment income substantially, although portfolio borrowers exceeded their benchmark interest rates at the end of the second quarter. Total expenses increased from $8 million in the second quarter to $9.7 million in the third quarter, primarily driven by higher incentive fees net of associated fee waivers resulting from the increase in net investment income, higher interest and other debt financing expenses on our floating rate revolving credit facility due to the rising interest rate environment and higher income tax expenses, primarily associated with blocker entities that hold certain of our equity investments. As of September 30th, the SLF had investments in 62 different borrowers aggregating $192.1 million at fair value with a weighted average interest rate of 8.3%. The SLFs underlying investments or loans to middle market borrowers that are generally larger and more sensitive to market spread movements than the rest of MRCC's portfolio, which is focused on lower middle market companies."
}