{
    "symbol": "MRCC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 14:26:08",
    "content": " We also reported NAV of $244.9 million or $11.30 per share as of March 31, 2022, a decrease of $0.21 per share from NAV of $249.5 million or $11.51 per share as of December 31, 2021. MRCC enjoys a strategic advantage, in being affiliated with a best-in-class middle market private credit asset management firm, with approximately $13.5 billion in assets under management, and over 160 employees as of March 31st 2022. As of March 31st 2022, our investment portfolio totaled $546 million, down $15.7 million from $561.7 million as of December 31st 2021. During the quarter we made investments in three new portfolio companies, with loan funding totaling $5.6 million. Total borrowings outstanding decreased by $19.6 million, primarily as a result of portfolio repayments and syndications near the end of the quarter. Turning to our results, for the quarter ended March 31st 2022, adjusted net investment income, a non-GAAP measure was $5.4 million or $0.25 per share, compared to $5.4 million or $0.25 per share in the prior quarter. When considering our target leverage and current credit performance at MRCC, we believe that on a run-rate basis our adjusted NII can cover the $0.25 per share quarterly all other things being equally. Looking to our statement of operations, total investment income was $12.5 million during the first quarter, down from $13 million in the fourth quarter due to lower fee income and reduced pre-payment gains. Total expenses for the quarter decreased from $7.6 million in the fourth quarter to $7.1 million in the first quarter, primarily due to lower incentive fees, net of associated fee waivers as a result of lower net investment income. Net realized losses for the first quarter totaled $1.1 million, primarily related to the one-time book loss on the repayment of the SBA debentures, which represented the unamortized deferred financing costs under debentures at the time of their repayment."
}