{
    "symbol": "MRCC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 14:38:05",
    "content": " Adjusted net investment income was $5.6 million or $0.26 per share, down from adjusted net income of $7.1 million or $0.33 per share for the third quarter, which included one-time benefits of the receipts of previously unrecorded interest income on the successful repayment of our investment in Curion Holdings. During the quarter, we made investments in eight new portfolio companies with fundings totaling $21.7 million at a weighted average interest rate of 11.2%. While the average portfolio yield increased during the quarter ended December 31st, 2022, adjusted net investment income declined primarily as a result of a one-time benefit of the receipt of previously unaccrued interest income associated with the repayment of Curion Holdings that had previously been on non-accrual status, which occurred in the quarter ending September 30th, 2022. Excluding the one-time benefit of Curion from the third quarter results, adjusted net investment income increased by 1.8% or $100,000 during the fourth quarter. When considering our targeted leverage, the rising interest rate environment, the favorable percentage of our fund leverage at a fixed rate, and the current credit performance at MRCC, we believe that on a run rate basis, our adjusted net investment income will comfortably cover the current quarterly dividend, all things being equal. Excluding the one-time third quarter benefit of $2 million in interest income on Curion, investment income actually increased by $1.3 million or 9.4%, primarily as a result of increase in portfolio yield and average portfolio size. In addition, during the quarter, we continued to see the impact of increases in interest rates on our investment income as all the portfolio borrowers exceeded their benchmark interest rate floors during the quarter, and we were fully benefiting from base rate increases across the portfolio during the fourth quarter. Total expenses slightly decreased from $9.7 million in the third quarter to $9.6 million in the fourth quarter, primarily driven by lower income taxes, primarily associated with blocker entities that hold certain of the company's equity investments and lower incentive fees. As of December 31st, the SLF had investments in 60 different borrowers, aggregating $183.2 million at fair value with a weighted average interest rate of 9.7%. But should we think of the dividend opportunity from the SLF to MRCC is kind of having a high watermark or something like that where as in book equity has to get back above $80 million before you get 50% of the earnings because obviously, in the fourth quarter, the payout ratio was the dividend to you is like 37% of the earnings that you own 50% of it. What you don't see in our kind of broad portfolio risk rating distributions that we actually -- also during the quarter had migration out of the three into the two category as some of our companies that experienced some of the early effects of inflation and supply chain, we're able to effectively pass along price increases, execute strategic investment initiatives and get margins kind of back in line."
}