{
    "symbol": "ZYME",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 23:15:04",
    "content": " Revenues for both the year and most recent three-month period ended December 31, 2022, primarily related to the $375 million in upfront payments received from Jazz as a result of the completion of the zanidatamab licensing agreement, combined with approximately $24 million in reimbursements from Jazz for expenses incurred for zanidatamab between October 19 and December 31, 2022. We continue to believe that the Phase 1 clinical data presented last year at ESMO, at 2.5 milligrams per kilogram dosed every three weeks, shows that Zymezo has a differentiated tolerability profile relative to other HER2 ADCs and acceptable single-agent activity in a range of HER2-expressing tumors. While this spend represents a small component of our anticipated net cash operating burn guidance of $90 million to $120 million for 2023, we think that only now represents an important and investable opportunity worth pursuing as a differentiated HER2 ADC in post TDXD patient population and could provide the company with the ability to retain development and commercial rights in the US while working with a partner in ex-US markets. We are working closely with Jazz and BeiGene to continue enrollment of patients in the Phase 3 randomized clinical trial, HERIZON-GEA-01, evaluating zanidatamab in combination with chemotherapy plus or minus tislelizumab as a first-line treatment for HER2-expressing metastatic or advanced GEA. Additionally, last quarter, Zymeworks reported positive top line data from our Phase 2b open-label, single-arm clinical trial, HERIZON-BTC-01 studying zanidatamab as a monotherapy in patients with previously treated HER2 amplified and expressing biliary tract cancers. So those cohorts and those indications get us out, I think we're still going to continue to collect some additional in Phase 1 in our GEA cohort to be monotherapy, which I think will be useful, I think, in the ovarian and retail cancer indication that we mentioned before, we did mention, I think, when we talked about this last year or earlier this year, we were waiting some view on the clinical data from the PanTumor02, especially in ovarian, endometrial to understand that the standard of care that we're looking at is going to evolve or not. So obviously, at some point, we hope we'll see an update on that data set, which will hopefully give some further guidance as to how that file might be useful in patient populations, but we'll await guidance from BeiGene on when that data set might be available, and they're also still continuing to enroll -- sorry, continue to follow the study -- Phase 2 study in first-line breast cancer with zanidatamab and docetaxel, which we also talked -- presented last year. And then maybe just lastly, I guess, does the disclosure of HER2, HER2CLIMB-02 data, which is looking at tucatinib, Kadcyla in, I guess, mostly second-line patients, but I think a lot of the KOL conversations we've had would suggest that, that's maybe a regimen that gets institutionalized post in the HER2 if that data looks good. So we'll try and highlight the new and additional data, which has been developed, which I think adds hopefully to both understanding of what we're doing that's differentiated and why we're doing it and why we think we'll be successful with the product formats and the targets that we selected as well as the platform's ability to continue to generate these five new INDs in the next five years, including 171 and 191 next year, that will all be novel diversified on both sides of the RV portfolio, both multi sort of â\u0080\u0093 and by therapeutics and ADCs as well as all be hopefully differentiated and meaningful assets that we can keep unencumbered for ourselves as long as possible. I mean to get that, I believe we need some indication, as I mentioned, that ZW49 can be effectively combined with center care in indications that matter and show some interesting signals of efficacy, to show there's a registration pathway for that agent to be a second-line agent or be second choice HER2 ADC behind TDX team, which is very commercially attractive, especially, non-small cell lung cancer and the breast cancer indications as well as some of the other ones that are still -- still evaluating."
}