{
    "symbol": "ZYME",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 22:22:12",
    "content": " Clinical development of our product candidates, related clinical trials, anticipated clinical data presentations, potential therapeutic effects of zanidatamab and our other product candidates, expected financial performance and future financial position, the commercial potential of technology platforms and product candidates anticipated continued receipt of revenue from existing in future partners, our preclinical pipeline, anticipated sufficiency of cash resources and other potential sources of cash to fund our planned operations into the second half of 2023 and potentially beyond, our ability to execute new collaborations and partnerships and other information that is not historical information. Steven, just first on your first point, then I'll let Dr. Josephson answer the ASCO point, but I just said there -- we made a written statement last week about the letter we received, and it really can't say more than that at this point as indicated in that statement and also on the start of this call, I think, I can just assure you that as with everything we do here at time works, we act with seriousness, urgency professionalism, and with the interest of all shareholders in mind, as we act in our business. So, I think if you look at patients who don't have -- most patients I should say with biliary tract cancer, once they get out of the first line of treatment, unless they're eligible for something like an FGFR inhibitor, there really is no standard of care. Yes, I think that there's a little bit longer follow-up in the gastric cohort and in the breast cohort, but there obvious to be a much more detailed presentation of data in terms of showing depth of response and duration at least in what we can show at an interim cut in terms of patients that are still on and how long they've been and continuing to respond. And I think if you look at  as an example where I don't think it's necessary entirely for  to that need anyone for a HER2 or the other ADCs that were developing, but I think the AstraZeneca's  a way to bring in a partner, give up some economics around the program, but obviously as you've seen we able to build a much broader clinical program more in parallel, more timely and improve the commercial status for them beyond what they could have done themselves."
}