{
    "symbol": "ZYME",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 20:24:05",
    "content": " This involvement is critical as we continue advancing our ongoing clinical studies of zanidatamab towards regulatory filing and hopefully approval, allowing our employees to finish what they have started many years ago with the goal on day one of striving to improve patient outcomes over the current standards of care in a variety of HER2 expressing tumor indications. While the ongoing pivotal studies of zanidatamab in BTC and GEA will be the initial focus of the collaboration, Zymeworks and Jazz expect to continue evaluating clinical data from ongoing Phase 1 and 2 clinical trials of zanidatamab for indications beyond BTC and GEA. To be very clear, we and Jazz are excited about the potential for the broad applicability of zanidatamab across a range of HER2 expressing cancers beyond GEA and BTC, including both metastatic breast cancer and colorectal cancer where we have ongoing clinical studies and potentially future indications for zanidatamab may be able to provide benefits to patients in difficult to treat cancers. Your line is open. Your line is open. Your line is open. Your line is open. Beyond that, we've been working, as you know, on a number of other clinical studies, both in our pivotal study with first-line GEA in combination with chemo and also  with chemo and BeiGeneâ\u0080\u0099s PD1 and we've also been continuing to enroll in a number of breast cancer patients, we continue to enroll in our Phase 2 first-line GEA  chemotherapy which we'll report out additional data in the first-half of next year and we also enroll right now in our Phase 2 first-line BTC study with zanidatamab plus  which we continue to accrue patients in. Your line is open. Your line is open. And for us, 2022 is not done yet, we have a number of data announcements coming out at SITC and San Antonio and then we're very much looking-forward to reporting our top-line data from our BTC study before the end of 2022 and then look-forward to discussing with you in early January of 2023 and talk clearly about our key goals and milestones for 2023 and provide some financial guidance given the fact that our financial position is expected to be transformed by the opt-in of Jazz in our partnership after the BTC data is delivered to them."
}