{
    "symbol": "FISV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 09:24:04",
    "content": " Our progress over the last two years is undeniable after consecutive years of 11% organic revenue growth, 370 basis points of total adjusted operating margin improvement, and over $5 billion in share repurchases. We delivered on our guidance with a steep ramp in the fourth quarter with 12% organic revenue growth, 360 basis points of adjusted operating margin improvement and adjusted earnings per share of $1.91. Each of our operating segments recorded strong performance, led by merchant acceptance, with organic revenue growth of 16% and 17% in the quarter and year, respectively. Payments and network revenue had a superb year of growth, up 10% organically in the fourth quarter and 9% for the year, above our medium-term guidance range. This year, we expect organic revenue growth of 7% to 9%, adjusted operating margin expansion above 125 basis points and adjusted earnings per share of $7.25 to $7.40, which assumes a mild recession in the US. Total company organic revenue growth was 12% in the quarter with ongoing strength in merchant acceptance, further growth in our Payments and Network segment and a rebound in the Fintech segment as previewed on our last earnings call. Fourth quarter total company adjusted revenue grew 8% to $4.4 billion and adjusted operating income grew 20% to $1.7 billion, resulting in adjusted operating margin of 39.2%, an increase of 360 basis points versus the prior year and a sequential improvement of 400 basis points. As we anticipated, four factors drove this margin improvement; first, the final ramp-down of integration expenses and resulting productivity benefits; second, operating leverage on increased revenue and improved inflation comparisons; third, actions taken late in the third quarter and fourth quarter to tighten spending in light of the uncertain macroeconomic conditions across the globe; and finally, the divesture of our Korea business and two small low-margin nonstrategic units. As expected, the fourth quarter performance brought the full year adjusted operating margin to 35.1%, an increase of 120 basis points over 2021. Organic revenue growth in the Merchant Acceptance segment was a healthy 16% in the quarter and 17% for the full year, well ahead of our medium term segment guidance of 9% to 12%. This is well ahead of the 11.5% annual growth rate needed to achieve our Merchant Acceptance segment revenue outlook of $10 billion by 2025, as laid out in our March 2022 Investor call. Second, expanding our merchant relationships, the adoption of more value-added software and services, Clover VaaS penetration reached 16% in the quarter, up 13% from last year; and third, by growing with our existing customer base, our average revenue per Clover merchant expanded 12% in 2022. Adjusted operating income in the Merchant Acceptance segment increased 22% to $648 million in the quarter, with margin up 350 basis points to 34.8%. Fourth quarter adjusted operating income for the segment was up 14% to $811 million, and margin was up 230 basis points to 48.5%, driven by strong operating leverage. For the full year, adjusted operating income was up 10% to $2.8 billion and margin expanded 120 basis points to 45.3%. In the Financial Technology segment, we posted 8% organic revenue growth for the quarter and 5% for the full year right in the middle of our 46% medium-term guidance range. Adjusted operating margin in the segment increased 400 basis points to 41.3% in the quarter, helped by higher periodic revenue and productivity. As Frank said earlier, we expect organic revenue growth of 7% to 9%, in line with our medium-term guidance with adjusted operating margin expansion of at least 125 basis points. With fourth quarter organic revenue growth of 12%, well above your midterm guide and annual guide for next year of 7% to 9%, how should we think through the cadence of organic revenue growth and margin expansion, thinking through the higher supply chain and wage inflation you had in the first two to three quarters of last year, combined with any callouts on periodic revenue comparisons."
}