{
    "symbol": "TCN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 21:07:03",
    "content": " While the higher financing rates will have a negative impact on the cash flow we earn from our homes, we're also seeing a moderation in home prices, which in turn has allowed us to buy homes at cap rates at a range of 5.25% to 5.5% and which is roughly a 30 basis point increase compared to where we were buying three months ago. Looking at it differently to our real estate lens, we're buying homes at again a nominal cap rate of 5.25% to 5.5% and when including the net fee income, a fully loaded or adjusted cap rate of 6.5% to 7% and which remains very compelling even in a much higher interest rate environment. Market rents were up 6% nationally compared to last year, even with that change, it's probably never been more affordable to rent versus own a home, given how high mortgage rates have moved. The 2024 targets include growing our core FFO per share at a compounded annual rate of 15% over three years, expanding our SFR portfolio to 50,000 homes, maintaining stable leverage at eight to nine times net debt to EBITDA and improving our overhead efficiency such that 90% of our recurring overhead will be covered by fee revenue. On the property management expense side, although we're seeing the benefits of scale as we're managing 34% more loans compared to last year, this is being offset somewhat by general cost inflation from a tighter labor market and increased hiring to meet future growth and demand. I mean, we're seeing insatiable demand for our homes, we've never seen an environment like this where I would say the cost to rent a home versus the cost to own as has been better, obviously, with much higher mortgage rates. And we've been able to increase those cap rates, probably 30, maybe even 40 basis points over the last three months, and we think we're going to be able to increase those maybe by another 25 bps over the course of the year, with the trends we're seeing in home prices and rents. If you go back a year, where you could buy homes, let's say, to 5% nominal cap rate -- and now we're buying at a 5.5% cap rate, what you would have been giving up was 10% NOI growth, right? So we're seeing a little bit more price reduction on the new home side, and we're really starting to see more capitulation on the community acquisition side as well, where builders are realizing that they had new communities started, stated to launch later this year or early next year, and they might have thought they'd be selling eight or 10 homes a month, and they're looking at how can they meet those sales objectives. Looking at kind of the slide five in the deck and it's a really helpful breakdown that you guys provide -- it looks like maybe you're kind of assuming that I think the July debt was at 5.5%, maybe it would be 5% debt today. So, new listings down 10% year-over-year and that makes sense because when you think about it, when mortgage rates really move up and have almost doubled the way they have, people aren't going to list their homes. Because, I mean, mortgage rates still -- compared to where they were, let's say, six months to a year ago are significantly higher, even though they've moved down from, let's say, 6 down to like lower 5s, they're still really high. So in order to hit that kind of $0.83 to $0.88 target in the past, we were really assuming NOI growth of about 6%, so in order to hit it now with, let's say, interest rates 100 basis points higher, we're going to need NOI growth of 8% to get to the same place."
}