{
    "symbol": "TCN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 07:57:11",
    "content": " We see a path to increasing other revenue by over 16% per home over the next couple of years as we continue to roll out current programs such as same home technology and renter’s insurance and introduce new value pack ancillary services to enhance the resident experience, like, telecom partnerships, solar panels, or discounted cleaning services. On the property management side, we’ve seen the benefits of scale to offset inflation as we’re managing 32% more homes compared to last year, using our centralized and tech-enabled platform, which results in a lower cost per home. Your line is now open. So, what happens over time, and we’ve seen this, we’ve been in this business for 10 years, and we’ve seen this through empirical studies, is that there’s almost 100% correlation between home prices and rents. So, what we just seen is we’ve been through a period where home prices have moved extremely rapidly faster than rents, and that’s led to a slight compression in cap rates when we buy one home or two homes at a time. Rents will continue to catch up or increase, which will mean that we’ll probably see slightly higher cap rates when we’re buying homes, one at a time. Your line is now open. So, if we say the peak, Mario, is let’s say in February of 2022, we think maybe private market pricing is down 10%, private market cap rates might be up about 50 basis points, but they are far lower as Jon just said that where the public markets are at. Your line is now open. Your line is now open. And I think when we look at our projections, we are typically looking maybe 20%, this year 18% to 20% this year, and if we looked at the kind of a longer term forecast, let’s say at 2024, we will probably be projecting 25% turnover. Your line is now open. Your line is now open. But I think before that, I will just say this, on the existing home market, which obviously has a major impact on our ability to buy homes, right, because that’s really what’s driving our growth, if you think about the 8,000 homes that we are going to buy this year, roughly seven out of eight are existing homes. Your line is now open."
}