{
    "symbol": "DYNT",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-11 13:04:03",
    "content": " We are executing at a high level and have operating levers to achieve our goals, including improvement in gross margin, operating income and cash flow from operations in fiscal year '22 relative to fiscal year '21, absent significant impacts of the continuing surge of COVID-19 cases. We expect net sales in fiscal year ‘22 to be in the range of $40 million to $45 million, assuming no significant adverse effect on procedure volume from the recent surge in COVID-19 cases. We developed our annual sales guidance range for fiscal year '22 by taking the Q4 fiscal year '21 revenue from continued products of $9.8 million, adding market growth of approximately 5% is $10.3 million per quarter. The company expects the distribution of net sales across the quarters in fiscal year '22 to align with historical trends, which have tended to be a little higher in the first and fourth quarters, highest in our first quarter and lower in the second and third quarters. Our gross margin was 29.8% in Q1 fiscal year '22, an increase from 27.0% in fiscal year '21, including the exit activities associated with the discontinuation of third-party distributed products. Gross margin in Q1 fiscal year '22 was somewhat muted by the impact of COVID-19 and supply chain challenges, including extraordinarily high freight costs and increased costs for raw material. Specifically, freight costs and raw material costs increased $170,000 and $195,000 respectively, in Q1 fiscal year '22 than the same quarter last year, which is a 3% increase in cost of sales in the first quarter of fiscal year 2022. More generally, the company and its customers expect to experience continued supply chain and other challenges due to COVID-19, including rising raw material costs, higher delivery and shipment costs, supply chain disruptions, and extended handling times, similar to those reported by many companies. Gross profit for the first quarter of fiscal year 2022 was $3.7 million or 29.8% of net sales, compared to $3.9 million or 32.2% of net sales in the same quarter of the prior year. Cash used in operating activities was $0.65 million for the three months ended September 30, 2021 due to the company's working capital investment, and the expected double-digit growth, higher spending on inventory to serve customer demand growth and additional safety stock to help offset continued expected supply chain disruptions. I might add to what Norm just said there around -- that's one of the reasons that we're cautious around our future quarters and our overall net sales guidance of $40 million to $45 million, despite what was a really strong Q1 for us is those potential disruptions from COVID in future periods that we just simply can't account for as of yet."
}