{
    "symbol": "FTI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 12:36:09",
    "content": " For the full year, total company revenue grew 5% to $6.7 billion, while adjusted EBITDA improved to $670 million when excluding the impact of foreign exchange, an increase of nearly 20% when compared to the same metric in the prior year. In 2023, we expect full year inbound orders for Subsea to exceed $8 billion, an increase of at least 20% versus the prior year. At the midpoint of our guidance range, we anticipate revenue of $6.1 billion at a margin of 13%, which results in adjusted EBITDA growth of 26% for the full year. For Surface Technologies, at the midpoint of our guidance range, we anticipate full year revenue of $1.375 billion at a margin of 13%, resulting in adjusted EBITDA growth of nearly 30% versus the prior year. And finally, we are guiding free cash flow for the year to a range of $225 million to $375 million, the midpoint of which is more than 50% above the prior year, reflecting the improved EBITDA as well as higher conversion of EBITDA to cash. When comparing this revised subsea outlook to our 2022 adjusted results, this would be a 650 basis point expansion in Subsea EBITDA margin in just three years and result in Subsea EBITDA of approximately $1.4 billion. Your line is open. So if we look at our Subsea 2.0 deliveries, itâ\u0080\u0099s a bit less than 25% of what weâ\u0080\u0099re actually delivering today, which will obviously go towards 50% in the coming years, which gives us great confidence as a result of our ability to be able to shift to the modular build as you referred to or what we refer to as the configure-to-order operating model. But when we look at the 2025 guidance that we just updated today, a material increase from where we are currently of an additional 650 basis points of Subsea margin, itâ\u0080\u0099s these factors that weâ\u0080\u0099ve been working on for half a decade that weâ\u0080\u0099re now seeing the benefits from that create sustainable change, and we are not beholding to further pricing improvement to achieve these â\u0080\u0093 the updated 2025 guidance. Your line is open. Your line is open. And again, I really want to emphasize the actions that weâ\u0080\u0099re taking in this long journey that we embarked on six years ago was to improve our customersâ\u0080\u0099 offshore Subsea project returns while at the same time, creating a unique and different operating model for our company that would drive a much improved through-cycle return as well, not just a peak cycle return. Your line is open. Your line is open."
}