{
    "symbol": "RWT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 23:23:07",
    "content": " We were active in deploying capital during the quarter investing in both assets created by our operating businesses and those source from third parties, excluding our share repurchase and the completion of the acquisition of Riverbend Lending, we deploy over $160 million into new investments during the quarter, primarily into CoreVest originated bridge loans and incremental growth in our home equity investment portfolio or AGI. We view the capital raise as opportunistic providing us additional dry powder to deploy, including within our own capital structure that we believe will be accretive to earnings per share through time, we ended the quarter with approximately $412 million of unrestricted cash and unpledged loans, and nearly $200 million of investable capital, which gives effect to the consideration paid for the Riverbend acquisition. And we have as expected seen over the past couple quarters a trend more towards bridge where bridge loans may be used for portfolios that could qualify for single family rental, just because of some of the prepay flexibility, but on your questions on rates, just for context, our pipeline, our funded pipeline right now is probably about 100 basis points or so above the portfolio we securitized in late June. So that one was really just credit spread widening I would say in Q1, when there was more concerns about duration in the market, the credit curve flattened, mostly because AAA's widens, if you have large hold on portfolios, which are pipelines, which we didn't, AAA price action really impacted gain on sale, and in Q2, the credit curve steepen fairly dramatically, which really was the thing that impacted the SFR pipeline, and it resulted in the P&L there, it really was not hedging in BPL. One thing I would say just on in terms of where our capital allocation has trended, we know, our 630 capital allocation reflects the $100 million lower from residential mortgage banking, redeployed back into the investment portfolio, and that's just a byproduct of our view on the relative value of bridge today."
}