{
    "symbol": "RWT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 22:30:21",
    "content": " Because of our positioning, we are able to continue to lock loans competitively throughout the quarter while there is step back from the market, resulting in our residential lock volume declining only 7% from the fourth quarter of last year versus industry wide projections of a 25% or greater total decline for the period. While continued spread widening through quarter end is estimated to impact execution on our SFR loans and inventory, we believe the market has begun to find its footing, particularly for loan products with compelling credit attributes including cross collateralization and extension risk mitigated by maturity is more analogous to fixed rate CMBS loans. Our negative duration assets, namely our MSRs and IO securities act as a natural hedge and provided book value protection, as interest rates increased significantly in the quarter and prepayments flow, offsetting fair value declines from our Sequoia sub and seasoned jumbo loans. In terms of our non-interest income, or mortgage banking activities net declined by $20 million collectively, during the quarter as spreads widen for both securitization and whole loan sale execution and rate volatility increased throughout the quarter, relative to the fourth quarter G&A decreased by $4 million, driven by lower variable compensation commensurate with our GAAP earnings, which led to a relatively durable efficiency ratio despite lower volume quarter-over-quarter. We talked in the prepared remarks about how efficient we have been at really clearing out the lower coupon and so, when we think about securitization and jumbo or whole loan sale for that matter, it is important to recognize that the product that we have is a very different cash flow profile for investors, whether it is AAA’s or whole loan buyers and that is a very helpful buttress for margins, particularly given what rates have done so quickly."
}