{
    "symbol": "RWT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 22:05:04",
    "content": " As the market is absorbing this swing cycle, conditions subsequent to quarter end have remained challenging, and we estimate our book value at October 26 to be down roughly 3% to 4% since quarter end, but more volatility expected as the Fed works to combat inflation, our emphasis on robust liquidity, strong investment cash flows, and conservative market positioning in mortgage banking will likely carry through into the first quarter of 2023. Our residential business remained conservatively positioned in the third quarter locking $461 million of jumbo loans while distributing $612 million of loans, all through sales to eight discrete whole loan buyers. Our team completed a $274 million private SFR securitization with a large global institutional buyer at the end of the quarter, and we sold $85 million of loans, including SFR loans to an existing institutional buyer and single asset bridge loan produced by Riverbend to a handful of whole loan partners. Overall, we deployed $235 million of capital during the third quarter largely split between organic BPO investments, third party investments and the completion of the Riverbend acquisition in addition to the share repurchases that Chris referenced. The $0.60 decline was driven by negative $0.57 of primarily unrealized fair value changes on our investments, our dividend of $0.23, partially offset by $0.07 per share of other comprehensive income, and a $0.12 benefit from our $24 million of share repurchases in the quarter. Consistent with evolving industry practices, we have reintroduced a non-GAAP measure to provide the market insight into our run rate operating and investing margins, called Earnings Available for Distribution or EAD, which was $0.16 per share in the third quarter as compared to negative $0.11 per share in Q2. As previously mentioned, investment per value changes continue to have a measurable impact on GAAP earnings, and were negative $58 million compared to negative $88 million in the second quarter, reflecting further credit spread widening during the quarter in several of our investment classes, most significantly within our reperforming loan securities portfolio. So it's hard to comment necessarily on the mark-to-market part of the book, but from a cash flow durability perspective, we continue to feel really, really good, they're great loans to do, and BPL right now we think we've got obviously the great competitive footprint, we're in an environment where other lenders are clearly stepping back."
}