{
    "symbol": "HCKT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 18:14:03",
    "content": " Correspondingly, this afternoon, we reported total revenues of $75.9 million and revenues before reimbursement of $74.8 million and adjusted earnings per share of $0.38, above our quarterly guidance and up strongly on a year-over-year basis when you exclude the nonrecurring SAP software sales, which we highlighted on our second-quarter earnings call last year. Before I move to our second quarter results, I would like to remind everyone that the second quarter of the prior year benefited on a GAAP and non-GAAP basis from a nonrecurring $5.3 million or $0.09 per diluted share software sales transaction. For the second quarter of 2022, total revenues were $75.9 million, up 4% when compared to the prior year and up 12% when excluding the prior year software sales transaction. Our revenues before reimbursements increased to $74.8 million, up 2% when compared to the prior year and up 10% when excluding the prior year software sales transaction. Our U.S. operations, which represented 92% of our revenues before reimbursements in the second quarter of 2022 were up 3% when compared to the second quarter of the prior year and up 12% when excluding the prior year software sales transaction. Revenues before re investments for our S&BT Group were $32.9 million, an increase of 24.5% when compared to the same period in the prior year, reflecting the continued growth since the second quarter of fiscal 2020. Revenues before reimbursements for our EEA Solutions group were $36.1 million, a decrease of 11% when compared to the same period in the prior year, but an increase of 2.5% when excluding the prior year nonrecurring software sales transaction. Total company adjusted cost of sales, which exclude reimbursable expenses and non cash stock compensation expense, totaled $43.2 million or 57.8% of revenues before reimbursements in the second quarter of 2022. Excluding the impact of the prior year software sales transaction, SG&A in the second quarter of the prior year to $13.3 million or 19.6% of revenues before reversions. Excluding the prior year second quarter software sales transaction, EBITDA for the prior year was $13.9 million or 20.5% of revenues before reimbursements. Our adjusted net income for the second quarter was favorably impacted by approximately $1.5 (ph) due to foreign currency movements in the quarter, but was negatively impacted by $0.01 (ph) due to the utilization of a GAAP effective tax rate on adjusted earnings, which was 27.5% as compared to the 25% that was utilized for the second quarter guidance. Adjusted net income for the prior year included an effective tax rate of 25.7% on a GAAP basis and was favorably impacted, as already discussed, by $0.09 per share due to the software sales transaction already mentioned. It clearly comes -- it's not only recurring, it results in multi-year contract -- It results in high-margin multiyear contracts since you're really licensing IP and the capabilities of the platform, and it's intended to be used on, I'll call it, with limited support, which is some of the capabilities really important in the investments that we've made on our platform."
}