{
    "symbol": "HCKT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 15:12:03",
    "content": " Correspondingly, this afternoon, we reported total revenues of $75.7 million and revenues before reimbursements of $75.1 million and adjusted earnings per share of $0.38, both above our quarterly guidance and up significantly on a year-over-year basis. For the first quarter of 2022, as Ted mentioned, total revenues were $75.7 million, up 19% when compared to the prior year. Our revenues before reimbursements increased to $75.1 million, up 18% when compared to the prior year, which is above the high end of our revenue guidance range as we continue to see strong demand for our services throughout the quarter. Revenues before reimbursements for our S&BT Group were $29.8 million, an increase of 16% when compared to the same period in the prior year, reflecting the continued sequential growth since the second quarter of 2020, which includes strong growth from our research advisory offerings. Revenues before reimbursements for our EEA Solutions Group were $37.6 million, an increase of 17% when compared to the same period in the prior year. Revenues before reimbursements for our International Group were $7.7 million, an increase of 39% on a year-over-year basis, primarily due to US-driven global engagements and strong Hackett Institute sales. Total company adjusted cost of sales which exclude reimbursable expenses and non-cash stock compensation expense, totaled $45.7 million or 60.8% of revenues before reimbursements in the first quarter as compared to $39.3 million or 62% of revenues before reimbursements in the previous year. Total company adjusted gross margin on revenues before reimbursements was 39.2% in the first quarter, up with compared to the prior year of 38%. Adjusted EBITDA was $17 million or 22% of total revenues in the first quarter of 2022, as compared to $12.6 million or 20% of total revenues in the prior year, primarily resulting from increasing revenues and margins. GAAP diluted net income per common share were $0.33, up 74% for the first quarter of 2022, as compared to GAAP diluted net income per common share of $0.19 in the same period of the prior year, primarily due to the year-over-year revenue and margin growth. Adjusted net income for the first quarter of 2022 totaled $12.1 million or adjusted diluted net income per common share of 88 -- $0.38, which represents a year-over-year increase of 41% and is above the high end of our earnings guidance range. Net cash provided by operating activities in the quarter was $6.1 million, primarily driven by net income adjusted for non-cash activity, increases in contract liabilities which were partially offset by decreases in accrued expenses due to the payment of 2021 performance bonuses. Before I move to guidance for the second quarter of 2022, I would like to remind everyone that in the second quarter of the prior year company results included a nonrecurring $5.3 million software sales transaction."
}