{
    "symbol": "SNX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-10 12:30:27",
    "content": " For fiscal '22, we achieved revenue of $62.3 billion, up 9% year-over-year, adjusting for FX impacts and merger-related accounting policy alignment, which was above the 6% to 8% range we anticipated. With regard to the merger integration, we set the ambitious goal of achieving $100 million in cost synergies by the end of year one and we overachieved on that goal by 45%, realizing $145 million in fiscal '22. Non-GAAP gross profit had record quarter of $1.08 billion, our first quarter greater than $1 billion and non-GAAP gross margin at 6.63%, up 44 basis points year over year. Non-GAAP operating income was $496 million, up $88 million or 21.5% year-over-year, and non-GAAP operating margin was 3.05%, up 44 basis points year-over-year, driven by revenue growth, Hyve performance, the aforementioned of margin recovery, cost discipline and merger synergy execution. We expect total revenue to be in the range of USD15.2 billion to USD16.2 billion, which equates to year-over-year growth of around 5% on a constant-currency basis at the midpoint. While it is a challenge to forecast interest expense with precision in the current rate environment, we would anticipate trending toward our guidance for fiscal Q1 at $73 million per quarter, at least through the first half of fiscal year, and then slightly declining in the second half. From a cash flow perspective, we continue to expect to generate in excess of $1 billion in free cash flow-in fiscal '23 and anticipate working capital to be a source of cash this year despite topline growth and supply chain constraints continue to ease throughout the year and our inventory position improves. We will reflect that as I said in my prepared remarks in the Hyve area, we'll see more modest growth in fiscal '23, but in terms of our overall longer-term thoughts on hyper technologies in cloud, we think it's going to be meaningfully above we'll call it the average growth rate for the business. So, whether it's distribution, whether it's high-growth, those areas over time will feel pressure from just the competitive environment from a pricing environment, but I think the majority of what we're seeing in fiscal '23 as it relates to cloud service providers and their thoughts is, how can we continue to provide more end-to-end solutions beyond just data center fulfillment."
}