{
    "symbol": "TTCF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 18:48:04",
    "content": " Branded product sales rose 21% from last year's first quarter and were driven by a significant increase in US distribution points, increased volume at existing retail stores and new product introductions. Cost of goods sold increased 41.1% and to $63.9 million in the first quarter of 2022 from $45.3 million in last year's first quarter due to higher revenue and inflationary pressures that resulted in significant quarter-over-quarter increases in material costs, logistic costs, cold storage expenses and labor expenses. As a result, gross profit was $8.2 million or 11.3% of revenue, compared to $7.2 million or 13.7% of revenue in Q1 2021 While gross profit declined from last year's first quarter, it was a significant improvement from the gross profit reported in the immediately preceding fourth quarter of 2021. We expect 2022 annual revenue of $280 million to $285 million, gross margin of 10% to 12%; marketing expenses of $27 million to $32 million and capital expenditures of $20 million, primarily focused on automation and robotics. And then when you combine that in with the $8.8 million that we sit in down payments on capital expenditures, just in Q1, I think that when we start to talk about cash, that kind of goes away, adding the $2.9 million in marketing, there's some other marketing expenses that are prepaid, and that cash burn is not nearly as significant. So, the way the investment that we've already made here in Tattooed Chef since we started this was pretty -- was -- with these acquisitions that we made, it's going to be -- we're at a place today where we have all of this overhead now where guidance to be $280 million to $285 million. So now there's a little bit of headwind, but it's -- a we could -- the way I'm looking at this thing is while we're doing $400 million, $500 million in sales and now our increases our costs will increase minimally. We have so many -- we have so much more opportunity and so many more levers to pull on that we do really think we're going to be profitable by the end of next year in this company between all of the things that are going on and then increasing our sales with all the different -- because as we discussed in the past, the chips, the bars, they command a higher gross margins than frozen also."
}