{
    "symbol": "LOGI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-25 15:28:03",
    "content": " I just don't think we're quite there yet across the industry and across all the markets, but it's really encouraging to see some of the categories continuing to grow despite the tough comps. And then from a product standpoint, as Bracken said, I think it's impressive when you look even at something like web cameras, we're pretty much selling the same number of units as we did a year ago. So, I think now that we've got -- we're going to have a period, we're going to have the mix story will go the other way a little bit on webcams, but then we're set up to see what we can do with the category after that. I think also, several other market trends are really playing to our favor, some strength in kind of the high -- if I look at gaming, there's been some strength in the higher price bands, which is a sweet spot for us. And so, we've kind of gotten up the adoption curve on a number of trends that we're already thinking a lot about, like video, that was a trend before, but it's gotten a lot stronger. I mean, I think we feel like we've got a group of people and a team that's really working well. The conference rooms, I think we're seeing, as I mentioned earlier, I think we're seeing the early days that the thaw of the office, where people are going to -- are starting to rethink their footprints and how many offices need, how many meeting rooms do you need, how much video do need, which we think is going to be everywhere over time. So, I think, again, I'll just make the point, I think video at the desk in the office, it's something that didn't really exist a lot pre-pandemic, and I think will exist in the future, not going to say post-pandemic, but just in the future as people come back into the office, I think you'll have more video there. Again, I think our strategy for the last few years and continues to be, let's try to rely less on promotion to drive the top line to drive the business and let's invest in marketing and drive the awareness, and I think that's a healthier way to grow over the long-term. The answer is no, we don't have any data right now that would say that, that we have -- we're getting big sales out of our climate policies and practices, which I think really are leading edge and leading in the industry. It's like a really -- I think it's going to be an exciting time ahead as things start to fall out, and we are going to be ready to innovate left, right and center and grow right into all these long-term secular trends we've been part of and I think they are not going to let up."
}