{
    "symbol": "LOGI",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-03 12:22:02",
    "content": "  Good morning, good afternoon, everyone and welcome to Logitech's Video Call to discuss our Financial Results for the Fourth Quarter and Full Fiscal Year of 2022. We posted our 9th consecutive year of growth, delivered strong growth in key categories like C&P and gaming, saw market share gains across our portfolio and geographies, and continued to invest in the future, using our strong gross profits to invest in key strategic areas like marketing and product development. And I think whatever direction we end up taking whether it gets even stronger in BC, which I think is possible or it's a little bit weaker than the 5%, 15% you mentioned, I'm kind of confident that our portfolio will play in our favor here. There's enough uncertainty where it's helpful to be a little bit long in some areas and that's what we've done whether it's on the component side as lead times have gotten longer and there's been some shortages or we have categories like the one you mentioned, video collaboration strong margins. That said, there's obviously some things too that are leading to some higher levels of inventory relative to prepandemic for example, port delays and just overall supply change disruptions and so until those things resolve themselves, I don't really see us moving quickly to reduce inventory in our distribution centers or in manufacturing because again I think it's to our benefit just to be running a little bit higher than what we did before. And that's the kind of thing we've been doing in the last 1.5 years, two years and you haven't seen them, but they're built into what we're doing. I mean, I don't think -- this won't be a year where I don't believe you'll see OpEx investment faster than revenue growth this year, like you have in the past couple of years, or at least last year. I think webcams are pretty stable but they're not going to -- we're not predicting a big growth, but that's a relatively smaller part of our overall VC business."
}