{
    "symbol": "PSFE",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 12:14:06",
    "content": " First quarter revenue was $368 million and adjusted EBITDA was $104 million both exceeding the high-end of Paysafe’s guidance range for the quarter, including a strong performance from the U.S. acquiring segment, which grew revenue and adjusted EBITDA by 10% and 20% respectively. Moving to Slide 9 for a summary of our Q1 results, volume was $31.2 billion, an increase of 13% year-on-year, driven by 21% growth from U.S. acquiring. Excluding the unfavorable impact from year-over-year changes in foreign exchange rates, which partly offset the inorganic benefit from the recent acquisitions, revenue was approximately flat compared to Q1 of last year as growth from U.S. acquiring was offset by digital commerce. Conversion on a 12-month basis was 55%, reflecting an increase in working capital related to growth in U.S. acquiring volumes as well as cash taxes paid, including a withholding tax payment in Q3 of 2021, expected to be recovered in the second half of this year. Moving to Slide 11 for a summary of the take rate trend, as you can see from the graph, Paysafe total take rate is stable sequentially and down year-over-year, and this is predominantly mix driven as the U.S. acquiring business, which has a lower take rate has become a larger portion of our volume mix increasing from 60% in Q1 of last year to 64% this period. Revenue was $198.5 million, a decrease of 11% compared to prior year, reflecting unfavorable FX and business mix, including the impact of regulatory headwinds in Europe, which you have also seen in the results from European operators, who are reporting double-digit declines in the region for Q1. Since our call on November 11, when the outlook was first provided, the U.S. dollar has strengthened approximately 10% against the euro, which negatively impacts revenue by $70 million and adjusted EBITDA by $20 million on an annual basis. We expect high single-digit growth in U.S. acquiring offset by a decline in digital commerce driven by year-over-year adverse FX movements and the ongoing impact of gambling regulations in Europe, as expected, in addition to Russia Ukraine impacts. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}