{
    "symbol": "PSFE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 11:39:03",
    "content": " Excluding the impact of movement in foreign exchange rates, revenue increased 10% year-over-year, reflecting growth from both, the US Acquiring and Digital Commerce. I want to reiterate that Paysafe maintains a healthy financial position with transaction volume exceeding $128 billion, revenue approaching $1.5 billion and adjusted EBITDA exceeding $400 million over the last 12 months. Volume was $32.5 billion, an increase of 5% year-over-year, reflecting continued strength in the Americas, where we saw resiliency in the U.S. SMB market; as well as strong momentum in regulated iGaming and Latin America. Adjusted EBITDA for the quarter was $95.5 million, resulting in adjusted EBITDA margin of 26.1%, primarily reflecting lower margins in the Digital Commerce segment; business mix; as well as one-off items, including a prior year VAT release. Adjusted net income for the third quarter was $29.2 million compared to adjusted net income of $39.4 million in the prior year, largely attributable to the higher interest expense and the decline in adjusted EBITDA. In our Digital Commerce segment, volumes were $10.7 billion, an increase of 3% year-over-year, reflecting growth from the acquisitions. Excluding the impact from changes in foreign exchange rates and Russia-Ukraine, revenue would have increased 10% year-over-year, reflecting growth in both Digital Wallets and eCash and primarily driven by contribution from acquisitions and our new embedded finance offering. Adjusted EBITDA for the Digital Commerce segment was $63.5 million in the third quarter compared to $80 million in the prior year, down 7% on a constant currency basis. As we close out the year, we expect Q4 revenue in the range of $370 million to $378 million and adjusted EBITDA in the range of $105 million to $109 million, which reflects flat to modest growth year-over-year on a reported basis for both metrics."
}