{
    "symbol": "PSFE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 11:26:09",
    "content": " In the fourth quarter, revenue of $384 million increased 8% on a constant currency basis, exceeding our most recent guidance, resulting in 9% growth in the second half. Volume was $33.1 billion, an increase of 5% year-over-year, reflecting continued strength in the Americas, where the Merchant Solution business saw resiliency in the U.S. SMB market as well as an improvement in e-commerce, partly offset by FX headwinds in digital wallet, where we saw continued improvement supported by growth initiatives, our Latin American acquisitions and the lapping of regulatory headwinds in European gambling. Adjusted EBITDA for the fourth quarter was $107.6 million, resulting in adjusted EBITDA margin of 28%, reflecting lower margin in the Merchant Solutions segment due to channel mix, including faster growth of the indirect channel. During the quarter, we generated $91 million in free cash flow and an increase of more than 70% over Q4 of the previous year, reflecting an 85% conversion of adjusted EBITDA. Overall, our constant currency growth reflects strong performance from the Merchant Solutions segment and inorganic growth from our Latin American acquisition, which more than offset market headwinds from the Russia-Ukraine war as well as European gambling regulations in the Netherlands and Germany, which impacted digital wallet, particularly in the first half of the year. Adjusted EBITDA for the full year was $410 million, resulting in adjusted EBITDA margin of 27.4% compared to 29.9% in 2021, primarily reflecting segment mix as well as channel mix within Merchant Solutions. Adjusted net income for the full year was $137 million compared to adjusted net income of $185.8 million in 2021, largely attributable to lower adjusted EBITDA, higher depreciation and amortization as well as higher interest expense, excluding $62 million expense related to debt refinancing in 2021. Revenue for the fourth quarter was $208.5 million, an increase of 10% and a full year revenue of $817.4 million also increased by 10%. Adjusted EBITDA in the fourth quarter was $51 million, reflecting 24.5% margin, down 270 basis points, primarily reflecting our channel mix within the segment. For the full year, adjusted EBITDA increased 7% to $200.3 million, reflecting a margin of 24.5%, down 60 basis points. The Digital Wallets segment delivered continued improvement this quarter, including nominal sequential revenue growth of 9%, driven by our growth initiatives, as Bruce discussed, as well as seasonality in gambling, including the World Cup. Digital Wallet revenue for the fourth quarter was $177.1 million, an increase of 6% year-over-year, excluding the impact from changes in foreign exchange rate. Adjusted EBITDA in Digital Wallet segment was $77.1 million in the quarter, with margins consistent with prior year at 43.5%. Full year adjusted EBITDA was $289.4 million and margin decreased 210 basis points, reflecting investments and headwinds from Russia-Ukraine and European gambling operations. We expect adjusted EBITDA to range from $452 million to $462 million, reflecting at least 100 basis points of margin improvements driven by operating leverage. The first quarter is expected to be in the range of $375 million to $380 million, an increase of approximately 4% year-over-year on a constant currency basis. Paysafe is a scaled player with $1.5 billion in revenue, $410 million in EBITDA, 70% plus free cash flow conversion and will grow mid-single-digits in 2023. So, as you can see in the improvement in our guidance range for 2023, which Alex talked about, reflects a 6% to 7% organic revenue growth coupled with at least 100 basis points of EBITDA margin."
}