{
    "symbol": "LKQ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 13:27:08",
    "content": " Revenue for the second quarter of 2022 was $3.3 billion, a decrease of 2.7% as compared to $3.4 billion in the second quarter of 2021. In North America, organic revenue for parts and services for our North American segment increased 10.7% in the quarter on a year-over-year basis, which exceeded our expectations. Organic revenue for parts and services for specialty declined 11.5% in the quarter, largely due to a tough year-over-year comp. Most of the impact related to the precious metals found in catalytic converters, the prices of which were near record levels in the second quarter of 2021, roughly $20 million of the negative effect was reflected in the Self Service segment. Keeping those external factors in mind, our second quarter results reflect a solid operating performance, while gross margin decreased by 30 basis points compared to a year ago, a 70 basis point negative effect came from the metals prices alone. Wholesale North America produced an EBITDA margin of 18.7% for the quarter, down 90 basis points from the prior year period. Specialty's EBITDA margin of 13.4% declined 150 basis points compared to the prior year, mostly coming from a decrease in overhead expense leverage, driven by an organic revenue decline of 11.5%, as the anniversary a very tough comp from the prior year when the business delivered over 30% organic revenue growth in the first and second quarters of 2021. Since then, the team has made great progress on pricing and productivity, resulting in a 70 basis point improvement from the second quarter of '19 through to Q2 of 2022, in addition to growing the business by over $100 million in revenue. Self service reported an EBITDA margin of 15.3% for the second quarter of 2022, a solid result for the segment, but below the heightened margin achieved a year ago. The Specialty business, as we've seen given the monster comps that we had last year, was down, I think, 15% in the first quarter, 11% in the second quarter."
}