{
    "symbol": "HMST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 16:24:07",
    "content": " No provision for credit losses was recorded during the second quarter of 2022 as the benefits of the continuing favorable performance of our loan portfolio, offset any required ACL resulting from the significant growth in our loan portfolio. The $3.8 million decrease in noninterest expense in the second quarter of 2022 as compared to the first quarter of 2022 was primarily due to lower compensation costs due to the seasonality of certain employee benefit costs such as employer taxes, 401(k) match and vacation accruals, which are higher in the first quarter of the year, and the deferred cost benefit resulting from significantly higher level of originations in the second quarter. In the second quarter, we grew our loan portfolio by $895 million or 15%, and that's 15% unannualized, as a result of record loan originations and growth in all loan types. As a result of loan portfolio growth and related increases in net interest income, our ability to continue to leverage our existing operating expense infrastructure, we anticipate improving our efficiency ratio to the low 60% levels for the second half of this year, and then in the mid-50% range in 2023. As I mentioned last quarter, as a result of our strong loan originations, a focus on loan retention and portfolio growth and slower prepayments, our net interest income is expected to grow meaningfully going forward and be a larger and more consistent component of our revenues. With the continued increase in market interest rates, as would be expected, our single-family mortgage banking revenues continued to decline during the second quarter and comprised only 6% of total revenues in the quarter. While the level of loans originated for sale decreased, the origination of single-family and HELOC portfolio loans increased totaling $176 million in the second quarter and the related portfolio increased at an annualized rate of 32%. Our decision to retain in our portfolio, all of our permanent multifamily loans, combined with the more challenging environment for single-family mortgage production caused our level of earnings in the first half of this year to be lower than it would otherwise have been. Now due to our much larger loan portfolio and its associated net interest income, our expectation for higher Fannie Mae U.S. production and sales activity going forward, our potential earlier resumption of permanent multifamily portfolio loan sales and our ability to lever our existing noninterest expense base, and in spite of our expectation, for continued pressure on single-family mortgage volumes and revenues, but that's a lot. Our expectations for the remainder of this year is that we grow at an annualized growth rate that's consistent with the guidance we've been giving this 10% to 15% annualized, but probably at the low end of that, right, more like annualized 10% in the back half of the year."
}