{
    "symbol": "HMST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 20:09:05",
    "content": " Noninterest income in the third quarter of 2022 was consistent with the second quarter of â\u0080\u009822 as a $4.3 million gain on sale of Eastern Washington branches, was offset by a decrease in single-family gain on loan origination and sales activities due to decrease in rate lock volume as a result of the effects of increasing interest rates and lower loan servicing income. The $0.7 million decrease in noninterest expenses in the third quarter of 2022 as compared to the second quarter of 2022 was primarily due to reduced headcount due to the sale of 5 Eastern Washington branches, lower commission and bonus expenses, offset by higher marketing costs related to our promotional deposit projects and higher FDIC fees due to our larger asset base. Due to low levels of core deposit growth this year, we have had to fund our significant loan growth with wholesale funding both FHLB advances and brokered deposits with significant increases in market rates already experienced this year and with anticipated additional increases in the near term, our wholesale funding costs have risen dramatically and are expected to continue to rise. While our yield on interest-earning assets has increased and is expected to continue to increase in the future, the impact of the accelerated increase in market interest rates on our wholesale funding sources, is expected to cause a temporary decline in our net interest margin over the next 2 quarters as we work to replace existing borrowed funds with deposits. And finally, we complete our Southern California branch acquisition as anticipated in the first quarter of 2023, then we would expect our net interest margin to trough in the fourth quarter of this year and build sequentially throughout the quarters of 2023 and ultimately, provide for a full year 2023 net interest margin that exceeds the level of our 2022 net interest margin. While these efficiency gains have been muted by lower gain on sale revenue as a result of historically low levels of single-family mortgage and multifamily DUS loan production as well as reduced secondary market for portfolio multifamily loans, over time, through growth and operating leverage, we currently anticipate beginning to achieve these efficiency goals in the second half of next year. Iâ\u0080\u0099ve already discussed the detrimental effect that the rate environment has had and will continue to have in the near term on our net interest margin and associated net interest income as well as on a portion of our noninterest income from lower gain on sale activity from our single-family mortgages, Fannie Mae DUS and occasional permanent multifamily loan sales. But importantly, we are already rapidly addressing the factors causing pressure on our net interest margin and even as we have reduced our gain on sale expectations through 2023 to a level consistent with what weâ\u0080\u0099ve experienced this year, we see a path to achieve our prior profitability targets as soon as the second half of 2023."
}