{
    "symbol": "SCHL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-21 22:11:04",
    "content": " Overall, full year revenues grew 26%, operating income increased by $120 million, and free cash flow increased by $162 million. We expect fiscal year 2023 revenue growth in the range of 8% to 10% and adjusted EBITDA is expected to be $195 million to $205 million, up from $189 million in 2022. Full year operating income increased $58.5 million on incremental revenues of $342.6 million, demonstrating the high operating leverage the company created through the prior yearâ\u0080\u0099s cost-savings initiatives. Inventory levels have increased to $281.4 million and will continue to increase throughout the summer months as we procure inventory well in advance of the upcoming fall season when we expect higher revenues and volumes than last year, notably in our Book Fairs business. For the full year, revenue from Book Fairs operations increased to $429.7 million from $164.3 million in fiscal 2021. Total Childrenâ\u0080\u0099s Book Publishing and Distribution revenues for the current quarter of $277.2 million exceeded the prior period revenues of $195.8 million, and our full year revenue increased 40% to $946.5 million from $675 million in the prior fiscal year. Operating income of $46.8 million for the quarter exceeded the prior yearâ\u0080\u0099s fourth quarter operating income of $12.6 million, and the full year operating income of $115.3 million exceeded last yearâ\u0080\u0099s operating income of $14.3 million as we recover from the pandemic with higher margins than we entered the pandemic. For the full year, revenues of $393.6 million exceeded the prior fiscal yearâ\u0080\u0099s revenue of $312.3 million and full year operating income of $81.8 million exceeded fiscal 2021 operating income of $57.7 million. In fiscal 2021, increased demand for summer reading and other products, combined with supply chain issues, resulted in a $10 million backlog of orders that ultimately were delivered in fiscal year 2022. For the full year, revenues of $302.8 million trailed the prior yearâ\u0080\u0099s revenue of $313 million, and operating income of $5 million trailed the prior year operating income of $28.4 million."
}