{
    "symbol": "ROIC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 16:02:06",
    "content": " In terms of re-leasing rent growth, we are pleased to report that we -- that we had one of the best quarters on record for the company, achieving a 48% increase in cash base rents on new leases signed during the third quarter. During the first 9 months of the year, we acquired 5 terrific well-established grocery-anchored shopping centers, totaling $120 million, including 2 that we acquired during the third quarter for $60 million. Leasing over 480,000 square feet of space during the quarter, bringing our total leasing activity thus far for the year to 1.2 million square feet which, as Stuart indicated, is a new record for the company, surpassing our previous 9-month record that we achieved 4 years ago. Notwithstanding being essentially fully leased, we continue to work hard at capturing the demand for space through finding creative ways to free up space within our portfolio, primarily through a combination of recapturing space early, shifting certain tenants and rightsizing others to make way to not only accommodate key long-standing existing tenants who are seeking to expand but also to create space within our portfolio to bring in more and more new destination tenants and enhance our overall tenant mix. During the third quarter, at one of our shopping centers in the Pacific Northwest, a new tenant that had recently opened introduced us to a group that's looking to roll out a new cultural center concept on the West Coast and seeking to lease space at our property for their inaugural location. Along with these new tenants seeking space, a growing number of our existing restaurant tenants continue to come to us seeking to expand their spaces to accommodate additional seating areas as well as new bar spaces and they are looking to extend their lease terms. Lastly, in terms of lease versus build, during the third quarter, new tenants representing approximately $1.4 million in annual base rent opened and commenced paying rent, bringing our total thus far for the year to $6.1 million of annual base rent from newly opened tenants. In terms of additional new leases signed, given our strong leasing activity, during the third quarter, we signed new leases representing an aggregate $2.7 million of annual base rent. And the impact of that 100 -- or excuse me, 250 basis points really won't be felt obviously to the first and second quarter of next year because that's when the income will come online from a rent perspective. So we could be in a different place right now looking into -- as interest rates do go up, where owners today, as I speak with them, seem very comfortable key only in what they have and that's why the transactional market has slowed dramatically because the fundamentals of what's different this time around, Mike, is the fundamentals are so strong and yet the cost of debt capital has gone up a lot."
}