{
    "symbol": "LANC",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-03 11:57:01",
    "content": " Thank you, everyone, for joining us today for Lancaster Colony's Fiscal Year 2022 First Quarter Conference Call. For today's call, Dave Ciesinski, our President and CEO, will begin with the business update and highlights for the quarter. In our first fiscal quarter, ended September 30, consolidated net sales grew 12.3%, to a record $392 million. Net sales in our Retail segment grew 15.6%, while net sales in our Foodservice segment advanced 8.1%. As expected, we experienced significant cost inflation during the quarter that reduced our profit before our pricing initiatives took full effect. The 15.6% growth in Retail net sales comps to a strong first quarter last year, when Retail net sales grew 16.6%, as the impacts of COVID-19 drove increased at-home food consumption. Retail sales growth in this year's first fiscal quarter was driven by our licensing program, led by Chick-fil-A sauces and Buffalo Wild Wings sauces. IRI scanner data for the 13-week period, ending September 26, showed total U.S. food sales of Chick-fil-A sauces at $35.1 million. Per IRI, Olive Garden dressings grew their category share to 6.3% during the quarter. In our Foodservice segment, excluding Omni Baking sales attributed to a temporary supply agreement that ended October 31, last year, net sales increased 10.1%. Excluding inflationary pricing, sales volumes to our national chain restaurant customers were similar to last year. NPD CREST data for U.S. foodservice industry shows the weekly transactions for the quarter ending September 30 were pacing ahead of last year through mid-August, and then fell slightly below prior year levels for the remainder of the quarter. I'll now turn the call over to Tom Pigott, our CFO, for his commentary on our first quarter financial results. Overall, the results for the quarter reflected strong top line performance, as well as significant inflationary cost impacts. First quarter consolidated net sales increased by 12.3%, to $392.1 million. This growth was driven by consolidated volume growth of approximately 5%, pricing primarily in our Foodservice segment, and favorable revenue mix. As we have shared, our planned retail pricing will be fully reflected in the second quarter. In addition, our Foodservice pricing lagged the commodity increase during the quarter. Beyond the significant commodity inflation, we incurred higher co-manufacturing cost as we outsourced additional production to meet our growing demand, and was as higher freight and warehousing costs, and labor inflation. Consolidated operating income declined $8.4 million or 17.2% versus the prior year quarter, to $40.5 million. In addition, costs related to Project Ascent reduce this quarter’s EPS growth by $0.03 per share, the remainder of the decline related to the underlying performance of the business. With regard to capital expenditures, first quarter payments for property additions totaled $30.2 million. For our fiscal year '22, we are forecasting total capital expenditures between $170 million and $190 million. In addition to investing in our business, we also returned funds to shareholders, our quarterly cash dividend of $0.75 per share paid on September 30, represented a 7% increase from the prior year amount. Even with the investments we're making and the increased dividend payments, our financial position remains very strong as we finished the quarter debt-free with $130 million of cash on the balance sheet. To wrap up my commentary, this quarter featured strong top line growth and significant inflationary impacts in advance of our full pricing actions. We continue to monitor and adjust to - for the inflationary cost increases, we are forecasting this year while investing in the long-term potential of the business. Number one, to accelerate our core business growth, number two, to simplify our supply chain to reduce our costs and grow our margins and number three, to identify and execute complementary M&A to grow our core. In our fiscal second quarter, we expect our licensing program to remain an important source of growth in the retail segment. Inflationary pricing, including retail segment pricing actions that took effect near the end of our first fiscal quarter, combined with additional pricing in the food service segment will help to partially offset the input cost inflation. Note that our projected financial results and expectations remain subject to the impacts of COVID-19 including shifts in consumer demand between the retail and food service channels, industry-wide supply chain challenges and inefficiencies and higher costs to produce our products and service to our customers. Moving on to our supply chain strategy, our significant investment in production capacity and our dressing and sauce facility in Horse Cave, Kentucky, is progressing as planned with the target completion timeframe in the first quarter of fiscal year 2023. Finally, consistent with the update that we shared with you in our fourth quarter earnings results back in August, the implementation phase of our ERP project, Project Ascent is scheduled to begin in the first quarter of fiscal year 2023. Ryan, if you go back and you look at the scanner data sales, Q4 of the last fiscal year, I think, was about $38 million. As you look at, more broadly, across the algorithm in retail, we expect to see continued growth -- sequential growth throughout the year. As we think about it, as we finish this fiscal year, and we continue this growth, there's several things that are going to start to open up as we get into the next fiscal year. The first of which is we're brining online incremental bottling capacity, that's going to allow us to take the product off allocation with our customers, and allow them to begin to -- to merchandize the item in ways that you would other items in a grocery store. So, as we look at it, the way we're looking at this, in general, is almost, Ryan, like the way you would look at other inorganic growth. And then, go-live in Q4, and then you can expect to see those costs start to wind down into fiscal year 2023, is sort of the way that they're cadenced out. As we cross over into the next calendar year, our Q3 and Q4, really, we're going to be going through very intensive training, and getting employees ready to go to take this product live. If you think about what we're doing, that first wave that we're bringing live is the back office of the business, it's orders to cash, it's procure to pay, it involves trade spending. And we're going to be essentially stamping out factories several at a time until we're completed with this project, which will wind its way down through the end of 2023 for the timing. The first is we stepped back and we said, what are truly the priorities of our business, and first and foremost, it's servicing our key strategic customers, namely, our Foodservice customers, be it Darden Restaurants and Olive Garden, and their other elements, Chipotle, Buffalo Wild Wings, and others. And for us to put them in a situation where we're not able to deliver not only impacts our business, but it could severely impact their business and getting all the external complexities that we were seeing, when we went through a planning process, we elected that it would be safer to push it out a little bit farther to ensure that we are in a position to build up inventory, and to execute it safely. So, paradigmatically, if you go through, when you get a chance, you go to queue, you're going to see some movement in our inventory, part of that is driven by a rebound because of inflation, but part of that is driven by the fact that we are carrying more inventory as a buffer to make sure that we can service our business now, and in preparation for servicing our business when we prepare to go live. And where in your business are you seeing the largest inflationary pressures, and as we're thinking about gross margins throughout the balance of the year, I know you don't provide guidance, but any color on the movement pieces would be helpful. But in this particular quarter, we saw more of an impact in the foodservice PNOC as our pricing lagged the commodities and you can see that in the Foodservice results we reported. Now going forward, as we shared on the retail side, we do have, we will get the full impact of the first round of pricing that that will be reflected in Q2 fully as well as a catch-up on Foodservice pricing, which will improve our margins there, as well, versus the declines we reported this quarter. And then, as we're looking at some of the Foodservice trends continue to see improvement. If you look at where the quarter began in July, what we saw was, and I'm going to talk about transaction data, right, is transactions were actually strong. As we got towards the middle of August, all of a sudden we started to see transaction data start to pull back and it actually started to go slightly negative, let's call it 1%. Now as you pull that apart, what you saw were -- there were some segments like mid-scale that continued to perform pretty darn well through the whole quarter. But if you kind of go to where's the center of gravity of Foodservice, which is around QSR and casual dining, but QSR principally, I think the story to watch is that as we started the quarter again we were in the -- let's call the mid-single digits positive, and then it flips slightly negative. So, by the time you looked at a 13-week data period at MPD, you're looking at transactions that are basically flat. If you look at sales data, given the fact that they're passing on inflation, it's masking that. So, as we look across the remainder of our fiscal year, what I would continue maybe to focus on is fortunately we are going to be lapping some softer comps. So, we do see line of sight to continued growth given the soft comps, it’s a business that we believe in, but their challenges are manifest and they're real. So, as we've shared this year, we'll be spending between $170 million and $190 million a heavy spend behind that Horse Cave expansion project. Today, we are looking at a number of growth scenarios on the business and as it relates to capital allocation, I think position one is supporting that growth. So, we're looking at potential greenfield, brownfield, expansions as well as potential acquisitions of existing dressings and sauce businesses to support the robust growth. Then beyond that we do think about M&A, but I think in our focus in the short-term is to take care our existing demand support the continued growth of the licensing platform with our capital allocation and then implement the ERP system and then potentially think about other alternatives to continue to support our growth."
}