{
    "symbol": "AAWW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 16:12:05",
    "content": " Welcome to Atlas Air Worldwide Holdings, Incorporated, Q1 2022 Results Conference Call. Today's call will be hosted by John Dietrich, our Chief Executive Officer, and Spencer Schwartz, our Chief Financial Officer. As indicated on Slide 2, we'd like to remind you that our discussion about the company's performance today includes some forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. For information about risk factors related to our business, please refer to our 2021 Form 10-K as amended or supplemented by our subsequently filed SEC reports. After we've gone through the queue, we'll be happy to answer any additional questions as time permits. Thanks, Ed, and thank you all for joining our first-quarter earnings call. At Atlas, we've been doing our part by providing critical airlift to many organizations moving relief supplies into the region, and as a leading provider of airlift to the U.S. Military, we've been supporting the U.S. government's significant supply efforts. As we've been able to demonstrate, Atlas has a resilient and proven business that's consistently delivered very positive results even through the most challenging of times. Our aircraft and services provide the flexibility, reliability, and speed that enables our customers to succeed even through the ever-changing logistical landscape. And airfreight will continue to be vital going forward, particularly as the -- as pandemic and related challenges remain, passenger capacity is slow to return, and manufacturing in Asia ramps back up. And as we've been discussing with you in recent quarters, we're seeing a sustaining shift in customer demand for long-term dedicated airlift, which is driving more need for Atlas’ assets and services. In fact, during the first quarter, our customers continue to enter or enhanced long-term agreements with Atlas for dedicated freighter capacity. On the financial front, we've significantly strengthened our balance sheet and have dramatically improved our net leverage ratio. We have a healthy cash balance and the financial flexibility to act quickly on attractive opportunities to deploy capital, including investing in our business and returning capital to shareholders. As we've previously noted, we're investing in our world cast feet - our world-class fleet, excuse me, by adding four new 747-8s and four new 777 to meet customer demand. All four of our new dash-8s have been placed under long-term agreements, and we expect the first will be delivered later this month. We also have a very strong interest for the new 777’s, and we look forward to sharing details on those placements in future calls. And as we've shared before, we're also purchasing five of our existing 747-400 freighters, at the end of their leases throughout this year. Now, turning to our outstanding first-quarter results on Slide 4. Our strong results reflected higher yields, including the impact of numerous new and extended long-term contracts. This was partially offset by higher pilot costs, driven by our new collective bargaining agreement. As I mentioned earlier, we expect market conditions and customer demand to remain favorable. Capacity continues to be constrained as there are a limited number of new freighters entering the market, while older, less efficient aircraft will need to be retired. And as it does, we expect passenger networks will look different than prior to the pandemic and will favor more leisure and point-to-point flying. In addition to our excellent first-quarter results, we expect strong performance in the second quarter and for the full year. In the second quarter, we anticipate revenue to exceed $1.1 billion from flying more than 85,000 bloc hours. In addition, we expect adjusted EBITDA of approximately $215 million and adjusted net income to grow by a high-single-digit percentage compared with our adjusted net income of $88.8 million in the first quarter of this year. Our full-year earnings outlook reflects the significant portion of our business under high yielding long-term contracts, as well as strong yields in the ad-hoc charter market. As a result, we expect to fly more than 350,000 block hours in 2022 with revenue of approximately $4.6 billion and adjusted EBITDA of about $1 billion. In addition, we anticipate adjusted net income in the second half of 2022 to improve approximately 60% compared with that of the first half of this year. We expect aircraft maintenance expense in 2022 to be similar to that of 2021, and we anticipate depreciation and amortization to be around $300 million. Our core capital expenditures, which exclude aircraft and engine purchases, are projected to total approximately $135 million to $145 million, mainly for parts and components for our fleet. This outlook also includes the higher pilot cost from our new collective bargaining agreement, including additional pay for pilots flying in locations still significantly impacted by COVID. Before I turn the call over to Spencer, I'd like to discuss the update we shared in our press release this morning regarding our share repurchase program. We began by entering into $100 million accelerated share repurchase program, which was recently completed. In total, we've now repurchased approximately 1.2 million shares through this month. I'd like to now pass the call over to Spencer, and after his remarks, I'll have some additional comments, and then we'll be happy to take your questions. On a reported basis, net income was $81.5 million. Moving to the top of Slide 7, revenue rose to $1 billion in the quarter. Higher airline operations segment revenue was primarily driven by an increase in the average rate per block hour, which was mainly due to higher yields, net of fuel, including the impact of the new and enhanced long-term agreements, as well as higher fuel costs. Slightly lower volumes during the period reflected a reduction and less profitable, smaller gauge CMI flying, as well as operational disruptions caused by Omicron and the lockdowns in China. Higher revenue in our dry leasing segment was primarily due to the expected $5 million of revenue received from a maintenance payment related to the schedule return of an aircraft, which we subsequently sold in January. Looking now at the bottom of the slide, segment contribution was $202.7 million in the first quarter. Higher airline operations contribution was primarily driven by higher yields, net of fuel. In Dry Leasing, segment contribution benefit from the maintenance payment I noted a moment ago, as well as lower interest expense following the scheduled repayment of debt. Our net leverage ratio ended the quarter at 1.5 times, which is consistent with year-end 2021. We ended the first quarter of 2022 with cash, including cash equivalents or restricted cash, totaling $740.9 million. Our cash position at March 31st reflected cash used for investing and financing activities, partially offset by cash provided by operating activities. Net cash used for investing activities was primarily for payments from flight equipment and modifications, including $150 million per pre -delivery payments for our new aircraft, as well as core capital expenditures and spare engines. Given the current rising interest rate environment, it's important to highlight that all of our debt is at a fixed rate, with a very low weighted average coupon rate, which is now at 2.83%. We are committed to maintaining our strong balance sheet which allows us to deploy capital for attractive investment opportunities, navigate unexpected events, and return capital to shareholders. And moving to Slide 9, as I mentioned, we're off to an excellent start in 2022 and we have a strong outlook for the remainder of the year. Our ESG initiatives capture our commitments to our people, communities and the planet, and also how we're advancing our ESG strategy and goals. Your line is open. You've added -- new planes are in the process of that buying leases, etc. Once the 777’s come in, are there more expected changes or how do you feel about the current fleet mix with what you've announced with 777’s coming in as question one. I'll start, and then maybe turn it over to Spencer for the latter part of your questions on the earnings part. But look, we're very happy with the composition of our fleet. You're right, we did consciously phase out of some of our less productive and less profitable assets and the older equipment we were flying earlier. And we feel good about all the fleet types we currently operate, starting with the 737, 800, which is a great fleet and is a exciting opportunity for new hire pilots. So, it really provides an exciting proposition for pilots who want to see the world or choose to do more domestic flying. So, we feel we've got the basis covered in terms of our composition with a focus on our widebody international capabilities. Going forward, one of the things we've said in the past is, we will look at other fleet types or enhancing our existing fleets. In fact, excited to take on one in May -- at the end of May. So, we're looking at all of those, and for the right opportunities, there's nothing we can't fly, I guess is what I would say so. So, on the earnings part of the question, I'll turn it over to Spencer. The other thing is that our aircraft are modern, efficient aircraft that customers want. We don't really provide profitability by fleet type, but certainly we expect four new -8s will contribute to our second-half earnings this year at a similar level as the existing -8s, perhaps even more so because they come with benefit of a maintenance honeymoon. And the 777s, they won't really contributed materially this year because the one is coming towards the end of the year, but that will generate similar earnings as our -8 in’23 and beyond. And I think your question was about earnings power and you can see, we provided a full-year outlook today. I mean, you've mentioned obviously that you -- that it's fixed at 2.8%, which is super attractive. So, we have paid all of the pre -delivery payments for the 747-8 s, we completed those last year. This year during the first quarter, we made a $150 million of pre -delivery payments and that is about nearly 2/3 of the amount that we need to pay. And so, we have about a 1/3 left that will pay over the course of the remainder of the year. It's when we take delivery of the -8s and put the financing in place, it will actually be cash-flow positive, which is great. And some of the financing on the 777’s because they're coming later as a set and some of that is still to be done, but we feel great about where we are with regard to all of that. So, with regard to passenger flying and capacity coming back, I think as John pointed out earlier, not all passenger flying is the same. And so, what we're seeing is that when -- firstly, is that the flying transpacific -- the passenger flying transpacific will be the last flying to come back. And then even when that flying does return, it's probably not going to look the same as what it looked like prior to the pandemic. And so, what we're seeing is that our customers are really focusing on dedicated freighters; the flexibility, the reliability, and the security that it provides. So, we're seeing more and more freight forwarders and manufacturers, direct shippers, coming to us. There's some concern out there that rates are starting to go the other way on charter, but also on some of the ACMI flying in the market. So, for the first quarter, ad-hoc yields held up extremely well. As an example, ex-Asia flying from Asia to the U.S. $ Including fuel, first quarter this year was on average $9.65, last year was $5.68, but that includes fuel. So, if you take fuel out, looking at the first quarter of this year, it was $8.07 excluding fuel, versus the first quarter of last year was $4.83 excluding fuel. So, you can see just how strong of a quarter that was. Now for the second quarter of this year, we think that yields are going to be sort of roughly in-line with where they were last year. Last year what happened was rates were lower in the beginning of year and then they really took off, and we think the would-be rates in the second quarter of this year are looking more similar to where they were in the second quarter of last year. And then overall, we expect spot yields to remain well above where they were there pre -pandemic levels driven by the shift in consumer demand patterns and continued lack of available capacity. And then, Chris, you mentioned, I think, transatlantic flying, and that's not really a big space for us. We don't really focus too much on that space that it can be handled by smaller gauge aircraft and passenger belly space, and we really focus more on the longer haul offline for the most part. But there's still well below pre -pandemic levels, and just some data that we have through Iota (ph.) is, even in the transatlantic it's still 42% of what it was pre -pandemic and -- on the transatlantic, and 10% on the transpacific. So, it's a long way to go still. And I know there's a lot of excitement, as there should be for international travel opening up, but there's still a long way to go. So, nothing that you're seeing is giving you concern that this supply dynamic is starting to unravel, if you will, for cargo operators. In fact, I think with what's happening in Ukraine, it's been an additional draw on capacity for the increased flying in some of the relief missions I talked about, which keeps in addition to other factors. Demand out there for the available capacity that's remaining, especially for U.S. carriers. So, JetBlue CEO said a week or two ago that he believes pay rates for pilots among the majors will gradually start to converge, and I know you just think the new deal here with your pilots, but as several of the large U.S. airline pilots have deals open now, are you concerned that pilot rates are going to go up across the board here? And first of all, let me just say, I'm just pleased with where we are now from a pilot labor standpoint compared to where we've been. Anytime you're in arbitration, there's a risk that you get some of what you want, but not all of what you want. And that proved true here and it enabled us to continue to work with the union and get agreement on additional provisions, which I'm pleased to say we did cooperatively and reached agreement and now, have fully implemented. But you're right, there are other contracts that are open and I expect rates will go up and not down. So, it's not as though a pilot is not going without a raise. With regard to the environment, it's not uncommon that carriers lose pilots, particular carriers in our space and the regionals when the big guys are hiring. That's not a new phenomenon, but it's something we're continuing to focus on. If you're a young man or woman pursuing a pilot career, you have the opportunity coming out to start with the 737 and work your way up through the biggest aircraft in the market, which I talked about in my comments. And we really have a great niche and my sense is that the overwhelming majority of our pilots are really happy to be here at Atlas, and that's what we're focused on delivering the quality of life and career path for them because we know they have choices. It's just not our business, but we value each and every one of our pilots, and there is pressure in the marketplace, that pilots do have choices. And then I think the pipeline of pilots coming out of the military but the flight schools, I think it's going to catch up eventually. I went to one recently, that the particularly university said they were inclined to shut down the flight program back in 2018, and they're glad they didn't because they are busting at the seams now, and can't keep up with the number of young men and women interested in pilot careers. But that's going to take some time to get those pilots fully trained and qualified to fly commercially, which is another area I think as an industry, we're focused on. And working closely with government, I think industry is looking for ways to make it more efficient and cost-effective for young pilots to get their commercial licenses, maximizing simulator time, expecting the roles: a $15 role for example who -- those who fly -- follow the industry know what that is. But look, we feel great about the company, the direction we're going, the value proposition for our pilots to build their careers here. Your line is open. When I look historically, you normally see a pretty significant earnings ramp from 1Q to Q2, at least on a percent basis. So, in the beginning of the first quarter, I know you're asking about the second, but in the beginning of the first quarter we were impacted by Omicron. In the second quarter now -- well, actually late in the first quarter, and then now in the second quarter we're having issues with the lockdowns in China. When we think about the sort of seasonality in our earnings pattern, traditionally, our earnings are higher in the second half of the year than the first half, although that distribution has changed a bit over the past few years, but we do have the majority of our capacity committed with customers on a long-term basis. And then of course this year we expect to take delivery of the 4-8s, one this quarter and three in the second half. The last question was asking about yields and so I just want to point out that right now, because of the lockdowns in China, manufacturing is not as strong as it was, and some of the manufacturing has stopped or slowed and some of the supply chain has stopped or slowed. And so, I think some people are misinterpreting that to mean that there's some sort of a slowdown. And when China opens back up, there's going to be a tremendous backlog of goods and there's going to be a lot more goods manufactured. And so, there's going to be tremendous demand for air freight and presumably higher yields as a result. That's all really helpful. And then, just a quick question on the salary, wages and benefits line for this quarter, it was up sequentially despite block hours down quarter-on-quarter. Just the prior-year, there's the new CBA, but on a sequential basis. So, on a sequential basis, we had higher premium paying, so we pay our pilots premium pay for operating into areas significantly impacted by COVID-19. And so, the premium pay payments in the first quarter were very high. In fact, if you're to try to charter model our salaries, wages, and benefits, I think probably the fourth quarter is more representative than the first quarter, interestingly. And when omicron came around, we had countries that had been taken off the red zone list that was eligible for premium pay. That's all really helpful. Your line is open. Historically, you said, I guess in last year or two, that about 5% of block hours that's tied directly to the ad-hoc charter market. So, I guess the first thing I'll say is that during the first quarter, as John noted earlier, we extended or entered into new contracts about 10 of those at great rates, hours and maturities. The majority of them now go through 2000 -- late’24 or early’25, and some of them go through the end of 2027. And then to your specific question, about 60% of our flying as an ACMI. Now, about 24% as long-term charter, about 6% is with the U.S. military, about 6% is South America. So, in our ACMI business, it is a -- these are fixed take-or-pay contracts, we have guaranteed monthly minimums, customers pay us a guaranteed rate per block hour. And then in the long-term charter contract, it's very similar, but instead of on a per block hour basis, it's on a per trip basis. For ACMI, customers typically fly 5% to 10% above and we expect them to be well above that, much higher than that this year. With regard to long-term charters, it's more on a per trip basis. So, we're flying the customers network on a per trip basis. We can, at times, work with the customer and try to increase utilization, but we really are trying to operate their network. So, there's not a tremendous amount of up flexing involved there because we're flying the customers’ network. Your line is open. So, in the first quarter, our salaries, wages, and benefits -- if you look at the increase in salaries, wages, and benefits in the first quarter of this year versus the first quarter of last year, about 85% of that increase was related to crew costs. And of that amount, about 2/3 was related to our new joint collective bargaining agreement, and then about 1/3 of that was related to premium pay. We've provided an outlook for the second quarter, and then we've said the full-year would be about 60% of -- the second half would make up 60% of the full year. I said that wrong, 60% greater than the first half is what we said. Well, it's both, in my opinion. So, utilizing other locations or some of the surrounding countries, Korea, for example, we've been effectively working with our customers. And then finally on the stock repurchase, it's great to see that AS are done last quarter. Well, as I said in my remarks, share repurchases remain a top priority, and we'll look forward to keeping you all posted. As you can see, we fairly quickly completed the first $100 million in that through the accelerated program, and I look forward to keeping you updated on more details. So, I just want to understand here, the utilization 9.6 hours in the quarter was below the tender so you did for the last three quarters, and I know that there's some seasonal -- seasonality here in 1Q, generally, a weaker quarter. Overall, airline operations utilization was fairly flat in the first quarter versus the first quarter of last year. And then additionally, as we've talked about this quarter, we experienced disruptions and cancellations driven by Omicron, especially in the beginning of the quarter. On an apples-to-apples basis, just wanted to get a sense of right because you're riding aircraft here, which ultimately drives keeping up. So really fairly consistent, slightly better flying on the existing planes. And given the order book here that you have or your implied account for this year, the 777. I don't think we're going to comment on 2023 today, but I guess I will say we'll be adding the 747-8 this year; one this quarter and three in the second half of the year. Next year, we'll have a full year of flying all of those. And so, we will have not quite a full-year of flying in’23, but then a full-year of flying in’24, and those are our most profitable planes. Their brand-new, modern, efficient, customers love them, they carry a high rate. I realize you're adding planes and it's not again, like-for-like. She's just trying to -- there is some concern here that the sustainability of rates here, but also what block hours can do at the addition of the 747 and chicken sevens. And as soon as things open up, what we're hearing from all of our customers is that things are going to be incredibly strong. But as I said in my comments, we think there's been a shift change in terms of the interest in dedicated freighters. And even when some capacity comes back, which anytime capacity comes back, it could potentially put pressure on rates. So again, we think that favors both the volume and rate environment for airfreight and has created a whole new customer basis of customers that have historically not contracted for dedicated airfreight. And so that demand, that increased demand helps offset some of the concerns in my opinion that you're talking about. Your line is open. Picking up on some of the macro stuff Chris was talking about, I appreciate that the customers are seeing the value of dedicated air freighters, but there's a lot of debate about how much of an inventory  going on outside of semiconductors and chips. And the average -- given how much consumer spent on goods in the last couple of years and the inflation rates you're experiencing, your savings rates will come down a lot. I'm just kind of curious, just to play devil's advocate, how you're thinking about thinking about that. Well, I think we've described how we're thinking about it. And Tom and I appreciate it, what you've said, but I think there are a number of countering positive factors that we're showing. We fully expect and as we've said before, things will moderate. But I think for all the reasons, we've said, the favorable factors outweigh some of the concerns that both you and Chris have identified. But again, our focus on -- and one of the reasons why things are starting to settle a little bit and why we elected to go with full-year guidance, as you know, we hadn't done that for a number of quarters because of the lack of clarity and the volatility of the pandemic and some of the supply chain issues. And with as much of our capacity locked up for years, this is not just a’22, for years going forward. I think there's validation in the decisions, the choices that very sophisticated purchases of our services and aircraft capacity are aligned with what our view of the market this year. But based on the visibility and the strength of the market, we felt comfortable giving full-year guidance for this particular release and look forward to keeping you posted, and look forward to keeping our head down in continuing to deliver as we've done up to this point. And on behalf of all of us at Atlas, Spencer, I want to thank you for your interest in Atlas Air Worldwide."
}