{
    "symbol": "ACM",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-14 23:20:14",
    "content": " Please turn to the next slide. Please turn to the next slide. Please turn to the next slide. This guidance is based on accelerating organic NSR growth of 8%, which is underpinned by our strong backlog position and a 20% increase in bids and proposals submitted in our design business. Please turn to the next slide. In the fourth-quarter, we delivered our highest organic NSR growth in the design business in nearly a decade, our margins for the year reached a new all-time high and exceeded our guidance and strong cash flows supported our shareholder value focused capital allocation policy. Please turn to the next slide. NSR in the Americas design business increased by 5% in the fourth quarter, which was the highest-growth rate this year and reflects the continued acceleration we saw throughout the year. We had a 1.2 book-to-burn ratio in the design business in the fourth quarter, which resulted in 9% total backlog growth in the design business to a record high and our contracted backlog also increased. Please turn to the next slide. Please turn to the next slide. Please turn to the next slide. Well, that business grew over 30% this year and has us well on track to double it in that two-year period and that's a very specific investments that we're making to deliver today but also build into the future. We are -- I think, I've mentioned this before, right, we're always committed to driving profitable growth in our business while at the same time being very cognizant of markets that may not meet our hurdles; our hurdles on ROIC growth, margin profitability and cash conversion. If they don't meet those in the small mid to long-term in those markets, we will prune them and we will always hold ourselves accountable to deliver as high a return on invested capital returns to our shareholders as we can and a great example of that is, we've already increased our ROIC target from 15% to 17% based on these small tweaks and pruning is what I would call, have led to better working capital conversion, better profitability, better growth and really focused on in geographies and markets that have been the long-term fundamentals to support the growth strategy we've employed."
}