{
    "symbol": "ACM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-09 15:47:01",
    "content": " Please turn to the next slide. Please turn to the next slide. Please turn to the next slide. Please turn to the next slide. Please turn to the next slide. Please turn to the next slide. Please turn to the next slide. So again, when I look across the business, as a long winded way of saying, I think all of the businesses that we’re in today and around the world are enclosed in some really good looking long term trends and we see ourselves positioned to take advantage of it as we continue to progress forward. Obviously there is a discussion of a possible slowdown or a recession, but again, it’s not something we certainly ever hope for, but you always have to be prepared for it, and I think we’ve shown in our business through the last years that we’re agile and we have the ability to react, but also there are some really good inherent attributes in our business and that gets to these large investor megatrends and high quality clients that we have, the significant long term backlog that we have, and it's also important that we have an asset light business. But if you look at what's happened in the first half, comparing to some of our peers, where they have seen margin contraction, our teams, our professionals continue to deliver year-after-year, quarter-after-quarter of margin growth consistent and ahead of expectations, and this was while we're making significant investment in the business. So irregardless of what the macroeconomic headwind may be, you know let it be inflation or another variant or geopolitical issues, logistical issues as Troy articulated earlier, we continue to deliver on margin targets, and that's why not only are we very confident in our 2022 target of 14.1% plus, but 2024 targets of 15% plus and our long term ambition of 17% that we feel very confident as time passes by, because of how our teams are delivering and leading the industry. At a high level what we would expect is, a lot of activity with our client positioning for that funding, followed by a very strong award season in the second half of this year and heading into ’23, and then we would expect to see the impact of those awards, impact our business in ‘23 and beyond and for a long period of time. Please Andy, your line is now open. Obviously not your seasonally strongest quarter, but not seeing a lot of inflection yet, so maybe Gaurav if you could decompose a little bit about that what the differences between the relative growth rates in construction management versus the underlying Americas design business would be helpful, and us understanding and assessing the net service revenue growth in the quarter. I'll take your first part as to what would the impact of the omicron variant – and Andy, I’d like to start by saying, you know consistent with the question Alex had, irregardless of the macroeconomic headwinds that comes through, one thing we're very proud of is our teams are nimble irregardless of what it is to continue to deliver to our target and not using anything as an excuse, and a lot of it is by design, right. But also, there is a lot of new money that’s coming to the market where our – you know again, these are new programs and new processes and so we’re spending a lot of time actually having conversations with our customers about how they access that money and that was even one of the important things we did during the quarter, was we actually built a tool to make ourselves a little bit more user friendly and expedite that process with clients, and we talked about our IIJA too; Lara did in our prepared remarks. And so that's an important tool that allows those conversations to pick up momentum, and along with our professionals allows our clients to sort of how they quickly access that money to accelerate their programs, but again as I said, we don't see that having a significant impact on our business until we get to 2023 in terms of generating revenue. Please Andy, your line is now open. We're winning these big projects that we think are important to us, at a very high win rate in what we’ve defined as being important to win, and we're seeing again backlog growth higher than the average in our program management business as well. Yeah Mike, we will always be focused on investing in the business and keeping our eye to the future, and that's because we have a lot of confidence in what we're delivering and the commitments that we have made today for fiscal year ’22, including our 2024 plans."
}