{
    "symbol": "VTYX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 07:23:05",
    "content": " Before we begin today, I would like to remind everyone that, this conference call and webcast will contain forward-looking statements about the company, including without limitation statements about the anticipated timing of commencement, enrollment and completion of clinical trials for our product candidates, the anticipated timing of release of clinical trial data, the market opportunity for our product candidates, and the expected time frame for funding operations, with current cash equivalents and marketable securities. We will dose VTX958 to achieve exposures in our Phase 2 trial across the range that includes IL-12 and IL-23 target coverage that approximates Sotyktu exposure levels that we -- at the approved dose of six milligrams QD which would provide IC-50 coverage for approximately nine hours, as well as doses that would achieve exposure levels that we anticipate would provide trough coverage of TYK2 around the IC-90 level. More importantly, we've shown clinical differentiation in terms of target coverage, as well as the safety, which is the key to achieve meaningful coverage of IC-50 and IC-90 and Bill, during the Phase 1 data dissemination actually compared with Deucrava and the competitor compound in terms of what has been seen across head-to-head trials in Phase 1, in terms of significant effects on dermatological effects as well as other hematological effects as well. So we believe with our profile that we've demonstrated, again, on a molecular basis against Sotyktu and more importantly on a clinical basis for what data is publicly available, remember, for Deucravacitinib and the competitor compound that you just mentioned, we have shown meaningful differentiation, target coverage, but more importantly ability to cover the target IC-50 and IC-90 for 22 to 24 hours without any significant impact on being able to dose escalate, given the profile of VTX-958. But what we can position ourselves is what we've seen thus far, which is again the safety manifestations of safety events that have shown up for these compounds, Deucrava and the competitor versus what we have seen, which is a very well-tolerated program, or molecule, all the way up to the highest dose in MAD, ability to cover the target IC-90 for 22 to 24 hours and few to mild events that Bill had shown, compared to what competitors have shown in head-to-head trials. And the difference between three BID or six ones a day and then stepping up to six BID or 12 ones a day you improve by as much as 70%, 80% the IC50 coverage going from eight or nine hours to maybe 15 hours but the IC90 coverage is not hit at all in any of those doses And recall in Phase 1 with deucravacitinib as you went up to 12 BID, you had 78% of patients having skin adverse events."
}