{
    "symbol": "VTYX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-13 15:30:20",
    "content": " Before we begin today, I’d like to remind everyone that this conference call webcast will contain forward-looking statements about the company, including statements about the timing of commencement, enrollment and completion of clinical trials, the anticipated timing of release of clinical trial data and the expected timeframe for funding operations with current cash, cash equivalents and marketable securities. So again, the key to achieving this potentially best-in-class target profile really comes back to the design of our molecule to what I call our chemistry craftsman, who built 958 to be highly selective for the allosteric domain of TYK2, and our preclinical work has demonstrated that 958, VTX958 inhibits key TYK2 pathways, such as IL-12, IL-23 and interferon-alpha, while eliciting virtually no, I repeat, no detectable inhibition of JAK1 pathways or any other JAK pathways, and JAK1 pathways, in particular, cytokines, such as IL-6, IL-10, IL-22 and others. Our team is off to a great start, and we look forward to a number of milestones over the remainder of the year, including top line Phase 1 data for VTX958, our TYK2 inhibitor in early Q3, initiating three potential Phase 2 trials for VTX958 in the second half of the year, top line Phase 1 data for 2735 later in Q2, continued execution on Phase 2 trials for VTX002, and an IND filing for VTX3232 by year’s end. Your line is open. Your line is open. So we’re committed to driving value across the clinical pipeline regarding our lead asset, the TYK2 and 958, obviously expect to generate meaningful proof-of-concept efficacy data with a drug across psoriasis, psoriatic arthritis, Crohn’s disease and even possibly lupus with Phase 2 trials kicking off. Your line is open. Your line is open. Your line is open. Your line is open. So that you’re sure as you switch from healthy volunteers into larger disease trials that you really achieved the lymphocyte reduction that you set out to achieve, and some of the examples you were giving, you can see some slippage between Phase 1 and Phase 2 in terms of how much lymphocyte reduction there is, and that’s often because the final selected dose backs away from what was seen in Phase 2 with our Phase 1 with dose titration that really maximizes that."
}