{
    "symbol": "PRG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 14:50:14",
    "content": " During this call, certain statements we make will be forward-looking, including comments regarding our expectations related to the benefits of our lease decisioning adjustments on delinquencies, write-off levels and our accounts receivable provision, Progressive Leasingâ\u0080\u0099s write-off levels for full year 2022, our ability to convert additional retail partners from our pipeline, the strength of our balance sheet going forward and our revised 2022 outlook. Our attention to early indicators of payment performance and the decisive steps taken to impact the short-duration portfolio have quickly benefited overall portfolio health, as can be seen by the 7.2% write-offs for Progressive Leasing for Q3 and in the improved profitability from last quarter. Q3 GMV for the Progressive Lease segment was down 11.3% year-over-year, driven primarily by macroeconomic factors, including a double-digit year-over-year decline in addressable categories at many of our retailers and our tighter decisioning, partially offset by increases in our balance of share in many key retail partners. SG&A for the Progressive leases segment was $75.2 million or 12.4% of revenues versus $80.2 million or 12.6% for Q3 of 2021, a decrease of $5 million. Iâ\u0080\u0099ll note that adjusted EBITDA for the Progressive Leasing segment improved meaningfully from $51.2 million in Q2 to $68.4 million in Q3 and margins improved from 8.1% in Q2 to 11.3% in Q3, driven primarily by the improvements in write-offs of SG&A. I would just expect, while we made a ton of progress here in Q3 on SG&A, Iâ\u0080\u0099m proud about where weâ\u0080\u0099ve been from an execution standpoint on that cost reduction plan, 12.4% is a number that is more reflective of where weâ\u0080\u0099re at before we became a public company in 2019. And so weâ\u0080\u0099ve done a lot of work there, but thereâ\u0080\u0099s still going to be -- I expect to tick up probably in SG&A into Q4 with just those transactions costs with a higher GMV volume coming in, in Q4 than we expect relative to Q3, and thatâ\u0080\u0099s going to put a little bit of pressure as our expectation. So weâ\u0080\u0099re expecting similar results in Q4, which we think will get us near the high end of our 6% to 8% annual range, which weâ\u0080\u0099re proud of, especially given the impact of earlier this yearâ\u0080\u0099s performance on the portfolio."
}