{
    "symbol": "PRG",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 11:35:12",
    "content": " From a GMV standpoint, in addition to the consumer stress, potential declines in average ticket and potential deferred purchases that I just mentioned, because of our tightening of lease decisioning in late Q2 of 2022, we expect GMV results to be pressured in the first half of 2023 as we comp against higher approval rates from last year. Our portfolio management and cost actions resulted in year-over-year adjusted EBITDA growth in the fourth quarter, despite a 5.3% decline in revenues, which when combined with a materially lower share count resulted in a 25.4% increase in non-GAAP diluted EPS for the quarter, compared to Q4 of 2021. Consolidated adjusted EBITDA increased 3.2% to 74.4 million in Q4 2022 from 72.1 million in Q4 of 2021, driven primarily by improvement in gross margin and progressive leasing from a lower accounts receivable provision and declining 90-day buyouts, as well as lower SG&A expense year-over-year. Your line is open. Yes, I would just say this is â\u0080\u0093 it's kind of a confusing one for me because as we've talked about on several calls, this has been an expectation in mind for a while that as you â\u0080\u0093 that should have happened already, but as you're looking at the cash reserve data and the savings rates, certainly, our customer was impacted more quickly than the prime customer. Your line is open. Your line is open. And sort of along the lines of that, I guess my question more broadly is just for this year for 2023, if I compare your P&L for what's expected for 2023 versus what we saw like pre-pandemic in 2018 or 2019, I think we're still, I think margins are still below where you want them to be that like 11% to 13% target. I would just add and Brian can keep me on , but your point about the AR provision and bad net expense, I mean, while we're happy with where the portfolio is and proud of the actions we took last year to get the write-offs where they are and the portfolio where it is, we do expect   to â\u0080\u0093   is also none to be higher than â\u0080\u0093 better than 2022 and comparable, but still higher than the pre-pandemic levels by some measure. Your line is open. Your line is open. Your line is open."
}