{
    "symbol": "PANW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-02-22 21:06:06",
    "content": " I am Clay Bilby, Head of Palo Alto Networks Investor Relations. With me on today's call are Nikesh Arora, our Chairman and Chief Executive Officer; and Dipak Golechha, our Chief Financial Officer. Our Chief Product Officer, Lee Klarich, will join us in the Q&A Session following the prepared remarks. In the course of today's conference call, we will make forward-looking statements and projections that involve risk and uncertainty that could cause actual results to differ materially from forward-looking statements made in this presentation. Risks, uncertainties, and other factors that could cause actual results to differ are identified in the safe harbor statements provided in our earnings and presentation and in our SEC filings. We have included tables, which provide reconciliations between non-GAAP and GAAP financial measures in the Appendix to the presentation and in our earnings release, which we have filed with the SEC and can also be found in the Investor section of our website. As you've seen by our results, we released, we had an exceptional Q2. We continue to accelerate the growth of our business in line with our stated direction of fiscal year 2022, being the year of focused execution. First, let's talk about the market and the trends we're seeing. Firstly, we continue to see a strong demand for cyber security. On the contrary, we see acceleration around trends associated with the shift to the cloud, as well as continued efforts to redefine network architectures, to enable employees to work effectively from anywhere, a trend which has been bolstered by the pandemic and we continue to believe we are still in the early innings here. With increased alliance on technology in the prevalence of cyber-attacks, there is an ability to disrupt businesses and critical systems making cybersecurity an area that will need continued focused investment. In addition to industry specific trends, we're seeing a trend that is unique to Palo Alto Networks. Given our investments in the areas and continued relevance across multiple platforms and needs of our customers, we're having more and more significant partnership conversations, which encompass the entire Palo Alto Networks offering. Whilst early, we believe this is the true differentiation that Palo Alto Networks provides both best of breed and integrated security that works. We will talk about the innovation across our platforms, but to highlight just today, we unveiled our XSIAM product, which is poised to reimagine security operation centers and truly deploy technology to resolve cyberattacks in real time. Execution from our people leaders means despite this being a hot market for great talent, we're able to attract and retain the best minds in cybersecurity. In Q2, revenue was up 30% while the leading billing and RPO metrics up 32% and 36% respectively. As we hit our midyear point, we have greater confidence that our strategy is working, which is driving us to make further investments in these businesses. At the same time, we continue to transform our core network security business with a software mix within our Firewall as a Platform billings came in at 40% up five points versus last year. To accelerate these results as we exited fiscal 2021, we layered on a sales strategy to elevate our focus and drive efficiency in our largest opportunities. With a growing portfolio of products across the platforms, making large deal selling repeatable process is core to our sustaining and accelerated growth trajectory. As a Testament to this, at the end of Q2, 47% of our Global 2000 customers use products from all three of our platforms up from 38% a year ago. In Q2, we closed 221 seven-figure transactions, including three transactions over $20 million. Our millionaire customers were 1077 in Q2, up 26% year-over-year. Our combined rate of growth in millionaire customers, as well as an increase in size of our large deals has helped us sustain the accelerated level of growth we've seen over the last several quarters. In all, for the strong quarter I want to thank our global teams for their strong execution across the board. In particular this quarter, our strengths were well balanced in both of these. As you know, we have them design modularly, so the customers can initiate their partnership journey with Palo Alto Networks, whatever their current need is. But over time, we work with them to both expand across any one of our platforms, and also work with them to adopt our other platforms in line with their plants. This is a fuel for our growth, especially in next-generation security, where we play in markets that are early in their life cycle. In the first half of fiscal year, 2022, we had 22 major product releases, which is equal to all the releases we had in the full year of fiscal 2020. Even more impressive is that this quarter, marks the end of all, integrations of our acquired businesses over the last few years, i.e. We were also pleased to receive two new industry awards, adding one in developer security tools and other in secure web gateway. Focusing first in our firewall business, we’re continuing to refresh our platform. And just last week, we announced two more new families with the PA-3400 and PA-5400. We also rolled out PAN-OS 10.2 Nebula release, which adds significant new capability in using machine learning to stop the current generation of highly malicious attacks in line. This capability powers our recently released advanced URL and new advanced threat prevention subscriptions, as well as brings significant enhancements to the capability of our DNS security subscription. This contributed to our Q2 revenue upside and was the head of our guided mid-teens growth for the full year, which we will be raising. Strong security demand, innovations we are bringing to customers such as our Nebula release as well as customer appetite for our Gen 4 gives us strong conviction and sustained product demand into fiscal year 2023. Next, I want to spend some time in our NGS business. This is one where our teams have done work, which I personally believe has not been done in the cybersecurity industry before. We have built a formidable set of services, which are cloud first, and these services are resonating with our customers. This success is truly driven by us working with our customers to anticipate their challenges, delivering best-of-breed solutions in an integrated fashion whilst continuing to focus on security outcomes. This has resulted in us building an NGS, ARR stream of $1.43 billion driven by billings growth to 79% in NGS. We’re also seeing marque new customer wins, which are reflected in our current customer count of 19,083, which is up 62%. We are pleased to against stand on Okta’s Business at Work report, where we were identified as a leading provider of remote access solutions. With these customers, looking to Prisma SASE to deploy DG capabilities. We rolled out integrated CASB within Prisma Access 2.0, including a new capability around inline DLP for SaaS, and in particular collaboration and applications. On the cloud front, we’re seeing mainstream adoption of hyperscale public cloud in our customer base, as well as an acceleration and production workflows. Four years ago, we made it a conscious strategy to be a first mover with multiple big bets to proactively invest or believe the future of security was going. We developed a unique go-to market approach, allowing us to promote future modules as part of an integrated offering. While our active customers grew 21% to 1,810 in Q2, we saw north of 56% growth and credit consumptions driven both by increased adoption on the cloud by our customers and their continued adoption of more security modules in Prisma Cloud. While our two core modules, cloud security posture management and cloud workload protection are mainstream within most of our customer base. First, the launch of cloud code security, and second, the launch of agentless scanning. Approximately one year ago, we acquired Bridgecrew, which has strong early attraction in DevSecOps enabling security to be shifted left into the software development life cycle. Bridgecrew had significant traction with its checkout open-source tool, momentum that has significantly accelerated since its acquisition closed, and downloads are up to 5 times year-over-year. Building on the Bridgecrew technology, in Q2, we released our fifth Prisma Cloud pillar, cloud code security, which is part of our 3.0 release. You’ve seen a number of smaller provider focused on small initiatives in cloud-native security, providing only agentless scanning is one of them. What we hear clearly from a customer is that they want a platform approach to cloud security, which offers the flexibility of both agent and agentless scanning, depending on their architecture and security needs. Now turning to Cortex, our endpoint security, security analytics and automation solutions. We’re seeing strong customer adoption of our market-leading technologies across XDR, XSOAR and Xpanse. Total customers across XDR Pro and XSOAR reached 3,232 and increased over 69%. Q2 was a strong quarter for new customers, both those that are brand-new to Palo Alto Networks and also cross-sells to Cortex. At our Ignite event last November, we launched our managed partnership program, XMDR, and we continue to see partners join the program to further align the opportunity across our Cortex portfolio. Core to our growing success with Cortex is the innovation investments we have made over the last years in XDR, XSOAR and Xpanse with market-leading capabilities in each. Shortly after leasing XDR 3.0 in Q1 to enable cloud detection response, we release XDR 3.0 – 3.1 in Q2 to further enhance our cloud asset visibility and insights. This morning, we announced our Cortex extended security intelligence and automation management, or XSIAM, platform and shared our vision to provide an autonomous cybersecurity solution as a modern alternative to SIEM solutions. We believe security operations teams have an urgent threat detection remediation problem, and only by leaning into a natively AI-driven platform, we will be able to bring down response times from hours and days to seconds and minutes. We’re on a mission to revolutionize how data analytics and automation is leveraged in cybersecurity, and XSIAM is a product of years of research and development we’ve been doing in this area. We both continue to benefit from strength in our core next-generation firewall business and is a strong sign of our future growth prospects, significant strength across our next-generation security portfolio. On the back of this trend and based on what we’re seeing in our pipeline heading into the second half of fiscal year 2022, we are raising our total revenue, product revenue and total billings guidance for the year. Within this top line, given our confidence in both our pipeline and our sales execution NGS, we’re also raising NGS ARR for the year. Lastly, we’re delivering this top line while we continue to make significant investments in our business for future growth. We not only continue to see strong near-term demand but also strong medium-term trends in cybersecurity, fueled by underlying spend in IT spending and secular trends like hybrid work and cloud-native adoption. Despite this, we have been able to deliver upside to our non-GAAP EPS forecast so far this year. We're lifting our non-GAAP EPS guidance here, reflecting much of the upside resulting in Q2. Top line growth remains strong in Q2 with balance strength across our portfolio, including product and especially in our next generation security offerings. For Q2, revenue of $1.32 billion grew 30% and was above the high end of our guidance range. By geography the Americas grew 33%, EMEA was up 22% and JPAC grew 23%. This demonstrates that our portfolio approach to driving growth in our high growth markets is working and what gives us confidence to rate our – raise our guidance here, which I will talk more about shortly. In the second quarter of 2022, we deliver total billings of $1.61 billion, up 32% and also above the high end of our guidance range. Total deferred revenue in Q2 was $5.4 billion, an increase of 31%. Remaining performance obligation or RPO was $6.3 billion, increasing 36% with current RPO growing largely in line with total RPO. As mentioned previously we believe RPO adds meaningful insight into our future revenue, as it includes both prepaid and contractual commitments from customers. Our product growth was 21% in Q2 and above what we have seen historically, reflecting strong customer demand for our appliance and software offerings. Within our firewall as a platform business, we saw billing growth 26% in line with the growth we have seen over the last year as customers purchased hardware, software, and SASE form factors. Within FWaaP, our software mix increased 5 points to 40%. Turning to the details of our results, product revenue was $308 million growing 21%. Subscription revenue was $618 million, increased 34%. Our non-GAAP effect tax rate was 22%, our GAAP net loss was $94 million or $0.95 per basic and diluted share. Cash flow from operations was $483 million; we generated adjusted free cash of $441 million, a margin of 33.5%. In QT we again balanced multiple financial priorities with strength in both top line, underlying non-GAAP profitability and in cash conversion. We have approximately $450 million remaining on our authorization, for future share purchases expiring December 31st, 2022. As we noticed at Analyst Day, we continue to focus on managing down our stock based compensation as a percentage of revenue. This quarter we reduced SBC by about two points zero over year, as we apply our overall discipline to this process, whilst balancing the current market for cyber ready talent. Similarly, we talked about an aspiration for achieving the rule of 60 combining revenue growth and adjusted free cash margin. You will see that with the revised midpoint of our fiscal year guidance, we are now expecting to achieve this once aspirational goal. As Nikesh highlighted, we continue to see very balanced demand. This includes demand from our appliance form factors that outstrips our ability to fulfill them in the short-term, as well as strengthen our next generation security portfolio. Turning to our guidance for the third quarter of fiscal 2022, we expect billings to be in the range of $1.59 to $1.61 billion, an increase of 24% to 25%. We expect revenue to be in the range of $1.345 billion to $1.365 billion, an increase of 25% to 27%. For fiscal year 2022 we expect billions to be in the range of $6.8 million to 6.85 billion, an increase of 25% to 26%. We expect revenue to be in the range of $5.425 to $5.475 billion, an increase of 27% to 29%. We expect NGS ARR to be $1.725 billion to $1.775 billion, an increase of 46% to 50%. We expect our non-GAAP tax rate to remain at 22% for Q3 2022 and fiscal year 2022, subject to the outcome of future tax legislation. For Q3, we expect capital expenditures of $40 million to $45 million. For fiscal year 2022, we expect capital expenditures of $185 million to $195 million, which includes $39 million outlaid in Q2 related to our Santa Clara headquarters. Nikesh, maybe I'll start off with a product question since it's hot off the press this morning. Thanks for the question. Look, when I came to Palo Alto Networks, our mean time to respond at Palo Alto Networks was measured into days. And for someone who did not work in the security industry, I found that a little flabbergasting because if it takes tens of days to figure out that you've been breached and all you're doing is closing the door after somebody is gone. So we challenged our team internally, said can you take that and turn that into seconds or minutes because that's the only way we're going to have a chance to be able to protect not just ourselves, but our customers in the future. That required us internally revamp from having north of, I'd say 15 to 20 other security vendors even in our infrastructure down to less than 10 because there are some areas, as we don't play in cybersecurity. But that coupled with automation, with data analytics; we're down at Palo Alto Networks just under one-minute as a mean time to resolution, which is how we can resolve Log4j within our company or SolarWinds within our company. You add all those features to an old car or is an a new car, but doors between around 20 years that doesn't make it an autonomous vehicle. The future of protecting our customers will have to depend on being able to analyze data on the fly, immediate on the fly, not wait for humans to analyze it and come back 10 days later and say now I know what happened. So towards that end we have launched XSIAM, it is an early release working with a handful of design partners to work with them to go replace to security infrastructure and align with what we've done at Palo Alto that allow us to learn and to build with them, but we expect this product will be GA-ed later in the year, really excited. The way it leverages our portfolio is we can do it quickly if you're using Palo Alto appliances, Palo Alto firewalls, Palo Alto endpoints. I have a balance sheet – I'm limited to one question, so I'll just ask the question that no one else will ask probably. Also, I'm looking into your SBC; it's getting to $290 million this quarter almost. It's a big number and if I go back, you're not profitable if I take into account SBC, and that has been the historical trend. As you've noticed, we have not done any significant M&A in the last two or three quarters. And then over the next year or so, 1.5 years, you'll see significant rollout. In addition to that, as Dipak highlighted we are working hard to make sure that the normal SBC continues to be managed down. And of course, as you know, as a percent of revenue, if revenue keeps going up, it also acts as a benefit towards that direction. So we will talk more about what our forecast to achieve GAAP profitability as we lap Q4 this year because we'll have more visibility on the M&A stuff, but I will let Dipak add to that and as well talk about the balance sheet item. I think the only thing that I would add is like what we found in the company is when we really focus on something, we find opportunities. Just as you saw from the Welcome Home video, we want to make sure that we get the best talent as well. On your balance sheet question, Tal, like a couple of different points. The 2023 and 2025 notes eligible for early conversion from February 1st to April 30th, 2022, due to the share price exceeding the price thresholds. Those notes continue to be classified on the balance sheet as current liabilities in Q2, unchanged from Q1. So two parts; one, as you probably heard from everyone in the industry who's in the hardware business, demand is outstripping supply. I suspect it partly has to do with supply, partly has to go volumes going up at a pandemic, inflation expectations. And as I said, our ability to supply despite the 21% growth, still demand outstrip that 21% number, which is why you see our RPO continuing to rise. In terms of the ability for us to leverage hardware, and I'll highlight a metric we shared last time, that 25% of our customers in SASE are – were net new to Palo Alto last quarter. And typically, those conversations, Brian, are hey, while I love your security platform, I love your security policy, I'd like to deploy it, but my firewalls are still around, and they have two, three years more to go. In that case, we end up with a SASE deal with the expectation that over time, when that customer consolidates their firewall, it gets to be a Palo Alto, end-to-end Zero Trust execution because the only way to do Zero Trust right is to make sure your hardware, your cloud and your remote users are all consistent in terms of security policies used. In some cases, its customers doing a replacement of some other hardware vendor with Palo Alto networks because now they already deployed SASE in their environment. And one of the beautiful features some of the subscriptions I laid out, whether it's autonomous monitoring or AIOps or DNS Security or filtering, et cetera, we can make that happen consistently for our customers across both platforms. So the NGS ARR grew really nicely, and you raised the full year guide on that, too, which you normally don't do midway through the year. The Prisma SASE, Prisma Cloud doing really well, as usual, it seems. Thanks for the question. Look, I think this was an all-out quarter strength across every NGS category, whether it's cloud, SASE or Cortex. More and more conversations are around where customers are coming to the point they're saying, yes, I cannot do this with the cloud-native tools because I've got multiple cloud providers I'm dealing with or I cannot do this with the next start-up from two guys who started it, and that can cover one sliver. Because honestly, if I was going to replace security capability with a start-up capability, AWS, Azure, GCP already had that capability. But just to give you an example, if you deployed security using one cloud provider, whether it's AWS or GCP or Azure, you'd have to integrate ten of their modules to get one Prisma Cloud. So, we've already done that not just within their tools, also across all public cloud providers. So, that's why the consolidation of security capabilities in Prisma Cloud makes sense. It's closing in on 2,000 customers, 80 of the Fortune 100. You're seeing not only are we benefiting from people adopting multiple modules, but also benefiting from the fact that their native sort of production workloads are going up. And at Palo Alto Networks, I will tell you, our consumption of public cloud has always outstripped our forecast because of the success we're seeing in our NGS portfolio. In Cortex, I'd say, again, remember three years ago, we didn't have any of these products at Palo Alto Networks. And look, I know we didn't have this product two years ago. Hamza, it's a good question. I think fundamentally, the way I look at it is you're comparing apples and oranges a little bit here. And so if you have like one deal that happened to be a long duration, right, you will get more billings and ARR within that quarter. So, I think the last quarter, our NGS billings grew less than the ARR, which is why – I'm probably more in the camp of let's just focus on NGS ARR. I just wanted to focus in on Prisma Cloud, Nikesh, maybe inception that question into my head with your fleece. But you mentioned increased attached to production environments as well as just being early in terms of consolidation, the functions at Palo Alto. I'm going to hand over to Lee because I said if Lee doesn't answer a question, he won't come to the next earnings call. We've deployed an adoption team on Prisma Cloud in the last six months, which is seeing phenomenal outcomes. And also, I want to say – I want you to intake it the right way. Competitively, the option is customers are not ready to go to a production quality, high-end and fully integrated cloud security platform. It's usually, we either lose against ourselves because the customer would rather stay where they are. But in the case of cloud, it's usually based on the customer needs. There's a couple of, I think, key trends that we're seeing. One, and following on to what Nikesh was saying, there were a number of companies, probably early adopters of cloud, that built a lot of their own tooling, used a lot of open source. A couple of years ago when we talked to them they would say, “No, no, no, we've got this covered. We're happy to maintain them.” And many of them are now coming back to us and saying, “Actually, it turns out, this is more work than we thought it was.” It's surprising just how many distinct APIs exist in each of the different cloud products that you have to integrate with, pull data from and understand. And again, early on, we saw it was, I just need compliance in the cloud. And now we're seeing customers fully understand the needs across all different five pillars that we have, and the importance of each of those and our ability to deliver on those. And lastly, I'd say, we've actually gotten fairly good, and we continue to work on this of building in-product adoption capability. So, we're not just dependent on people, customer success and adoption folks talking to our customers about adoption of new modules. We're building that into the product natively, suggesting to the customer what they need in order to be most secure, and we're seeing that drive a lot of adoption. Obviously, there's a lot more adoption we're going to see in the future, but I do think that we're seeing that inflection point. Our next question comes from Brent Thill of Jefferies with Rob Owens to follow, right. Nikesh, just on the demand environment, everyone is curious to hear your view on the strength of the pipeline relative to a year ago. So, we must be taking demand away from somebody else, whether it's us taking or Fortinet taking it, clearly, we're taking some demand away from somebody else. Look, some of it is pent-up demand where people did not have anybody to go into the office and go deploy a firewall because nobody was going to the office. We have now refreshed more than 65% of our portfolio, and that's still only three months in. So, we're still seeing demand for Gen 4 products being created at Palo Alto Networks. And I think, to some degree, there's a little bit of fear that they won't get the firewall in time, so people are ordering to get them. But I think we will still – as I said, we’re going to see this into fiscal year 2023 at least, and we’ll keep you posted. Look, I think it’s fair to say, in the large enterprise customers, the model hasn’t changed from a channel perspective. On the margin, as you will appreciate, almost all cybersecurity products are slowly and steadily being listed on public cloud marketplaces. So all of us, including Palo Alto, we’re seeing some customers buy on those marketplaces. We’ve got an embedded native firewall than GCP, and you can deploy it by accessing it to the marketplace, you will. In some cases, people are using unused credits on public cloud marketplaces to be able to buy security because that’s a feature that public cloud marketplace have offered. There’s a bit of a arms race amongst themselves, a channel where the more qualified people are likely to get more customers to buy it from them because – and it’s not always the person you use for your firewalls. Nikesh, last quarter, you sized the pull-forward at about 10% of product orders. So Gregg, on the first part, I think it’s – there’s a net wash. There’s a pull-through, but there’s a lack of ability to fulfill. So whilst I might be seeing a pull-through, you’re not seeing in my product revenue because that’s kind of within the range of what I’ve not been able to ship because of the exceeded demand. So in my numbers, you’re seeing a balance. You’re seeing – and you probably – if you had visibility you see in the booking, but you wouldn’t see it in the revenue because I haven’t been able to ship not have been a build. So you may see that there, where the end customer is not customer in record in the beginning, where you start – you have distribution stocking that goes on. We basically have end customers in every purchase order, and we haven’t seen a canceled order or refund. If I just to build on that, like our sales cycle, six months to nine months, and all of our purchase orders are non-cancelable. So it’s just to put a finer point on it, that they are non-cancelable. Look, when we acquired Xpanse a little bit over a year ago, we talked about why we thought this was so important. And Xpanse makes it very easy for customers to proactively find that fix it, et cetera. Second is in a reactive state, where something has become known publicly, Xpanse helps our customers find where they have exposure in order to address those issues first. I mean the numbers are so clean that I think we’re going to ask a philosophical question, if I may. So there’s no change, Patrick. I don’t think the valuation in the private markets have quite normalized like the public markets have, first and foremost. I would like you to have it purely because some of those companies are trying to come attract talent for Palo Alto Networks as I’d like them to get mark-to-market, so people realize that these things can go down. Look, as I said, the reason we’re acquisitive in the beginning, there were many areas of cybersecurity which were up and coming and going to be important, and we were not in there and we were behind the 8 ball, or pick an analogy, we were late to the party. With Prisma Cloud, it’s abundantly clear why we did that. Take XSOAR, we didn’t have automation workflows and platforms. Today, if you look forward, I don’t see many areas of cybersecurity where we don’t have a leading product or a leading product that’s not on development. If you look at Palo Alto’s innovation cycle, I’d say creating firewalls continues to innovate, spend three years acquiring getting up to snuff to a place where now we can compete in multiple categories. And now with XSIAM, we’re delivering industry-leading innovation. I don’t think there’s any company out there that is valued to play where is so, oh, my god, this could be accretive when you go take this. Because I think the cost of integration in cybersecurity is going to make you from a leading player to a mediocre player because you spent too much time merging sales forces, merging customers trying to run two competing technologies. Our playbook is to go find good technology which you can absorb, make part of our go-to-market motion and to use those founders. And we’ve done that, and we’ve left the door open saying if you were to buy companies, it would be more in the product category, which will be more in line with the smaller to midsize acquisitions we made on anything else. So that philosophy hasn’t changed, Patrick. With that, we’ll close the call. I just, once again, want to thank our customers, our partners, and most importantly, our employees around the world for helping us deliver a great quarter."
}