{
    "symbol": "PANW",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-19 01:44:04",
    "content": " Hardware strength fueled 25% product growth in Q1, a result of non-oil strong orders -- that we talked about on our Q4 call, but also a continuation of this trend in Q1 and our ability shipped those orders to our customers. But even our various form factors, firewall as a platform, billings grew 29%, the fastest growth we have seen in almost two years as customers consolidated on network security spend with us on account of the breadth of our product line and our leadership position in each area. What is also interesting is over the last 12 months, we have seen more than 25% of our SASE customers who have come from outside of our installed base, which is not just exciting to see because customers are choosing our Network Security stack, despite having other people's firewalls. As I said, I think we're on a much stronger, long-term secular trend for cyber security and Palo Alto Networks is uniquely positioned in that trend to be able to leverage all of our investments and innovations that we've made in last year, across all 3 of our platforms. As you experienced last year NGS business is very heavily backend loaded in terms of Q3 and Q4, because the teams spend a lot of time getting the customer to a -- most of the products are either a part of their Cloud transformation journey --as a soft transformation journey, or the network transformation journey. I honestly -- I think if I was to rank order the impact we've seen 25% product growth -- Remember, we've just done a hardware refresh for part of our portfolio, and that always -- Traditionally we see that whenever your hardware refracture customers will step up and want the newest piece of hardware and they've kind of learned how to anticipate it. And in the case of our firewalls, it takes 1 year to write the next big major release and it takes 4 months before our customers will be -- will tend to be agree to go and deploy it across their 40,000 stores because they're not, they're not comfortable yet because it's going to be a big change."
}