{
    "symbol": "UFI",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-02 13:57:04",
    "content": " At this time, I would like to welcome everyone to Unifiâ\u0080\u0099s second quarter fiscal 2023 conference call. Also, please be advised that certain non-GAAP financial measures such as adjusted EBITDA, adjusted EPS, adjusted working capital, and net debt may be discussed on this call. So, as you can see, quarter two of 2023 has been a very difficult environment to operate in, and you saw that in the pre-release that we had a couple of weeks ago, and also our materials for today. At this point, I think most of you have heard about apparel retailers and apparel brands that have had significant backlogs of inventory in their system and in their stores, and they've been trying to discount this inventory and clear it out all the way through the Christmas holidays. We have seen a pickup in the month of January in orders for our US operations, and it looks like we should see a gradual improvement through the balance of this fiscal year, and then a corresponding improvement in profitability as well. With regards to our Asian business, that same inventory backlog from US retailers, is having an impact on our China business, because a great portion of our business there is for US retailers. One was working with our customers on future volume increases, and I'll tell you, there's a very definite increase from our customers for recycled material for their apparel, and it gives us optimism for our brand REPREVE. And this activity will show up in future sales, but I would say that the brand has actually gained momentum with our customers in terms of their interest all the way through the pandemic period and likely to include - to continue right now. We've managed our inventories aggressively, and we've been able to reduce North American labor and headcount by a voluntary attrition strategy and holding positions opened, and that gave us the opportunity to avoid excess costs. Additionally, the team has done a good job at generating cash, even in this tough environment, and we have a strong balance sheet thanks to a new credit facility. We do believe the worst is behind us, and we're going to see gradual improvements in volume and profits in the next two quarters, and we also see the fundamentals for our long-term business to remain in place, despite all the turbulence that we have had over the last six months. Everyone's working hard to offset these challenges, and they've kept an enthusiastic attitude, even though most of the challenges we face are well beyond their control. As Al noted, our second quarter fiscal 2023 results reflect the very difficult operating environment stemming from the continued demand disruption we have experienced, a result of inventory destocking measures, and slowed global apparel production. Now, turning to Slide 3 for a closer look at the quarter, our net sales for the quarter were $136.2 million, down 32% compared to the second quarter of fiscal 2022. Last quarter, we cautioned that the higher than normal inventory levels across the world's largest brands retailers, would negatively impact our results in the second quarter. The magnitude of these macroeconomic trends was unforeseen, and the resulting adverse impacts to our business worsened in November and December, far beyond what we had anticipated. Now, while these challenges have created a difficult operating environment for our business in the near term, the disruptions to our business are expected to be temporary as retailers and apparel brands work through normalizing their respective inventory levels and supply chains. While this process plays out, our core business model remains intact, and we remain ready to meet increased demand as we return to more normalized levels. In the last few weeks, we've already seen in the US, as Al pointed out, notable improvements in weekly demand trends compared to the levels we experienced in November and December, which leads us to believe that demand levels bottomed out in the December quarter, and we are optimistic that our business is on the road to recovery. Profitability in the Americas during the quarter was primarily pressured by higher material costs from December, with the loss of asset leverage on lower volumes. We are glad to see that input costs stabilized during the December quarter, and our pricing is healthy against current levels, putting us in a solid position moving into the third quarter. During the second quarter, some of the cost saving measures we took included reducing external spend programs, minimizing overtime hours, extending production shutdown periods, delaying the backfilling of open positions to lower headcount temporarily, and lowering raw material purchases, and taking advantage of some of the payment term extensions we've received. Turning to Brazil and Asia, we continue to see strong demand in Brazil, with higher sales volume versus a year ago. This strength was completely offset by significant margin pressure from decreasing market prices in connection with excess capacity in Asia, while Brazil's inventory cost profile remained elevated from earlier months of higher cost purchases. The segment has maintained a strong margin profile, with a rich sales mix, and we are quite optimistic that demand will recover following the lunar new year. In the second quarter, REPREVE fiber products comprised 31% of net sales, significantly impacted by the lower sales in Asia. We have full confidence that REPREVE sales will rebound strongly in the near future once the operating environment normalizes, as we continue to see momentum in the REPREVE brand for new products, customer adoptions, and co-branding. In fact, in the fiscal 2023 second quarter, we shipped 19.8 million REPREVE hangtags to brand customers. Through a strategic mix of diligent media relations, the Textile Takeback launch garnered 12 pieces of notable media coverage, with over 70.5 million impressions across the business and trade media. Looking ahead to Q3 and beyond, we are focused on building on the momentum in both REPREVE and seeing the business return back to more normal levels. Softer than our first fiscal quarter, the activity flowing through the apparel supply chain, drove significant margin pressure and lower than expected profitability. Outside of the short-term disruption, we believe underlying demand for our products remains strong, and our management team is focused on managing operating costs and working capital to remain nimble as we continue to pursue our long-term goals. First, when we refinanced our credit facility during the second quarter, banking and transactional fees incurred were approximately $800,000, and $273,000 were recorded as debt extinguishment costs to interest expense, driving a portion of the non-routine increase in interest expense. In Brazil, sales levels were strong, with an 8.1% increase from volume that was offset by lower average selling prices in connection with the anticipated pressure from Asian imports that we mentioned in the prior earnings call. For our Asia segment, sales volumes were challenged by the overall apparel weakness, while pricing and mix remained strong. Accordingly, consolidated net sales were $136.2 million, with the vast majority of the decrease since December 2021 quarter, characterized by near-term apparel production weakness. The Americas segmentâ\u0080\u0099s expected decline in gross profit and weaker gross margin percentage, were attributed to the shortfall in product demand, and the associated impact on fixed cost absorption. We took actions to reduce labor hours to appropriate levels, while minimizing overtime, allowed attrition to help normalize our employment levels, and made diligent efforts to control operating costs during this difficult quarter. The Asia segment maintained a strong gross margin profile, with a high proportion of REPREVE products, albeit at a lower sales level due to the constrained demand. This new facility increases our borrowing capacity from $200 million to $230 million, moves the significant majority of our short-term outstanding borrowings to the expanded term loan, continues the favorable borrowing rate structure and overall loan flexibility that has been in place for several years, extends the maturity date to October 2027, and provides helpful liquidity during this current period of demand softness. At January 1st, 2023, quarter end trigger level was $23.0 million, and our available borrowings was $64.7 million. Under our balanced approach to capital allocation, we expect to continue to invest in the business (indiscernible) and organic growth, maintain a strong balance sheet, and remain opportunistic for share repurchases and or M&A prospects. As a reminder, $38.9 million remains available for repurchases under the current share repurchase program, with no repurchases conducted in fiscal 2023 so far. As noted in our outlook, we are expecting sequentially less cash flow for capital expenditures in this third quarter of fiscal 2023, along with further reductions in the subsequent fourth quarter of fiscal 2023. And before we turn the call over to our Q&A sessions, I'll give you an outlook and the expectations we have for the third fiscal quarter. As we discussed on this call, the operating environment and demand trends we're seeing, both domestically and in our international regions within the apparel and retail markets, are still working through demand pressures. Although our demand signals remain choppy, we are expecting stronger results in the second half of the fiscal year. For the industry, we're expecting the operating environment and the textile demand trends from the apparel market will recover at a modest pace during the calendar year. For the fiscal third quarter, we expect revenue to increase sequentially after we get past the normal slowdown in Asia during the lunar new year. We expect significant sequential operating performance improvements on an operating income and adjusted basis, and our effective tax rate is expected to remain volatile. Weâ\u0080\u0099ve been pleased with our increased liquidity through our amended and expanded credit facility, and we will continue to maintain our strong balance sheet to act opportunistically on growth initiatives, as we remain well positioned and focused on being the sustainability partner of choice to brands across the globe. Your line is open. That resulted in lower production levels even further than normal in January, but we are expecting a very, very decent increase in the volumes relative to the December month, which was better than the November month. And in the US, I'm going to refer to the first sort of two weeks of December relative to where we are now, we are seeing a nice uptick relative to the beginning of a December month outside of the holidays. And to - Dan, to add to your question, as far as additional commentary of color around the outlook, I would say for our Q3, we are expecting to return to positive gross profit. We do feel like the signs that we've seen, especially here in early January, where we're seeing our January sales volumes up 5%, 5% to 10% or so versus where we thought they would be, I think that is giving us comfort that we will be returning to positive gross profit here in this March quarter. Haven't seen that just yet, as we're still finishing out the lunar new year, and Brazil did have a - they had a tougher quarter here in this December quarter. I know it's impossible to tease out, but any color on sort of the magnitude of the impact from increased Asian competition as all that extra volume sort of flowed through - flowed around the world versus just timing in terms of mismatch in terms of COGS and pricing. In Brazil, the input costs will be declining as we move through the quarter, really significant impact from probably Q4 more than Q3. So, we're expecting - we know that in Q3, we'll have a more stable, more normal raw material cost. Your line is open. In Brazil, it's going to - because we have a longer supply chain, it does take a little bit longer. They saw really the margin pressures because of their raw material costs, really impacted in Q2, and we're coming out of that as we move through Q3. Yes, thanks for that. And then as far as Asia, as far as what you're seeing there, we've heard from other companies that many companies have taken more extended periods of shutdowns around the lunar New Year. Yes, thanks for that. But we are being very thoughtful around pricing, and I think we've made changes to how we approach the market, which are very different from how we used to approach the market several years ago. So, obviously I realize that you're very heavily tied to the apparel markets, but that being said, just curious as to what you've seen from other vertical markets. Your line is open. Just any comments on what cash flow might look like for the back half, either for Q3 or the back half of the year in terms of the operating cash flow and free cash, either usage or generation as it relates to that liquidity position. In the release, we noted that we generated $7 million of operating cash in the first six months of this fiscal year. And really specifically, we've allowed about a 10% reduction in our US workforce, and that's really again, through attrition, through being slow to kind of evaluate, and make sure that we're backfilling where we need it. And really, I think back to Al's comments about really everybody stepping up and doing well, that is what we're seeing. From a cash generation perspective, we're actually thinking and anticipating that as the business comes back, we'll have higher levels of sales, then we'll have higher levels of accounts receivable, and we'll need to start to build a little bit more inventory to be ready for that than we have. So, again, we're also very fortunate, and I think as we touched on a little bit, both of our Brazil operation - both our Brazil operation and our Asia operation, are very self-sufficient. So, we are looking forward to seeing that business come back, and we know it's going to take some working capital address to address that, but we're prepared to do that."
}