{
    "symbol": "SRT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 22:20:20",
    "content": "  Operator: Good afternoon, everyone, and thank you for participating in today's conference call to discuss Startek's financial results for the Second Quarter ended June 30, 2022. Joining us today are Startek's Global CEO, Bharat Rao; the Company's Global CFO, Nishit Shah; and the company's Head of Business Transformation, Ronald Gillette. Before we continue, we would like to remind all the participants that the discussion today may contain certain statements which are forward-looking in nature, pursuant to the Safe Harbor provisions of the federal securities laws. While we experienced soft year-on-year declines in revenue, the prior year quarter received a large benefit of one-off revenue opportunities with the CDC, as well as general market tailwinds. While this process inevitably comes with a margin compression, we expect to recapture the profitability impact in the coming quarters. Driven by our brand awareness campaigns we are beginning to receive an influx of incoming calls and requests for proposals by prospective clients all across the U.S. Our redefined marketing strategy has provided immense value in bringing greater awareness and visibility to StarTek, while our revamped sales team tangibly builds our sales pipeline for future expansion. As one of the three main pillars of growth we have identified, we will continue to lean upon our sales ecosystem to expand our footprint across the industry. Last quarter, we entered into a partnership with Genesys to leverage their leading technologies in cloud software, customer experience services and call center capabilities. At StarTek our goal has been to provide highly empathetic customer experience solutions to our clients, and we will continue to identify and partner with emerging technologies that allow our agents to effortlessly do so. Genesys and their seamless contact center experience, is a natural fit for our platform and has meaningfully streamlined our agents' work processes to allow them to better focus on personalizing their conversations with customers. Alongside our digital partnerships, last quarter, we announced the launch of Startek Agent AI, a modular platform that combines AI powered solutions to enhance and deliver a superior agent and customer service experience. As mentioned earlier, we are focused on providing the necessary tools to allow our agents to provide best-in-class services, to all our clients. Startek Agent AI builds upon the success of our award-winning Startek Cloud platform and with combined capabilities, our customers can be confident that they can deliver a world-class customer experience through our platform. In the second quarter, Startek was named the winner of the Comparably Award for Best CEOs for Diversity, an award that I was honored to accept on behalf of the company. Overall, we had another exciting quarter where we continue to capitalize on our investments and position StarTek for growth. While we did not achieve our year-on-year top line and bottom line growth, our focus on preparing a platform for the future has positioned StarTek to return greater value back to shareholders. Just a note that we are not going to discuss today, the non-binding proposal made by Capital Square Partners, for the latest statement by the special committee, I direct everybody to the press release dated June 21, 2022 that is available on our website. After Nishit concludes his review of our financial performance he is going to turn over the call to StarTekâ\u0080\u0099s Head of Transformation, Ron Gillette, to provide more insights into our strategic initiatives for the remainder of the year and beyond. Starting on the top line, net revenue in Q2 was $167.6 million compared to $189 million in the year ago quarter. On a constant currency basis net revenue decreased by 9% compared to year ago, quarter. We also experienced a decline due to termination of our e-commerce client in the first quarter of 2022, off-setted by the continued strength of our core verticals. As informed, in the previous quarters, we had taken wage increases in some of our geographies to factor decade-high inflation levels. Furthermore, this quarter saw some significant client work ramp in India, where we needed to hire and train resources in advance. Selling, general and administrative, SG&A, expenses for the second quarter was $13.7 million, compared to $12.3 million in the year-ago quarter. As a percentage of revenue, SG&A was 8.2%, compared to 6.5% in the year-ago quarter. Net income attributable to StarTek shareholders for quarter two was $1.9 million, or $0.05 per share, compared to net income of $6.9 million, or $0.17 per share in the year-ago quarter. Adjusted net attributable â\u0080\u0093 income attributable to StarTek shareholders for Q2 was $5.2 million, or $0.13 per diluted share compared to $9.9 million or $0.24 per diluted share in the year-ago quarter. Adjusted EBITDA in the second quarter was $11.1 million, compared to $19.6 million in the year-ago quarter. As a percentage of revenue, adjusted EBITDA was 6.6%, compared to 10.4% in the year-ago quarter. The decrease was primarily a result of an increase in investments in sales, marketing and digital assets, as well as aforementioned decline in gross profit. From a balance sheet perspective, at June 30, 2022 our cash and restricted cash balance stands at $55.8 million, compared to $52.2 million at March 31, 2022. Total debt at June 30, 2022 was $170.7 million, compared to $169.5 million at March 31, 2022. Net debt, excluding restricted cash, at June 30, 2020 was $123.5 million, compared to $126.2 million at March 31, 2020. For the back half of the year, we'll be focused on growing and capitalizing on our bolstered sales pipeline to drive new logos. With our capacity and footprint ready to handle additional ramp-ups, we look forward to expanding our services and acquiring new customers across the U.S. and India. In fact, we are working to strengthen our program management and account management teams who can focus on deepening our client relationships while also increasing awareness about our integrated digital solutions that can provide greater benefits to our clients, both in delivering better services and reducing cost of delivery. In the past quarter, we sponsored Customer Contact Week, Las Vegas, as part of the world's largest customer contact event series, where we also cohosted a networking event with one of our digital partners. These two initiatives will be showcased through our webinar series, which kicked off in Q2 and explores emerging trends in the digital customer experience space, in partnership with thought leaders, vendors and clients. While our internal teams are proactive in developing new technologies to refine our platform, especially in cybersecurity, we will also continue to drive new digital partnerships to enhance our existing offerings and remain ahead of our competition. Our focus continues to remain on disruptive, innovative innovation in voice and increasing use of AI within contact centers to enhance both agent and customer experiences. For example, in our Saudi region, a highly productive territory for us, we will have some pass-through on costs that we were not able to unlock in the first quarter due to Ramadan. While second half revenues will be relatively similar, we expect to recapture some of the margin compression that we incurred this quarter through the ramp-up of services with clients through our onboarded service agents. We've continued to capitalize on the opportunities that we have identified through our revamped sales ecosystem, our refreshed market strategy and our expansion of services driven by digital partnerships. As always, our first priority is sustainably growing our company to return value back to our shareholders, and we are ready to execute on our growth strategy to do so. See, typically if you take a step back and if you see our quarter two margins as business starts ramping up, et cetera, it's normally less than quarter one. Now, if you look at our margins in the first quarter of 2022, they were circa 12.5%, about 12.6%. And as ramp-up start, you get to about 10% that we have in this quarter from a margin perspective. And that â\u0080\u0093 those kind of ramps in any of these seasonal items even out as we go into quarter three and quarter four, as you would have seen. So if I look at quarter one of 2021 and quarter two of 2021, you had a circa 2% difference between the gross margins in those two quarters. Now in quarter one of 2022, you would recall, Ethan we had talked about some margin pressure, obviously, just with the inflationary pressures, and we had talked about some of that kind of continuing into â\u0080\u0093 for a quarter or two. So to that extent, there's nothing significantly different we have in quarter two that of 2022 versus quarter one of 2022. You mean to get back to the levels in quarter three and quarter four that you saw in quarter one, I think that would be a reasonable estimate."
}