{
    "symbol": "ACXP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 11:53:17",
    "content": " According to the physician prescribing data available to us from an industry standard source, identified referring physicians in the aggregate just 14 -- the first 14 of our currently activated trial sites treated a total of over 30,000 patients in a recent 12-month period, suggesting that a substantial number of subjects could potentially be available for referral to one of the 14 clinical trial sites if the patient is qualified. Finally, in July '22, the company raised an additional $4.225 million of gross proceeds by consummating a registered direct offering issuing an aggregate of 1,290,000 shares of common stock, which included about 130,000 pre-funded warrants to purchase shares of our common stock to one institutional investor at a purchase price of $3.25 per share, which represents for common shares at $0.001 share exercise price, for the pre-funded warrants, and a price of $3.80 per share for the company's executives that invested in the offering, three of us in particular. Cash used in operating activities for the six months ended June 30 was $3.9 million, of which approximately $1.7 million was spent on research and development related activities. Research and development related expenses for the three months ended June 30, were $0.9 million compared $0.1 million for the three months ended June 30, 2021. For the six months ended June 30, 2022, research and development expenses were $1.7 million, versus $0.2 million for the six months ended June 30, 2021. General and administrative expenses for three months ended June 30, 2022 were $1.7 million, compared to $3.9 million for three months ended June 30, 2021. For the six months ended June 30, 2022, general and administrative expenses were $3.6 million versus $5.4 million for the six months ended June 30, 2021. The company reported a net loss of $2.6 million, or $0.26 per diluted share, for the three months ended June 30, 2022, compared to a net loss of $4 million, or $0.57 per diluted share for three months ended June 30, 2021. And a net loss of $5.3 million, or $0.52 per share for the six months ended June 30, 2022, compared to a net loss of $5.5 million, or $0.79 per diluted share for the six months ended June 30, 2021."
}