{
    "symbol": "MLNK",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 16:39:09",
    "content": "  Operator: Ladies and gentlemen, thanks for standing by and welcome to MeridianLink's Second Quarter 2022 Earnings Call. With me are MeridianLink's Chief Executive Officer, Nicolaas Vlok; Chief Financial Officer, Sean Blitchok; and President Go-To-Market, Chris Maloof. Before we begin, I'd like to remind you that today's conference call will include forward-looking statements based on the company's current expectations. For a discussion of factors that could affect our future financial results and business, please refer to the disclosure in today's earnings release and the other reports and filings we file from time-to-time with the Securities and Exchange Commission. Over the last 1.5 years, we have acquired four businesses that strengthened and expanded our platform. Since going public, we have exceeded financial guidance every quarter and have made significant progress in our cloud transition. We also refinanced our debt and continue to generate significant cash flow, positioning us to embark on our next phase of growth. First, our non-mortgage-related lending businesses remained strong, growing 16% year-over-year in the quarter, led by particular strength in personal and other non-vehicle loan types. Diversification within our mortgage-related businesses benefits us as well, driving our outperformance versus the broader market. Although, fewer mortgages are being originated, we are increasing wallet share as our customers leverage more on the MeridianLink platform. There is a significant market opportunity for us and we will continue to invest to capture a disproportionate share of our $10 billion TAM, while maintaining best-in-class margins. In order to drive accelerated growth, we have outlined three key areas of continued focus. First, engaging more deeply with our customers; second, expanding the capabilities of our platform; and third, empowering our customers to grow more quickly and better serve their communities. Our top priority is engaging meaningfully and frequently with our customers, understanding their goals and pain points provide us with a real-time view of market opportunities. Not only do these conversations give us a real-time view of market opportunities and inform our near and long-term product road map, but they also meaningfully drive our cross-sell motion. For example in Q2, we engaged with nearly thousand customers and partners for three days at our in-person user forum. MeridianLink One is our cloud-based multi-product platform, which uniquely spans the digital consumer lending journey from account opening through marketing loan origination and decisioning. First, we are ahead of schedule to complete the full public cloud migration of MeridianLink One initiated in 2019 by the end of this year. Second, our patented debt optimization solution, which helps our customers look across their clients' portfolio and identify where they can save money and improve their purchasing power continues to gain traction with customers. And third, we have rolled out our modern experience for home equity, so our customers can more efficiently serve the surging demand for home equity lending. We are focused on increasing the value of the platform by expanding its capabilities, which attract new logos and fuels our cross-sell motion in turn driving revenues. As our final focus area, MeridianLink empowers our customers to compete, grow and succeed in any market. Our track record of providing best-in-class functionality, flexibility and automation as customers move to a digital environment has allowed our customers to win more clients, capture a greater share of their wallet and more fully meet their needs. As we migrate more of our products to a cloud-native environment, we are strengthening the MeridianLink One platform and are better serving our customers. Their MeridianLink One footprint now includes mortgage, multiple consumer modules and our unified point-of-sale solution. Additionally, our market-leading home equity lending capabilities were selected in the quarter by a top 15 national mortgage lender to facilitate their launch into this new category of lending. This election was based on the combination of the unique depth and breadth of functionality we provide, and MeridianLink's ability to facilitate a swift market entry and provides another example of our ability to serve higher value customers. Finally, MeridianLink's success is tied to a strong team. As we prepare for the next phase of growth at MeridianLink, we strengthened our executive team by elevating Chris Maloof into a newly created role President of Go-To-Market, where he now has direct ownership of all phases of the go-to-market engine. This will further increase the power of our go-to-market organization, leveraging Chris' deep expertise and operating experience and increase our capacity for strategic initiatives. To conclude, MeridianLink is focused on engaging with customers, to help prioritize investments that expand our platform capabilities and revenue opportunity and empower customers to better serve their clients and communities. As we improve customers' revenue generation, they improve ours, creating a powerful virtuous cycle. Sean and I are aligned on the values and vision of the future of MeridianLink, and I have appreciated Sean's early insights and his quick assimilation into the business. I've spent more than 25 years in senior leadership roles that span a diverse set of markets, functions and business models. Throughout my career, I've relied on four key pillars with a specific mission, to increase the velocity of growth and innovation in the business. Those pillars are; one, a laser focus on customer success; two, driving strategic clarity to create value for our customers; three, creating operating scale and leverage in the business model; and four, and perhaps most importantly, an intentional focus on having a positive impact on people and relationships, the result of which is high performing, highly engaged teams, customers and partners. These pillars are in my DNA, and are exactly why I chose MeridianLink, a strong alignment with Nicolaas, the management team and the Board on our mission and values. As for results, as Nicolaas mentioned in the second quarter, we generated total revenue of $73 million, up 7% year-over-year. MeridianLink's ability to grow in both a rapidly expanding and rapidly contracting mortgage market speaks to the balanced strength of the business, which is part of what attracted me to this company. In the second quarter, Lending Software Solutions revenue accounted for nearly 71% of our total revenue, and grew 14% year-over-year. Excluding the impact from the anticipated slowdown in mortgage-related revenues, our Lending Software Solutions revenue grew 16% year-over-year. For the mortgage loan market, second quarter revenue generated 24% of overall revenues, roughly in line with our expectations but down from 30% in the prior year. More specifically, 7% of our Lending Software Solutions revenue and 64% of our Data Verification Software Solutions revenue were tied to our mortgage-focused products. Adjusted EBITDA for the quarter was $28.2 million, representing an EBITDA margin of 39%. This reflects ongoing cost discipline, but more importantly the significant value our solutions provide in the market, our EBITDA margins are near the level of the largest banking technology providers, and clearly distinguish us from most of the smaller providers, who have yet to achieve a positive EBITDA. In response to market demand, we spent 21% more in sales and marketing and 28% more in R&D adjusted for stock-based compensation, compared to the second quarter of last year. Importantly, we will continue to invest in our sales and marketing and R&D efforts across the balance of the year, as we have enormous potential for further market penetration of our existing solutions, and have clear line of sight to expand our offering. We ended the second quarter with $100.3 million in unrestricted cash and cash equivalents, down $46 million from the end of the first quarter, but primarily driven by the closing of the StreetShares acquisition at the start of the quarter. Operating cash flow in the second quarter was $12.8 million, and free cash flow was $10.2 million, or a 14% free cash flow margin. In the trailing 12-month period ending in the second quarter, operating cash flow was $87.6 million, and free cash flow was $80.1 million, or 29% free cash flow margin. MeridianLink's current cash position and ongoing cash generation provides, a wealth of allocation opportunities for us to most efficiently build value for our customers and shareholders. We did initiate stock repurchase activity in the quarter, but at low volumes as we see a number of strategic opportunities potentially being unlocked by the current capital raising environment. Non-mortgage revenues comprised more than three-quarters of total revenue in the second quarter, the highest level since at least the start of 2019, and grew in the mid-teens. With the restructured management team focused on accelerating growth and a number of high-return investment initiatives, both in place and in queue it is a great time to be part of this company. Despite the rapid rise in mortgage interest rates since the start of the year, and the associated decrease in expected market volumes we continue to see strong demand momentum overall and our pipeline remains robust. For the third quarter, estimated total revenue is expected to be between $73 million and $75 million, compared to $67.4 million for the same period in 2021. This represents an estimated increase of 8% to 11% year-over-year, and is above market expectations. For the full year 2022, we are reaffirming guidance for total revenue between $289 million and $293 million, compared to $267.7 million for the same period in 2021. I want to emphasize this point, irrespective of macroeconomic uncertainties, we are confident that we will continue to add new customers and increase module penetration among our existing customers across the remainder of the year. For a bit more context on our expectation of mortgage-related revenues, we've reflected the incremental decline of the market in our guidance. In the third quarter of 2021, the mortgage market contributed $19.6 million of revenue to MeridianLink or nearly 30% of our revenue. Comparatively, we expect the mortgage market to contribute less than 20% for the third quarter of 2022 as rates continued to rise across the second quarter. Overall, the mortgage-related percentage of our revenue in 2022 is still expected to decrease to the low 20%s, down from 30% in 2021. With our current mortgage revenue forecast, we anticipate ending the year with our potential exposure in the high teens as a share of our overall revenue. On a non-GAAP basis, our third quarter estimated adjusted EBITDA is expected to be between $25 million and $27 million, representing EBITDA margins of approximately 35% at the midpoint. Our reported Q2 adjusted EBITDA came in above our guidance, which is a great result. As we've discussed on prior calls, this also includes in Q2 and for the remainder of the year approximately $1 million dilution per quarter to bring the StreetShares Solution fully to market as part of MeridianLink One. For full year 2022, our estimated adjusted EBITDA is expected to be between $112 million and $116 million, representing EBITDA margins of approximately 39% at the midpoint. Again holding to our committed guidance, our investment priorities this year include services capacity to convert existing bookings to revenue and development capacity to complete the movement to the cloud and enhancements to our platform. We will continue investing in our business, adding new clients, driving incremental revenues to our customers, and we are confident we will continue to outperform the market in both our mortgage-related revenue and in our non-mortgage solutions. With that Nicolaas, Chris, and I are happy to take any of your questions and I'll turn it over to the operator. First question here is just thinking about the guide with the guide being reiterated out there, I actually think that's pretty good considering the mortgage side of the business is really turning out to be a bigger headwind than maybe previously thought entering this year. Thank you for the question. In both upcycles and downcycles, consumers have demonstrated a strong interest in credit and which particular aspects of credit go up and down depending on their specific needs whether it was the liquidity crisis or more recently, the supply chain challenges. We continue to see success drifting up market but it's typically when customers come to us and we meet their needs, and they look at our products and our platform. What from my perspective really stand out about our platform, is its ability to be configured as a highly configurable platform through integrations in our partner marketplace and that benefits the go-to-market for these folks, who want to rollout our solution at a pretty fast clip and speed specifically, as it relates to HELOC. We're seeing traction when folks come to us but it hasn't changed our go-to-market motion, where we are still highly focused on that $100 million to $10 billion of assets under management. Thanks for taking my questions here. Coming into this year it sounded like we needed to build out the services organization a little bit, to really implement the strong bookings that you were seeing. Thank you for the question. And I do want to break that in two parts and first speak to yes, we entered Q2 a little bit behind in hiring, but we largely caught up in Q2 by the end of Q2 in hiring services resources that we were budgeting and planning for in the Q2 time frame. So, there's a fair bit of training and mentoring taking place before these folks can really engage, on implementations on their own. But very excited feel we found some great talent in the market in the second quarter, that we would bring online as folks who will be out of the field here late this year into next year. Our goal is still to kind of crash late in the second half, of the year and to start driving backlog down. But at this point in time, we've seen a sequential increase of backlog from Q1 to Q2. And then there's a component, that's cross-sell. I want to drive healthy growth in all of them, but that's kind of the outline or the framework of the algorithm if you will, and then we get into kind of the details of the specific product lines. And so we're able to deflect a lot of that -- the volume decreases, is based on the contracts that we have with our customers. Thank you for the question. So Nicolaas already highlighted that we're ahead of schedule on MeridianLink One, which is very exciting for the business and laying that out into a few components. The first and foremost is, we've made a concerted multi-year investment to set up our platform for the next decade. So what that means to me is that, we have a software platform that's on the latest infrastructure, leveraging the latest tools from a cloud vendor on the latest architecture. And then most exciting for me personally is, as all of those development resources free up, as we finish the last stage of this project, we can focus the remaining on extending our position in the marketplace and on future innovations. My key focus going from here is, helping -- we've added a lot of people to the organization, which is very exciting. To be able to maintain that pace, we need to educate every new person as well as the last 10 were educated on how our solutions help our customers succeed and ultimately win in their respective markets. I've got a quick question about MeridianLink One, a further follow-up on it. We are -- again, we are routinely and monthly moving more and more of our customers. And what I want to call out here is it's really a tremendous effort by the team in transitioning so many clients with minimal interruptions, especially given the breadth of integrations that our customers are using from our third-party marketplace. Now, when you think about, from a cross-sell perspective, where you're seeing the enablement and the acceleration of the cross-sell is, in areas such as, where Nicolaas called out about the debt optimization. By having all of our solutions in the cloud on a common stack, we're able to create that with various solutions or loan types, create more value together than apart, by having them in one place in a highly responsive location. I think, from a go-to-market perspective, I don't think we're just -- we're going to continue to build out the management team. And I don't have -- we will continue to look at it, but I don't think go-to-market restructuring affects our guidance policy. Maybe, Chris, I wanted to dig in a little bit more on one of the answers you gave before. But in terms of the four biggest drivers, obviously, price increase you're trying to implement through. Thank you for the question. I think you outlined to one of the questions earlier, the sort of four key areas of driving growth across the business. I think it's new logos, cross-sell module \n Yes. From a pricing perspective, we have an annual pricing cadence that we have where we pursue a willingness to pay model and what's happening in the marketplace. And in a high inflation environment, that's more important than ever and a central part to our operating law as usual. But I did outline kind of the model and how I was thinking about the growth algorithm value, new logo, cross-sell and price. We are turning a corner, when it comes to go-to-market, what our focus areas are. We have a new Chief Sales Officer, who is starting -- has already started actually, and he's going to be focused more heavily on new logo. From a cross-sell perspective, the opportunities for cross sell are -- they exist tremendously within our existing portfolio. We have a lot of opportunity for cross-sell and we're constantly looking for new opportunities, peripheral opportunities to add to the portfolio, to add to the platform. So, I think we're constantly looking at our customers, what our customers need to drive that cross-sell up-sell motion. And then volumes, we're -- volumes we are -- when you talk about mortgage volume as an example. But we're seeing kind of offsetting, we have seen and I looked at five years of history and the product volume is a piece that consistently grows. I think we're very well prepared for that to be the new normal and to continue to put up our growth trajectory, which is the mid-teens grower. One the StreetShares acquisition, I want to point that out again, but also because of the hiring in Services. That will continue, but I think it becomes -- as we catch up with backlog and that's one of my key focus areas is to create velocity with the backlog and move implementations faster. So, I think in general the answer is our gross profit decreases by about 3% year-over-year and a large portion of that is datacenter. So, I think the payoffs began sometime next year it's basically a wash for FY '23, but has been a drag on gross margin for a while now. So, I'd like to add something there, Parker if you don't mind me saying that, this isn't a margin story this is a future-proof platform investment. And while we will be exiting a data center where Sean highlighted some savings, given the fact that we have a very decent backlog and seeing clients continuing to -- existing clients continuing to expand. Thanks for taking my questions here. Thank you for the question. So the first is, what's the benefit to the consumer mortgage aspects of the business. Thank you for the question. But just and if you talk about just the consumer LOS side of the business in terms of sort of confidence, meaning in current rates of growth. And then with the kind of the backlog that you're seeing, as you put more resources into absorbing that backlog, if we can see sort of a step up into 2023 as we get all the implementation resources into place. I think with the declines elsewhere, guidance kind of proves out that we are seeing a step-up. And so because we're holding guidance, I think I'd say I'd look at that as a positive. I don't know there's another piece of this, which is we're not just in an environment of macroeconomic uncertainty. It's also a very interesting time socially with the great resignation, people back to work, a shift in markets. But I will point out that the backlog itself, we have a long runway of backlog and it is reasonable -- to specifically address your question, it is reasonable to think that we can sustain or even do better in terms of growth rates based on that backlog alone."
}