{
    "symbol": "RCMT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 16:46:03",
    "content": " I am joined today by Brad Vizi, RCM's Executive Chairman. The information contained in the forward-looking statements is based on our beliefs, estimates and assumptions and information currently available to us. For more information on our forward-looking statements and the risks, uncertainties and other factors to which they are subject, please see the periodic reports on Forms 10-K, 10-Q an 8-K that we file with the SEC, as well as our press releases that we issue from time to time. I will now turn the call over to Brad Vizi, Executive Chairman, to provide an overview of RCM's operating performance during the third quarter. Each of our business units delivered solid performance, and I'm excited about the traction we are gaining across several new business initiatives. Lastly, our health care service expand its presence across the K-12 end market with the addition of several strategic accounts. RCM generated third quarter revenue of $58 million, a 28% increase year-over-year after adjusting for the Power Systems Canada sale. As for profitability, RCM generated adjusted EBITDA of $4.8 million in Q3, representing growth of approximately 162% on a year-over-year basis. First, as previously mentioned, our Life Sciences and IT Group recently acquired TalentHerder, a leading talent services acquisition company. TalentHerder will bolster RCM's existing RPO capabilities by expanding candidate reach, extending alternative service models to our current base, and providing proven methods to new clients, responding to a changing employment landscape at incredibly competitive rates. Over the near term, the focus remains on the seamless integration of the TalentHerder team. We are integrating the recruiting groups in addition to gaining leverage from our acquired offshore sourcing staff, and we have already identified several new opportunities through our joint sales efforts. This go-to-market approach will be essential as we scale up initiatives across select emerging technologies in which we have the necessary expertise, including sustainable aviation fuels with an estimated $40 billion to $50 billion in SAF investment planned through 2025, and a further $1 trillion required by 2040, we believe there will be robust demand for identifying ways to scale supply cost effectively. Our test center has a stragic role to play, and it will be a powerful tool as we position ourselves to become a go-to partner for clients looking to scale emerging process technologies in the future. Pivoting to our Healthcare Services Group, the team continues to excel amidst the ever-changing healthcare landscape. The bottom line, the U.S. health sector is facing a substantial talent shortfall with several studies estimating that by 2025, there may be a supply-demand imbalance of 200,000 to 450,000 nurses. Thankfully, these are two of RCM's healthcare's greatest attributes. We believe RCM Healthcare will play an important role in addressing the structural deficiency, most prominently in our core education end market where our experience and scale is unrivaled. Finally, I would like to take a minute to express appreciation to our shareholders on behalf of RCM and its employees. I know a substantial portion of you are long-term shareholders, more than one third of which are current and prior RCM employees. In closing, as our clients grapple with the realities of scaling their businesses and talents to our increasingly technology-driven world, our cross-functional capabilities and technical expertise have positioned RCM as the de facto platform of choice with searching for solutions. Regarding our consolidated results, revenue for the third quarter was $58.2 million, growing by $12. Adjusted EBITDA in Q3 2022 was $4.8 million, representing an approximately $3 million increase on a year-over-year basis. 4 million during the quarter, a 42.1 year-over-year increase. The group generated revenue of $28 million in Q3 2022, which represents a 43% increase year-over-year. The team continues to make great progress within the K-12 market and has expanded its footprint with the onboarding of several new accountings across behavioral health remain robust, and the team is positioned to take advantage. As Brad mentioned, the team's integration efforts regarding the TalentHerder acquisition are going very well, and the execution across each of the remaining practice groups has not missed a beat. In terms of revenue, we generated $9.2 million in Q2 2022, which is essentially flat with Q3 '21. From a profitability standpoint, the group's gross margin profile increased by 200 basis points as the team transition the business model to more leverage or well managed service contract profile. After adjusting for the sale of our Canada Power Systems office in Q3 '21, our Engineering Q3 '22 revenues $9 million grew by 31% as compared to adjusted Q3 '21 Engineering revenue of $16 million. The performance was broad-based across each of the divisions, and the team is doing an excellent job of expanding into adjacent service offerings that leverage each skill sets. As we migrate through the fourth quarter, we remain confident that we will finish the year strong and enter 2023 in stride. Your line is now open. Kevin, what was the mix between education and --\n Let's see. So I want to get it for you as you --\n While you're looking, for Brad, I was thinking about your comment about healthcare and leveraging technology for the clients. There's no shortage of needs out there, really. So inevitably, we think that driving productivity of our recruitment resources could potentially unlock quite a bit of upside for us. So Bill, just to answer your first question, our school revenue was $16.6 million, and our non-school revenue was $10.4 million. It's a robust market, robust demand. It's -- if you sort of look out to the future, I would tell you that Q3 is probably a little bit eyesight compared to what we probably expect long-term, but not substantially higher than what we expect. But when you look at the earnings power of the business and where the stock is trading, you could probably guess what is towards the top of the rank order. But look, I mean, there's -- we've been pretty judicious in our so. We have a very high level of confidence on our side to put capital behind, so we're at a point where there isn't a shortage of opportunities for which turns against to deploy capital. But we're in a good spot with what we believe is a healthy earnings power, a clean balance sheet, and again, a very talented group of individuals to get behind. Your line is now open. Following up on that TalentHerder question, I did notice in the 8-K that you paid, I think, around $4 million in cash for that acquisition. So if you want to talk about multiples, I would say somewhere between 4 times and 8 times is a typical range for us. When we do deals, if someone's getting to 8x, it's probably because they're performing really well for -- during the earnout period, so we're happy to pay 8x if we can deliver outstanding performance. We focus on have sort of a low floor in terms of performance post closing, but also potentially have some good synergies, and we can really drive a lot of growth. In the case of TalentHerder, it's a really good fit for us in terms of what we're seeing in the market and mapping that against the outstanding team that we acquired. You're probably looking at maybe 30% operating margin on that business, which is pretty typical in the RPO space, so it certainly will be accretive to our margins. But this is something -- we're small players in the RPO business today, but we have tremendous aspirations in terms of being a major player in that space. And then, Brad, you mentioned in the Healthcare space and several new strategic accounts. Yeah, so I would think of them as being in our core education end market, really, as we continue to diversify that base. And importantly is there are accounts that we think that in aggregate, are certainly accretive over the near term but have opportunities to grow materially from where they are today. So really, our K-12 initiative is really starting to gain its footing and we're really starting to build our presence throughout the country. I would say, Alex, if you compare our school business to say, 3 or 4 years ago, we have tripled the number of clients easily today. In addition to the bricks-and-mortar schools, we're also making some pretty good inroads with some large virtual school systems as well, which is really exciting because we can service those schools from anywhere in the country. And we think that portion of the business is still a little small today, but it has each potential to grow really fast. And then lastly, the revenue in the health care business was up 42% year-over-year. Obviously, the transition of COVID from pandemic to endemic will have a little bit of a headwind for the fourth quarter compared to the fourth quarter of last year. I mean, we're just -- we're crushing just about every area in Healthcare. I would say the only impediment to continuing to grow the Healthcare -- and obviously, we're not just focused on the fourth quarter. We'll probably never be able to find enough, right, because we can pretty much place every quality provider that we find. Your line is now open. One, Brad, will actually start out with -- thank you for Brad for acknowledging the long-term significant shareholders that are out there that are kind of hanging on with the company and being patient at that. The second, I know we -- Brad, you talked to us a little bit about capital expenditures and whatnot, the capital program. Look, having bought back 25% of the company at this point, I think to the extent that we do introduce a dividend one day, it's reoccurring, and we're able to continue to grow EBITDA and shrink share count. So as long as we continue to see a profile that we see and we continue to generate extraordinary returns on capital, I think I mentioned earlier, I think we're in that 50% range at this point. Frank, historically, in my investment career, anytime I found teams that were able to put up numbers like that, I wanted them to keep the capital and potentially add to it. So though we are pretty active with respect to retiring shares, a dividend in the very near future isn't really on the dashboard. Yeah, I just noticed, I guess, come December, it's been five years since there's been actually any direct return. Kevin, I guess on that -- looking at SG& A Q-over-Q, and it's not much undifferent for year-over-year, I see a 21% increase in SG&A versus a revenue increase of 27%. So I just in the -- at least in the Q and to some degree in the year-over-year, the SG&A seems to be growing significantly higher as a percentage than would be expected for that kind of revenue growth. I think we're just looking at pure SG& A, I know there's a lot buried there. And not only that, but in the -- there were some higher interest numbers, right, for interest payments, which run through there as well that are not necessarily at the same number that are in the current Q, so --\n Sure. Well, the interest is down because the debt is down, but interest is not included in SG&A. But anyway, I was just needling a little bit on -- I think I can do that. The bottom line for us, Frank, is, and you know as well, is we're incredibly mindful of every dollar that we spend on SG&A. If we look across our businesses, all of them, we see incredible opportunities. So we are happy to continue to wisely invest SG&A because we know that -- and every decision that we make, obviously, on the SG&A front is not going to turn out the way we expect it to. Simply, we have to increase SG&A to make more EBITDA and to drive the stock price. Now we have to do it wisely, but we absolutely have to invest in SG&A to grow the company. And I think if we look at this company historically, that's an area where we've made some mistakes, where we've been hesitant to make investments. And you know this company really well, obviously, other people are listening. And I'm not going to worry about the SG&A increase because I know that if I have 50 recruiters, four of them are going to work out really, really well, and we're going to get an outstanding return on this for your recruiters. And when you look at the investment front, we're continually looking about how we can drive efficiencies in the business through technology. Well, that's going to take short-term investment to get a long-term return. Well, that's certainly encouraging to hear. I guess one of the concerns I had was the growth rate of SG&A in this past quarter versus the revenue growth rate because they're -- Yes, we're investing. But at 21 versus 27 rev, maybe close to 28 rev, increase in the SG&A at '21. Because Q3 SG&A has a lot of fixed cost in it, and we have a lot of seasonal variability in the revenue and gross profit in Q3, as you know. So if you're going to go through that exercise and look at the growth in SG&A, compared it to the growth in revenue. So Frank, as long as we increase operating margin at a clip anywhere near that, like we are going to core on SG&A. Yeah, because we do see, to Kevin's point, a 54% increase year-over-year on revenue and a 33% increase in the SG&A. But it's something certainly that as long as it's being monitored, historically, we need to do that. Appreciate -- definitely appreciate the feedback, and you've always been a great thought partner on a couple of topics. And certainly, without the seasonality anomaly in the third quarter, we're looking at -- hopefully, looking at an absolutely outstanding 4Q."
}