{
    "symbol": "NWSA",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-09 20:32:05",
    "content": " Second quarter total revenues were over $2.5 billion, down 7% year-over-year, which included a $171 million or 6% negative impact from foreign currency headwinds. We -- excluding the impact of foreign currency fluctuations, acquisitions and divestitures, second quarter adjusted revenues fell 3% compared to the prior year. Segment revenues were $386 million, down 15% compared to the prior year, impacted by the ongoing macroeconomic pressures on both the Australian and U.S. housing markets. Segment EBITDA declined 28% to $128 million, impacted by lower revenues and a negative impact related to currency headwinds, partially offset by lower broker commissions REA adjusted segment EBITDA declined 22%. At Move, revenues were $146 million, down 14% compared to the prior year, with real estate revenues down 17% driven by lower lead and transaction volumes, reflective of the broader housing market challenges, unique lead volumes fell 37%, while Realtor's average monthly unique users were $66 million in the second quarter based on internal metrics. Revenues for the quarter were $462 million, down 7% compared to the prior year on a reported basis due to foreign currency headwinds. Streaming revenues accounted for 26% of circulation and subscription revenues compared to 19% in the prior year and again, more than offset broadcast revenue declines, benefiting from both volume growth and higher pricing at Kayo and BINGE, we also benefited this quarter from growth in commercial revenues as the prior year results were impacted by the pandemic-related lockdown. Total closing paid subscribers across the Foxtel Group reached over $4.3 million at quarter end, up 10% year-over-year. Segment EBITDA in the quarter of $90 million was 5% higher versus the prior year, which reflects an 11% negative impact from foreign exchange. Dow Jones posted a strong top line performance in the second quarter with revenues of $563 million, up 11% compared to the prior year. Circulation revenues grew 3%, driven by strong year-over-year volume gains, including bundled offerings with total Dow Jones digital-only subscriptions up approximately 10% to over $4.1 million. Advertising revenues declined 7% to $131 million, with digital advertising revenues down 3% in the quarter and print down 13%, which was mostly due to weakness in December, with October and November reasonably stable versus the prior year. Dow Jones segment EBITDA for the quarter declined 3% to $139 million, reflecting a higher spending rate compared to both the prior year and first quarter, driven by costs related to the OPIS and CMA acquisitions, higher compensation costs and phasing of marketing expenses. For the quarter, revenues declined 14% to $531 million and segment EBITDA declined 52% to $51 million. Segment EBITDA of $59 million declined 47%, which was driven by approximately $22 million of higher costs related to the Talk TV initiative in the U.K. and other digital investments, notably in Australia as well as nearly $21 million negative impact from higher newsprint pricing."
}