{
    "symbol": "DLR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 22:49:09",
    "content": " Consistent with our full year guidance, same capital cash NOI growth was negative 3.1% in the first quarter, primarily driven by 220 basis points of FX headwinds, the timing of no move-outs and a customer bankruptcy. The U.S. dollar continued to strengthen over the last several months and FX represented a 200 to 250 basis point drag on the year-over-year growth in our first quarter reported results from the top to the bottom line, as shown on Page 11. But I would think in times like today, when there's increased volatility, supply chain issues, a war in Eastern Europe, having a global platform to support hyperscaler growth across now 50 metropolitan areas in 26 countries, it's a tremendous value-add to our hyperscale customers. And the hit I just called out in terms of the bankruptcy customer, call it, $4 million, $5 million or whatever, that was -- I think it's about 60 -- almost 70 basis points of that negative 90. In terms of the leasing into that capacity, if you basically just take the signed already in this quarter or last quarter or 2 that has not commenced to hit our occupancy and that would bring our same-store occupancy up about 80 basis points by itself, i.e., the leases are signed, they're just literally waiting for the customers to move in throughout the year. And then just to go back to Michael's question also on one of the slides, Slide 11, I think you outlined core FFO per share growth on a normalized sort of constant currency basis this year would be north of 7%. But obviously -- but you can see on a constant currency basis, we're now north of 7% on the bottom line core FFO per share that extraordinary FX headwinds this year, if you look back the last several years, you had, call it, currency fluctuations in the, call it, 2 to 5 or so percent. I would say, over the last several quarters, the -- call it, the mix was certainly helping us as we've kind of chopped through some of our largest customers, major expirations, as we got through more of the North America and more -- onto more international mix, having the less than a megawatt more highly connected destinations, legacy interaction, Westin, Telx, etcetera, being more -- a bigger piece of the puzzle. Bankruptcy, aside from a, call it, noncore straight-line right add back that's not in core FFO, we basically already absorbed about almost $4 million of a hit for the first quarter due to, call it, pre-petition receivables which I mentioned earlier on the call."
}