{
    "symbol": "FANH",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 23:24:06",
    "content": " Along with the high base effect resulted from the transition to the new critical illness definition framework in the first quarter of 2021, the gross written premiums, or GWP of the life insurance industry in China fell by 3.1% year-over-year. In the first quarter, we have hosted about 1500  Family Office Consultants or FOC training sessions, which focus on educating our sales agents on all round knowledge related to insurance trust and family trust and completed relevant certification programs for over 1,500 elite sales agents as define – those who have facilitated over 100,000 first year premium annually. We have also organized over 20 customer engagement activities targeting at high net worth customers as a result of which facilitated such customers to set up insurance trust accounts covering 50 large ticket insurance policies contributing more than RMB32 million of first year premiums in aggregate or RMB600,000 of first year premiums per policy. Improving the professional skills of our sales teams in the first quarter, apart from offering FOC training and certification programs, we have also finished establishing the course framework for family retirement planners or FPR is focus on courses in whole life insurance and annuity products and authorizing FRP lecturers. Over 500 elites, as well as their teams have become part of Fanhua since 2021 and contributed approximately RMB45 million of first year premiums in the first quarter of 2022, representing a strong power for Fanhua’s business growth. In the first quarter of 2022, first year premiums facilitated on Fanhua’s RONS open platform reached about RMB40 million up by 62.3% quarter-over-quarter and have shown an ever stronger momentum month by month. However the percentage of the total amount of first year premium is actually higher than the previous quarter and the previous year managing to the high base in the first quarter of last year, due to the top sales of critical illness products prior to the transition to the new critical illness definition framework."
}