{
    "symbol": "FANH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-22 01:19:03",
    "content": "  On the one hand with multiple factors such as the macroeconomic uncertainties, restrained consumption, resurgences of COVID-19 cases and the regulatory requirements of nationwide double recording at play, the gross written premiums of China's life insurance industry merely recorded a low single digital growth of 1.3% year-over-year, representing a sharp decline in the growth rate compared with the second quarter of 2022. The contribution from high performing agents increased even further with the number of 100,000 premium agents growing by 46% year-over-year, contributing 48% of our total first-year premiums in the quarter, up from 39% for the corresponding period in 2021. For trust services, as of the end of third quarter of 2022, Fanhua facilitated setting up nearly 150 trust accounts with over RMB1.7 billion in trusted assets, covering over 270 new insurance policies contributing RMB85 million of total insurance premiums. In the third quarter of 2022, FOC and FRP certified trainees contributed about 66% of Fanhua's first-year life insurance premiums, and the per capita productivity was much higher than that of non-trainees. In the third quarter, whole life insurance products, annuity and endowment, such savings products accounted for 87.5% of our total first-year premiums as compared to 83.6% in the same period last year. With the implementation of the  Phase 2, many life insurance companies actually is subject to greater restriction in terms of growing their business as the new accounting principles lowered the recognition of life insurance policies profit as capital which also is resulting in a lowered solvency ratio, therefore, subjecting them to greater gross pressure, capital pressure and this is also one of the reason that even though synergy  remains to be our largest , the shares in terms of our first-year premiums has not yet contacted from last quarter. For the insurance policyholders for savings products, such as whole life insurance and annuity insurance, the female accounted for 76% and over 60% of them are in the age group of 40 to 59 years old with per policy premiums of 48,000. In 2021, the insurance policyholders who paid over 100,000 first-year premiums annually accounted for approximately 1% of our total insurance policyholders for the long-term life insurance products. In the third quarter in particular, the percentage of the number of high performing agents, which are defined as those who contributed 25,000 during the quarter in terms of first-year premiums, accounted for -- actually increased from 26% in the same period last year to 43% this year."
}