{
    "symbol": "ENB",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-29 15:03:06",
    "content": " These new capital requirements are easily absorbed within our $5 billion to $6 billion of annual investment capacity, and there's no change to our equity self-funding model, as most of the capital that we've announced today will be spent beyond 2024. And back to the cost question, we've got enough surety to hear that -- we're comfortable that the project will be strong, and there's a lot of built-in mitigations to how the developer to this point is constructed and designed the commercial arrangements here. Just thinking about your two-pronged strategy in capital allocation, you've got growing gas opportunities that's evidenced by the numerous secured projects, and you've also targeting the low carbon strategy, you notice it's picking up scheme. Well, in a nutshell, Robert, we're not changing the capital allocation framework that I think we're pretty happy with the opportunity it provides, but not only that, it's just the ranking process that we go through to assure that we're generating good value. So we've got a lot of capacity aside from that $3 billion to deploy and have options to deploy either in new organic projects like the ones we're just talking about today, opportunities for tuck-in M&A. Actually, if you look at the two-pronged strategy, I think there's a very visible runway here, obviously, with, let's call them, the conventional projects that we've been used to, but you're going to see the ramp-up in lower carbon probably a little bit further down the road, and then it will start ramping up significantly. So I think the big message is a disciplined approach in renewable, given we recognize there's a lot of capital flows and it can get pretty frothy, so you're right about offshore. And I appreciate there's now a plus sign added to the $2.5 billion estimate, but perhaps at a high level, if you could comment on what gives you confidence that the budget on your T-South expansion or even the T-North expansion won't spiral out of control like we've seen from some of the other larger scale developments in BC."
}