{
    "symbol": "ENB",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-06 15:24:09",
    "content": " Joining me this morning are Al Monaco, President and Chief Executive Officer; Vern Yu, Executive Vice President and Chief Financial Officer; Colin Gruending, Executive Vice President, Liquids Pipelines; Cynthia Hansen, Executive Vice President, Gas Transmission and Midstream; Michele Harradence, Senior Vice President and President Gas Distribution Storage; and Matthew Akman, Senior Vice President, Strategy, Power and New Energy Technologies. We will try to keep the call to roughly one hour; and in order to answer as many questions as possible, we’ll be limiting the questions to one plus a single follow-up as necessary. With that, I’ll turn it over to Al Monaco. First of all, recent events are very troubling, and we’re all very concerned for the people in Ukraine. Many of our staffs have connections to the region, and we’re supporting them. So, I’ll start off with how we’re thinking about that followed by our business update, and Vern will cover our financial results and outlook. That translated into strong Q1 numbers, and we’re on track to achieve ‘22 guidance. So far in ‘22, we’ve added another $1 billion to our project backlog that will support post ‘24 growth. More broadly, we’re seeing a pickup in customer infrastructure, especially LNG export. Recall, there’s $5 billion to $6 billion a year of conventional and low carbon opportunity enterprise-wide in the hopper. The Russia-Ukraine war has worsened the demand-supply gap, obviously, but it’s also put energy back in the spotlight. Europe’s heavy reliance on Russia is driving this, of course, but the impacts are broader and global, regardless of when this war ends. We’ll need to accelerate low-carbon investments as well to meet demand, achieve emissions goals, and as part of the security buffer. To make that happen, we’ll need to pick up the pace on proven ways to grow low-carbon fields, like RNG, hydrogen and especially carbon capture. And that’ll mean leveraging existing transportation and storage infrastructure more quickly, like ours. Third, North America will play a much larger role in the global energy market, and here’s what. The North American energy advantage that we’ve been talking about is even more evident today, massive low-cost reserves and the technology to produce them with the lowest carbon intensity. And now, that’ll be needed faster. On low-carbon, $25 trillion will need to be invested with renewables, the largest component along with RNG, hydrogen, and again, carbon capture. On the conventional side, we’ll focus on optimizing throughput and modernizing our systems. On low-carbon, we’ll continue to align with the pace of transition and through ‘25, we’ll see over $4 billion of low-carbon opportunities. When you step back from all of this, we believe the two-pronged strategy approach makes even more sense today where energy security is back in the spotlight and where demands are conventional and low-carbon energy supplies will continue to rise. We’re on track to put US$1.2 billion into service this year, that’s on top of the US$2.4 billion last year. And along with our solar self-power projects, we’re lowering emissions. We all know what’s happening with global gas prices, but it’s not pretty for U.S. Northeast consumers either with gas prices at roughly 5x Henry Hub. This situation screams for more infrastructure, especially given increased supply variability from offshore wind that’s coming and more displacement of coal, of course. Building greenfield is tough sledding, of course, these days, but these expansions are executable and cost effective, and there’s more we can do. Plaquemines LNG is now fully contracted and likely going ahead, which will drive $400 million on our Venice Extension project, not in the secured category yet, but we expect it to be shortly. In fact, earlier this week, we saw NextDecade granted a 15-year SPA with ENGIE to support Rio Grande, seeing good momentum then here with both projects potentially reaching FID later this year. You’ve got a world-class liquids-rich resource base that rivals the Marcellus and Haynesville, and operators have done every bit as good job, unlocking reserves. LNG breakevens in Canada at roughly $6 to $8 an MMbtu rivals the U.S. Gulf Coast and looks very favorable if you look at these Asian LNG prices, somewhere in the order of $30 an MMbtu in Q1. Once they reach FID, we’ll need to create new capacity to replace volumes currently moving south. And depending on Woodfibre’s FID timing, we’re targeting a binding open season on T-South for later this year. Now, for either of these to move forward, we’ll need to see a clear path to execution with strong local community support and commercial underpinning. Seasonally, we’ll see a more concentrated maintenance season in Q2 than we usually do, offset by stronger volumes in the back end of the year. But, as we’ve said, we’ll need to see an appropriate return, given the risks we manage under that model. Given it’s often challenging to come to consensus, we’re preparing a cost of service filing, which is a very good alternative for us. In total, we’ve got roughly 400,000 barrels per day of egress opportunity on the Mainline and Express. Downstream, we’re continuing to develop the Houston terminal opportunities. And since we acquired Ingleside, we’ve seen increasing interest on several fronts, which is already proving out the upside. On conventional, we’re progressing a 2 million-barrel storage expansion. There’s also potential emerging for NGL exports, and stay tuned for more on that over the next while. As you saw today, we’re also now developing an integrated solution for blue hydrogen and ammonia production with Humble Oil. So, we’re now validating the geology. Another positive was the federal government’s investment tax credit, 50% on capture and 37.5% on transportation and storage. So, the utility continues to generate about $1 billion to $1.5 billion of ratable annual investment, so it’s a great business and a real gem in our portfolio. We had a strong quarter, exceeding our resource target, so that’s good to see. As you saw earlier, we’re installing turbines at Saint Nazaire, and we’re in the fabrication phase at Fécamp and preconstruction at Calvados and Provence Grand Large. Before I pass it over to Vern, as you heard, we’re seeing lots of positive fundamentals right now, and I’ve covered a variety of opportunities on both, the conventional and low-carbon front. So, he’s going to remind you about our framework and discipline around putting free cash flow to work and maximizing value. In liquids, the Mainline moved about 3 million barrels per day in Q1, up 9% year-over-year, taking advantage of the additional capacity from Line 3. As a reminder, until we finalize the tolling for the Mainline, we’ll be including a provision in our results for that segment. So, it’s been a very solid start to the year. With the strong first quarter, we’re confident we’re on track to achieve full year guidance. Our systems are expected to continue to be highly utilized, including the Mainline, which is on track for 2.95 million barrels per day on average for the year. We’re expecting Energy Services results in Q2 to be comparable to Q1, a slight headwind for the year. Our secured capital has been largely contracted for 2022, which provides good protection against capital cost increases, and we continue to manage our capital programs through active supply chain procurement and fixed price EPC contracts. So, let’s move on to our capital allocation framework. Our priorities remain unchanged, and we’re making good progress in all fronts. That’s the model going forward, ratable dividend growth supplemented where it makes sense with share buybacks. We expect between $3 billion to $4 billion will be deployed to low multiple organic expansions and system optimizations, along with utility rate base and modernization capital in gas transmission. That leaves about $2 billion per year available for more organic growth, asset acquisitions, share buybacks or debt repayment. While we review all of these options as we go through the year to ensure that we continue to maximize shareholder returns, all of these options will need to meet our low-risk business model, exceed risk-adjusted hurdle rates, have a strong strategic fit and align with our emission reduction goals. As always, we will continuously evaluate options to recycle capital where appropriate, to supplement the $5 billion to $6 billion of annual investment capacity. So, let’s move to that. Today, our secured capital program sits at just over $10 billion. And as you just heard now, we’re advancing a number of exciting opportunities across all of our businesses. Before I turn it back to Al, let me spend a minute on how we’re advancing our ESG priorities. We’re making good progress on the emission targets we set in late 2020, and we continue to challenge ourselves to do better. With that, I’m going to turn it back to Al. Finally, we’ll continue to take a disciplined approach and not compromise our low-risk business model. And taken together, we think this provides a great opportunity to grow the business and a solid value proposition for our investors. If I can ask first about the capital allocation priorities for that $2 billion and clearly in the first quarter and you showed that there’s -- it’s not either or, and there’s a number of things going on. But I’m just wondering with some of the changes in the environment, whether that’s the energy security opportunities, energy transition, as well as the higher share price. It’s a good question to start, Robert. Well, first of all, as you heard through those remarks, I think there’s been definitely a positive shift in the fundamentals. Discipline’s going to remain around the balance sheet, the dividend growth, and we’re going to continue to really make sure that we invest wisely. So, in a nutshell, I guess, a lot more opportunity, but we’ll continue to put a pretty strong filter on what we’re doing, and comparing opportunities that we have to invest capital with each other. And so, that’s really how we look at it, Robert, no major change right now, but certainly more opportunity ahead. I just was wondering as part of that, is there maybe a bit more of a bias to reducing debt effectively just for bringing up balance sheet capacity for new projects and a specific project, like interested to get your comment on. It’s just, there’s a lot of stuff going on in B.C., as you highlighted, and especially that T-South expansion’s pretty big. As to the capital allocation implications there and the size of those projects, if you think about it, we’re throwing off, as Vern said, a lot of free cash flow right now, and we will continue to do that over the next 2 to 3 years. So, the projects that we’re talking about are certainly not cash consuming, and let’s just say, in the next couple of years in any material way. So, in a way to get back to your original point, you’re sort of building up some excess capacity here while those projects will come to fruition in the next two, three, four years, capital spending-wise. As far as the balance sheet, Vern can expand on this, but essentially, we’re in very good shape right now. I think, we’ve been pretty clear about the 4.5 to 5. And as we said, we’ll be near the bottom of the range by the end of this year. And going back to what I just said, it’s possible that with free cash flow, the way it is that we could pop below that 4.5 in the next little while. So, in effect, we’ll be building up some capacity for that. Well, I’m going to start and then we’ll get Colin to provide some more details. And just broadly speaking in this region, Jeremy, we’ve got a big gas header along the Gulf. So, it’s naturally helpful for us to grow from this area. So, that’s sort of the big picture here. So, that’s the background in context of how we’re thinking about the region generally. So, think about this project probably with a capital cost of $2 billion to $3 billion. We’re JV-ing, so we have half of that. In terms of commercial construct, of course, we’d like to term this out under a take-or-pay type arrangement. And we’ll be jointly marketing the facilities with our partner, I think, European fertilizer companies, domestic and European power gen with respect to hydrogen. So, that’s the formula and model we’re looking for here. Trans Mountain, there’s delays. So, there’s headwinds there, uncertainty there. But, at the same time, even with oil at $100, we haven’t really seen material FIDs out of the WCSB. I’ll start again, Jeremy. So, maybe I’ll start this way. So, I think fundamentally, we’re very positive on that part. Obviously, we’ve got very high prices right now. We don’t need $100 oil for that to happen, but certainly, clarity on where it’s going longer term. They’re going to be looking at capital efficient solutions, debottlenecking first. And that’s where we come in, which, as we alluded to in the remarks, the Mainline is extremely well positioned for this. The Mainline tolling agreement actually will be important in that we need to see clarity on the commercial underpinning for those projects that we have in the queue here, which Colin can get to, but we need some clarity on that in order for us to continue to incrementally expand. And again, in this environment, incremental expansion, optimizations on the system are ideally suited, I think, for where the basin is and what these producers need to see in order to invest additional capital. So, the basin generally will be probably behind in its ability to react to increasing prices here as we’ve seen compared to, say, the Permian just because of the nature of what we’re talking about in the oil sands, longer-dated investment profiles. So, we’re keeping our Mainline expansion opportunities, ready to go here and advancing long-lead items, enable them to be there. We believe industry will continue to want some egress or some insurance egress having not had any for decades, and we’ll potentially leave that into any commercial arrangement we negotiate here. The timing of those will have to be TBD, but we’re keeping the warm, Jeremy. In the bigger picture here, again, if you think about it, we’ve got what would be two nice pathways through to the Gulf Coast, and that will continue to be an extremely strong market. The thing that’s happened recently here in terms of the security buffer that we’ve been talking about is the export position that we have relative to those two paths, I think it’s going to be ideal in terms of the longer-term future of heavy oil coming out of Western Canada. But now we’ve got this additional opportunity to really generate greater exports out of that region, too. I’ll go quickly, and then Cynthia will chime in. So, that’s the binding open season we’re talking about. So, when those 300 million cubes a day move to Woodfibre, then we’re going to need to come in with some additional supplies. So, that’s why we’ll really have that opportunity to expand T-South when that happens. Well, I think, again, I’ll go first. On the west, I mean, this is really the crux of the advantage, I think here in this particular case, whether you look at the community aspects of building your infrastructure and obviously the indigenous groups that are along the right of way. The fact that we’ve been there for so long, the fact that we have good relationships and the fact that in this particular situation we’re not doing a lot of looping or twining of pipelines here. So, I think in this case, we’re in pretty good position to expand the T-South system, certainly that goes for T-North as well. So, it’s something we can manage. So, I think we’re in reasonable shape these days, as far as you can be in a tough environment, permitting wise and in an inflationary setting. The challenges that everyone is facing, it’s not just in B.C., as we know. On the Ingleside facility, I just wanted to get an update in terms of the interest you’re seeing from customers to potentially export NGLs from this facility. Colin, do you want to take that? We’re looking at various forms of purity, NGL export out of Ingleside. Won’t be too specific, but we’d be sourcing them locally obviously. So, I think I’ll just leave it there for now. So, we’re continuing to have those conversations with the key players or key customers to figure out the best path forward to serve the incremental needs. I’m wondering, if you can discuss, if there’s been, if you feel there’s an understanding by policy makers, especially in the U.S. for the need to get permitting, moving in order to build the infrastructure that’s required to deal with this energy crisis. And just being honest there, there’s a myriad of issues, of course. You’ve got federal versus state jurisdictions, and quite a complex array of permitting agencies and approvals that are required. And so, we’re hopeful. I will add too though that you really have to be skilled in this area these days, regardless of the policy issues that you’re alluding to. In the context of changes in global flows of crude and the Russian production and exports on the crude side currently seems to be rerouted, but certainly some long term uncertainty there, coupled with Mexico’s publicly expressed intention to consume more and more of their domestic production, which is heavy sour in nature. And how Russian volumes get reabsorbed and how flows realign and change, I think that’s yet to be determined. But as I alluded to in the remarks, it’s pretty clear that -- and I’m going to say North America here because well, Canada and the U.S. because of the integrated nature of our systems here in North America, really are in position to fill this gap. I know you didn’t mention gas, but that’s part of it as well. So, we’re probably a little bit early to figure out exactly where the flows get realigned. But for sure, we’re in pretty good position. So, the point you’re making is being alive and well for a while. And I think the points you’re making now even accentuate competitiveness of Canadian crude, and that you didn’t mention Venezuela, but that’s been a structural factor in decline as well into the Gulf. And as Al mentioned, we’re looking at another path down through Cushing as well, all feeding the same phenomenon. We’re taking contracting, our firm service off the table. So, I think we’re probably looking there at about $750 million, Theresa, and probably trending up. Colin, do you want to take that? I think, Al mentioned this more broadly earlier, I think policymakers all around, certain both sides of the boarder, fully get the importance of keeping existing infrastructure flowing, especially in light of recent events globally. So, that’s all encouraging. So, that’s the latest there, Linda. It’s -- Colin is right about the Canadian government’s activity and involvement here, which has been very strong. But, it’s also state governments in the surrounding region of both, Michigan and Wisconsin, who certainly get the criticality of this infrastructure to their states and consumers in the region. So, that’s helped, too. And just sticking in the region, there’s an Ontario provincial election coming up. We’ve been working with the government on a number of initiatives, whether that says we’re looking at funding in RNG or hydrogen. Looking through your slides, so there’s a number of chunky projects, $1 billion to $2 billion, and you guide in the B.C. There may be -- yes, I mean, it’s always possible that that number rises, but on the other hand, I think that the important thing is how we filter the number and ensure that we maintain the discipline that we have been focused on here over the last number of years. So, yes, the hopper may be larger, but we’re going to be very careful about how much we deploy, which has generally been constrained to the amount of free cash availability that we have to invest. I think we talked about this very -- quite a bit at our Investor Day in December, and there’s really no change. So, we’re going to go through and make sure that the highest and most attractive projects get done first. And then, if we have too many opportunities, that’s fortunate some of these won’t just proceed. So, Ridgeline, we’re continuing to progress with that. So, I think that’s the order that needs to happen. I mean, this is -- one of the things we’re talking about with the customers, Colin and his team are in that. Like you said, we’re ready to go on these. And I think it will be really important to provide some additional capacity here given the opportunity that’s in front of the basin in terms of where we’re at fundamentally, which is what we’ve been talking about a lot on the call, very positive. Brian, it’s Colin again. And so, it’s likely those would be considered or concluded together. The downstream legs of that path would be contracted though, maybe that’s your question, whereas the capacity on the Mainline would potentially be more open access, so, but likely to come together all at once. But just curious if you could just talk about how the relationships with DCP and PSX and in addition to the new cracker in the region could ultimately drive success for the projects and ultimately, whether Enbridge were considering JV-ing with the project around NGL…\n I think, this is back to you, Colin. I don’t have specifics here, but yes, we do have obviously a great relationship with the parties you mentioned, and they’ll be in the mix here, Brian."
}