{
    "symbol": "PAX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 14:49:21",
    "content": " We're now seeing significant AUM inflows from fundraising, with $1.5 billion raised in the first quarter across a diverse range of products, putting us in a good position to raise more than $4 billion organically this year, including our first closing of more than $800 million for our seventh generation private equity fund, one year ahead of expectations at the time of our IPO. We also listed our first SPAC Patria Latin American Opportunity Acquisition Corp, a $230 million effort, which gives our private equity business a versatile pool of capital to pursue attractive investments that may not fit our flagship fund profile. Our funds continue to perform very well reflected in our net accrued performance fee balance of $503 million, which is up 45%, just from last quarter, and has doubled from one year ago. In private equity, we had more than a $1 billion of AUM inflows, driven by the first closing of more than $800 million in our next vintage flagship fund, as well as the SPAC listing, which raised an additional $230 million. Management fee revenue of $54.6 million is up 74% compared to 1Q ‘21 and also up about 30% compared to last quarter, reflecting both the full impact of Moneda as well as incremental fees on the $750 million we deployed in our drawdown fund in the second half of 2021. Total AUM of $27.6 billion is up 96% compared to one year ago, driven not just by the addition of Moneda, but also by $1.5 billion of fundraising inflows and more than $3.6 billion of valuation and currency gains. So going back to your first question on fundraising for Private Equity VII, as far as timing and expectation I think we're right there where we want to be and very aligned with previous fundraising, for Private Equity VI, V, et cetera going back in time, we normally have a first close, which is approximately 25% to 35% of what we announced that we want to fundraise. My question is on the deployment, just want to see how you think about the ability to deploy capital in the current market environment, you highlighted you had to deploy on $2 billion over the last 12-month in the quarter, it was only $55 million in mostly in others and not in private equity or infrastructure. So I'm confident there's well of course $200 million, given the size of things within Patria, it's important on this on a strategic side and because of the performance fee that actually this fund generates not, doesn't move much the needle on the management fees on the $200 million itself."
}