{
    "symbol": "PAX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 15:15:03",
    "content": " For the full year 2022, fee-related earnings were $130 million and distributable earnings were $147.1 million, or $1 per share, bringing cumulative dividends to shareholders to $0.85 per share for the full year. Our third generation infrastructure fund reached the threshold with crystallized performances, realizing $19 million net in Q4, following the exit transactions of ODATA, our data center platform, and Entrevias, one of our toll roads in Brazil. Fund III continues to perform well with a net IRR of 13% in U.S. dollars and a net performance fee accrual of $129 million, which importantly, we can now continue to monetize with each subsequent exit event. We generated $35.3 million of fee-related earnings in fourth quarter '22, up 20% compared to fourth quarter '21 and 130 million for the full year 2022, up 51% from 2021 and reaching the guidance weâ\u0080\u0099ve reiterated throughout the course of the year. Total fee revenues of $227.1 million were up 55% in 2022 compared to the prior year, supported by 52% growth in management fee revenue as well as higher transaction and other fee revenue. In 2022, however, we are seeing just the beginning of the performance fee stream from the Infrastructure Fund III, a fund with still 129 million in net accrued performance fees as of the year end. Fee earnings AUM ended the year at 19.2 billion, up 7% from one year ago, with inflows from drawdown fund, deployment and M&A partially offset by the redemption pressure in credit and public equities, as well as the end of the contractual fee term in our second infrastructure fund. As of December 31, our net accrued performance fees stand at $462 million, up 33% from one year ago and that's after realizing $19 million in the fourth quarter. But fixed income related I think will be more of a chunk of the next fundraising and a lot of drawdown funds in that bucket, as mentioned infrastructure Fund V, private credit fund II for Brazilian investors, infrastructure credit fund I also for international and Brazilian investors, a LatAM private credit fund also that we are raising that will target Latin America as a whole on the private credit side, plus the real estate permanent capital vehicles, and infrastructure permanent capital vehicle. As we look into '23, I think we're confident that we're going to be able to deliver again on our $150 million guideline for FRE and hopefully be able also to convert some of that performance fees into realizations throughout the next years."
}