{
    "symbol": "MAX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 21:34:12",
    "content": " At this time, Iâ\u0080\u0099d like to welcome everyone to the MediaAlpha Q3 2022 Earnings Conference Call. After the market closed today, MediaAlpha issued a press release and shareholder letter announcing results for the third quarter ended September 30, 2022. Our discussion today will include forward-looking statements about our business and our outlook for future financial results, including our financial guidance for the fourth quarter of 2022, which are based on assumptions, forecasts, expectations and information currently available to management. Please refer to the companyâ\u0080\u0099s SEC filings, including its annual report on Form 10-K and its quarterly reports on Form 10-Q for a fuller explanation of those risks and uncertainties and the limits applicable to forward-looking statements. In addition, on todayâ\u0080\u0099s call, we will be referring to certain actual and projected financial metrics of MediaAlpha that are presented on a non-GAAP basis. Finally, Iâ\u0080\u0099d like to remind everyone that this call is being recorded and will be made available for replay via a link on the Investors section of the companyâ\u0080\u0099s website at investors.mediaalpha.com. Iâ\u0080\u0099d like to make a few observations about the quarter before turning the call over to our CFO, Pat Thompson, for his comments. Due to ongoing inflation driven underwriting losses, auto insurance carriers continue to limit their variable marketing investments in Q3 and that spend remains extremely depressed relative to normal levels. Recently, the profitability pressures on P&C carriers have been compounded by the large insured losses from Hurricane Ian, which we expect to lead to a further pullback in marketing spend by carriers in Q4. On the positive side, carriers continue to pursue and gain approval for rate increases in many states, which will ultimately lead them to resume their growth focus as profitability improves. As a result, we anticipate improved performance in our P&C verticals when the industry begins to emerge from the current hard market cycle and carriers once again turned to MediaAlpha to help them meet their growth objectives. In our health insurance vertical, we expect transaction value to be down slightly year-over-year as robust spend from our carrier partners is offset by lower spend from brokers. We continue to be very optimistic about the long-term growth outlook for this vertical, which is in the very early innings of the shift to online shopping and enrollment. Given this difficult marketing environment, we are continuing our disciplined approach to expense management while maintaining our capacity to outgrow our peers coming out of the P&C hard market cycle. While this has been a challenging year, we remain as bullish as ever regarding our prospects for long-term profitable growth once market conditions improve. The secular shift to direct-to-consumer distribution and digital marketing continues across all of our insurance verticals, and our marketplace remains unparalleled in its scale, scope and capabilities. In our P&C vertical, Q4 transaction value typically declines relative to Q3 and is the slowest quarter of the year. In our health vertical, Q4 is our strongest quarter due to the timing of annual enrollment periods for ACA and Medicare plans with Q4 transaction value usually representing approximately 40% of the full year total. Turning to the balance sheet, we paid down $17.5 million of debt during the quarter and ended the quarter with $30 million of cash and cash equivalents. These covenants are based on consolidated EBITDA, as defined in the credit agreement, which includes a number of significant add-backs not included in adjusted EBITDA, such as public company costs and is therefore materially higher than adjusted EBITDA. Looking ahead to Q4, our guidance reflects a similar year-over-year decline in P&C transaction value as in the third quarter now that we have crossed the first anniversary of the start of this hard market cycle. Within our health insurance vertical, we expect transaction value to be down slightly year-over-year as robust spend from our carrier partners is offset by lower spend for brokers. As a result, we expect transaction value to range from $155 million to $170 million, a year-over-year decrease of 34% at the midpoint. We expect revenue to range from $110 million to $120 million, a year-over-year decrease of 29% at the midpoint. Lastly, we expect adjusted EBITDA to range from $5 million to $7 million, a year-over-year decrease of 55% at the midpoint. We are projecting our operating expenses, excluding non-cash items, to be $1.2 million to $1.7 million higher than Q3 2022 levels driven by both temporary and seasonal increases in non-headcount operating expenses. I wanted to ask you, the first one is just another player in the space mentioned that one big carrier had achieved rate adequacy and it started spending again. I think overall, what we are seeing isnâ\u0080\u0099t that different from what we talked about in the past, which is that I think as we are seeing from the Q3 results from a lot of the P&C carriers. And certainly, there are some carriers who feel like they are there. And we have seen them lean back into growth mode, increasing the marketing investments. And certainly, here, notwithstanding the effects of Hurricane Ian and the pullback that we alluded to in Q4, we continue to expect to see quarter-over-quarter increases in their marketing budgets as we get into 2023. I think itâ\u0080\u0099s fair to say that the majority of other carriers, though, are still in the middle of the process of getting their rates increase to achieve rate adequacy. And so what we are expecting and planning on is really through 2023 on a carrier-specific basis, market recovery to happen, marketing budgets to return. And so I think itâ\u0080\u0099s fair to say that through 2023, we are expecting recovery to start, but that it might be a little bit lumpy, non-linear because it will be based on each specific carrier achieving rate adequacy. And again, it depends on the severity of the event, as well as what carriers are expecting in terms of the overall combined ratio for the year. I think overall, as we think about how the markets can recover, certainly, the effects of Hurricane Ian could linger into early 2023. The feedback has been that in Q1, they will lean back in and certainly by the time that other carriers follow suit later in the year. The â\u0080\u0093 on the breakdown of our health vertical between Medicare and under 65, thatâ\u0080\u0099s not a number that we disclose. The thing I can tell you is that itâ\u0080\u0099s a healthy mix between the two, and itâ\u0080\u0099s â\u0080\u0093 itâ\u0080\u0099s not like itâ\u0080\u0099s 80-20 skewed in one direction. And as we think about the Customer Helper Team acquisition, that business was pretty heavily focused on Medicare when we bought it. The Medicare market, I think is you and most investors know, has been relatively challenged over the course of this year. Part of the deal thesis on that was that the capabilities they had in Medicare could be extended to other areas, for the area we chose for that is under 65 health. In that area in Q3, we are in the third day of OEP right now, and the business is seeing kind of the expected uplift you would see in that period. And we kind of remain long-term bullish about the opportunity for CHT, both in Medicare and in other verticals like under 65 health. The thing I would say is that generally, across our health vertical in general and probably Medicare in particular, carrier spend has been quite a bit stronger than broker spend for us. And as we look forward, we think that is a trend that will probably continue in that carriers are looking to Medicare Advantage to be a big growth area for them, I think as I get reports from you and some of your peers, thatâ\u0080\u0099s always one of the four or five bullet points in the summary is Medicare Advantage growth. And I think the benefit of the carrier is kind of gating an importance is that we have this playbook, and we have executed it before in P&C where P&C was the space where brokers were relatively penetrated. And you have seen the customer acquisition efforts skew very, very heavily to carriers over time. And we expect that carriers will continue to rise in importance in the health channel, although we believe that over time, brokers will continue to be very valuable to consumers that want to carriers. I guess if we listen to most of the auto carriers over the course of the third quarter, it sounds like there was this recognition that things are worse than they thought. Yes, I think that generally resonates with us and what we are hearing from our carrier partners. Referring back to my earlier comment, I mean there are some carriers who feel that they achieved rate adequacy. But I think that the majority of the carriers that we are working with, I think are still working through it. And we have seen some positive news on that front, used car prices coming down, California proving its first rate increase, I believe in 2 years. But I think overall, itâ\u0080\u0099s fair to say that the comments you made about the auto insurance carriers and how difficult this market environment has been. Second, this is sort of an abstract question, but it looks like Hurricane Ian may force a return to a more actuarial basis for pricing homeowners in Florida. And just one last question, the $8.6 million impairment of cost method investments, does that have anything to do with the other verticals closing? The â\u0080\u0093 we have an equity investment that we made several years ago, and itâ\u0080\u0099s a company kind of in the space, and we were holding that investment at book value. This past quarter, we have heard one of our coverage companies, Bright Health get out of the of the ACA exchange market altogether. I think that the transition within the under 65 space to having carriers go direct-to-consumer, invest in marketplaces like ours, we have seen a steady upward trajectory there. I think we have seen more of that within the Medicare Advantage space, certainly with major carriers. Again, based on earlier comments really leaning into this space and building a good balance of distribution through brokers, agents as well as building direct capabilities. And so with respect to our overall sentiment with regard to health insurance, I mean we continue to see just the broad trends there with health insurance companies overall, really increasingly going direct-to-consumers, having an interest in doing that and building those capabilities. And over the long-term, I think we will continue to see benefit from that because, as Pat mentioned earlier, thatâ\u0080\u0099s really within our way house the ability to work with major insurance carriers to help them deploy their performance marketing dollars in a transparent and a super-efficient way. And so as rates go up â\u0080\u0093 the rates on the floating rate debt go up, we typically kind of lock in the rates quarter-by-quarter is what we have been doing thus far this year."
}