{
    "symbol": "AIR",
    "quarter": 1,
    "year": 2022,
    "date": "2021-09-23 22:08:03",
    "content": "  Operator: Good afternoon, ladies and gentlemen, welcome to AAR's Fiscal 2022 First Quarter Earnings Call. Before we begin, I would like to remind you that the comments made during the call may include forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. These risks and uncertainties are discussed in the company's earnings release and the Risk Factors section of the company's Form 10-K for the fiscal year ended May 31, 2021 and providing the forward-looking statements, the company assumes no obligation to provide updates to reflect future circumstances or anticipated or unanticipated events. At this time, I would like to turn the call over to AAR's President and CEO, John Holmes. Our positive momentum continued with another quarter of solid results, despite the continuing impact of the COVID-19 pandemic. Compared to the prior year period, sales were up 14% from $401 million to $455 million and adjusted diluted earnings per share from continuing operations were up 206% from $0.17 per share to $0.52 per share. We are particularly pleased that our sequential growth from Q4, Q1 was 4%, notwithstanding the fact that our first quarter typically declines from our fourth quarter as a result of seasonality in our business. For context, our margin this quarter was actually higher than 2 years ago prior to the pandemic even though our revenue was down $86 million or 16%. This performance demonstrates the operating leverage that we have created over the last 18 months by optimizing our MRO operations, exiting underperforming activities and reducing indirect and overhead costs. It was another strong quarter, as we generated $18 million from operating activities from continuing operations. Excluding the impact of that AR program, our cash flow from operating activities from continuing operation was $26 million. Subsequent to the end of the quarter, we announced several new business wins. Like our prior C40 aircraft delivery contract with the U.S. Marine Corps, this contract demonstrates the significant cost savings available to government customers by procuring in the aftermarket. Finally, we announced an extension of our component support program with Volotea, a growing low cost Spanish carrier which reflects the market's continued demand for this offering and our ability to drive, lower operating costs with superior operating performance. With that, I'll turn it over to our CFO, Sean Gillen to discuss the quarter in more detail. Sales in our Expeditionary Services segment were down $17.7 million, reflecting the divestiture of our Composites business and strong performance of the U.S. Air Force pallet contract in the prior year quarter. As the commercial market recovers, we would expect to continue to generate higher gross margins, given the fixed nature of some of our cost of sales and the higher margin nature of our parts business, which is not yet participated in the market recovery to the same degree as our maintenance business. As we indicated during last quarter's call, one of our commercial programs contracts was terminated during the quarter. SG&A expenses in the quarter were $49.3 million or 10.8% of sales excluding severance of about $1 million, this would have been closer to 10.6% of sales. As a reminder, last year's results had contemporary cost savings due to salary and benefit reductions that were in place through Q2 of last year. Net interest expense for the quarter was $0.7 million compared to $1.6 million last year, driven by lower borrowings. With respect to Afghanistan, as we discussed on last quarter's call, we had in-country activity on 2 programs, our WASS program supporting the State Department and our C130 program supporting four Afghan Airforce aircraft. In conjunction with the state department's exit from Afghanistan, we are winding down related activities and expect that to be completed later this quarter. In total, our FY'21 sales in Afghanistan were $67 million, the margins on these activities were consistent with the overall WASS program, which we have described in the past as being high single-digit operating margin. As John indicated, we generated cash flow from our operating activities from continuing operations of $17.5 million as we continue to reduce our rotables and inventory balances. In addition, we reduced our accounts receivable financing program by $8.4 million in the quarter. Looking forward, we expect that demand for our MRO activities will remain strong as airlines continue to focus both on readiness to support the recovery in air travel and on preserving a healthy maintenance supply chain. With respect to part supply, while we saw increasing levels of activity during the quarter, we expect stable performance in the near term as a result of the uncertainty created by the Delta variant. On the government side, the exit from Afghanistan as well as the programs nearing natural completion points will have a near-term impact on our business. However, our Department of Energy contract is an offsetting award that demonstrates the fundamental value proposition of our commercial best practices business model. As such, we believe that over time, we remain in an excellent position to grow our government business through additional program wins and expansions of our current positions. We have emerged from the crisis with an even stronger balance sheet, our government and commercial pipelines are full and the operating leverage we have created positions us to continue to drive further margin expansion. The majority of it was really driven by the trading business, which is still considerably far off pre-pandemic levels, but they did have a nice sequential improvement. What we are seeing is that while we had kind of increasing levels of activity throughout the quarter, we have seen more stability and the pace of that recovery moderate in the last few weeks. Just on the gross margin, I know you obviously had on the adjusted gross margin good year-over-year growth, but sequentially, it dipped down a bit and you just said, parts was actually strengthening a little bit and recovering a little bit. And that program at this point is a full contributor, I would say that basically at full run rate in the quarter and we expect those levels to be consistent throughout the rest of the year. What we have been able to do and this was by design based on the changes that we made during the pandemic is really improve our efficiency inside the hangars and by optimizing our footprint in aligning our hangar space with where we see the most labor availability and that's full time labor availability as opposed to a contract labor, we've been able to achieve superior performance inside the hangars. I know, you had a program, a contract that you exited in the quarter. And so in terms of anything new happening in this quarter, there wasn't anything but that program contract that was situational. They've been a long-term customer of that airline, is a great success story and the volume of work that we've done with them has grown as they've grown and we're excited to be on that contract for another few years. Listen, we really appreciate everyone's interest and support and I look forward back and look forward to being back here in 90 days to talk about our second quarter."
}