{
    "symbol": "AIR",
    "quarter": 4,
    "year": 2022,
    "date": "2022-07-21 11:01:09",
    "content": " Good morning, ladies and gentlemen, and welcome to AAR's Fiscal '22 Fourth Quarter Earnings Call. We're joined today by John Holmes, President and Chief Executive Officer; and Sean Gillen, Chief Financial Officer. Before we begin, I would like to remind you that the comments made during the call may include forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. These risks and uncertainties are discussed in the company's earnings release and the Risk Factors section of the company's Form 10-K for the fiscal year ended May 31, 2021, and Form 10-Q for the fiscal quarter ended February 28, 2022. In providing the forward-looking statements, the company assumes no obligation to provide updates to reflect future circumstances or anticipated or unanticipated events. At this time, I'd like to turn the call over to AAR's President and CEO, John Holmes. Before I comment on the results, I would like to take a moment to reflect on the last fiscal year. In addition, the U.S. withdrawal from Afghanistan as well as the natural conclusion of certain of other of our government programs, created headwinds in our government business, which had been an important source of strength during the pandemic. Finally, in the macro environment, labor has been in short supply, inflation has been running high, and there is uncertainty about economic growth. In light of this backdrop, I'm incredibly proud of the results that we delivered this year. Even more importantly, we were able to continue to drive efficiency improvements and cost discipline to deliver significant earnings growth. For the quarter, sales were up 9% from $438 million to $476 million and adjusted diluted earnings per share from continuing operations were up 53% from $0.47 per share to $0.72 per share. Sequentially, our total sales growth was 5% and our adjusted EPS growth of 14%. Our operating margin was 7% for the quarter on an adjusted basis, up from 5.2% last year and 6.7% in the third quarter. We continue to see strong performance in our MRO operations as our hangers remain nearly full, and we continue to benefit from the efficiency initiatives that we implemented across the company during the pandemic. In our parts activities, we saw further recovery in the quarter but demand remains inconsistent and the availability of used serviceable material to support our trading operations remains in short supply for certain platforms. While we saw a decrease in revenue, it is important to note that despite this decline, we were able to expand margins during the quarter. Just taking a step back, I would like to highlight that in this quarter, we delivered adjusted operating margin and EPS that exceeded pre-COVID levels, despite our sales being down 15% from their pre-COVID high. This was a goal we established early in the pandemic, and I'm proud of the work we've done to deliver against that commitment. Regarding cash flow, it was another strong quarter as we generated $40.2 million from operating activities from continuing operations. Even after the share repurchase, we reduced our net debt leverage to 0.3x EBITDA, and we continue to be exceptionally well positioned to fund our growth. During the quarter, we announced a marketing partnership with ProvenAir Technologies which has developed a digital solution that uses proprietary algorithms to analyze and dynamically generate back-to-birth trade history for aircraft parts. This kit has the potential to reduce fuel burn by 1.5% for the 737-700, which equates to over 40 tons of CO2 reduction per aircraft per month and the benefits are expected to be even larger of the 737-800 and 737-900. With that, I'll turn the call over to our CFO, Sean Gillen, to result -- to give us results in more detail. Sales in our Aviation Services segment were up 9%, driven by the recovery in our commercial business, and sales in our Expeditionary Services segment were up 4.5%. Overall, our commercial sales were up 28% year-over-year, while our government sales were down 13%, driven by the wind down of our activity in Afghanistan and the natural completion of other government programs. Sequentially, our commercial sales increased 11%, and our government sales decreased 3%. Gross profit margin in the quarter was 18.9% versus 16.4% in the prior year quarter, and adjusted gross profit margin was 18.6% versus 16.5% in the prior year quarter. The government margin was driven by continued strong performance as well as certain contract modifications, which resulted in higher recovery on indirect costs. As a reminder, our fourth quarter has historically been our seasonally highest SG&A quarter, and we remain committed to driving SG&A down as a percentage of sales while continuing to invest in our cost. Net interest expense for the quarter was $0.6 million compared to $0.9 million last year, driven by lower borrowings despite the increase in interest rates. As John indicated, we generated cash flow from our operating activities from continuing operations of $40.2 million. In addition, we funded $22.2 million of share repurchase and reduced our accounts receivable financing program by $3 million. Consistent with the last 2 quarters, we expect to continue to execute on our plan to deploy the full $150 million share repurchase authorization over approximately 2 years from the time of announcement. Looking forward, while demand for domestic and European commercial travel continues to be very strong, global traffic recovery in total continues to be slower, and we are paying attention to the macroeconomic environment and its potential impact on the market for air travel. For us, commercial parts demand should generally track the recovery in commercial flying. Within commercial parts activities, the growth of our used parts sales will also be impacted by the availability of supply, which remains tight for certain platforms while the growth in our new part sales should continue to benefit from the new distributorships we have won recently and those that remain in our pipeline. Demand for MRO remains strong, and we expect the hangers to remain largely full throughout this fiscal year. In our government business in the coming quarters, we expect growth to return as recent program wins ramp up and as we convert opportunities from our strong pipeline. With respect to Q1 specifically, as you know, historically, Q1 has been a down quarter sequentially from Q4, and we expect that to be the case this year. For full year FY '23, given that the trajectory of the commercial aviation market recovery remains difficult to predict, exacerbated by increasing macroeconomic uncertainty, we are going to continue our recent practice of not providing formal guidance. Having said that, based on what we can see today, we expect sequential quarterly growth to return beginning in Q2, and we will continue to provide updates as we move through the year. I'm excited about all of the opportunities we have ahead of us, and the team and I remain committed to delivering value for our shareholders. During that time, he more than quadrupled the company's sales while navigating numerous peaks and valleys in the aviation industry, including both 9/11 and the great financial crisis. Even more importantly, he established and modeled the doing-it-right approach, which is the culture we continue to live by, and set the foundation for the company to be the pillar of strength and opportunity than it is today. John, I appreciate the commentary on sort of the full year '23 outlook and, I guess, lack of visibility. From what we see today, the hangers are largely full, and we expect continued strong demand throughout the year in heavy maintenance. On the parts side, the distribution business, the commercial distribution business, continues to grow, and that's largely driven by the new wins that we've announced in the last 18 months as they come online. So we expect growth in the new business, in the new parts business as a result of those wins. In the used parts business, it's more of an inconsistent story. But as a result, there's also a lot of demand for material and that's in tight supply. So -- in summary, I feel very good about MRO, feeling good about the continued recovery and growth in commercial parts distribution but a bit of an uneven story in trading based on the factors I just described. So -- in terms of feedstock and the trading business, that's one of our greatest strengths right now is our balance sheet capacity and our ability to move very quickly and outmaneuver the competition when packages or material become available. As it relates to PMA and other initiatives specifically, we do have organic PMA efforts underway, and we're encouraged by the progress there. It's early and it's slow growing, but we do have a nice team focused on organic PMA efforts. And as we've indicated in the past, we will continue to look at inorganic opportunities to bolster that effort if assets become available and we can get valuation, et cetera, to align with expectations. As I look at then the investments, you had some nice growth in cash from obviously '21 through '22. We're really proud of the consistent cash flow that we've been able to generate, and that goes along with the consistent margin improvement, et cetera, that we've been able to drive in the business overall. We certainly expect to be cash flow positive again this year, and our goal is to remain consistent in terms of cash flow generation. Having said that, though, just going back to your prior question, if we see an opportunity to make a great purchase of hot engine material or feedstock to serve other parts of the trading business, we're going to deploy that cash and deploy it quickly. So while the goal, overall, is to continue to generate cash and continue to be more efficient with our working capital, we want to remain flexible so that we can react to market opportunities. Just on that comment there, the uneven story in the parts business, I think you said you saw an acceleration in Q3, Q4, then a moderation here. And that's been consistent throughout the pandemic and very, very strong. I mean, at this point, it's fully ramped up. And we continue to work with Fortress as they expand their business and their engine portfolio, we could see growth in that platform. But at this point, it's operating at full capacity and at the level we expected. I mean we're really proud of the way we held together the team through COVID, and that has served us very, very well. We continue to fund those partnerships, and we continue to get results in terms of, I would say, a proprietary source of talent with these relationships we have with the schools to support the MRO business. In the markets where we're limited by Foursquare , we are considering opportunities to expand our footprint, where we know we've got supply of labor, and we know we're going to have longer customer interest. So at this point, when we say the hangers are full, we mean full both in terms of footprint as well as labor availability. But as we move forward, we're going to again focus on some targeted expansion to look for ways to grow that business domestically. We've seen a lot of improvement in efficiency in that business over the last 18 months, and we want to hold on to that. So as we see increasing labor costs, that is driving any discussions we're having with the customer about price adjustments. I think we've mentioned that our customers, as you've heard from them, they're seeing the exact same labor pressures we are. But so far, we've been very pleased with the support we've gotten from the customer on the need to change prices to address rising labor costs. And in the past, you've talked about the need to see a sort of a more material inflection in demand for surplus material in the revenues associated with the surplus parts market to really see a step change in the margin profile. It sounds like, from your comments, that we're maybe not there, at least in the first half of fiscal '23. So again, very proud of the progress that we made over the last 7 quarters on operating margin improvement. And as you know, we're now well exceeding, particularly with this configuration of businesses, well exceeding the margins that we had pre-COVID. As we see the parts business recover, and you're right, we're not at that inflection point yet where we'll see a meaningful step up from where we are as we see that parts business recover and the overall revenue mix shift towards the parts businesses, we would see further margin expansion. As you highlighted, I don't think we'll see that meaningful step change in the first half of the year. But as the supply chain issues or labor issues get worked out in the system and airlines can service the demand that they see and flying increases, we would expect parts business to pick up in the second half of the year. Just to quantify that, our -- both in the trading and commercial parts distribution, overall down still about 20% from where we were pre-COVID. So we have seen a modest improvement there, which contributed partially to the sequential margin improvement that we saw this quarter. But given we're still 20% off of pre-COVID levels, we've got a ways to go in that business. And again, that would help margins throughout next year or this year. John, just on '23, I know you're not going to give the guidance, but if we went back to last quarter, you talked about this inflection, a more meaningful inflection in '23. I go back to the prior comments in as much as we still see the potential for that, I think at this point, it's a second half discussion as opposed to a first half discussion. And when we talk about getting back to pre-COVID peak revenues, keep in mind, we structurally took out revenue from the company from activities that weren't profitable or were unprofitable. And so really, in terms of getting back to pre-COVID levels, we're talking about parts businesses. What -- as we think -- you said more second half -- and I mean, obviously, we're seeing the results from the airlines now. I mean, I think we're all looking at potential global economic slowdown. I think, overall, the airlines remain bullish on the return of demand. And we believe that the current generation of fleet based on what we're hearing, which is the fleet that we're predominantly involved in endorsing is still going to be around for longer than people initially expected. I think the challenge for the customers -- for our customers right now is really, as you've heard from them, it's driven by the staffing challenges that the airports themselves, pilot shortages, which have caused them to have to cancel flights and fly less. But overall demand for air travel that we're hearing from our customers still remains very, very strong. It's just about getting the system back up fully running, so that we can actually support that demand. And so again, while we're kind of in a bit of an uneven period here, we still feel really good about that return of the parts business and the fact that the platforms in which we operate and perform maintenance on that they're going to be around for a long time. And if I go back, and I don't know, it's maybe 15 years or so, they're kind of comparing this to winglets and the opportunity that, that presented, which really significant for a lot of the aftermarket players. We're excited that they announced the STC on the 737-700, and we know they're working on the same for the 737-800 and 737-900, which obviously is a very large fleet. And given the price of fuel today, we expect that the airline community interest will be extremely strong in this solution. So we're very bullish, both from an investment standpoint but also as it relates to the exclusive agreement that we've got in place to distribute the kits as they're developed and produced. Once again, I really appreciate everybody's time and interest in the support and we look forward to reporting on our first quarter."
}