{
    "symbol": "SIGI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 14:35:14",
    "content": " For the first nine months of the year, non-cat property losses were 1.8 points above our initial expectations, with approximately 60% of the excess losses attributable to the auto physical damage lines. The combined ratio included $34 million of catastrophe losses, or four points, and $16 million of net favorable prior year casualty reserve development, accounting for 1.9 points. For the third quarter, non-cat property losses accounted for 19.6 points on the combined ratio, which was 3.5 points higher than in the year ago period. Standard Commercial Lines net premiums written increased 11% in the quarter, driven by renewal pure price increases averaging 5.8%, excellent retention of 86%, new business growth of 5% and exposure growth of approximately 3.8%. The underlying combined ratio of 87.6% was 3.1 points higher than in the prior year period, driven mainly by higher non-cat property losses. After-tax net investment income, excluding alternatives, which principally reflects our allocation to fixed income securities, was up 37% in the quarter compared to the prior year period and is up 19% year-to-date as these higher reinvestment rates are starting to benefit our results. Despite statutory capital and surplus remaining at year-end levels, on a GAAP basis, book value per share was down 7% in the quarter and is down 20% for the first nine months of the year, driven mainly by after-tax unrealized losses within fixed income. We currently expect a GAAP combined ratio this year, excluding catastrophe losses, of 91.5%, inclusive of net favorable casualty reserve development in the first nine months of the year. And like you've heard from many of our competitors, when you think about the inflationary impacts on loss trends and the inflationary exposure adjustments for commercial property, in particular, the blending of rate and exposure were up about 12% this year."
}