{
    "symbol": "SIGI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 17:33:02",
    "content": " Net premiums written growth remained strong at 11%, driven by overall renewal pure price increases averaging 4.6%, exposure growth of approximately 3.5% on our renewal book for Commercial Lines, excellent retentions across all 3 segments and overall new business growth of 14%. Our 93.1% combined ratio for the quarter included 2.5 points of net catastrophe losses, offset by 2.5 points of net favorable prior year casualty reserve development. The lines most impacted by economic inflation, commercial auto and property, generated renewal pure price increases of 7.4% and 7.6%, respectively, during the quarter. For the first quarter, the cohort of accounts with the lowest expected future profitability, representing about 8% of our portfolio, had renewal pure rate increases 6.6 points higher than our top-performing cohort. Included in the combined ratio were $21 million of net catastrophe losses, or 2.5 points, and $20 million of net favorable prior year casualty reserve development, also 2.5 points. This underlying combined ratio was up 3.1 points from the year ago period and above our 91% guidance for the full year, with the variance to both relating primarily to high non-cat property losses. In addition, first quarter non-cat property losses have historically been about 1.1 points seasonally higher than the full year, and this is built into our quarterly combined ratio expectations. Standard Commercial Lines net premiums written increased 11%, driven by renewal pure price increases averaging 4.8%, excellent retention of 87%, exposure growth of approximately 3.5% and new business growth of 12%. This was 3.7 percentage points higher than the 90.6% for the prior year period, with the increase principally coming from 3.3 points of high non-cat property losses and driven by commercial auto physical damage severities, as I mentioned earlier. The underlying combined ratio of 85% was 3 points higher than the prior year period, driven by 3.9 points of higher non-cat property losses, principally driven by higher frequencies and severities in the personal auto physical damage line. The underlying combined ratio of 89.4% was 4.6 points accrued from 94% in the prior year period, driven mainly by 2.7 points of improved non-cat property losses and to a lesser extent, improved casualty margins and a lower expense ratio. For the quarter, after-tax net investment income of $58.5 million was up 4% from the year ago period. A GAAP combined ratio, excluding catastrophe losses, of 91%, inclusive of net favorable casualty reserve development from the first quarter."
}