{
    "symbol": "SIGI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 17:56:12",
    "content": " Growth in net premiums rating was 12% for the quarter, driven by strong renewal pricing in standard Commercial Lines and excess and surplus lines, solid retention rates and Standard Commercial and personal lines and an increase in exposure. The impact of this higher trend, which continued from the first through the second quarter is fully reflected in our current year combined ratio guidance, that amounts to an approximately 70 basis point increase to our all-lines expected loss ratio. Turning to our consolidated underwriting results, we reported 12% growth in net premiums written for the quarter and year-to-date, driven by strong growth in our commercial lines and E&S segments. On an underlying basis or excluding catastrophes and prior-year casualty reserve development, the second quarter combined ratio was 91.4%, down from 93.1% in the first quarter, but up compared with 89% in the year ago period driven by non-cat property losses. The combined ratio includes a non-cat property loss ratio of 17.5%, which is running about a point above expectations and is partially offset by lower-than-expected expense rate year. This is consistent with our guidance from last quarter, but it is up from 91% at the start of the year with the increase driven by expectations at non-GAAP property losses will run about 70 basis points higher than we expected probably saw over the year. The Commercial Lines combined ratio was a profitable 93.1% and included 3.3 points of net catastrophe losses and 1.8 points of net favorable prior year casualty reserve development, the favorable prior year casualty reserve development was driven by $10 million from Workers' Compensation for accident year 2019 and prior and $2 million from bonds for accident year 2020. The underlying combined ratio of 88.2% was 2.7 points higher than the prior year period, driven by higher personal auto physical damage losses. The underlying combined ratio of 93% was 2.9 points higher than the prior year period, theyâ\u0080\u0099ve been made by 3.9 points of high non-GAAP property losses. Book value per share declined 7.2% during the second quarter and is down 14.2% for the first half of the year, with our earnings more than offset by an increase in net unrealized losses. We currently expect the GAAP combined ratio this year excluding catastrophe losses of 90.5%, inclusive net total casualty reserve development in the first half of the year. We expect approximately $15 million of after-tax net investment income, for alternative investments, which implies losses in the second half of the year, but I would again highlight the difficulty in estimated in this line item and the fact that alternative investment income, could come in materially lower or higher than our current expectations. So the improvement in the back half of the year, I guess, I want to couple that with John's earlier comments with I guess is what we saw in the second quarter is that the severity rise to 10% added about $70 perhaps to your overall loss ratio. So we are expecting continued elevated non-GAAP property losses in the back half of the year, although sustaining a little bit as we are getting strong rate increases and healthy exposure growth from a credit perspective, and we also now expect perhaps a little bit of expense ratio improvement relative to our guidance at 32.5% and that sort of squares you back to the 91.5 for the full year. First, comment I'll refer back to is commercial auto liability is included in that casualty discussion I had in my prepared comments and we had embedded a current year loss trend assumption of 5.5% across all casualty lines that includes auto BI. Maybe, I can start with outstanding commercial lines and walk you through that and see that hits the mark and we can go into personal lines, but I think those are pretty self-explanatory, but in 10 commercial lines for the quarter in commercial auto, it was $637,000 -- commercial property at $19.143 and BOP $2,530,000, total loss at $22.3 million or 3.3 points on the combined for cats and $82 million for outstanding commercial lines -- \n So 15.5 points on the property line."
}