{
    "symbol": "WAL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 17:36:01",
    "content": " Our diversified national commercial bank grew loans 28%, deposits by nearly 13% and posted record net revenue and net income growth of 30% and 17.6%, respectively. Net interest income increased 6% from Q3 to $640 million was primarily driven by NIM expansion, but also benefited from higher average earning asset balances. Non-interest expense included -- increased 9% or $27 million, resulting in an efficiency ratio of approximately 47%, primarily due to higher deposit costs related to earnings credits. Irrespective of the Federal Reserve's rate trajectory, our net interest income will continue to benefit from an average of $2.5 billion of loans maturing or repricing higher each quarter in 2023. Pre-provision net revenue climbed 3% to a record $368 million or 14% increase year-over-year, resulted in return on average tangible common equity, excluding all other comprehensive income, 23% for the quarter or 80 basis points higher than last quarter. Loans held for investment decreased $339 million to $51.2 billion, and deposits declined $1.9 million to $53.6 million at year-end, primarily driven by short-term seasonal mortgage warehouse factors. These reductions, C&I loans would have grown $220 million with total loans held for investment growth of $1.5 billion on a linked quarter basis. As Ken mentioned, these seasonal factors have reversed since year-end, with mortgage warehouse Q1 quarter-to-date average balances already up more than $2 billion from year-end or 15% higher from the same period year-over-year. Additionally, quarter-to-date average balances for total deposits are up more than $2.4 billion from 12/31 and approximately $660 million greater than 4Q's average balance. Increased competition for liquidity in a higher rate environment drove an 11% increase in total interest-bearing deposits, including a $1.9 billion growth in CDs Interest-bearing demand deposits grew $1.2 billion from last quarter, in part from migration from noninterest-bearing DDA. Comparing the ARP performance to the 32 publicly held banks with assets between $25 billion and $150 billion based in the United States, we realized the lowest average net charge-offs and the lowest quarterly annualized maximum charge-offs as a percentage of total loans over the same time period. I was pleased with the management team's ability to adapt to the changing interest rate economic environment to produce record operating results in 2022, a thoughtful balance sheet growth in conjunction with executional focus, position the bank to capitalize on matters income sensitivity while simultaneously growing both sides of the balance sheet with industry-leading performance as the quality remains solid and stable with those signs of elevated stress. Our bank's industry-leading return on average tangible common equity produces significant organic capital of approximately 45 basis points of CET1 net of dividends per quarter, which provides us with significant flexibility to achieve our strategic objectives, grow capital ratios, on balance sheet growth or to take other capital actions. But again, what we're focused on from here is how do we sustaining our deposit growth trajectory and then putting on loans that have plus 300 more -- or more spread between them, and that can drive net interest income kind of regardless of what the Fed does. Well, let's start with -- if you work backwards from the $3 million and add on to that the sale of the corporate finance applications, which we sold, plus the fact that this is a quarter where we didn't grow and we took down our EFR balances, when you kind of reverse engineer it, we would have been closer to what we've posted in previous quarters."
}