{
    "symbol": "HST",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 15:06:02",
    "content": " Our all owned hotel EBITDA of $373 million in the fourth quarter was 5% above 2019, driven by rate strength out of room revenues, and expense efficiencies resulting from operating improvements. Moving back to fourth quarter operations and starting with the hurricane update, we estimate that Hurricane Ian impacted our fourth quarter RevPAR growth by 220 basis points, our adjusted EBITDAre by $15 million and our all owned hotel EBITDA margin by 40 basis points. Transient revenue was up 60 basis points compared to the fourth quarter of 2019 with strong rate increases making up for the volume shortfall resulting from lower business transient demand, light cancellations during the holidays, colder weather in Florida and hurricane displacement at Hyatt Coconut Point and Ritz-Carlton, Naples. In the fourth quarter, our hotels sold 954,000 group rooms, bringing our total group room nights sold for 2022 to $3.8 million, which represents approximately 84% of 2019 actual group room nights. Group rate on the books for 2023 is up nearly 6% to the same time last year, a 140-basis point increase since the third quarter. Starting with business mix, overall transient revenue was up 60 basis points to the fourth quarter of 2019, driven by a 22% rate growth. Peasants' Day and Spring Break both have revenue pace ahead of 2022. Business transient revenue was down 18% to the fourth quarter of 2019, driven by 2% rate growth. Shifting gears to margins and expenses, our fourth quarter all owned hotel EBITDA margin came in at 29.5%, which is 110 basis points better than the fourth quarter of 2019. The margin decline year-over-year is driven by closer to stable, staffing levels at our hotels, higher utility and insurance expenses, lower attrition and cancellation fees, which totaled approximately $100 million in 2022 and occupancy below 2019 levels. At the midpoint of our guidance range, we anticipate comparable RevPAR growth of 5% compared to 2022, a comparable hotel EBITDA margin of 29% and full year adjusted EBITDAre of $1.460 billion. For context, in 2019, region and benefits comprise approximately 50% of our total comparable expenses, utilities and insurance comprised approximately 5%, attrition and cancellation fees were $50 million, and occupancy is still 10 points below 2019 as of the fourth quarter of 2022. And one of the things I would like to highlight is when you look at our expenses, specifically to $100 million to $150 million and you compare that really to 2019, our F&B revenues are down for 2023 to the midpoint relative to '19, 1.5%, but our expenses are actually down 2%."
}