{
    "symbol": "HST",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 16:06:04",
    "content": " Our all owned hotel EBITDA of $510 million in the second quarter was 19% above 2019, driven by an accelerating recovery in our urban and downtown markets and continued strength in Sunbelt markets. Impairing all owned hotel 2019 results for our portfolio to 2017, we have increased the RevPAR of our assets by 11%, EBITDA per key by 25%, EBITDA margins by 190 basis points and avoided considerable business disruption associated with capital projects. Turning to second quarter operations, our all owned hotel revenue was up nearly 4% to second quarter 2019, driven by 15% rate growth. Our resort properties continue to outperform with transient revenue up more than 50% to second quarter 2019, driven by 70% transient rate growth. In New York, second quarter RevPAR was flat to 2019 and business transient rooms sold increased more than 75% compared to the first quarter. 2022 group pace for our New York hotels is up over 5% to 2019 and our New York Marriott Marquis is on track to exceed 2019 group room nights, driven by two significant bookings within the past 60 days. In total, these two groups booked 17,000 room nights and are expected to contribute approximately $5 million in the second half of 2022. Business surged back at our hotels during the second quarter. Group revenue was down just 3% to second quarter 2019, driven by 6% rate growth. In the second quarter, our hotels sold 1.1 million group room nights, a 64% increase over the first quarter and we continue to be encouraged by net booking activity in the quarter for the quarter. This is a meaningful increase to the 3 million group room nights we had on the books for 2022 as of the first quarter and it represents approximately 80% of 2019 actual group room nights, up from 70% last quarter. As we look forward to 2023, we currently have 2.2 million definite group room nights on the books, which is down 16% to the second quarter of 2019. Business transient revenue was down 24% to the second quarter of 2019, but increased 66% over the first quarter, driven by a 48% increase in rooms sold. Corporate group revenue was down just 5% compared to the second quarter of 2019, driven by a 10% improvement in rate. Wrapping up on group with Social, Military, Educational, Religious and Fraternal or SMERF groups revenue was up 25% compared to the second quarter of 2019, driven fairly evenly by rooms sold and rates. Taking our strong top line and expense controls together, our second quarter all owned hotel EBITDA margin came in at 37.1% which is 480 basis points better than the second quarter of 2019 and the highest all owned hotel EBITDA margin in Host's history. Please pose your question. Your line is live. Please pose your question. Your line is live. What's super encouraging on the group side, I think a good stat to really look at is most recently, so despite all the macro noise, if you look at what we picked up in June for Q2, so we picked up 121,000 group room nights in the quarter for the quarter, which is 77% above 2019. Please pose your question. Your line is live. Please pose your question. Your line is live. Your line is live. Your line is live. Please pose your question. Your line is live. Please pose your question. Your line is live. Thank you, ladies and gentlemen. Thank you, ladies and gentlemen."
}