{
    "symbol": "HST",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 16:09:05",
    "content": " Our all owned hotel EBITDA of $341 million in the third quarter was 15% above 2019, driven by continued rate strength, elevated out of room revenues and tight expense controls. The acquisition price represents a 13.6 times EBITDA multiple whereas 6.6% CAP rate on 2022 estimated results, is expected to be one of our top three assets based on full-year 2022 results with an estimate of RevPAR of $855, RevPAR of $1430 and an EBITDA per key of $185,000, further improving the quality of our portfolio. Impairing all owned hotel 2019 results for our current portfolio to 2017, we have increased the RevPAR of our assets by 12%, EBITDA per key by 26%, EBITDA margins by 190 basis points and avoided considerable business disruptio0n associated with capital projects. Starting with topline performance, rate continues to drive the RevPAR upside, especially at our Sunbelt and Hawaii hotels where rate was up more than 25% to the third quarter of 2019. Urban and downtown holiday occupancy growth outpaced Sunbelt and Hawaiian market with especially strong demand growth in Chicago, New York, and Washington D.C. Business transient revenue was down 22% to the third quarter of 2019 but volume improved 300 basis points over last quarter, driven by our hotels in New York, Washington D.C., Boston, and Seattle. In September, the overall business transient rooms sold was slightly ahead of August when comparing to 2019, driven by our urban and downtown hotels and encouragingly business transient rates were up 3.1% to the third quarter of 2019. Wrapping up on group with Social, Military, Educational, Religious, and Fraternal or SMERF groups revenue was up 14% compared to the third quarter of 2019, driven by a 20% increase in rooms sold at our urban and downtown hotels. Taking our strong topline and expense controls together, our fourth quarter all owned hotel EBITDA margin came in at 28.7%, which is 250 basis points better than the third quarter of 2019. Taking into account the impacts of Hurricane Ian, we expect full-year 2022 all owned RevPAR for our portfolio to be between $193 to $195 or down 3.75% to down 2.75% to full-year 2019, which implied that our fourth quarter RevPAR will be slightly above the fourth quarter of 2019. Adjusting for the Four Seasons Jackson Hole acquisition and using the midpoint of our full-year 2022 EBITDAre guidance of $1,480,000,000, we would expect our year-end 2022 net leverage to be at 2.4 times looking unchanged from the third quarter. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live. Your line is live."
}