{
    "symbol": "HCC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 19:32:10",
    "content": " As we mentioned on previous calls, the rail transportation and the McDufffie Terminal performance issues impacted our shipment volumes each quarter during 2022 and caused our demurrage costs to increase by 415% last year. Even with the shipment delays, we performed quite well, delivering fourth quarter sales volume of 1.5 million short tons that was flat compared to the fourth quarter of 2021. Despite the lower sales volume, we delivered strong financial results in the fourth quarter that marked the conclusion of an exceedingly strong financial year for Warrior, which posted record operating cash flow, free cash flow and adjusted EBITDA, which was more than double our 2021 adjusted EBITDA of nearly $1 billion. For the fourth quarter of 2022, the company recorded net income on a GAAP basis of $100 million or $1.93 per diluted share compared to net income of $138 million or $2.68 per diluted share in the same quarter of 2021. Non-GAAP adjusted net income for the fourth quarter, excluding the non-recurring business interruption expenses, idle mine expenses and other non-cash adjustments was $1.90 per diluted share compared to an adjusted net income of $3.17 per diluted share in the same quarter of 2021. Other revenues were slightly lower in the fourth quarter of 2022, primarily due to the prior year, including a mark-to-market gain of $7 million on our gas hedges offset partially by an increase in revenues due to higher natural gas prices. Cash cost of sales were $179 million or 54% of mining revenues in the fourth quarter, compared to $153 million or 39% of mining revenues in the fourth quarter of 2021. Cash cost of sales per short ton, FOB port was approximately $123 in the fourth quarter compared to $106 in the fourth quarter of 2021. Despite the higher variable cost and inflation, cash margins were $104 per short ton in the fourth quarter. SG&A expenses were about $12 million or 3.4% of total revenues in the fourth quarter of 2022 and were higher than fourth quarter of 2021, primarily due to an increase in stock-compensation expense of $2 million and charitable donations of $1 million. Turning to cash flow, during the fourth quarter of 2022, we generated $97 million of free cash flow which resulted from cash flows provided by operating activities of $195 million less cash used for capital expenditures and mine development cost of $98 million. From a capital allocation standpoint, the company continues to be committed to returning excess cash to stockholders to increase stockholder value, while driving long-term growth with the investment in its World-Class Blue Creek reserves and demonstrated that commitment in 2022 by increasing our fixed quarterly dividend by 20% and paying two different special cash dividends, which together totaled $1.30 per share."
}