{
    "symbol": "MEC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 13:08:03",
    "content": "  Operator: Good morning, and thank you for attending today's Mayville Engineering Company 2022 Earnings Conference Call. First, please note that some of the information that you will hear during this call will consist of forward-looking statements within the meaning of Section 21(a) of the Securities Exchange Act of 1934 as amended. Joining me on the call today are Jag Reddy, President and Chief Executive Officer; Todd Butz, Chief Financial Officer, Rand Stille, Chief Operating Officer and Ryan Raber, EVP of Strategy, Sales & Marketing. Jag will begin with his thoughts on the quarter and the end markets we serve, new business and future plans, followed by Todd, who will review the financial results and guidance. The improvements were primarily driven by volume growth, commercial pricing increases and better absorption of manufacturing costs. Additionally, I am excited to announce that we launched MEC Business Excellence or MBX, to drive operational and commercial excellence. Through my site visits and meetings with our customers, I have identified the following observations as key to our future success. Additionally, the secular trends of reshoring and outsourcing have been confirmed by our customers. Our investments in automation will support cost reductions, volume productivity and quality to meet the increased demands driven by macro trends. Today, I am pleased to outline the strategic priorities that will help us achieve our profitable growth aspirations. Regarding profitable growth over the next five years, we need to capture the opportunities with current customers while also diversifying into markets and applications such as electric vehicles and renewables. We also can expand our design, prototyping and aftermarket services to better support our customers' needs. EBITDA margin expansion beyond 15% can be achieved through commercial and operational excellence through strategic and value pricing, productivity improvements, capacity utilization and purchasing and supply chain improvements. In terms of capital allocation, starting in 2023, we will return to normalized CapEx spending levels of $20 million to $25 million per year. We plan to focus our M&A activities -- targets in adjacent markets, specifically lighter weight materials such as aluminum, plastics and composites and design and prototyping services. We currently serve five major end markets, all of which continue to forecast positive near-term demand outlooks. While supply chain constraints have continued to impact some CT customers, we expect to see sequential increases over the next couple of quarters due to sizable backlogs at OEMs. Powersports continue to be an important market for us, while showing some signs of softening, retail demand remains generally positive. As mentioned on our previous calls, we have had many project wins with existing and new customers, which will provide a buffer to potential market softness. However, non-residential, infrastructure and oil and gas markets are seeing some improvement as we look towards 2023. The need to restock fleets, given fleet age and low dealer inventories continues to drive near-term volumes and are expected to offset weakness in the residential construction market. We continue to see strengthening demand in the ag market, low global stocks, strong crop prices and low new and used machine inventory will maintain volume growth in the near-term. Our customers have solid backlogs for U.S. government contracts, and we continue to see good volumes based on new vehicle introductions. While supply chain disruptions have continued to persist throughout our customer base, we anticipate these supply chain constraints to ease as we move into 2023. Importantly, our new business pipeline remains strong. Last quarter, we made significant progress in working with a new potential customer that focuses on thermal management of electric vehicle batteries and battery enclosures. Building on our earlier win in the light-duty truck market, we have continued to engage with a market-leading engine manufacturer to develop additional opportunities on this new product platform. Opportunities for reshoring projects continue to grow, and I'm pleased to report that we closed out a project for a commercial vehicle customer in the last quarter. While this relationship is new, we have been able to quickly support urgent product needs and expect to grow this business in the years ahead. Overall, it is clear that both our business with current customers, plus our pipeline of projects with both existing and new customers remains strong as we look towards 2023. As I said when I joined, my initial focus will be on accelerating our use of innovation, technology and lean manufacturing initiatives to help drive profitable growth. The launch of MEC Business Excellence, or MBX program is an important first step in that process as summarized on Slide eight. The focus of MBX is to drive operational and commercial excellence across the company, and it will be a vital product of achieving our profitable growth potential in the years ahead. While MEC has consistently used lean tools within our operations for many years, the dedicated MBX program will significantly accelerate our efforts and drive exponential improvements across all our processes. Led by a newly appointed team, the program will focus on strategy deployment, operational excellence, commercial excellence and talent management. This will include value stream mapping, lean daily management and productivity Kaizen events led by MBX lean engineers in all facets of our business. As demonstrated on Slide nine, each quarter, the MBX team will lead a special event known as the President's Kaizen. While targeting a specific role centered process, the team applied several lean tools to significantly improve throughput, reduce labor hours, reduce inventory, enhance safety and drive meaningful cost reductions. Despite our best efforts, the company was unable to reach an amicable resolution with its former fitness customer and therefore, filed a breach of contract lawsuit in the Supreme Court of the State of New York in August. The team has done a remarkable job of launching on-time and in line with our plans, providing us with the capacity and the state-of-the-art operations in a market with solid labor availability. In conclusion, I want to thank all of our team members for embracing the change and helping to channel ideas into our updated strategy for profitable growth. It's been an important quarter for the company in which we began a critical journey to build on our proud history, implement new initiatives and expand our horizons to ensure we obtain our full potential in the years ahead. We recorded third quarter net sales of $136.3 million, which is a 25% increase year-over-year. The increase was primarily driven by improved volumes due to the overall strengthening of the business, commercial pricing increases and contractual raw material price pass-through to our customer. The increase was driven by improving demand, improved absorption of manufacturing costs and commercial pricing increases. These improvements were partially offset by a downward shift in scrap income, Hazel Park launch cost, continued customer supply chain issues during the quarter. Manufacturing margin percentages were 11.3%, which is a 130 basis point improvement over the 10% recorded in the prior year period, despite some of the challenges previously mentioned. SG&A expenses were $6.5 million as compared to $5.3 million for the same prior year period due to higher consulting and professional fees, CEO transition costs, as well as continued inflationary pressures on wages and benefits. For the third quarter, income tax expense of $1.5 million on pretax income of approximately $8.1 million. Our federal net operating loss carryforward was approximately $18.5 million as of quarter end, which was driven by pretax losses incurred in prior years. Adjusted EBIT margin percent increased by 260 basis points to 11.8%, representing an incremental margin of 22.5%, which is consistent with our historical average. If we remove the impact of customer supply chain issues, raw material price pass-through, our incremental margin would have been 25.6%, which is above our historical average. Basic earnings per share were $0.32, a $0.31 increase over last year, as the improvements I've already mentioned dropped through to the bottom line, as well as the one-time positive impact of updated guidance that totaled $0.11 per share, which includes stock forfeitures from our former CEO's third quarter retirement. Year-to-date, capital expenditures were in line with our expectations at approximately $38.8 million as compared to $26.6 million for the same prior year period. As shown on Slide 11, our total outstanding debt was $74.1 million at September 30, 2022, as compared to $56.9 million at the same point last year. The increase in debt relates to capital spending, but our balance sheet remains strong with a leverage ratio of 1.3 times at the end of the quarter. We continue to see a solid pipeline of M&A opportunities and are focused on new markets, new materials such as aluminum, plastics and other lightweight materials and new customers to continue to diversify our business. As it stands today, our revenues are expected to be at the high end of our original range due to raw material price pass-through. However, due to falling scrap income prices, increased legal costs and continued near-term inefficiencies related to customer supply chain issues, we expect EBITDA results to be between the midpoint and the low end of the range. The primary focus is on investment in technology and automation, the addition of equipment building to new programs with existing customers and costs associated with production at our Hazel Park facility. In summary, our third quarter results continue to reflect steadily improving volume trends, which, in conjunction with commercial pricing increases, has helped deliver improved results. While the supply chain disruptions affecting our customers, inflationary pressures persist, near-term end market demand remains generally solid. As we manage the demand trends, we are seeing across our end markets. However, we are monitoring market changes, staying in constant communication with our customers and will be ready to adapt as needed. We're focused on profitable growth into new platforms, margin expansion with lean initiatives and innovation to drive competitiveness. So nice quarter end results and thanks for some of the strategic outlook or update, I should say, around some of the long-term priorities and what you're doing with MBX. Again, many of these tools we've been using for quite some time, but it's the acceleration that Jag talked about. So we have a team of lead engineers led by our Vice President, focusing making sure we're driving as across all aspects of the company. But as we think about the outlook into '23 here, if I just look at sort of the end market industry outlook, obviously, some mix trends there and obviously concerns about the macro. Before I actually do that, let me say that we're not providing any guidance for 2023 yet. So the base business, right, every -- almost all of our customers today are indicating the volume growth next year, right. And if we assume even a small pullback on the demand in the base business, we feel that we have enough new business that's coming into 2023, that could offset that potential softness in the base business. So unless markets turn significantly and a deeper downturn, then that's a different discussion that we can have at that point. But sitting here almost in Q4, we feel pretty good about next year and we're thinking about it in terms of base business versus our new business. What I would add is certainly that we're not providing guidance at this point, right. But to Jag's point, as it stands today, volumes in markets generally look solid for next year. And with that, with the MBX launching, the pricing carryover, and activities that happened in 2022, hopefully, supply chain kind of balancing and getting corrected at our customers will lead to a higher net income. When Jag spoke earlier, $20 million to $25 million in normalized CapEx, inventory levels because the supply chain issues are a little high right now, so we would expect turns to get better as we move into 2023. Sticking with this last comment maybe as we're looking at margins and Todd, I appreciate that you expect improvement here. And as I'm thinking about 2023, if we're in an environment in which volumes are at least stable and it sounds like some of the cost pressures are at least starting to moderate, if not outright reverse in some cases. So even with, let's call it similar or slightly less volume this year because of material price pass-throughs compared to 2019, we're delivering record EBITDA. Now when we think about Q4 and why we kind of narrowed our guidance, we do have rising interest rates, we have continued expected supply chain issues with our customers and there's potential for some legal costs in the Q4. But as we get into '23 and these things alleviate, we all feel very confident that we can deliver, again, improved results, but not only that, but hit our 15% adjusted EBITDA goal. But we're being realistic and that we're internally saying that, hey, the market softens, that's in our base business. But having said that, also when I add that even in powersports, we have new business that we're going to be producing next year, new customers and new programs. So even in an industry that might be softening, we feel like we have new business to offset the potential softness. I think, Jag, generally, right now, we still see a macro trend of the majority of the industries having relatively low inventory compared to retail demand. As we look out into '23, certainly, the rising interest rates have had an impact on residential construction and other things affecting the construction and access equipment, and also see things like strong rental CapEx and good signals from our customers about aged fleets that are in rental fleets and other things that I'd like to think could provide some potential tailwinds, but still too early to call that into '23. Powersports, like Jag said, certainly new business coming online. We generally feel like we'll be playing the powersports more in the high-end premium product, which has some independence from interest rates when you think about the interest rates affecting that discretionary income, those buyers might have. So as we look to next year's interest rates, we believe, will have an impact. But going back to the initial comment, customers are generally sending strong demand signals that year-over-year, we believe, would be flat to up. We'll continue to monitor that as we go into '23, and we remain very in our ability to convert new business and show some incremental growth as we go into next year. But Jag, it seems to me like you're thinking more broadly than that, which obviously has strategic location for the company. We help our customers produce the best products at a very competitive price, and we have the footprint and the supply chain capability to support short lead times to these customers. And that's an area where customers, as I talk to them, many have indicated that they're struggling with engineering talent. So all of these areas will help our customers to speed up their design to manufacturing, speed to market. So even services, prototyping services are important element where we can really help our customers. Similarly, as we think about energy transition and customers going to EV platforms, the lightweighting in general, even for ICE engines, lightweighting is really important. So as I looked at all of that, we said, look, we can get into more value-added services such as subassemblies and assemblies, and perhaps instead of buying some of those plastic components from a third-party supplier and something in-house, we can also get into that. And that's the reason why we feel like we have the right to play in those adjacent markets, and that's where we're refocusing our efforts into M&A."
}