{
    "symbol": "SPR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 17:15:02",
    "content": " Free cash flow in both years were impacted by several large one-time cash items, including a $300 million tax refund received in 2021, a payment of $154 million to the Belfast pension plan in 2021, as well as the repayment in 2022 of $123 million Boeing 737 advance that we received in 2019. In addition, 2022 free cash flow was negatively impacted by production schedule changes; the Ukraine, Russian conflict; headwinds from forward losses; labor constraints; supply chain part shortages, and inflationary pressures. These balances reflect items I previously listed as drivers to free cash flow in addition to the $319 million payment to settle the repayable investment agreement in the first half of 2022 and the refinancing activity we completed during the fourth quarter of 2022, including refinancing and extending maturities on $800 million of existing debt and upsizing by $100 million. In 2022, Commercial revenue was $4.1 billion, an increase of 30% compared to 2021, primarily due to higher production volumes on the 737, A220, and A320 programs, partially offset by lower production on the 747 and 787 programs. 2022 was a more challenging year than we expected, production schedule volatility, a disrupted supply chain, labor constraints, and ongoing inflation resulted in increased costs, forward loss charges, and instability in our factories. But with the doubling of production, when we think about the cash consumption in 2022 on 787, how much cash we consumed at delivering 20 units versus how much cash we're going to consume at 45 units, I would say there's a little bit of pressure on cash flow in 2023 compared to 2022, but that's how things shape up. Well, you're right, the schedules have been more volatile over the past couple of years, but we've worked very closely with our customer Boeing in this case, to establish what the production rates are going to be for2023. What we do know is we have contractual commitments to deliver to our customer, and that's what our production rates are--\n And just to clarify, the production for the year is going to be 420 units, which includes 20 that carried over from last year."
}