{
    "symbol": "IIIN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-10-20 12:31:02",
    "content": " Thank you for your interest in Insteel, and welcome to our fourth quarter 2022 conference call, which will be conducted by Mark Carano, our Senior Vice President, CFO, and Treasurer, and me. Before we begin, let me remind you that some of the comments made in our presentation are considered to be forward-looking statements that are subject to various risks and uncertainties which could cause actual results to differ materially from those projected. We're pleased with Insteel's record financial performance in fiscal 2022, generating net earnings of $125 million, and return on capital of 36%. During much of the year, we experienced substantially rising costs both in raw materials and plant operating costs, including labor, energy, and consumables. While the rising price environment produced a tailwind for earnings as average selling prices rose, it also created considerable operational and customer service challenges for our people, including shortages of nearly every input into our process which created uncertainty surrounding production schedules. While lead times extended, by and large, we understood the impact of the environment on our ability to deliver to customers, and we fulfilled the customer commitments we made, which speak highly of the professionalism of our people, our focus on customer needs, and the effectiveness of our information systems. As we enter fiscal 2023, we believe the outlook for our markets is positive and has been materially enhanced by the passage of the Infrastructure Investment and Jobs Act. As we highlighted in the release, the fourth quarter of 2022 was a historically strong period of financial performance. We reported revenue of $208 million or an increase of 21.4%, from $171.3 million in the prior year, and net earnings of $24.3 million or $1.24 per diluted share, as compared to $25.2 million or $1.28 per diluted share in the prior year. Sequentially, from the third quarter of 2022, average selling prices decreased 2.6%. Excluding the impact of that product line on average selling prices would have resulted in a 1% increase sequentially, reflecting the resilience of our nonresidential construction markets. Despite the robust demand environment, shipments for the quarter decreased 3.7% from last year. Sequentially from the third quarter of 2022, shipments declined 6%. The lack of shipment momentum resulted primarily from three issues, ongoing weakness in the residential construction markets relative to historically robust conditions last year weighed on demand, much like we highlighted in the third quarter of 2022. And labor availability across our plant footprint, which we highlighted in the third quarter of '22, remains an issue. While we experienced modest signs of improved labor recruiting and retention during the fourth quarter, our plant's ability to increase production to a   level consistent with customer demand continue to be a challenge. Gross profit for the quarter was $39.8 million or effectively unchanged from the same period last year, at $39.9 million. This decrease was due to the decline in shipment volumes for the quarter in addition to the impact of higher overall plant operating costs, which offset the benefit of widening spreads between average selling prices and raw material costs. Specifically, inflation in labor rates and energy have negatively impacted our overall plant operating costs. On a sequential basis, gross profit decreased $18.3 million from a record level in the third quarter of '22 due primarily to the same drivers previously stated, in addition to a modest reduction in spreads. SG&A expense for the quarter increased $1 million to $8.3 million, but as a percentage of sales it decreased marginally to 4%. The dollar increase was primarily the result of the relative quarterly change in the cash surrender value of life insurance policies, which from an accounting perspective is reflected as an increase in SG&A expense. Our effective tax rate for the quarter was largely unchanged, at 23%, which is up minimally from 22.7% last year. Looking ahead to the balance -- looking ahead to next year, we expect our effective rate will remain steady at around 23% subject to the level of pretax earnings, book tax differences, and other assumptions and estimates that compose our tax provision. Moving to the cash flow statement and balance sheet, cash flow from operations for the quarter used $9.4 million, increased working capital due to a $29.2 million reduction in accounts payable and accrued expenses, and a $5.2 million increase in inventories offset the impact of strong earnings. Based on our sales forecast for Q1, our quarter-end inventories represent 4.3 months of shipments compared with 3.4 months at the end of the third quarter. And finally, our inventories at the end of the fourth quarter of '22 were valued at an average unit cost marginally lower than the beginning of the quarter. While investing in the business to enhance its growth and reduce cost remains our top priority, we continue to return capital to shareholders throughout the course of the fiscal year. Also during the quarter, we repurchased $1.2 million of common equity equal to approximately 41,000 shares. From a liquidity perspective, we ended the quarter with $48.3 million of cash on hand and no borrowings outstanding on a revolving credit facility. Shipments and average selling prices in the beginning weeks of the first quarter are trending above forecasted levels, which is an encouraging sign and what is our historically lower shipment volume quarter of any fiscal year. And overall, construction employment as measured by the Bureau of Labor Statistics was 3.4% in September 22 and is approaching the lowest levels recorded over the last 10 years. And finally, the market is yet to layer in any meaningful funding from The Infrastructure Investment Jobs Act, which should begin to materialize over the next 12 months. While housing weakness is likely to persist through this interest rate cycle, we fortunate that our exposure to this market is relatively low which we approximate to be 15% of the revenues. The remainder of our markets, private, non-residential, and publicly-funded infrastructure applications remains strong with customers reporting substantial backlog and a healthy pace of new quotations. Over the last few quarters, we identified inadequate supplies of our primary raw material hot rolled steel wire rod as a constraint to production and shipment. By the end of the third quarter, receipts of offshore raw material had filled most of our supply gaps. Turning to CapEx, 2022 CapEx came in substantially lower than expectations based on actual equipment delivery schedules and cash outflows relative to our initial plans. In view of these timing considerations, we expect 2023 outlays to be elevated as delayed deliveries and related cash outflows catch up to expectations. As we mentioned in an earlier call, new production lines will be installed at the Missouri, Kentucky, and Arizona plants to better address market needs. Your line is now open, please go ahead. First, it's well publicized that the housing market has weakened substantially, but beyond that the market has changed from one where there was a critical short supply of the product to one where it is no longer in short supply. So, there's -- consumption is off some from lower residential construction demand, but also probably more important is inventory rebalancing is going on in that market, and in others. You also talked about, guys, on your prepared remarks the first few weeks of the first quarter you've seen shipments and ASPs trending above forecasted levels. Well, as we've acknowledged on multiple occasions, Julio, our vision and our ability to see beyond a few weeks is really minimal due to the low lead times that are expected by our customer base. So, I would say it's week-to-week, but on a year-over-year basis, at this point, the trends are positive and order entry is brisk. And just turning to the balance sheet, I saw you guys did some repurchases, $1.2 million in the quarter. But if we were to change our outlook and see that we expected a significant downturn in the economy, then we may have different consideration about returning cash to shareholders. Your line is now open, please go ahead. I'm going to just jump on to   said, H, and that was your policies at the Board level regarding your focus on free cash flow and what to do with it versus earnings that you may have compiled during this past year, even though, obviously, you run through a cash management cycle with your seasonality where, yes, you have 4.1 months of inventory, you're going to get that down to 3, so we should see an influx of cash coming here. Given your outlook on the infrastructure in those, are you more prone to view a return of capital to shareholders with that expectation and willing to have a little more foresight on returning some of that inventory into cash or at least not having those working capital needs going forward now that will lap and anniversary of those. Well, as is consistent with our past statements, Tyson, that the very first priority for any use of cash would be to grow the company. And then, I think you're correct, there will be a working capital release over the coming months, and is likely to be pretty substantial. So, we'll just evaluate -- will revaluate the -- whether to return cash and how to return cash based on the circumstances that exist at the time, which would imply we look at our share price, we look at our cash expectations, we look at the state of the general economy and what's expected there, and then come to a conclusion about the best route for the company. And because I think it sends a mixed message if you have such great results, your outlook, and then because of a timing issue on cash flow that, all of a sudden, you pull back a little bit on what you have normally historically done in your special dividend because of something that is more of a point in time as opposed to an overall view of what your business expectations are, so, just my little two cents on that, not that you care. The ABI data showed expansion again, in September, industry with seven months of backlog, obviously housing is the weakness there, but institutional -- other things or still remain strong. In the housing segment, are we returning to an order pattern even if they're at a lower level, because they right-sized their inventories in the last quarter, which didn't slow it down, it almost stopped it. Yes, I mean I think -- first of all, let me say that just as a caveat, our insight into this is a little blurry in that we don't have any objective data that we can really rely on. So, we're using estimates, and we're using market knowledge, and we're using customer feedback to make our conclusions here. But we have seen a tick up in order entry in these markets, which would indicate that maybe the inventory corrections are close to having run their course. And that would be the background for my statement, that inventory imbalances may have been more responsible for the weakness than the actual rate of consumption of the product on job sites. And we knew, coming in the fourth quarter, that you had some lower fixed inventory. And as I recall, the third quarter call, we indicated we did enter that quarter, and I think it was true as we finished it with lower levels of finished goods inventory than we would typically have at that time of year. So, it's probably fair to say we're still a bit in catch-up mode with that as we work through the fourth quarter, right. Demand has been strong enough that as we made product we shipped it to the customer in that period of time, but there was an excess finished good inventory available. And I think, Tyson, aside from just that the housing-related markets, there's been a general loosening up of supply of our products to customer base. So, I think that customers throughout our markets have had the opportunity to evaluate their inventory levels and adjust to an environment where availability is more reasonable than it had been in the prior three or four quarters. So, I think there's been some inventory management and liquidation across the whole business, but not to an alarming degree. And if I understood your question right, you're wondering whether we were trending up, or down, or flat through the quarter. I would tell you that in our view the only weakness that we're seeing is in the housing-related segment of the business, with also the caveat that there could be some inventory rebalancing going on in other markets. But the rate of order entry has been positive, customer outlooks are positive, backlogs are positive in non-housing-related sectors of the business, which would lead us to conclude that 2023 should be a good year absent any kind of curveballs that come along. The suggestion in your comments at the start of the call was that, outside of the housing product line, that you've actually been able to maintain spread over the raw material cost part of the business, it's the structural cost items, labor, energy, those things that seem to be what's hampering. What remedies are there available or is that just something that you have to figure out how to overcome and become more automated, and maybe that's why we have the big CapEx coming forward. For instance, energy, I guess everyone has his own expectation for what's going to happen to energy costs. It's hard to say in the case of energy because there's so many outside influences, including the Texas freeze of February 2021, the Ukraine-Russia conflict, on, and on, and on, okay. So, I don't really know whether that's a permanent or whether it's a temporary impact on our cost. And in terms of other commodities that we purchase to operate our factories, we've seen dramatic increases in some of those costs. But I believe that most of those will moderate over time, maybe not back to the lows of pre-pandemic, but we've seen price escalations of 3 and 4 times in certain of the supplies that we procure and operate our plants. And last one, so not monopolizing here, just happened to see a story on the national news regarding obviously the hurricane in Florida and how the utility companies are in essence as a de facto replacement going to be utilizing concrete poles."
}