{
    "symbol": "MATX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 21:07:12",
    "content": " For the fourth quarter within Ocean Transportation, our China services achieved lower year-over-year volume and freight rage, which contributed to the decline in our Ocean consolidated operating income. For the full year, container volume decreased 5.8% year-over-year, primarily due to lower retail related demand compared to the elevated pandemic levels in the prior year and the effects of one less week. Matson's volume in the fourth quarter of 2022 was 47.2%, lower year-over-year, primarily due to lower demand for our CLX and ClX+ services, the discontinuation of the CCX service in the third quarter of 2022 and one less week. On our November earnings call, we indicated that we expected the fourth quarter of 2022 and the first quarter of 2023 to be challenging in the Transpacific tradelane, as retailers inventories adjusted to consumer demand levels, as Ocean liners reduced vessel capacity to meet these lower demand levels. Looking ahead, for the first quarter in the first half of the year, we expect our CLX CLX+ services to reflect freight demand levels below normalized condition, with lower year-over-year volumes and a lower rate environment. For the fourth quarter, consolidated operating income decreased $382.9 year-over-year to $92.6 million, with lower contributions from Ocean Transportation and logistics of $380.9 million and $2 million respectively. The decrease in Ocean transportation operating income in the fourth quarter was primarily due to lower volume and average freight rates in China and a lower contribution from SSAT, partially offset by lower operating costs and expenses, primarily related to the discontinuation of the CCX service. The increase in Ocean Transportation operating income for the year was primarily due to higher freight rates in China and a higher contribution from SSAT, partially offset by lower volume in China, higher operating costs and expenses primarily due to the CLX+ service and higher terminal handling costs. For the LTM period, we generated cash flow from operations of $1,271.9 million from which we used $111.5 million to retire debt, $146.9 million on maintenance and other CapEx, $62.4 million on new vessel CapEx including capitalized interest and orders items, $518.2 million in cash deposits and interest income in the CCF net withdrawals from milestone payments. And so we're expecting a weaker first half of the year, owing to those questions and also ongoing impacts of higher interest rates and the Feds desire to curb inflation, some persistent inflation, some of the macro trends that we're all of us are following closely, will weigh on demand, we think particularly the first half. But having said that, we're going to go back to doing what we've done in a normal environment is looking for ways in which to operate more efficiently, whether it's the speed of our vessels, the size of our equipment fleets, the use of overtime, and gait times, and a lot of just blocking and tackling that will occur and does occur in a normal environment that will allow us to reflect that we're in a different environment and trying to keep our costs in line with this less congestion and a lower demand environment overall. Yes, it's a good question. Yes, it's a good question."
}