{
    "symbol": "CALA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 20:42:05",
    "content": " The most notable developments, of course were the initiations and enrollment of the first patients in our Phase II clinical trials of mivavotinib in relapsed/refractory non-GCB diffuse large B-cell lymphoma or DLBCL in June; and sapanisertib in relapsed/refractory NRF2-mutated squamous, non-small cell lung cancer in the first week of July. And just last week at World Lung, Dr. Jonathan Riess of UC Davis Comprehensive Cancer Center presented during a mini oral session, the findings from an investigator-initiated multicenter Phase I/II dose escalation study of sapanisertib in combination with telaglenastat in advanced non-small cell lung cancer patients. In July, we announced the first patient enrolled to our Phase 2 clinical trial of sapanisertib in relapsed/refractory NRF2 or NFE2L2-mutated squamous non-small cell lung cancer. As a reminder, the sapanisertib study is an open-label monotherapy study in patients with NRF2 mutated squamous non-small cell lung cancer, whose disease has progressed on or after platinum doublet chemotherapy and immunotherapy. The study is evaluating two doses of sapanisertib, two milligrams twice daily and three milligrams once daily in patients with squamous non-small cell lung harboring, either wild type or mutated NRF2 as detected by next-generation sequencing. As Susan mentioned earlier this month, dose escalation data from an investigator-led multicenter Phase Â½ trial combining sapanisertib and telaglenastat in biomarker-defined cohorts, with patients with advanced non-small cell lung cancer, represented at the 2022 World Conference on Lung Cancer in Vienna. In the clinical trial data on the first 13 patients in dose escalation, shows that sapanisertib-telaglenastat combination was well tolerated and also showed encouraging early evidence of clinical benefit, including a partial response in one patient with NRF2 mutant squamous non-small cell lung cancer, and stable disease with tumor shrinkage in a patient with KEAP1 and KRAS-mutated adeno squamous lung cancer. Upon determination of the final recommended expansion dose, the study investigators plan to enroll patients into one of four expansion cohorts, evaluating sapanisertib plus telaglenastat in squamous non-small cell lung with and without NRF2 or KEAP1 mutations, and lung adenocarcinoma with KRAS and KEAP1 or NRF2 mutation. As Susan also noted in July, we presented a trial and progress poster at the Pan Pacific Lymphoma Conference, detailing the rationale and design of this Phase 2 study, based on a combined analysis of two prior studies of mivavotinib monotherapy in relapsed or refractory DLBCL."
}