{
    "symbol": "CALA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 22:04:09",
    "content": " We believe that by focusing on well-characterized genetic vulnerabilities with molecules that have already shown single agent activity, we will be able to generate Phase 2 data with targeted efficient study designs and device potential paths for rapid approval in genetically defined patient populations. In February of this year, we also received good news from our partner Antengene Investment, who announced the approval of a first in human study of ATG-037 formerly CB-708 in patients with locally advanced for metastatic solid tumors, ATG-037 was discovered by Calithera and in May of 2021, we entered into a license agreement with Antengene where we granted them an exclusive worldwide license to develop and commercialize ATG-037, which is a CD73 inhibitor. While CB-280 showed encouraging safety and biomarker data in the completed Phase 1 study in CF patients, we came to this conclusion after reviewing our data and in addition, evaluating the impact of recent significant changes in the CF therapeutic and regulatory landscape. Turning to our clinical pipeline; we're currently activating sites for the Phase 2 trials of mivavotinib in patients with relapse refractory, non-GCB, also commonly referred to as ABC DLBCL with and without MYD88 or CD79 mutations as well as pan AER in patients with relapsed/refractory NRF2 also known as NFE2L2 mutated squamous non-small cell lung cancer. The Phase 2A data intended to substantiate the single agent activity that was already seen with the sapanisertib in patients with relapse refractory NRF2 mutated squamous lung cancer, and also evaluate its activity in NRF2 wild-type squamous lung cancer. Now turning to mivavotinib, we're initiating a two-part Phase 2 trial in patients with relapse or refractory non-GCB or ABC DLBCL as defined by the standard Hans algorithm with enrichment for MyD88 and CD79b mutations using ctDNA-based liquid NGS. Data from this study will inform Phase 2B, which would potentially enrol expansion cohorts comprised of patients with relapse refractory non-GCB, DLBCL MyD88 and CD79b mutant DLBCL or both with a primary endpoint of overall response rate."
}