{
    "symbol": "ACR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-06 02:16:03",
    "content": "  Operator: Good afternoon, and welcome to ACRES Commercial Realty Corp. Second Quarter 2022 Earnings Conference Call. Today, I will provide an overview of our loan originations, real estate investments and the health of the investment portfolio, while Dave Bryant will discuss the financial statements, liquidity condition, book value and operating results for the second quarter and provide an update on 2022 projected results. The ACRES origination team delivered $311.7 million of new loan commitments in the second quarter, comprising eight multifamily loans and one office loan. Loan payoffs during the period were $109.2 million and net unfunded commitments during the quarter were $23.2 million, producing a net increase of $179.3 million. We ended the quarter with $2.1 billion of commercial real estate loans across 89 individual investments, of which only three, comprising 2% of the portfolio, were delinquent. We will now have ACRâ\u0080\u0099s CFO, Dave Bryant, discuss the financial statements and operating results during the second quarter of 2022. GAAP net income allocable to common shares in the second quarter was approximately $700,000 or $0.08 per share compared to GAAP net loss of $2.8 million or $0.30 per share in the first quarter. In the second quarter, we recorded a provision for general loan reserves of approximately $500,000 compared to $1.8 million reversal in the CECL provision in the first quarter. The second quarter increase to general reserves reflects a change in the macroeconomic outlook due to expected increases in inflation, interest rates and unemployment and growth in our loan portfolio, partially offset by continued improvement in property level operations on our collateral. The impact of the CECL estimate and the charge-offs resulted in a total allowance for credit losses on June 30 of $5.2 million, which represents 0.25% or 25 basis points of the $2.1 billion loan portfolio at par. Net interest income was $11.3 million or $1.26 per share in the second quarter as compared to $7.8 million or $0.85 per share in the first quarter. The second quarter results included minimum interest and origination fee accelerations of $1.5 million or $0.17 per share related to early payoffs of three loans during the period. In addition, the second quarter net interest income reflects the net growth of $195 million year-to-date in our loan portfolio of which $179.3 million was attributable to the second quarter. In addition, we had $1.1 million or $0.12 per share of non-recurring deferred debt issuance costs from our liquidated CLOs and $0.5 million or $0.05 per share savings from our 4.5% convertible note repurchase, both occurring in the first quarter. In the second quarter, our net loss from our real estate investments decreased to approximately $385,000 from $1.7 million in the first quarter. Included in the second quarter, property operating loss was $1.6 million of non-cash depreciation and amortization. GAAP book value per share increased to $24.48 on June 30, 2022 from $24.10 on March 31, 2022. The increase to book value per share for the second quarter was primarily driven by $0.37 of per share accretion from common stock repurchases and net income of $0.08 per share offset by $0.23 related to the vesting of director and manager share grants. During the second quarter, we used $2.5 million of our Board approved share repurchase plan of $20 million. Available liquidity at July 22, 2022 was approximately $78 million, including approximately $47 million of unrestricted cash, $71 million of projected financing available on unlevered assets. We intend to redeem the outstanding $48.2 million of 4.5% convertible notes that mature on August 15, 2022 with available cash. Looking forward, we currently project that we will report GAAP income between zero and $0.10 per share for calendar year 2022. This projected result of nominal GAAP income is impacted by estimated non-cash depreciation and amortization related to our investments in commercial real estate properties of $5.4 million or $0.61 per share for the calendar year. With the loan growth of $195 million in the first half 2022, we expect our net income and earnings available for distribution to remain positive and steadily grow for the balance of 2022. Primary one being net income the starting point per EAD was income actually this quarter, about $700,000 versus loss last quarter of about $2 million. And if you recall, Steve, and I mentioned this, I think, in my remarks, we had some onetime adjustments last quarter when we retired those CLOs. And this quarter, you got a positive $500,000. And the real estate depreciation and amortization, that was relatively flat at $1.5 million - $1.6 million, so relatively flat..."
}