{
    "symbol": "ARW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 10:55:10",
    "content": "  Operator: Good day, and welcome to Arrow Electronics Third Quarter 2022 Earnings Conference Call. Good day, and welcome to the Arrow Electronics' Third Quarter 2022 Earnings Conference Call. With us on the call today are Sean Kerins, President and Chief Executive Officer; and Raj Agrawal, Senior Vice President and Chief Financial Officer. During this call, we'll make forward-looking statements, including statements about our business outlook, strategies, future financial results, which are based on our predictions and expectations as of today. Our actual results could differ materially due to a number of risks and uncertainties, including the risk factors in our most recent 10-K and 10-Q filings with the SEC. As a reminder, some of the figures we will discuss on today's call are non-GAAP. You can access our earnings release at investor.arrow.com, along with the CFO commentary, the non-GAAP earnings reconciliation and a replay of this call. Before I discuss our most recent results, I'd like to share some thoughts about my first full quarter as the CEO of Arrow Electronics. You know, I spent much of this time meeting with suppliers and customers who continue to validate the essential role we play in their success. I've also had the chance to engage our leadership team to review our strategic priorities, explore opportunities for accelerated growth and begin the process of refining our road map for the years to come. Today, I am even more motivated to lead this great company on a journey to realize its full potential as well as the noble purpose we fulfill in the process. I'm also very pleased today to be joined by our new CFO, Raj Agrawal. Raj will be a key contributor towards helping us focus our resources and investments for growth, leveraging the totality of Arrow's capabilities to extend our market leadership and advancing stakeholder engagement through our finance and other support teams throughout the world. I'm delighted to report that this was our best third quarter ever, with sales growth of 14% year-over-year on a constant currency basis. The dedication and focused execution by our team helped us deliver strong quarterly sales, gross profit, operating income and earnings per share. While market conditions remain challenging, they also provide ample opportunities for us to showcase our commitment to the success of our customers and suppliers. In our global components business, demand for electronic components and associated design, engineering and supply chain services generally remain healthy. On a constant currency basis, sales grew 15% versus prior year. Bookings have returned to a normalized rate, following the exceptionally high levels we have experienced since late 2020. Yet despite bookings coming off all-time highs, we still carry a significant open backlog. Lead times, while relatively stable since prior quarter, remain extended for the majority of products we sell. While supply is improving modestly, it is still insufficient to support the delinquent backlog, which has built over many quarters. Therefore, customer service and support remain our top priorities, and our teams continue to work tirelessly to support the deliveries needed by our customers. Both the Americas and EMEA regions produced year-over-year growth rates in excess of 20% as both regions experienced robust demand across most end markets and industries, in particular, transportation, industrial and aerospace. The business in both regions remains very healthy, due in part to our ongoing investments in design and engineering capabilities, which have generated growth in demand-creation revenue. In the Americas, we did see some softness in our shortage market services as bookings normalize and supply begins to improve. Sales in our Asia region declined due to weakening demand in several end markets, along with supply chain constraints as fewer parts were allocated to the region. However, overall backlog in the region remains healthy as we benefit from servicing a variety of industries and providing products from a diverse group of suppliers. Again, in this challenging environment, we continue to work with our suppliers to secure parts for the most critical customer needs. In our enterprise computing solutions business, sales for the third quarter were above the midpoint of our guidance as demand for more complex enterprise IT content was healthy in both regions. On a constant currency basis, sales grew 10% versus prior year, fueled by growth in both regions. While supply constraints remain a challenge, we are starting to see some benefit from our historically high backlog. We continue to see strength in cloud, software and enterprise IT infrastructure and are well positioned for the transition to IT-as-a-Service. In EMEA, we experienced strong growth in all of our markets and technologies. We continue to measure this business on an operating profit growth, and we are pleased to report 9% growth in operating income on a year-over-year basis. Now before handing over the call, I do want to reiterate that our backlog remains strong and point out that our design win activities are at record levels. While there are indications that supply-demand imbalances will moderate over the coming quarters, I am confident that our capabilities are unmatched and that we are uniquely positioned to help our customers and suppliers navigate the road ahead. With that, I will now hand the call over to Raj to provide more details on our results and our go-forward expectations. I share his enthusiasm, and I'm extremely grateful for the opportunity to join the company and help it realize its full potential. I am impressed with the strong talent level in the organization, the deep business expertise and significant opportunities for long-term growth throughout the business. Changes in foreign currencies impacted sales growth by approximately $380 million year-over-year, which was slightly more than our expectation of $350 million. Sequentially, the business declined by 2%, primarily due to currency impacts. Operating expenses as a percent of sales were 7.3%, down 50 basis points year-over-year. Interest and other expense totaled $51 million, above our prior expectation of $46 million due to higher rates on floating rate debt and higher borrowings. The effective tax rate for the quarter was 23.5%, in line with prior expectation and the target long-term range of 23% to 25%. Our cash cycle of approximately 63 days increased 3 days from the second quarter and 12 days year-over-year, primarily due to inventory increases, which are largely related to pricing. At the end of the quarter, net debt totaled $3.5 billion, and total liquidity stands at over $2.3 billion, including cash of $334 million. At the end of the third quarter, our remaining repurchase authorization stands at $629 million. For more detail regarding the business segment results, please refer to the CFO commentary, which we published on our website this morning. Compared to the prior quarter, we estimate that the impact will be $100 million to sales and $0.07 to EPS. Just my first question, Sean, I'm just hoping you can provide a little bit more color on the bookings and the backlog within the components business. I think if you look at our backlogs, our backlogs are still at all-time highs. They came down from its most recent high in Q2, but just a little bit. We think that through all the validation work that we do, that a good chunk of the backlog is firm versus forecasted, which gives us some confidence in our outlook, certainly for Q4. To the extent that customers are looking to push out orders, it has more to do with them thinking about their production requirements for the long term. Demand patterns have not dropped precipitously, except for maybe in segments that are closely related to consumer technologies. It looks like based on your guidance, gross margins are going to be roughly flat quarter-on-quarter. So Matt, if you look at the margin compression we saw in Q3, and some of which we'll see in Q4, you're right, it's primarily a function of just the normalization we're starting to see in the market and the softness in the shortage-related services that we provide. We said it was one part mix, both region and technology; it was one part pricing; but it was also one part structural. And what gives me confidence about the future is, while shortage-related services are one part of our structural value add, the reality is we've invested for lots of other capabilities as well. I think as I said in the script, our demand-creation revenue mix improved, both sequentially and year-on-year. And that, I think, still has runway in it for many years to come. For example, we're now finding ourselves with a viable role in the automotive industry in a more direct capacity than we would have ever imagined in the past. So when I look longer term, yes, we'll see some margin compression as it relates to shortage. But there's a lot of other structural investments that we've made to the model, which I think point us to sustainable returns. I was just wondering, you had mentioned that on the inventory increase, a lot of the increase was largely related to pricing. And then secondarily, as your inventory -- you are investing in inventory at kind of higher prices. So if we tackle kind of pricing first, just so you have some broader context, price increases did drive the bulk of our year-over-year revenue growth. We have seen price increases kind of abate in terms of number and frequency, but they've not disappeared altogether. Unless demand were to drop precipitously, I think prices are going to remain fairly stable, especially in the technology sets still with longer lead times. If we go back to inventory and kind of look at it overall, we were actually pleased that it only creeped up maybe 4% quarter-on-quarter. But I'd say, we also feel pretty good about the quality of the inventory on hand. And I'm not really concerned that we won't sell through it, given the size of the backlog that we still see in front of us and again, given the work we do to continue to validate its veracity. There are certain technology sets, things like memory and CPU where we've seen lead times come in somewhat, but there's still a great number of categories that for which lead times remain extended, and so for which we still carry significant backlog. Lead times will continue to come in as supply normalizes, but I think that's going to play out over multiple quarters. And so I think we're going to watch this play out quarter-to-quarter, but I feel pretty good about where we sit today with our Q4 outlook. It looks like from the prepared remarks, you saw year-over-year revenue decline in Asia, which seems to be a somewhat weaker performance than one of your main competitors. So what we saw in Asia in the third quarter, Ruplu, was largely a function of the macro headwinds and COVID-related lockdowns that we experienced in China. We did also see a rotation of some level of supply from the East to the West, which bent a portion of our delinquent backlog, and that market went unserved. But I think the important point to kind of move to maybe at a higher level, Ruplu, is to think about our strategy. We've been very intentional with our strategy in Asia and especially China to focus on the industrial mass market, where we continue to see really healthy returns for our investments, and then to a much lesser degree, the higher volume, lower return segments like mobility and compute. So as I look at that market, I think at some point, the economic headwinds will diminish, and the economy will again improve. Given our focus on the mass market, given the breadth of our line card, given the substantial size of our customer base, I really like our position in the Asia market for the long term. In the ECS segment, in the Americas, you talked about muted growth due to supply chain constraints. So if you go back a little bit, Ruplu, our business in North America has always been a little bit more weighted to infrastructure as compared to our business in Europe, which is a little bit more weighted to software and cloud. Some of the progress we did make in the quarter was a function of backlog relief, but the backlog levels are still high. It tends to follow improvements in the semiconductor supply chain by a good couple of quarters, but we will get benefit from that backlog over time. As we look forward, I think, again, we're continuing to make progress with software, cloud and other aspects of our sort of IT-as-a-Service strategy. One is on the free cash flow expectation, the working capital. I mean, as you choose between buybacks or further delevering or M&A, I mean, just your thoughts on how you prioritize those different choices. On the -- let me take the second one first, the capital priorities. As you've seen in our -- over the last couple of years, we've invested a lot in our working capital, and that continues to be our #1 priority to drive organic growth and expansion. And then although we've not been too active on the M&A front the last couple of years, we continue to evaluate M&A opportunities, and that could be a use of cash. And then lastly, we use our excess cash flow over time. And I say over time because this business does go in cycles to buy back our stock, to the extent that we see it being attractive. And we see our stock at this stage being quite attractive as an investment, and so that's why we've been buying back our stock. When we think about free cash flow and working capital, we continue to have significant opportunity for more leverage as we need it. As you've seen, the inventory balances have gone up over the last year or so. And we have -- as Sean said, we have a strong backlog and strong demand for the inventory balances that we have. And we have plenty of capital capacity in the business today to certainly invest more in the inventory and also to buy back more stock, and that's really our strategy as we go forward. You'd mentioned some order pushouts, you said geographically in China. We did see a little bit of that bleed into, say, light industrial and parts of transportation in the quarter. But again, our teams still have a significant backlog. And even as they reschedule certain parts of it, we still end up with near-term demand that is a challenge to satisfy. But I would say the pushouts have not been broad-based, and they're far less significant in the West. I'm glad you said that, Jim, because I kind of like the returns that we posted with the working capital in Q3 as well, and not to make light of it. Remember, in the aggregate, we still have less supply than we have demand to go satisfy. So -- and as Raj points out, and as I said earlier, it's pretty current inventory. And as you've seen through many cycles, I'm sure we've got great confidence in our ability to sell through it, at which point, we start to generate lots of cash. Our interest rate expense -- our interest expense has been going up, as you've seen in the third quarter. And then we also guided to even more interest expense in the fourth quarter, and that's largely related to the short-term rates going up over the last -- over this year actually, because the Fed has raised from almost nothing to high 3s now in terms of the Fed funds rate. It's still accretive for us to continue to do all the things that we've been doing, including buying back stocks. And as this business goes through its various cycles, we'll get cash influx at some point in time, which will help us pay down some of the short-term debt."
}