{
    "symbol": "PAVM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 22:07:04",
    "content": " An additional area that we've learned at our initial engagements now with potential clients is the new enhancing oncology model, which is a CMS program that I won't go into a lot of detail on, but basically uses incentives with regard to certain aspects of quality of care that would be enhanced with this kind of remote monitoring to provide financial incentives for practices that can actually be significant -- that can add significantly to the practice revenues. We're targeting the full range of oncology care, oncology practices, large cancer centers, integrated health networks, a bit of an early emphasis on rural practices, looking forward to -- for obvious reasons that we believe that remote patient monitoring will be beneficial. Our initial interactions with the -- with potential clients has been that there's a very, very strong focus right now on tools that can enable remote patient monitoring and everything that we've -- all the feedback we've received so far has been quite positive and we look forward to getting our first contracted customer by the end of this year and officially launching this product. And this is something we described in a bit more detail, believe it on the last quarterly call that as part of our efforts to be cautious with regard to cash preservation, we set a target for both of those that we thought would give us -- would have given us critical mass with regard to the sales team, and then with sufficient support with Lucid Test Centers to support the sales team, where we could continue at a fixed level to drive growth through increased effectiveness of the sales force as they get more time in the field, and so forth. It's really just a -- where we're pausing at a level that we think we can, that we feel confident that we will allow us to continue to drive testifying growth, but while keeping our costs in check, and that pivoting from that will be a function of what we see with regard to both the trajectory of other network payments and the percentage of the Lucid tests that are paid out of network. And as we engage with the practice, we -- when we engage with them, we have demos now that show how the software platform can feed -- can be fed with patients symptom reporting, as well as data from these Bluetooth connected devices and provide them with data to not just enhance their care, but also to provide them with the opportunity to record activity that can be subjected to -- that can be reimbursed as remote patient monitoring or RPM. So that requires a really good platform that's engaged with the patient, that encourages them to do the -- to measure their various  just the forward thinking, once we have an implantable device, that'll obviously be fixed, because that's not going to depend on patient engagement and patient compliance. Can I just add one real quick -- one quick follow-up to Anthony's last question, which is that, as you might imagine, the surgeons in our KOL list, who we do training with, but you could ever work with and they do a limited number of cases, we've obviously also shown them the CarpX ultrasound device and the prototypes for that and where we're heading with that."
}