{
    "symbol": "PAVM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-15 12:51:03",
    "content": " We launched the Veris Cancer Care Platform, Veris CCP, and executed our first commercial contract with a practice in New Jersey that the platform went live last month with patients now transmitting their physiologic data using our Veris Box devices to the cloud-based clinician portal, and patients now reporting their symptoms and quality-of-life parameters through the smartphone app, which is now available on the Apple App Store and Google Play. The oncology practice and the care team are now reviewing the physiologic clinical data that the â\u0080\u0093 that is coming from the patient on the portal and the key is they're doing so in a way that allows them to bill for remote patient monitoring services, which is the key aspect of the business model. As I mentioned, the business model is software-as-a-service, that's recurring revenue, we charge a subscription fee for the practice per head, per patient and it leverages the existing established codes that does not require us to seek any further reimbursement from third party payers or from Medicare. Again, these codes are â\u0080\u0093 CPT codes on the left are well established, and you could see how it's provided, and it really ends up if we are fully utilizing the system and providing the full data of about just under $200 per month of billings and about a $100 of that is marked into the practice. We're targeting a large market opportunity with a focus on â\u0080\u0093 initially on independent oncology practices, although we're engaged with larger institutions, and cancer centers, and innovative risk-bearing health systems and value-based model participants â\u0080\u0093 practices that are already familiar with the Medicare EOM and prior versions of the value-based models that Medicare utilizes. That's also one of the things that's unique about our approach to this that is compared to software only solutions, is that when we have the implantable device of in addition to clinical benefits of being able to get that kind of data will be that from an RPM point of view, it guarantees a 100% compliance, because the patient â\u0080\u0093 itâ\u0080\u0099s not dependent on patient â\u0080\u0093 on the patient paying attention to this every day. Weâ\u0080\u0099re not likely to provide it for free, and we think, weâ\u0080\u0099ll be able to make additional revenue on that, but we, because it is part of a value-added system that weâ\u0080\u0099ll be able to really, we like to say actually that â\u0080\u0093 we have the opportunity here to shake up not just the cancer care part of this, but actually the vast report aspect of this as well, which has been decades of essentially the same technology without any smart features. The mechanics here do argue for the likelihood of having sort of escalating numbers within a given practice because the way they generally approach it and again, I'm making this as a generic comment not for the specific practice that we launched is that you start with your highest risk patients and you get comfortable with 50 patients or 100 patients or so forth that you think would be most likely to benefit, and then expand it out to a greater and greater portion of the cancer patients within your practice."
}