{
    "symbol": "SPT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 23:27:09",
    "content": " We’ve worked with Salesforce customers for years and years, and as the market’s progressed over time, I think they’ve taken note of just the work that Sprout’s been doing in the marketplace and seeing a lot of their CRM customers leveraging the Sprout platform. So not that much time in the quarter, but has seen some really great progress in terms of the interactions across our teams, as well as the co-selling that’s happening with customers today and great feedback from those customers that have interacted with both of our teams and transitioned over. Yes, I appreciate the question. Yes, I appreciate the question. And I think we are still seeing this across the board, and we’ve mentioned this previously, but we think that we’re really early in the space, when we look at the number of businesses that are on social and the amount that have adopted a solution like Sprout. And that’s driving a – is powering the adoption within those organizations to a degree and getting additional use cases involved to a degree that I don’t think was probably as present two years ago as it is today, and the integrations are powering or opening the doors for those types of conversations and strategic decisions with inside the organization. And then just a ton of progress and emphasis across the organization and within Ryan’s organization, particularly around the revenue partnership opportunities and what those look like, where we can add value to pockets of customers for organizations like salesforce and others. And maybe just quickly to underline that, I think, one of the things that we’ve seen is social is just a bigger piece than it was two years ago, five years ago, and the starting investment for an organization of scale, within the mid-market enterprise specifically even just that first step of maturity and bringing social into the organization is a broader project. But I think we’re still – the networks, us, our customers, still feeling out what the ultimate strategy is going to be, what the investments are going to look like, what the nuance of the different networks and different social commerce opportunities are going to be. And it puts us just in a really – because we’ve got a great platform, great reputation, great culture, et cetera, and we’ve really made clear our go-forward plan around what work is going to look like, I think that’s just been something that’s attracting phenomenal people."
}