{
    "symbol": "SPT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 23:02:12",
    "content": " Sir, your line is open. And, I'll just tie on one last point on that one for you, Michael, and then I'll jump into the Salesforce piece agreed with everything Justin just shared, you know, more and more we're hearing from our customers, especially in this type of environment where, they might be scrutinizing some of their paid spend or other more expensive areas of spend the campaigns that they're running from a marketing perspective on social are very efficient. Sir, your line is open. And so I think because we're providing just this really fundamental set of business needs through social channels, it's been something that rain or shine has a ton of value for our customers is something that remains very important and certainly very high on the list of things that are must haves for a business at this point. Your line is open. So just in the context of a potentially more, potentially more scrutiny on, on it spend, how are new customers in particular, thinking about just the willingness to move over to sprout at this point, curious if that's coming up in conversations more as a benefit, just given the comments that we're hearing overall and the environment about longer deal cycles and that's scrutiny on it spend. One other thing that I'll point to on that question is just the, the reality of the conversations on the customer side has been for some time pretty close to non-negotiable meaning this isn't something when budgets start to get more scrutiny and start to get looked at or they're looking for areas to make cuts this isn't typically one that's on the list for a company that's for a brand that's invested in social you know, turning the lights out on this channel, or introducing disruption into how effectively they're managing our communities on social is pretty detrimental, particularly if the business is facing a challenging time. Your line is open. Your line is open. Maybe just wanted to dig in a little deeper on the larger ACV trends for new lands and, and maybe Ryan is best for you, but you know, are, are you seeing more of that from just the overall size of the customer being significantly larger and you're still landing with kind of a similar footprint relative to the size of the organization, or are you actually getting maybe more seats earlier on or the number of modules from analytics or listening or attach rates. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}