{
    "symbol": "SHOP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 12:56:17",
    "content": " The variety of merchants and ways they're using Shopify Plus continued to grow with new launches in the quarter spanning well-known brands in food, footwear, art supplies, cosmetics athletic gear, tech companies and video games, including the legendary Miami beach restaurant, Joe's Stone Crab; Havaianas, Mexico; Crayola; Fiora Cosmetics; Bridgestone Cycle; TRX Training; Figma; and Call of Duty. Over the past 4 quarters, we've seen gross payments volume benefit from strong performance by merchants on Shopify Payments, an increasing percentage of which is Shopify Plus GMV; new merchant adoption both in North America and internationally; penetration gains in Shop Pay, which has facilitated $50 billion in GMV since inception; and expanded availability of our POS Pro hardware with integrated payments now being used by merchants in 11 countries. Adjusted gross profit was $646.1 million compared with $565.1 million in the first quarter of 2021, reflecting a greater mix of our lower-margin Merchant Solutions revenue versus the prior year, lower margins in Shopify Payments due to mix, increased investments in our cloud infrastructure and the impact of the change in terms for our app and theme partners versus the prior year. Our financial outlook for the rest of 2022, which includes the impact of Deliverr, is as follows: our outlook for the full year is guided by the same assumptions we gave you in February; we're operating in a more measured macro environment relative to 2021, moderated by inflation; e-commerce will continue to penetrate commerce overall; and the prospects for entrepreneurship and digital commerce are greater now than at any point in our history after 2 transformational years for the industry and for Shopify. But Shopify Plus, some of the names that I'm talking about, whether it's Havaianas in Mexico, one of the largest footwear brands in the planet; or its company's like Fiora or it's TRX, we believe that Shopify is the best -- Shopify Plus the best product for growing brands that want to have modern commerce and modern retail."
}