{
    "symbol": "SHOP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 12:08:03",
    "content": " With our commercial teams increasingly selling to larger retailers, Plus merchants accounted for approximately 35% of all point-of-sale pro sales closed in Q3, and that's up from 14% in the same period a year ago. First, since closing the Deliver acquisition on July 8, we have developed an ambitious plan to create a new fulfillment app for Shopify merchants and also combine the Deliver and Shopify Fulfillment Networks into a single network, spanning a merchant's full supply chain. Merchant Solutions revenue of $989.9 million increased 26% year-over-year, driven by GMV growth and by merchants utilizing our solutions to run greater parts of their business in this inflationary environment. Approximately $25 billion of GMV was processed on Shopify Payments in Q3, 22% higher than in last year's third quarter or up 26% in constant currency. Over the past 6 quarters, we've seen GPV benefit from strong performance by merchants on Shopify Payments, an increasing percentage of which is Shopify Plus GMV, new merchant adoption, both in North America and internationally, penetration gains in ShopPay, which has facilitated nearly $66 billion in GMV since inception, and expanded availability of our POS Pro hardware in brick-and-mortar stores with integrated payments now being used in 14 countries. Monthly recurring revenue was $107 million, up 8% year-over-year in Q3 and Versus a year ago, we saw a greater number of Shopify Plus merchants with plus increasing its share of total MRR to 33% from 28% in Q3 of last year. Compared to the third quarter of 2021, adjusted gross profit growth was impacted by a greater mix of our lower-margin Merchant Solutions revenue, lower margins in Shopify Payments due to merchant and card mix shifts and industry-wide network cost increases, the impact of Deliver and increased investments in our cloud infrastructure. So I think when you combine flexibility, simplicity, it's still incredibly well priced relative -- to the value-to-cost equation is still very much on the side of value in terms of Shopify Plus, and the reason why you're seeing Plus growth outpacing GMV growth over the last couple of quarters. And if it's not just a small businesses, we're also seeing penetration of things like payments and capital increase with Shopify Plus merchants, the larger brands in the platform. When you add our Merchant Solutions and you add the fact that we can simplify things that are usually not easy to simplify, Shopify becomes the most important piece of software that merchants use, and that's what we're thinking about going to the holiday season."
}