{
    "symbol": "SHOP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 12:00:03",
    "content": " New to Shopify Merchants came from across a broad spectrum verticals, driving significant growth of Shopify Plus GMV in Q2, which continues to outpace overall GMV growth. Using software and machine learning, these SFN hubs, leveraging Deliverr's capabilities, will unpack, scan and inspect all inventory, then compare against metadata in Shopify's back office throughout the goods to merchants' various distribution channels as well as forward position inventory into SFN's spoke direct-to-consumer fulfillment centers based on expected buyer demand. Merchant Solutions revenue grew to $928.6 million, increasing 18% year-over-year, driven by increased GMV penetration of Shopify Payments, Shopify Capital and Shopify Markets on the back of GMV growth, as well as by growing revenue from partners. Over the past 5 quarters, we've seen GPV benefit from strong performance by merchants on Shopify Payments, and an increasing percentage of which is Shopify Plus GMV, new merchant adoption both in North America and internationally, penetration gains in Shop Pay, which has facilitated $58 billion in GMV since inception, and expanded availability of our POS Pro hardware in brick-and-mortar stores with integrated payments now being used by merchants in 13 countries. Subscription Solutions revenue grew to $366.4 million, which was 10% higher than a year ago, driven by more merchants on the platform and the strong growth of Shopify Plus, offset by a 4 percentage point negative impact on year-over-year growth from the change in app and theme revenue share model for partners that we implemented in Q3 of last year. Monthly recurring revenue was $107.2 million, up 13% year-over-year on higher number of merchants on the platform year-over-year, on Shopify Plus, which increased its share of total MRR to 31% from 26% in Q2 of last year, and on an increased number of retail locations using POS Pro. Merchant Solutions revenue will continue to grow as a percentage of GMV, driven by mission-critical tools like Shopify Payments, Shopify Capital, Shopify Markets, Shop Pay Installments and Shopify Fulfillment, including Deliverr, and continue to benefit from the growth of partner revenue. Shopify Shipping in places like France, for example, so there's a lot we can do in terms of getting more international merchants to the platform that don't necessarily require more headcount but rather require us to think a little bit differently about the software."
}