{
    "symbol": "CLPT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 19:18:02",
    "content": " For more information, please refer to the Company's annual report on Form 10-K for the year-ended December 31, 2021 and the company's quarterly report on Form 10-Q for the first three months ended March 31, 2022, both of which have been filed with the Securities and Exchange Commission and the company's quarterly report on Form 10-Q for the three months ended June 30 2022, which the company intends to file with the Securities and Exchange Commission on or before August 15, 2022. In the first half of 2022, we continue to make progress across our four-pillar growth strategy, including biologics and drug delivery, functional neurosurgery navigation, therapy and access products and in achieving global scale. Despite a continued high cancellation of procedures due to COVID, historically high surgeon transitions and daily supply chain challenges, our team was able to achieve record revenue of $5.2 million for the second quarter, representing 52% growth year-over-year. Biologics and drug delivery revenue surpassed functional neurosurgery revenue for the first time as our largest contributor and grew 73% year-over-year in the quarter at $2.4 million, including the addition of multiple new partners. Total revenue was $5.2 million for the three months ended June 30, 2022 and $3.4 million for the three months ended June 30, 2021, which represents 52% growth versus the second quarter of 2021. Biologics and drug delivery revenue increased 73% to $2.4 million in the second quarter, up from $1.4 million in Q2 2021. Capital equipment and software revenue consisting of sales of ClearPoint reusable hardware and software and related services nearly tripled to $0.6 million for the second quarter, from $0.2 million for the same period in 2021, following the addition of the centers installed in the second quarter. First, our biologics and drug delivery team continued to add additional partners and services in the second quarter adding multiple new partners to our accounts, which is now over 45 active partners in the space and keeping pace with our past two years of history adding approximately one new partner every month."
}