{
    "symbol": "CLPT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 19:25:22",
    "content": " ClearPoint Neuro total revenues were $20.6 million for the year ended December 31, 2022, which represents a 26% increase over revenue of $16.3 million in 2021. This revenue segment increased 13% to $9.1 million for the year 2022, up from $8.1 million in 2021. Biologics and drug delivery revenue increased 34% to $9.1 million in 2022, up from $6.8 million in 2021. Capital equipment and software revenue, consisting of sales of ClearPoint reusable hardware and software and related services was $2.3 million for the year 2022, a 61% increase compared to 2021. Research and development costs were $10.9 million for the year 2022 compared to $9.3 million in 2021, an increase of $1.6 million or 17%. Sales and marketing expenses were $9.4 million for the year 2022 compared to $7.2 million in 2021, an increase of $2.1 million or 30%. General and administrative expenses were $9.6 million for the year 2022 compared to $8 million in 2021, an increase of $1.6 million or 20%. Total revenues were $5.2 million for the 3 months ended December 31, 2022, an increase of 21% over $4.3 million in the fourth quarter of 2021. Capital equipment product and related service revenue increased 25% to $0.6 million for the fourth quarter of 2022, as compared with $0.5 million in the same period of 2021 due to an increase in the placement of ClearPoint Capital and software. Net cash flows used in operating activities for the year ended 2022 were $16.2 million, an increase of $3.5 million from the year ended 2021. 2022 was a successful year for our team across our four pillar growth strategy, which has remained in place for the past 5 years and headlined by record revenue of $20.6 million and 26% growth. Now as a reminder, if one partner were to use ClearPoint for our entire portfolio of products and services, that represents approximately an $8 million to $10 million in revenue potential over a 5-year period. For 2023, we continue to expect revenue in the range of $25 million to $27 million for the year, representing growth between 21% and 31% year-over-year. Revenue in Q1 will likely be in the range of $5 million to $5.5million and subsequent quarters growing more rapidly based on our capital sales pipeline, laser therapy revenue and timing of preclinical services, which are going to contribute more in the second half of 2023."
}