{
    "symbol": "CLPT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 18:15:03",
    "content": " Despite a continued high cancellation rate due to COVID, historically high surgeon transitions and daily supply chain and hospital staffing challenges, our team was able to achieve near record revenue of $5.1 million for the third  representing 13% year-over-year growth. We continue to expect total revenue for 2022 to be in the range of $21 million to $22 million, representing 30% to 35% growth for the year depending on timing of revenue recognition for some capital sales and biologic services. Looking at the third quarter 2022 results, total revenue was $5.1 million for the three months ended September 30, 2022, and $4.6 million for the three months ended September 30, 2021, which represents 13% growth versus the third quarter of 2021. Biologics and drug delivery revenue increased 9%, $2.2 million in the second quarter, up from $2.1 million in 2021. Sales and marketing expenses were $2.1 million for the third quarter compared to $1.8 million for the same period in 2021, an increase of $0.3 million or 18%. If one of our partners or even one of the programs within a partner, would purchase the entire suite of products and services that our team can now provide, the total value of those products and services from initiation of the program through the completion of a Phase 3 clinical trial could potentially add up to $10 million per program before the drug or biologic is even approved. So that's really where the other half of that $10 million comes from is consulting, it's toxicology studies, it's bench top studies, it's flow studies, one of the things the FDA is asking for is whatever the component makeup of the drug or cell therapy that you're putting in one side of the cannula, you have to be able to characterize exactly what's coming out of the other end. So these are the types of things where if you reverted back maybe two years ago, I would say the most that we could possibly sell to a company was in that $5 million range because we just didn't have any of these services compared to everyone we've hired in these capabilities that the team has built has effectively doubled the opportunity we have with each one of partners."
}