{
    "symbol": "FXLV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-16 11:55:58",
    "content": " During the quarter, system-wide sales increased to 23% globally as compared to Q2 of 2021 to a record $127 million with the United States segment experienced 44% growth. The increase was primarily driven by a significant increase in equipment revenues, which increased 74.8% to $10.9 million compared to $6.3 million in the prior period. After adjusting for the cumulative franchise revenue catch-up of $3.5 million in Q2 2021 from the recognition of revenues previously unrecognized under promotional deals, franchise revenues increased $2 million, an increase of 11.9% from the prior period. U.S. equipment revenue increased by 44.9% to $6.6 million compared to $4.5 million in the prior year period, primarily driven by the increase in equipment and merchandise deliveries. Compared to the prior year period, total studios increased by 46 or 7% to 674 and total franchises sold increased by 18% or 2% to 803. Equipment sales in Australia increased by 59.5% to $1.1 million compared to $0.7 million in the prior year period, driven by increases in equipment deliveries and the launch of FS8 and associated equipment deliveries for the FS8 studio. In the rest of world, franchise revenue decreased by 29.5% to $3.5 million from $4.9 million, primarily attributable to the impact of onetime adjustments related to limited time promotional deals of $1.2 million, as discussed in note 2 of the financial statements in our 10-Q, and credits provided to studios impacted by COVID during the second half of 2021, which are amortized over the franchisees remaining contractual term, partially offset by the increase in the number of franchise sales as well as the increase in studio openings in ROW. Compared to the prior year period, total studios increased by a 130 or 35% 501, and total franchises sold increased by 167 or 26% to 804. Equipment revenues for ROW increased 215% to $3.3 million compared to $1 million in the prior year period, driven by the purchase from studios under development agreements entered into during 2021 and the delivery of required top-up equipment. After adjusting for the cumulative franchise revenue catch-up of $3.5 million in Q2 2021 described above, franchise gross profit increased $2.2 million, an increase of 14.5% from the prior period. Regarding headcount, we made the tough decision to reduce our workforce by approximately a 110 full-time employees or approximately 45% of our full-time employee base, we expect that this will help bring target normalized headcount cost to approximately $7 million to $10 million per quarter. Based on the units we already have opened today, we generate approximately $20 million per quarter in recurring franchise revenue, which will grow as we continue to expand our franchise network. After accounting for operating expenses of roughly $60 million to $80 million a year, we currently expect the business to be profitable on total adjusted EBITDA basis before including any contribution of well pack and top-up pack equipment ancillary product revenue or the contribution of additional franchise revenue growth. We continue to expect full year net franchises sold between 350 and 450, full year net initial studio openings between 350 and 450, full year revenues between a $120 million and a $130 million."
}