{
    "symbol": "FXLV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-14 21:36:10",
    "content": " For the third quarter, total revenues increased by 8% to $29.3 million compared to $27.2 million in the prior year period. In the U.S. segment system-wide sales increased 32%, while our Australian and rest of the world segments increase 20% and 50% from the prior year period respectively. In addition, system-wide visits during the quarter increase 19% globally driven by 10% growth in the U.S., 22% growth in Australia, and 38% growth in the rest of the world. Starting with Q3 results, third quarter total revenues increased 8% to $29.3 million compared to $27.2 million in the prior year period. Starting with the U.S., we achieved franchise revenues of $11.7 million in Q3, which were in line with franchise revenues of $11.9 million in the prior year period. U.S. equipment revenues increased $0.6 million, driven by the delivery of equipment and merchandise, including top up packs to our franchisees. Australia equipment and merchandise revenues declined $1.5 million from the prior year period, primarily driven by a decrease in the number of World Packs delivered through our FS8 franchisee. Moving onto network health, system-wide sales, which is one of our key measures of the health of our franchise network, increased 31% to $131 million with growth across all three of our segments. System-wide sales increased 32% in the U.S., 20% in Australia, and 50% in ROW from the prior year period, driven by new studio openings and greater percentage of studios which were not impacted by COVID-19 related restrictions primarily in Australia. System-wide visits also increased 19% to $7.6 million, driven by a 10% increase in the U.S., a 22% increase in Australia and the 38% increase in Rest of World. Our quarter end numbers of studios reflect 44% growth in the U.S., 7% in Australia, and 30% in rest of world, compared to the prior year period. We continue to expect full year net franchises sold between 350 and 450, full year initial studio openings between 350 and 450, full year revenues between $120 million and $130 million, full year adjusted EBITDA between $25 million and $30 million."
}