{
    "symbol": "VRM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 11:37:02",
    "content": "  Operator: Thank you for standing by, and welcome to Vroom's Third Quarter 2022 Earnings Call. Good morning, everyone, and welcome to Vroom's Third Quarter 2022 Earnings Call. Please note, this call will be simultaneously webcast on the Investor Relations section of the company's corporate website at ir.vroom.com. Before we begin, please note that the discussion today includes forward-looking statements within the meaning of the federal securities laws, including, but not limited to, statements about Vroom's operations and future financial performance. These and other forward-looking statements are based on management's current assumptions and are neither promises nor guarantees and are subject to a number of risks, uncertainties and other important factors that may cause actual results to differ materially. We direct you to the company's most recent SEC filings, including the Risk Factors section of Vroom's most recent Form 10-K for the year ended December 31, 2021, as updated by our quarterly report on Form 10-Q for the 3 months ending September 30, 2022, for additional discussion of factors that could cause actual results to differ materially. Please note further that today's discussion, including the forward-looking statements, speak only as of the date of this call, and Vroom assumes no obligation to update such statements. Thank you, Liam, and thank you to all the investors, analysts, Vroommates, UACC colleague and third-party partners who are joining us today to discuss Vroom's Third Quarter Earnings. We introduced our long-term roadmap in our May 26 Investor Day where we highlighted our mid-term goal, which is a breakeven business and our long-term goal of a 5% to 10% adjusted EBITDA margin business. During Q3, we made improvements toward our goal of building a well-oiled titling and registration machine, and we began building a well-oiled sales machine. Our goal is to optimize the end-to-end supply chain by synchronizing how we buy, move, recondition and deliver vehicles to reduce cycle times, reduce supply chain costs, improve inventory turns and improve customer delivery times. During Q3, we continue to make improvements in building our well-oiled metal machine, and we began transitioning our Stafford reconditioning center to the TDA service center location. We expect to build density in regions to drive marketing and supply chain economics, while improving customer delivery time. From Q1 to Q3, we have reduced the average number of miles or vehicles travel by 18%. We intend to expand our captive finance offering for Vroom customers which we believe will improve conversion rates and improve unit economics, while also improving the customer experience. We also intend to continue to grow the UACC third-party dealer business, which contributes to our consolidated EBITDA. We improved adjusted EBITDA, excluding non-recurring expenses, by $20 million or 26% sequentially. Our Ecommerce gross profit per unit or GPPU was $4,206, reflecting progress toward our long-term goal. We reduced our restricted cash by $59 million, primarily driven by the improvements in titling and registration. We continue to make improvements in transaction processing, including titling and registration. We began the transition of our Stafford reconditioning center to the TDA service center location, which will lower our fixed costs. In the back half of August, we experienced a large, unexpected staff reduction at one of our third-party sales partners. While we had planned a slower and smoother transition to insource our sales function, we believe this transition will reduce our selling cost per unit earlier than initially planned. Given our focus on profitability and liquidity over growth, the unexpected reduction in selling resources during the quarter and the macroeconomic environment, we currently expect to be below our forecasted Ecommerce unit range for the year, better than the midpoint of our forecasted adjusted EBITDA loss range and near the midpoint of our previously forecasted liquidity range. On Slide 5, during Investor Day, we outlined these key unit economic drivers behind our 4 strategic initiatives that we believe will build a profitable business model. For the Product and Vehicle GPPU, we achieved $4,206 Ecommerce GPPU, driven by our pricing initiatives and captive financing operations. UACC completed its second securitization since our acquisition and UACC's 14th securitization overall, demonstrating UACC's ability to leverage its substantial capital market experience to opportunistically deploy securitization transactions and maintain capital flexibility even in a challenging market. Logistics, we reduced our all-in logistics cost by $5 million sequentially. As we continue to improve the titling process, we expect this to increase the number of vehicles we list for sale and reduce the number of vehicles listed as coming soon. As we continue to improve our titling process, we are receiving titles of aged vehicles that had not been listed for sale due to the delay in obtaining the title. As we receive these titles of aged vehicles and list them for sale, we expect pressure on Q4 GPPU. We reduced our fixed cost $4 million sequentially, and we continue to focus on additional fixed cost reductions. Lastly, our advanced analytics team, functional business teams and tech teams continue to build data assets, analytical assets and tech assets that we believe in the long term will provide a competitive advantage across titling and registration, pricing, conversion, vehicle and product margin and supply chain costs. While we don't plan to share monthly unit numbers going forward, we felt it was important to share how the events impacted our monthly unit volume. In July, as registrations and our customer experience continued to improve, we took steps to normalize unit sales, which increased unit sales from July to August by 36%. As mentioned earlier, in the back half of August, we experienced a large unexpected staff reduction at one of our third-party sales partners. Consistent with our strategy, we intentionally slowed transactions to focus on operational execution and unit economics. As Tom mentioned earlier, unit volumes were also impacted by a reduction in third-party sales resources, beginning in the back half of August as well as overall macroeconomic conditions. Ecommerce GPPU increased 16% to $4,206. During the third quarter, we realized further pricing optimization, which contributed to the increase in vehicle GPPU as well as increased product GPPU as we scale UACC-originated loans. Adjusted EBITDA loss, excluding non-recurring costs, improved $20 million to $57.5 million. On the expense side, we further reduced our fixed and variable operating costs as we continue to pursue our 3 key objectives. These costs exclude $16 million of non-recurring costs to address operational and customer experience issues, consisting primarily of $12 million of rental car expense during the quarter. The 3 primary drivers of improvement were a $38 million gain on debt extinguishment due to our repurchase of convertible debt, the $16 million securitization gain I referenced earlier and improved operational results. Excluding non-recurring costs, adjusted EBITDA improved $20 million quarter-over-quarter. As discussed earlier, improvements in adjusted EBITDA were driven by higher GPPU, reduced operating costs and the gain on our third quarter securitization at UACC. One key driver of our low unit sales volume continues to be a focus on operational improvement, as we intentionally slowed transactions to improve unit economics and the customer experience. While we don't expect the long-term unit impact from this transition, as we scale lower-cost sales resources, consistent with our long-term roadmap, we do expect an ongoing unit impact in the fourth quarter as our new team members ramp up to full productivity. In addition to the factors previously mentioned, third quarter units were also impacted by current macroeconomic conditions. I would like to provide some additional detail on our Ecommerce gross profit per unit performance, starting with vehicle gross profit. Vehicle gross profit per unit increased 5% to $2,267. As Tom mentioned earlier, we've seen significant improvement in our titling and registration process with 98% of customers receiving the registration before the expiration of their temporary tag in October. As a result of this process, we expect a higher portion of our unit sales over the balance of the year to be from aged inventory as we obtain titles for cars, previously not listed for sale. Coupled with declining used vehicle prices across the market, we expect this to negatively impact our sales margin in the fourth quarter. Product GPPU increased 33% to $1,939, as UACC-sourced financing continues to perform in line with our expectations. Our higher vehicle and product GPPU ultimately delivered total Ecommerce GPPU of $4,206, a 16% sequential increase. Let's move to Slide 10 for second to third quarter comparison of our adjusted EBITDA performance, excluding non-recurring costs. Next, the UACC securitization contributed $16 million of gross profit to the retail finance segment. This was partially offset by a $9 million decrease in non-Ecommerce gross profit, primarily driven by lower interest income from third-party dealership finance receivables. As a reminder, since we are not yet performing securitizations every quarter, we expect quarter-to-quarter volatility in these amounts with a buildup in this interest income in non-securitization quarters and the decrease in quarters we enter into a securitization transaction. Total expenses, excluding non-recurring costs, decreased approximately $19 million. We delivered an additional $9 million in cost reductions, primarily in marketing and logistics and also decreased variable costs due to lower unit volume. Overall, we improved adjusted EBITDA, excluding non-recurring costs, by approximately $20 million, a 26% improvement. First, we reduced restricted cash on the balance sheet by $59 million, sequentially. Next, we repurchased $56 million face value of our convertible notes for $18 million, reducing our leverage. 98% of the customers received their registrations before the expiration of their initial temporary tag in October, as we continue to focus on becoming best-in-class in titling and registration. We improved adjusted EBITDA, excluding non-recurring costs, by $20 million or 26% sequentially. Our Ecommerce GPPU of $4,206 reflects progress towards our long-term goal. We reduced restricted cash by $59 million sequentially, driven primarily by titling and registration improvements. I look forward to updating you on our progress on our 4 strategic initiatives each quarter, as we pursue our long-term roadmap. I would tell you, quarter-over-quarter, the -- our delivery fees were actually down a little bit as we continue to experiment with what the right balance is to optimize the overall GPPU and volume. I think as we mentioned, in the short term, as we get all these titles for cars that we have not listed for sale, that's going to cause some pressure in this quarter. But I think once we get through being current on titles, maintaining or staying current on titles, I think around the $4,200 range is kind of what we put in our long-term plan. And that's why we pointed out in the deck during this quarter, even at $4,200 GPPU, when we made the decision to grow from July to August, and what I would really call normalized demand, we were doing that in the context of still optimizing GPPU. So it's certainly hard to predict what's going to happen in 2023, especially with the macroeconomic backdrop. So of all the numbers, like we feel pretty good about where we're at in GPPU for the long run. And so in the long run, we definitely need to continue to drive SG&A down, variable and fixed costs. The way we think about variable cost, our marketing cost per unit is clearly way too high. And we're making adjustments to that, but we've also initiated new projects around how do we drive conversion. You may recall from Investor Day, we have a significant amount of sub-prime traffic that historically, we've not been successful in converting into sales. While we've made huge improvements, our cost in titling and registration are still too high. At the same time, we've got tech initiatives that are rolling out in Q4 and in the first half of next year that we expect to bring titling and registration costs down. And right now, when we look at what the assumptions we made in our roadmap that we outlined in May, we believe at this point that we can continue to focus on driving those costs down. But we've consciously, for the shorter term, we've decided, we've got a lot of, what I'll call, semi-fixed costs in our variable costs where we're keeping hubs open because when we do get things right, get the titles in place and begin to grow in the future. And so I'm really focused on how we build that into a well-oiled machine, and I believe that those costs per unit will get in line as we do grow again. And I'd say that our tech resources are becoming more and more efficient, and we're focusing them on the highest value-added projects. So in the shorter term, you're going to see our tech cost per unit higher than we'd like in the long run, and we'll expect to normalize that with volume. And I would tell you, we have some really wonderful partners, and we're trying to work with them in the long run, how do we adjust contracts, and we're going to remember those that work with us to be favorable. But kind of holistically, that's how we look at our entire variable and fixed cost structure, and we're working on it on a daily basis. It's clear if we look at just the competitive environment and what others in the industry have reported, there is definitely a macroeconomic environment, component that's happening to demand. What I can tell you is -- and we -- I mentioned it earlier in my opening comments that we had this large sales force reduction and it was very large, and it happened in a single week. We have been ramping our sales force, one of the unknowns for us, we had a very experienced third-party partner that's been with us for a long time that was -- that had this reduction in sales force. As I mentioned, in our long-term roadmap, we expected to transition this selling cost internally over the long term, like it was not in our radar for this year because it just wasn't one of our priorities. And then, of course, we continue to test different levers around what the right mix of volume versus GPPU. And as we really drastically changed the way we think about pricing vehicles, I've been quite surprised by, we have cars that, frankly, we've had greater than 180 days, even greater than a year that we're producing very strong GPPUs on. So we're being very -- been level focused on optimizing profitability on every vehicle, regardless of its age. As we've worked throughout the year and really got to where we want to get to on registration, we've been working on titles all along. But now that we're getting registrations where we think we want them, we're doubling down on titles. So to get to your answer, if we were to end the quarter right now, I would expect GPPU for Q4 to be somewhere in the low 3s. I wouldn't be surprised if that number could go as low as $2,500 or as high as $3,500, depending on how things go the rest of the quarter. We do see this as a short-term issue, solely related to the delay in the titling process, especially as the depreciation rates of used cars have increased a bit lately. It's going to reduce our fixed cost by several million dollars once we exit the current facility, it's going to provide a much better environment for Vroommates that work in that reconditioning center. We're going to remove the fixed cost of the current Stafford location, but we don't see it as something significantly material. Given the transformation we've been doing this year, it's really hard for us to tell what's happening in used car demand, given all the various levers we're pulling to improve the business. Clearly, we know -- we actually think our other competitors are probably a better proxy for what's going on in the industry. I think that's a $64,000 question, what -- how are things going to play out next year as the Fed continues to raise rates and depends on what happens with inflation."
}