{
    "symbol": "VRM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 13:20:03",
    "content": " In total, the realignment plan is expected to drive $135 million to $165 million in cost reductions and operating improvements to full year 2022 adjusted EBITDA versus our first quarter 2022 annualized rate. All in, we expect to deliver approximately $135 million to $165 million in cost reductions into operating improvements versus our first quarter run rate for 2022. As I referenced, we expect approximately $135 million to $165 million of cost savings and operating improvements for the remainder of the year from the underlying Vroom business as a result of the realignment plan. Next, we anticipate approximately $65 million to $75 million from UACC Vroom financing for the full year, with $30 million already realized in the first quarter. Your line is open. Even as you assume a rate of roughly $7,000 after cost savings layering probably $1,000 from the captive finance integration, we still get to something like $6,000 of EBITDA loss per car which would imply a significant degree of cash burn next year as well roughly $400 million as per my calcs after accounting for UACC and CapEx on maybe 65,000 to 70,000 units next year. So within that we are very focused -- so the actions we've taken are intended to significantly improve variable contribution margin, which we're defining as GPPU less variable operating costs like marketing, customer experience and logistics. Your line is open. Your line is open. So, there's obviously lots of things moving around right now with interest rates in the used vehicle market, what we're committed to as a leadership team and as a company is to live within our means get to that $0.5 billion of cash at the end of the year and then, we'll see where the market is and we'll continue to of course, correct and make the appropriate adjustments given the amount of resources that we have. Your line is open. Your line is open. Your line is open. But I think one of the things that's really important to understand in terms of exit run rate as well is just -- I also mentioned there is a third to fourth quarter securitization with UACC, which is another -- from an overall -- from an optimal EBITDA perspective another $35 million to $40 million in terms of improving the exit rate, depending upon market conditions and when we execute."
}