{
    "symbol": "SF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-27 14:35:33",
    "content": " To illustrate, Global Wealth Management revenue increased 8% to a record $682 million, as our fee-based revenue and net interest income had record quarters. On the other hand, our institutional revenue declined 15% to $431 million, yet we are also balanced within our institutional business, as the strength of our advisory and fixed income revenues helped offset a roughly 80% decline in industry-wide equity issuance. Our pretax, pre-provision income of $250 million was up 5%, excluding the impact of our credit provisions, which I would note, are related to loan growth, our earnings per share would have increased by $0.10 per share this quarter. However, the impact of the decline in equity valuation was partially offset by continued strong inflows as our fee-based assets ended the quarter at $158 billion, and total client assets were $421 billion. While our first quarter net revenue of $431 million was down 15% versus last year's record first quarter, we are still on track to generate the second highest institutional revenue in our history. Our fixed income business generated net revenue of $161 million, up $15 million or 10% from last year, helping to offset the fact that our equities business was down $140 million or 62% and came in at $86 million. Fixed income trading revenues was a record $122 million, up 24%, driven primarily by the addition of Vining Sparks, and increased overall activity in our rates business. For the quarter, we posted revenue of $255 million, which was down 25% as our record – as record first quarter advisory revenue was more than offset by the weakest equity underwriting market we've seen in some time. Our fixed income underwriting business posted $40 million of revenue, a decline of 17% from last year. With that said, assuming we see two 50 basis point rate hikes in the second quarter, we would project net interest income in the second quarter in a range of $190 million to $200 million and a bank NIM of 285 to 295 basis points. Given our current asset composition, total balance sheet growth of $4 billion for the year, an additional 100 basis points of rate hikes expected in the second quarter and a 50% deposit beta, the low end of our guidance range will increase to $800 million. When we modeling the impact of an incremental eight rate hikes, $6 billion of asset growth and a 25% deposit beta, this would drive the high end of our NII range for the year to $900 million. Non-compensation operating expenses, excluding the credit loss provision and expenses related to investment banking transactions totaled approximately $197 million and represented 17.7% of our net revenue. Equity capital markets, the first quarter that was 80% decline in equity-linked issuance and the volatility that we're seeing in the market and what I mentioned in the mix, that's going to certainly impact new issue, but the volatility also will help our trading businesses."
}