{
    "symbol": "ALGT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 23:03:07",
    "content": " The continued huge increases in both new visitors and direct visitors to allegiant.com, speaks not only to the ever-increasing awareness of our brand, but also what that brand stands for: low fares and nonstop flights, the two most important buying factors, during what's been a turbulent time, in terms of both airline industry operations and inflationary economic conditions. In addition, our non-credit card-based loyalty program Always Rewards is just coming up on its one-year anniversary but already we're seeing engaged Always Rewards members spending 34% more on average than non-members, driven by increased take rates on air ancillary products and attachment of third-party products as customers engage with our simple but compelling rewards currency to maximize their point earnings for use on future leisure travel with Allegiant. Additionally in what is an encouraging but a revenue-offsetting dynamic, the use of vouchers given out above and beyond refunds or through marketing efforts encouraging folks to travel when ready were up nearly 200% per passenger; a great sign that beyond the great work Scott and his team has done to aid awareness and produce new visitors our previous flying guests are returning to Allegiant for additional trips. We narrowly missed 90% boarded load factors recorded nearly $70 per passenger in ancillary and had the third highest monthly increase when comparing to June 2019 in air rev per passenger over the last 15 years of Allegiant, and certainly, the best with any amount of meaningful ASM growth. That phenomenal story features boarded loads over 90%, a July record ancillary per passenger and the fourth highest air revenue per passenger increase comparing to July 2019 over the last 15 years of the airline. If we adjust for the $10 million in revenue, $19 million of fuel, and $9 million in additional customer compensation our 2Q operating margin would have been 11.4% and in line with our initial guide. Thank you so much. Thank you so much. Thank you so much. Thank you so much."
}