{
    "symbol": "ASC",
    "quarter": 4,
    "year": 2023,
    "date": "2023-02-15 10:04:08",
    "content": " But we do think today, our net asset value is still â\u0080\u0093 I would say, way ahead, but kind of meaningfully ahead of the stock price keeps going up, and itâ\u0080\u0099s not going up right now because of asset values, but because of accrued earnings, holding building of equity in the companies. I think â\u0080\u0093 yes, I think the â\u0080\u0093 as an example, just today on a ship with one of our competitors that got into a fair bit of trouble due to trading history, and we also know that fairly high-profile customers, of course, are quite concerned about their reputation and to ask a lot of questions during their KYC process, not just about the owner, the counterparty, but also about individual ships and their trading history, just being scrutinized even more. But Iâ\u0080\u0099d say, to answer your question, I would like to think that as we stress further towards nonpetroleum-based cargoes, they can move quite different from your standard petroleum-based trades, which usually starts with a big refining hub, Northern Europe, U.S. Gulf, Middle East, maybe China, maybe Singapore, you will find, I think, ways to quite naturally cut those ballast legs. And I think thatâ\u0080\u0099s part of the reason why a lot of what we do in terms of setting up our organizational focus is to really â\u0080\u0093 so we donâ\u0080\u0099t lose sight of this because a lot of this we need to catch on the forefront and it needs to be kind of come part of sort of our muscle memory in terms of how we trade our ships, operate them. What I think itâ\u0080\u0099s worth highlighting that in an environment of extreme volatility as we have experienced and an environment of extreme uncertainty as we have also experienced that our customers, oil traders and refiners really like that flexibility, ability to continue selling their cargoes as the ship is already underway and the ship that offers the most trading flexibility and the most traded stem sizes are the MRs. For us, of course, also we can access nonpetroleum trade more easily with MRs, itâ\u0080\u0099s not really possible with LRs."
}