{
    "symbol": "MIXT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-07-30 17:18:04",
    "content": " Iâ\u0080\u0099d now like to turn the conference over to Paul Dell, Chief Financial Officer. We appreciate you joining us to review MiX Telematicsâ\u0080\u0099 earnings results for the first quarter of fiscal year 2023, which ended on June 30, 2022. Today, we will be discussing the results announced in our press release issued a few hours ago. Iâ\u0080\u0099m Paul Dell, MiXâ\u0080\u0099s Chief Financial Officer, and Iâ\u0080\u0099m joined by Stefan Joselowitz, or as many of you know him, Joss. During todayâ\u0080\u0099s call, we will make forward-looking statements related to our business, which are subject to material risks and uncertainties that could cause our actual results to differ materially. For discussion of the material risks and other important factors that could affect our results, please refer to those contained in our Form 10-K and other SEC filings, all of which are available on the Investor Relations section of our website. There is a reconciliation schedule detailing these results currently available in our press release, which is located on our website and filed with the SEC. We had another strong quarter of net subscriber growth, adding 23,200 subscribers to end with a base of over 838,000. It is also our third consecutive quarter adding more than 20,000 net subscribers, and we are now above pre-pandemic levels, an important driver in our continued revenue growth. Annual recurring revenue ended at $123.2 million, up 1% sequentially and 7% year-over-year on a constant currency basis. As we have discussed in previous quarters, the ongoing supply chain challenges continue to impact vehicle deliveries to some of our customers. In addition, the dollar strengthened notably during the quarter, which was a meaningful headwind to our reported results. Paul will discuss this in more detail later, but the cost increases in parts of our business puts some pressure on our profitability during the quarter. Overall, our business continues to perform reasonably well given current circumstances. The sizable expansion of our subscriber base in recent quarters, in addition to the continued strong growth in our sales pipeline across regions and product categories reflects meaningful customer interest in deploying advanced Telematics solutions. This includes worker productivity to mitigate tough labor markets as well as promoting greater fuel efficiency, enhancing vehicle utilization and promoting safer and more sustainable fleet operations. We signed agreements with various customers in Latin America to expand existing contracts for almost 3,000 additional subscribers with implementation ongoing. In the U.K., the leading bus operator, go ahead group renewed their 4,000-plus subscriber contract with us and are actively expanding their investment by adding our MiX Vision AI solution in their metro fleets to further improve their safety standards. In South Africa, Isuzu a Japanese commercial vehicle manufacturers serving customers in more than 150 countries worldwide, awarded us the connected truck contract. Several of our solutions have been adopted simultaneously, including our core premium fleet telemetry service, AI video, driver app, journey management and in-cab coaching. Originating in Europe, this deal will soon be expanding into the Middle East, Australasia, as well as South America to provide an integrated solution for their electric vehicle bus and coach customers. As always, we will focus on those things that we can control, particularly on exceptional customer service, cost discipline and targeted investments in our strategic growth initiatives. Despite the near-term uncertainty in the market, nothing has changed about our long-term expectations for our business. This is an exciting time for the company, and I want to thank all of our employees for their hard work and commitment to our customersâ\u0080\u0099 success. Iâ\u0080\u0099m excited to be back in the role of Chief Financial Officer, and Iâ\u0080\u0099m confident we can continue on the path for sustained success going forward. Please keep in mind that all figures refer to the first fiscal quarter of fiscal 2023 and all comparisons are for the year-over-year changes, unless I say otherwise. Total revenue came in at $35.1 million and subscription revenues were $31 million, representing constant currency increases of 7.3% and 6.3%, respectively. Please note that as discussed on the last call, the large South African customer, we anticipated moving to a channel relationship did not make that transition during the first quarter. And as a result, Q1 subscription revenue was somewhat better than we expected. The South African rand weakened by 10% against the U.S. dollar compared to the first quarter of fiscal year 2022, contributing to a 6.7% decrease in our reported subscription revenues. We ended the quarter with over 838,000 subscribers, an increase of 11% year-over-year. The strong net adds in the first quarter were driven by net growth in our light fleet and premium fleet solution categories, primarily in our South African business. ARR at the end of the quarter was $123.2 million, up 0.9% sequentially and 7.2% year-over-year on a constant currency basis. ARR continues to be impacted by the longer implementation cycles for some of the larger wins during the previous fiscal year, which have contributed to the growth in our backlog of pending installations. Finally, we did have approximately $200,000 related to a customer in Russia come out of ARR in the quarter due to the impact of sanctions in this region. As a reminder, we do expect some volatility as we work through some of the supply chain challenges that impact costs. As a reminder, Q1 is typically our lowest adjusted EBITDA margin quarter given the timing of merit pay increases. Adjusted net income for the quarter was $1.9 million, down from $2.9 million in the year ago period. We ended the quarter with $24.6 million of cash and cash equivalents compared to $33.7 million as of March 31, 2022. In the first quarter, we used $0.7 million in net cash from operating activities and invested $6.7 million in capital expenditures, leading to a negative free cash flow of $7.4 million. Before I wrap up, I would like to reiterate our expectations for the remainder of fiscal 2023. As Joss mentioned, we are targeting another year of solid growth with mid to high single-digit constant currency subscription revenue growth and high single to low double digit ARR growth. The rapidly evolving challenges facing the global economy presents some potential challenges that we monitor closely, but we continue to see encouraging demand activity across our major end markets and solutions. From a linearity perspective, we would expect the second quarter ARR growth to be muted given the transition to a channel relationship for this large African customer before picking up in the second half. As mentioned previously, we are still targeting low to mid-20s adjusted EBITDA margins for the full year. We have consistently managed the cost structure in a disciplined way for many years at MiX, and we will take the steps necessary to manage through the current environment. Importantly, we will not be sacrificing investments in our strategic growth priorities, which are crucial to delivering on our long-term objectives. To wrap up, we delivered solid first quarter results and encouraging trends in subscriber additions. We certainly saw strong performance in that sector, particularly in our African business, our South African business, we have been working on various channel relationships that are starting to get traction. And then in terms of the OEM relationship with Isuzu maybe you could just -- youâ\u0080\u0099ve been signing, and I think you have a few of these now, and theyâ\u0080\u0099ve been coming every few quarters. So it is a fairly lengthy sales process, so to speak, building the relationship, finding the right people to engage with and then developing a level of comfort to be able to conclude a transaction with a significant third party, as you can appreciate. And so theyâ\u0080\u0099re paying us a subscription fee, and it also gives us a significant up-sell opportunity with the end user of that vehicle. Nearly 400 of those vehicles fit, that has already been installed with our devices ended up pretty much under water and that customer is still waiting for vehicles to be delivered to them. So we are waiting for those vehicles to be replaced, so we can install our hardware for the customer, and get the vehicles delivered, so we can start billing the customer subscription revenue that adds to our ARR, et cetera. Obviously, when that contract comes to an end, we endeavor to renew on more favorable terms. And typically, in those contracts, we have an annual inflationary increase built in other based on a consumer price index or some predetermined number into our contracts. So in some of our contracts in certain regions, we certainly get an annual escalation, which does, at least to a degree, compensate for input pressures. And to get to that, I guess, the first part of your question, thereâ\u0080\u0099s no doubt that weâ\u0080\u0099ve seen over the last year to 18 months, increasing pressure from all of our suppliers, I guess, but component and software suppliers endeavoring to push those prices up. We had seen an element of what I would consider price gouging in recent quarters, and weâ\u0080\u0099re taking proactive steps we have and we will continue to take proactive steps to deal with those and that weâ\u0080\u0099re changing suppliers for certain services where we believe that the increases are unreasonable. But thereâ\u0080\u0099s no doubt that inflation is an issue in our business as it is for, I guess, most businesses. The other thing I want to ask about Joss, that we saw the sales and marketing expense line increase. So yes, weâ\u0080\u0099re as I think weâ\u0080\u0099ve indicated over the last year or so that we are back in a phase where weâ\u0080\u0099re focused on growth. And while at the same time, weâ\u0080\u0099re taking a very close look at containing and managing our nonstrategic costs. So it is a bit of a balancing act, but we expect those investments to continue and particularly on the sales and marketing side. Congrats on another quarter with 20,000 plus subscribers. So certainly in terms of performance of this quarter, I think the standout was our African business, followed by Brazil. So -- and bear in mind, both of those businesses performed extremely well in very tough environments. We -- in terms of the other geographies, more or less according to plan, maybe one of them marginally behind plan. Paul had mentioned we terminated services to one of our Russian-based customers due to sanctions issues, their bankers are in the sanctions list. They were unable to continue to make payments and we took a view that it wasnâ\u0080\u0099t worth continuing service, but that did have a muting effect on a region and on our ARR growth for the quarter because itâ\u0080\u0099s a high ARPU customer, and we use that clearly as one example. And as always, we have built a diversified business where we donâ\u0080\u0099t always see all of our regions performing at the same pace simultaneously. Certainly, there are times when we see consolidated performance at an elevated level. And yes, weâ\u0080\u0099re still quite confident that all of our regions will -- as the full year evolves, will perform shifting at plan and maybe a little bit better. As you look at supply, it looks like itâ\u0080\u0099s starting to finally ease in certain pockets in areas, especially on some trailing node technology, which should help the auto market, et cetera. As youâ\u0080\u0099re looking or take your own ability to get supply, youâ\u0080\u0099re seeing any signs of things improving. As youâ\u0080\u0099re aware, we are shifting on elevated levels of contracted backlog in other words. So we do have a number of customers that -- that are waiting for their fleet expansion orders and the vehicles themselves to be delivered, and thatâ\u0080\u0099s holding back our ability to roll out these contracted subscribers. And certainly, weâ\u0080\u0099re planning that backlog, our current expectation will be back to normal levels over the next couple of quarters. In terms of component supply, weâ\u0080\u0099ve taken a view to build an elevated inventory level and that has such cash over recent quarters. I think there are a lot of suppliers that are still taking advantage of the situation, kind of trying to force their customers to place orders a year, 18 months in advance. And hence, once weâ\u0080\u0099ve reached the kind of levels that we think is good enough for us to manage our future plans. I think it will happen, and I think it will happen in coming quarters in this fiscal year. As said, we are no longer able to attend next monthâ\u0080\u0099s Canaccord Growth Conference as Iâ\u0080\u0099ve been called out for Federal Jury Duty over this time."
}