{
    "symbol": "DVN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 15:01:01",
    "content": " In 2023, the capital objectives for this asset are to efficiently sustain production through low-risk infill drilling, evaluate resource upside with a handful of refrac test, and generate around $700 million of cash flow at today's pricing. A good place to start is with a review of Devon's 2022 financial performance, where operating cash flow totaled $1.9 billion in the fourth quarter, an 18% increase versus the year ago period. Yes, you're exactly right on the back half of last year as we walked into the acquisitions with the cash outlays there as well as all the noise that you're well aware of related to blackouts during that time period and certainly in the fourth quarter as we we're leading towards year-end, that made it more difficult for us to get into the market. And certainly, our expectation here in the first quarter and moving into the second quarter, is it will look more like the pace that you saw from us in the first half of last year as it relates to the buyback and particularly on days like today where we're trading off relative to the group, that's a point in time where you're going to see us be real opportunistic and aggressive getting into the market and buying our shares back. But certainly, as we refresh contracts in the fourth quarter of last year, walking into the first and second quarter of this year, you're seeing some of that impact, and it's certainly driven that breakeven higher. Now certainly, should market conditions change or something else come to light that might change our point of view, we would adapt and be flexible given the cash balance that we have and the free cash flow we expect to generate and I'll just reiterate something Rick mentioned earlier, which is that's one of the beauties of our financial model is it provides us a lot of balance to do multiple things, whether it's debt reduction, variable dividend, stock buybacks are certainly even evaluate some cash transactions. It's just the math and the function of higher costs as a result of the inflation that we've seen and then the lower commodity prices, which we all know have been -- well, certainly on natural gas have been dramatic, but more so important to us is on oil and certainly on a year-over-year basis, the strip would suggest a lower oil price for this year as it relates to last."
}