{
    "symbol": "TMDX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 21:02:12",
    "content": " All forward-looking statements, including, without limitation, are examination of operating trends, the potential commercial opportunity for our products and our future financial expectations, which include expectations for growth in our organization and guidance and/or expectations for revenue, gross margins, and operating expenses in 2023 are based upon our current estimates and various assumptions. 4Q total revenue was $31.4 million representing 225% year-over-year growth, and approximately 22% growth over the third quarter of 2022. Total revenue for the full year 2022 was $93.5 million, including new products and service revenue of $92.1 million and $1.4 million favorable contour revenue adjustment in 3Q. As we continue to build up our production capacity to meet the growing demand for OCS, we were able to navigate this difficult situation, grow our case volume, and grow our revenue by leveraging the NOP hub network to supply OCS modules to any location across the U.S. to meet the demand using charter flight. In addition, we are â\u0080\u0093 we also expect to benefit from our ability to grow the overall transplant volumes as we have demonstrated early on in 2022 by enabling the use of organs from DCD, extended criteria and distant standard criteria donors that were seldomly utilized for transplantation in the U.S. due to the limitations of historical procurement and preservation methods. That said, based on our 4Q and full year results and balancing these results with the expected finished goods pressures in H1 2023, we are setting our annual revenue guidance for full year 2023 to be between $138 million and $145 million in revenue, representing a strong 50% to 57% growth over 2022 total revenue excluding contra revenue reversal. We strongly believe, however, that we are in the early stage of a long sustained growth period for our business and organ transplantation in general in the U.S. We are now laser focused on scaling our production capacity and NOP clinical and logistics infrastructure to achieve our goals. And maybe if you could just build on comments earlier in the year today and just help us think through because I think some are thinking that the OCS opportunity may be limited or heavily weighted towards the DCD opportunity, but looking at the national database, it seems like DCD organs are still very, very early in terms of the step up in 2022 versus 2021."
}