{
    "symbol": "TMDX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 19:05:06",
    "content": " All forward-looking statements, including, without limitation, are examination of operating trends, the potential commercial opportunity for our products and our future financial expectations, which include expectations for growth in our organization, regulatory approvals and reimbursement and guidance and/or expectations for revenue, gross margins, and operating expenses in 2022 are based upon current estimates and various assumptions. To date, we have unequivocally demonstrated the strength of our NOP program to accelerate commercial growth and OCS adoption. To date, we have unequivocally demonstrated the strength of our NOP program to accelerate commercial growth and OCS adoption. As mentioned, 3Q results continue to outpace our forecasted demand plans and challenge our finished goods inventory. Importantly, we need to allow the proper time to ensure that we are growing our production with the highest quality staff, training and products. During this ramp-up process, we may find ourselves in another backorder situation in 4Q. As mentioned, 3Q results continue to outpace our forecasted demand plans and challenge our finished goods inventory. Importantly, we need to allow the proper time to ensure that we are growing our production with the highest quality staff, training and products. During this ramp-up process, we may find ourselves in another backorder situation in 4Q. So yes, we think the OCS and the NOP are playing a key role in growing the transplant volume by accessing more DCD, accessing more DBD organs, either that are long distance, older age or that normally would not be utilized and through the logistical piece of historical logistical challenges that transplant programs are not able to accept organs while they're busy doing another transplant procedure, today, they can do that. So, we need to just to get the community focus back again on lung transplant and show them the success of NOP in heart and liver and the amount of growth that these organs have been experiencing in the US as a proof of concept that if they can apply the same model, they can achieve the same results, which is growing their transplant volume without growing their workload, without growing their staffing needs."
}