{
    "symbol": "TMDX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 23:18:07",
    "content": " Our goal is to end 2022 with 10 to 12 centers per organ; lung, heart and liver that are routinely using the OCS for their transplants as we've seen in the NOP centers in Q1. And importantly, with excellent post-transplant clinical results, the trial reported one and two-year survival results of 93% in the DCD or OCS, both at one year and two years, compared to 86% and 83%, respectively, in the DCD control arm of standard criteria heart transplanted using cold storage. And revenue outside the U.S. was $2.3 million, that's up 79% from Q1 of 2021 and included $2 million of OCS Heart and $0.3 million of OCS Lung. The National OCS Program, NOP, has shown its potential to drive significant growth for transplants through driving clinical efficiency and adoption by transplant centers in the U.S. Can you looking at the quarter, $15.9 million annualizing, that gets us to $64 million, which is the -- towards the higher end of that guidance. I wanted to start again, just really on your outlook for 2022, but breaking it down into pieces and just how you're thinking about NOP's contributions, really restarting, reaccelerating lung volumes on the on the heels of COVID as well as, as you think about just exiting the year, NOP -- and then you're focused on some of the higher volume centers, how you think about just the breakdown from a key spaces contribution, exiting the year versus what we saw in the first quarter. One of the key elements of NOP that we played, we exploited heavily at the ISHLT is you have now every Tom, Dick and Harry heart transplant program wanting to do DCD heart transplants, or extending to DBD heart transplant using OCS. Another anecdote is one of the key centers in some of the competing technology trials, they became -- again, they never touched OCS, they became one of the major users of the technology, OCS Liver technology in NOP in Q1, and we expect them to grow with us throughout 2022. We had early positive response from leading lung transplant programs, large academic lung transplant programs in this country and we are organizing that movement and we expect that by the end of 2022 -- Q4 2022, we will see tangible growth in the lung volume on OCS predominantly through the NOP."
}