{
    "symbol": "BCS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 16:26:12",
    "content": " In the third quarter, profit before taxes was Â£2 billion, generating a return on tangible equity of 12.5% and an earnings per share of 9.4p. I would like to highlight, in particular, the strength and consistency of our results as we continue to execute on our business. Group income growth was 17% in third quarter year-on-year excluding the impact from the over-issuance of securities, a subject to which I'll return to in a moment. First, in the Corporate and Investment Bank, we continue to gain revenue share in our markets business, driving the best Q3 income in both markets and fixed income, FICC, in recent years. Notably, our FICC performance was particularly strong and ahead of our U.S. peers with income up 63% in dollars as we supported our clients in very challenging markets. In Barclays U.K., we positioned ourselves well for rising interest rates with a growing contribution from our structural hedge as we locked in higher yields. Within the Consumer Cards and Payments business, growth in our U.S. Card balances was delivered by a recovery in spending and the first quarter of our partnership with GAP, which is starting to show results. Taken together, both balanced growth and the management of our sensitivity to higher interest rates contributed to significant growth in the net interest income for the group. And finally, whilst we are a U.K.-domiciled bank we have a truly global footprint, providing attractive exposure to the U.S. economy with over 40% of our group income generated in U.S. dollars. While our income story paints a compelling picture, we remain, however, cautious about the macroeconomic outlook globally, and have been approaching it accordingly over the last year. In fact, we have been prudent in our balance sheet management for many years in particular since the days following the EU referendum in the U.K. We have reviewed our corporate loan portfolios, particularly in more vulnerable sectors, reducing exposure and managing our risk by acquiring significant credit protection. As with many of our peers, we have taken markdowns in some elements of our syndicated loan book, but here, too, we have been managing our risk prudently and increasing our batches. In our U.K. credit card portfolio, our balances remain some 40% below pre-pandemic levels. And while our U.S. credit card portfolio has grown, credit quality remains very strong, and customers continue to repay balances at near-record levels. So far, we have not seen emerging signs of stress, although our September data showed a slight fall in consumer confidence. People are being prudent with a reduction in nonessential spending, such as clothing, as they adjust their household expenditure for large increases in utility bills. We know the demand for this customer support is growing, and we aim to hire nearly 1,000 more people in the coming weeks to boost that capacity. We have resolved the matter with the SEC, and the total financial impact was broadly in line with what we disclosed at the second quarter. Before I conclude, I want to give you a brief update on one of our strategic priorities which is capturing opportunities from the transition to a low carbon economy. In our year-end climate update, we expect to bring forward the phase out date for financing thermal coal power in the U.S. from 2035 to 2030 in line with our approach in the U.K. and in the EU. And demonstrating Barclays' leadership in the energy transition, we are very honored and pleased to act as the sole M&A adviser to Con Edison based in New York on the announced $6.8 billion sale of their clean energy business to RWE based in Germany earlier this month. So in conclusion, Barclays has had a strong third quarter financial performance, building on our performance in the first half of the year. Our capital position is robust with a CET1 ratio of 13.8%, which is comfortably in our target range of 13% to 14%. Our announced total capital return for the last 12 months, comprising both dividends and buyback is a yield of about 10.5% on the stock at current share price levels. As I have said consistently, returning excess capital to shareholders remains one of our priorities. Q3 was another quarter of delivery across our businesses, contributing to a year-to-date statutory RoTE of 10.9% despite elevated litigation and conduct costs. The CET1 ratio ended the quarter at 13.8%, and we remain highly liquid and well funded with a liquidity coverage ratio of 151% and a loan-to-deposit ratio of 72%. As expected, the net profit effect of the over issuance in the quarter was immaterial. However, there were offsetting effects on income and costs, and there's a slide giving the details in the appendix. As in recent quarters, this robust performance is being driven by broad-based income momentum. However, operating costs which exclude LSC, were up by 14%, reflecting our focus on positive jaws. Both income and cost numbers are, of course, affected by the stronger U.S. dollar. Impairment was Â£381 million, up from Â£120 million last year, and I'll say more about provisioning and our coverage level shortly. In the Investment Bank, whilst the market environment for primary assurance remains challenging, that same environment is driving high levels of client activity across both financing and trading in the markets businesses. So in the CIB, income grew 5% against a strong comparator with markets up 22% in U.S. dollars, more than offsetting the reduction in banking. Clearly, the volatility across global markets provides a tailwind for this business as we help clients manage their risk. Fixed income financing balances are up over 30% year-on-year, and margins have widened as rates have risen globally. Whilst derivatives were weaker, the year-on-year growth in our equity financing income provides a good base for sustainability. Overall, our Q3 share of wallet and markets has increased by over 100 basis points year-on-year compared to peers who have reported so far. Investment banking fees were down 54% in U.S. dollars, broadly in line with the reduction in the industry fee pool. Although corporate income overall was down 17%, the strong growth in transactional banking significantly offset the corporate lending income expense. Income in CC&P increased 54%, reflecting strong growth across all 3 constituent businesses and including the effect of the stronger U.S. dollar. In International Card, income was up 68%. In contrast to the U.K., we grew average balances strongly in the U.S. by around 30% or $6 billion year-on-year, both organically and with the $3.3 billion GAAP book. In payments, income grew 15%, and the Private Bank achieved 44% income growth with the continued build in client assets and liabilities up 14% to Â£138 billion. Barclays U.K. grew income by 17%, notably in Personal Banking where earnings on deposits in the rising rate environment more than offset very competitive mortgage margins. Before I talk about interest rates, it's worth noting that our franchise is a global one with a little over 40% of income in U.S. dollars. Clearly, this has an FX translation impact but more importantly, demonstrates our exposure to the U.S. economy and capital markets. Moving on to the effect of interest rates, we have maintained a consistent hedge strategy for a number of years, the aim of which is to smooth the impact of the interest rate changes on net interest income. Each month, we currently roll 4 to 5 billion of the hedge, mainly into 3- to 5-year rates. The consequence of this is that Barclays has sensitivity, not just a base rate, but also to the yield curve. In year 1, the majority of the sensitivity comes from product decisions around the pass-through of increased base rates to customers. But thereafter, with a cumulative effect of the hedge rolling on to higher rates, the hedge impact becomes more significant and reaches around 2/3 of the  increase by year 3. On the right-hand chart, we have shown the actual impact in recent quarters. Given the recent move in the yield curve, we were locking in an average 5-year swap rate of 3.05%, for example, in Q3 following the average yield on the hedge up to 93 basis points. Although we don't know exactly where swap rates will go, the likely uplift on the current hedge yield is clear, even if the rate cycle is shorter or shallower than current expectations. Looking now at costs, the Q3 figure was Â£3.6 billion, but this is net of a reduction in over issuance costs of Â£0.5 billion. Excluding that, costs would have been Â£4.1 billion, up from last year's equivalent of Â£3.5 billion. Operating costs, which exclude L&C, increased 14% against income growth of 17%. Around 30% of our costs are in U.S. dollars, so the 14% change in the U.S. dollar rate year-on-year has a significant translation effect. Assuming an average dollar rate of  for Q4, we expect total operating expenses for 2022 to be in line with our previous guidance at around Â£16.7 billion with a tailwind from both net L&C credit of Â£0.3 billion in Q3 being broadly offset by the stronger dollar and other cost inflation. I'm not going to give absolute cost guidance for 2023 at this stage, but we will continue to manage the trade-off between cost efficiencies and investments. Of course, a strong dollar will affect the sterling cost figure, but with over 40% of our income in U.S. dollars, this is positive for the cost income ratio. We manage our statutory costs, which include litigation and conduct charges and are very focused on generating positive jaws on a statutory basis. But before I look at how this affects impairment, I want to summarize briefly the evolution of key portfolios in recent years. The U.K. mortgage book has grown by 13% since December 2019, but the average loan to value has declined, and only 2.3% of the book has an LTV over 85%. Whilst repayment rates have also been high, we are growing balances, including through the launch of the GAP partnership. However, the quality of the book as measured by average FICO scores has improved and arrears rates are still below the pre-pandemic level. Wholesale balances have increased recently, but the majority of the growth has been in debt securities, collateralized lending to financial institutions and the lower risk areas of corporate lending. In addition, we have increased our first loss credit protection over the corporate loan book, thereby reducing our exposure to loan losses. 35% of this book is now covered by some form of protection, up from 26% pre-pandemic. As you can see on the next slide, our title impairment allowance was Â£6.4 billion, an increase in the quarter from Â£6 billion. For example, modeling baseline U.K. unemployment of 4.4% in 2023, up from 4.1% and U.S. unemployment of 4%, up from 3.5%. Applying these maths to the Q3 balance sheet had an effect of around Â£300 million, but we created the PMA for economic uncertainty to capture this type of deterioration. So in the quarter, we have released around Â£300 million of the PMA balance. Therefore, the model's allowance plus the economic uncertainty PMA is roughly flat quarter-on-quarter at Â£5.2 billion and covers the further modeled increase we would see if we were to use our Downside 1 scenario. Although coverage ratios overall are slightly down on pre-pandemic, we have increased coverage for Stage 1 and Stage 2 credit cards, as you can see in the appendix slides. Ignoring the volatility during the pandemic, you can see that it has been around 50 to 60 basis points. Although this is sensitive to the portfolio mix, we think it's a reasonable range to be considering for us through the cycle loan loss rate. In Q3, this was 36 bps and the charge was Â£381 million, and we expect this to rise modestly over the coming quarters as we grow. This is obviously subject to further potential deterioration in the macroeconomic outlook beyond that, which could be offset by the uncertainty PMA balance of Â£0.7 billion. In CIB, income grew 5% against a strong comparator. I focused on the key drivers earlier, but I wanted to go into a bit more detail here on the corporate income. Transaction banking was up 57%, reflecting strong NII growth, and we would expect further growth in Q4. Operating costs, which exclude L&C, increased by 17%, reflecting the 14% appreciation in the U.S. dollar, and investment in talent, systems and technology to support income growth initiatives plus the impact of inflation. The cost income ratio was 62%, excluding the effect of over issuance. Overall, the CIB generated a statutory RoTE for the quarter of 11.9%. The franchise is developing well and over half of the income is dollar-based, reflecting the strength of our position in the largest global capital market. Income increased 54%, reflecting growth across international cards, payments and the private bank, as I mentioned earlier. Total costs were Â£835 million, which included Â£102 million of litigation and conduct, mainly in respect of our review on legacy loan portfolios. Excluding this, the increase in operating costs was 30%, principally investment in the growth of partner brands in U.S. Cards and the dollar strength, but still delivering positive jaws. As balances grow, we do expect some stage migration but risk metrics remain below pre-pandemic levels. Our costs were up 2%, delivering strong positive jaws and reducing the cost income ratio by 8 percentage points to 56%. The NIM for the quarter was 301 basis points, up 30 basis points from Q2 as we saw benefits from rate rises, and we've shown a bridge on this slide analyzing that. The cost phase that we flagged previously provides significant offset to cost inflation, and we're keeping a tight control over credit risk. Turning now to capital, the CET1 ratio ended the quarter at 13.8%, an increase from 13.6% at the half year and comfortably within our target range. Our capital generation from profits was strong, contributing 43 basis points. We completed the half year buyback, returning capital to shareholders and further reducing the share count to 15.9 billion, but down 1 billion in the last 12 months. Combined with the dividend paid and accrued, this was a return to shareholders of 22 basis points. Over time, increases in interest rates are a tailwind to profitability, but the effect on reserves from market movements caused a headwind of 12 basis points in the quarter, principally through the fair value effect on bond holdings. The completion of the rescission offer and termination of related hedges released RWA, increasing the ratio by 17 basis points. FX had little net effect given our policy of hedging the ratio with an increase in RWA, but also a positive effect on the currency translation reserve in the numerator. Our MDA Hurdle was 10.9%, so we have comfortable headroom. TNAV decreased 11p in the quarter to 286p per share, reflecting the effect of increased interest rates, partially offset by earnings and the benefit of stronger dollar on reserves. Finally, on leverage, our spot leverage ratio was 5%, and the average leverage ratio was 4.8%. We are well provisioned in readiness for potential deterioration in the macroeconomic environment, but expect a modest increase in quarterly impairment charges over coming quarters as we grow. Overall, the business performance is robust, and we remain focused on delivering our target of double-digit RoTE this year and on a sustainable basis going forward. One question on costs and other on asset quality, please. On costs, I heard you, Anna, saying that you're not going to talk about 2023, and I don't expect you to give a hard number. But if I take your guidance for this year, it looks like operating expenses are annualizing north of Â£16 billion, considering there's inflation, likely inflation, and consensus is closer to Â£15 billion, so there's a significant delta. Obviously, there's been some changes in the mix increasing sort of retail cards in the U.S. and shrinking the U.K. And related to that, in your Downside 1 scenario, I think you've got accumulated almost 20% correction in house price. As we look forward into next year, here's kind of how I'm thinking about it. We would expect that given we've seen elevated levels of L&C this year for that to be considerably lower, however, the FX impact that we've seen intensifying through the year, you might expect annualize into next year. But what we have to remember is that, that has a greater impact on the income line. So as you're updating your cost expectations, I would encourage you to think about the FX impact in income as well. As it relates to other factors, clearly, there is inflation, but you've also got the investment that we focused on our 3 strategic priorities. In terms of actions, we could clearly modify that investment plan, but to the extent that we feel that it's driving revenue growth, obviously, we'll be thoughtful about doing that. So I would say, consider the impact of efficiency programs there. I mean, obviously, also, if we see a drop in CIB revenue, we've got another lever in comp. But overall, I'd just leave you with a message that we're very focused on the RoTE target and very, very focused on delivering positive jaws. In terms of asset quality, it's difficult to give you an adjusted version of that historic number. But at the same time, you can see that the level of risk that we're holding in the balance sheet versus pre-pandemic is lower. And well, to some extent, we're going to have to see how that pans out. So it's lower because LTVs are lower, and actually, if you look at the staging, you can see that the proportion of Stage 1 and 2 balances is also considerably higher than it was pre-pandemic. And to your final point, we haven't seen  in our RWAs yet. If there was a substantial decrease in HPI, we would expect that to impact the loss given default in our capital models, and would lead to some RWA pressure. And they equally remember that within there, there's the probability of default piece as well. You already answered my question on the FX sensitivity there, on revenue versus costs. But I guess just on capital return, Venkat, I think you've spoken earlier this year about the conversion of earnings and the buybacks, and you did Â£500 million at Q2. Yes, there's some headwinds coming in Q4 from pension at Kensington, but another Â£500 million, I don't know, what is 14, 15 bps of capital. Joseph, it's a position which we will take in Q4. I mean, basically, that's it. A couple of questions, one on the hedge and one on these fair value movements, if that's okay. The hedge, there was another Â£10 billion, I think, added to the notion in Q3. But clearly, in the U.K. bank, deposits haven't grown now for 3 or 4 quarters, but the hedge is still building. The second question, the fair value movements through OCI, particularly regard to the debt portfolio. It actually relates to -- because your rate -- central bank rates have gone from negative to positive, it's a change in eligibility. So you're right, U.K. liabilities are broadly stable. We are seeing some take-up of savings products, but actually in a positive way and in a way that's completely in line with our expectations. And all of that within our rate -- sorry, our hedge assumptions and the way that we created a buffer in that hedge. As it relates to your fair value through OCI question, I can see why you might have expected a larger impact. What's going on here is, firstly, the disclosure in the annual report actually includes not only the liquidity buffer but shows the impact on the pension fund assets because the pension is in surplus, those movements are obviously neutral to capital. Just on, I guess, I mean, you discussed, Anna, in your comments that volatility is particularly heightened at the moment and you'd expect these trading revenues overall to decline over time. So in terms of helping us to think about the offsets to that, you mentioned FICC financing. And then more generally, just how we should think about CIB revenues over the medium term versus very strong revenues for the last few years. I don't know if there's anything that you'd want to highlight there, in particular. And then back on your Downside 1 scenario, you've already talked about the sort of 20% HPI impact. So if I understand correctly, your current reserves effectively are equivalent to something like a 2.5% GDP contraction, 6.5% unemployment and 18% to 20% HPI. Okay, I'm sure there's at least 2 questions if not a little bit more, but I'll let you get away with that. After proportions, that will move around a bit depending on what's going through trading. But more broadly than that, I think even in the flow side of FICC, we are seeing increased share pretty much across markets now. We think that's as a result of our client focus, but also the investment that we have put in the infrastructure and the talent in that business. So you're right, when volatility recedes, we might expect revenues to drop back. Well, there's clearly banking is having a quieter period right now. Volatility in the market gives us elevated market revenue, depresses banking. Transaction banking is a stable franchise business, but one that is also benefiting from the investment that we've put behind it. You're seeing balances grow, you're seeing margins somewhat wider, but also through kind of nominal economic activity is staying sort of trade , FX, et cetera, goes through there in fees. So whilst individual pieces might drop back, Rohith, we do have, I would say, increased confidence in the whole. Venkat, before I go on to U.K. Cards, is there anything you would add for U.S. Cards? Yes, I think I would echo what Anna said about confidence in the whole. I think as rates have risen and spreads have widened, system cum financing, not just balances, but profitability per unit of balance has increased. And it's long been part of the DNA of Barclays, we've got a market-leading position in this area. But I think look to this in this kind of environment to provide an increasing -- I mean, a strong amount of balance to our returns. We wouldn't give that out on a call like this, Rohith. We'll continue to consider our disclosure around FICC and indeed the other parts of the market, and we'll come back to you on that. But people are spending more, we're seeing organic growth. Given that movement from a very, very low base, we would expect to see some movement in staging and some movement in delinquencies. Unemployment at 3.5%, and we're still seeing strong levels of repayment across that book. I would -- so let me move on to your final part, which was around the disclosure on Downside 1. So yes, what we've done is we've shown you what would happen if we weighted 100% to Downside 1 scenario. So 6.5% unemployment in the U.K., for example. So you're right, that's the comparison we're drawing. So in other words, if we saw Downside 1 pan out exactly as we show it in that model, then we would expect to cover it with the PMAs. I've also got a follow-up question on the Downside 1 scenario, and a second question on bank taxation. And I think we can more make kind of assumptions of various downside cases, but GDP down to unemployment of 6%, probably not as bad as you can imagine things, but it's probably a reasonable downside case for now. I guess the question is that with interest rates where they are, could that affect the ability of otherwise performing exposures to pay. And then the second question on bank taxes, obviously, there's a bit of discussion around where the surcharge is going to be set. So for example, in the U.K. -- in the U.K. retail bank, we are holding a sort of general economic uncertainty PMA, whereas in the wholesale side of things, we have much, much more sector-specific. And in relation to Downside 1, I mean you're right, no model is ever perfect, and I'm going to hand to Venkat in a moment because I know you'll have a view. And so there is clearly an impact on affordability from inflation and from interest rates, which is difficult for those models to represent. So when you look at the Stage 1 and 2 provisioning across the unsecured books, in particular, that's how we're trying to protect ourselves against that. But it's sort of -- we're also looking at signs of consumer behavior, and we will make adjustments to that. But I think you've got to expect all other things being equal, that we would look at it the way we did this quarter. And so we'll wait for the budget statement to know what it is and on reserve tiering, I think the Bank of England has been fairly clear that they don't believe in reserve tiering as tool of monetary policy. That's much, much appreciated. If I could just invite you to talk about your view on returns into next year, please. You've had a very long-standing, greater than 10% RoTE target. You're expecting to deliver that this year despite obviously the shelf over issuance charges you've taken, which you're not expecting to repeat next year. You've got a meaningful FX tailwind, per your earlier comments, looking into next year. And then on the structural hedge, obviously, we've had years of growth in the structural hedge. Do you expect your structural hedge notional to shrink in the coming years, please, do you expect that size to be coming down as the yield is in... Okay, so on returns, you're right, we've made good progress towards that target for FY '22, and we delivered greater than 10% in FY '21. And you can see that for a few quarters now, that's where we've set our expectation. But given the effect on reserves of some of the macroeconomic volatility that we've seen, that TNAV number is moving around quite a lot. It's probably moved significantly since the quarter end, again, I would think. You're right that we said it in 2017 is a medium-term target, and I'm glad we've lived up to that medium-term target. So when we put the structural hedge together, Chris, you'll note that we've done it over a series of quarters. We've been very thoughtful about how we've built the hedge and at all stages, we've assessed the outflow risk versus the opportunity cost of not putting their hedge on. If that proves to be wrong, obviously, we are rolling a portion of the hedge month-by-month as well. But to date, the moves that we've seen have been in line with our expectations, and we did build it conservatively, we believe. So as we scale the hedge, we identify what we believe are rate-sensitive -- rate-sensitive balances. So in part, yes, clearly, not the specific rates that you've quoted their rates are moving all the time. And actually, we're seeing a little migration and in fact, thought to be no migration out of the bank and migration within our expectations to those products. So I mean, that's probably where I'd leave it, Chris. Let me try to take the first crack at it, and I'll ask Anna to join in, good questions all. First of all, on mortgages, we've got a very large mature book. The way the U.K. market is with a combination of 3-year and 5-year effects, about 30% of our mortgage book will refinance over the next year, let's say, by the end of 2023. And so what that does, and to part of your other question is, obviously, when we do issue mortgages, we do stress them with a fairly big shock in interest rates in terms of affordability. So the combination of that and the fact it's about 25% to 30%, I think mutes its impact on its portfolio. It represents 20% -- 20 basis points, sorry, of our total balances. But you are seeing it, which is good from a credit quality point of view, but it's also prudent financial management, as you might expect. So I think broadly, the behavior is, as you would expect it in an environment like this. And the other thing I would say is that given the house price inflation we've seen over the last few years, the LTV of the customers coming to refinance now will be lower than it was when they took out their mortgages. And that might be part of the incentive that's behind the overpayment trends that we see right now, the opportunity to sort of move yourself down an LTV bracket. From here in, in terms of sort of loans growth, I would say this feels like a remortgage market rather than a house price market. That will necessarily lead to lower net growth, I would think. In terms of sort of the rest of loans growth, I mean you can see from repayment rates that we've sort of talked about in cards, IEL growth, the interest-earning lending growth in cards will probably be a bit sluggish as well. But given where we are in the credit cycle, I think we're okay with that. And similar in deposits, in comparison to what we saw during the COVID period, we've already seen that slow down a bit seeing a bit of migration, but within our expectations as customers putting that money to work, whether that be in savings or indeed through mortgages. Card growth in the U.K., I would say -- so let me distinguish 2 things. I think headline growth or headline balances may grow, but that's in part our strategy. We are trying to pivot the book towards spend rather than lend, our newer way of product is doing pretty well in terms of take up. What I'm trying to do in my mind is I'm just trying to square your comments at the beginning about the outlook for the U.K. and the demand in an uncertain environment, and I guess that's sort of consistent with what consensus is viewing the U.K. with your comment that you expect provisions to normalize because it seems to me those 2 are inconsistent. Or potentially, we could see provisions go somewhere above normal because the environment is not normal, I guess, I suppose that would be my first question. If you hadn't released the Â£300 million PMA, sort of override, your charge this quarter would have been about 70 basis points. I know it's not really part of the quarter, but I'm thinking we saw this big uptick in mortgage costs really just over the last month. Or just something that's very specifically in the last month really since the results end rather than during the quarter, if that would be okay. However, what I would say is that, that's exactly why we established the PMAs in the first place because we felt that the economic environment was extremely uncertain and that the consensus that we were using for the models did not adequately capture the best that we have. So that's what we expect it to happen, that is what happened. And therefore, that's why we released the PMA. In relation to your credit question, I think I followed it. There's a bit of a dichotomy here between what we see now on the ground, no visible stress and the macroeconomic forecast and indeed beyond those macroeconomic forecast into some of the economic commentary. But to a certain extent, it points to the conversation we had before, which is we would expect to trend towards a through-the-cycle cost of risk. But if we are to see macroeconomic shocks in terms of expected environment, in 1 direction or another, I would expect that to be lumpy. Let me take the other question about what's going on in the front line, especially since the end of September. And the -- outside of the capital markets, there was a bit of a rush for people to adjust their mortgages fearing even higher rates. On the consumer -- on the credit side, what I would say is initial conditions coming into this has been very strong. So a high consumer balance sheet, high amount of support that people have experienced in COVID, low unemployment which continues. And then, obviously, higher energy prices, but increased government support to manage those energy prices. So with all of that and with our rising cost of living and then at the end, higher mortgage rate, we're seeing a little bit of decline in consumer confidence in our own private pooling of it. We see people being more careful in their spending and the management and certain nonessential types of spending, but we are not seeing credit stress. About 1% of our customers are in financial assistance, which is a fairly low number. Obviously, we have to be cautious because we don't know how much deeper some of these things can get. We are in the middle of a rate rising cycle, which just generally tends not to be good for growth. I guess, you've given a bit of a flavor around why you're happy to see sluggish growth given the backdrop. Obviously, there's a lot of volatility on mortgage rates given where stock rates have moved. And I know you've reduced the weighting for downside scenarios in the IFRS models, you might expect the opposite. But in coverage terms, I think most would say things have got worse, not better than the last 3 months for, say, mortgage debt service ratios, et cetera. So in terms of, I guess, lending demand, lending supply and how that plays into margins specifically in relation to mortgages. We've seen it move in line with the yield curve, and we'd expect it to do that. So we'd expect margins to be quite keen not only on the front book, but that will create some churn pressure I would expect also. As it relates to sort of credit expectations and how that plays into pricing, I mean, I would expect that market participants price for us through the cycle view of risk. So increased sort of credit concerns sort of per se, I wouldn't expect it to impact pricing significantly. In terms of your sort of coverage point, I think we believe that our coverage is appropriate. You've obviously seen it go up from Q1 -- sorry, from Q2 to Q3 in terms of our early-stage coverage in unsecured, in particular, that we feel like we're appropriately covered there. We are dealing with models that tend to be procyclical and which has been built on a period, as Anna mentioned earlier, of generally falling rates and falling employment -- unemployment. So we have to recognize the weaknesses in the models we use, and that's what we've tried to do. And I think using the combination of the 2, try to manage it in a predictable way related to the environment that's outside. I think if you look at the balance sheet on aggregate, Guy, what you can see is that we've got Â£6.4 billion of provisions, Â£2.4 billion of that relates to defaulted stock. And that's in an environment where, as you can see from the chart that we showed in the presentation, we strongly feel that the quality of the book that we have in terms of the risk on it or its shape is lower than it was. And indeed, in wholesale, we've increased the level of first loss protection. Yes, the third question, sort of follow-on, was just around how stage migration is embedded into the ECL disclosure you give for downside scenarios, just to sort of gauge the relative conservatism of the ECLs that come out and sort of comments around you could switch the PMA to absorb the Downside 1 scenario. I'm sorry, I still don't understand your question. I know you've had the roll-off of the ETN hedging, but RWA generally just look quite light for the quarter. I know you mentioned kind of you're adding credit hedges on the wholesale portfolio, whether that's had an impact. And then as a follow-on to that, clearly, you guys are involved in a big leverage finance deal, headlines suggest that might end up on your balance sheet. Okay, in relation to capital management in CIB, we're just very disciplined. And I would say through the quarter, we've been helping facilitate client business in terms of what we've been holding on our own balance sheet is actually being handled extremely conservatively. So as far as the leverage finance business goes, we've always run a fairly systematic approach to managing the risk and deleverage finance book. But let me say generally that, that risk management has 2 parts to it. And the most recent time that, that's really protected us quite well was during COVID when you had obviously fairly rapid movements within the month of March 2020 and then back in April. The second way is occasionally for what might be large exposures, trying to see if there's a way, again, to protect ourselves against extreme moves in that. The first one systematically, the second one opportunistically to try to manage the risk in our leveraged finance book. Well, there'll be an RWA impact in the -- sorry, an FX impact in that. In terms of sort of corporate lending, by the time you sort of strip out the FX, it's not significant particularly. And the increase in the wholesale lending that we've seen has been largely to sort of investment-grade businesses, existing clients, nothing of concern. And what proportion of your broker mortgages and your credit card book in the U.K. to lower household income , so if we can get an idea of how cost of living impacts the book that way around? And then secondly, in Barclays U.K., you're still seeing decent growth in noninterest income. So if I see a decline in real household spending, will that number come down or will the inflation and the nominal growth still see growth in noninterest income for U.K. retail business? However, like all banks in the U.K., we have some regulatory limits on higher loan-to-income. In terms of cards, again, we wouldn't disclose that in particular. What I can tell you is that repayment rate across the risk deciles are all elevated so even in what we would describe as lower deciles of risk, repayment rates are significantly in excess of the monthly contractual payment and significantly in excess of what they were pre-COVID. In terms of noninterest income, I mean, that is geared in part to card fees and also interchange fees. So to the extent that customers continue to use their cards, but pay them off, we might expect those trends to continue. If we were to see customer spending for shop, then obviously, that number would go down. And the reason I ask that is when rates -- when time deposits rates is this high, time deposits are around 50% of all savings pre-financial crisis. At that point, your hedge is probably running more like Â£100 billion rather than Â£260 billion at the moment. Okay, so on the NIM guidance, we have guided towards the top end of the range that we gave you of 2.80% to 2.90%. Firstly, the NIM year-to-date, but obviously, that hedge picked up. And the reason that we have split out the 2 impacts that we've shown you there, so the hedge movement and then the product impact is we said for some time that we expect the product dynamics, as rates started to rise, would become less beneficial for NIM. It's actually about the dynamic that your second question points to, which is customers moving their savings. And secondly, the compression and the competitiveness that we see in the mortgage market. In terms of your second question as to why things might be structurally different, I think there's 1 macro piece and then there's 1 probably more bank structure piece. And I would also say that banks, retail and corporate banks, in particular, are in a materially different position liquidity-wise versus where they were pre . So there, you had loan-to-deposit ratios of well over 100%, that's relying on term deposits as a source of funding. I think here, what you're seeing is term deposits as a franchise offering, that's a different mechanic. But I would say there are structural differences to the macro and also the way banks are constructed versus sort of 2005, '06, '07 and beyond."
}