{
    "symbol": "BCS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-15 10:06:05",
    "content": " In the Corporate and Investment Bank, we grew income year-over-year and delivered a double-digit RoTE. I want to highlight our Global Markets business, which has managed risk very adroitly through a volatile year and continues to gain not only the market share with clients but mind share with them as well. Our Consumer Cards and Payments business grew income across each of its components, which is payments or Private Bank and U.S. cards. In U.S. cards, our new partnership with Gap has helped to drive strong income and balance growth and scale to the business by doubling our total number of end customers. As our sensitivity to interest rates has driven higher income, our investment in efficiency programs have enabled significant cost control and positive jaws. More broadly, we have managed our costs in a very disciplined way across the group, and we maintain a cautious approach to both the macroeconomic environment, how we position our balance sheet throughout the year and how we continue to do so. Finally, our organic capital generation from profits has enabled continued distributions to our shareholders. I want to use this opportunity to review our progress against our 3 strategic priorities, which we laid out 1 year ago. Although much has changed in the world, in the U.K., in the U.S. since last year, our priorities remain appropriate and fitting to the environment in which we operate today. Against the first priority, which is the delivery of digital financial services, we took several important steps in 2022 to broaden our capabilities and our product offering. In the U.K., investment in digitization is a core part of our Barclays UK transformation strategy, both helping simplify our products and driving improved efficiency. The ability to offer help online also benefits our customers, with nearly 0.5 million using our banking app to manage their mortgages, for example. From April, when that functionality was added to the app, over 8,000 mortgage holders chose to switch their mortgage rates with us online within 4 days of a base rate change. We now expect to complete the acquisition of Kensington Mortgage Company, a specialist mortgage lender, in the first half of 2023. In the U.S., our partnership with Gap has broadened our product offering, opened up a meaningfully new addressable market for us in retail partnership cards and provided us with scale and further growth opportunities. Our second priority is to deliver sustainable growth for the Corporate and Investment Bank, the CIB. We have invested in the CIB consistently over many years in our technology, our people, our capabilities, our product offerings and our focus on our clients' needs. As a result, we have built a globally competitive business that is now delivering attractive and sustainable returns. In 2022, we managed our risk well, not just in Q4 but throughout the year as we supported our clients during periods of high volatility, and the diversification, which we have built within the CIB has proved valuable as we grew our broad overall income. Even though Investment Banking activity was subdued, we have continued to invest appropriately in talent, so we are prepared for the future. Our Global Markets business performed strongly relative to our peers, and it has consolidated increases in market share and positioned us well for the future. And I will talk more about how investment in the financing businesses, which are part of Global Markets, has helped to provide a more stable income stream along with intermediation even in periods of low volatility. Recent examples of our assistance to clients include, as I mentioned in our Q3 earnings call, acting as sole M&A adviser to Con Edison on the $6.8 billion sale of their clean energy business; more recently, acting as lead left bookrunner on Portland General Electric's $500 million green financing equity offering for the construction of a wind energy facility and other renewable investments. The first is facilitating sustainable finance, and the second is investing in sustainable technology start-ups. As we finance the transition, we have announced a new target to facilitate $1 trillion of sustainable and transition financing between 2023 and the end of 2030, and we are on track to meet our target to deliver GBP 100 billion in green finance, well ahead of the 2030 target date. Our commitment of sustainable impact capital has generated substantial demand, and in December, we announced we would increase our investment to GBP 500 million by 2027. This investment will have an enhanced focus on decarbonization technologies, including carbon capture and hydrogen. When we set out to build a diversified bank at Barclays as a management team in 2016, none of us imagined the sheer rate and magnitude of change which we would go through in the next 7 years. Our businesses, I'm happy to say, are performing well individually, and they fit well together. While our performance in 2022 was very gratifying overall, it was marred by the over issuance of securities in the U.S., which I have discussed previously. In summary, we have achieved a great deal this year, reaching our financial targets for the group and supporting our customers and clients. As Venkat mentioned, it was another year of delivery across businesses, with a statutory return on tangible equity of 10.4%. Income growth of 14% outweighed the 6% growth in operating costs, which exclude bank levy and litigation and conduct or L&C. Despite the increase of GBP 1.2 billion in L&C, profit before impairment was up 9%, with a statutory cost-income ratio of 67%. EPS was 30.8p, and our total distributions in respect of 2022 dividend plus buyback will be equivalent to 13.4p as we balance investing for growth with returning capital to shareholders. Our U.K. retail and business bank, Barclays UK or BUK again delivered strong double-digit RoTE at 18.7%. Our international consumer business, Consumer Cards and Payments, delivered 10% RoTE despite elevated legacy L&C charges, and we invested in growth. I now want to highlight the main drivers of income, costs and impairment. First, strengthen income, not just because of diversification but because of performance. I'm going to focus particularly on market, which has outperformed global competition in FY '22 because we have invested and been committed. Second, our cost strategy to grow the business and drive efficiency. And third, our risk management across retail, wholesale and interest rates, including the structural hedge and the liquidity pool. Income in CCP increased 35%, including the effect of the stronger U.S. dollar. Within this, international cards was up 39% from balanced growth. U.S. card balances were up by around 31% or $7 billion year-on-year, both organically and with the $3.3 billion Gap back book. Payments income grew 25%, and the Private Bank grew 30%, again, benefiting from increased rates but also from an increase in client assets and liabilities by 10% to GBP 139 billion. Within this, corporate was up 2%, with growth in transaction banking, offsetting the corporate lending income expense, which included marks on leverage lending and higher costs of our increased credit protection. Investment Banking fees were down 46% in U.S. dollars, in line with the industry, reflecting the challenging environment for primary issuance of M&A. Markets, by contrast, was up 24% in U.S. dollars with a standout performance in FICC, up 48%. Clearly, volatility provided a tailwind as we helped clients manage their risk and the business managed its own risk well. Whilst derivatives were weaker, our equity financing income continued to grow. In markets, we buy and sell securities and derivatives for clients and earn a bid offer spread or commission income for this intermediation role. We also finance client portfolios, lending against trading positions, appropriately margined and at conservative LTVs. As a result, whilst we have long been top-ranked in fixed income financing, we are now also top 5 in prime services. With investment in robust technology and risk management, this is good business for 3 reasons. First, intermediation income goes up and down with volatility. Whilst financing will also fluctuate to some extent with the leverage needs of our clients, it has a more stable base than intermediation. Second, having a strong financing capability complements client intermediation flows, whilst they trade with you also tend to finance with you. Finally, financing, if prudently margined and carefully structured, is relatively RWA-efficient and, therefore, generates an attractive return on capital. We manage the business with an integrated approach across fixed income and equity financing, allowing our multi-strategy clients to realize cost savings. Consequently, an increasing amount of our markets income now comes from financing across FICC and equities, and this has grown at a 16% CAGR over the last 3 years. Financing is only part of our multiyear investments in technology and talent across markets, expanding our product offering in line with our clients' needs and growing market share. As a result, we have outperformed all but 1 of our top 10 global peers since 2019, with 114 basis points growth in revenue share. Market conditions have varied over this period, so this multiyear share gain illustrates strength across our asset classes. We believe that with continued investment in human and technological capability, good risk management and strong offerings across trading and financing, we can continue to gain sustainable share in the market business. Moving on from market, I want to remind you of our interest rate sensitivity, which underpins the income momentum from our consumer and corporate businesses. As I've highlighted before, a lot of this comes from the role of the structural hedge, as you can see on the left-hand chart. Although the long end of the curve has moderated from the Q4 average, reinvestment rates on the hedge roll are still well above the average yield and the yield on maturing hedges. Although the size of the hedge was marginally reduced in Q4, we have over GBP 50 billion maturing in 2023 and expect to reinvest a large proportion of that. As guided, costs were GBP 16.7 billion. This includes L&C of GBP 1.6 billion, an increase of GBP 1.2 billion year-on-year. Costs, excluding L&C, were GBP 15.1 billion, an increase of GBP 0.9 billion. With around 30% of our costs in U.S. dollars, this increase is due to the stronger dollar year-on-year and inflation. Our statutory cost-income ratio was 67%, flat on 2021, significantly affected by the elevated level of L&C. Excluding L&C, net cost-income ratio was 61%. Looking forward, movements in the U.S. dollar will affect our sterling cost print, and 2023 costs will reflect further investment in growth and the continuing effect of inflation. The dynamics of this will vary by business, with growth opportunities at attractive returns more concentrated in selected areas of the CIB and in Consumer Cards and Payments. In the U.K., the focus is more on transformation, with efficiency savings to fund continued investment in digitization, and we are aiming for a significant further reduction in the cost-income ratio in 2023. We manage total costs, including litigation and conduct charges with the aim of generating positive jaws on a statutory basis and are targeting a cost-income ratio in the low 60s this year as we progress towards our longer-term target of below 60%. This increased model impairment by circa GBP 0.3 billion in the quarter, but we utilized part of the post-model adjustment for economic uncertainty as planned to offset this, leaving GBP 0.3 billion of the uncertainty PMA. The charge for the quarter was GBP 0.5 million and GBP 1.2 billion for the full year, a loan loss rate of 30 basis points. Our total impairment allowance at the year-end was GBP 6.2 billion, a slight decrease in the quarter from GBP 6.4 billion but with strong coverage ratios across the portfolio. Given the current economics, we would expect the loan loss ratio for full year '23 to be in the 50- to 60-basis-point range, closer to historical levels. This will be affected by product mix, including planned growth in U.S. cards and by changes in the macroeconomic outlook. In the U.K., our growth has been in mortgages, whilst U.K. cards has reduced by around 40% since 2019. We continue to see high levels of repayment in the U.K. cards, and arrears rates remained stable and low. Consumer behavior and the risk performance confirms that the quality of the cards book overall has improved, and this is reflected in some reduction in coverage, but the ratio is still 7.6% in U.K. cards with a 19.2% coverage of Stage 2 balances. We've grown U.S. card but have maintained strong coverage levels, with 8.1% overall and a 33.6% Stage 2 coverage. As we have grown share in CIB, we have managed risk carefully. Whilst RWAs and the CIB have grown, the increase year-on-year has been as a result of the stronger dollar and regulatory changes. We also kept tight control on leverage, with leverage exposure for the group down year-on-year despite FX and the growth in financing. Looking at the wholesale lending risk, CIB loans to customers and banks at amortized costs grew by GBP 18 billion last year or GBP 15 billion, excluding FX. Most of this increase is in lower risk areas of corporate lending, and we've increased the first loss credit protection. Total CRE loans across the group are GBP 16.6 billion, down year-on-year and just 4% of our total loan book. This is an area where we have taken a cautious approach, with U.K. exposures broadly static for a number of years and well collateralized. We have actively managed down the pipeline over the last couple of quarters, having our syndicate commitments and have taken some marks on remaining positions in the corporate lending income line. In summary, we feel confident in our risk management across our lending portfolio and trading businesses. Profit before impairment of GBP 1.8 billion was up 29%, with income growth of 12% outweighing cost growth of 6%. Both income and cost growth numbers are, of course, affected by the stronger U.S. dollar year-on-year. The impairment charge of GBP 0.5 billion represented a 49-basis-point loan loss rate, close to our expectation for 2023. There was a small net tax credit in the quarter, and RoTE was 8.9%. Looking now at each business, beginning with the U.K. Income grew 16%, with costs down by 8%, reducing the cost-income ratio by 15 percentage points to 58%. The NIM for the quarter was 310 basis points, up 9 basis points on Q3 as we saw further benefits from rates. This was moderated by product margin pressure, notably in mortgages and effects from treasury activities, which are included in the other category on the NIM bridge. However, for 2023 as a whole, we're guiding to a reported BUK NIM of over 320 basis points as tailwinds from the building structural hedge benefit through the year outweigh these other dynamics. Income increased 46%, reflecting growth across international cards, payments and the Private Bank. Total costs were up 22%, delivering strong positive jaws despite our continued investment in growth. This reflected the growth in U.S. cards balances back to prepandemic levels, including the effect of the Gap portfolio. As balances grow, we did expect some stage migration, but risk metrics remain below prepandemic levels. Income was down 2% overall, with another standout performance in FICC, up 56% in dollars, offset by lower Investment Banking fees. I want to focus here on the Q4 corporate income, which was up 8% overall. Within this, transaction banking was up 78%, reflecting strong NII growth and growth in fees. And in Q3, the corporate lending income expense reflected both fair value losses on leverage finance lending of circa GBP 85 million net of mark-to-market gains on related hedges and the continuing high cost of hedging and credit protection. Total costs increased by 13%, reflecting continued investment to support income growth initiatives plus the impact of inflation. I'm going to focus here on the movements in Q4, but there's a full year bridge in the appendix. Our capital generation from profits was strong, contributing 31 basis points. As expected, there was a headwind of close to 30 basis points from the acceleration of the capital effect of pension deficit contributions, but we have now completed the triennial valuation with a funding surplus and don't have deficit reduction payments in 2023. We are very focused on managing the capital risk in the liquidity pool, and the effect of movements in the fair value reserve on capital were immaterial in the quarter. We've announced a further buyback of GBP 500 million to supplement the earlier buyback and dividend totaling 7.25p, making the return of capital in respect to 2022 equivalent to 13.4p per share. For example, the 15 basis points impact of the buyback and the investment in Kensington. We also plan to lean into the seasonal opportunities in markets in Q1, as we usually do. But following the recent publication of the consultation paper, our current estimate would be towards the bottom end of that range for the January 2025 impact, and that's premitigation. Our MDA is now 11.3%, and our target range remains 13% to 14%. In conclusion, we remain confident in our organic capital generation to support further business growth in line with our 3 strategic priorities and capital distributions. TNAV increased 9p in the quarter to 295p per share, reflecting 6.5p of earnings and net positive movements in reserves. Finally, we remain highly liquid and well funded, with a liquidity coverage ratio of 165% and a loan-to-deposit ratio of 73%. We reported statutory earnings of 30.8p per share in 2022 and generated a 10.4% RoTE, delivering against our target of over 10%. We have a diversified mix of businesses, budgeted investment in the businesses and the way we manage risk that allows them to perform and get us confident in continued progress. And in BUK, we are guiding to an increased NIM in excess of 320 basis points this year. We will balance this investment with cost efficiency given the inflationary pressures, and we wouldn't expect the elevated level of litigation and conduct experienced in 2022 to recur. As a credit risk matter, we expect an increase in the impairment charge this year as we grow U.S. cards in particular and are guiding to a range of 50 to 60 basis points, absent further macroeconomic deterioration. And as usual, I would ask that you limit yourself to 2 per participants, so we get a chance to get around to everyone. Because the GBP 500 million was a, I mean, 15 bps of capital and you guide to -- well, your ROE guide equates to about 150 basis points of capital generation per year. So I was just confused a little bit on the quantum of the buyback and maybe what lays out there in terms of investments and so forth, particularly in the U.S. cards. We've also got the acquisition of Kensington, which has -- which we said today will complete in Q1. So we've done that thoughtfully for 2 reasons, really. The first is Q1, we would always expect to be the low point of our capital, simply because of the seasonal nature of our business. You'd expect us to lean into the market opportunity as I said in the script, and we'll do so, and we would expect to accrete capital thereafter. The other thing I would say, Joe, is the economic environment is certainly not benign, so that should help you understand why we've taken the position that we have. As relates to specific investments and how we balance that with shareholder returns, you can see that we are committed to shareholder returns. And actually, if you look sort of on a free capital flow basis, you can see that there were some headwinds from pensions and FVOCI that we might expect to dissipate over time. Do you anticipate in terms of buybacks to look at this on a more frequent basis, i.e., perhaps quarterly? My first question, please, is on the Barclays UK NIM progression. I would just note that, that minus 33 basis points to about 11% of Barclays UK NII, and, hence, was a substantial sequential headwind, doing my own numbers, while the mortgage margin pressure is there, it doesn't look to be more than 1% of NII per quarter. Could you clarify whether that meant a further 33-basis-point headwind or a lack of unwind of this, i.e., this will be a persistent impact rather than a one-off? So within that 33 basis points, there are 2 things, and they are broadly equal in the current quarter. It's actually the impact of churn and the nature of the market and how that is accelerating churn, and I'm sure we'll come on to that in subsequent questions. In addition to -- we did expect that, but maybe slightly more intense than we anticipated. The second thing within there is whilst U.K. card balances have grown, we are seeing prudent, conservative behavior from our customers. Of course, that's somewhat offset in impairment, so those 2 asset impacts are fairly significant. What we have not yet seen is a significant NIM effect from liability switching, but I think that's more important going forward. We have some fixed rate bonds, and the rates rose extremely sharply in Q4, and that essentially raised the cost of carry of those investments. But given what I see on the maturity program and our ongoing disposal program, I would expect to see that dissipate over time. It's one number, which is why that treasury dynamic is there. And actually in the guidance that we are giving today, we are expecting to see an intensification of switching within liabilities, and therefore, I am thoughtfully reflecting that in the guidance that I am giving you. In relation to Basel 3.1, actually, it's difficult to call out the impact of mitigation. And as we've had a chance to work through the detail, we will continue to update you. Can I ask you what level of deposit migration that you said you're thoughtful about is baked into 2023 to ensure that floor of 320 is met, i.e., what sort of share of movement from site to time deposits can occur and that 320 still be met? Not least, we have a deliberate strategy of encouraging our customers to form good savings habits. One on CIB revenues and the other, a follow up on the U.K. NIM. I mean we've discussed several times over the past that sort of the idea of your balance sort of CIB revenues that when volatility comes down, fees will pick up the slack, and you were confident about the outlook. But even in DCM, it's more investment grade that's coming through. So could you maybe comment on where you see things, how do you think -- how you see things sort of -- give a bit more color on how you see things playing out this year in the current environment, a bit of sort of steering there if you can. So if I just think about fees in the IB, clearly, it's been a difficult market for Investment Banking, and we're broadly in line with our peers. For that pipeline to be monetized, what we need to see is a period of economic stability. We haven't yet seen it, and I wouldn't call when that is exactly likely to happen. There are some small green shoots in Q1 from investment-grade debt, I would say, but it's certainly not meaningful at this stage. This is a business that has delivered strong revenues and strong results in 3 very, very different macroeconomic environments. This time last year, we were talking about fabulous banking revenues and actually CRE being relatively poor and equities being brilliant. There are different macro environment, and our objective has been to put together a business that can perform in all of those. So that is a sustainable, annuity-like element of CIB revenue that we frequently overlook. Clearly, it's not that it's completely stable. And again, we've shown you some new disclosure today that will show you that, that business has grown by GBP 700 million year-on-year, again, the same size as BUK. Greater than 320, I mean, if I go back and just reflect on the things I said before, the tailwinds, if you like, are going to build. If you ask me for an opinion, I would say, I might expect them to be more intense in the short term than the longer term. I'm sorry, it's back on Barclays NIM in the fourth quarter of last year, in the U.K. So based on what we've heard, you're saying that circa 16, 17 basis points of this other negative is the mortgage refinancing headwinds, the interest-earning assets, components of the card book and some fairly modest deposit migration so far, which I think is fully understandable. I mean, obviously, if you've got more liquid assets, that drags down on the NIM itself but not the net interest income. And you said most of that, I think, would be reinvested. I mean, I guess you're assuming the overall quantum and hedge will drop a bit this year again because of deposit migration. But if you can give us a sense of how much of the GBP 50 billion you expect to be reinvested, that would be helpful. So we've got 80% plus of that liquidity pool actually in various central banks, so I don't think it's not a big outright number. In relation to the structural hedge, the way we manage this, Jonathan, is we clearly have built it very carefully over time. In doing so, we try to identify the proportion of our liabilities, which we expect to migrate in a rising rate environment. But as I said before, we feel like we have prudently anticipated those levels, and that's included not only in our NIM guidance but also the way we think about our hedge. So if I've got a hedgeable amount of x, I don't hedge to that level, I maintain a buffer. We feel we have called that on the prudent side, but that is the extent of that migration that we determine how much that we roll. Okay, that's helpful on the hedge. I mean we can see from historic disclosure that movements in the yield curve have an impact on the AFS reserve, and we've seen that historically. So if that were to reverse in Q1, then the pro forma CET1 ratio would fall from the 13.5% that you flagged to below 13%. There'd obviously be some capital generation, too, but I was just trying to understand what gives you the confidence that you've got enough capital to support CIB market shares and revenues and also to generate capital for distribution. You can see, in the fourth quarter, there is an FX impact in terms of the RWA movement. And obviously, as we said, we have managed our leverage finance pipeline and commitment given the environment as well. From here, we're confident that we've got the right level of capital to support the growth in the CIB. And it's one of the reasons that we've settled ourselves at that midpoint because we want to be able to lean in, in the way that you described, but the quantum of what you're describing is somewhat too high just because of some of the effects that I've just mentioned. So hopefully, that's helpful. So just on that, so you'd expect it to be below the -- you'd expect Q1 to be below 13.5% but not below 13%? It might nudge below 13.5%, but we are fully expecting to remain within our target range. And even if it does, it will be because of the business opportunity and we will accrete thereafter. Clearly, in a rising rate environment, you're going to see some expansion in margin. In a volatile environment, you would see the same. And the other thing I would say is you can see that we are taking share not just from European peers, but more broadly across the street. And the first one, just to follow up on the potential for deposit migration attrition from here. I was just wondering, firstly, if you were able to share a bit of detail in terms of how the deposit back splits within Barclays UK. It seems like from the annual report of Barclays UK that there's a very small portion within time, if any. I was just wondering what share of deposits is in current accounts, so noninterest-bearing at present, just to get a sense on how potential the scope we see for migration. And related to that, I mean, we don't have really any history at least over the last  and 15 years in terms of deposit migration. And secondly, I was just wondering in terms of U.K. consumer behavior, what you're seeing in terms of business momentum. However, the level of time deposits is actually pretty small for us, probably smaller than -- well, certainly smaller than the market as a whole. We have never really -- well, we've never been a hot money bank through all of our history. So as we're looking at our potential deposit migration, we're actually looking largely at migration from one type of franchise deposit to another, and that very much is our strategy, as we said before. In terms of time deposits or -- we have strong rates out there, but they're very much in our control. So if we saw balances move too high, given that our loan-to-deposit ratio is as firm as it is, that's something that we can certainly manage. I mean, I said before, it's the absolute movement in rates that we typically see prompting changes. Firstly, we and all of the rest of our U.K. peers or most of the rest of our U.K. peers are in a different liquidity position, and therefore, you might expect pricing to be different. Having said that, it's very easy for customers to move their money around. Of the people that have opened our Rainy Day Saver account, the majority -- the vast majority of those have done that online, which is clearly different, which is why we're being thoughtful about the impact of migration because it is so uncertain. In terms of U.K. consumer behavior, really no change. The same is true when we go actually into business banking and corporate, and that probably should be less of a surprise given 2 things. Firstly, our customers have been and are being defensive in the way they're behaving. And then if you put on top of that, the fact that unemployment remains very low, it shouldn't surprise us that actually we are not yet seeing anything untoward from a credit perspective. The numbers have changed, but the reality remains that the firm still discloses that rate hike of 25 basis points is worth GBP 150 million more in year 2 than it was in year 1. And so we've had 17 sets of 25-basis-point hikes, which should mean a tailwind of GBP 1.7 billion or something in Barclays UK. We've discussed, I think, to some extent, all of those in various questions before. And then secondly, the -- I think the corporate lending sort of mark-to-market in Q4 was probably better than some had feared, and the disclosures that you provided around the hedges are useful. So just starting with Page 11, I would say, regard it as a sensitivity disclosure, not a forecast. Firstly, remember, 2/3 of that broadly is in the U.K. 1/3 is in the Barclays Bank PLC so on the BI side, specifically within transaction banking most meaningfully. To your second question, within corporate lending, there are a few things in there. Yes, that's there for default. If you look at Page 15, you'll see that it's covering 32% of the million GBP 54 billion of corporate lending exposure. And then finally, on the mark-to-mark hedges, they're there, specifically for the LevFin exposures. We've been very prudent, I would say, in extending the coverage of those hedges. And therefore, we have put down more hedges, and the absolute cost of those hedges has gone up. So you've got 2 things going on: more coverage, greater cost. We don't disclose either of those things, but they are quite strong impacts within that number, Jason. The -- you're right, the build in structural hedge is significant and, I think, quite well understood. It's completely mechanistic, static balance sheet, no switching. I just have one point of clarification on BUK NIM and then an alternative question on CC&P, please. Within the 33 bps of other in your NIM bridge, you broke out those 2 kind of broad buckets, the product dynamics and the sort of treasury impacts. When we look at sort of industry data, it might be something like 9% of U.S. card players' income. Obviously, you don't get that broke down for Barclays. But if you could give us a sense on the potential headwind to CC&P revenues, that would be helpful. In relation to the late payment fees, I mean we'll see what happens as we see the final terms of that and if, indeed, it actually moves into regulation. But from the initial calculations that we've done, Chris, it looks like it's manageable within the growth of that business. In terms of thinking about quantifying, is there any reason to suppose that Barclays U.S. card income profile and kind of fee split is different or markedly different to the industry average in the U.S.? And then secondly, I see you note on the slide that your triennial valuation is now on a GBP 2 billion funding surplus. So what we see in the mortgage market is quite a change really, so it's dominated by remortgage. It's dominated by low loan-to-value remortgage, and the demand for high loan-to-value mortgages has reduced significantly, which is exactly what you might expect it to do in the face of HPI uncertainty. What that means is that the -- if you like, the blended margin for acquisition in the market is below where it would have been previously because it's dominated by low-margin, low loan-to-value products. In addition to that, customers are remortgaging extremely quickly, so we are seeing considerable churn across the industry as a whole. And because of that, and I would say low demand overall, you've got low demand, fixed supply and, therefore, a very competitive environment. So I would call out, and that's why we are being really thoughtful and conservative in the way that we're playing forward our NIM that we think that's quite a change in that market given the impact of the third and fourth quarter last year. In terms of what we're seeing in customer behavior, again, very defensive. And actually, I would say, absolute margins are still healthy. So we have seen a reduction in our pension risk within Pillar 2A, but you might remember that during COVID, there was a degree of relief from the PRA in the way that they calculated Pillar 2A with reference to RWAs. So on costs, on Slide 12, just trying to understand the sort of the rationale assumptions behind the different arrows. CC&P, continue to invest and expect some revenue momentum. But I guess it's the CIB, which is most nuanced or hardest to call, I imagine. There's a higher borrowing on FICC for the year-over-year comps and, more generally, the markets expecting lower revenues this year than last. There is investment but perhaps less inflation to the CIB on things like IB, payments and other line items. And then on the deposit mix, it's interesting to hear that you sound a lot more conservative than you have in the past, even though we're sort of nearing the end of policy rate hikes if the curves are right and deposit competition hasn't intensified at least in terms of term rates in the past month or so. So it seems like from your comments, there's quite a lag as to how it works through into customer behavior. So in terms of costs, you're right to point out that the dynamics by business are really different. So what we're doing now is we're driving efficiency as fast and as far as we can in order to make sure that, that drops through to the bottom line, and you'll see that BUK costs are actually down in the current year. We're guiding to sort of, I would say, modestly up, if you look at the direction of that arrow. And therefore, you should expect us to lean into them as we have done in the current year. Now in CCP, that's a bit more straightforward because it relates to onboarding Gap. You can see the costs going in, in Q2 of this year and the revenues following thereafter. That has led to a high-quality increase in income, so GBP 800 million up year-on-year, as I said. CIB is more difficult to call, but this is a business that we've invested in steadily over a number of years, and we're seeing the benefit of that now. As I said before, it's performed across 3 very different years and 3 very different environments. But for those businesses to operate well, you have to invest in them. And actually, our cost-income ratio and the sort of progression of our cost and income is not significantly different to those of our U.S. peers if you were to line us up. That's people and technology, by the way. And of course, this is the area of the bank where we probably have more cost flex because we are able to speed up or slow down our technology investments. We are able to that flex our comp, so we will do that to the extent that we think it's appropriate and the income line is coming off. And in terms of deposit rates and deposit composition, as I've said before, it's broadly -- well, it's very much in line with our strategy to drive good savings behavior with our customer set. It looks like that's very much a market-wide strategy as well, not least from what we see in pricing but also comments at the , rather. I've said for a while that actually, the bigger effect here is not so much about pass-through. But its customers' desire to migrate, and that will be prompted by a number of things, which may be competing. The fact is the movement in policy rates, as I said before, may prompt behavior. But equally, in the current environment, customers are keen to manage perhaps higher than normal sort of operational , if you like, because of the economic uncertainty. So there's some offsetting impacts, we have not been down this path for many, many years, which is why we're being cautious. On the hedge, you say you run with a buffer, but the hedge declined in size in Q4. And if we look forward on deposits, we talked a lot about the mix of deposits and how that will drive differences in expectations. And then secondly, just you mentioned reversion -- sorry, churn rates speeding up. In terms of the hedge, you're right, we reduced the size of the hedge. And we're just being cautious and making sure that, that buffer remains as it was. Obviously, in the current environment, the opportunity cost of holding that buffer is not as great as it was, and that's why we made that trade-off. And 1/3 of the benefit of the structural hedge goes to the corporate side, and you're going to see on the BI side, and you're going to see that appear predominantly in transactional banking and a little bit in our Private Bank. In terms of absolute levels of deposits, they remain pretty stable, I would say, on the wholesale side. On the BUK side, we've seen a slight reduction in business banking deposits. In terms of your question on churn, we don't disclose that level of detail. What I would say is that clearly, there is a very low proportion of customers that remain on reversionary rates. As rates rise, clearly, that proportion of customers remaining on reversionary rates, you'd expect to fall even further. And to other folks on the call, I'm sure we will see you in the upcoming investor meetings, too."
}