{
    "symbol": "TRIN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 02:30:20",
    "content": " At fair value, 75% of our debt portfolio or $751 million is comprised of secured loans, while 25% or $246 million is invested in equipment financings. As of September 30, Trinity holds an investment in Core Scientific, collateralized by critical computing equipment, with a cost basis of $24 million and a fair value of $19.4 million, which is approximately 81% of cost. As of September 30, these financings represent $65 million or less than 6% of our total investments on a cost basis and $60 million on a fair value basis, for an overall fair value to cost ratio of 92.3%.There are certainly challenges being faced by all companies in the digital asset sector, including the prolonged decrease in the price of bitcoin and an increase in electricity costs. We delivered record total investment income of $38.7 million, a 15.5% increase over the $33.5 million of total investment income recorded during the second quarter of 2022, and an increase of 77.5% compared to the same period of 2021. As a result of this operating activity, net investment income for the third quarter was $18.6 million or $0.56 per basic share as compared to $15.7 million or $0.51 in per basic share in the preceding quarter on a higher average weighted share count. At the end of the third quarter, we had 5 portfolio companies on nonaccrual with a cost basis of $35.9 million and a fair value of $13.9 million, representing just 1.3% of the fair value of investment portfolio. We are actively managing our liquidity and continue to explore all capital options that will be accretive to our shareholders, such as investments under our planned .On September 15, our Board declared a cash dividend of $0.45 per share for the third quarter of 2022, representing a 7% increase from Q2. Third, as mentioned previously, we have approximately $67 million of capital gain spillover that allows us to offset potential capital losses, continue to invest for the benefit of our shareholders or distribute the gains as supplemental dividends."
}