{
    "symbol": "TRIN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 12:01:04",
    "content": " Our NII per share has grown from $0.24 to $0.51 in the second quarter, and our core dividend has grown from $0.22 to $0.42, with our core dividend increasing now for the sixth consecutive quarter in addition to our supplemental 15% â\u0080\u0093 $0.15 dividend that we paid for the last two quarters. Subsequent to quarter end, we reopened our 7% bond and issued an additional $57.5 million of fixed rate long-term debt due in January of 2025. We funded approximately $193.8 million of investments, leading our portfolio to grow to $1.1 billion on a cost basis, an increase of 15.8% over Q1 2022. Our $193.8 million of deployments during the quarter reached 28 portfolio companies, including $117 million in gross deployments to 11 new portfolio companies and $76.8 million in gross deployments to 17 existing portfolio companies. We finished the quarter with $373 million of unfunded commitments, giving us a strong pipeline through which we can grow our portfolio in subsequent quarters. With respect to our exposure in the digital asset sector, we have made equipment loans totaling $69.6 million on a cost basis to three publicly traded digital asset mining and hosting companies, representing approximately 6.9% of debt portfolio at cost. Sliding deeper into the portfolio composition at fair value, approximately 73.2% of our debt portfolio or $769.7 million is comprised of secured loans, and 21.4% or $224.9 million is invested in equipment financing. As we disclosed in our 10-Q filed today, a 100 basis point increase in the prime rate would have the net effect of adding $4.1 million or approximately $0.13 per share to our annual net investment income. We recorded total investment income of $33.5 million, a 5.3% increase over $31.8 million of total investment income recorded during the first quarter of 2022 and an increase of 71.8% compared to the same period of 2021. This increase from the prior quarter was attributable to higher interest income of $4.1 million on a larger loan portfolio, coupled with the higher average interest rates on our floating rate investments. As a result of this operating activity, net investment income for the second quarter was $15.7 million or $0.51 per basic share as compared to $15.6 million or $0.57 per basic share in the preceding quarter. We recognized unrealized depreciation of $13.1 million in our loan portfolio, primarily attributed to marks on Street portfolio company due to underperformance and $11.2 million on our equity and warrant portfolio related to mark-to-market adjustments as a result of general market volatility. Quarter-over-quarter, decrease of $0.53 per share or 3.5% in NAV was primarily the result of the unrealized depreciation realized losses I just discussed and the $0.15 supplemental distribution to shareholders, offset by our investment income, which exceeded our standard dividend by $0.09 per share at our accretive common stock offerings. Starting with the credit quality, our portfolio companies continue to perform well in the second quarter of 2022 with approximately 98% of our portfolio performing at cost. We currently have four portfolio companies on non-accrual with a cost basis of $20.5 million and a fair value of $5.9 million, representing just 0.6% of the fair value of the debt investment portfolio. Available liquidity as of June 30, 2022, was approximately $93.2 million, including our approximately $13.2 million in unrestricted cash and cash equivalents and a borrowing capacity of approximately $80 million under our KeyBank credit facility, subject to existing terms and conditions. February 2, the end of the second quarter, we announced that we reopened those 7% unsecured notes due in January 2025 and raised $57.5 million, which we used to pay down our KeyBank facility. On June 15, 2022, our Board declared a cash dividend of $0.42 per share for the second quarter of 2022, representing a 5% increase from Q1 2022."
}