{
    "symbol": "XEL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 16:25:04",
    "content": " We're also initiating 2023 earnings guidance of $3.30 to $3.40 per share, which reflects our 5% to 7% long-term EPS growth objective. Consistent with past practices, we've updated our base investment plan, which reflects $29.5 billion of capital expenditures over the next 5 years. For these assets, we expect further regulatory clarification in the second half of 2023, which could result in incremental capital expenditures of $2 billion to $4 billion, which would result in rate base growth of 7.6% at the midpoint. Earlier this year, the commissions in both Minnesota and Colorado approved resource plans that will add nearly 10, 000 megawatts of utility scale renewables to our systems and achieve an 85% carbon reduction by 2030. And in a natural gas rate case, we reached a comprehensive settlement which reflects a rate increase of $21 million, an ROE of 9.57%, a currently authorized equity ratio of 52.5%, a decoupling mechanism and property tax tracker. As Bob mentioned, we've issued a robust $29.5 billion 5-year base capital forecast with a rate base growth of 6.5% using 2022 as a base. Our proposed resource plans include approximately 3,500 megawatts of additions from 2024 to 2027, which would result in capital investment of $1.5 billion to $3 billion, assuming 50% ownership. The financing plan assumes $1.8 billion of tax credit transfers which improves our credit metrics, maintains a strong balance sheet and lowers the cost of renewable projects for our customers. We're also initiating our 2023 earnings guidance range of $3.30 to $3.40 per share, which is consistent with our long-term EPS growth objective of 5% to 7%. Secondly, as we think about generation in our Southwestern service territory, I think with the IRA, we see economics in solar and wind down there that can make an acceleration of renewables in the SPS territory, also not in our plan would be towards the back end of the 5-year plan, maybe in the middle of the 10-year plan. On the O&M side, yes, I think as we went through this year, right, we're certainly subject to the inflationary pressures, and we have been flat since 2014 on O& M. So that was 8 years of being flat, and we had some inflationary pressures, had storms this year, increased investments in our customer platforms and also, we're running our coal plants much more given the change between gas prices and coal, so higher chemical costs, higher plant costs. And I just think about longer term on the gas LDC side, like our net 0 plans for 2030 and 2050 and the LDC side are aligned with the climate science, they're aligned with the state goals, and we're looking forward to working through the clean heat plant in Colorado. And we've also characterized what a hydrogen production that would match just 5% of our LDC is somewhere between $2 billion to $4 billion of investments between the renewables it takes to generate it as well as the electrolyzer, the balance of plant and the storage and transportation, so significant investments to create hydrogen for the benefit of our customers and to enable our clean energy transition."
}