{
    "symbol": "HSIC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 11:48:07",
    "content": " While we are maintaining our full 2022 full year guidance for EPS for 2022, and that's the guidance range of $4.75 to $4.91, we are adjusting our expectations for full year sales growth to reflect changes, which include continued strengthening of the US dollar and declining demand for COVID-19 test kits. These plans include the goal to accelerate the adoption of digital technology not only within the company, but also helping our customers digitalize and there's a great pressure on our customers to digitalize in their practice, and we're providing excellent handholding consulting services and, of course, an excellent offering of digital products to help our customers advance the digitalization of their practices. Also reporting to Brad Connett, Dirk is responsible for the entire dental and medical distribution group's, customer-facing organization in the US, focused on helping us to advance our goal of exceptional customer experience, increasing efficiency and sales growth in these businesses. The second quarter growth in our global dental business, once again was driven by strong global equipment sales as dentists continue to invest in their practices, consumable merchandise internal sales growth in local currencies, excluding PP&E and COVID-19 related products and Ron will give specifics, was impacted by an increase in patient appointment cancellations and staff shortages, which we believe were related to COVID-19 infection rates. Henry Schein own sales growth accelerated compared to the prior year growth, and we are seeing healthy demand from our national DSO accounts for these solutions, but also add for the Dentrix Ascend and Dentally cloud-based solutions, some are going to DSOs, but general reception from GPs and specialists, small and midsized practices is also very good. North America dental equipment LCI sales increased 8.1% compared with the second quarter of 2021, with good performance in both traditional and digital restoration categories. During the second quarter, our Technology and Value-Added Services businesses, together with our Dental Specialty products achieved total sales growth of 9.0% and LCI sales growth of 8.2% slightly lower than our goal of double-digit growth for the full year. Excluding sales of PPE and COVID-19 related products, Global Medical LCI sales increased 13.6% compared to the second quarter of 2021. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question."
}