{
    "symbol": "HSIC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 16:21:03",
    "content": " Excluding sales of PPE products and COV19 test kits, and taking out the 53rd sales week for 2022, we achieved very good internal growth of 5% in local currencies, that's internal. When excluding sales of PPE products, COVID-19 test kits, we experienced double-digit growth in local currencies adjusting for that extra week and really absent any public health outbreaks, new ones, medical sales should return to more normal mid- to high range single digits. And even with this change, the impact of COVID-19 and flu, which required huge support from our team to deal with these currently significant inflows of orders to realize that we delivered a compounded average sales growth even with these inflows, unusual inflows of PPE, COVID tests of about 6-point -- just over 6% when you take out the PPE and COVID. Sales of dental specialty products were approximately $247 million in the fourth quarter, with LCI growth of 0.3% compared with the prior year. Global technology and value-added services sales during the fourth quarter were $187 million, with LCI growth of 3.4% compared with the fourth quarter of 2021. During the fourth quarter, our technology and value-added services businesses, together with our dental specialty products, achieved LCI sales growth of 1.6% or 3.9% after adjusting for the expiration of the government contract. Global Medical sales during the fourth quarter were $1.2 billion, and LCI sales decreased 1.3%, due to lower sales of PPE products and COVID-19 test kits. In North America, excluding sales of PPE products and COVID-19 test kits, LCI sales grew 14.9%, led by strong point-of-care diagnostics, medical equipment and pharmaceutical sales. And I still think that the whole management of this PPE and COVID tests, where we put the accelerator down generated over $2 billion or so in sales and pretty good profits has paid off because our customers are understanding that they can rely on Schein during challenging times and that the products we sell are generally or compliance with regulations and very often, they were buying products during this COVID period that had regulatory issues and so -- and quality issues. I think it's a -- really shows that the benefits of having the kind of broad product portfolio we have of not just being a distributor but also having the specialty products, also having being in the medical business, also being in the technology business that we can we can continue to kind of offset some of these market conditions that have adversely affected us a little bit, whether it be in PPE or COVID test kits with the balance of the business."
}