{
    "symbol": "BIOX",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-13 00:43:10",
    "content": " While Syngenta will now cover working capital needs as well as sales and marketing activities, we have secured minimum profits that average $23 million on a per year basis over the life of the agreement, and this is not including an upfront fee of $50 million in exchange for the different rights granted for the collaboration. The merger with Pro Farm and the subsequent business integration triggered the need to adopt the U.S. dollar as the functional currency in our main operational subsidiaries in Argentina, starting in the first quarter of this fiscal year. Even with these additional one-timers, SG&A as a percent of sales after deducting $2.8 million in merger transaction expenses was roughly 23%, in line with the first quarter of last year. Within the next two quarters, we expect to fully achieve the cost synergies we targeted at the time of the merger and believe that by year-end Pro Farm assets will have turned into positive EBITDA contributors, which should be the basis on which we continue to build sales synergies in the next 12 to 18 months. And despite severe weather conditions in some key markets, our strong first quarter results and the revenue diversification we gained from Pro Farm make us feel confident about the growth outlook for the full fiscal year and allows us to remain focused on executing our HB4 strategy and making Pro Farm assets, EBITDA contributors before year-end. Obviously, the Pro Farm integration process is an important aspect for the fiscal year, where we expect to reduce that negative EBITDA contribution from Pro Farm and turn that into a positive number by the end of the year and also take advantage of the R&D capabilities that exist within Pro Farm to make them available not only to other internal customers, but also to external clients so that we can utilize this in full. It is important that during fiscal year 2023, we met the initial KPIs that we set in place for the Syngenta collaboration and scale up our production capacity for biologicals in Argentina and also for adjuvants in Brazil hoping to finish the new facility by the end of the fiscal year and have that fully operational in fiscal year 2024. And then on top of that, if we get to year-end and look back on a trailing last 12 months basis, and Pro Farm has become a positive EBITDA entity that should set the basis for us to continue executing on the medium-term synergies that were related to sales. Remember that we targeted between $5 million to $15 million in synergies that take a bit longer to be executed, mostly because it requires some work on the registration front, so ready  some of the Pro Farm products in geographies where we have sales muscle takes a bit of a time, but that's what we're looking for a strong basis on which then to add those synergies. Your line is open. Your line is open. Your line is open. Your line is open."
}