{
    "symbol": "ONEM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 20:54:05",
    "content": " In the first quarter of 2022, One Medical continued to perform, innovate and grow with its innovative primary care model built for purpose to delight members with better health, better care, lower costs within a better team environment. It also included 39,000 at-risk members, which was above the top end of our guidance range, up more than 80% compared to Iora's pre-acquisition at-risk member count from Q1 2021 driven by growth from direct contracting, a program that began in Q2 of last year as well as Medicare Advantage. Moving on to revenue, total net revenue for the first quarter grew 109% year-over-year to $254.1 million, $4 million above the high-end of the guidance range, we issued on our last earnings call. While this quarter's conversion revenue growth was driven by our strong growth in commercial members and higher-than-expected reimbursement rates, it was also impacted by a year-over-year decline in COVID-related revenue and by capacity constraints early in the year due to providers being sidelined due to the Omicron variant. Cost of care was $101.4 million in the first quarter, up 45% year-over-year, primarily due to the addition of our senior business, continued investment in our patient-facing staff, our ongoing service expansion and opening six new offices in the quarter. Your line is open. And on the senior health side, the At-Risk side, as we said, we were really pleased to see a 10 percentage points reduction in our blended medical claims expense ratio, certainly saw some spikes in January due to Omicron, but I have seen those come down also, as I spoke about in my prepared remarks, we've done a lot of work in managing complex patients, including real effort on our One Medical At Home program, which is a program that had started in the IR days that we built on top of this that risk stratifies our population looks for rising risk, very complex seniors and manages them very proactively through team-based care, including going into the home. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}