{
    "symbol": "CSIQ",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-21 11:10:05",
    "content": " I would now like to turn the call over to Isabel Zhang, Investor Relations Director at Canadian Solar. Thank you, operator, and welcome, everyone, to Canadian Solar's fourth quarter 2022 conference call. Please note that we have provided slides to accompany today's conference call, which are available on Canadian Solar's Investor Relations website within the Events and Presentations section. Joining us today are Dr. Shawn Qu, Chairman and CEO; Yan Zhuang, President of Canadian Solar's majority-owned subsidiary, CSI Solar; Dr. Huifeng Chang, Senior VP and CFO; and Ismael Guerrero, Corporate VP and President of Canadian Solar's wholly-owned subsidiary, Global Energy. On this call, Shawn will go over some key messages for the quarter. Yan and Ismael will respectively review the highlights of the CSI Solar and Global Energy businesses, followed by Huifeng, who will go through the financial results. Shawn will conclude the prepared remarks with the business outlook, after which we will have time for questions. Before we begin, may I remind listeners that management's prepared remarks today as well as their answers to questions will contain forward-looking statements that are subject to risks and uncertainties. By disclosing certain non-GAAP information, management intends to provide investors with additional information to permit further analysis of the company's performance and underlying trends. And now I would like to turn the call over to Canadian Solar's Chairman and CEO, Dr. Shawn Qu. Shawn, please go ahead. Welcome, and thanks for joining us on our call today. We grew revenue by 42% to a record $7.5 billion, and we grew net income attributable to shareholders by 152% to a record $240 million. Before turning the call over to Yan, Ismael and Huifeng, I would like to give you a higher level view of what we are seeing. If you look at our key financials between 2015 to 2020, you will notice limited revenue and earnings growth as the massive increase in volume was offset by the huge decline in costs and ASP in solar modules. During that period, we put in place strict cost control efforts and invested in R&D to reduce our manufacturing costs while improving our product efficiency and output. Today, solar energy is a good investment both economically and from a sustainability standpoint. As an integrated manufacturer and a developer, the closer we reached the bottom of the cost curve, the closer we are to translating volume growth into both revenue and earnings growth. If you look at the past two years, raw material costs increased meaningfully due to COVID-related reasons. Recently, some of the raw material costs have started to decline, such as that of polysilicon as the new capacities ramp up. But we are not quite at the bottom of the cost curve yet, given the technological innovation in the pipeline that will help us achieve further efficiency gains and cost declines. The key point is that we are getting very close to the bottom of the cost curve; at which point, value and technology differentiation will become the predominant drivers of profitability, not cost. With that, we expect to see greater pricing power and operating leverage as our cost structure stabilizes further, and the world continues to invest in cleaner energy infrastructure and secure universal access to energy. Please turn to the next slide. Before turning the call over to Yan, I want to update you on CSI Solar's carve-out IPO in China. Our auditors are in the process of fully auditing CSI Solar's 2022 financials, and we will update our prospectus once the 2022 financial auditing is completed. Given today's update, we think we are on track to complete the IPO in Q2 of this year. With that, let me now turn to Yan who will provide more details our CSI Solar business. As Shawn noted, 2022 was a record year for us. Gross margin was up 69% year-over-year, and operating profit increased by over 4x. Despite the challenging macro backdrop, this record year underscores the long-term strength of our business and multiyear growth opportunities ahead. If you turn to the next slide, you can see the extent of the market volatility. Trends are generally moving in our favor, but we continue to take actions wherever possible. For example, polysilicon prices collapsed in December and January, driven by a sudden reopening of China's COVID policies and timing of Lunar New Year. However, fundamentally, the views we shared over the past several quarters are unchanged. We believe polysilicon prices will come down gradually as opposed to drastically given that demand is still very strong, and we continue to see very large customer pipelines across our markets. And also, we believe the market today is very price elastic. The other big driver of the profitability improvement was the decline of shipping costs to more normal levels, as you can see on the chart. So while shipping costs will go up with volumes, we will be able to see a bit more operating leverage on our operating expenses, which includes shipping costs will not grow as fast as our top line. So while we are monitoring market trends very closely, our focus remains on the factors that we can control. In other words, strengthening our competitive advantage in technology and products; positioning our brand in high-priced premium markets; building on strong customer and channel relationships; and, increasing control of our costs through vertical integration of manufacturing capabilities. The charts on the left show our channel and regional distribution, which are over-indexed in premium markets. We continue to grow our capacity to keep up with strong demand and increase the level of vertical integration to gain more control over our costs across the value chain, and we are flexible in this strategy. As we previously announced, we slowed our ingot capacity expansion this year, but accelerated our cell expansion plans. First, I wanted to highlight the credible -- the incredible achievements of our CSI energy storage team, which delivered 1.8-gigawatt hour of utility scale battery storage shipments over the past year. And every project we have delivered has been profitable, despite steep increases in key raw material prices. In fact, lithium carbonate prices went up by more than 10x over the period, although prices have recently started to come down. Over the past several quarters, we have been investing in R&D and have successfully launched one of the most competitive utility scale battery storage products, the SolBank. 2023 is going to be a transition year for our battery storage shipments, especially considering the longer order fulfillment lead times for battery storage compared to solar. However, we have very strong visibilities over our long-term growth. As of January 31, SolBank had over $1 billion in contracted revenue and a total pipeline of 23-gigawatt hour in our turnkey utility-scale storage business. Please turn to the next slide. On the residential battery storage side, we have now officially launched our EP Cube products in the U.S., Europe and Japan. Last year, the Solar Power World editorial team picked the EP Cube as their favorite residential battery storage product. This has been echoed by our customers given the EP Cube's customizable and modular design, ability to be both DC and AC coupled, easy installation and incredibly beautiful design. Since the launch, we've been working closely with our distributors and the installer network, which we were able to leverage directly from our existing solar module channels. The Global Energy system is undergoing significant change that impact how we think strategically about our market positioning, how value creation is defined with growing awareness of energy security and global efforts to decarbonize our economies through tools such as carbon pricing and other carbon neutrality initiatives the value proposition of our company and the industry would not look the same in the future. But increasingly, it will be PV+ storage, even to PV+ storage, plus a much more efficient and intelligent integration systems to facilitate energy treaty. We achieved 2 gigawatts in project sales in 2022, $822 million in revenue and $161 million in gross profit. As expected, was a smaller quarter from a project monetization standpoint due to the timing of project sales. Additionally, in Q4, we decided to hold on to more projects longer term in certain markets such as Europe, where we believe we can capture more value by being the long-term asset owner and operator. During Q4 2022, we continue to focus on originating and developing larger and most valuable project global pipeline of solar and battery energy solace assets. As of January 31, our total pipeline stood at 25 gigawatts of solar and 47-gigawatt hours for battery storage projects. Of this, we had 14 gigawatts of solar and 12 gigawatt hours of battery storage interconnections. This is a shift from the past, where the focus was mainly on projects contracted revenues or environmental permitting, both of which are still important, but interconnections will be absolutely critical. Our capabilities expand all the way from initial site selection to permitting financing execution, operations and maintenance, and asset management. Longer term, as we've discussed on prior calls, our strategy is to retain greater asset ownership in select markets to increase the revenues generated through recurring income, such as power sales, operations and maintenance and asset management income. We understand that our Global Energy business in its current form is difficult to forecast on a quarterly basis, given the lumpiness of our product sales and the difficulty to accurately time deal closings. And while we develop some of the most valuable solar and battery storage assets, the constant pressure to recycle capital quickly means that we may not sufficiently capture the value we create. So our plan is to hold on to certain assets for longer, where it makes sense from a risk and value creation standpoint. For example, we recently closed the first 30% sale of our Italian alternative investment fund. This way, we will be gradually moving from a spot sales business to a recurring revenue one, accounting for value creation and cash flow considerations. Now, let me pass it on to Huifeng, who will go through the financial results in greater detail. In Q4, we achieved a 29% revenue growth year-over-year with $1.97 billion in revenue. CSI Solar gross margins expanded by 10 basis points to 17.4%, while Global Energy gross margins were at a healthy 21.7%. As Yan mentioned, shipping costs are finally back to a more normalized level. On the other hand, we are starting to see the ground transportation costs in different parts of the world are picking up slightly due to limited labor availability, but this is more than offset by the decline in shipping costs. Put together, total operating expenses were down 22% in Q4 sequentially. This is 10.8% of total revenue, which is the lowest level since 2018, as the dynamics as Shawn mentioned in his introductory remarks, are starting to play out. Net foreign exchange and derivative loss in the fourth quarter was $15 million, partially reversing the $39 million gain we achieved in the third quarter. Total net income was $99 million, with net income attributable to Canadian Solar shareholders at $78 million or diluted EPS of $1.11. For the full year of 2022, we generated approximately $920 million in operating cash and spent around $600 million in CapEx. We further improved our leverage measure as net debt-to-EBITDA, excluding restricted cash, to 2.5x from 2.7x the prior quarter and 3.4x in Q4 of last year. For 2023, we expect CapEx to be approximately $1.5 billion as we support our capacity for this year and prepare for next year's growth plans. This is significantly higher compared to our historical CapEx spending, but it reflects the much larger global scale of our business and favorable demand outlook, especially the U.S. market. Over 25% of the CapEx will be financed by customer down-payments as we establish manufacturing capacity in the U.S. and expand our capacity in Southeast Asia, another 40% with internal cash generation and the remaining from debt financing. Now, let me turn the call back to Shawn, who will conclude with our guidance and the business outlook. Shawn, please go ahead. For the first quarter of 2023, we expect solar module shipments by CSI Solar to be in the range of 5.9 to 6.2 gigawatts, including approximately 130 megawatts of solar module shipment to our Global Energy project. Gross margin is expected to be between 18% to 20%, reflecting the margin improvement from lower manufacturing costs. For the full year of 2023, we reiterate CSI Solar's total solar module shipment guidance to be in the range of 30 to 35 gigawatt. CSI Solar's battery storage shipments are expected to be between 1.8 to 2 gigawatt hour, reflecting this year's transition from white label to our own manufactured products, as explained by Yan earlier. Global Energyâ\u0080\u0099s project sales are expected to be around 3 gigawatts, although we are currently revisiting some of our project sales forecast as we may want to hold on to more projects longer term. We also introduced revenue guidance for the full year 2023, which we expect to be in the range of $8.5 billion to $9.5 billion. With that, I would like to open the call for your questions. Shawn, as you look at this business, you talked about the value creation and the value capture changing as well as the vertical integration that the company is planning. Well, in the past, Canadian Solar's gross margin had been in the 20% to 30% range. For example, from 2018 to 2020, our gross margin has pretty much every quarter about 20%. And then we had COVID and also the raw material cost increase not only happened to solar, but basically raw material for everything and the raw material information. So as I said in my part of this presentation, we think the cost started to decline, some of the raw material costs already started to decline and eventually will reach the bottom of the cost curve. And also the competition in the solar industry, just like for every industry, should somehow stabilize. And once it stabilizes, I do think that 20% to 30% is something we can hope for in mid- to long term. Yes, I would like to ask Ismael to answer this question. We are still working on it on the long run, but initially, the intention is to start to move into recurring revenues as quick as we can. Yes, see, we now run the two business, the CSI Solar business and the project business we call Global Energy business group. We don't really compare therefore, make decisions of where to allocate the capital. Now with that, I would like to have Yan to answer your first question, which is about CapEx, manufacturing CapEx and whether we are spending the CapEx money on TOPCon or vertical integration or upgrade, things like that. Well, so the current expansion plan, excluding the silicon capacity expansion, is actually -- it's covered by different sources, so such as for Thailand and the U.S. manufacturer, the proposal on the -- the U.S. manufacturing projects are covered, mostly covered for the customer down-payment. And for other CapEx expansion plans, itâ\u0080\u0099s a combination of either the operating income or the bank lendings. So for those CapEx expansion, we don't really depend on the China IPO and the silicon capacity is more longer term. Ingot, cell and the module, it's really very detailed breakdowns. But overall speaking, I think we're okay on our CapEx coverage and cash flow. And I see the backlog in North America has increased a lot, the early-stage pipeline. Actually, as you know, the utility scale storage projects are -- we have -- actually, they have a much longer lead time on sales. So whatever project that we need to execute, for example, right now, in the first half of 2023, the contract actually was closed a year ago or even longer. So -- and so by -- as you remember, around beginning of 2022, we had a pretty dramatic change in the -- on the supply chain of storage. But that was the time that our sales level, we decided to switch from white label product to our own developed SolBank product. So that's why we -- the pipeline we have today is more towards second half of this year, not first half of this year. So in terms of recognition and shipments, itâ\u0080\u0099s kind of very much skewed to the end of this year. And however, if you look at our signed contract, the signed contract carries about USD 1 billion already. Reason behind this, we know next year, we're not going to have enough capacity. So we know that next year, where we're going to reach either 10-gigawatt hour or close to that number next year already. Hopefully, this answers your question. I know you addressed it a little bit earlier, Yan. I know you gave a little bit of color, Shawn, on that with the expectation of the IPO completion in Q2. Philip, thanks, and we are also pleased that we received the approval for the registration. We will talk to our bankers about the roadshow schedule, roadshow and pricing and investment schedules and hopefully update you. However, it depends on the market condition. We all know that a lot of things happening in the capital market in the U.S., Europe and also we expect the high volatility in the Chinese capital market, too. However, as you know, we have been working on this for 2.5 years. So obviously, we want to get that deal done as soon as possible. And then there's a process such as further update our financial information and then roadshow et cetera, et cetera, but it will be very quickly and doing process, no more regulatory approvals are needed. Going forward, it's our own marketing efforts with the bankers, et cetera, and the investors. And then in terms of the use of proceeds, obviously, the good news only arrived this morning, a couple of hours ago. And before that, we actually have prepared the cash for the $1.5 billion CapEx in the new year. So now with this IPO proceeds, now in certainty, obviously, we'll be looking for speed up even more in vertical integration and capacity expansion, especially the support to the U.S. market. So in terms of shipping cost, it came down to just a little over $0.01, like $0.015 in Q4 and $0.013 in Q1. So it was much lower than the peak was like almost $0.03, so more than $0.03 actually in the peak. So as you know, the total shipping cost will increase as volume goes up. The unit cost is coming down, not saying we'll maintain this low level and we bounce back a little bit. But overall, we see the situation stabilized coming back to a normal stage. So operating expense, we don't see any major change because aside from the costs that are associated with the volume growth. And actually, we do see some leverage scale -- on scale. As it relates to the margins, you guys gave the official guidance for Q1. So I think overall speaking, we still believe that polysilicon costs will continue to go down. So on cost going down, demand going up even more. So however, we also understand there are complexities on the supply chain. But overall, I think our margin will be in a better situation. There's a bit of module supply building, even some double-digit pricing declines being quoted. So actually, I feel less smart price pressure compared to the old times. So we do see module price coming down gradually, but we also realized that the market the industry, the customers actually are now worried more than just pricing. The reliability on supply and bankability and quality of the products, it's all becoming important. There's a last little -- there's less speculation, speculative behavior today than before. So price-wise going down, but I still believe that our margin will continue to improve. So give us a few weeks or maybe months in one or two months, and we will make an announcement. And the U.S. manufacturing facility, part of the CapEx will be covered by the customer down-payment. Just with capital markets volatility, we've also seen a lot of volatility, specifically in the financing environment banking environment. Look, in general, when the interest rates move up, puts pressure on project ownership because at the end, you need to be given a differential from the interest rates. In terms of capital availability, we see terms of capital in the market. I'm not seeing any capital constraint right now; actually, the opposite. I think that there is, right now, at least the feeling I have is that there is way more money than projects ready to be invested on. For funding costs, there are actually two dimensions. You are correct, on one dimension in the general capital markets, all costs are going up, and we see that, too. But on the other hand, a lot of projects in different markets, the government, the local financial institutions and also investors, they want to push into that direction. But overall speaking, we do have a mixed pricing mechanism on the battery cell supply agreement. And I noticed that along with our utility scale storage products, SolBank, we also released a residential storage product, EP Cube. As we see the competition in residential storage market, itâ\u0080\u0099s getting more and more intense. So first, to answer the last question on the margin side, I think as you know that on the utility storage side, we're actually targeting mid-teen gross margin. And the -- sorry -- yes, starting from the SolBank. And for EP Cube, the margin is much higher. And we're actually launching a setting in the U.S., and we will start to sell in Europe in Q2 and Japan, so very quickly around the similar time. So by year-end, we should have a global launch. And we don't really -- we provided some annual guidance on volume, which is 100-megawatt hour. However, for the real growth scale will be next year for EP Cube and the same with SolBank for next year. Well, so we're targeting long term like 10% market share However, we want to get more market share in the more premium markets because EP Cube is actually designed as a high-end product, with the ability to gain profit -- more profit in the long run. At this time, I'll turn the floor back to Canadian Solar's CEO, Dr. Shawn Qu, for closing remarks. If you have any questions or would like to set up a call, please contact our Investor Relations team."
}