{
    "symbol": "DYAI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-12 23:16:05",
    "content": " And furthering the validation efforts for our C1 platform, we intend to file our first in-human clinical trial application CTA with the South African Health Products Regulatory Authority, SAHPRA, to support the clinical safety of C1 produced proteins, including our DYAI-100 COVID-19 vaccine candidate. The demonstration of safety in humans for a C1 produced therapeutic will accelerate Dyadic's business development efforts in vaccines, obviously, but also other therapeutic proteins, as the results are the platform validation that increases value for our partners and reduces their developmental risk analysis. To expand on Joe's point regarding business development in our vaccine segment, last month we announced Epygen Biotech Dyadic's nonexclusive licensee receive funding from the Indian government to further the development, manufacturing, conduct Phase 1 and 2 clinical trials of their COVID-19 vaccine candidate produced from C1 cells. Since 2016, we have been focusing our research and development efforts to reengineer our industrially proven C1 protein production platform for used in biopharmaceutical manufacturing, and we are now able to generate C1 cell lines that can rapidly produce stable proteins with desirable properties that can be manufactured efficiently and affordably with the potential to be used to prevent and treat animal and human diseases. We continue to demonstrate that our C1 protein production platform can serve as an accelerator to drug in vaccine development and commercialization by shortening the time line from preclinical to Phase 1 trials, increasing productivity and improving cost efficiencies. We expected first-in-human safety data for C1 produced product is expected to provide further validation of the C1 platform, which will enable Dyadic to offer in a new era of lower manufacturing costs and technological achievement into the drug and vaccine manufacturing industry as well as bolster our existing human and animal health, biopharmaceutical partnerships which our next highlight. I truly believe that Dyadic can help address, the functional breakdown and life failure in the global vaccine and biologics supply and distribution chain that is evident in health care and equity seen across the globe and even here in the U.S. Hopefully what you take from this call, is that we are not only committed and focused on improving the value for the life science industry which we will turn, improve value not just for shareholders but populations around the globe, but we're also taking definitive action by both from our executive team, the reorganization of our infrastructure and strategy in order to prepare Dyadic for commercialization opportunities to enable us to fulfill our mission as a global biotech company focused on further improving and leveraging, our patent and proprietary platform technologies in order to improve the way we feed fuel and heal the world. The decrease primarily reflected the winding down of activities of CRO and pharmaceutical quality, and regulatory consultants to manage and support the pre-clinical and clinical development, as well as a decrease in cGMP manufacturing costs, as the company moves towards its anticipated Phase 1 clinical trial of our DYAI-100 COVID-19 vaccine candidate in the amount of approximately $165,000 and our other internal research projects of $300,000."
}