{
    "symbol": "DYAI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 22:59:09",
    "content": " Data from vaccines produced from C1 proteins have repeatedly demonstrated safety and efficacy in a range of infectious diseases in animal trials with cattle, lambs, chicken, rabbits, hamsters and mice, again, demonstrating the preliminary safety of proteins produced from the C1 protein production system. In addition to establishing a track record of safety and humans for antigens produced from our C1 cells, the Phase-1 study is also expected to demonstrate preliminary efficacy of our DYAI-100 COVID-19 recombinant protein booster vaccine candidate. The output of these projects and collaborations validates the application of C1 as a differentiated bio manufacturing platform for developing and producing vaccines, antibodies, and other therapeutic proteins rapidly at higher yields, and lower costs for the prevention and treatment of infectious and other diseases such as oncology, arthritis, and diabetes. Expanding our vaccine licensing as early reported, Epygen, one of Dyadicâ\u0080\u0099s non-exclusive licensees received funding from the Indian Government to advance development, manufacture and conduct Phase-1 two clinical trials using Dyadic C1 protein production platform for their COVID-19 vaccine candidate produced from C1 cells. Joe just took us through the various preclinical animal models tested in a brief analysis of what we expect shortly allow us to demonstrate the big pharma, biotech companies in government and academia globally the safety profile for recombinant antigens produced using our C1 platform for the commercial production of recombinant vaccines. While we still have work to do, the interest we are generating in a knowledge gain a rapidly expanding interest not only in the roadmap, but also across many areas in which our C1 platform can be applied for rapid production to large quantities of antibodies, vaccines cause large and mid-sized pharmaceutical companies and human and animal health. Under this grant Dyadic has already started to receive $690,000 in funding to engineer a C1 protein production platform to produce two different antibodies, with a focus on availing evaluating the ability of the C1 platform to rapidly produce medical countermeasures and vaccines in response to future pandemics. Our focus is to speed the acceptance of our C1 protein production platform, which we believe can serve as an accelerator to drug and vaccine development and commercialization by shortening the time from preclinical to phase trials, increasing productivity, and improving cost efficiencies within animal health."
}