{
    "symbol": "AAT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 16:56:02",
    "content": " In Q2, we saw vacant units at Hassalo leased at an average of approximately 15% over prior rents, and renewal unit leased at an average of approximately 6% increase with concessions ranging from zero to eight weeks, depending on product type, and most recently, over the past few weeks, no concessions at all. In Q2, our four largest renewals, totaling approximately 130,000 square feet were Whole Foods at Alamo Quarry, bonds at Lomas Santa Fe Plaza and Petco and Ross at South Bay marketplace, with rents increasing 10%, 15%, 8% and 10%, respectively, later this year or early next upon renewal. Second quarter results are primarily comprised of actual FFO increasing by approximately $0.01 to $0.58 per FFO per share compared to the first quarter of 2022, primarily related to outperformance by the Embassy Suites hotel and Waikiki Beach on the Hawaiian Island of OÊ»ahu. To put it in perspective, for the year ending 2022, we are expecting same-store cash NOI metrics to be approximately as follows; office ending at 8.3%, retail ending at negative 3.7%; multifamily 10.6%, mixed use at 49% for a total same-store cash NOI of 7.4%. Excluding a $2.4 million property tax refund received at Ala Macquarie Shopping Center in 2021 and higher collections of COVID back grant in 2021 for prior periods, retail same-store cash NOI is expected to be approximately a positive 3% for the year. We are once again increasing our 2022 FFO per share guidance range to $2.21 to $2.27 per FFO share with a midpoint of $2.24 per FFO share, a 3% increase from our previously updated guidance issued in our Q1 2022 earnings call that had a range of $2.13 to $2.21 with the midpoint of $2.17. First, our Waikiki Beach Walk, Embassy Suites and retail contributed approximately $0.02 per FFO share of outperformance Q2 2022 that was not previously included in our 2022 guidance. In the second quarter, we executed 15 leases totaling approximately 148,000 rentable square feet, including approximately 12,000 rentable square feet of comparable new leases with increases over prior rents of 48.9% on a straight-line basis. And approximately 116,000 rentable square feet of comparable renewal leases with increases over prior rents of 18.3% on a straight-line basis, including renewing VMware at 75,000 rentable square feet at City Center, Bellevue."
}