{
    "symbol": "AAT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 14:08:02",
    "content": " I want to mention that the Board of Directors has approved the quarterly dividend of $0.33 per share for the first quarter, an increase of $0.01 per share or approximately 3% from our previous dividend, which we believe is supported by our financial results and is an expression of our Board's confidence in the embedded growth of our portfolio this year and beyond. Though our multifamily leased percentage decreased a few points towards the end of 2022 due to seasonality, we are pleased to report that as of the end of January 2023, our lease percentage had increased from approximately 92% to 96.5% in San Diego and remained at about 94% in Portland. Second, we increased our reserve for straight-line rents receivable related to two tenants in the fourth quarter combined with higher accelerated non-recurring straight-line revenue in Q3 that did not occur in Q4, which together reduced FFO per share by approximately $0.04 in Q4. Though, the 2022 year-over-year same-store retail NOI growth was essentially flat, if we exclude the 2021 property tax refund of approximately $2.4 million for Alamo Quarry that was received in Q3 2021, our same-store retail NOI growth increased from flat to 3.9% in 2022 and same-store cash NOI for all sectors combined on a year-over-year basis increased from 9.5% to 10.7%. We are introducing our 2023 FFO per share guidance range of $2.16 to $2.30 per FFO share with a midpoint of $2.23 per FFO share, which is approximately a 4.7% decrease over 2022 actual of $2.34 per FFO share at the midpoint. Number three, we are including approximately $0.06 per FFO share of bad debt reserves that we believe are more likely than not to occur based on our internal probability and risk assessment of specific tenants within our portfolio. Number one, same-store office cash NOI, excluding reserves, is expected to increase approximately 4.3% or $0.08 per FFO share in 2023. Number two, same-store retail cash NOI, excluding reserves, is expected to increase approximately 4.2% or $0.04 per FFO share in 2023. Number four, estimated bad debt expense reserves is expected to decrease FFO by approximately $4.2 million or $0.06 per FFO per share in 2023, which we have previously described in more detail above. Number five, all four sectors above excluding reserves are expected to generate a total same-store cash NOI growth year-over-year in 2023 of approximately 3.4% or $0.12 per FFO share. Including reserves, all four sectors are expected to generate a total same-store cash NOI growth in 2023 of approximately 2% or $0.06 per FFO share. Number six, non-same-store guidance including One Beach Oregon Square building 710 in Bellevue Spring 520, combined they are expected to contribute approximately $0.01 per FFO share in 2023. Number eight, interest expense is expected to increase approximately $7.4 million and decrease FFO by $0.10 per FFO share in 2023, which we have previously described in more detail above. And number ten, litigation settlement will increase FFO by approximately $6.3 million or $0.08 per FFO share in 2023, which we have previously discussed above. These adjustments, when added together, will be approximately $0.11 per FFO share and represent a net decrease in 2023 midpoint over 2022 FFO per share. In the fourth quarter, we executed 17 leases totaling approximately 97,000 square feet, including one comparable new lease for approximately 2,400 square feet with increases over prior rent of 19% on a straight-line basis; 12 comparable renewal leases totaling approximately 75,000 square feet with increases over prior rent of 25% on a straight-line basis; and four non-comparable new leases totaling approximately 20,000 square feet, two of which were new medical office leases totaling approximately 15,000 square feet at triple net rents 35% and 41% higher than comparable office rents at Solana Crossing and Torrey Reserve respectively."
}