{
    "symbol": "VRRM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 20:35:04",
    "content": " Adjusted EBITDA of $84 million for the fourth quarter also exceeded our forecast, driven by volume-based operating leverage in both Commercial Services and Government Solutions. Service revenue increased 10% over the fourth quarter of the last year, driven by the completion of the New York Cityâ\u0080\u0099s school zone speed installation. T2 Systems delivered revenue of $20 million with adjusted EBITDA of $4 million; and for the full year, revenue of $79 million and adjusted EBITDA of $14 million. Total revenue increased approximately 9% year-over-year to about $186 million for the quarter, driven by strong operating performance across the company and the inclusion of T2 Systems in our financial results for a full year. Expanding on this point, given the prior year included an incremental $21 million of product sales from the New York City camera installations, revenue growth is the best proxy for our performance. This growth was attributable to several factors: first, Commercial Services grew 14% year-over-year; second, Government Solutions service revenue increased by about 19% over the prior year; and finally, T2 Systems contributed about $15 million of service revenue. Finally, from a total profit standpoint, consolidated adjusted EBITDA of $84 million increased by approximately 5% over last year. For the full year, we delivered total revenue of $742 million and adjusted EBITDA of $339 million, resulting in margins of about 45.6%, all of which exceeded our most recent financial guidance provided during our third quarter earnings call. From a free cash flow perspective, our conversion rate from adjusted EBITDA was 50%, resulting in $170 million of free cash flow for the year, consistent with our expectations. We delivered revenue of about $82 million in the fourth quarter, increasing $10 million or 14% year-over-year. Fourth quarter adjusted EBITDA in Commercial Services was $49 million, representing $12 million -- a 12% year-over-year growth. For the full year, Commercial Services generated $326 million of revenue or 25% growth over last year. Adjusted EBITDA of $209 million resulted in margins of about 64%, a 250 basis point improvement over prior year driven by volume-based operating leverage. Driven primarily by our New York City photo enforcement expansion efforts, service revenue increased by $13 million or 19% over the same period last year to $82 million for the fourth quarter. Due to the completion of the New York City camera installations, Q4 2022 product revenue of $2 million declined by about $21 million compared to the fourth quarter of last year. Adjusted EBITDA was $31 million for the quarter, representing margins of 36%, roughly flat with the prior year quarter. For the full year, Government Solutions generated $337 million of total revenue, a 19% increase over 2021 and adjusted EBITDA was $116 million for the year, a 7% increase over last year. For the full year, T2 delivered revenue of $79 million or approximately 11% growth over last year and adjusted EBITDA of $14 million. For the full year, we generated $170 million of free cash flow or 50% conversion of adjusted EBITDA, which represented $1.07 free cash flow per share. As I mentioned earlier, product revenue is expected to decline to approximately $3 million per quarter due to the New York City installation completion. To give this greater context, while New York City service revenue is expected to increase almost 10% year-over-year, total 2023 New York City revenue will decline by about $6 million due to the decline in product revenue versus 2022."
}