{
    "symbol": "VRRM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 05:33:02",
    "content": " Starting with Commercial Services, the team again delivered strong performance; revenue of approximately $86 million for the quarter represented an 11% increase over the same period last year. Moving to our Government Solutions business, we generated a total of $90 million, representing growth of 6% over the same period last year. Finally, T2 Systems delivered $22 million of revenue for the quarter, in line with our internal expectations and on track to deliver double-digit growth over full-year '21 results. Total revenue increased approximately 22% year-over-year to about $198 million for the quarter, driven by strong operating performance across the company and the inclusion of T2 Systems in our financial results. Let's turn to slide six, and we'll take a look at the results of the Government Solutions business, driven primarily by our New York City photo enforcement expansion efforts, total revenue increased by $5 million or 6% over the same period last year to $90 million for the third quarter. Service revenue for the third quarter was $77 million, which grew $13 million or about 20% year-over-year. Product revenue declined $8 million to about $12 million for the quarter, which is in line with expectations as we effectively completed the New York City school zone speed installation programs. Going forward, we expect the Government Solutions quarterly product revenue run rate to be approximately $3 million per quarter and primarily driven by international programs. Moving on to cash generation for the third quarter, we generated approximately $52 million in cash flow from operating activities, resulting in $39 million of free cash flow for the quarter or a 43% conversion of adjusted EBITDA. During our second quarter call on August 3, following an increase in guidance at our July 19 Investor Day, we reiterated guidance as follows: total revenue in the range of $720 million to $740 million and adjusted EBITDA in the range of $325 million to $335 million. Great, I appreciate it. Great, I appreciate it."
}