{
    "symbol": "RYTM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 11:23:10",
    "content": " We are accomplishing everything we set out to do, find diagnosed patients, educate physicians on the disease state to help additional patients get to an accurate BBS diagnosis, educate physicians on the M4 pathway and IMCIVREE, facilitate reimbursement and insurance coverage and have a seamless initiation on IMCIVREE therapy. So, I do believe that the pediatric endocrinologists and the endocrinologists will remain a key physician specialty that will be taking care of these patients, but additional physicians will also be coming up in terms of participating in the care of BBS patients overall. But the fact that we're getting broad-based engagement here, and that's not inconsistent with the experience Jennifer and I have had in other diseases where physicians who are following these patients as part of their primary care step up and become more expert and are willing to learn how to prescribe the drug and use it. As we received scripts, we also are able to understand the prescriber  that is added in terms of targets for our GMs to go out and educate and also make sure that there's ongoing engagement with them throughout the process as patients are also being initiated on therapy. We do expect that on top of the efforts of the GMs on grounds, we are going to come across additional physicians who have patients and are maybe interested in terms of prescribing this therapy for their patients, just because of our broad-based non-personal promotion efforts, which expands our reach beyond the ability of our teams on grounds. I will say that within the BBS patient population, the BBS foundation itself is quite strongly organized, they did quite a nice job just in terms of organizing these past events to have that opportunity for the patients to engage with each other, learn from each other, but we had the opportunity to present information just in terms of IMCIVREE itself."
}