{
    "symbol": "ORLY",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 16:16:25",
    "content": " We started the quarter in July with improving volume trends, driven in part by warm weather across many of our markets and we're pleased to see these trends continue through the quarter with positive comparable store sales growth on both the DIY and professional side of the business, each month of the quarter. Our third quarter professional comparable store sales growth was a continuation of the strength we saw in the second quarter, with the continued benefit from average ticket growth supplemented by accelerating ticket count gains and we're very pleased to see the strong durable nature of our professional sales volume. As I previously noted, our DIY business was positive each month of the quarter, with comparable store sales increases, driven by growth in average ticket, being partially offset by anticipated traffic pressures, with both metrics outperforming our expectations for the quarter. We saw improvement in ticket counts on the DIY side, as we progress through the quarter, while calendaring very challenging prior year comparisons and we are pleased to see the resilience in our DIY customer base, in spite of continued pressure from broad-based inflation. In total, our combined DIY and professional comparable store sales growth was again driven by strength in average ticket, which was approximately 10% on both sides of the business and consistent with what we saw in the second quarter. While the year-over-year increase is impressive alone on a three-year compounded basis compared to 2019, our third quarter EPS increased 22% per year, highlighting our team's ability to deliver consistent profitable growth through executing our business model regardless of the tough comparisons we have faced. As Greg previously discussed, strength in our professional business underpinned our comparable store sales growth for the quarter and we are extremely pleased to continue to see robust growth in both ticket and traffic on this side of our business. We believe it was our team's intense focus on fundamental execution of our business model and excellent customer service, coupled with continued improvements in fill rates and store in-stock inventory position that drove our results above our expectations in the third quarter. For the full year, we now expect SG&A per store to grow between 3% and 3.5% with the increase reflecting incremental variable operating expenses on better-than-expected sales volumes in the third quarter as well as ongoing cost inflation. Greg covered our gross profit performance earlier, noting that gross margin for the third quarter was in line with our expectations with anticipated year-over-year pressure from the rollout of the Pro pricing initiative, LIFO comparisons and accelerated professional sales mix headwind. Our AP to inventory ratio at the end of the third quarter was 135%, which once again has set an all-time high for our company and was heavily influenced by the extremely strong sales volumes and inventory turns along with the impact from increased inflation in product acquisition costs. But really all year, our battle cry from our EVP of Stores Doug Bragg has been, we're going to get out of the COVID funk and not accept where we may have high turnover in stores, high team member turnover, high store manager turnover, that's just not acceptable with the way we built our business, getting out seeing more customers, not having that excuse that unfortunately we made for ourselves the last couple of years, that we're just getting back to the execution that built our company and making sure that we don't have that hangover from COVID and everything we do."
}