{
    "symbol": "ORLY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-28 14:47:03",
    "content": " In the second quarter, our team was able to generate a 4.3% comparable store sales increase after driving comp increases of 9.9% and 16.2% in the second quarters of 2021 and 2020, respectively, resulting in an incredible three-year stack of 30.4%. Team Oâ\u0080\u0099Reilly has continued to translate to robust sales growth into outstanding returns for our shareholders, highlighted by second quarter diluted earnings per share of $8.78, which is an increase of 5% over our extremely strong second quarter 2021 and when we grew EPS by 17%. Next, Iâ\u0080\u0099d like to spend time walking through some details of our sales performance for the second quarter and the factors that drove our results as well as provide some color on our revised comparable store sales guidance for the full year. While we remain very positive on the prospects of our industry and our business, we are also cautious in our assessment of the pressures from high fuel prices and broad-based inflation that impacted our second quarter performance and the potential for continued pressure as we move through the balance of 2022. At the midpoint, our revised comparable store sales guidance range reflects solid growth over 2021 and a three-year stack increase of 28%, and we still view this as a very favorable outlook reflecting our ability to outperform the market and gain share. While pressures to our DIY customers from spikes in fuel prices and persistent high inflation, weighed down the top line sales growth we were expecting to see, we are still pleased with our teamâ\u0080\u0099s ability to drive solid, positive sales increases on top of two consecutive years of record growth for our company. Greg covered our gross margin performance for the second quarter and reiterated our full year guidance, but I want to briefly recap that we are not expecting a significant LIFO benefit to our gross margin results in 2022 as a result of more typical LIFO accounting after our reserve returned to a credit balance in 2021. Your line is now open. I think for us, specifically, as weâ\u0080\u0099ve thought about how the back half of the year lays out, we understand on a one year basis that, that weâ\u0080\u0099ll see some pressure as average ticket moderates, but still continue to be very optimistic about continuing traction weâ\u0080\u0099ll see on our professional pricing initiative. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}