{
    "symbol": "CTLP",
    "quarter": 3,
    "year": 2022,
    "date": "2022-05-08 22:00:06",
    "content": " With me on the call today is Sean Feeney, Chief Executive Officer; Ravi Venkatesan, Chief Operating Officer; and Scott Stewart, Chief Financial Officer. Before we get into today’s call, I would like to remind you that all statements included in this call other than statements of historical facts are forward looking in nature. Actual results could differ materially from those contemplated by the forward-looking statements, because of certain factors including, but not limited to, business, financial, markets and economic conditions. Listeners are cautioned to not take place undue reliance on any such forward looking statements, which reflect management’s view only as of the date they are made. Cantaloupe undertakes no obligation to update any forward-looking statements whether because of new information, future events or otherwise. This call will also include a discussion of certain non-GAAP financial measures that we believe are useful for among other things, evaluating Cantaloupe’s operating results. Details of these non-GAAP financial measures and the presentation of the most directly comparable GAAP financial measures and the reconciliation between these non-GAAP financial measures, as well as the most comparable GAAP financial measures can be found in our press release issued this afternoon, which has been posted on the Investor Relations section of our website at www.cantaloupe.com. And with that, I would like to turn the call over to Chief Executive Officer, Sean Feeney. We reported a solid start to the calendar year 2022, increasing total revenue by 18% year-over-year, marking our fourth consecutive quarter of double digit annual revenue growth. Transaction revenue for the quarter grew 31% year-over-year, encouragingly, the strength in the transaction volumes has continued into April as offices begin to reopen. Subscription fees grew 7% in the quarter, and we continue to drive subscription growth with initiatives like our recent launch of the Cantaloupe ONE platform, which Ravi will discuss in more detail shortly. We expect a lift in equipment revenue in q4, typically our strongest quarter as more operators prepare for the 3G to 4G and EMV upgrades. We saw a 22% increase in active customers and in total, we achieve a 36% increase in total dollar volume of transactions, a record for the fourth consecutive quarter. Just last month we attended the NAMA show in Chicago, where we hosted a number of customers and prospects at our booth. We showcased many of our new products including Yoke 2.0, our AI-enabled merchandising offering with HIVERY, and Our Seed Warehouse App, to name a few. First, more than ever, the industry is poised for expansion and growth through innovation and technology is top of mind for operators. Second, the M&A market is very active, led by many large operator who are also seed customers and are leveraging seed to standardize their technology stacks across all branches for complete operational visibility post acquisitions. There's also an explosion of small operators, leveraging technology and niche markets to grow and diversify their offerings. Thirdly, operators are increasingly focused on engaging customers to drive additional revenue through advertising, interactive devices and loyalty programs. Lastly, there is a lot of innovation on the next generation of convenient services and micro markets and the next generation of vending solutions including concepts like smart coolers, which provide a hybrid experience in both traditional vending and a micro market. Specific to Cantaloupe, operator feedback is that they have seen a dramatic improvement in our customer service since the August 2021 NAMA conference. Pete Cordaro, owner of CRH Catering company, headquartered in Pennsylvania, a well respected vending industry operators that the Cantaloupe has world class technical support, and that seed has revolutionized the industry and greatly increased the value of our business. With our technical expertise and continuous focus on customer success, we believe we are well-positioned to provide operators with ways to engage consumers and increase same-store sales as well as to optimize their businesses now, and in the future. The Buffalo Rock Company, a large Pepsi bottle are serving Alabama, Georgia and Florida with 14 franchise operations, 13,000 vending machines, 350 Plus micro-markets in 1400 office coffee service delivery points is a great example of a significant customer expansion during the quarter. During the quarter Vendedge, who was a client that left our platform two years ago for a competitor returned to Cantaloupe for our full suite of cloud software, Seed Pro, Seed Office, Seed Markets and Seed Delivery. Other new seed customer wins in the quarter include Refreshment Works, Break Time Vending and Jordan Distributing. Additional hardware expansion wins in the quarter include Cash Depot, Pepsi, Florence, and Sega, among others. Finally, we continue to develop exciting new initiatives to enable our customers to increase revenue through new modes of payment, additional consumer engagement functionality, as well as new business tools for running a more efficient operation. On that note, I would like to turn the call over to Ravi Venkatesan, our Chief Operating Officer to discuss some exciting and important product updates. As Sean mentioned, we recently returned from NAMA, which was a great success for us. And this year, it was energizing to showcase and actively sell these products to an enthusiastic customer response. First, our Seed Warehouse app, which we released on March 16. This app streamlines the workflow within the warehouse, enabling functions like stock taking, inventory reconciliation, et cetera to happen rapidly through an easy to use mobile app. For example, Tommy Elliott from Tomra Vending and Coffee Services said, we used to dread doing inventory, but now we can do it twice as fast with the new warehouse app, saving time and making our business more efficient. Tyler Daily from the Jackson Brothers of the South recently said, we were having a hard time getting accurate warehouse and driver inventory information. It brings the cloud computing like paradigm to unattended retail, eliminating upfront capital expenditures and the risk of hardware end-of-life due to transition such as 3G to 4G, EMV et cetera. Thanks to zero upfront fees, and a simplified monthly subscription model, this platform is starting to gain significant market traction. We've already shipped over 25,000 ePort Combo and Engage devices during the third quarter. A highlight for us at NAMA, was our next-generation Yoke platform, as well as the newly announced Yoke point-of-sale plus product. This upgraded platform provides an enhanced consumer interface, customized promotion and loyalty program capabilities, as well as a unique mobile app that supports new engagement features. The Yoke POS Plus version enables both cashless as well as cash acceptance, and is expected to be available to our customers later this calendar year. One of our customers Chris Cationne from Group C stated for every one micro market with other solutions, we can have 10 Yoke market, because it is just that cost effective. As part of our quick-to-market strategy, we also continue to leverage new and existing partnerships to rapidly bring exciting products to our industry. For example, we recently announced a partnership with Vendors Exchange to extend the reach of our seed remote price change product, extending the compatibility to 99% plus of vending machines in the U.S. We've launched this product and already sold it into our first few customers and are seeing a very strong pipeline for it. HIVERY was a very hot item at our NAMA booth this year, and we've already signed our first few customers. Lastly, we've partnered with Vendekin to enable a true touchless mobile app-enabled vending experience. With this technology, consumers can now simply scan a QR code using their smartphone, select products, make payments, all of it without ever touching the vending machine. It was an exciting quarter with the release of many new products as we continue to help our customers reduce their operating costs and capital expenditures, as well as streamline their processes and scale their businesses. With that, I'd like to turn the call over to Scott to go over our financials in greater detail. During the third quarter, we continued our strong trends of year-over-year growth. Q3 2022 revenue was $50.3 million, an 18% increase year-over-year, driven by subscription and transaction fees of $42.1 million and equipment sales of $8.2 million. Transaction fees grew 31% in the third quarter, another company record. Equipment revenue for the third quarter was relatively flat year-over-year, as many customers held off on delivering a 4G device upgrades and so closer to the discontinuation of 3G network support starting in 2022. Due to this, we expect equipment revenue to accelerate through the end of 2022 calendar year. Active customers increased 22% year-over-year to 23,800 customers. Active devices totaled 1.1 million as of March 31 2022, an increase of 4% year-over-year. Total gross margins for the quarter was 32.2%, up from 29.7% in prior year fiscal third quarter. We've meaningfully expanded gross margins on our transaction fees to the mid-teens during the quarter, which we believe will continue going forward. Equipment revenue margin for Q3 FY 2022, improved 11 basis points to negative 8% from negative 19% in prior year. Operating expenses in the third quarter totaled $15.3 million, compared to $14.7 million in Q3 2021. We've continued to increase our investment in R&D for product innovation, and in our sales force to acquire new customers, while we continually reduce G&A. Net income applicable to common shares improved for the third quarter to $1.8 million, or $0.03 per share, compared to a net loss of $2.2 million, or a loss of $0.03 per share in the prior year period. Adjusted EBITDA was $3.7 million in the third quarter, compared to $2.2 million in the prior year period. Relative to our balance sheet and liquidity, we ended the third quarter with cash and cash equivalents of $75.1 million. In March, we amended our debt facility, which has improved pricing and makes available an additional $10 million increase to our term loans that can be borrowed for up to one year from closing. We remain confident in our previously issued guidance for revenue and continue to expect to be between $200 million and $210 million, representing year-over-year growth of 20% to 26%. We expect transaction and subscription revenue to continue to grow based on increased dollar and transaction volume, as well as incremental subscription revenue from new and existing customers. Your line is now open. So overall, what we're seeing is our margin on transactions are increasing. And so, we've entered into some new agreements to get some additional incentives and rebates, which is really helping reducing our costs, which is growing the margin. So when we began the year, we were around, I guess, last year's average was around $2.05 per transaction. It's a great question, Mike, and you know that's something that we are very focused on. So first of all, signing large customers like Buffalo Rock are key to kind of growing the subscription revenue, and that has the biggest kind of near-term impact. Secondly, we're very excited about the initial market reaction to the Cantaloupe ONE Platform as a Service, and we've sold into the hundreds of customers on that. It fits very well in the SMB part of the market, not quite as attractive to the high end of the market because they like to buy devices and depreciate them. Now it will have a negative impact on equipment revenue, but I think we're all very happy to trade equipment revenue for subscription, especially when it's bundled into the subscription, we get higher margins on that. If we see kind of continued transaction growth that we saw in March and into April, as people begin to come back to the offices and travel, business travel and business hotels kind of come back around that. And then, we've got a number of kind of remaining 3G and 4G upgrades on that, and it really determines kind of on what the hardware sales are for Q4. Your line is now open. Investors understand that Apple has been extremely successful with a hardware as a service offering, and the markets seem to yarn at your release. I think, George, you've hit the nail on the head with kind of -- if you look at kind of the traditional cable model, Apple has done it a couple of days after we announced. I feel like the company just keeps performing better and better, and as we all know, the stock price isn't reflecting that performance yet. So, we'll give you some more details kind of probably at the end of the next quarter where we have a full quarter's worth of results from that. But for capital challenge, smaller customers, it works very well. So more broadly, on the hardware side, you had a competitor make a strategic decision to maintain very low gross margins on the hardware side, at least temporarily. I assume your position is still -- you'll gladly take a service deal instead of a hardware deal if that's how it comes out, and you're willing to work with other hardware vendors. If I understand your question, George, yes, we -- our software works with everybody else's hardware. And while we prefer -- and I'm working on some things that would make it better for our software to work with our devices, many large operators use our competitor products and have kind of strategies around two or three competitors. But -- and then the second part is, I will gladly trade as much Cantaloupe revenue -- one revenue as I can for hardware, because the hardware margin is better and the likelihood of it going beyond the initial term is very good as everyone knows from other kind of platforms as a service. Apple, you mentioned, I mentioned kind of the cable company. We've got a couple of good things working, and they're very close to having our devices certified there. So I'm optimistic that we will see revenue in our next fiscal year, which, of course, starts in July 1. We have hired our first employee in Europe, and we did a bunch of meetings during NAMA with international operators, and we are more confident than ever that there's a Seed opportunity in Europe, and we're moving aggressively towards that. One of the reasons that we hired Jeff Dumbrell as our Chief Revenue Officer was, he had a lot of international experience. He's begun -- the guy we hired in Europe is one of his former teammates, and we're aggressively kind of moving in those markets as well as in Latin America. Your line is now open. We've got a lot of good activity around unattended spaces beyond vending with our Yoke platform, and we're working on a couple of exciting partnerships. So stand by Mark, I think you'll see some things here either in this quarter or the next. I know today is a busy day with earnings, and we look forward to following up with everyone over the next few weeks."
}