{
    "symbol": "IAS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 20:28:04",
    "content": "  Operator: Thank you for standing by, and welcome to IAS Fourth Quarter and Full Year 2022 Financial Results Conference Call. Good afternoon, and welcome to the IAS 2022 fourth quarter and full year financial results conference call. We refer you to the company's filings with the SEC, posted on our Investor Relations site at investors.integralads.com, for more details about important risks and uncertainties that could cause actual results to differ materially from our expectations. For the full year, revenue grew 26% to $408.3 million at a 31% adjusted EBITDA margin. By prioritizing technology and product innovation, superior customer service, and deep partner integrations, we ended the year with positive business momentum heading into 2023. We invested in our platform partnerships and product expansion in programmatic, social, and connected TV. We signed 12 new global partnerships, broadening our measurement capabilities and reach to benefit our marketers. In 2022, we won several large multi-year deals including JP Morgan Chase, LinkedIn, Progressive, and Kimberly-Clark. Today, we are excited to announce several new competitive wins that reinforce our standing in the market as a leading provider and formidable competitor. Ford, Hershey, Bel and Kering selected IAS after extensive tech and product due diligence versus other competitors. As these are major global wins with marquee brands, weâ\u0080\u0099d like to walk you through why they chose to partner with IAS. We expect to expand our coverage with Ford from 17 to over 50 markets, including the U.S. which had been serviced by an incumbent provider. Hershey chose IAS based on our differentiated CTV technology, campaign automation, and high standard of service. Bel, a world leader in branded cheese including Babybel, and a major player in the healthy snacking segment, awarded IAS with a global deal. Bel was impressed by IASâ\u0080\u0099 measurement capabilities, our integrations with the leading tech partners, and our superior customer service. Kering, a major worldwide luxury group with notable brands such as Gucci and Yves Saint Laurent, signed a global deal with IAS in the first quarter of 2023. We clinched this win as a result of our leadership in the luxury vertical, superior technology, integrations with Google, and exceptional client support. In 2022, we expanded our global presence in markets including India, Indonesia, South Korea, Taiwan, Vietnam, Denmark, and Norway. Lastly, we enhanced our senior leadership team with key appointments including Tania Secor as CFO, who joins us today. We increased our employee count to 835, up 10% year-over-year. Now letâ\u0080\u0099s review some of the key growth drivers of our business including programmatic, social, and CTV. In programmatic, contextual and non-contextual revenue increased in the quarter. As a result, marketers are shifting budgets to programmatic and relying on IAS to drive higher return on their ad spend. Our Quality Sync pre-bid product, which is integrated with large DSPs including The Trade Desk, enables partners to leverage our contextual tools in an efficient way. In addition, Total Visibility, our quality path optimization solution, helps customers increase efficiency and improve ROI in their programmatic ad spend. In addition, we found that thereâ\u0080\u0099s a 171% increase in conversions for impressions with time-in-view greater than 15 seconds. In social media, we are accelerating growth based on our advanced multimedia classification, or MMC, technology and platform expansions. As a reminder, our MMC technology powers content-level brand safety solutions at scale; it maps frame by frame, video-level data to the Global Alliance for Responsible Media, or GARM brand safety categories: Our TikTok offering includes a full end-to-end measurement suite in TikTokâ\u0080\u0099s For You feed. In 2023, we aim to scale marketer demand for our TikTok solutions and expand availability into over 20 additional markets. As a badged partner, IAS brings marketers a comprehensive set of media quality solutions to manage their advertising campaigns on TikTok. With Meta, weâ\u0080\u0099re excited to continue our partnership and value their commitment to implementing suitability controls and verification for Feed. With Twitter, we announced our expansion into third-party brand safety and suitability measurement in the U.S. With Tweet-level analysis, advertisers can better understand the content that appears adjacent to their ads on Twitterâ\u0080\u0099s feed. By the end of 2023, 78% of CTV video ad spending in the U.S. is expected to be bought programmatically according to eMarketer. For CTV publishers, Publica provides yield through unified auctions, inventory management and ad stitching that enables CTV content and ads to be delivered in a seamless stream. For marketers, we offer a single platform to verify, optimize, and measure addressable TV. In emerging channels, we continue to make progress with Spotify in audio, launching the industryâ\u0080\u0099s first third-party brand safety and suitability reporting tool for podcasts. In gaming, IAS announced its first-to-market partnership with Gadsme, a premium in-game advertising platform. Weâ\u0080\u0099re a volume-based model and not immune to volatility in ad spend; however, the essential nature of our solutions provides us with some level of insulation. Building on our accomplishments in 2022, we plan to continue to innovate further on behalf of our customers with data as the foundation. Under the leadership of our new CTO, we are enhancing our tech stack for greater scale and the ability to access, process and analyze data to fuel superior results for marketers. In conclusion, we made tremendous strides in 2022 to position IAS for long-term success. We strengthened our leadership team, invested in high-growth areas and solidified our partnerships. That requires focus and discipline in prioritizing IASâ\u0080\u0099 multiple growth levers and investments to drive durable, profitable growth. Having spent the past five years at The Interpublic Group Companies, a top five advertising holding company, I bring a deep understanding of the media landscape that has enabled me to ramp quickly. In both the Advertiser Direct and Programmatic segments, we saw improvement in automotive and tech/telco, as well as a stronger-than-expected contribution from World Cup advertising campaigns. For the full year, total revenue increased 26% year-over-year to $408.3 million. 2022 revenue included a full-year contribution from Publica versus 2021, which only included a partial year from Publica. Programmatic revenue for the fourth quarter grew 30% year-over-year to $55.1 million. Programmatic growth was primarily attributable to continued adoption of context control, including our contextual avoidance solutions. Context control represented 47% of total programmatic revenue in the fourth quarter, compared to 45% in the third quarter of 2022 and 38% in the fourth quarter of 2021. Advertiser direct revenue, which includes open web and social platforms, increased 2% year-over-year to $44.7 million. Video, which commands a pricing premium to display, accounted for 47% of total advertiser direct revenue consistent with the third quarter of 2022. On a combined basis, total revenue from advertisers, including advertiser direct and programmatic revenue, represented 85% of fourth quarter revenue. Supply side revenue from publishers increased to $17.6 million, including revenue from Publica. International revenue, excluding the Americas, increased 6% and represented 32% of total revenue in the fourth quarter. Our international business includes a lower mix of programmatic revenue, consistent with the industry. Gross profit margin for the fourth quarter was 81% compared to 84% in the prior year period, primarily reflecting increased hosting fees to support our premium offerings. For the full year, gross profit margin was 81% as expected. Sales and marketing, technology and development, and general and administrative expenses combined, increased 16% in the fourth quarter compared to the prior year period. This increase was primarily due to higher stock-based compensation expense and restructuring charges, partially offset by compensation savings in December related to the restructuring. In the fourth quarter, we incurred $5.3 million of restructuring and related charges due to the termination of approximately 120 employees in December. Turning to profitability and performance metrics; Adjusted EBITDA for the fourth quarter, which excludes stock-based compensation and one-time items, increased 20% year-over-year to $40 million. Adjusted EBITDA margin was 34% compared to the 33% midpoint of our prior guidance, due to stronger revenue in the fourth quarter. Foreign exchange, which is excluded from adjusted EBITDA, was a loss of $1.2 million in the quarter, down significantly from the third quarter loss of $4.1 million. Net income for the fourth quarter was $11.5 million, or $0.07 per share. Total advertising customers increased to 2,103 versus 2,073 last year. Total number of large advertising customers with annual revenue over $200,000 increased to 199 compared to 183 last year. Cash generated from operations and after investments in 2022 was used to decrease long-term debt by $20 million, repurchase $24 million worth of IAS stock at a cost of $7.68 per share in the third quarter, and increase our cash balance by $14 million. In terms of capital allocation, our strong cash flows and balance sheet capacity provide us with significant financial flexibility to invest in the business, both organically and via strategic acquisitions. As we look to 2023, we are monitoring the evolving digital media trends. While we continue to navigate the current macroeconomic environment, we believe we are well positioned to grow faster than the industry based on the value our products provide. For the first quarter ending March 31, 2023, we expect total revenue in the range of $102 million to $104 million. For the full year 2023, we expect total revenue in the range of $453 million to $463 million. A few additional modeling points: for the full year 2023, we expect gross profit margin of approximately 78% to 80%, reflecting investment in our data infrastructure and increased hosting costs. At the midpoint of our guidance, we expect adjusted EBITDA margin expansion in 2023. We expect increased operating leverage in 2023 as operating expenses, excluding stock-based compensation and one-time items, are expected to grow at a slower rate than revenue. We expect weighted average shares outstanding for the first quarter in the range of 154 million to 155 million, and for the full year 155 million to 157 million shares. We're very pleased with our fourth quarter performance, and we're off to a strong start in the first quarter of 2023. I'm excited to be part of the IAS team, and I look forward to engaging with all of you. The first, Lisa, and just as we all think about the Internet advertising sector, we kind of think about like bracketing into three buckets, you have Tier 1, which is like meta and search. Then you have like kind of other platforms, we'll call them like Tier 2 and then kind of like open web and display called Tier 3. So the way to think about macroeconomic and the way marketers invest in digital advertising, I'll say there are two buckets. And when you look at the trends right now, rapid explosive adoption of socials, all things related to social platforms; and secondly, streaming rapid adoption of CTV. They are core priorities for our 2023 product and tech road map, and we are innovating in both social and CTV, and that's where marketers are investing their digital advertising. The second point I want to make is marketers, they're investing more in video, again as where the users are going and how they're consuming media, they want site, sound, emotion. And when you take a look at our projections and where we are investing, we're shifting from display to video, and we'll continue to double down in video, both in Open Web and in the major platforms. You're guiding first quarter for 15% growth, the full year for 12%. So our guide reflects a pretty strong momentum that we're seeing right now as we head into the first quarter, continuing from the fourth quarter. And I would say, overall, our seasonality that we expect in 2023 should be similar to the seasonality we've seen in the past. And then second, happy to hear you talk about Retail Media a little bit more tonight. And I have to say, feedback from them is they're optimistic about 2023 and the investments that they are making in digital advertising. But I will also say in this current macroeconomic environment that we're all in, marketers are they're doubling down in ROI. Retail media, it's also a top priority for us at IAS. It's one of the fastest-growing emerging channels, and marketers are absolutely leaning into retail media networks and shifting their linear dollars into retail media. We work with nine out of the top ten retail media platforms, including platforms like Walmart, Amazon, CVS, Walgreens, and we'll continue to invest in retail media. In terms of size of the market, I mean, I think it's been estimated north of a $50 billion marketplace. So huge opportunity, lots of greenfields in the retail media space. Then my second question is just around context control, kind of what you're seeing in Q4 and then so far early in Q1. So in terms of Q4 performance, we're very pleased with our results for fourth quarter that we delivered 15% year-over-year growth. And there are a couple of key verticals where we saw strength, and then I'm happy to end it to Tania, if you want to add some additional color on fourth quarter. Our programmatic growth, it did exceed expectations for fourth quarter. We continue to see just rapid adoption of context control, represents 47% of programmatic in fourth quarter, up from 45% in third quarter. And we expect to continue to see strong growth in context control in 2023 both in terms of contextual avoidance, seeing healthy adoption both in the U.S. and international markets, EMEA in particular. And we're also seeing a strong uptick with contextual targeting product, and we'll continue to invest in our context control. And IAS, we're the only provider with line of sight into the entire CTV ecosystem. And then the other thing that differentiates us, Fitz, in the CTV ecosystem, it's our data. We have incredibly robust data from our Publica integration and our ability to combine our Publica data with our IAS data, we give greater transparency to marketers. So in terms of viewability, that's what marketers are looking for as they definitely want to move more of their linear TV dollars over into programmatic CTV, but they just want the transparency and visibility to understand where their ads are running. So the way we think about retail media and the tech requirements, it's a few. The first is integrations with the major retail media platforms, ideally server-to-server integrations that helps with data flow, it makes it more seamless and easier to scale. The other part of the integration is ensuring that our verification solutions are accessible to both the major marketers who are selling their products, both on the retail media platforms, that's called the O&O inventory and off of the retail media platforms and being able to extend it into mid and smaller advertisers who are selling their products. But I have to say, with retail media, where I see the big opportunity is in the data and leveraging our differentiated data, I spoke to the data before in terms of our IS measurement data, combined with CTV data and being able to layer that data with the retail media networks and helping those advertisers running on the retail media networks find higher quality media, which leads to higher ROI that is nirvana for the marketers. I want to make sure I understood the question, so large uptick of the larger customers in the fourth quarter. In the large customers, yes, so 199 from 183 last year, 184 last quarter. And the way to think about gaming in 2023 is this is a build year where weâ\u0080\u0099re continuing to ensure our integrations are done, onboarding advertisers to our verification solutions on gaming. And I would expect in 2024, thatâ\u0080\u0099s where we would see meaningful revenue. Iâ\u0080\u0099m just curious on what youâ\u0080\u0099re hearing in terms of like sentiment from advertisers there, especially just given all of the regulatory headwinds. Yes, weâ\u0080\u0099re excited that we are starting to see some strength coming out of EMEA in the fourth quarter. Itâ\u0080\u0099s clear that marketers value our products, particularly in the current environment where return on ad spend is a top priority."
}