{
    "symbol": "GS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-14 11:13:02",
    "content": " In equity underwriting, net revenues were $261 million, down significantly versus a record performance in the first quarter of 2021 on the lower industry issuance volumes that David mentioned. On page five, you can see revenues across FICC were $4.7 billion in the first quarter, 21% higher than the strong results in the first quarter of 2021. Moving to Asset Management on page six, first quarter revenues were $546 million, materially lower than the first quarter of last year due to market headwinds in equity investments and lending and debt investments. Turning to page nine, Consumer & Wealth Management produced revenues of $2.1 billion in the first quarter, up 7% sequentially and 21% year-over-year. Combined firm-wide management and other fees for the first quarter rose 15% year-over-year to $2 billion, driven by higher average AUS versus last year. Quarterly non-compensation expenses were $3.6 billion, 7% higher year-over-year, driven by our continued investments, particularly in technology, that will further enhance our infrastructure and support our strategic growth initiatives. However, even in an environment like this, when you have a broad diversified portfolio of assets, and there are certainly lots of areas where there's real growth in the economy, and the economy is still growing very well, the opportunity to see monetizations, to see transactions, I think, continues just probably not at the same pace and velocity as we saw in 2020 and 2021. We've seen when you look over the course of the last 20 years, plenty of periods of time where there are quarters where you have very, very low equity issuance, it's been very rare that, that continues for a year or a longer period and that doesn't mean that, that couldn't happen, but certainly that would be expected given the history. When you talk about the broad corporate investment banking business and the capital markets activity across both investment banking and end markets, again, I would amplify I don't have a crystal ball, I can't tell you exactly where it's going to settle out, but I think these are good businesses, where we have a high degree of confidence that through market cycles, we can produce very nice returns in these businesses. So again, I'd go back, I think these businesses are in terms of available wallet for people like ourselves that compete in them they are fundamentally bigger than they were five years ago because the market cap growth around the world and that creates a good opportunity for us in addition we continue to invest in things in those businesses, which we think strengthen our competitive position. And certainly, when you think about blockchain more broadly in terms of how it supports the infrastructure, payment systems and other activities in the financial markets, we're extremely engaged and invested in thinking about how Goldman Sachs participates in that and how that will affect different business channels and business opportunities because that's to me a little bit separate from cryptocurrency -- clients' interest in cryptocurrency."
}