{
    "symbol": "GS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-18 14:18:03",
    "content": " The platform now serves nearly 400 clients and has roughly $65 billion in deposits at the end of the second quarter, generating approximately $175 million in revenues year-to-date. Moving to Global Markets on Page 4, segment net revenues were $6.5 billion in the quarter, up 32% year-on-year. Net revenues from lending and debt investment activities in asset management were $137 million, down 78% versus a year ago as net interest income of $275 million was partly offset by mark-to-market losses of approximately $140 million due to spread widening. We produced record net revenues of $2.2 billion in the second quarter, up 25% versus a year ago, driven by higher net revenues in both Wealth Management and Consumer Banking. While private banking and lending net revenues of $320 million were down relative to record results last quarter, revenues were up 23% year-on-year due to higher lending and deposit balances. Consumer banking revenues were $608 million in the second quarter, rising 67% versus last year and 26% versus the first quarter. Good morning, David and Denis. But I would say in whatâ\u0080\u0099s been certainly a very difficult first half of the year, if you think about the headwinds weâ\u0080\u0099ve faced in both public equity markets because of the war in Ukraine and the unwind of the business in Russia, etcetera, I think there have been some exogenous events in this first half of the year that certainly created bigger headwinds than we might see in other times going forward. But I do think if you look at capital markets activity kind of average levels over the last 7 years, take a period 5 years, 7 years, and look at average levels, Iâ\u0080\u0099d be very surprised if we donâ\u0080\u0099t get back to some average level of capital markets activity sometime over the course of the next few quarters. Good morning, David and Denis. And obviously, we manage the firm to an efficiency ratio, looking at both the comp side and the non-comp side of the equation meaning as you would have seen through the first half of the year, weâ\u0080\u0099ve taken compensation expense down significantly, $3.5 billion less comp expense in the first half versus the first half last year."
}