{
    "symbol": "FCEL",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-20 14:26:02",
    "content": " For the full fiscal year 2022, we reported revenues of over $130 million across four revenue categories: Product, Service Agreements, Advanced Technologies and Generation, which together represent diversified sources of recurring revenue under multiyear contracts. We believe that the various policy mechanisms within the IRA as highlighted on this chart will provide FuelCell Energy with the long-term market and tax certainty needed to support our continued investment decisions in hydrogen, carbon capture and manufacturing expansion as well as team members passionate about our purpose. First, even though the fuel cell investment tax credit expires in two years, given our molten carbonate platform's fuel flexibility to operate on biofuels or a hydrogen blend, and our solid oxide platform's ability to operate on a 100% pure hydrogen, the green power generation investment tax credit or Section 48E is expected to extend incentives which benefit the sale of our platforms through 2032. In addition, with the renewed focus on nuclear energy, extended operational dates and the recognition that nuclear energy is an excellent source of power for hydrogen generation utilizing electrolysis, we believe our high temperature solid oxide electrolysis platform is well positioned to capitalize on this developing opportunity. Generation revenues increased 30% to $8.8 million from $6.7 million primarily due to the completion of the Long Island Power Authority or LIPA Yaphank project during the three months ended January 31, 2022, and the higher operating output of the generation fleet portfolio as a result of module exchanges and continuously improvements during fiscal year 2021. Advanced Technologies contract revenues increased slightly to $7.5 million from $7.3 million compared to the comparable prior year quarter, Advanced Technology contract revenues recognized under the joint development agreement with ExxonMobil Technology and Engineering Company were approximately $1.8 million lower, offset by an increase in revenue recognized under our government and other contracts of $2 million. R&D expenses increased to $12.2 million during the quarter, up from $3.5 million in the fourth quarter of fiscal year 2021 reflecting increased spending on ongoing commercial development efforts related to our solid oxide platform and carbon capture solutions. Capital expenditures are expected to range between $60 million to $90 million for fiscal year 2023, which includes expected investments in our manufacturing facilities for both molten carbonate and solid oxide production capacity expansion, the addition of test facilities for new products and components, the expansion of our laboratories and upgrades to an expansion of our business systems. In parallel to that, we're also looking for additional facilities, potentially in the U.S. as we think about growth in the future around both electrolysis and solid oxide power gen. We're also investing in the carbonate technology capacity expansion as well, thinking about automation in our facilities in Torrington, and then also preparing for the large opportunity around carbon capture with the carbonate platform as well."
}