{
    "symbol": "FCEL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-09-08 14:25:28",
    "content": " This morning FuelCell Energy released our financial results for the third quarter of fiscal year 2022, and our earnings press release and our quarterly report on Form 10-Q are available in the Investors section on our website at www.fuelcellenergy.com. For the third quarter of fiscal year 2022, we reported total revenues of $43.1 million compared to $26.8 million in the third quarter of fiscal year 2021, which is an increase of 61%. Generation revenues increased 75% to $10.9 million from $6.2 million, primarily due to the completion of the Long Island Power Authority, or LIPA Yaphank project, during the three months ended January 31, 2022 and the higher operating output of the generation fleet portfolio as a result of module exchanges during the last nine months of fiscal year 2021. Generation revenues for the third quarter of fiscal year 2022 also include revenues from sales of renewable energy credits, which resulted in an increase of generation revenues by approximately $1.7 million. Compared to the third quarter of fiscal year 2021, advanced technology contract revenues recognized under our joint development agreement with ExxonMobil Technology and Engineering Company, or EMTEC were approximately $3.1 million lower during the third quarter of fiscal year 2022, partially offset by an increase in revenue recognized under government contracts and other contracts of $2 million for the third quarter of fiscal year 2022. Research and development expenses totaled $9.7 million during the quarter, up from $3 million in the third quarter of fiscal year 2021 and reflect increased spending on the Companyâ\u0080\u0099s ongoing commercial development efforts related to our solid oxide platform and carbon capture solutions compared to the comparable prior year period. Net loss was $29 million for the third quarter of fiscal year 2022, compared to a net loss of $12 million in the third quarter of fiscal year 2021, driven primarily by a gross loss compared to a gross profit in the third quarter of fiscal year 2021 and higher operating expenses. Adjusted EBITDA totaled negative $20.8 million in the third quarter of fiscal year 2022, compared to adjusted EBITDA of negative $5.2 million in the third quarter of fiscal year 2021. Note that in the first quarter of fiscal year 2022 approximately $22.2 million of backlog, which was previously classified as service and license was reclassified to product as a result of the settlement agreement with POSCO Energy and KFC, and represents the value of the performance guarantee associated with KFCâ\u0080\u0099s module order. At the end of the third quarter of fiscal year 2022, our gross project assets totaled approximately $274 million, which excludes accumulated depreciation. For fiscal year 2022, we forecast project expenditures to be in the range of $40 million to $60 million, which includes amounts being expense to the Toyota project that totaled $14 million for the nine months ended July 31, 2022."
}