{
    "symbol": "MBWM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-19 15:02:02",
    "content": " Highlights for the second quarter and first half of the 2022 include expansion of net interest margin as it starts to increase to a more normally expected level, robust growth in the loan portfolio with the commercial pipeline remaining at high levels, continuation of outstanding asset quality, diligent management of overhead expenses, and growth in several non-mortgage fee income categories. As noted on slide 10, this morning we announced net income of $11.7 million or $0.74 per diluted share for the second quarter of 2022, compared with net income of $18.1 million or $1.12 per diluted share for the respective prior year period. Higher net interest income, stemming from an improving net interest margin and ongoing strong loan growth, combined with continued strength in asset quality metrics and increases in several key fee income revenue streams, in large part mitigated a significant decline in mortgage banking income revenue as industry wide originations come off the record levels of 2020 and 2021, which were driven by low mortgage loan rates and result in refinance activity. Turning to slide, 11, interest income on loans increased during the 2022 period compared to the prior year periods, reflecting growth in core commercial and residential mortgage loans. The yield on loans during the 2022 periods was relatively similar to that of the 2021 period, as an increased interest rate environment during the first six months of 2022 mitigated the significantly higher level of PPP, net loan fee accretion recorded during the 2021 period. Interest income on securities also increased during the 2022 periods compared to the prior year periods, reflecting growth in the securities portfolio to deploy a portion of the excess liquid funds position and the higher interest rate environment. Interest income on other earning assets, a vast majority of which is comprised of funds on deposit with the Fed Reserve Bank of Chicago increases well during the 2022 periods compared to the prior year periods, generally reflecting higher average balances and the higher interest rate environment. In total, interest income was $3.8 million and $4.9 million higher during the second quarter and first six months of 2022 when compared to the respective time periods in 2021. Interest expense on other borrowed money increased during the 2022 periods compared to the prior year period, reflecting interest costs associated with the $90 million in subordinated notes issued between December 2021 and January 2022. In total, interest expense was $0.3 million and $0.1 million higher during the second quarter and first six months of 2022, when compared to the respective time periods in 2021. Net interest income increased $3.5 million and $4.8 million during the second quarter in the first six months of 2022 respectively, compared to the respective time periods in 2021. Weâ\u0080\u0099ve recorded a credit loss provision of $0.5 million and $0.6 million during the second quarter and first six months of 2022 respectively, compared to a negative provision expense of $3.1 million and $2.8 million during the respective time periods in 2021. The provision expense recorded during the second quarter of 2022 mainly reflected allocations necessitated by net commercial and residential mortgage loan growth, increased specific reserves on certain commercial loans, and a higher reserve on residential mortgage loans study from a projected increase average life of the portfolio, which in total were not fully mitigated by the combined impact of the reduced COVID-19 environmental allocation, net loan recoveries and continued strong asset quality metrics. Last year when we grew commercial loans 20%, the volume of pay offs was quite a bit lower, and I think this year maybe a little bit higher than average, but closer to average this year and our overall growth of you know how you want to slice and dice it, 9% to 11%, it's kind of more of â\u0080\u0093 i 's actually above our historical norm of closer to 7% or 8%, but we think that that 10%, 11% on the commercial side is something that weâ\u0080\u0099ll continue to enjoy for the remainder of this year, but again Payoffs is always going to be the big question."
}