{
    "symbol": "MBWM",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-17 12:56:05",
    "content": " Highlights for the fourth quarter include: continued increases in net interest margin rising to more normal ranges for Mercantile, which drove strong profitability in the quarter; solid growth in many fee income categories; continuation of our strong asset quality; disciplined control of overhead expenses; and while loan growth was dampened by some loan payoffs, customer relationship building by the sales staff continued to generate successes and pipelines remained strong. As noted on Slide 10 of our presentation, this morning we announced net income of $21.8 million or $1.37 per diluted share for the fourth quarter of 2022 compared with net income of $11.6 million or $0.74 per diluted share for the respective prior year period. Higher net interest income, stemming from an improving net interest margin and ongoing strong loan growth, combined with continued strength in asset quality metrics and increases in treasury management fee income revenue streams, more than offset a significant decline in mortgage banking revenue, as industry-wide originations come off the record levels of 2020 and 2021, which were driven by low mortgage loan rates and resulting refinance activity. Interest income on loans increased significantly during the 2022 periods compared to the prior year periods, reflecting an increase in interest rate environment and strong loan growth in core commercial and residential mortgage loans. The yield on loans during the full year 2022 was 44 basis points higher than the full year 2021, as the increase in interest rate environment impact didn't start in earnest until the second quarter of 2022, and the 2021 period was significantly impacted by PPP net loan fee accretion. Interest income on securities also increased during the 2022 periods compared to the prior year periods, reflecting growth in the securities portfolio to deploy a portion of the excess liquid funds position and the higher interest rate environment. Interest income on other earning assets, a vast majority of which is comprised of funds on deposit with the Federal Reserve Bank of Chicago, also increased during the 2022 periods compared to the prior year periods, generally reflecting the higher interest rate environment. In total, interest income was $21.2 million and $38.3 million higher during the fourth quarter and full year 2022 when compared to the respective time periods in 2021. In comparing the full year 2022 to the full year 2021, we recorded an increase in interest expense on deposits, as deposit rates increased primarily during the latter part of 2022 and average interest-bearing deposit balances grew about 4%. In total, interest expense was $3.1 million and $4.2 million higher during the fourth quarter and full year 2022 when compared to the respective time periods in 2021. Net interest income increased $18.1 million and $34.2 million during the fourth quarter and full year 2022, respectively, compared to the same time periods in 2021. We recorded a credit loss provision expense of $3.1 million and $6.6 million during the fourth quarter and full year 2022, respectively, compared to a negative provision expense of $3.4 million and $4.3 million during the respective time periods in 2021. The provision expense recorded during the 2022 periods was necessitated by the net increase in required reserve levels stemming from changes to several environmental factors that largely reflected enhanced inherent risk within the commercial loan and residential mortgage loan portfolios, as well as loan growth and increased specific reserve for certain distressed loan relationships. Adjusting for charitable contributions to the Mercantile Bank Foundation, overhead costs decreased $1.8 million during the first quarter -- fourth quarter of 2022 compared to the fourth quarter of 2021 and were down slightly for the full year 2022 compared to the full year 2021. The improved net interest margin is primarily a reflection of an increased yield on earning assets, in large part reflecting an increase in interest rate environment in 2022 as well as strong loan growth."
}