{
    "symbol": "MBWM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-18 13:32:03",
    "content": " Strong profitability driven by an increase in net interest margin trending to a more normal -- trending to more normal levels from the lows over the past few years, continued growth in many of our fee income categories, continuation of steady loan growth in both commercial and retail portfolios with consistent strength in our loan pipelines, strong asset quality and diligent expense control. Higher net interest income stemming from an improving net interest margin and ongoing strong loan growth combined with continued strength in asset quality metrics and increases in several key fee income revenue streams in large part mitigated a significant decline in mortgage banking revenue as industry wide originations come off the record levels of 2020 and 2021, which were driven by low mortgage loan rates and results in refinance activity. Turning to Slide 11, interest income on loans increased during the 2022 periods compared to the prior year periods, reflecting an increase in interest rate environment and growth in core commercial and residential mortgage loans. Interest income on securities also increased during the 2022 periods compared to the prior year periods, reflecting growth in the securities portfolio to deploy a portion of the excess liquid funds position and the higher interest rate environment. Interest income on other earning assets, a vast majority of which is comprised of funds on deposit with the Federal Reserve Bank of Chicago increases well during the 2022 periods compared to the prior year periods, generally reflecting the higher interest rate environment. In total, interest income was $12.2 million and $17.1 million higher during the third quarter and first-nine months of 2022 when compared to the respective time periods in 2021. In comparing the first-nine months of 2022 to the respective time period in 2021, we recorded a $1.3 million decline in interest expense on deposits as lower deposit rates more than offset increased interest bearing deposit balances. Interest expense on other borrowed money increased during the 2022 periods compared to the prior year periods, in large part reflecting interest costs associated with $90 million in subordinated notes issued between December of '21 and January of '22. In total, interest expense was $1.0 million and $1.1 million higher during the third quarter and first nine months of 2022 when compared to the respective time periods in 2021. Net interest income increased $11.3 million and $16.1 million during the third quarter and first-nine months of 2022, respectively compared to the respective time periods in 2021. The provision expense recorded during the 2022 periods mainly reflected allocations necessitated by net commercial and residential mortgage loan growth, increased specific reserves on certain commercial loans and a higher reserve on residential mortgage loans stemming from a projected increased average life of the portfolio, which were not fully mitigated by the combined impact of a reduced COVID-19 environmental allocation, net loan recoveries and continued strong asset quality metrics. Continuing on Slide 13, overhead costs increased $0.5 million during the third quarter of 2022 compared to the third quarter of 2021 and were up $1.9 million during the first-nine months of 2022 when compared to the same time period in 2021. Excluding a second quarter $0.5 million contribution to the Mercantile Bank Foundation, overhead costs were relatively unchanged during the 2022 periods compared to the prior year periods, in large part increases reflect higher compensation costs."
}