{
    "symbol": "MBWM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-19 12:26:09",
    "content": " We are pleased to begin the year with a solid first quarter performance, highlighted by an operating profit, prudent expense management, continued growth in core commercial loans contributing to a higher net interest income, and pristine asset quality. Secondly, strategic diversity and sustainable non-interest income; for the first quarter, we're reporting non-interest income of $9.3 million, compared to $13.5 million in the comparable period last year, a reduction of $4.2 million. Finally, the bank continues to experience pristine asset quality with zero ORE and three basis points of non-performing assets at the end of the first quarter of 2022 compared to $0.4 million of ORE and seven basis points as non-performing assets at the end of the comparable prior-year period. This level of asset quality supports an allowance to loans ratio of 0.99% as of March 31, 2022 and a provision for credit loss expense of $0.1 million during the first quarter, compared to $0.3 million in the comparable period last year. As noted on slide 24, this morning we announced net income of $11.5 million, or $0.73 per diluted share for the first quarter of 2022 compared to $14.2 million or $0.87 per diluted share for the respective prior-year period. Ongoing strong core commercial loan growth, continued strength and asset quality metrics and increases in several key fee income revenue streams in large part mitigated a significant decline in mortgage banking revenue as industry wide originations come off of 2020 and 2021 record levels driven by low mortgage loan rates and resulting refinance activity. Turning to slide 25, interest income on loans during the first quarter of 2022 increased $0.3 million from the year-ago first quarter, as growth in core commercial loans and residential mortgage loans offset lower PPP net loan fee income accretion. Interest income on securities in the first quarter of 2022 increased $0.6 million from the first quarter of 2021, in large part, reflecting growth in the securities portfolio over the past 12 months to meet internal policy guidelines and deploy a portion of the excess liquid funds position. Interest income on other earning assets, a vast majority of which is comprised the funds on deposit with the Federal Reserve Bank of Chicago increased $0.2 million during the first quarter of 2022, compared to the year-ago first quarter, primarily reflecting increased balances. Interest expense on deposits during the first quarter of 2022 decreased $0.9 million from the year-ago first quarter, as lower deposit rates more than offset increased interest bearing deposit balances. Interest expense on other borrowed money in the first quarter of 2022 increased $0.8 million from the first quarter of 2021 in large part reflecting the issuance of $75 million in subordinated notes in December of 2021, and a $15 million follow on issuance in mid-January. Net interest income increased $1.4 million during the first quarter of 2022, compared to the first quarter of 2021."
}