{
    "symbol": "VREX",
    "quarter": 4,
    "year": 2022,
    "date": "2022-11-15 21:00:26",
    "content": " I'm pleased to announce a strong finish to another fiscal year with revenues reaching $231 million in the quarter, a new quarterly record for Varex. R&D spending in the fourth quarter was $20 million flat, compared to the prior quarter and represented 9% of revenue. As a result, operating expenses were $47 million in line with the prior quarter and represented 20% of revenue. Operating income was $29 million and operating margin was 13% of revenue, similar to the previous quarter. For Varex, on an annual basis, we add back approximately $6 million of after-tax interest expense to net income and approximately eight million shares to otherwise outstanding diluted shares. Accounts receivable increased by $16 million and DSO increased one day to 68 days in the quarter, primarily due to higher sales in the second half of the quarter. At the midpoint of $205 million, this is up 3% from Q1 of fiscal '22; and non-GAAP earnings per diluted share are expected between $0.10 and $0.30. Our expectations are based on non-GAAP gross margin of about 33%, non-GAAP operating expenses in the range of $46 million to $47 million, tax rate of about 28% to 30% for Q1 and fiscal 2023 non-GAAP diluted share count of about 41 million shares. Your line is now live. But what happens on a non-GAAP basis, if you're moderately saying say less than $0.21, $0.22 you're still using 41 million shares for the diluted share count. But if you are looking at more than $9 million in non-GAAP net income or say about more than $0.21, $0.22 then you'll add back $1.4 million of interest expense, which is after tax interest expense to the numerator, and then add eight million shares to the denominator. So, like in theory, hypothetically, if you just on an operating basis reach the high end of your operating profit right, which would in theory put you at the high end of your operating EPS, assuming nothing else changes, you're actually impacting yourself on a quarter-to-quarter basis that's like an $0.08 sequential difference, right? If you had the impact in Q4 of this eight million shares and you couldn't add back the interest expense, you would have done $0.50 â\u0080\u0093 you would have done $0.34 correct? Your line is now live. Your line is now live. So what ends up happening for us is that the top-line has been compressed by say for the full year by about $18 million, $20 million, but the gross margin becomes a little bit more difficult for us. Your line is now live. If you remember last year, we had highlighted to you that this fiscal year in 2022 that we just completed, we are looking at CapEx of around $25 million, but it was not straight line throughout -- through every quarter of fiscal 2022."
}