{
    "symbol": "VREX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-09 06:01:06",
    "content": " Good afternoon, and welcome to Varex Imaging Corporation's earnings conference call for the second quarter of fiscal year 2022. The webcast and supplemental slide presentation will be archived on Varex' website. To simplify our discussion, unless otherwise stated, all references to the quarter are for the second quarter of fiscal year 2022. In addition, unless otherwise stated, quarterly comparisons are made sequentially from the second quarter of fiscal year 2022 to the first quarter of fiscal year 2022 rather than to the same quarter of the prior year. Finally, all references to the year are to the fiscal year and not calendar year, unless otherwise stated. Additional information concerning factors that could cause actual results to materially differ from those anticipated is contained in our SEC filings, including Item 1A, Risk Factors of our quarterly reports on Form 10-Q and our annual report on Form 10-K. The information in this discussion speaks as of today's date, and we assume no obligation to update or revise the forward-looking statements in this discussion. On today's call, we will discuss certain non-GAAP financial measures. We provided a reconciliation of each non-GAAP financial measure to the most directly comparable GAAP financial measure in our earnings press release, which is posted on our website. We continue to see robust demand for our products in the second quarter of fiscal 2022 and achieved sales of $215 million despite ongoing supply chain constraints. The current operating environment remains challenging with persistent supply constraints, inflationary cost pressure and continued COVID-related shutdowns outside the U.S. While we continue to work to mitigate these headwinds, they impacted our performance in the second quarter, and we expect this to continue in the third quarter. Despite these headwinds, we remain focused on delivering on our backlog while investing in innovation and being the partner of choice for our customers. Non-GAAP gross margin in the quarter was 34%, in line with our expectations as price actions helped offset some of the cost increases. Balance was down $43 million sequentially, driven by a redemption of $27 million of our senior secured notes as well as working capital investments. Now based on a qualitative assessment, let me provide some high-level insights into the demand environment for our different modalities and applications during the quarter. Demand was also strong in our other medical modalities, including fluoroscopy, oncology, radiography, dental and mammography. In addition, all modalities posted improved revenues compared to the prior quarter and a year ago. We continue to see strong demand for products for nondestructive inspection across several of our industrial verticals, including electronics inspection and aerospace applications. Similar to last quarter, we are experiencing improved demand for high energy sources and tubes for security screening. In previous quarters, we had mentioned that we had expected to see future demand as tender activity picked up. In the second quarter, we were pleased to see some of this activity translate into orders for us. In addition, we believe strong backlog at our customers bodes well for future growth in the security business. Last quarter, we provided details on some of our new products in the medical segment. In our tubes business, our high-performance X-ray tubes for cardiovascular applications continue to see good initial customer interest. One customer is getting close to a system launch, several others are evaluating integration and design options, and we continue to get positive reactions from additional OEMs. As we noted in the first quarter, we signed a prototype development agreement with a medical customer, and we shipped the first multimeter prototype to an industrial customer. In detectors, our Photon Counting technology continues to make progress and is currently being utilized or evaluated in a number of medical modalities, including dental, radiography and mammography. Due to its high frame rate imaging ability, we continue to see Photon Counting adoption in in-line industrial inspection systems with automated detection. We are seeing increased orders from customers in Japan, Europe and the U.S. for food inspection systems focused on foreign particle detection as well as analysis of food content. Towards the end of this year, we expect to see additional customers launch new systems utilizing our photon counting detectors in food inspection and in battery inspection. In addition, more customers are evaluating our prototypes with positive feedback. Separately, we're seeing good progress with the launch of our LUMEN series RAD detectors. As we have talked about for several quarters, we continue to see robust demand across the business. Despite current COVID-related shutdowns in China, demand in China remains strong, especially for our CT tubes. Our investment in manufacturing capacity in Wuxi has enabled us to meet our Chinese OEMs needs for local service and supply, which gives them a competitive advantage. We also saw signs of demand recovery in the high-end cardiovascular systems, which had slowed down during the past 2 years due to COVID. The results of growing interest and acknowledgment of the potential for photon-counting technologies in medical imaging, confirming that our investments in technology are on the right path. As you're all aware, supply chain challenges continue to be a pressure point for Varex and many other companies globally. This situation is further exacerbated by erratic vendor performance across the supply chain, which we expect will continue into the near future. Second, we are redirecting our R&D efforts to redesign certain products and qualify new suppliers. Fourth, we're prepaying certain vendors to improve the likelihood that we receive the material when we need it. These measures helped mitigate some of the supply chain constraints in the second quarter, but at the expense of profitability. In summary, as we look forward towards the second half of the fiscal year, we expect supply chain volatility to continue. Pending successful completion of supply chain diversification efforts, which are already underway, we expect fiscal 2022 to be another growth year for Varex. As a reminder, unless otherwise indicated, I'll provide sequential comparison to -- of our results for the second quarter of fiscal 2022 with those of our first quarter of fiscal 2022. Demand remained robust during the quarter, and we were able to mitigate some of the supply chain constraints in the last few weeks of the second quarter. This allowed us to post revenues of $215 million, which was $10 million above the midpoint of our expectations. That said, rising costs of raw material and logistics pressured gross margin offset by volumes being higher than expectations and our pricing initiatives. Non-GAAP EPS was near the top of our guidance at $0.37, which benefited from a credit to SG&A expense. Second quarter revenues increased 8% from the first quarter, helped by improved production towards the end of the quarter. Sequentially, medical sales increased 10% and industrial sales increased 3%. Looking at revenue by region, Americas increased 13% sequentially. Overall, China was 15% of the revenue in the quarter. First quarter gross margin was 33%, in line with the previous quarter. Operating expenses were $44 million, down $7 million and operating income was $27 million, up $13 million sequentially. Gross margin was 34%, in line with our expectations and similar to last quarter. Compared to pre-COVID levels, freight expenses are impacting gross margin by roughly 150 basis points as of now. Like previous quarters, we continue to qualify various alternate suppliers. And as a result, R&D resources were diverted towards mitigating supply chain issues. As we have stated previously, in late October 2021, we communicated broad-based price increases of mid-single-digit percentage or higher. Since many customers are on an annual contract, we expect to realize price increases gradually throughout fiscal 2022. At this stage, we are seeing traction with this initiative, and we continue to work with the remaining customers as their contracts come up for renewal. R&D spending in the second quarter was $19 million, up $1 million from the prior quarter. SG&A was approximately $22 million, $4 million lower than the prior quarter. As a result, SG&A was 10% of revenues, demonstrating the operating leverage in the P&L. Operating expenses were $41 million or 19% of revenue, down $3 million from the prior quarter, driven mainly by lower SG&A. Operating earnings were $32 million, up $4 million sequentially. Separately, ASU 2020-06, which is related to the accounting for convertible instruments will become effective for us from Q1 of fiscal year 2023 onwards. Cash flow from operations was a reduction of $8 million in the second quarter, and we ended the quarter with cash of $115 million on the balance sheet, a decrease of $43 million from the prior quarter. Before providing guidance, I wanted to take a step back and discuss broader revenue dynamics in connection with Sunny's comments earlier. This dynamic was the exact opposite of what we experienced in Q1, but somewhat similar to what we experienced in the fourth quarter of fiscal 2021. However, we expect our supply chain diversification initiatives to progress further and reduce this volatility as we move past the third quarter. Non-GAAP operating expenses in the range of $45 million to $46 million, tax rate of about 25% for Q3 and fiscal 2022, non-GAAP diluted share count of about 41 million shares. Please proceed with your question. Just on the on the realization of price increases, Sam, you mentioned sort of -- those price increases were put in, obviously, more on defense as opposed to offensive just to sort of cover your costs. So I assume we're there kind of calendar '22, so we're not even halfway through the year yet or less than that, obviously. So perhaps you've done some of them, but hopefully, you still have some -- at least some wind at your back in terms of more price increase or benefit rolling through, but perhaps costs are even higher than you -- when you first start putting these in. So yes, we communicated to our customers in October and then we started working with them on price increases. So that activity like you rightly pointed out, began to kick in effectively from the January of this year, and it is going on a rolling basis. So for the next round or phase 2 of it, the earliest it would be is October 2022, if we decide to send out the letters and monitor the cost at that time. And just in terms of impact supply chain, just in terms of impact on revenue, not so much on the cost side. Is there -- is the medical segment -- and obviously, it's a bigger piece of your business, but it looks like that segment has actually experienced better growth relative to sort of rebounding from COVID versus industrial. I would characterize that the both medical and industrial are kind of experiencing that type of issues, if you would notice, industrial for us is a 20% revenue type of segment. That has been that way for many, many quarters, if not years. Here and there, Larry, for a given quarter, you might see a spot effect here or there. But other than that, from a thematic perspective, it's still 80-20 or 79%, 21% in terms of revenue split. So they're both getting impacted Similarly, of course, in the industrial business. That business, there's been a lot of tender activity in that business recently. And when I say recently, I would say in the last 6 months, and Sunny mentioned that in his prepared remarks, that we are seeing activity there. And it does sound like maybe not an inflection point yet, but a lot of these larger programs, it seems like you're at least reaching the prototype stage, and there's probably still some time to go before you have mass commercialization. And what's encouraging for us is that on the customer side, there's also engagement and continued activity. A couple of years ago, some of that had slowed down, but we've seen now customers reengaged in earnest. Please proceed with your question. Gentlemen, congrats on the quarter. So we don't we don't file 510(k) or seek regulatory approval per se, our OEM customers do. In terms of feedback, the OEMs are going through very similar process like they do with our other tubes, which is when you have a novel technology, they go back and forth between what the technology can do and what they need and so they go back and forth on that. They might say, well, we need x number of emitters instead of -- this is -- that's an ongoing process. And so with what we've done in medical and industrial, we're doing a combination of 2 things: helping our customers with supporting them with their specific design needs; and secondly, continuing to market this to other OEMs. So look, we did a lot of the performance characterization early on, and then we talked to you guys about that in the last few quarters. We are satisfied with the basic performance, the capabilities and we've got a handle on the say, the bracket performance brackets on what these tubes are capable of from a dose energy, et cetera. So when you have a novel technology like this, it takes quite a bit of work together with the customers to get adoption. And once we get a few of these examples under our belt, we will be in a better place to then continue on with the demand generation side because we can give concrete examples. Sam, at what point would you care to give us a perspective when inventory management, especially when LIFO comes into play, and that's where -- because gross margins are a key component of your story. So yes, in terms of inventory management practices, say, 6 quarters or 8 quarters ago, we were making our production and manufacturing processes more effective and we were able to bring inventory down. And since COVID, demand has significantly taken a turn on the positive side and followed by supply chain issues. So say, if we were buying giving a PO for 3 to 4 months in advance to a supplier, now we are doing that double that -- now we're doing double that. The factory as of now is running, I would say, inefficiently in the sense, and we have talked about it in the prior quarters with all of you, driven by supply chain, start and soft nature, trying to scramble for material and all of those things. So factories are inefficient, we are trying our best to manage through this situation, and we are also leveraging our balance sheet to ensure that we can meet the customers' demands. Please proceed with your question. The first one is can you talk about shipments on -- for the 3 months of the quarter were a fairly -- excuse me, very heavily weighted towards the third quarter because of the supply chain issues. Yes, the shipments for the quarter were not linear, and they were tilted towards the third month of the quarter. And yes, so last 2, 3 weeks of the quarter, we were able to get the material, finish it up, finish the product and were able to ship it to our customers. And in this quarter, we looked at where the demand is versus where we are able to ship, there is a gap, and we looked at that and we looked at the performance of last year this year, and we went ahead and adjusted for that and reestimated it, and that's what caused the credit on the P&L. The outside of that credit, the operating expenses were in line with what we had guided to you and also in line with what Q1 actuals were and also pretty much in line with what we are guiding towards Q3. So the base outside of the credit, operating expenses are running around $45 million or $45 million, $46 million range. And then Sunny made a comment at the beginning now that despite the supply constraints, he said you expected growth for the year. Jim, I think we hope -- as of now, we are only guiding for Q3, but we are hopeful of full year top line growth and full year bottom line growth. The webcast and supplemental slide presentation will be archived on Varex' website. This concludes today's conference, and you may disconnect your lines at this time."
}