{
    "symbol": "IPGP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-14 21:52:05",
    "content": " At this time, I'd like to turn the call over to Eugene Fedotoff, IPG's Director of Investor Relations for introductions. Let me remind you that statements made during the course of this call that discuss management's or the company's intentions, expectations or predictions of the future are forward-looking statements. These risks and uncertainties are detailed in IPG Photonics' Form 10-K for the period ended December 31, 2022, and our reports on file with the Securities and Exchange Commission. Any forward-looking statements made on this call are the company's expectations or predictions as of today, February 14, 2023, only. For additional details on our reported results, please refer to the earnings press release, earnings call presentation and the Excel-based financial data were posted on our Investor Relations website. I am pleased to report that we continued to see strong momentum in our focus areas such as e-mobility, welding and medical in the fourth quarter and finished the year with revenue above our guidance range, despite a challenging operating environment and currency headwinds. As we moved through the year, we continued to see record sales in e-mobility, medical and welding, including handheld welding applications. IPG is well-positioned to benefit from accelerating global EV battery capacity expansion and our EV sales contributed close to 20% of total revenue in 2022, up from around 10% a year earlier. More recently, customers shifted investments into the U.S. to take advantage of government incentives, which drove higher levels of activity in the region. Our leading position in fiber lasers with a broad range of solutions including welding, cutting, cleaning and process monitoring has allowed us to capture the growth in these markets. We have recently introduced high wall plug efficiency laser drying solutions for use in battery foil manufacturing, the largest CO2 producing process step of battery manufacturing. Welding now accounting for over 30% of our materials processing revenue and grew approximately 40% year-over-year, surpassing in size flat-sheet cutting revenue, a milestone for us. This growth was driven by strong demand for our welding solutions in e-mobility and medical device welding, continued adoption of laser welding in general industrial markets, growth in laser-based systems and a roll-out of LightWELD. The rest of the $20 billion welding market is still early in the adoption of laser technologies, but we are starting to see a more meaningful shift towards acceptance of lasers and believe that this will continue. A large portion of the welding market is using traditional manual welding, primarily with MIG or TIG devices. We also continue to build our LightWELD organization and have established distribution partners to support international sales, which should drive growth of our LightWELD sales in 2023. Finally, our medical business delivered record revenue in the fourth quarter, finishing a very strong year on a high note. Full-year revenue grew over 60% in medical, driven by higher adoption for our thulium laser used primarily in urology applications. While 2022 was a challenging year for IPG, we successfully navigated the choppy waters. We faced continued soft demand in high power cutting in China, currency headwinds due to a strong U.S. dollar, supply chain disruptions as well as restrictions on shipments of components from our manufacturing facility in Russia. And while there is still uncertainty in the operating environment with fears of a slowdown in North America and further weakness in Europe, we believe that IPG is well positioned to benefit from investments in e-mobility, renewable energy and automation. With that, I'll turn the call over to Tim to discuss financial highlights in the quarter\n Thank you, Eugene, and good morning, everyone. Revenue in the fourth quarter was $334 million, down 8% year-over-year due to foreign currency headwinds, which accounted for approximately 7% of the decline. We also saw lower sales in general industrial applications in China and Europe, which were nearly offset by strength in emerging growth products. Revenue from materials processing applications decreased 6% year-over-year, and revenue from other applications decreased 23%, with strength in medical offset by weaker advanced application sales and the telecom divestiture. During the quarter, we conducted a review of our Russian operations and recognized significant charges related to inventory, long-lived asset impairments and restructuring. GAAP gross margin was 18.2%, a decrease of 2,730 basis points year-over-year due to $74 million inventory write-downs and other charges related to our Russian operations. Excluding these inventory-related charges, gross margin was approximately 40%. Please note that adjusted results are non-GAAP items and while we believe they may be meaningful, these results should not be considered a substitute for GAAP measures. Gross margin was also negatively impacted by higher inventory provisions in the rest of the world, the strong dollar, scrap, shipping costs and import duties. We are working to offset the impact of changes in the supply chain and manufacturing footprint on our gross margins by investing in automation and investing in locations with lower costs in Germany and the U.S., such as Poland or Italy. Additionally, both revenue and gross margin were impacted by currency translation headwinds. If exchange rates relative to the U.S. dollar had been the same as one year ago, we would have expected revenue to be $25 million higher and gross profit to be $16 million higher. GAAP operating loss was $88 million, and operating margin was a negative 26.5%. As mentioned above, we had a number of unusual items impacting our operating income and earnings per share in the quarter. There is a $74 million or $1.21 per diluted share impact from inventory-related charges, $79 million or $1.30 share impact from impairment of long-lived assets in Russia and other restructuring charges of $10 million or $0.16 per diluted share. Excluding these special items and the discrete tax impact of these items, adjusted diluted EPS was $1.08. The decline was primarily due to lower demand in cutting applications in China and Europe, which was only partially offset by growth in welding applications across most major geographies. Pulsed laser sales decreased 9% year-over-year as a result of lower demand in cutting and marking applications, partially offset by strong sales into solar cell manufacturing. System sales increased 19% year-over-year, driven by growth in laser systems and higher sales of LightWELD. Medium power laser sales decreased 37%, while QCW laser sales were down 20% -- 21% year-over-year, negatively impacted by lower sales to consumer electronics and general industrial applications. Revenue in North America decreased modestly by 3% with growth in cutting, welding and medical applications, offset by lower sales in non-laser systems, advanced applications as well as the telecom divestiture. In Europe, sales decreased 21% as a result of lower demand across all major materials processing applications due to weaker macroeconomic conditions. Revenue in China decreased 15% year-over-year as growth in welding primarily for EV battery applications was more than offset by continued softness in the cutting market, increased local competition and currency headwinds. We ended the quarter with cash, cash equivalents and short-term investments of $1.2 billion and total debt of $16 million. During the quarter, we repurchased shares to a total of $117 million, while continuing to maintain a strong balance sheet, we have returned $500 million of capital to shareholders with our ongoing stock repurchases in 2022, which represents more than half of our total share repurchases since 2016. Our inventories declined due to the inventory write-down in Russia with some improvements to the electronic supply chain, a decrease in required safety stock as we continue to increase production of components in Europe and North America and a focus on improving our inventory management, we plan to stabilize and then reduce the investment in inventory during 2023. CapEx also includes investments in R&D, sales and service in North America, Germany and Asia. We saw continued softness in orders in Europe and China, primarily due to uncertain macroeconomic conditions, which impact demand in general industrial markets. Media macroeconomic indicators for Europe, China and the U.S. remain subdued, but conditions appear to be more stable in Europe and the U.S., and there is an expectation of increasing activity in China later this year. Additionally, we are benefiting from growth opportunities created by major macro trends such as electric vehicle battery manufacturing and renewable energy. We're seeing continued strong orders in e-mobility and welding applications, which are not being impacted by the economic uncertainty. Furthermore, LightWELD and medical products continue to ramp up, presenting future growth opportunities for IPG. For the first quarter of 2023, IPG expects revenue of $310 million to $340 million. As discussed in the safe harbor passage of today's earnings press release, our guidance is based upon current market conditions and expectations, assumes exchange rates referenced in our earnings press release and is subject to risks outlined in the Safe Harbor and the company's reports with the SEC. If you look at the sort of medium to longer-term trends in terms of battery capacity additions, we don't have final numbers for last year, but between 2022 to 2025 we're expecting to see a tripling of battery capacity and then another doubling of it beyond then. With regard to the second question around the Inflation Reduction Act, we've actually seen some significant order that was delivered in Q4 that went into the U.S. and may have gone into another geographic region if that hadn't or part of it they're going into another geographic region without the act. And even in the first quarter of -- the first few weeks of this quarter, we've actually booked some significant EV-related orders in North America. So there's certainly some -- the Inflation Reduction Act has seen, you can point to some specific evidence of orders strengthening in the U.S. Because for such kind of applications, our customers is not only one of our second to products from IPG, no. As a lot of product, including the different kind of laser, CW, QCW, pulse lasers, which are using for different kind of production, for example, welding, battery, cutting foils, cleaning and so on. This is why, for us, it's very important because we can present to our customer a different kind of product, again, different lasers, different kind of subsystems and primary systems. But really, in addition to that, we want to see and drive -- continue to drive strong performance from the other applications where we clearly have a significant advantage and where the competitive dynamics are less. So the major outperformance or improvement probably coming from non-legacy but legacy contributing to some degree on that, the cutting business is at a very low level in China in Q4. China cutting was well below 1/3 of total revenue in Q4 and you saw China cutting revenue, was only about 34% of the total. So there's exposure to the consolidated basis, it's slightly less than 10%. In terms of the cost structure and gross margin, there's a lot of different aspects to that question. We've started to already supply a significant number of the lasers that were produced in Russia, the lower power levels. We're transitioning that up to not just 1.5 and 3 kilowatts, but already started almost 6 kilowatt, and we'll go to the 8 kilowatts. Overall, rather than just talking about it on the cutting side, all of the analysis we've done on gross margin despite this crisis that we've faced shows us that the cost structure of the business, and I said that I'd be able to talk about this more clearly this quarter. When we get into the second half of the year assuming some increase in revenue, we actually see a good improvement in gross margins from this point forwards as long as the macro stays relatively positive. In Russia, we're starting to source some products from third-party suppliers where we've qualified them for quality and the cost of those actually is equal to or even below what our internal cost was. And then we've got -- we're looking and ramping up manufacturing, for example, of some of the more labor-intensive components in Poland. The labor costs actually in Poland are very competitive to what we would incur in Russia, and even with its smaller scale but even our Italian manufacturing operation who are very good at producing optical components and even finished optical devices, their cost structure there has got some benefit over Northern European costs and even U.S. costs. And then I've touched on the fact that a bit more in the medium to longer-term that strategy around automation, not just on components, but even subassemblies is continuing to be invested in. So I think despite this crisis, I'm actually pretty optimistic about the cost structure this business is ultimately going to have. You mentioned lower level of activity, which is kind of obvious with the Russian operations. No, we're not able to talk in detail about that at this point in time. Part of that review, obviously, the level of activity in that operation is going to be significantly lower. So that review incorporated a significant and substantial restructuring plan, which we've made really good headway on even in the last 8 weeks or so. The restructuring plan goes through Q1 and Q2, and then we're continuing to evaluate different options for that business, but we're really -- we don't have any options right now because we need to get through the restructuring. But really, the view point is that because of the restrictions on what you can do into and out of Russia is that business has to be self-sustaining on its local sales. At the moment, they can supply some basic medical devices to some of our regions around the world. And given that level of sales, we feel optimistic about increasing, but the total capacity that's needed there is going to be adjusted, and is being adjusted. I know, for example, in the last couple of weeks, we've had a significant order for some EV-related products. So it wouldn't be dissimilar to the total share of EV on revenue last year, Mark. We're expecting obviously that given the improvements in the China business and generally speaking, we're optimistic about growing revenue during the year. You go through these crises, but when you come out of them, the degree and depth of work that's done actually sometimes leads you to certainly a much stronger organization. And coming into the second half of the year, we believe that we're going to see some meaningful improvements in gross margin. Yes, in general, you've got all the AMB, the high-power pulse, green lasers have got good margin. We expect our margin on our laser systems business, excluding LightWELD to improve. So for example, the margin on the cleaning systems, which is a much more standard system, that should have an improving margin profile as compared to historical one-off type systems that were sold for primarily welding applications. Last year was a pretty weak year on advanced applications, we got a good pipeline of potential orders there and advanced applications have a good margin profile to them as well. Tim, when we think of that manufacturing footprint, the full transition as you said, we'll see -- it'll become more clear, it seems like in the second half. Is it ramping up more in Poland, in Germany or U.S. just speaking about that second half, like how much of a percentage increase are we seeing in those areas versus where we were in Q4 right now by regions? First of all, of course we have transferred production in different areas in Poland, in Italy and Germany and also expanding our production in the United States. For example, in the United States, we produce components, especially for U.S. markets, for U.S. applications. In Europe, it's much more broader because in Italy and Poland also they produce different kind of components. And from this point of view, of course, we have a good opportunity to optimize production. First of all, taking in mind the much more optimal process to introduce a lot of automation. It's one of the primary goals for organizing this production, first of all, components; but also in some cases, final devices. And from this point of view, we have a good opportunity to increase our production outside Russia, much more effective -- much more cost effective and much more productive. The expansion, we did have some benefit from Italy, but that's going to be expanded. So a lot of the additional capacity that was initially put in because the capability existed there was in North America and Germany, and we expect these other areas to view the benefit going forward. The first half of the year is going to have potentially some small additional charges, but we're also, for example, carrying some extra cost at the moment in Russia. And then when you get into the second half of the year, you've adjusted the cost structure in Russia and you've got the sort of full benefit from some of the Polish and Italian operations coming through and some of the other cost reduction initiatives. In the initial stage, we certainly are able to start to introduce our lasers for EV applications. Our first introduction of different kinds of lasers for welding, including our latest development -- developed laser was AMB, adjustable mode beam parameter laser. But now situation is different because for such kind of application we deliver not only lasers, but also our monitoring system, our scanners or special welding fence. And also now we are working to introduce to our customer the full integration solution, including all these components largely integrated with the same design and the same software. And for the future also see to penetrate to the EV market, not only by producing some components like lasers or some other subsystems to our customer. Our main goal to introduce and to deliver to our customer subsystem and systems for welding applications but also for cutting applications, but also very promising applications, cleaning applications also for EV market. Comparatively, it's really no competition still in China from anybody on the welding side. On LightWELD, globally, that's really continues to be a very leading edge product. If you look online, you'll see there are some handheld welders advertised in China, but they're pretty large devices. And I guess just lastly, like you guys have done a lot of -- like you said, Tim, there's been a lot of work being done in diving deep into how you guys have handled a lot of these challenges. Is there any product -- I know this was touched on earlier, but is there any products you guys think about longer term, maybe shifting more your capacity towards the U.S.? Or I know it came up earlier about servicing the cutting market, the low end in China. I quite didn't get the question, but I mean there's a lot of -- for example, all of our diode manufacturing has been always and always will be -- not always will be, but it is still primarily in the U.S., right, all the semiconductor, most of the packaging. If we had excess capacity in the U.S. and wanted to supply a greater number of lasers to China from the U.S. because European demand for finished product was very strong, we could easily do that. Obviously, they're producing all the LightWELD products at the moment. So a little bit a newer product, is coming more primarily out of North America, but we're not also -- we don't -- we're not holding to that. And based on this visibility, itâ\u0080\u0099s very simple because manufacturing of fiber laser, final assembly or final manufacturing is a very easy process. The main know-how -- our main know-how is, first of all, of course, in components. And this is why we are producing components in selected area, for example, diodes product is produced only in the United States. No reason to expand this production for the other countries because already installed the automation production, very effective, just cost per 1 watt is much less in comparison to all others. Fiber components, of course, is not any sense to produce outside of Germany because again, it's installed, stable production and now introduce the automated production for these components. I just want to ask Tim, are you seeing...\n Jamie, can you just speak up? Let's stay with one question first and then the second one after that, yes. So the first question was on restructuring charges, I think. But in terms of like the impairment of long-lived assets and the inventory, we think we did a very, very thorough review of those, and that would be the only -- we don't expect any significant charges related to that. Recently, we talked to your corporate partners in China, Han's Laser. And they say that it's likely, revenue in the industry is likely to go back to 2021 level. Yes, just want to understand your follow-up recovery in China. We expect -- we're not giving specific guidance on China, but Q4 and Q1 revenue of China is at a pretty low point. You saw last quarter it was 34% of revenue, less than $100 million. I think Han's -- by the way, Han's' outlook points to the fact that people are optimistic that overall the China's economy is going to see a recovery in the year. The give-ups are -- yes, the rough guidance did say that despite the fact that the visibility -- although the visibility is quite low right now, particularly from their , particularly from the PCB business, but they expect their revenue to recover maybe from the second quarter or second half of this year in China. Of course, significant -- I mean I'm not going to give a number on it, Jim, because that kind of like ends up in sort of annual guidance on it. But we're expecting meaningful growth out of that business and it to be geographically, globally based, not just sort of China-based but strong growth in North America and Europe as well. And on LightWELD, I know you made some commentary earlier in the call, but I think you've suggested that it was at last quarter, I think, of $40 million or so run rate business that you thought could grow 80%. We're not actually focused really on China on it, but we've got very good demand out of Japan and Korea for that business and continue to expect it to grow extremely robustly going forward. As usual, we will be participating in a number of investor events in this quarter, and I am looking forward to speaking with you soon."
}