{
    "symbol": "DOUG",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 09:09:04",
    "content": " On today's call, we will discuss Douglas Elliman's financial results for the three and six months ended June 30th 2022, as well as current trends in our luxury markets. Net income attributed to Douglas Elliman for the three months ended June 30th, 2022 was $10.2 million or $0.13 per diluted share, compared to net income of $39.5 million or $0.51 per diluted share in the second quarter of 2021. For the three months ended June 30th 2022, adjusted EBITDA attributable to Douglas Elliman was $19.2 million, compared to $45.3 million in the second quarter of 2021. Therefore, for comparison purpose, our real estate brokerage segment reported operating income of $21.6 million for the three months ended June 30th 2022, compared to $43.2 million in the second quarter of 2021. Adjusted EBITDA attributed to our real estate brokerage segment was $24.4 million for the three months ended June 30th 2022, compared to $45.3 million in the second quarter of 2021. For the three months ended June 30th 2022, adjusted net income was $9.7 million or $0.12 per share, compared to adjusted net income of $43.1 million or $0.55 per share in the second quarter of 2021. For the six months ended June 30th 2022, Douglas Elliman reported $673.3 million in revenues, compared to $664.8 million in the 2021 period. Net income attributed to Douglas Elliman for the six months ended June 30th 2022 was $16.8 million or $0.21 per diluted share, compared to net income of $53.4 million or $0.69 per diluted share in the 2021 period. For the six months ended June 30th 2022, adjusted EBITDA attributed to Douglas Elliman was $31.9 million, compared to $61.6 million in the 2021 period. For comparison purposes, our real estate brokerage segment reported operating income of $36.1 million for the six months ended June 30th 2022, compared to $57.4 million for the 2021 period. Adjusted EBITDA attributed to our real estate brokerage segment was $42.1 million for the six months ended June 30th 2022, compared to $61.6 million for the 2021 period. For the six months ended June 30th 2022, adjusted net income was $16.2 million or $0.20 per share, compared to $57 million or $0.73 per share in the 2021 period."
}