{
    "symbol": "DOUG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 07:55:04",
    "content": " On todayâ\u0080\u0099s call, we will discuss trends in residential real estate, Douglas Ellimanâ\u0080\u0099s financial results for the three and nine months ended September 30, 2022, and performance in our luxury markets. The three months ended September 30, 2022, Douglas Elliman reported $272.6 million in revenues compared to $354.2 million in the third quarter of 2021. Net loss attributed to Douglas Elliman for the three months ended September 30, 2022 was $4 million or $0.05 per diluted share compared to net income of $25.2 million or $0.32 per diluted share in the third quarter of 2021. For the 3 months ended September 30, 2022, adjusted EBITDA attributed to Douglas Elliman was $124,000 compared to $27.8 million in the third quarter of 2021. Therefore, for comparison purposes, our real estate brokerage segment reported operating income of $1.5 million for the three months ended September 30, 2022, compared to $25.5 million in the third quarter of 2021. Adjusted EBITDA attributed to our real estate brokerage segment were $5.1 million for the three months ended September 30, 2022, compared to $27.8 million in the third quarter of 2021. For the three months ended September 30, 2022, adjusted net loss attributed to Douglas Elliman was $4.0 million or $0.05 per share compared to adjusted net income of $24.9 million or $0.32 per share in the third quarter of 2021. For the nine months ended September 30, 22, Douglas Elliman reported $945.8 million in revenues compared to $1 billion in the 2021 period. Net income attributed to Douglas Elliman for the nine months ended September 30, 2022, was $12.8 million or $0.16 per diluted share compared to net income of $78.7 million or $1.01 per diluted share in the 2021 period. For the nine months ended September 30, 2022, adjusted EBITDA attributed to Douglas Elliman was $32.1 million compared to $89.4 million in the 2021 period. For comparison purposes, our real estate brokerage segment reported operating income of $37.6 million for the nine months ended September 30, 2022, compared to $82.9 million for the 2021 period. Adjusted EBITDA attributed to our real estate brokerage segment were $47.2 million for the nine months ended September 30, 2022, compared to $89.4 million for the 2021 period. For the nine months ended September 30, 2022, adjusted net income attributed to Douglas Selman was $12.2 million or $0.15 per share compared to $81.9 million or $1.05 per share in the 2021 period."
}