{
    "symbol": "KBAL",
    "quarter": 1,
    "year": 2022,
    "date": "2021-11-07 06:48:11",
    "content": " First, as anticipated, we experienced strong customer demand across our workplace and health and markets, with orders of 51% and together accounting for 86% of our net sales. Importantly, approximately 60% of Poppin’s first quarter revenue was generated through the core B2B channel, which is an indication of its strength in its historical business model and which supports our expectations for the continued robust performance of this business. Net sales in the first quarter increased 18% year-on-year and orders were up 30% reflecting the traction of our Interwoven dedicated health brand, our strong positioning in the government health sector whether it’s substantial federal funding and our development of relationships with large health systems. In the meantime, we have taken steps to improve our margin profile in this market by closely managing costs and increasing our mix of customized products, which accounted for 73% of first quarter sales up from approximately 50% in the similar period last year. As you can see on Slide 7, 2022 first quarter net sales increased 6% year-over-year to $156.6 million, including a 15.2 million contribution from Poppin. But as expected, our growth in the first quarter came from workplace and health, as these markets on a combined basis increased by 16% from the year ago quarter and together accounted for 86% of net sales. Excluding amortization from the Poppin acquisition totaling $1.6 million as well as a supplemental employee retirement plan adjusted solid administrative costs were $48.6 million or 31.1% of sales, compared to $40.8 million or 27.6% in the prior year. Order activity in the workplace end-market was strong and increased 57% compared to the year ago quarter, including the contribution from Poppin as order trends reached near pre-pandemic levels. We forecast year-over-year revenue growth of 10% to 15%, with second quarter gross margins ranging from 32% to 33% and S&A expenses totaling $51 million to $53 million. Our revenue guidance reflects our current backlog of $170.8 million, which includes approximately $120 million scheduled to ship in the second quarter, as well as current order trends and the expected impact from production capacity constraints and the potential for temporary operational challenges related to complying with the vaccine mandate for government suppliers. So I think what we're guiding towards is that if we continue as trajectory Poppin, we could be at the $80 million revenue, annual revenue run rate as early as this coming quarter in Q2 of the fiscal year."
}