{
    "symbol": "VSTA",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-24 00:41:10",
    "content": " In the fourth quarter, adjusted EBITDA totaled R$200 million, a relevant 25% increase compared to the fourth quarter of 21%, when adjusted, EBITDA was R$161 million. As we announced last quarter, we signed a total of R$1.23 billion in subscription contracts, which represents a 20% organic growth over the subscription net revenue of the 2022 commercial cycle. As you can see on the left side, in the fourth quarter, total net revenue increased 27% organically year-on-year to R$505 million. Adjusted EBITDA in this quarter totaled R$200 million, a relevant increase of 25% from the R$161 million in the fourth quarter of '21. In the fourth quarter, adjusted net profit totaled R$73 million, a relevant 35% increase compared to the fourth quarter of 2021 when we reported adjusted net loss of R$54 million. The reported PDA line in the fourth quarter of 2022 is R$29 million, included here is the provision of 100% of accounts receivable from retail companies undergoing judicial recovery in the amount of R$15 million. The normalized PDA in the quarter adds to R$14 million, which represents 2.7% of the net revenue, high stability in comparison to the fourth quarter of '21. For the full year of 2022, the reported PDA line is R$46 million or R$31 million on a normalized base, which represents 2.4% of the net revenue. In comparison to the fourth quarter of '22, the net debt position increased by R$155 million due to higher interest rates accrued for the amount of R$119 million and R$117 million in M&A acquisition, such as the minority acquisition of Educbank in July and Phidelis in February of '22, partially offset by the positive cash flow of R$92 million in 2022. As guidance for Q1 2023, which represents the second quarter of 2023 ACV recognition, we expect a net revenue from R$395 million to R$415 million, to be comprised of R$350 million to R$360 million from subscription products, 29% of 2023 ACV and R$45 million to R$55 million from non-subscription products."
}