{
    "symbol": "HZO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-04-28 15:49:09",
    "content": "  Operator: Good morning, and welcome to the MarineMax 2022 Fiscal Second Quarter Conference Call. At this time, I would like to turn the call over to Dawn Francfort of ICR, Investor Relations for MarineMax. Good morning, everyone, and thank you for joining this discussion of MarineMax's fiscal second quarter 2022 conference call. But if not, please call Linda Cameron at (727) 531-1712, and she will e-mail one to you right away. Good morning, everyone, and thank you for joining this call. Before I turn the call over to Brett, I'd like to tell you that certain of our comments are forward-looking statements as defined by the Private Securities Litigation Reform Act. These risks include, but are not limited to, the impact of seasonality and weather, general economic conditions and the level of consumer spending, the company's ability to capitalize on opportunities or grow its market share and numerous other factors identified in our Form 10-K and other filings with the Securities and Exchange Commission. With that in mind, I'd like to turn the call over to Brett. Thank you, Mike, and good morning, everyone, and thank you for joining this call. But an even greater accomplishment is that our team delivered these results while also providing exceptional customer service as affirmed by our record Net Promoter Customer Satisfaction levels, which is ultimately the key to driving sustainable future sales and profitability. Let me start by touching on the March quarter where we generated 17% revenue growth, record second quarter gross margins of 33.7% and earnings per share of $2.37. As I mentioned, we are particularly pleased with our strong same-store sales growth for the quarter. Additionally, we drove meaningful expansion across essentially all brands, categories and geographic regions, only limited by product availability. This strong demand environment is highlighted by our customer deposits, which exceeded $164 million and grew sequentially on top of our strong same-store sales growth. Based on available industry data, we believe, we continue to gain market share. From a cadence perspective, the supply chain headwinds did not improve much in the quarter. However, we continue to work closely with our manufacturing partners to ensure we are properly communicating with our customers and getting them into their boats as fast as possible. To that point, most manufacturers and dealers agree that the future level of inventory is likely to be leaner than in the past, given the benefits that leaner inventory creates across the industry. From a six-month perspective, we delivered almost $1.1 billion in revenue, with same-store sales growth of 8% on top of 33% a year-ago. Gross margins grew to a mid-year record, and we delivered almost $90 million in net earnings and $4 in earnings per share. Demand is strong, and we are well-positioned and prepared to serve our customers. Our team continues to leverage our stores and our online platform, generating exceptional customer experiences. Many of our brand expansions continue to mature and accelerate within our retailing model, which should keep driving future incremental growth. As we mentioned before, because of the size of the territories we have for many of these brands, we are not limited by physical facility in terms of our ability to sell and expand. I'd like to underscore our strategic growth plan which propel sustained market share gains and revenue growth, while expanding companywide margins. This quarter, we increased our operating margins by 170 basis points over last year's record to 11.8%. To that point, our growth strategy has been focused on seeking and acquiring great companies with strong management and generally a higher margin profile. These strategic acquisitions, combined with improvements in finance and insurance, service, brokerage, and the expansion of our substantial storage operations have resulted in structural increases to our gross margin. Additionally, as we integrate our acquisition, they continued to perform very well and are aligned with our margin expansion strategy. SYM, which is located in the south of France complements MarineMax's ongoing diversification into a higher margin and global business and strengthens our commitment to providing exceptional customer experiences across all Superyacht service offering. Superyachts are a growing segment of the industry, and we will continue to aggressively grow this segment of our business. The foundational pillars of our strategy are creating exceptional customer experiences through the best team, services, products and technology. With regard to technology, we recently invested in Boatzon, the only totally online marketplace platform in the industry. We believe the combination of our team's expertise and our history of success will enable us to leverage this leading innovative technology, enhancing the customer experience. Our team remains committed to our mission, which is resulting in strong execution, delivering high Net Promoter Scores and increased sales and margins. We continue to accomplish this through our global market presence, premium brand, valuable real estate locations, exceptional customer service, technology investments, strategic acquisitions, and finally, our unwavering commitment to build our strong company culture. Supported by one of the strongest balance sheets in the industry, we will actively make strategic acquisitions in a disciplined manner. Our broad global presence has allowed and will continue to allow us to grow by adding additional dealers, marinas, storage, service-related offerings, manufacturing and asset-light businesses. The combination of robust operating leverage, significant cash flow and strong consumer demand led to record results in the first six months of 2022 and we believe will drive sustainable growth for the remainder of 2022 and beyond. And with that update, I'll ask Mike to provide more detailed comments on the quarter. For the quarter, revenue grew 17% to $610 million, largely due to same-store sales growth of 7% and contributions from our various recent acquisitions. Keep in mind, absent the acquisitions we have completed, our inventory is below last year's level. Overall, our growth is only limited by product availability. Among these are improving margins on new and used boat sales, impressive service, parts and storage performance, expansion in our higher margin finance, insurance and brokerage business, as well as growth in our global Superyacht services organizations of Northrop & Johnson and Fraser Yachts. Regarding SG&A, the majority of the increase was once again due to rising sales and the related commissions, combined with the recent acquisitions. We believe SG&A overall is generally on track on an annual basis, but we will watch the inflationary pressures carefully. Our operating leverage in the quarter was over 22%, which drove very strong earnings growth, setting another quarterly milestone with pre-tax earnings of over $71 million. Our record March quarter saw net income increase 37% and earnings per share rise over 40%, generating $2.37 versus $1.69 a year-ago. Our inventory shows a 9% increase, but excluding the acquisitions, it's down in the high-single-digits year-over-year. Over the past several months, we have purchased three formerly leased marinas in New Jersey and also purchased a marina in Fort Walton Beach, Florida. As we have indicated, we have found that where we can own and control storage locations, coupled with our retail strategy, it results in great earnings and cash flow and increases the stickiness with our customers. Customer deposits, while admittedly lumpy, increased sequentially from December to over $164 million and is double the elevated level from last year. Our balance sheet has always been a formidable strategic advantage and today, more than ever, it continues to protect us at uncertain times, while providing the capital for expansion as opportunities arise. Today, given what we are being told from our various manufacturing partners, we continue to expect unit growth in 2022. However, given the recent supply chain issues caused by the lockdowns in China, and the war in Ukraine, we think it's prudent to continue to expect flattish unit growth until we have better supply visibility. This, combined with increases in our average unit selling price should provide annual same-store sales growth around the mid-single-digits. Including all recent acquisitions, we expect total annual revenue growth in the mid-teens. Accordingly, we are raising our earnings per share guidance to the range of $7.90 to $8.30 for 2022 from $7.60 to $8. Regarding EBITDA, we expect fiscal 2022 EBITDA to be over $260 million. As we have said, industry demand remains strong, and we are generally outperforming these elevated levels. As I stated at the beginning of this call, our team's performance the first six months of fiscal 2022 continues to show excellent execution as our diversified model and exceptional customer service generate sustainable growth. We remain committed to the long-term financial strength of the company and will pursue acquisitions, additional brand expansion and higher margin businesses with a focus on recurring revenue, which will support our overall growth strategy, all with the view to create long-term shareholder value. And with that, operator, let's open up the call for questions. Please proceed with your questions. I mean, obviously, we've structurally changed, at least we believe we have, the margin profile of the company with a number of the different acquisitions that we've done over the years. I mean, the mix of our business continues to skew towards these higher-margin businesses, our service, F&I, our storage business, certainly our Superyacht services company, which -- or companies, which continue to do very, very well. The only thing we do cite is just some continued challenges are on the supply chain, right, and how much product we can get. And then just secondly, I think on the last call you mentioned mix on the boat side trended towards smaller boats. I'd tell you, mix in this quarter, nothing jumps out to me as I think through the business. We've got a lot of smaller product, midsize and larger products. Last year, gross margin in the second half bounced around a lot. You did 31% in Q3, and then I think jump up to 38% in Q4. I think mathematically to get to the numbers, you would have a little bit of margin pressure baked into the back half of the year. We don't have anything today telling us that, but I think it's prudent just given inflation and so forth that there could be some. We look, we do this as a back half of the year. Joe, we don't really get to caught up from a quarter-to-quarter perspective. Please proceed with your question. Hey guys, good morning. I mean you beat pretty materially, you increased the midpoint of the full-year by a little bit less than that beat. No, there's really nothing from a demand perspective that we're seeing that would cause anything. I'd say if there's anything out there that we've mentioned a couple of times in the script, it's just around the ability to get enough product. However, given what our manufacturers are telling us today, we continue to think we're going to get the product. It's just -- the supply chain is still kind of choppy out there, and we want to be prudent in our expectations. I think anything we're seeing right now up there would be somewhat granular and somewhat weather related, but there's nothing to point out from an inbound demand, traffic, deal -- writing deals. Nothing like that seems to be in the way, just maybe some weather patterns to get boats delivered. Please proceed with your questions. I guess, not really looking to back half of the year, specifically base, just in general. With all the changes that you've made through diversification, the acquisitions, the out brokerage and management, now kind of moving more towards into the marina space. Prior to the pandemic, we put a strategy plan together, multi-year, that you see in our acquisitions, as you referenced. That was kind of our goal, give or take a little bit. So that kind of tells you we were looking at building these higher margin businesses, looking at acquisitions like that. And now obviously, we've gotten a tailwind from new and used boat margins. What I would say with new levels of inventory that dealers will carry, I think there's going to be a new view on that from both manufacturers and dealers. That should help preserve margins, maybe not exactly to the level they're at today, but something much better than we've seen historically. Yes, I just -- I've said this before, but if you listen to what we say each quarter about kind of the trends within the margins, usually it's a third, 40% or less than half is new or used expansion of margins. So if you just take our margin growth, and let's say, you take a third or 40% off of it. Today, you'd have something north of 30%. And then once we're there on a long-term basis, we'll see how we get higher than that. Looking at the floor plan balance over the past call it 18 months, it's bounced around a fair amount, kind of quarter-to-quarter. So we have the ability to borrow and repay against our floor plan, which is unique in the industry. But we've not been inhibited to -- from an execution standpoint, to really accomplish any of the growth initiatives we want to and we're able to accomplish from buying marinas properties, which I talked about on the call and reinvesting in our facilities, buying great companies with great management teams. Please proceed with your question. Hey guys, good morning. In the superyacht services organization, we -- that's a very competitive segment of the industry, and we've never really disclosed how big they were when we bought them. They're still relatively small when you compare that to how big MarineMax is now today, north of $2 billion. But it's an important segment, as Brett talked about. And maybe one of these days, it could be big enough, we actually have a separate segment that we report on. That would be -- that's sort of our goal, hopefully, is to get it that large. Please proceed with your question. And then anything you could give us on momentum within the quarter, I guess, particularly from a units perspective. And is April getting better, getting worse as we -- obviously, so much is inventory dependent. The industry, if you look at the March quarter, was very negative, 11%. But if you break that apart, and you say kind of the key categories that we play in, you would say the industry was down in the high teens, 18%, 19%, something like that. There's just not enough product out there, it's what you're hearing from everybody. When you look at everything combined, new, used, our brokerage business and all that stuff, we were much closer to flat. And then on the -- I think your next question was just cadence throughout the quarter, if I remember right. And our cadence is not -- it's not really demand related, because demand is strong. And I would tell you, from my perspective, if I go back and look at -- the January quarterly call that we did, there were some tones that we were feeling better about the supply chain. We've just left a high unit growth December quarter, and there was tones of things getting better. I think if you fast forward less than a month from that call to the beginning of the Ukraine war, and then a week or two after that, the China lockdowns, it does feel like the supply chain has gotten a little choppier as we ended the quarter. And when we look at sales units and everything right now, it continues -- the theme continues for the last really couple of years. They've come from supply, whether it's a little up or a little down and how that carries through the month in the quarter. And then the outlook on April, so we're expecting to have positive same-store sales growth. I don't have it in front of me, how that's going to break down between AUP and units. Despite my commentary, two seconds ago on supply chain. But the -- I think time will tell ultimately how much we get from the manufacturers, how much we can get out the door. So if I think about units being down in the March quarter, guidance for the year is for flat units. You'll be -- better availability for units to accelerate, particularly as you get into some of these bigger quarters where if you're sitting -- if you're still bouncing along the bottom from an inventory perspective, it's probably an even bigger drag from a retail perspective. So our units year-to-date, so for the quarter, you're right, they're down. But remember, they were up in the December quarter. So year-to-date, our units are -- they're down slightly. In the back half of the year, if you go back a couple of calls ago, as the manufacturers ramp up production, sometimes it takes a little while to hire people, train people, get product in, all that stuff. They've been articulating that the further we get into 2022, the better their ability to get us product. So they continue to suggest better availability of product kind of as we're moving into the summer months, which is great. We just got to kind of see it, I guess, and get into the quarters. And having talked to you for all those years and have been doing this for many, many years, including the great recession, the 2008 time period, those of you who may remember. And within about two quarters, we created so much cash, we paid off the debt. And it really was a smart move during that time period, and I think it's going to be a smart move in any other time period that comes up. Please proceed with your questions. And also, you mentioned that the Miami and Palm Beach boat shows went pretty well. I'd say we really focused, obviously, on deals. We're contracting day over day, month over month, to make sure the trends are there. We're looking at inbound web traffic, which -- how many convert to leads, how many of those are new customers, how many are existing customers. And we monitor it, we don't put as much weight necessarily on that because that can vary just depending on so many different types of locations. Mike, you may comment, I don't remember, they were -- the traffic comparisons, but they were good shows for us. And there wasn't really a comparison with like the prior year, depending on the show because it may not have happened. But generally, the industry would reflect on those shows as being very good shows and so would we. At this time, we've reached the end of our question-and-answer session."
}