{
    "symbol": "HZO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-07-28 15:59:04",
    "content": "  Operator: Good morning, and welcome to the MarineMax, Inc. 2022 Fiscal Third Quarter Conference Call. At this time, I would like to turn the call over to Dawn of ICR, Investor Relations for MarineMax. Good morning, everyone, and thank you for joining this discussion of MarineMax's fiscal third quarter 2022 conference call. I now would like to introduce the management team of MarineMax, Mr. Brett McGill, President and Chief Executive Officer; and Mr. Mike McLamb, Chief Financial Officer of the company. Good morning, everyone, and thank you for joining this call. Before I turn the call over to Brett, I'd like to tell you that certain of our comments are forward-looking statements as defined by the Private Securities Litigation Reform Act. These risks include, but are not limited to, the impact of seasonality and weather, general economic conditions and the level of consumer spending, the company's ability to capitalize on opportunities or grow its market share and numerous other factors identified in our Form 10-K and other filings with the Securities and Exchange Commission. With that in mind, I'd like to turn the call over to Brett. Thank you, Mike, and good morning, everyone, and thank you for joining this call. Let me continue by touching on a few details on the June quarter where we generated record revenue, record gross margins of over 34% and record earnings per share of $3.17. While our same-store sales declined 5% for the quarter, the change was primarily related to the timing of shipments of presold customer boats, primarily large higher-end product. With the backlog of new boat orders at the highest level starting the fourth quarter, there is no question that we were impacted by the ongoing challenges of the supply chain. That said, excluding the Midwest, which seemed to be hampered by a delayed start to the boating season, we drove same-store new unit sales growth in excess of 8% during the quarter. Simply put, given our backlog and the desire by customers to get out on the water, if we would have had the product to deliver, it would have translated into higher revenue. This strong demand environment is also highlighted by our customer deposits, which increased 60% to $138 million year-over-year. Based on available industry data, we believe we continue to gain market share. From a supply chain perspective, it remains challenging, albeit we are seeing some improvements. From a 9-month perspective, we delivered almost $1.8 billion in revenue with gross margins growing to a record 34% and we delivered almost $160 million in net earnings or $7.11 in earnings per share, another powerful achievement. I'd like to underscore our strategic growth plan, which drives sustained market share gains and revenue growth while expanding company-wide margins by focusing on higher-margin businesses that drive even greater profitability we are building on our previously communicated strategic vision that we began deploying in 2019, which was to transform MarineMax into a more diversified business model that will create greater resilience across ever-changing economic cycles. This quarter, we increased our operating margin to 13.8%, 170 basis points over last year's record. To that point, our growth strategy has been focused on acquiring great companies with strong management and a higher margin profile. These strategic acquisitions, combined with improvements in finance and insurance, service, brokerage and the expansion of our substantial marina and storage operations have resulted in structural increases to our gross margin. Additionally, as we integrate our acquisition, they continued to perform very well and are aligned with our margin expansion strategy. We have seamlessly integrated these businesses into MarineMax, and we believe opportunities exist for the continued sharing of best practices and resources to drive even greater growth in the years ahead. The foundational pillars of our strategy are creating exceptional customer experiences through the best team, services, products and technology. Our team is committed to our mission, which is resulting in strong execution that is delivering record high Net Promoter Scores and increased sales and margin. We continue to accomplish this through our global market presence, premium brands, valuable real estate locations, exceptional customer service, technology investments, strategic acquisitions and our unwavering commitment to build on our strong company culture. Supported by one of the strongest balance sheets in the industry, we will actively pursue strategic acquisitions in a disciplined manner, which also supports our organic growth. Our broad global presence allows us the ability to grow by adding additional dealers, marinas, storage, service-related offerings, manufacturing and other asset-light businesses. The combination of robust operating leverage, significant cash flow and strong consumer demand led to record results the first 9 months of 2022, and we believe we will drive sustainable growth for the remainder of 2022 and beyond. And with that update, I'd like to ask Mike to provide more detailed comments on the quarter. For the quarter, revenue grew to over $688 million, largely due to contributions from recent acquisitions. Our same-store sales decline of 5%, as Brett mentioned, was primarily related to the ongoing shortage of inventory in large, higher-end product. Importantly, new unit growth was fairly good in the quarter and as mentioned earlier, excluding our Midwest region was up over 8% on a same-store basis. Among these are improving margins on boat sales, impressive service, parts and storage performance expansion in our higher-margin finance, insurance and brokerage businesses as well as our global superyacht services organizations of Northrop & Johnson and Fraser Yachts. Additionally, our manufacturing operations of Cruiser Yachts and Intrepid also performed well and helped drive the margin growth that we achieved. Regarding SG&A, the majority of the increase was once again due to rising sales, margins and related commissions combined with the recent acquisitions. Our operating leverage in the quarter was over 60%, driven by the strong gross margins. The leverage produced very strong earnings growth, setting another quarterly milestone with pretax earnings of over $94 million. Our record June quarter saw net income grow 18% and earnings per share rise over 22%, generating $3.17 versus $2.59 a year ago. But excluding the acquisitions year-over-year, plus an increase in deposits paid to manufacturers as well as boats in transit, but not able to be delivered, inventory was up less than 30%. In addition to growth due to acquisitions, most of the growth is due to our purchases of several marinas and the development of other marinas on properties that we own. As we have indicated, we have found that where we can own and control storage locations, coupled with our retail strategy, it results in great earnings and cash flow and increases the stickiness with our customers. Sequentially, not surprisingly, deposits did decline from March due to the deliveries of sold boats. Our balance sheet has always been a formidable strategic advantage, and today more than ever, it continues to protect us in uncertain times while providing the capital for expansion as opportunities arise. The June quarter generated robust operating leverage and profitability, and industry demand trends remained strong. Today, given what we are being told from our various manufacturing partners and given the recent supply chain issues we have experienced, we think it's prudent to expect flattish unit growth. Given the visibility provided by our backlog, we are raising our earnings per share guidance to the range of $8.05 to $8.45 for 2022 from $7.90 to $8.30. Our guidance now reflects a substantial increase from the initial outlook when fiscal 2022 started, which was $7.20 to $7.50. We expect July will end with positive same-store sales growth, and our backlog remains at historic levels. As we've said, industry demand remains strong, and we are generally outperforming these elevated levels. As I stated at the beginning of this call, our team's performance in the first 9 months of fiscal 2022 demonstrates excellent execution as our diversified model and exceptional customer service generate sustainable growth. We remain committed to the long-term financial strength of the company and will pursue acquisitions, additional brand expansions and higher-margin businesses with a focus on recurring revenue, which will support our overall growth strategy, all with the view to create long-term shareholder value. And with that, operator, let's open up the call for some questions. I guess first question, I wanted to kind of square a few statements that you made. I guess, first, you talked about a record backlog. And then in a follow-up to that, you talked about customer deposits falling sequentially from March to June. But the record backlog is at this point in the year starting the fourth quarter heading into next fiscal year, we've never had a backlog this big nor has our customer deposits ever been this big for this time of the year. Sequentially, when you look at the history of the marine industry, traditionally, deposits have declined from March through June. And when product comes in that's not otherwise deposited, it tends to lead pretty quickly. If we go back and look at the units we have on hand today at the end of June versus what we had on hand at the end of the June quarter of 2019, we have 15% to 20% of the units today. It's closer to 15%, to be honest with you. But for us, with as fast as our team gets the product in and delivers it and with the markets that we're in, we're down around 15% of the units...\n Of the normal of the level back then. And that's like-for-like excluding acquisitions, same-store basis. I think overall, demand for us is -- remained strong. Our profile of customer and really the premium level of all of our products, what we internally might call a smaller boat, it really isn't a low-end product. So I would say, once you kind of work through the entire quarter, everything had really good demand. And keep in mind, the level of premium products we carry as well might factor into that. On the supply chain, there's been issues industry-wide for the past 18 months. Yes, I think just the general supply chain issues experienced by the manufacturers are still out there, maybe getting a little better in some areas. But for us, that just impacts how quickly the boat can leave a factory, how quickly it can actually get on a truck or a ship and get here in time. But I think even ex acquisitions, inventory is up sequentially and year-over-year, but then sales are down because of the lack of inventory. Yes, it's a good question, James. So if you look at the increase in inventory, about half of it is Texas MasterCraft, Intrepid and then a new Cruiser Yachts facility. So those are kind of not really same-store sales, they are new items. And in the case of manufacturers, that's raw materials with things of that case, in the case of Texas MasterCraft, just the new addition from a dealer perspective. And then of the other half, if you look at the customer deposit increase year-over-year, so customer deposits have gone up like $52 million. And eventually, the customer money ends up sometimes becoming manufacturer deposits that we pay. So say of the other half, a good chunk of that, another $80 million is actually deposits that we paid. So now you get down to $30 million or so, which is the real dollar increase on a year, if you follow my math. And of that $30 million, a lot of that's sold at our stores. It may have come in, in the last 10 days in June and we just didn't get it prepped and delivered in time. And then some of it is some inventory in the Midwest region, as an example, where we did see a little bit of a weather-related softness. So overall, I think the question I was just asked a minute ago, the units that we have on hand are very, very low. And then large boat inventory is virtually nonexistent in our pipeline or if you go on our website, you can see that Hopefully, that helps. And then to this geographic question, obviously, everybody is trying to figure out how much of any weakness was weather-related versus macro related, I guess in an attempt to try to figure that out. Just in kind of as the quarter went along, it accelerated. So kind of that gave us confidence that things were maybe bouncing back, weather-related, whatever it might have been. But the other thing we really don't see is a big difference in the product up there, the customer up there. I just -- we're still trying to work through all that, but it appears, and I think really all others in the industry are saying the same thing, it was a delay and -- but no, we don't see anything else that would be causing it. And then just the July, you talked about July looks like it's going to finish up in terms of same-store sales. I'm assuming -- or I'm sorry, the third quarter for you guys. I'm assuming June if the industry trends are any indication, June was better than at least May, if not April. Yes, I think the industry data is a little misleading because what's causing some of that data to really move around is just the lack of inventory last year and supply chain challenges and all that type of stuff. I would say, like others in the industry, I mean, the business did seem to accelerate in the markets that we talked about, the Midwest as we closed June, and business seems pretty healthy right now. Keep in mind, largest backlog, big customer deposits for this time of the year, trends seem really pretty healthy. So I don't know what the rate of growth is going to be, but we're going to have positive same-store sales for July as an organization. And I don't recall, you'd asked an earlier question, all markets look like they're doing better in July than even in June or most markets do. I don't have that broken down, but I would assume that's a safe bet. I guess, first, Mike, wanted to clarify, obviously, on the last quarter, you're expecting total revenue growth in kind of the mid-teens. Now we're kind of saying high single digit to low to mid-teens, depending. You know what, it's a great question, Eric. So just given the supply chain challenges, we thought it was prudent to not basically be additive. So we did bring down the overall, good that you picked up on it, you caught what we were saying there, that we're still aiming to hit that mid-teens, but we did kind of lower the range to the high single digits to the mid-teens. If it gets to as high as the low to the mid-teens, there could be some upside, but we're comfortable with the guidance range. And then lastly, I know you kind of made the comment earlier, you kind of play in a higher average price point of boats that's not really considered lower end. Yes, I'd probably answer it maybe a little differently than you're asking there because what we are seeing maybe is a year ago, frothy demand. In the higher end of that product, they were willing to wait even longer. So somebody that used to, let's say, last year would be willing to wait 6 months, maybe they're like, geez, 3 months, let me still talk about it. It's just that we might be seeing that people are -- the smaller the boat, the lower the price, they're not willing to wait as long. And it did seem to be skewed towards some -- I don't want to actually call it skewed because I think everybody has some challenges, but it impacted us more in the dollar value of product coming in than it did at units. The headline of automotive news last week said supply chain challenges are here to stay, and I think it's true for our industry. I think people are learning to deal with it better, but we just got more delays recently from another manufacturer. Once it delays, it's hard to find that window to do a quick catch-up either. And the good news, people who are deposited in their boats are coming. We really don't see cancellations of anything, which some of these folks have waited 9 months, maybe even longer from their original expected date. So it's amazing the passion that people have for the boating lifestyle, which we appreciate. Since there are no further questions, I would like to turn the call back to Mr. Brett McGill for closing remarks. And Mike and I are available if you want to reach out, and we look forward to updating you on the next quarter."
}