{
    "symbol": "RYAAY",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-17 20:27:06",
    "content": " And we expect to take delivery of another 55 -- at least 55 of these Gamechanger aircraft next winter, so that we can emerge in summer of 2023 with an ambitious growth target of that's north of 180 million passengers in FY '24. We've also announced a very exciting partnership with Neste in the Netherlands to uplift 40% of our fuel uplift in Schipol will be with SAS, and we're very pleased that those efforts have been rewarded by the carbon disclosure project to increase our environmental rating from a B- to a B this year, which is the -- it makes us the industry-leading environmental airline in Europe. It's exceeding our expectations on the likes of the fuel burn, although we're only just starting to get to the 90%-plus load factors as we did in April in the numbers we announced in the past few days, the crew and the customers alike are very complimentary of the aircraft. I think it's fair to say, and we've been open about this in Q1, our June quarter, average fares are running behind where they were at pre-COVID, because we're driving -- using price, using our low -- our cost advantage to rebuild forward bookings. We're well hedged, Stephen, into next financial year, about 80% of our fuel hedged, that's kind of a split between jet swaps, about 65% of the fuel covers with jet swaps, about $630 a metric ton or about $63 a barrel. But we think there, as we've seen previously with both Omicron and with Ukraine, it's subject to being badly disrupted at short notice by adverse news flows, but there will be a strong traffic recovery, we'll do a very good cost performance over the next 12 months, but really any kind of profit outcome for the year. If everything goes right, it could be better than that if there's adverse news flows, particularly on COVID into next winter, recession and/or Ukraine, the profit -- I think it will still be profitable, but the profits will be significantly behind where they were pre-COVID, and really it's too early to say until we get I think towards the second half of the fiscal year, we really won't have any better guidance than that."
}