{
    "symbol": "RYAAY",
    "quarter": 1,
    "year": 2022,
    "date": "2021-07-26 12:36:04",
    "content": " Your line is open. But other than that, I think you'd see, continue the meaningful cost reductions across all of the other lines driven hugely by the fact that we would be operating more than 60 MAX – Boeing MAX aircraft next summer – summer 2022. I think that into 2022 and into 2023, you're looking at a – excluding out growth in meaningful, I would say 20% reduction in short-haul capacity across Europe. I mean, you can see like some of it has been, I suppose, muddied by the pace of recovery with your competitors as to where they're actually going to – where they're actually going to put that this winter, but I wouldn't disagree that the figure of that 20% is probably the more likely a reduction and certainly the one that we've been looking at. Your line is open. Taxes that are levied on a pro rata basis will not emit against the margin or the price difference or cost difference advantage we have over all other airlines in Europe, and therefore, people will – I think if anything is heightened, the growth that Ryanair will enjoy over the next number of years because if there's an overall ratcheting upwards of the cost of air travel and the lowest cost provider, which will be Ryanair in all markets and not Wizz or EasyJet or anybody else, and we'll do best and we'll recover stronger. Your line is open. What I'm saying is that I wouldn't get carried away with things because the strong performance particularly in seat-on-seats of lower load factors you'd have to see whether that translates when load factors return because people may well have been conscious of where they pick seats during the COVID crisis, but there are lots of other initiatives that are coming that I am reasonably confident that we're going to see some growth on the core products and ancillary revenue. Your line is open. Your line is open. So it’s been with a very curtail schedule, we've actually been flying empty aircraft up there to keep pilots current and cabin crew current because we knew that the recovery, when it came would be very strong, and we believe that's one of the reasons why EasyJet's recovery has been so slow that they have grounded a lot of aircraft, pilots and cabin crew, and therefore, they are daily facing currency problems. But again, I think the collapse of competition, the capacity cutbacks across Europe, and we have worked very closely and well with unions in the last two years to explain that look, it's better that our people take very modest pay cuts last year and this year, we start and to repay those or to restore those pay cuts over the next two or three years. One of the other challenge that will be in the short-term in the next number of weeks though is airports and handling companies, we had a lot of problems at a lot of airports over this weekend, you've gone straight back into kind of the peak weekend handling companies who are short-staffed, airport check-in, short-staffed airport security, short-staffed – we saw our on-time performance fall from kind of 95% to 80% on Saturday and Sunday, mainly as a result of ATC staffing. Some places are still slow and think that it's all going to bounce back and there isn't going to be 20% reduction in intra European capacity, but we're certainly seeing it out there. Your line is open. Look, I think the MAX performance in the first month has been extraordinary, but I would also caution, we're operating with a load factor in the last month, so it looks like it's kind of about 75%, 76% as opposed to normally in July or June, July, we'd be operating up around 90%, 92%. Your line is open. We've got some – I say, this the last time, we'll have some announcements later this year on how we deal more efficiently with customer, destruction for the less than 1% of fights that we have disruptions on and how we actually get that information out to people in our 240 airports, so that people know exactly what's happening, how they get their refunds process, how we deal with EU 261 and deal with that in a much more efficient manner. Your line is open."
}