{
    "symbol": "HLI",
    "quarter": 3,
    "year": 2023,
    "date": "2023-01-31 23:18:06",
    "content": " Iâ\u0080\u0099d say thereâ\u0080\u0099s a dichotomy going on, which for the last several months, the last few quarters, Iâ\u0080\u0099d say, the amount of new business, the size of our prospects, pipeline, backlog, however, you might count it, actually continues to grow. And just going back to Brennanâ\u0080\u0099s question, which was kind of the million-dollar question, which how should we think about M&A over the next 12 months and thatâ\u0080\u0099s probably not just for Houlihan but for anyone in the industry is, we are in an unusual circumstance where we are seeing increased activity in Corporate Finance relative to the last quarter and increased activity in Restructuring relative to the last quarter, which is unusual. And now this was a business that was growing at a relatively consistent, letâ\u0080\u0099s call it, like mid single, high single-digit type clip up until COVID and then you saw this meaningful step function higher, where you have been running somewhere in like the $75 million plus or minus type per quarter zone and this is the first quarter where we have actually seen like a decent step down, even more acute than what we saw in Corp Fin, which was merely a bit surprising. Thatâ\u0080\u0099s great color, Scott. And then the question we answered earlier, Iâ\u0080\u0099d say, the financing marketplace at least in the mid-cap space, slightly better in January, but not enough to say, yeah, we are back into an environment where we can finance meaningfully more deals than has been occurring in the last couple of quarters. Thatâ\u0080\u0099s great color, Scott. I mean overly simplistic, you can look, call it, roughly a quarter of the business is non-U.S. and exchange rates, while they have gotten a little better, depending on what perspective you got here, but the dollar has still strengthened against almost every other currency and so itâ\u0080\u0099s put some negative elements into the amount of revenues that we are ultimately presenting when it gets converted into U.S. dollars."
}