{
    "symbol": "IKT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 11:11:12",
    "content": "  Operator: Good day, and welcome to Inhibikase Therapeuticsâ\u0080\u0099 Second Quarter 2022 Financial Results Conference Call. On Friday, Inhibikase issued a press release announcing financial results for the second quarter ended June 30, 2022. We encourage everyone to read Fridayâ\u0080\u0099s press release, as well as Inhibikaseâ\u0080\u0099s quarterly report on Form 10-Q for the second quarter 2022, which has been filed with the SEC. At Inhibikase, we are focused on reversing the effects of neurodegenerative diseases inside and outside of the brain, with the goal to deliver disease-modifying treatments to patients suffering from these devastating neurodegenerative diseases. Most notably, we initiated our 201 trial, the Phase 2a clinical trial using IkT-148009 for Parkinson's disease, with the opening of the first clinical site on May 23 of this year. This represents a major milestone for us, as well as for patients and families living with Parkinson's disease. The choice of the dosing duration was made to balance the unknown safety of long-term dosing of IkT-148009 against the outcomes of animal model studies, where, in animals, the therapeutic dosing resulted in substantive recovery from the effects of Parkinson's disease in just eight weeks in both the brain and gastrointestinal tract. Also, in recent weeks, we have filed our investigational new drug, or IND application for IkT-001Pro, our project formulation of imatinib mesylate, which we will apply to stable-phase chronic myelogenous leukemia. Although an administrative delay had occurred, we expect to hear from the FDA by August 26, 2022, on the status of the IND, and we are now working hard to initiate the bioequivalence study to identify the dose of 001Pro equivalent to 400 milligrams of imatinib mesylate, the standard of care for stable phase CML. As I just mentioned, we expect to begin dosing healthy volunteers in our bioequivalence study of IkT-001Pro, following FDA review of the IND. In addition, we will present additional data from the 101 study, our Phase 1/1b study of - clinical trial study of IkT-148009 at the Movement Disorder Society Congress in Madrid, Spain, in September of this year. Now, let turn to an in-depth review of our clinical and pre-clinical portfolio, beginning with our lead program, IkT-148009, a highly selective non-receptor Abelson Tyrosine Kinase, or c-Abl inhibitor, for the treatment of Parkinson's disease and related disorders. As you know, Parkinson's disease remains one of the most prevalent neurodegenerative disorders and affects nearly 1 million people in the US annually. IkT-148009 has so far demonstrated a low toxicity profile in healthy subjects, and in Parkinson patients, at least up to seven days of daily dosing. All of these features of IkT-148009, including the ability of Abl kinase inhibition to protect against the development and progression of Parkinson's-like disease in the brain, have been confirmed in validated animal models, giving us substantiate - giving us a basis for pursuing Abl kinase inhibition as potential disease-modifying therapy in patients. In June, we were pleased to announce that we advanced into a Phase 2a study dubbed the 201 trial, following a review of the study protocol and the Phase 1/1b data or 101 trial data by the US Food And Drug Administration. As you know, the 101 trial was a single and multiple setting dose safety, tolerability, and pharmacokinetics trial designed to evaluate once-daily administration of IkT-148009. The study evaluated single doses, up to 325 milligrams per day, and multiple doses up to 100 milligrams, first in 80 older and elderly healthy adults, and subsequently in 13 patients with mild to moderately advanced Parkinson's disease. As we announced in June of this year, and as we will share in greater detail at the Movement Disorder Society Congress in September, we're pleased to observe that clinical pharmacology of 1409 in patients, both with parallel to clinical pharmacology of 1409 in older healthy volunteers. And also, that 1409 demonstrated a favorable safety and tolerability profile up to a dose of 325 milligrams, with no clinically significant adverse events observed. We shared these results with the FDA, who reviewed safety, tolerability, and PK data from the first two cohorts of the 101 trial, as well as the proposed trial protocol for 201, and the FDA agreed that we can proceed with the 201 trial. The 201 trial was initiated at the end of May 2022, just 16 months after IkT-148009 entered the clinic. The 201 trial is a three-to-one randomized, double blind 12-week dosing trial that will evaluate the safety, tolerability, and steady state PK of IkT-148009 as primary endpoints. Let me begin with IkT-001Pro, our pro-drug formulation of imatinib mesylate, which we have designed as a potentially safer alternative to the first FDA-approved Ableson kinase inhibitor known as imatinib. IkT-001Pro has the potential to be a safer alternative for patients, and may improve the number of patients that reach and sustain complete cytogenic responses in stable phase chronic myelogenous leukemia or CML in preclinical studies. Our bioequivalence clinical trial is designed to evaluate the safety profile of IkT-001Pro, as well as identify dose with similar systemic exposure and PK to 400 milligrams of imatinib at 96 hours post-dose administration. Once the equivalent dose is determined, we plan to initiate a superiority study, comparing the selected dose of IkT-001Pro to generic Gleevec in existing stable phase CML patients. However, current economic times necessitate that we preserve capital, and therefore, initiation of the MSA trial itself will also require us to raise additional working capital to execute the planned Phase 2 trial in MSA. For the second quarter 2022, we reported at net loss of approximately $4.6 million, or $0.18 per share, compared to a net loss of approximately $2.6 million, or $0.22 per share for the second quarter of 2021. Net loss for the six months ended June 30, 2022, was $9.3 million, or $0.37 per share, compared to a net loss of $5.3 million or $0.47 a share in the six months ended June 30, 2021. Research and development expenses were approximately $3 million for the second quarter of 2022, compared to approximately $2.4 million for the second quarter of 2021. Research and development expenses were $6 million for the six months ended June 30, 2022, compared to $4.8 million in the six months ended June 30, 2021. Selling, general and administrative expenses were approximately $1.7 million for the second quarter 2022, compared to approximately $1.6 million for the same period in 2021. Selling, general and administrative expenses for the six months of June 30, 2022, were $3.3 million, compared to $3.2 million for the six-month period, June 30, 2021. As of June 30, 2022, Inhibikase had approximately $32.2 million in cash and cash equivalents, and we expect that our existing cash and cash equivalents will be sufficient to fund our normal operations and capital expenditure requirements through December 31, 2023. As I mentioned earlier, we are very encouraged by our progress year-to-date, and look forward to continued momentum across our clinical and pre-clinical programs in 2022, as we work to improve the lives of patients suffering from neurodegenerative diseases. We are laser focused on clinical execution as we begin to screen patients for our 201 study, and prepare to initiate our bioequivalent study of the IkT-001Pro in healthy volunteers. We also look forward to updating you again soon, beginning with the presentation of results of our Phase 1/1b trial of IkT-148009 at the Movement Disorder Society Congress, in Madrid, Spain, in mid-September. As we previously indicated, we treated - we had planned to do three cohorts of eight patients each at three doses, 50, 100, and 200 milligrams. When we reached six of eight patients in the 100-milligram dose, we had heard back from the US FDA agreeing with our plan to proceed with the Phase 2 dosing period. So, we elected to terminate the trial early and advance into the Phase 2 because the 200-milligram dose that was to be explored in the Phase 1b, is also being explored in the Phase 2 trial, and we saved approximately $600,000 in doing so. We have - we will review at the MBS Congress in mid-September, the measurement of Parkinsonâ\u0080\u0099s-related parameters, where we'll demonstrate that there's no worsening of the disease in the presence of drug administered once daily for just seven days. Well, these are early - these are patients that are not currently on medication, so they have a little bit less urgency in their involvement in clinical trial work compared to patients that are already on levodopa therapy. We don't, we - our view is that three-month dosing may begin to show clinical benefits based on the animal model studies we've previously reported about repeatedly, but we don't know that. The most important thing of course is, is that we have to demonstrate long-term safety of an oral kinase inhibitor in around 100 patients, because that's what the - that's the metric the FDA uses to allow you to go into chronic dosing. We've made very rapid progress on understanding the pharmacology of these drugs in human beings, and we are encouraged by upcoming events that we anticipate in the near future that could further illuminate the potential clinical benefits of both IkT-148009 in multiple areas, and 001Pro in stable phase CML."
}