{
    "symbol": "IKT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 09:55:26",
    "content": "  Operator: Good day, and welcome to Inhibikase Therapeutics' Third Quarter 2022 Financial Results Conference Call. Good morning, and welcome to Inhibikase Therapeutics third quarter 2022 financial results conference call and audio webcast. Yesterday, Inhibikase issued a press release announcing financial results for the third quarter ended September 30, 2022. We encourage everyone to read yesterday's press release, as well as Inhibikase's quarterly report on Form 10-Q, which has been filed with the SEC. In addition, this conference call is being webcast through the Investor Relations section of the company's website, and will be archived there for future reference. The company undertakes no obligation to revise or update any forward-looking statements to reflect events or circumstances after the date of this webcast, except as may be required by applicable securities law. As a result of their review, they issued a clinical hold on the IkT-148009-201 program in Parkinson's disease or PD and the use of IkT-148009 in MSA. I would like to highlight today that we have observed only two mild adverse events in the ongoing Phase 2a 201 trial, and have recorded no serious adverse events. In the interim, we plan to conduct a blinded safety assessment based on the first 11 patients that were enrolled in the 201 trial and will randomize 1:1:1:1 for the 12-week once-daily dosing. However, since none of the initial 11 patients had fully completed the study, once the clinical hold is lifted and subject to discussions with the FDA, the study will need to be restarted. In addition, I would like to reiterate results from our Phase 1 and 1b study of IkT-148009 that were presented at the Movement Disorder Society Congress in September of this year. Moreover, assessments of motor, non-motor and quality of life in patients enrolled in the study showed that treatment with IkT-148009 did not worsen disease over seven-day dosing. As a reminder, IkT-001Pro is our prodrug formulation of the imatinib mesylate developed to improve the safety of the first FDA improved Abelson Tyrosine Kinase inhibitor known as imatinib as a treatment for stable-phase Chronic Myelogenous Leukemia or CML. In preclinical studies, IkT-001Pro could be dosed up 3, 4 times higher than imatinib in non-human primates before inducing adverse event. The study will also aim to identify a dose with a similar systemic exposure of pharmacokinetic profile compared to 400-milligram imatinib mesylate, the standard of care drug at 96 hours post administration. We expect our existing cash, cash equivalents and marketable securities will be sufficient to fund our normal operations and capital expenditure requirements through February 2024, subject to outcomes from our discussions with the FDA on the 148009 program. As we look to the remainder of the year, we will continue to provide updates as appropriate on the clinical hold of our IkT-148009 programs."
}