{
    "symbol": "IKT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-17 09:42:07",
    "content": "  Operator: Greetings, welcome to Inhibikase Therapeutics’ First Quarter 2022 Financial Results Conference Call. Yesterday afternoon Inhibikase issued a press release announcing financial results for the first quarter ended March 31, 2022. We encourage everyone to read yesterday's press release as well as Inhibikase’s quarterly report on Form 10-Q for the first quarter 2022, which is being filed with the SEC. And thank you, Alex, and thank you for everyone to joining Inhibikase Therapeutics’ first quarter 2022 earnings call. As we kicked off the year, we have worked diligently to advance our clinical and preclinical development programs as well as extend our thought leadership in Parkinson's disease. We also participated in multiple medical conferences this past quarter, including the Annual AD/PD Conference where we presented results from our Phase 1 and Phase 1b studies for IkT-148009 as well as the Next Generation Kinase Inhibitors Summit, where we highlighted the rationale behind targeting c-Abl Parkinson's disease. Most importantly, we expect to dose the first patients in our Phase 2a study for IkT-148009 in Parkinson's. In addition, we also expect filing our IND application for IkT-001Pro for stable phase Chronic Myelogenous Leukemia, or CML, as well as report preclinical data from at least one study of IkT-148009 in Multiple Systems Atrophy or MSA. Together with our key opinion leaders, we cover the current unmet need, competitive and regulatory landscape in Parkinson's disease as well as our development strategy for IkT-148009 as a potential therapeutic option for patients. The trial is a 3:1 randomized, placebo-controlled dose escalation trial that is evaluating the safety, tolerability, and pharmacokinetics of seven-day dosing of IkT-148009 at three escalating dose levels and patients with mild to moderately advanced Parkinson's disease. In March, we presented data from the first cohort of the study at the Alzheimer's and Parkinson's Diseases Conference, or AD/PD Conference. While the trial is still blinded, we cannot draw any conclusions about the potential benefit of IkT-148009 based on the dosing of a small number of patients for seven days at different doses. Based on these outcomes, we continue to believe that the results seen thus far in our Phase 1 and Phase 1b studies support the safety and therapeutic potential of IkT-148009 as a disease-modifying treatment for Parkinson's, and we are working diligently to advance IkT-148009 into a Phase 2a study. The Phase 2a study dubbed 201 Trial will be a 3:1 randomized, double-blind 12-week dosing trial that will evaluate the safety and tolerability of three doses of IkT-148009 in up to 120 patients diagnosed with Parkinson's disease who have not yet progressed to the need for symptomatic treatment. The trial will also measure a hierarchy of motor and non-motor function using patient and clinician reported outcomes inside and outside of the brain as secondary endpoints, and will evaluate whether treatment with IkT-148009 leads to a reduction or clearance of pathogenic alpha-synuclein aggregate as exploratory end points. These preclinical studies are evaluating whether inhibition c-Abl could have a therapeutic benefit in MSA, and we expect to report data in at least one of two animal models in the second quarter of 2022. Depending on the full results from these model studies and subject to agreement with the FDA and equivalent regulatory bodies in European Union, we may advance 148009 into a Phase 2a clinical study in the fourth quarter of 2022. Let me review our financials for the three months ended March 31, 2020 and to -- for the first quarter of 2022, we reported a net loss of approximately $4.7 million or $0.18 net loss per share compared to a net loss of approximately $2.6 million, or $0.26 net loss per share for the first quarter of 2021. Research and development expenses were approximately $3 million – excuse me, for the first quarter of 2022 compared to approximately $2.4 million for the first quarter 2021. The increase was driven by a $2.1 million increase in non-grant-related research, offset by a decrease of $1.2 million in grant related research expenditures and also a decrease of $0.4 million in non-cash stock compensation expense. Selling, general and administrative expenses were approximately $1.7 million for the first quarter of 2022 compared to approximately $1.6 million for the same period in 2021. The increase was primarily due to increased headcount resulting in increased compensation expense of $0.2 million, increased legal fees, board fees, investor relations and consulting fees of $0.1 million and a net increase of $0.2 million for other normal operating expenses offset by decreased non-cash stock-based compensation expense of $0.4 million. As of March 31, 2022, Inhibikase had approximately $36.6 million in cash and cash equivalents, we expect that our existing cash and cash equivalents will be sufficient to fund operating expenses and capital expenditure requirements into the third quarter of 2023."
}