{
    "symbol": "LOCO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 22:20:04",
    "content": " More importantly, the launch of our Shredded Beef Birria limited-time offer on March 17 significantly accelerated our top line momentum, which has continued into the second quarter, with system-wide comparable restaurant sales growth of 12.4% through April 27. The decrease was partially offset by a 2.3% increase in company-operated comparable restaurant sales and $1.1 million in non-comparable restaurant sales, which included restaurants temporarily closed due to the pandemic during last year's first quarter. Food and paper costs as a percentage of company restaurant sales increased 360 basis points year-over-year to 29.5% due to increased commodity costs and investments in new packaging, partially offset by higher menu prices. But then the launch of the Birria product with the marketing issues, really, you just saw, again, an inflection point where really accelerated to the point where we're seeing obviously high comp sales, and as I highlighted, record sales across the company, the franchisees in the system for three straight weeks. I mean, is that how you're looking at it now that really is the operations is the opportunity to close that gap, or I think historically over the last year or two, you've talked about the company stores being more impacted by labor shortages, just given where your -- you have the stores. And again, that's why we're excited about tostada because, again, we know that tostadas is a distinctive product for us, is a great product for us and working through how we promote that similar Birria, our target isn't to get back to last year's mix on tostadas is to beat last year's mix on tostadas and continue driving the brand and how it resonates with the younger consumers. We've got a lot of great things in the pipeline from a product standpoint, a lot of great marketing initiatives and a real focus on the company operations and a big opportunity there, as we improve those, very confident that we're going to see additional sales growth come from those company restaurants."
}