{
    "symbol": "DUK",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 12:50:26",
    "content": "  Thank you for attending today's Duke Energy Quarter 1, 2022 Conference Call. My name is Amber, and I will be your moderator for today's call. All lines have been muted during the presentation portion of the call, with an opportunity for questions-and-answers at the end. I now have the pleasure of handing the conference over to our host, Jack Sullivan, Vice President of Investor Relations with Duke Energy. Leading our call today is Lynn Good, Chair, President and Chief Executive Officer; along with Steve Young, Executive Vice President and CFO. The appendix of today's presentation includes supplemental information and disclosures, along with a reconciliation of non-GAAP financial measures. So with that, let's turn the call over to Lynn. And good morning, everyone. Today, we announced adjusted earnings per share of $1.30 for the quarter, delivering strong results to start the year, driven by continued growth in electric volumes. I'd like to take a moment to thank approximately 19,000 restoration workers, who worked tirelessly to restore power to over 1 million customers across a series of winter storms, the most we've seen in eight years. Despite the Q1 storms, we remain on track to deliver within our original guidance range and are reaffirming our full year earnings guidance range of $5.30 to $5.60, with a midpoint of $5.45. We're also reaffirming our long-term EPS growth rate of 5% to 7% through 2026, at the midpoint of our original 2021 guidance range. We're monitoring economic trends and will take action if necessary as we continue to execute the important strategic work we have underway in the Carolinas, Indiana and Florida. Our work has been recognized across the ESG community, including by MSCI, which upgraded our ESG rating to AA in February. We're also laying the groundwork for even more progress with our proposed carbon plant in North Carolina, our IRP in Indiana and our ongoing solar and grid investments in Florida. As a reminder, this landmark bipartisan legislation provides for a clean energy transition as well as modernize performance-based, rate-making provisions, including multiyear rate plans, performance incentive measures and residential decoupling. We've been working closely with stakeholders on the development of our proposed carbon plan, which we will file with the commission on May 16. The plan will outline multiple portfolios to achieve the 70% carbon reduction target, including proposals around timing of coal plant retirements and resource additions. We expect substantial solar and battery additions, demand side management and energy efficiency opportunities in every pathway. Following the May 16 filing of our proposed carbon plan, the commission will gather additional stakeholder input, make adjustments and approve a final plan by the end of the year. In February, the North Carolina Utilities Commission issued its order on rulemaking for performance-based regulation. And in April, the Commission issued its order on rule making for coal plant securitization. Both orders were constructive, establishing processes that are fair, balanced and consistent with the policy objectives of HB 951. Another strategic priority for 2022 is to file a rate case, introducing the modernized rate-making tools approved in HB 951. If enacted, this legislation would provide an additional tool to recover prior and future storm restoration costs, creating significant savings for our customers as compared to traditional recovery mechanisms. Moving to Florida, we're making investments to harden the grid under our storm protection plan. We recently filed our updated the plan, which includes $7 billion of capital investments over the next 10 years. In Indiana, we filed request for proposals for up to 2,400 megawatts of new generation through 2027, which includes both intermittent and dispatchable resources to support our transition from coal. We're pleased with the response to our intermittent RFP, having received bids from 13 developers on more than 30 different projects totaling over 7,000 megawatts. On May 2, we received the bids for the dispatchable portion of the RFP and are reviewing them now. In November, we filed our second T Disk plan in Indiana. The six-year, $2 billion plan includes investments to improve customer reliability, harden the grid and prepare for distributed generation. A hearing was held in March, and we expect to receive a decision from the commission in July. If approved, the program would begin in 2023. Shifting to the LDCs, we continue to make investments to build needed infrastructure, improve reliability and to comply with federal regulations. In South Carolina, we filed a general rate case in April. If approved, we anticipate revised customer rates will be effective by October. And in Tennessee, legislation was recently passed that will allow natural gas utilities to invest in low to zero emission capital projects. In closing, we're making progress on all fronts across our jurisdictions, meeting our commitments and executing our clean energy strategy. We have a clear path forward for 2022, and believe our investment plan will deliver sustainable value to shareholders and 5% to 7% earnings growth over the next five years. And with that, let me turn the call over to Steve. And good morning, everyone. I'll start with a brief discussion of our quarterly results, highlighting a few of the key variances to the prior year. As shown on Slide 8, our first quarter reported earnings per share was $1.08, and our adjusted earnings per share was $1.30. Within the segments, Electric Utilities & Infrastructure was up $0.10 compared to the prior year. Partially offsetting these items were higher O&M, primarily attributed to severe winter storms and weaker weather than last year. In our gas LDC business, we were flat year-over-year, with contributions from rate cases and riders, offset by higher O&M due to timing and costs associated with new investments. Results from Commercial were $0.02 lower due to fewer growth investments compared to 2021, partially offset by favorability from fewer winter storms impacting our commercial fleet. And in the other segment, we were $0.04 lower, primarily due to lower market returns on Benefit Trusts. Turning to Slide 9, let me touch on electric volumes and economic trends. We started off the year with continued load growth, improving our rolling 12-month retail growth rate to 3.8%. This figure has continued to steadily improve over the past four quarters, as we've been replacing weaker orders experienced in the first year of the pandemic, with stronger quarters during the second year. We believe Q1 '22 represents the high watermark for this rolling 12-month figure and expect the growth rate will moderate as we move further into 2022, ultimately landing around 1.5% for the full year. For commercial and industrial classes, we saw a continued rebound of our existing customers. And looking ahead, we will start to see incremental growth from new customers due to the outstanding accomplishments of our economic development team. In 2021, we helped attract nearly 12,500 new jobs and $6.2 billion in capital investment to our service territories, creating vibrant economies and accelerating growth in our communities. While these results are a great start to the year, we are watching key economic indicators such as moderating GDP growth, rising inflation and supply chain constraints. We will actively -- we will activate agility measures and leverage our size and scale to counteract rising cost and secure necessary materials through vendor relationships, advanced ordering and other measures. This work will continue for all aspects of our business to control O&M costs, to secure the materials and services we need to execute our growth plan. With ongoing constraints impacting the global supply of solar panels, let me take a moment to address this matter. On our fourth quarter earnings call in February, we reduced our 2022 net income projection for the Commercial Renewables segment to approximately $150 million, down from our original range of $200 million to $250 million. Having taken those steps in February, we are well positioned on all solar projects slated for 2022 across our regulated and commercial operations. Looking to 2023 and beyond, we're closely monitoring the Department of Commerce investigations. On the regulated side, we expect no delays in 2023. For commercial renewables business, we are targeting approximately 800 megawatts of solar in 2023 and have line of sight on roughly half at this time. If delays persist, we may see a few projects shift from 2023 to 2024, resulting in the commercial business delivering more in-line with 2022. As a reminder, our commercial solar capital for 2023 represents approximately 1% of our total CapEx for the five-year plan. As such, we have a significant inventory of enriched uranium product and have agreements with a diverse set of suppliers across several continents. Regardless of any potential sanctions related to the Russia-Ukraine war, our existing uranium inventories, contracts and supply flexibility are sufficient to fuel our nuclear fleet. We are off to a good start in 2022, and feel confident of our earnings guidance range of $5.30 to $5.60, with a midpoint of $5.45. Compared to 2021 second quarter, we will see higher O&M, simply due to the different slotting of planned outages in a given calendar year. Additionally, the Florida rate settlement timing and wholesale contract recognition will pick up in the second half of 2022. The growth in the natural gas business unit, resulting from rate cases, riders and customer growth, will largely impact the fourth quarter. Turning to Commercial Renewables, the majority of the negative variance compared to 2021 occurs in the first half of the year. Again, we are on target for earnings in 2022, but these factors will impact the quarterly shaping of those earnings. In conclusion, we continue to make meaningful strides in 2022 towards the advancement of our clean energy strategy, with a keen focus on affordability and reliability for our customers. Our attractive dividend yield, coupled with our long-term earnings growth from investments in our regulated utilities and robust service territories, provides a compelling risk-adjusted return for our shareholders. With that, we'll open the line for your questions. Julien, your line is now open. Hey, good morning, team. I think the key point was you're in line from '22 to '23, so kind of at that 150-ish level for '23. And also, if you can, can you recap for us a little bit on the earnings recognition. And, Julien, I'll take a shot, and I'm sure Steve will have some things to add. So the earnings that we have been talking about, the adjustment that we made to 2022, we are tracking exactly to both of those. For 2023, we continue to prioritize our regulated renewables and they are on track. As we look at 23% for commercial, there is some uncertainty that's been created by this investigation really around price and how that price is going to ultimately impact project economics. And what Steve shared with you is that range could include something comparable to 2022 if the delays persist, or we have the potential to do better than that if clarity occurs soon enough so that we can keep projects on track. And so as we think about 2023, we are confident in our 5% to 7% growth rate. So on income recognition, I'll turn it to Steve to talk a little bit about that, Julien, and then we can circle back and see if we resolve these questions. Julien, on the ITC recognition, the past couple of years, the projects we've been looking at are three to five years, in that range, depending on the tax equity arrangement, but we've been in that range. But again, as projects move, we look at what the needs are and what makes sense to the tax equity partner as well. You have shifted, I don't know, half of your portfolio. -- go forward, Lynn, please. Well, what we were trying to share, Julien is if we do end up shifting, our expectation is the '23 million would be in the range of '22. And then as we look out to 2024, we believe that gives sufficient time, hopefully for these supply chain issues to resolve themselves more clarity on price. And we'll, of course be monitoring and updating along the way. Clearly, and evidently, this time-related issue, so I very much appreciate that. And $0.12 is on the high end, Julien, as you would expect, because we're experiencing that interest rate really on short term at this point, and our dollar averaging into long-term rates. So utilization of that, we've been opportunistically going into the market, working with tenure and timing, which, given our scope and scale, we can do pretty well. Jonathan, your line is now open. And good morning, guys. Obviously, I appreciate you're going to tell us more about that -- tell everyone more about that in a bit. But, Lynn, you mentioned there will be several different options, and that'll encompass different technologies. Hey, Jonathan, it's the latter. And ultimately, it would be the commission's decision on pace, technologies, price implications, et cetera. So when we file this on Monday, Jonathan, we will come -- provide information to all of you on what's in there. And then, of course, this will be a centerpiece of our discussion over the balance of the year. And then just on -- just in terms of what you're seeing on load and your comments about second quarter probably being the peak, I mean, how is the -- what you've seen -- sorry, first quarter, how has what you've seen in terms of the last few weeks relevant to the trajectory you expected when you gave that year-end 1.5% glide path, I guess? Jonathan, I would say we continue to experience very strong growth in the Carolinas and in Florida and that shows up with customers, it shows up with economic development. Yeah, I think we're kind of out of the gate strongly here. But as Lynn said, we're not going to move off 1.5% at this time because there are other factors we need to think about we're early in the year. And when people move in, the commercial is going to follow that, hotels, resorts, et cetera. So hopefully, that will carry through and continue on. But we're off to a good start, but we got to keep an eye on it, not time to change the forecast. It's been good, but it's enabling you to be a little more conservative as you think about the rest of the year. Jeremy, your line is now open. We will include some level of renewables and battery storage consistent with the carbon plan, really targeted for the end of the three-year period. So that will give us an opportunity to fully understand the approved carbon plan and to the extent that the adjustment needs to be made in capital, we would do so at that time. So I would think about these things running in -- a bit in parallel, Ryan. But given that the majority of the capital is T&D, we don't expect a material impact on the multiyear rate plan from the carbon plant in this three-year cycle. Just curious, you could hit on a little bit in the script, but just going to trends you're seeing across your cost structure. We continue to see what you're hearing throughout the industry, whether it's raw materials, labor, of course, fuel costs have been front and center. But as Steve, indicated, we are addressing those risks with improved planning, with our long-term contracts, our scale, inventory, substitution, additional suppliers, just a variety of considerations. And as we look at O&M in particular, we're confident in our trajectory that we had planned for 2022, and maybe a little background there, Ryan. We've been able to address even delays in supply chain, make substitutions in our projects and keep executing for our customers. Michael, your line is now open. Thank you for taking my ---\n Hi, Michael. Congrats on a good -- hey, Lynn. First of all, O&M. O&M, ex-storms, was up year-over-year. And if I understood Steve's comments correctly, you'll have some O&M pressure in the second quarter with outage schedules, I would assume. We had targeted flat, Michael, and it will certainly be at least flat. Our agility efforts frankly, that we are putting in place, I think, could drive it downward. But absent storms, I feel good, certainly about being flat to potentially declining. So 1,100 megawatts of renewable resources, 1,300 megawatts of electric generation. And we'll be putting that forward in our expectation of building renewables, buying renewables that there would be some degree of utility ownership. But if the renewable is any indication, we'll get robust responses to those resources as well. Overall, the impact was about a $1 billion increase as a result of updating the SPP filing in Florida, Michael. I would expect it to be back half of the decade, Michael. So it's not going to be in the next couple of years, it would be later. So Lynn is right, it would probably be in the back part of the year. We'll catch some of that in the latter part of our five-year plan, but the bulk of it is going to be after that. It started in late '21, and it's kicking in this year. And Michael, I would suggest that we look at all of these things. The multiyear rate plan, the storm protection plan is a part of an integrated approach to serving customers in Florida and really thinking about how the impact to price and schedule and our construction activities and our capital. Anthony, your line is now open. Hey, hopefully, just an easy one. A lot of the focus on North Carolina, if I could pivot to South Carolina. Just wondering, I don't believe the state has a decarbonization target yet. Anthony, I would maybe pull up just a little bit to talk about the alignment between the two states that has existed over decades, whether you think about nuclear or even work around economic development to make sure that we've got investment going in both states. The approach, we believe, will be aligned and coordinated in a way that makes sense for our customers and for our investors. So I'll leave it at that at this point, Anthony. Again, it's probably, I think, 3% of Duke's overall earning. Anthony, I would think about that. Yeah, I think that's right. And given our scope and scale, we can look across the footprint. So a number of tools across the footprint in that vein, Anthony. David, your line is now open. Just curious, how should we think about solar post your current plans. David, the thing I would point to as I look at ‘24-‘25-‘26, we will be ramping renewable construction in the regulated business in a much more significant way than the short term, the '22-'23 that your customers are seeing. We have not had a renewable build in our capital plan in the Carolinas, but that will begin to show up in '24-'25 and '26. And that will impact the way we think about capital allocation between regulated and commercial, you'll begin to see that in '24-‘25. Absolutely, 55-45, 55% utility ownership. And if I can ask a general question, maybe specific to Duke. And David, I would say there's been ongoing discussion around clean energy policy, around renewable tax credits, around supply chain issues really dating back to the end of last year continuing into this one. Well, thank you for participation today for questions, for your investment in Duke Energy. And as always, we're available if there are questions or further follow-up on anything that we've covered today. That concludes today's Duke Energy Quarter 1, 2022 conference call."
}