{
    "symbol": "DUK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-09 13:24:10",
    "content": " Leading our call today is Lynn Good, Chair, President and CEO, along with Brian Savoy, Executive Vice President and CFO. Actual results may be different than forward-looking statements, and those factors are outlined herein and disclosed in Duke Energy's SEC filings. The appendix of today's presentation includes supplemental information and disclosures, along with the reconciliation of non-GAAP financial measures. Today, we announced adjusted earnings per share of $5.27, closing out a successful 2022. We achieved results solidly within our updated guidance range while making significant progress on our strategic goals, responding to external pressures and delivering constructive outcomes across our jurisdictions. As a result, today, we're reaffirming our 2023 guidance range of $5.55 to $5.75 with a midpoint of $5.65. This reflects the strength of our regulated businesses, our disciplined approach to cost management and a robust $65 billion capital plan that supports our thriving jurisdictions. Before I turn to our regulated utilities, let me provide a brief update on the sale of our Commercial Renewables business. On December 30, the North Carolina Utilities Commission issued an order adopting an initial carbon plan. The near-term action plan provides approval of 3,100 megawatts of solar and 1,600 megawatts of storage as well as transmission upgrades to support the integration of these renewable resources. The commission also approved limited development activities associated with longer lead time investments, including small modular nuclear reactors, pumped hydro and transmission related to offshore wind. And as part of an orderly transition out of coal by 2035, the commission supported planning for approximately 2,000 megawatts of new natural gas generation to maintain reliability. Through its order, the commission reinforced the importance of maintaining a diverse generation mix while conducting an orderly clean energy transition and was clear that ensuring replacement generation is available and online prior to the retirement of existing coal units is a shared priority. In North Carolina, we filed our first performance-based rate application for our Duke Energy Carolinas utility on January 19, which followed a similar filing for our DEP utility last fall. The request includes a multiyear rate plan to fund system improvements to meet the growing needs of our customer base, including $4.7 billion of capital projects that are expected to go into service over the 3-year period. Our request is mitigated by a reduction in operating costs since our last rate case, evidence of our continued ability to manage costs to keep customer rate increases down. Evidentiary hearings are expected to begin in the third quarter and consistent with past practice, we intend to implement temporary rates in September, subject to refund. If approved, we expect year 1 revised rates to be effective by early 2024. In South Carolina, we were very pleased to reach a comprehensive settlement in January with all parties in our Duke Energy Progress rate case. The settlement, which is subject to commission review and approval includes a 9.6% ROE, the continuation of deferrals for grid and coal ash spend and supports accelerated retirement dates for certain coal units. In fact, the settlement is on the commission's agenda for this afternoon. And if approved, new rates are expected to be implemented in April. We also plan to file an updated IRP in South Carolina later this year, which will take into account the carbon plan and the Inflation Reduction Act. On January 23, we filed a petition to adjust customer rates for deferred 2022 fuel costs, less the impact of lower forecasted fuel prices in 2023. In Indiana, we're updating our IRP to reflect results of the 2022 RFP process, regional transmission operator requirements and the Inflation Reduction Act. In Ohio, the commission approved in full our electric rate case settlement in December, which supports the recovery of grid investments to improve reliability and service for our customers. In December, we also filed an electric rate case in Kentucky. As we advance our regulatory strategy, affordability remains top of mind. In summary, 2022 was an extraordinary year for Duke Energy as we made strong progress executing our strategy, responding to difficult external pressures and advancing our clean energy transformation. As we continue to navigate our energy transition, we will do so responsibly, preserving affordability and reliability for our customers and remaining good students -- stewards of communities. I'm confident that our strategy will continue to deliver consistent and lasting benefits to our customers, communities and investors. Thanks, Lynn, and good morning, everyone. We achieved full year adjusted earnings per share of $5.27, above the midpoint of our updated guidance range. These adjusted results exclude our Commercial Renewables business, which was moved to discontinued operations in the fourth quarter. The classification of these assets as held for sale triggered a valuation adjustment of $1.3 billion, which is reflected in discontinued operations and GAAP reported results. In the Electric segment, earnings per share increased by $0.36 in 2022, primarily due to higher volumes, favorable weather and rate increases in North Carolina and Florida. Absent storms, O&M was flat to prior year, which was in line with our guidance. In the Gas segment, earnings per share increased $0.07 and was primarily due to the Piedmont, North Carolina rate case and riders. In the Other segment, unfavorable returns on investments and higher interest expense drove results lower by $0.15. Within Electric, we expect retail volume growth in 2023 of roughly 0.5%. Additionally, we will continue to see growth from the grid investment riders in the Midwest and Florida, namely the Indiana TDISC and Florida SPP plans approved in 2022. We've identified $300 million of savings in 2023, which is primarily related to rationalizing our corporate and business support cost structures. Within our Gas segment, growth drivers include the Ohio rate case currently underway, cost mitigation efforts and customer growth, partially offset by higher interest expense. Finally, we expect the Other segment to be unfavorable due to higher interest expense. In 2022, we saw load growth of 2.5%. These strong results were driven by residential customer growth of 1.8%, higher usage per customer from hybrid and remote work and a continuation of the post-COVID rebound in the commercial class. In 2023, total retail load growth is projected to be roughly 0.5%. Based on 2022 U.S. Census Bureau data, 3 states within our regulated footprint were in the top 6 for net population migration. This illustrates the robust customer growth experienced in our territories, which we expect to continue in 2023. Longer term, we expect annual load growth to be about 0.5% through 2027. I'd like to provide an overview of our 5-year capital plan, which has increased to $65 billion. When compared to prior periods, the capital plan has steadily increased as we move further into the clean energy transition. This increase is net of removing almost $3 billion of commercial renewables capital, including the previous 5-year plan. This means that we've increased the regulated plan by approximately $5 billion, resulting in a 7.1% earnings-based CAGR through 2027. While the investment needs of our utilities continue to accelerate, customer affordability remains front and center. Affordability has consistently been a pillar that governs our planning, and we have several tools to help keep rates low and assist customers who are struggling to pay their bill. First, the benefits of our cost mitigation efforts go back to customers over time, easing bill impacts as we recover capital investments. As I mentioned, we expect 75% of our 2023 cost mitigation efforts to be sustainable. Additionally, we are targeting flat O&M from 2024 through 2027. Our long-term O&M trajectory is supported by smart capital investments within our plan, including modernized equipment and technology investments that will help reduce fuel and operating costs. Next, the Inflation Reduction Act provides substantial benefits for carbon-free resources, including nuclear and solar PTCs and other renewable tax credits. Over the next decade, we will fully leverage IRA benefits across all of our jurisdictions in order to maintain low cost for customers as we execute our clean energy transition. Finally, assisting vulnerable customers has always been an area of focus. But since the pandemic, we worked even more closely with our communities and customers in need. For example, in 2021, we created a specialized team that partnered with agencies across our service territories and help connect customers to nearly $300 million in energy assistance funding over the 2 years. Our ability to execute our robust capital program is underpinned by a healthy balance sheet, and we remain committed to our current credit ratings. In December 2022, we received $1 billion in cash proceeds upon the closing of the second tranche of the Indiana minority stake sale. We expect to receive proceeds from the Commercial Renewables transactions later this year, which will be used for debt avoidance at the holding company. We ended 2022 below our 14% target, largely due to deferred fuel balances. As we recover deferred fuel costs over the next 1 to 2 years, we expect FFO to debt to steadily improve and return to our long-term 14% target, demonstrating our commitment to our current credit ratings. As we look ahead, about 90% of the electric investments in our capital plan are eligible for modern recovery mechanisms, which is critical to maintaining a strong balance sheet, mitigating regulatory lag and smoothing rate impacts. With the steps we've taken to reposition our business and improve our cash flow profile in the years ahead, we are not planning to issue equity through 2027. Our robust capital plan, strong customer growth and constructive jurisdictions provide a compelling growth story. As we begin 2023, we are well positioned to tackle the challenges ahead and look forward to updating you on our progress throughout the year. With that, we'll open the line for your questions. So Lynn, just starting on the Commercial Renewables, it's good to see, obviously, you guys reiterated '23. Obviously, the range assumed midyear cash in the door. Sure, we're continuing to target $5.65 and feel very confident with that. As you can expect, as we entered the year, we had a range of expectations around both timing and proceeds from the sale. And what I see now as being kind of a modest delay from midyear to later in the year, I don't see an impact. And then just a follow-up on -- I know, obviously, the $1.3 billion charge you took for commercial, you're obviously not the only utility that's done this. I think the thing to recognize on an impairment charge, is this an accounting adjustment that's really driven by the earnings profile of renewables, where a lot of the profit that's in the early part of the life, you then depreciate it over a longer period of time. So when you make a decision to exit before the end of the useful life, you've kind of set yourself up for an impairment. The takeaway is the strategic decision around asset remains unchanged, and we're on track for proceeds later this year. And then just one quick one for Brian, if it's okay, on the credit side. Obviously, trying to -- the prior plan had a 14% FFO to debt over 5 years. We're working through the deferred fuel balances, through the regulatory mechanisms in place. Looking to see, are you filing in line with the regulatory recovery that is established. We've had really good success so far in North Carolina and South Carolina, and we have a couple more filings in front of us, both in Florida and Duke Energy Carolinas, North Carolina. And Shar, the only thing I would add to that is we look at this and the agencies look at this as a temporary issue because you can associate it completely with the deferred fuel. And the fact that we have been able to work constructively through recovery mechanisms, and we can actually forecast how that balance is going to decline over '23 into '24, it gives us a lot of confidence on the metrics. And of course, as you would expect, we're in conversations with the rating agencies every step of the way. This regulated portfolio that we have with the cash flows and constructive jurisdictions is really what underpins the credit ratings of the company, and nothing has changed around that risk profile. Just following -- so just with respect to the carbon plan here and obviously, the developments late in the year, you guys had -- you addressed it in part in the comments, but I'm just sort of curious, as you think about addressing some of the follow-up items here through the course of this year. So when you think about 3,100 megawatts of solar, 1,600 megawatts of battery storage, that capital plan is pretty well locked in for the Carolinas. We may see some marginal changes, but I would think about those as later in the 5-year period and really in connection with the next update. I think where we have potential and even potential upside is in Indiana, where we are earlier in the clean energy transition, moving through that process. We have estimates in the capital plan, but we'll be filing for CPCN later this year, and have more advanced dialogue about timing and approach. So I'm very comfortable with the capital plan and if anything, see a bit of upside in Indiana as we continue our clean energy transition. You said a moment ago, you assume a certain baseline in Indiana already in the latest plan. But as I heard you say a second ago, you're saying that there's more likely than not upside bias within that, but you have assumed something in the Indiana \n Yes. We put an estimate in there, Julien, but we're filing an updated IRP later this month into March, then we're filing for CPCNs. So that will crystallize more specifically toward the end of this year into 2024, much in the way that the Carolinas has matured as we go through IRP filings. I know, obviously, carbon plan principally think about North Carolina here. Well, it's a good question, Julien. We actually had testimony in the carbon plan that laid out a structure that would allow states to opt in or opt out depending on their energy policy, and that is beginning to take some discussion in South Carolina, but that will progress over time. We believe we operate in an incredibly valuable system, and we'll work with both states on how to add resources to meet their needs, customer and policy needs going forward. So Steve, we actually made the decision -- final decision to sale in early November and announced it on the third quarter call. So that decision went through a governance process, Board approval, et cetera, in the fourth quarter. That's exactly within our planning range, absolutely. Steve, I think it's too early to tell exactly. And you may -- if you think back on our history, we have, from time to time, entered into partial settlements where you feel like there are elements of this case that can be agreed and then there are others that the parties believe ought to be put in front of the commission. And as we get closer to dates when testimony gets -- is ready to be heard and testimonies been filed by all the parties, we'll begin those discussions. The $300 million of O&M reductions, I know that's, I think, a number that you've had before, the 75% sustained. That's a good question, David. When we looked at the opportunities across the board last year to really position 2023 in a good spot, we identified areas in our corporate costs and business support that we felt like we could really align service levels with work prioritization. Well, not all are mission-critical don't need to be -- have the same level of support as others. And we did that across IT, HR, legal, finance, we looked at across the corporate areas and found really structural opportunities that will remain for the long term. In Uptown Charlotte, we're moving from 4 buildings into 1 new tower. But then also on the rate base outlook, it looked like the 2027 rate base forecast had ticked up a decent amount versus the prior expectations. David, as we come to capital planning every year, we take into account where we are with regulatory approval, where we are with integrated resource plans, et cetera. If you look at the carbon plant in particular, there's transmission that's been approved in order to open up more potential for renewables. And as we get out into '26, '27, those numbers also reflect what we expect to mature in subsequent IRP updates and subsequent regulatory approvals. No, I think as we move deeper into the clean energy transition, we expect the capital plan to increase year after year as well. As we get deeper into the plan, more generation investment begins to show up earlier in the plan, more transmission and distribution. So you're beginning to see that and you'll see more of it in '28, '29, '30. So I guess conceptually, Brian, when you updated this plan in the third quarter, we were kind of at the height of inflation, interest costs, gas costs, et cetera. Nick, it is a good question around long-term growth rate. Fuel costs have been on the downward trend, and we -- that's really good for our customers. So right now, we're sticking to the 5% to 7% growth range and not signaling inside it anymore. I think the commodity price is coming down, Nick is a real positive for customers because you think about we still have deferred fuel to collect, but our estimates for cost of fuel in 2023 is coming off and that's a good thing. And to your point on the deferred fuel, 80 bps hit to the FFO and the '23 time frame here, and I acknowledge you have a path to get back to the 14% long term. The fact that we've absorbed $4 billion of deferred fuel and $0.5 billion of hurricane in 2022 alone, I think, is a strong testament to where we are, our scale, our ability to manage resources, et cetera. We think they're important and at the right level for the degree of risk in the business, but this is an opportunity that presents itself with the size and scale of our company where we can manage our way through blips of this type. More than a blip actually, $4 billion. I just want to round out the Commercial Renewables conversation a little bit, if I could. If there's any additional color you could provide on the sale such as where book value stands right now, portfolio tax equity position, asset level debt. I appreciate that it's a sensitive time given that you're selling the assets, but wondering if you could share any more details, particularly as it relates to book value. And Jeremy, let me comment on -- we feel good about the process, strong interest in the portfolio. And I don't know, Brian, if you want to add anything to... Jeremy, we referenced a $3 billion book value excluding the tax attributes mid-year and we had some projects we continue to invest in for the balance of the year and then took the $1.3 million write-down at the end of the year. And then I just wanted to kind of pivot a little bit, you involved with a number of emerging technology partnerships, including Honeywell battery,  and TerraPower hydrogen pilot. Jeremy, it's a really good question. I think about our path or climate report through 2050 has us a need of somewhere between 10,000 and 15,000 megawatts of what we call 0 emitting load following resources kind of in that late . So the key being, again, though, we're not going to invest until they're affordable for our customers, and we can invest at the commercial scale necessary to make a difference. The small module reactor is something we're spending time on, and you would expect us to. Because with all that carbon-free generation and all the solar we're going to have in this area, we think that's something worth investing in, really, as part of maintaining and preserving the natural gas infrastructure that has been so important to this region. So I know it's a roundabout answer to the question, but we're not ready to put our finger on any specific technology as the solution, but we are advancing our work, piloting, advising, working as actively as we can to make sure these technologies are developing at pace so that when we do need them and are ready to invest, there will be something that makes sense for our customers. If I may, I just had a quick clarification on the tax leakage portion of the commercial renewables sale, Brian, does -- so the message on the Q3 call was tax leakage is manageable given your other tax losses. There's no change to the tax position or a tax basis as a result of this impairment charge, so no change in message. Well, thank you all for joining and for your investment in Duke Energy. And as always, we're available, Investor Relations and the senior management team for any further questions."
}