{
    "symbol": "CCCS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-08 06:18:05",
    "content": " And thank you for joining us today to CCC’s first quarter 2022 financial results, which we announced in a press release issued after the close of the market today. Joining me on the call today are Githesh Ramamurthy, CCC's Chairman and CEO; and Brian Herb, CCC's CFO. Further, these comments and the Q&A that follows are copyrighted today by CCC Intelligent Solutions Holdings Incorporated. Any recording or retransmission, reproduction or other use of the same for profit or otherwise without prior consent of CCC is prohibited and a violation of United States copyright and other laws. Revenue was $186.8 million, up 18% year-over-year and ahead of our guidance range. Adjusted EBITDA was $73.7 million, which grew 33% year-over-year. This represents a 39% margin, up more than 400 basis points from the first quarter of 2021. Given several challenging macro factors including rising inflation across the ecosystem, labor shortages made worse by increasing levels of retirement and difficulties hiring technical staff who understand vehicle complexity in the tight labor market. These process gaps can drive less than optimal engagement with policyholders and create unnecessary friction among insurers, repair facilities and other industry participants. Second is the benefits of a connected ecosystem, a key to eliminating the friction I just mentioned is to have a truly interconnected and multi-sided network that digitizes key aspects to the claims process. CCC is in a unique position to help our customers benefit from these trends as they progress through their digital journeys, our operational and financial performance in the first quarter reflects our success. STP is a comprehensive approach to the P&C insurance economy that will be made up of many digital and AI solutions that are seamlessly integrated to provide customers, digital solutions throughout the claims process. I'd like to spend a few minutes walking through at a high level, what a claim journey looks like and how we can add value through each step of the claims workflow. Today, our platform is used to determine the repairability of tens of billions of dollars of auto claims annually. For the approximately 80% of claims that are repairable, we have a comprehensive portfolio of solutions that help automate and digitize the repair experience. In recent years, the car park has become increasingly sophisticated with an ever-growing amount of technology embedded in a car like automated cruise control, lane departure warning systems and multiple cameras. Both insurers and repair facilities need solutions that can provide a consistent repair process, regardless of the auto maker. One way CCC is helping to do this is through CCC diagnostics, which simplifies the process of importing the diagnostic report and provider invoice directly into CCC ONE as part of the repair workflow. Diagnostic scans, which tell you what is damaged or needs to be reset or recalibrated in a car are seeing explosive growth, scans are up more than 900% since 2017 and are now present on nearly half of all collision repair appraisals. Streamlining this process for repair facilities, including validating the scan with insurer as part of the claim is critically important. On that point, we recently expanded the CCC Diagnostics network with the addition of our partnership with asTech, a global leader in diagnostics, calibration and programming solutions. With the addition of asTech to the CCC network, we now have more than 10% of our repair facility customers utilizing our diagnostic solution. We have developed a comprehensive suite for total loss resolution, which is seeing good momentum in the market. Historically, our total loss products have been focused on helping insurers determine the value of the vehicle but there are also many additional downstream manual processes that need to be completed to finalize a total loss claim, including the processing of title, lien, taxes and fees among others. Our total loss care solution is one way insurers can streamline these downstream aspects of the total loss process, including lender payoff requests, letters of guarantee and lien and title resolution. In the 18 months since launch, we now have 21 carriers who are either onboarded or in the pilot process for total loss care. Another example is our fee calculator, which gives insurers the ability to configure upfront the applicable title, registration and license fees in a given jurisdiction and automate their inclusion in the valuation workflow. By digitizing the broader total loss process through total loss care, fee calculator and other solutions we believe that more than $1 billion of insurer loss adjustment expense or LAE, which is the cost insurers incur to investigate and settle claims can be impacted annually. Taken together, we believe this represents a sizable incremental revenue opportunity for CCC, the roughly 80/20 split of repair and total loss claims I just covered are what we refer to as automobile physical damage or APD. In addition to APD, unfortunately, auto accidents offer result in medical claims with roughly one in every five incidents having injuries. This is referred to as casualty, and it is a complicated part of the process that represents a significant portion of the total outlays from an insurer in a given year. To put it in perspective, medical claims payouts are roughly comparable in size to the annual payments made for automobile physical damage claims. Casualty represents a significant opportunity for CCC, where we have substantially less market penetration than in auto physical damage. This quarter, we added two new national carriers to our casualty platform. Finally, there are a number of horizontal solutions that work across the entire insurance ecosystem that provides significant value. We're making good progress on the enablement of multiple use cases, including from carrier to various payees, whether it’s the repair facility, lender, medical facility, or a consumer. To remind everyone, payments is not material to our revenue in 2022, but is an exciting future growth opportunity. Subrogation, the process which protects consumers and insurers from paying for losses where the insured is deemed not at fault or only partially at fault is also a sizable opportunity across the claim spectrum. We have been very encouraged by early customer feedback on this acquisition, which has been consistently positive and has led to a number of new opportunities. As a reminder, Safekeep’s technology helps to automate subrogation a multi-billion dollar area of focus for insurers that has historically leveraged little to no technology to automate the process. We're thrilled to once again be hosting this event in person, meeting with customers and partners, discussing key trends shaping the industry and having deep discussions about how CCC can continue to help solve challenges in their businesses. In summary, we see many great opportunities to deliver innovation across our client base, regardless of their size or the breadth of solutions they use from us today. Before I turn the call over to Brian, I want to close by reiterating how pleased we are with the start CCC has gotten off to in 2022. I believe the investments we're making in talent, innovation and service delivery will help us solve critical problems for our customers as well as deliver consistent growth for years to come. As Githesh outlined, we feel like we are in a strong position to deliver on the industry's vision for Straight-Through Processing and to deliver exceptional value to our client base. In turn, this will drive durable long-term growth in opportunities to scale with both the more mature products like casualty and the more recent launches like diagnostics, total loss care, payments, and the other solutions that Githesh talked about today. In that if we sold these solutions to our eligible customers, we'd be roughly three times the size we are today. Now, let me turn to our first quarter 2022 results and provide guidance for the second quarter and the full year of 2022. Total revenue for the first quarter was $186.8 million, up 18% from the prior year period. Our growth is being driven primarily by cross-sell and upsell into our installed client base, including the large expansion deals that we've talked about over the last couple of quarters, which contributed approximately five points of growth. Also the broad base adoption of our new digital solutions, such as mobile AI and Engage, as well as growth from new logos, which is primarily driven from repair facilities and part suppliers. Turning to our key metrics, software gross dollar retention, or GDR captures the amount of revenue retained from our client base compared to the prior year period. In Q1 2022, it was 99% up one point from historical levels. Software net dollar retention or NDR captures the amount of cross-sell and upsell from our existing customers compared to the prior year period, as well as volume movements within our auto property damage client base. The consistently strong NDR performance in recent quarters reflects the success we've had with our cross-sell opportunities across our customer base, including the large expansion deals signed in the second half of 2021. This is slightly below the 79% adjusted gross profit margin reported last quarter, which benefited a point from the $4 million of non-recurring revenue we spoke about. As we turn to our operating expenses, adjusted operating expenses were $78.2 million, which grew 12% year-over-year. Growth in these expenses were largely driven by headcount additions, public company costs, and the increases in discretionary spend as these expenses continue to normalize. On the headcount addition point, we are pleased with the progress made to advance our operational capabilities by adding key positions across product management, product development, partnerships, and M&A. Adjusted EBITDA for the quarter with $73.7 million, with a 39% adjusted EBITDA margin. Adjusted EBITDA grew 33% year-over-year and margins improved more than 400 basis points, compared to prior year. Margin progression is being driven from scaling revenue, flowing through to EBITDA at high rates as we have an efficient and scalable business model. Now turning to the balance sheet and cash flow, we ended the quarter with $195 million in cash and cash equivalents and $798 million of debt. At the end of the quarter, our net leverage was approximately 2.2 times adjusted EBITDA. Free cash flow in the quarter was $32.6 million, compared to $33.5 million in the prior year period. Looking at cash flow on an unlevered basis, year-to-date, we converted approximately 51% of adjusted EBITDA into unlevered free cash flow. Subsequent to the end of the quarter, we successfully completed a secondary stock offering of 20 million shares by our selling shareholders. This represents 14% year-over-year growth at the midpoint, we expect adjusted EBITDA between $69 million to $71 million, which represents a 36% adjusted EBITDA margin at the midpoint. For the full year 2022, we expect revenue of $763 million to $771 million, which is 11% year-over-year growth at the midpoint. We expect adjusted EBITDA between $288 million to $294 million, which represents a 38% of adjusted EBITDA margin at the midpoint. And we feel really good about the strategic position and long-term opportunities with straight-through processing, payments and our Safekeep acquisition. Also keep in mind in the second half of this year, we will be lapping the large expansion deals signed in the second half of 2021, as well as the $4 million of non-recurring revenue recorded in the fourth quarter of last year. In terms of profitability, the second quarter includes the impact of cost phasing and our annual industry conference. To wrap up, CCC got up to a strong start in 2022 and is well positioned to deliver on our financial and operational targets for the year. We are confident that as we continue to execute on our strategic priorities, we will generate significant value for both our customers and our shareholders. Maybe I guess, first for you, Githesh, as you think about some of the inflation dynamics that are impacting some of your repair facility customers, insurance carriers, having to navigate and manage that profitability headwind. You've talked a lot about kind of those key platform adjacencies, but how much has that need for better input cost visibility, right, the repair dynamics driven, the accelerated demand you're seeing around the platform expansion and then some of those earlier stage tools like diagnostics and total loss that you've talked about as well. Couple of things, right, the need for precision to really manage repairs, to manage claims, there's an incredible need to manage precision and to really understand how the supply chain is developing. So we've had tons of requests from customers across our customer base to really understand the analytics, the data, and we publish a crash course. So all of these things have really made these mission critical solutions that you can deploy and get very quick ROI, particularly important. So I would not say that, it has accelerated anything in particular, but the long-term secular demand for the products and solutions we have continues to be emphasized pretty heavily by what we're seeing. And obviously adding that, that visibility is the key value driver at the end of the day, I guess if you think about the evolution as well of your overall ecosystem. There's also a lot of white space going after the lender dynamic, maybe more on the medical claim side that you talked about as well. So when you look at our overall macro view, our overall macro view is our vision of STP or straight-through processing. So when you look at repair, you've got repair facilities, you've got parts providers, you've got insurers. When you look at casualty, you've got medical providers, you've got insurers, you've got other parties. When you look at total losses, you've got banks, lienholders. That's where the power of the network and frankly, years of having delivered solutions to our customers really comes in. And I think as I pointed out, we've added a couple of customers during the quarter as well. And again, stitching all of this together into a seamless experience with straight-through processing, artificial intelligence, all of these capabilities become super important. And just maybe a little bit more on CCC, you talked about the first carrier. So if you look at our customer base, right, we've got insurers, we've got parks providers, we've got repair facilities. So last year, we said our first goal was to build and get the payments infrastructure in place. Second, we said we are going to work with early customers to refine use cases and we've been doing that. And then third, we said, look, we're going to get a first customer on board and which is what we just did. I'm curious, last quarter, we were discussing the Safekeep a little bit and kind of excitement about all the subrogation capabilities and how that can kind of open up more of the P&C insurance economy outside of auto. Exactly as you pointed out, subrogation is one of those solutions that extends well beyond auto, subrogation exists in property, exists in workers. So this is what we refer to as when we say horizontal solutions, those are two solutions in particular that extend us beyond auto. As we go through the year, we are very focused on balancing investments against our strategic priorities. We have what's been exciting is we announced Estimate STP, I think it was around October of last year. And literally, in the six, seven months since then, we've got eight significant customers up and running on Estimate STP. And that's also giving us a lot of credibility for STP overall, in fact, been in two conversations with our team, one yesterday and one today with customers exactly around this topic. And it's also showing the power of how we can – how STP in general, as it extends across the different components of the claim that we talked about as a huge impact. And just for my follow up, you've talked about growth shifting more toward cross-sell and upsell versus new logos. So if you go back and just to give a few data points, so we historically had about two-thirds of the growth was driven from cross-sell/upsell and about a third from new logos. That said today, we don't spend a lot of money on customer acquisitions, we have a very efficient sales organization and have coverage across our customer groups. So although, we see efficiency with the cross-sell, it's not as if today we're spending significant dollars on customer acquisition. First of all, on the payment business that you signed, you said you signed one customer. We a number of customers that we're working with in the early stages, and this is a customer that we converted over who's we're working on the implementation. So in your mind, as you implement this, I mean, how quickly once you implement this and it's out in the market, do you see kind of a cascading effect where something that it becomes, maybe I might have it too, it's necessary for me to have it. We've been in this business and I think you would know this, having known us for a long time and I look back over the last 20 plus years of driving just growth that is through new solutions. When you deliver a great experience in your first product that is really, really – and customer and it really delivers an ROI for a customer that really has a huge impact on how quickly things get adopted. So I’m not going to make any prediction Gary on time and speed, but what we are focused inordinately is delivering a great experience. Yes, so we ended last year at 115, but if you look across the year – last year, it averaged around 113, if you average the four quarters of last year. And then in terms of things like Engage in electronic parts ordering, I think you said about 30% of your rooftops have got engaged and 40% increased last in Q4 last year of electronic parts ordering. Yes, I mean, we made progress on both front, so we continue to sign parts suppliers up and we're seeing growth both from new rooftops of parts suppliers, as well as electronic ordering, just increasing as a percent of overall, what parts are making it on a repair order and we're seeing good progress on Engage and the number of rooftops that we have on Engage. I mean, one of the key drivers, when we look at our NDR and see the strength is Engage in the other digital solutions so mobile AI, Engage, some of their early adoption on the total loss care portfolio. No, the one other thing I point out is when you look at Engage, many of our customers have integrated it into their websites and the likes. So now, as customers are trying to book appointments and try to get estimates, it is super helpful to that process. So we expect that Engage will continue to grow over the next couple of years, for sure. And again, as we've said before, we believe the industry is in the early stages of digitization, we have terrific credibility with our customers, having delivered a lot of solutions. We're investing in innovation, that's being really well received."
}