{
    "symbol": "VSAT",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-07 23:07:06",
    "content": " The kind of our approach to ViaSat-4, we've been -- what we've been working on is really focused on the technology, making sure that we get the performance that we expect and that we can produce it at a more predictable schedule, but it's pretty much the same platform. Well, first, so we're interested in the direct-to-device market, with likely -- I think a lot of people expect to be to address a very large market, but with probably relatively low average revenue per user. The big -- I think the big issues or uncertainties around direct to satellite there handset market are really around what are the speeds certainly that can be delivered to each phone, how many phones can you serve in a geographic area what will the airtime pricing be would be used for more than emergency services. And a lot of that, I think, is really going to depend on a lot of the same factors that drive the bracket market, which is as we talked about before really getting signal good density of bandwidth adjusted for the spectrum that it's operating in the areas where there's going to be the highest demand. We're not sure that's the right -- that's going to be in a good direction, and we do have ambitions to do is to be able to deliver services that are much more interesting than just emergency services and that can be scaled to very large numbers of customers. We think -- we see -- we do see that there's going to be more competition in the markets that are targeted for bias people estimate kind of 10 million to 15-ish million homes that are reasonable candidates for satellite broadband, but the big issue is the value proposition of the service in terms of speed, volume, price. And I think that includes the in-flight connectivity space because we already have when we've done this pretty purposely -- purposefully, but we have customers in Australia, Asia-Pacific, Latin America, Europe, that and Middle East already that we support with our full-service model. So, I think that, that's one of the -- so one of the things that's most exciting about getting ViaSat-3 on a global basis is that it really is then we can just plug into existing models, especially in in-flight connectivity because that is really kind of a direct to airline business for us. When we get ViaSat-3, problems could be way easier as we'll have a lot of bandwidth everywhere, and we'll just be able to add customers on both in-flight connectivity and in airlines and a few other businesses within the US that we think we can start and grow as well. Well, we've had -- typically, when we go out with, as Shawn said, with the new generation of satellite, I think $800-ish numbers for -- be it depends on the -- it's a blend of advertising, commissions, equipment installation, it's all those factors. It's a complicated question because different -- I mean, you've probably seen sort of what they call busy hour demand curves from cable companies or others that are in the home residential business. So, if you look at in-flight what you'll see is when you look at it, let's say, when you look at it geographically, for Delta, this was an example similar for American and United other major carriers is when they have a hub, if you looked at the sort of the same type of chart, as I described it residential, what you'll see is very high usage when a lot of airplanes and people are in those geographic areas around those hub airports. And kind of the way -- I think the way to think about it is, especially from a capital efficiency perspective, this is one of the things we try to put together and show investors is -- if you think of demand, the demand on the ground or in the air, it's really a property of who your customers are and your space systems and the failure modes or the congestion that occurs tends to be in hot spots. And then with the sale of our TDL products business, we've got a lot of financial mover room, the over $1.5 billion gain on that sale will actually make our fiscal 2023, our most profitable year ever, and we think it's indicative of the value we're building in each of our businesses."
}