{
    "symbol": "FLYW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-14 07:49:05",
    "content": " Platform and usage-based fee revenue increased 14% compared to Q2, 2021, driven by a 24% increase in platform and usage-based payment volume, with the platform revenue growth still being partially offset by the loss of a client in the healthcare vertical last year, which was discussed during our prior calls and is not yet fully lapped. That resulted in an adjusted gross margin of 64.5%, which was lower compared to Q2, 2021 due to shifts in revenue and payment method mix, similar to those discussed on our Q1, 2022 earnings call. Specifically, our transaction revenue continued to outpace our platform and usage-based fee revenue, and we saw a payment method shift towards credit cards due to the growth within our travel vertical and domestic transactions within our education vertical. However, due to the outperformance of our credit card heavy travel vertical, and domestic transactions within our education vertical, we expect adjusted gross margins for full year 2022 in the middle to lower end of the full range of 65% to 70% shared at Analyst Day. Adjusted EBITDA for the quarter was negative $6.1 million, which was better than our expectations for Q2, 2022, due to stronger than expected revenue and adjusted gross profit as well as personnel cost savings as we based our hiring. With respect to adjusted EBITDA, we are raising our full year 2022 guidance to be in the range of $13 million to $17 million, reflecting our current view of our continued growth and execution in the business alongside continuation of our previously announced growth and investment plans. Revenue less ancillary services is expected to be in the range of $87 million to $90 million, which represents a year-over-year revenue growth rate of 42% at the midpoint as we enter our historically highest revenue and adjusted EBITDA quarter. We do expect adjusted gross margins to come in higher in the second half of the year due to the cross-border education business, and as a result of the payment methods typically selected for those larger payments, we do get to enjoy higher adjusted gross margins towards the higher end of that range for that quarter, and we would expect that Q4 would be similar to Q1 and Q2 in numbers, rounding out to around that mid to low end of the range as communicated. And what weâ\u0080\u0099ve shared at Analyst Day, you know our initial guidance for 2022 was right around the 5% range for adjusted EBITDA, and we indicated that we think and feel confident based on our revenue profile and growth profile that we could add you know roughly 3% to 4% per year up until getting to a higher adjusted EBITDA percentage. But as Mike said, as payment method mix, shift as well as youâ\u0080\u0099ve seen in the prior two quarters, revenue from transactions really outpacing our platform and usage based fee revenue, which is also a driver of this adjusted gross margin number that might be from the mid to the low end of the range for the full year."
}