{
    "symbol": "FLYW",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 10:28:16",
    "content": " All in, the run rate spend added in 2023 is expected to be at least 60% less than last year's expansion, and that is into a much larger underlying business given the over 55% currency-neutral growth in 2022 that Mike referenced in his opening comments. For full year 2022, we reported revenue less ancillary services of $267.1 million, representing an increase of $86.0 million in absolute terms and a 47% growth rate. Specifically, on a constant dollar basis, our growth rate would have been 55%, representing a full year 2022 FX headwinds of approximately $14.2 million. In addition, despite our record investment year, we generated adjusted EBITDA of $14.9 million, essentially right at the midpoint of our revised full-year guidance but well above the full-year guidance we provided at the start of 2022. Specifically, on a constant currency basis, our revenue growth rate for Q4 2022 would have been 57%, representing an FX headwind of approximately $4.6 million during the quarter. During Q4 2022, based on the revised methodology, we generated $44.5 million in adjusted gross profit, representing a 40% increase compared to the $31.8 million reported for Q4 2021. Under the previous methodology, adjusted gross profit was $41.5 million for Q4 2022, representing an increase of $10.8 million or 35% from $30.7 million reported for Q4 2021. Adjusted gross margins were 61.6% and 56.9% for Q4 2022 and 2021, respectively, representing a decrease of approximately 530 basis points year-over-year. Our adjusted EBITDA margin increased over 500 basis points in Q4 2022 compared to Q4 2021 due to strong adjusted gross profit growth, offset by increased operating expenses as discussed previously. We expect revenue less ancillary services to be in the range of $353 million to $354 million for full year 2023, representing a 34% revenue growth rate at the midpoint. With respect to adjusted EBITDA margin, we expect to deliver a 300 basis point increase during full year 2023 compared to the reported adjusted EBITDA margin for 2022 in spite of expected continued FX headwinds. For Q1 2023, revenue less ancillary services is expected to be in the range of $81 million to $85 million, which represents a year-over-year revenue growth rate of 40% at the midpoint."
}