{
    "symbol": "BOH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-24 16:45:01",
    "content": " While betas will naturally rise further as overall market rates peak, we believe the strong core nature of our deposit base, being 50% consumer and 42% commercial, the granularity of our deposits, with nearly half of our combined consumer and commercial deposit balances sitting in accounts sized under a $0.5 million. Core loans net of PPP pay downs increased by $379 million, or 2.9% linked quarter, and by 1.5 billion or 12.7% year-over-year. Deposits decreased by $137 million or 0.7% linked quarter, an increase by approximately $400 million or 1.9% from a year earlier. Net interest income in the third quarter was $141.7 million which included $200,000 from PPP loans. Adjusting for the PPP interest income, core net interest income was $141.4 million up 10.1 million or 7.8% linked quarter, and up $22.5 million or 19% from the third quarter of 2021, driven by continued strong loan growth and rising interest rates. Included in the third quarter expenses were severance expenses of $1.8 million as we continue to adjust our workforce for the evolving economic environment, and will lead to annualized savings of $2 million. Adjusting for the one-time severance the third quarter's expenses were $103.9 million, an increase of $1 million linked quarter, primarily due to our continued commitment to invest in our business. For the full year of 2022, expenses normalized for the $1.8 million severance expense in the third quarter will be approximately $415 million, which is unchanged from previous guidance, or approximately $417 million on a reported basis when including the severance. As discussed earlier core net interest income, which excludes PPP interest income was $141.4 million up $10.1 million linked quarter, driven by strong core loan growth and rising interest rates. The third quarter's income was impacted by a one-time $6.9 million charge related to the loss on sale of leased equipment and a $900,000 charge related to a change in the VISA Class B conversion ratio. During the third quarter, we paid out $28 million or 55% of net income available to common shareholders in dividends and $2 million in preferred stock dividends. Net loan and lease charge-offs were $1.1 million or three basis points of average loans and leases annualized, compared with two basis points in the second quarter, and four basis points in that third quarter of last year. Non-performing assets totaled $15.5 million or 10 basis points at the end of the quarter, down two basis points for the linked period and down seven basis points year-over-year. And criticized loan exposure represented just 1.12% of total loans down 18 basis points from the prior quarter and 119 basis points year-over-year, driven by continued sustained improvements in the financial performance of those customers who had been most impacted by COVID. At the end of the quarter, the allowance for credit losses was $146.4 million, down $2.1 million for the linked quarter, and the ratio of the allowance to total loans and leases outstanding was 1.1%, down five basis points from the prior quarter. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}