{
    "symbol": "BOH",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-23 15:52:04",
    "content": " Despite a modest decrease on a linked quarter basis, total deposits increased by $256 million or 1.3% in 2022, while our total deposit betas were well controlled at 11.5% cycle-to-date, which demonstrates our ability to maintain liquidity at a reasonable cost. Net interest income in the fourth quarter was $140.7 million, up $14.3 million or 11.4% from the fourth quarter of 2021. Compared to the pre-pandemic fourth quarter of 2019, our NII has improved by $16.9 million or 13.6%. To summarize our financial performance, in the fourth quarter of 2022, net income was $61.3 million, an increase of $8.5 million linked quarter or 16%. As a reminder, the third quarter's income was negatively impacted by one-time $6.9 million charge related to the loss on sale of leased equipment and a $900,000 charge related to a change in the Visa Class B conversion ratio, which is reported as a contra revenue item in investments securities gains and losses. We expect noninterest income will average approximately $39 million per quarter in 2023, as market volatility and uncertainty continue to weigh on asset management income and higher mortgage rates will continue to suppress mortgage banking income. During the fourth quarter, we paid out $28 million or 46% of net income available to common shareholders in dividends and $2 million in preferred stock dividends. Net loan charge-offs were $1.9 million or 5 basis points of average loan and leases annualized, compared with 3 basis points in the third quarter and 2 basis points in the fourth quarter of last year. Non-performing assets totaled $12.6 million or 9 basis points at the end of the quarter, down 1 basis point for the linked period and down 6 basis points year-over-year. Loans delinquent 30 days or more totaled $31 million or 23 basis points, up from 18 basis points in the third quarter and flat with the fourth quarter of '21. And our criticized loan exposure represented just 1.09% of total loans, down 3 basis points from the prior quarter and 111 basis points year-over-year, as we continue to see sustained improvement in the financial performance of those customers who had been most impacted by COVID. At the end of the quarter, the allowance for credit losses was $144.4 million, down $2 million for the linked quarter, and the ratio of the allowance to total loans and leases outstanding was 1.06%, down 4 basis points from the prior quarter."
}