{
    "symbol": "BOH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-25 18:44:05",
    "content": " Adjusting for these, our core net interest income was $131.3 million, up $7.9 million or 6.4% from the first quarter. Compared to the year earlier second quarter, core NII increased by $15.3 million or 13.2%. As discussed earlier, core net interest income, which excludes PPP loan interest income and the quarter's interest recoveries was $131.3 million up $7.9 million linked quarter driven by strong core loan growth and rising interest rates. Adjusting for these items, the second quarter's expenses increased by $2.7 million linked quarter, primarily due to annual merit increases and one-time cost of living adjustments, which began on April 1, as well as one extra workday during the quarter. During the quarter, we paid out $28 million or 51% of net income available to common shareholders and dividends and $2 million in preferred stock dividends. Net loan and lease charge-offs were $600,000 or 2 basis points of average loans and leases annualized compared with 5 basis points in the first quarter and 4 basis points in the second quarter of last year. And criticized loan exposure represented just 1.3% of total loans down 30 basis points from the prior quarter, driven by continued sustained improvement in the financial performance of those customers who had been most impacted by COVID. This included a negative provision for the allowance for credit losses of $2.9 million, which with net charge-offs reduce the allowance by $3.5 million to $148.5 million or 1.15% of total loans and leases. Your line is open. And in this quarter, basically, large corporate was flat in loan production, but our small business unit, middle market unit generated about 7% loan growth, which kind of got us that 3% number. So really the strategic growth is as a result of now really having really two businesses, a large corporate business that is going to grow and has grown nicely, but to kind of have it off quarter this quarter, but our middle market business really taking shape and having a great quarter this quarter and hopefully they'll both have good quarters next quarter, but I think the point is if one falter is a little bit, the other one generally tends to pick up and that's what we're starting to see in the consistency of our commercial numbers over the past several, several quarters. Your line is open. Your line is open. The weighted average LTV on the portfolio is 57%, average loan is $1.8 million. The weighted average LTV on the portfolio is 57%, average loan is $1.8 million. Your line is open. Your line is open."
}