{
    "symbol": "PCH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 15:30:40",
    "content": " As discussed on last quarter's earnings call, we were the successful bidder on three bolt-on timberland transactions earlier this year, aggregating $101 million in total. As discussed on last quarter's earnings call, we expected Southern Yellow Pine sawlog prices to decline modestly in our legacy operations in the third quarter due to increased log availability. Residential lot sales remained strong with 48 lots sold in the third quarter and we closed the sale of two more commercial real estate lots, for an average price of $183,000 per acre in the third quarter. We used about half of our forward starting interest rate swaps, to refinance $277.5 million of CatchMark's debt, at a fixed rate of 1.8% net of patronage and we used cash to pay off the remaining $22.5 million of CatchMark's debt. We also applied CatchMark's interest rate swaps to reduce the interest rate on $150 million PotlatchDeltic term loan, by over 200 basis points. While the actual amount is dependent upon our financial performance for the rest of the year, we believe that this year's special dividend will be much lower than the $4 per share we paid in 2021. And I think we've had a position -- at least the last couple of quarters, it feels like where we said, this year's special dividend is going to be significantly lower. When you go back to that $4 per share special dividend that we paid in December of 2021, I mentioned this on last quarter's call, but there is a 40% discretionary component to that. Payout, for example, just with the shares we issued in the CatchMark merger, is up $20 million year-over-year and that effectively shifts -- potentially would have been special dividend dollars over into the regular dividend bucket. So in terms of sustainable harvest, I mean one -- I mean obviously, we've got a lot of moving parts this year with the $101 million of bolt-on timberland transactions."
}