{
    "symbol": "BRFS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 15:24:02",
    "content": " Before we continue, I would like to reinforce that these information they have as the basics. The expectations, beliefs and assumptions of BRF and the information available to the company. Such statements do not correspond to historical facts, and they are based on currently available competitive financial and economic data, according to the circumstances that can occur, they can change. I would like to give the floor to Mr. Miguel Gularte, who will start the presentation. We have iconic brands in its categories, excellent portfolio of products and an appropriate infrastructure. I would like to give the floor to Fabio Mariano, who will present the results 2022, 3rd quarter, and I'll come back later. Starting with net revenues, we can see an evolution of 13% compared to the same period in the previous year. Right below I will present -- I present to your adjusted EBITDA, BRL 1.4 billion more or less billion, similar to the same quarter in 2021. The net income was a loss of BRL 137 million, half of what was reported in the same period in the previous year. Moving to the right, we have an operating cash flow above BRL 1.03 billion a little bit under previous year. So it is 40% above the previous quarter, even considering a very similar EBITDA. In the working capital, although we have some seasonal advancements in the festivity crops and the second crop. We have a reduction along the third trimester, the third quarter and we have also worked with our suppliers. still under the influence of a common performance in the first quarter, and this indicator was also impacted by the real depreciation. Finally, I would like to highlight that our indebtedness days, we're still comfortable our period about 8 years. And in the next slide to the left, we have the growth profit evolution, we had around 18% and the gross profit around BRL 2.600 million. And to the right, we can see the adjusted EBITDA evolution, a performance that has been already highlighted. In the following slides, I would like to present the performance by business segments in the market. Starting in Brazil, we have a sequential evolution of EBITDA every quarter about 2022, but still below or lower than what our brands usually perform our products and all the infrastructure that we have. I'd like to highlight in the Brazilian market, some important evolution in the number of active customers that will allow us better competitiveness in the following quarters. So to the customers, with an improvement in the market. We have a decrease in the low profitability SKUs, improvements in market share and brand visibility initiatives. We had a significant improvement in our service levels in the secondary logistics, we had, as I said, improvements in the market share and brand visibility, mainly in margarines, cold cuts and  products. And also, we have a fourth quarter with significant investments in media. The chart to the left, we can see the EBITDA and margins back to historical levels as a result of more normalized offer in the region. The macro and microeconomic scenario, we increase in exports and value-added products in order to maximize our results and protect also the operation from the Turkish lira influence. We have also the added value products, expanding its sales. And also, we have an increase of exports to the region. First, the joint venture with PIF, an important movement with an ideal partner that will allow us through this alliance to develop the Arabic market and keep on consolidating our presence and leadership in the country. Second, we have to do with the expansion of sales in added value products in the region also during the World Cup. In the Chart 2, the left, we see the stability of the margins at a very high level. we have included a mix of products in the region, and we have expanded our performance in chicken export to Africa and other regions. To the right, we see the higher prices to the portfolio that serves the region, especially a very positive trend to pork. The avian influenza for United States and Europe, this can impact positively the prices in this segment. Here, we can see a better profitability performance. We can see -- to the right, we have seen prices positively responding between quarters in the market as Japan, Korea and China, both for chicken and pork, the last one with a relevant recovery throughout 2022. We had 21% of EBITDA margin, equivalent to BRL 143 million. We keep on capturing synergies and pet food, we have advanced also in the GTM plans, and we have expanded the portfolio to Gran Plus and BioFresh brands. In Ingredients, we have an expansion of market alternatives and first sales to Thailand. And we are putting our effort to maximize the integration of our business, and consequently, our profitability. In the quarter, we had some highlights in sustainability. We have -- can see in the next slide some conquers like the environmental seal by the Abu Dhabi Environment Agency, acknowledging our environmental practices in the Kizad plant. Also, we have been using satellite technology, tracking more than 95% of direct grain, and we are reaching our goal of 100% of traceability for grain suppliers in the Amazon and Cerrado biomes. To the left, you can see the evolution of the net debt and net leverage. First, this indexation of the gross debt, the strong currency, we have reached in dollars here, these figures. And this allowed us to change our indebtedness profile, eliminating the need to use intensively derivatives. We have amortization -- short-term amortizations combined with a high liquidity position equivalent to more than BRL 12 billion, when we consider the cash flow condition and the revolving credit lines that have already been negotiated or promised. In the next slide, we show the free cash flow. This chart will highlight BRL 1.3 billion, and this investment flow of BRL 1.6 Billion without finance activities. The cash flow has been recovering sequentially every quarter, as we show in this chart, the smaller charts here in this slide. In the final slide, we can see the evolution of the net debt besides the consumption here that we had. And if we consider both results combined, BRL 0.5 billion in the indicator. I thank you for the audience, and I'll give the floor to our CEO, Miguel to the final remarks. I found a company with professionals, very competent professionals in all levels, very well-developed indicators that will certainly allow us to take from the company, the performance that the market expects that it can deliver. We have powerful brands, brands  95% of the Brazil households, very consistent. They will allow us to build in 2023, a very appropriate performance to our excellent potential. The time lapse, we can already see clearly the improvements at our reach. We have the sense of emergency and consistency in execution using methodologies and indicators that are available, and together, we will build the performance that is expected. We're going to prove the index in mortality, profitability, both in slaughtery and . And certainly, this will bring to BRF, the performance and reliability that is expected. We are building a solid benchmarks, and we should, as always, keep on investing in capacity building and training of our collaborators. So that in the perfect timing, we can have quickly a more agile and flexible company. We'll keep on diversifying our market, focusing on profitability, and we should not forget the improvement of our industrial park for the demands in the world. We are focusing the improvement of fleet, the improvement of the service level to customers. We will, in the brands, continue to invest in communication, looking for innovations and a better profitability profile. Environment is critical, and we're going to be very strict working in the short and long term and not jeopardizing the future. I would like to close the presentation with this conviction of more than 80 years of history, we have this latent performance culture that will be consolidated with the delivery of these results. Agility, pragmatism, focus and rationality, we are totally sure that it is possible that we are able to deliver and fulfill our commitment. I would like to thank you all and reinforce our commitment with more than 89,000 collaborators, our controller, our shareholders, our Board of Directors, customers and partners and everywhere, BRF is present. I have two questions here, specifically for you, Miguel, focusing on your final message, focus on operational performance and productivity. I'd like to focus on this topic in an  to understand what's the main opportunity that you have managed to map so far in terms of operational improvement and maybe the main challenge, anything that you could advance in this topic would be great. Here, I'd like to hear your vision, the exports of corn from Brazil to China. And I'd like to ask if this could be a challenge in terms of grain exports in the short, medium term, and the level of current stock, if this is enough to off balance this situation with the corn. We have started this effort at BRF, as said, 45 days ago more or less. So you don't run the risk of not getting where you want to get, which is way out there at the production. So we have united all the leadership, all the management, and then we worked in a very detailed way in all the aspects that plan goes through field base, people, industry. And to give you an example, we have a labor intense industry with over 98,000 employees. So in this kind of industry, you need to work on the main indicators. We need to work on conversion centers, both for pork and mortality or pork as well as poultry. If we go into the industry, you can't -- you have to look at the fixed cost, but we have to also work on productivity in terms of slaughtering or  and so on. So you need to -- when you have slaughtering activities, you have to follow the index. So when I talk about optimizing indices, it's very important to stress something that's important at BRF. If I were to compare this information at BRF, when you have a car, and you have a 3D panel. So with these precise indicators, the main challenge is to build an indicator that is reliable and applicable. And here at BRF, they're very precise, very accurate. So the information is accurate. So the information is accurate. So going into logistics, if we're working with the logistics area, to improve efficiency. I'm talking about the lead, I'm talking about rationalizing the network. If I work on planning, it's very important. So if you have a pricing system, you need to be assertive in your decisions, and you manage coordinating exports, domestic market segments as Halal. So you can add the important as, which is adapt, I can,  perform well, both domestically as well as for exports. So we have this program led by Marcello, Marketing VP, where we capitalize the advantage not only in Brazil, we have a very important event in the World Cup, but also in the Middle East and the other export markets that we have our brands, which perform really well. So finally, we need to capitalize on all the quality information, the diversity in geography, the competitive advantage and a high skilled team and transform this into results, that the company needs and the market is expecting it. The first 45 days has been a wealth of activities, we are very excited. We're working together, and I make it very clear that we have everything we need to make things happen. We're working with everybody in the company, and this is going to start to be visible in the expectation. It's a very clear form of measuring everything you can measure, you can improve. Well, to specifically answer your comment about the increase of imports of corn from China we believe that this is not going to have an influence on prices because in relative terms, this is not going to place pressure on exports from Brazil compared to the general crop export in Brazil is close to 1/3 and data suggests. So there is a great expectation in the Southern Hemisphere of an increase, both in terms of planted areas as well as in productivity, which is going to impact a 12% increase in Brazilian crop over 20% additional in Soya. Brazil should reach over 150 million tonnes in production, and that is record and we understand this. We need are talking about grains, not just when it comes to pricing, we need to talk about quantity, consumption. And , we are no longer wasting grain when we lose an animal when it talks about yield indicators, we see the example of waste and grain. When we talk about food conversion that's not adequate, we're also throwing grains away. And today, stocks are strategic within a range, we believe it's adequate and still allow us. In case we see new opportunities, we can materialize them. Our next question,  from Bank of America. When we look at the cost issue, especially in this quarter, for the Halal business. I'd like to understand the costs, the stock issues and how this is going to play out in the future. And so for cost situation, looking into Brazil, you mentioned a number of initiatives. I am going to answer the first two, and then I'll give the floor to Miguel to answer the last bit. In order of imprint, I'll give you three reasons to justify the increase you mentioned. And definitely has the Turkish lira influence, and we are looking at a hyperinflation economy today. So when we translate the in the balance, the consolidation currency, which is the Brazilian real, you have an impact of 40% on that increase you mentioned. So when you have a exchange fluctuation, we have an increase in cost for the difference between parity stock and the stock after the product is sold. And the 20% left has to do with marine or vessel marine sea freight on all players that are working on export platforms, you will have then the rest of the 20% of the increase is an explained by this, as you mentioned. Now speaking about our stock, it's very important to detail that in Q3, it's natural that we are going to have finished product stocks especially for festivities because we're getting ready for the Christmas season. So during this period, because of the summer, when we can sell in natura products as well as cold cuts. So then we have a strategic stock we are going to have the sports event that's going to happen in our summer, and we see opportunities there. So that's why we have prepared for these festivities, these events, these consumption opportunities. So when we take away the seasonal effect, we have had stock reductions in other lines. So for Q4, we are going to see a reduction and finished products because of season, which is natural, but because of the other items I have mentioned. Yes, we are very attentive to our investments and our capacity to deliver performance. Obviously, BRF has a historical CapEx that has supported our growth. So when you have a program, as we mentioned, that all segments, production, industrialization, logistics, then obviously, you are going to increase production and improve performance of the company to a certain extent by increasing efficiency and productivity, then you naturally reduce idleness in the company. So we have an organic growth capacity and with our qualification footprint, and CapEx in our factories is going to make us deliver our '23 program. It's important to stress in the last few days, we had a great piece of news. When it comes to important markets such as Mexico and China, that is going to lead to a much wider range of options we have celebrated a number of achievements, and we're also very attentive to what's going to happen in '23. So that naturally, 2023 is going to be marked by pragmatism and agility. Company has to be more agile in taking the right decisions -- it's very important to have the people, the facilities as well as information. I understand that all the elements for a good decision to be taken are present, and we need to make good is, obviously, we cannot forget the details. We have to look at the short and medium term, but that doesn't mean that we are actually putting the future on hold to work efficiently is critical to work in a simplified way, and I apologize for repeating myself, we believe and a plan that is going to permeate the whole company. Lucas Ferreira, JPMorgan has the next question. First of all, Miguel, I apologize for going back to your initial content and follow-ups on some of the questions that you already answered. I would like you to maybe have an exercise in your assessment, the operational improvement opportunities that you see at BRF. Or do you believe that there are -- let's say there are low-hanging routes that could actually be embraced in a short run in the next quarters or year, that is going to have an impact on the results of BRF. You spoke about some KPIs, food conversion use spoke about losses. So do you have the metrics to share with us numbers that are below the industry benchmark or below BRF history, so we have an idea where the company is in this sense. And the second question on -- about Brazil, the Brazil business. Well, thank you so much Lucas, for your question. Well, let's go straight a point. You imagine BRF geographic diversity with the possibility of adopting best practices, you have a huge number of factories in different areas of the country. So that's why I always say, let's speak not just at the top level, let's go down to the factory floor. So in all the aspects as mentioned, people, operations, logistics, planning, sales, we have established very clear KPIs that are very relevant that have an impact on the business and that start impacting the business in the short and medium term. And as the impact occur and we capitalize on the opportunities, we call this the opportunity map. So the increase in 1% or 2% is huge, but there's no point being just on intent. You need to have a clear plan, diagnosis, correct information, and you have to have the discipline, so the detail is part of your routine. So this is, again, that you cannot be too concerned of -- you have to look at the ball, but we are doing that. Going back to the basic if I had to the sentence to give you an example, we're going back to basic doing things in a simple way. Regarding the question on Brazil market, I would like to tell you that regardless of the variables that we control, the market variables and competition variables and competence as well, it's important to highlight evolutions that we have been promoting in the basics of the business. For example, trade execution, we are able to expand our customer base, the items sold to the clients, to the customers. The guarantee that our commercial policy will allow the adherence of prices in the sales point, price to the consumer. Also, we have increased drastically. At the end of the day, this will impact our market share. Besides what I have mentioned, the cost of feed and that is declining will favor the Brazilian geography and other markets as well. Since we have the production base concentrated in Brazil, I have to mention the projections for exports and production of pork products. When we have this economic scenario with a more deteriorated income, we have low-quality products and accessible prices, affordable prices, this will impact the market. Our next question is from Thiago Duarte, BTG Pactual. The first one, leading the Brazilian market discussion. And I'd like to hear from you a little bit on the perspectives about the margin going into the fourth quarter, your vision to the next year. When we look at first into this consistent recovery that the results are showing in Asia, and that came from very bad margins in some quarters. And in Halal segment, this is on a good figure, but it's still low. I'd like to listen to you to hear from you what do you think about the region, just leaving a little bit the Brazilian market discussion, how you will see the exports market, especially for chicken and the capacity of the company to maintain the margins, to digits, around 12% kind of low. Then the second question, I think that most people raise that here regarding the opportunities and efficiency gains. Miguel, we have been following BRF for a while, and we have heard about turnaround plans a few times. It's not rare, in fact, to see these plans pointing to many of the points that you have in a preliminary way due to the very short time that you have several points in common. And what do you understand that you could do differently regarding people, processes, someone has asked about the need to have more capital to do that so that we can, let's say, we can support and by your initiatives. Maybe it's too early, as I said, due to the very short time that you have had, but I think this would be a very interesting discussion. Since your question is recent, I'll start on the second question. I believe that it's important to say that all the plans that we have been talking about, this is not something new. I have a track record here, 42 years of experience with this type of process and situation that I have faced. I'd rather not look back and have this backwards analysis, I would like to look forward and look at the scenario and what we have to do. So the past can bring something to the future, if you're able to analyze and learn from it. I'm very modest when I say that, and I understand that all industrial processes and allow myself to reinforce this aspect for 15 years, I've been a factory unit person in several companies. But as you said in the preliminary analysis, this is an analysis that has this experience background that allows me to have a very clear vision. And the major challenge when we start a process such as this one, you have to build the correct indicators. And in this aspect, BRF has a major advantage because we have very high quality indicators. And then after this 42 years of experience of change in animal in protein and protein food, I think that we are working. We have separated what we have to do in the field, industry, logistics, commercial, a very clear example. But if you don't have good logistics, will not perform. Otherwise, also, you not have a good car. So you may not -- you can sell, but you will not be able to deliver. So working together, the major challenge, I think, is to identify this potential correctly. And so we will be working with all vice presidents, all our leadership, things happen in the units, and we are able to do that. And also I believe that all the performance part of the plan goes through people and processes, people and processes, you need discipline to analyze to see the segment in the transformation and detail-focused industry. So the program starts in the field, not only in the industry, in the plants. We have other technicians as well, food engineers and all and other professionals, they are extremely qualified and valuable. And we will be working and this is an intensive labor-intensive company, a lot of human capital involved. You cannot think that you have this silver bullet, but the pathways are well designed and very -- a lot of humbleness, I know that you're asking very pertinent questions and how each geographic location and the operational plan could bring us results. Regarding international markets that you have mentioned, I think that what is really important in exports platform is to look for ways to maximize your revenues. In this sense, you have to expand the alternatives in the market. So we have been working intensively to enable our production units to new markets in order to change it into a more flexible, agile company regarding decision-making that are focusing in the offer and different geographies and very dynamic. You have mentioned Asia, I can highlight here in the period, we had the pork being enabled to new fields in Singapore. We had also Toledo, the chicken protein to the Eurasia. We had also a chicken for China, . So this is a work that will allow us to win other positions, and this will influence a lot either in preserving our margins and even thinking about expansion, if we look ahead to 2023, we also see a good time for the Turkey and pork protein. We have a major opportunity now in the fourth quarter during the World Cup, since it will happen in the Gulf area, we will be able to move forward in our added value portfolio. More than 20% of the local sales, we already linked to that some incremental gains related to the brand and to the product processing. Also, we had the rehabilitation of the Kizad plant unit that is exporting process products to Saudi Arabia. I would like to highlight, especially sausages and also the nuggets. Finally, in this region, we have to maximize the cut mix even in the whole chicken, what we call the different ranges like that will have the premium related to the heavier range. So we're working on that to optimize the business front that at the end of the day, will impact this increase in margins and the results in the international market. First question, in what extent this Regal turnaround will change the company pricing policy. Second, BRF is rationalizing CapEx at this point, while its main competitor is expanding. I'd like to remind you that during 2021, specifically in the second half of '21 and along '22, we have executed a number of projects, especially growth projects that have to do with an increase of processed products offer. In 2023, the company is going to be able to enjoy the capacity as a result of these investments and that is going to bring the opportunity for growth with very marginal investments. That doesn't mean to say that the company is not going to take the business opportunities that may arise in the future, and that may require additional investment. It has to be very careful because today, the macroeconomics globally represent challenges in geopolitics, mature economy inflation and the expectation of even recession, we will be very careful, but we are not going to lose return opportunities and pay back opportunities to go unnoticed. So -- but we have systems -- enough system capacity that can really sustain relevant growth, which is the main portfolio in Brazil. And in this sense, I'm speaking about processed goods. As for weak points, in terms of performance, at this point in time, we don't want to put numbers. Miguel has been very clear in qualifying relevant opportunities, and these will happen gradually. And gradually, we are going to make this happen. Q&A is finished, and our call is also wrapping up."
}