{
    "symbol": "BRFS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 22:22:05",
    "content": " Moving on to the results of the second quarter, we â\u0080\u0093 I would like to say that we had a positive quarter, illustrating the effects in our operations of the decisions that we took in the first quarter regarding adjusting our market position and adjustment of the whole chain. But it â\u0080\u0093 at a different level than what we saw in the previous quarters regarding the main costs, we would say that these costs now are practically stable and in the second quarter, we may have less impact by diesel, given the measures taken by the government to reduce diesel prices in Brazil. And I think itâ\u0080\u0099s worth looking at China, because, when you look at this chart, you can see the peak in pork that happened in the second quarter of 2019 and continued until last year and the level changed, but we can see that a recovery has started and within June, July, weâ\u0080\u0099ve already had a price increase. So focus led by Fabio Mariano, our CFO, we can even dare to say itâ\u0080\u0099s an obsession to generate cash to have better net results brought about by a series of initiatives, activities that are well thought of in order to get positive cash generation and a continuous improvement now in the second half of the year. But thereâ\u0080\u0099s also that positive outlook, as I said, the World Cup and social programs that have been injecting resources in our economy, part of it will come to the food industry, and BRF is well positioned to capture that extra income too, and weâ\u0080\u0099ll be working on it throughout the second half of the year. But when you look at the sequential improvement of results, when we try to make any calculations with that kind of information, we have the impression that gross profits in Brazil, when we look at May, June and July when itâ\u0080\u0099s much better than April, itâ\u0080\u0099s still below 20%, which is way below what would be your history performance in the Brazilian market. Good morning, Lorival and Fabio. If you look at the second quarter results, you can see that weâ\u0080\u0099ve had year-on-year market share and with an increase of 4.5 in processed products. And as you mentioned, in the past 18 to 24 months, weâ\u0080\u0099ve had a priority on our cost structure, always trying to protect our profitability and in the short-term, we are trying to balance growth and profitability with making certain adjustments that are helping us recover market share in the short-term if you look in the past 60 days, several of our segments have started this recovery. Good morning, Lorival and Fabio. Looking at your performance at the start of the second half, do you believe that thereâ\u0080\u0099s room for further price corrections based on the adjustments you made in the chain and also taking into account consumption, the support, the extra â\u0080\u0093 the rescue money will help you to in volumes in alignment with that simplification strategy."
}