{
    "symbol": "BRFS",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 12:24:02",
    "content": " Before moving on, we'd like to clarify that, any forward-looking statements that may be made during this conference call related to the business perspectives, projections, operating and financial targets and goals are based on assumptions of the company's management, as well as information currently available to the company. I would like to make it clear that, these results of the first quarter does not please us in any way, and the results do not reflect what BRF really is, and our – results in the next quarters. And between the loss of derivative cash, which is part of our strategy to cover our balance sheet, plus the indebtedness that's connected with an appreciation of the Brazilian currency of nearly 15%, between the last quarter of last year and the first quarter of this year, we see the -- about BRL 12.5 billion, which is what's reflected in our balance sheet. And I'd like to stress that, as we said when we first introduced the vision adjustments and adaptations  as we said, we needed adjustments seeing as this was such a long-term plan, but looking at the global scenario that we have right now and all of the geopolitical and economic changes, a wide broad and profound review is now necessary prioritizing our current needs and avenues for growth as well as our focus. With that, I'd like to thank everyone for joining us and once again stress my confidence in the introduction and following of this streamlining plan as well as the results we expect them to bring to BRF, and also stress that BRF is extremely well positioned to seize the opportunities that this scenario is now presenting us starting in Q2. In line with Isabella's question, I would really like to understand the comment that you make in terms of five percentage points of improvement in the gross margin along the quarter and understand the beginning of the presentation when we say that the gross profit from a base 100 goes up to 500 in March. I'd like to once again stress our confidence in our performance over the next quarters, when we expect to have material results as a result of our plan to streamline and simplify, the way the company operates and also highlight that BRF is extremely well positioned and with the right strengths to seize the opportunities that will certainly present themselves over the course of 2022."
}