{
    "symbol": "PRGO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-11 12:01:10",
    "content": " Strong top line growth, strong margins, and a number of budgeted expense decreases including one-time investments included in 2021 operating income that are not expected to repeat in 2022, supports our estimates of HRA achieving approximately €90 million in operating profit in 2022. Manufacturing productivity, elimination of onetime cost, price increases, and 90% of expected benefits from price this year are still to come, the sale of the Latin American businesses, and now the addition of 70% gross margin HRA product should allow us to recover 400 to 500 basis points of gross margin by yearend. Gross margin declined 540 basis points versus the prior year due primarily to these onetime headwinds which account for nearly half of the decline, unfavorable product mix from higher proportion of sales coming from store brand compared to branded, and the timing of pricing actions related to inflation as well as unfavorable foreign currency. Operating income for Q1 was $87 million, $23 million down from Q1 last year, primarily unfavorable gross profit flow-through and increased distribution expenses, partially offset by lower R&D and admin costs. Moving on to consumer self-care international, CSCI gross profit was $182 million, down $9 million or 4.8% from the same quarter last year, largely due to unfavorable currency movements. But call it, if we had, roughly, $0.15 of material and freight inflation in the first quarter, we probably offset 80% of that -- something like that in -- with pricing alone, and then the rest got offset by volume. The immediate ones though are getting our service levels back up coming out of COVID and all the disruption, supply chain disruption that has given us a number of those one-timers that has resulted in SSO levels that over the course of the year and obsolete inventory from making it and missed shipments of -- if we get probably $100 of profit opportunity in that category alone."
}