{
    "symbol": "PRGO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-08 12:47:05",
    "content": " On today's call, I'll first highlight Perrigo's double-digit third quarter constant currency top and bottom line growth versus a year ago and the strong fundamentals on our business that drove that growth. Organic net sales growth continued to grow well above our 3% long-term target growing plus 8% in the quarter and plus 11% year-to-date and that excludes the organic growth of HRA, which grew double digits during the same periods of time. Constant currency diluted EPS for the quarter was $0.65 or up 44% versus year ago, which included higher year-over-year interest expense and a slightly higher share count. Looking at the latest 13 weeks, which coincides with Perrigo's third quarter, total US OTC omnichannel dollar growth slowed from that 13.4% to 2.3% despite significant retail price increases. Eduardo will go through the details, but we expect an impact to 2023 adjusted EPS of approximately $0.18 or $30 million in operating income for a one-time cost and let me stress a one-time cost, which would not be included in your current forecast. On an adjusted basis, net income was $76 million and adjusted diluted earnings per share was $0.56 per share versus $0.45 per share in the prior year quarter. Moving directly into gross profits, Q3 grew $43 million or 22.3% on a constant currency basis, driven by inflation justified pricing, higher sales volumes, and the absence of two products recalled that occurred in the prior quarter. Sequential operating income for the quarter was flat to last year as gross profit flow through was offset by higher operating expenses, including the addition ofra, a 30% increase in distribution expenses driven by higher logistics and the emerge costs in our oral care business and the impact of divested businesses. Let me explain year today, operating cash flow included impacts of $79 million due to increased inventories, primarily US oral care business and CSCI segments and 19 million from restructuring expenses. We're going to be running product at a lower cost, that operating profit that they were making comes back to us in margin plus additional volume from probably $35 million on sales of $10 million of operating income in the fourth quarter supplements the Nutrition business. Oral Care, I think that I -- don't quote me exactly, but I believe when freight went from around 6,000 a container up to 25,000 of container, that cost us $23 million on a business that made roughly $50 million. So I almost joked with Brad, our Investor Relations guy, I know you know very well that listen, I'm not going to tell you what the target is, but it's adjusted by $0.10 for currency and $0.18 for HRA, which means it's $0.18 -- it's $0.28 lower than the target I didn't give you, which is -- but I would say that The Street is around $3."
}