{
    "symbol": "POR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 00:39:03",
    "content": " Further, it's included the elimination of our existing decoupling mechanism and the application of an earnings test to certain major deferrals, specifically the order authorize the application of an annual earnings test for the 2020 COVID, 2020 Wildfire emergency in the 2021 I storm deferrals, allowing collection of costs incurred related to these matters until PGE's regulated ROE reaches certain thresholds at or below our allowed ROE based on the regulatory calculation for these amounts. We experienced a $0.01 increase in total revenues while load was up 3% quarter-over-quarter, the significant increases in industrial load growth were partially offset by a 1% decrease in residential load, non-weather-adjusted, resulting in some offsetting effects due to the composition of customer prices and mix. 14:15 Q1 2022 O&M drivers include $0.02 of additional vegetation management reflecting incremental work performed in 2022, $0.02 of additional outside service and labor costs for grid reliability and resiliency, and $0.02 decrease from higher administrative expense primarily driven by wage and benefit increases quarter-over-quarter. This reflects a reduction to the full year guidance for the adjustment of the 2020 deferral amounts, and a revision to full year O&M guidance from $590 million to $610 million to $620 million to $640 million, which includes a $17 million impact from the change in regulatory deferrals, with the remaining increase attributed to higher wildfire mitigation expenses resulting from more work as a result of cost pressures for the full year. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open. 49:39 I'm not sure you went from ‘21 to ‘23 in between ‘22 so can, maybe you can help me understand where you're focused, but I'll just offer of what I said previously, we've done extensive work around the earnings test for ‘21 and there is no exposure there in our view and that sort of deferrals are probable with collection based on the test that we had to perform. Your line is now open."
}