{
    "symbol": "AKU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-12 12:58:06",
    "content": " On a sequential basis, revenue decreased $5 million or 2.9% over the second quarter of 2022, impacted by Hurricane Ian, as previously noted. On a sequential basis, adjusted EBITDA decreased $1.7 million or 4.3% from the second quarter of 2022. However, we did incur a $20 million impairment charge in the quarter as a result of the combined impact of multiple factors, including the review of existing hospital partnerships conducted by our new leadership team; the delay in implementing new partnerships, in part as a result of supply chain issues; and the deferral of some growth capital expenditures given the strategic review of the business. Moving to Slide 8, you can see the MRI, PET-CT, and total radiology procedure volumes and same-store changes over the last nine quarters in aggregate volumes in 2020 and 2021 as well as the trailing 12 months, including Q3 2022 on a pro forma basis to provide comparability, including the Alliance acquisition, particularly pleased with the growth of our PET-CT volumes as you can see. As youâ\u0080\u0099ll see on the chart on the top left, the radiology segment contributed $155.1 million of revenue in Q3, representing approximately 83% of total revenues with an adjusted EBITDA margin of 20.1% for the allocation of corporate services. While these factors have negatively impacted our 2022 outlook, we have made significant progress toward realizing integration synergies and remain confident that we will achieve the full benefit of our Phase 1 initiatives of approximately $23 million on a run rate basis in Q4. Based on the new midpoint of our adjusted EBITDA guidance, we now expect to generate approximately $20 million in free cash flow in 2022. Weâ\u0080\u0099ve also shown our exit rate free cash flow expectations, annualizing the implied midpoint of our fourth quarter adjusted EBITDA and including the $25 million in synergies that we now expect to achieve as part of our Phase 2 and Phase 3 integration plans. So, that $50 million, as you know, in our presentation, I think we have around $4 million of maintenance CapEx to maintain the current EBITDA and $26 million of growth CapEx, which obviously will have an impact next year. On a pro forma trailing 12-month basis, we generated in excess of $740 million in revenues and served patients with more than 210 fixed sites in radiology and oncology, and more than 4,000 team members across the U.S. As mentioned earlier, our integration initiatives are well underway, and we continue to expect 2022 to be a milestone year as we build on this solid foundation."
}