{
    "symbol": "BANR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 15:50:13",
    "content": " Banner's third quarter 2022 revenue from core operations increased 9% to $161.5 million, compared to $148.2 million for the second quarter of 2022 and $153.6 million compared to third quarter a year ago. And very briefly touching on asset quality, adversely classified loans continued to decline, reducing by $18 million in the quarter and are down $89 million or 40% year-over-year. Due to continued strong loan growth in the third quarter as well as the impact of increased economic uncertainty, we posted a $6.3 million provision for loan losses and released $205,000 of the reserve for unfunded commitments. After the provision our ACL reserve total to $135.9 million or 1.38% of total loans as of September 30, an increase of two basis points from the linked quarter and compares to a reserve of 1.52% as of September 30, 2021. Looking at the loan portfolio, we again reported strong loan originations, core portfolio loan growth, excluding PPP loans was $388 million or 4.1% for the quarter, and 16.3% on an annualized basis. Commercial loans excluding PPP grew by nearly 5% or $53 million in the quarter, which has an annualized rate of 18%, and balances are now 18% higher than that reported as of September 2021. Reflecting the success of the summer home equity loan promotion, HELOC, balances also added materially to the growth of $39 million or 8% again this quarter compared to growth of $36 million in the linked quarter. Core revenue excluding gains and losses on securities, changes in fair value of financial instruments carried at fair value and gains on the sale of sold branches increased $13.2 million from the prior quarter, due to an increase in net interest income partially offset by a decline in mortgage related noninterest income. Noninterest expenses excluding Banner Forward increased $4.1 million, due primarily to lower capitalized loan origination costs along with increased bonus, commission and marketing expense. Turning to the balance sheet, total loans increased $385 million from the prior quarter end as a result of increases in health portfolio loans, partially offset by an $18 million decline in PPP loans, excluding PPP loans and held for sale loans, portfolio loans increased $388 million or 16.3% on an annualized basis. Ending core deposits increased $56 million from the prior quarter end due to normal seasonal factors, partially offset with outflows and rate sensitive balances. Net interest income increased by $17.4 million from the prior quarter due to an expansion of the net interest margin, coupled with growth and average loan outstanding and lower balances of lower yielding overnight interest-bearing cash. Compared to the prior quarter, loan yields increased 28 basis points due to increases on floating and adjustable-rate loans, partially offset by a decline in PPP loan forgiveness processing fees, excluding the impact of PPP loan forgiveness, prepayment penalties, interest recoveries and acquired loan accretion. In the coming quarters, we anticipate a slowdown in the pace of margin expansion as price sensitive deposits move off balance sheet loan growth moderates, overnight cash levels decline and deposit rate increases accelerate. Total deposit fees increased $450,000, while mortgage banking income declined $3.9 million due to declining residential mortgage production, coupled with the fair value write-down of multifamily loans held for sale. Total noninterest expense increased $3 million from the prior quarter, primarily due to lower deduction for capitalized loan origination costs, increased compensation, marketing and deposit insurance costs while Banner Forward implementation costs declined $1.1 million to $400,000 in the current quarter, excluding Banner Forward, noninterest expense increased $4.1 million."
}