{
    "symbol": "BANR",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 14:56:14",
    "content": " Banner's first quarter 2022 revenue from core operations decreased 3% to a $137.6 million compared to a $141.4 million for the first quarter of 2021, primarily due to the increase in mortgage banking revenues, which were down $6.9 million when compared to the same period last year. And good morning, everyone. After the release, our ACL reserve totaled $125.5 million or 1.38% of total loans as of March 31st, down seven basis points from the linked quarter and compares to our reserve of 1.57% as of March 31st, 2021. Our commercial and commercial real estate pipelines are solid and for the quarter, we reported core portfolio loan growth excluding PPP loans of $100 million or 1.12% for the quarter and 4.6% on an annualized basis. While the utilization rate within this category remains approximately seven basis points lower than historical norms, C&I balance nonetheless increased by $68 million, 3.7% quarter-over-quarter, or 15% on an annualized basis, and are 5% higher than that reported as of March 31st, 2021. Consumer mortgage and home equity lines also added to the growth in the quarter, up $63 million or 6%, which reflects increased mortgage loan production held in the portfolio, as well as the result of a successful home equity campaign to replace those balances that were paid off with home refinances over the course of 2021. Looking at asset quality briefly, adversely classified loans declined $20 million in the quarter and are down $133 million or 43% year-over-year. And good morning, everyone. Core revenue excluding gains and losses on securities and changes in fair value of financial instruments carried at fair value, decreased $5.8 million from the prior quarter, due to the line down of the PPP loan program, lower miscellaneous income from gains on branch sales in the prior quarter, write-downs on closed branches this quarter, along with lower mortgage gain on sale. Total loans increased $30 million from the prior quarter end, as a result of increases in held for portfolio loans partially offset by a $75 million decline in PPP loans. Net interest income declined by $2.9 million in the prior quarter due to fewer calendar days, a decline in SBA PPP loan forgiveness, which were partially offset by higher security income and lower funding costs. The average interest bearing cash and investment balances declined $44 million in the prior quarter, while the average yield on the combined cash and investment balances increased ten basis points due to a lower mix invested in overnight funds and higher yields on both the securities portfolio and organic funds. Core non-interest income, excluding gains on the sales of securities, changes in investments carried at fair value, decreased $2.9 million, deposit fees increased modestly by $800,000, while mortgage banking income declined by $1.2 million due to lower production and gain on sales spreads. Miscellaneous fee income declined $3 million due to gains on sale of closed branch locations and an accounting adjustment related to the increase in value, increasing the value of the company's SBA servicing asset in the prior quarter, along with modest declines and swapped and SBA gain on sale fee income in the current quarter. Loss on the redemption of certain junior subordinated debt liabilities carried at fair value declined by $1.5 million to $800,000 while Banner Forward implementation costs increased $1.3 million to $2.5 million in the current quarter. Core non-interest expense declined 300 thousand compensation expense increased by $1.7 million due to higher severance costs, elevated payroll taxes, and medical claims expense, partially offset by lower salary driven by FDA deductions under Banner Forward. Andrew, your line is open. Andrew, your line is open. Andrew, your line is open."
}