{
    "symbol": "ISPC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-14 13:47:09",
    "content": " Measuring the number of both supply side and customer side users that interacted with the iSpecimen Marketplace platform during the first quarter of 2022, we are pleased to report an increase of nearly 35% and that's compared to the same period 1 year earlier, Q1 2021. For the first quarter of 2022, we reported approximately $2.5 million in revenue compared to approximately $3 million during the same period last year. For the first quarter of 2022, COVID-19 revenue was approximately $479,000 compared to approximately $682,000 for the same quarter in the prior year, a $203,000 or 30% decrease in COVID-19 revenue. Specimens accessioned during the first quarter of 2022 were directly impacted by the Russia and Ukraine conflict, which resulted in a decrease of approximately 1,267 specimens or 20% to approximately 4,924 specimens compared to approximately 6,191 specimens accessioned during the same quarter in the prior year. Cost of revenue decreased by approximately $458,000 or 28% from approximately $1.6 million for the first quarter of 2021 to approximately $1.2 million for the first quarter of 2022, which was attributable to an 11% decrease in the average cost per specimen as well as a decrease of 20% in specimens accessioned for the current period compared to the same period in the prior year. For the first quarter of 2022, we increased our cash spend for technology to approximately $600,000 from $389,000 for the same period last year. The increase in spend for the first quarter of 2022 compared commitment to invest in our technology, as evidenced by our -- for the first quarter of 2022, this cash outlay was comprised of approximately $339,000 of capitalized internally developed software and approximately $261,000 of technology expense that we are not able to capitalize and therefore, was capitalized -- was classified as technology expense. For the first quarter of 2022, sales and marketing expenses were approximately $747,000 compared to approximately $529,000 during the same period last year. For the first quarter of 2022, general and administrative expenses were approximately $1.8 million compared to approximately $960,000 during the same period last year."
}