{
    "symbol": "HT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 14:11:03",
    "content": " Our comparable hotel portfolio generated 71.2% occupancy and an ADR of $311.86, resulting in RevPAR of $222.10 for the fourth quarter of 2022. The high quality of our portfolio, coupled with the ongoing demand environment, allowed our revenue managers to continue to drive rate in the quarter as ADR outpaced our 2019 rate by 21.5% and all of our markets expanded ADR more than 15% compared to 2019. Rounding out our urban portfolio, our Ritz-Carlton Georgetown continues to outperform posting nearly 40% ADR growth compared to 2019, resulting in 67% EBITDA expansion for the quarter. On the East Coast, the Mystic Marriott and the Annapolis Waterfront Hotel generated $2 and $1.8 million in EBITDA outpacing 2019 by 76% and 47% respectively, clearly demonstrating the earnings potential of best-in-class assets in regional resort markets with multiple demand generators. And with EBITDA expansion in both our urban and resort markets, we delivered the largest outperformance in the fourth quarter with comparable portfolio EBITDA of $31.4 million, a 12.6% increase to 2019. With this renovation and a few lifecycle refreshes on deck to the portfolio, we project CapEx spend of approximately $35 million to $40 million in 2023, up only $10 million as compared to 2022 due to our significant investment in the portfolio before the pandemic and our selective disposition of assets that required major capital investments, which did not meet our internal return requirements As in previous years, weâ\u0080\u0099ll attempt to complete the majority of these renovations in the first quarter of the year, which is seasonally the slowest quarter of the year for our portfolio. In the fourth quarter, EBITDA margin for the comparable portfolio was 33.1%, a 209 basis point increase to 2019 within our projected range of growth. And then when you look at potential performance in your resort versus your urban markets on the margin side versus 2019, youâ\u0080\u0099re thinking thereâ\u0080\u0099s more, still more opportunity for growth on the resort side or perhaps maybe urban given some of the opportunities on the rate side of things given we could expect a little bit more margin growth there compared with resort side."
}