{
    "symbol": "DHX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-05 16:54:03",
    "content": " During the third quarter, U.S. employers posted over 1.1 million tech jobs, up 18% year-over-year, according to information technology trade group, CompTIA. Bookings increased 17% year-over-year in the third quarter, and revenue renewal and retention rates remained strong at 98% and 110%, resulting in Dice revenue for the quarter increasing 23% year-over-year. During the third quarter, our bookings for CJ increased 23% year-over-year, and our revenue renewal and retention rates remain strong, coming in at 97% and 110%. Total bookings for the quarter were $36.5 million, up 19% year-over-year. Our average annual revenue per CJ recruitment package customer was up 3% over last quarter and up 13% year-over-year to $19,308. Adjusted EBITDA for the third quarter was $8.1 million, a margin of 21%, compared to $6.4 million, which was also a margin of 21% in the third quarter a year ago. Deferred revenue at the end of the quarter was $52.3 million, up 20% from the third quarter of last year. Our total committed contract backlog at the end of the quarter was $102.9 million, which was up 29% from the end of the third quarter last year. Short-term backlog was $84.2 million at the end of the third quarter, an increase of $16.4 million or 24% year-over-year. Long-term backlog that is revenue to be recognized in 13 or more months was $18.7 million at the end of the quarter, an increase of $6.5 million or 54% from the prior year. Looking forward, based on our strong bookings performance, we expect fourth quarter revenue to be in the range of $38.5 million to $39.5 million, a growth rate of 14% to 17% year-over-year. For the full-year 2022, we are raising our range to $148.5 million to $149.5 million in total revenue, a growth rate of between 24% and 25% for the full-year over 2021. From a profitability perspective, we will continue to operate the business to adjusted EBITDA margins at or near 20% in the fourth quarter as we balance our strong financial performance with increased sales and marketing investment to drive continued long-term revenue growth."
}