{
    "symbol": "EGP",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-08 17:05:24",
    "content": " We've had strong releasing spreads, but Florida and Arizona were both north of 40% GAAP releasing spreads last year and that doesn't feel like it's slowing down, and then if I jump ahead 12 months, we really saw supply and especially shallow base supply stop when the capital markets got so unstable. But thankfully to-date we've not seen it, but we're trying to be a little bit anticipatory if it comes and maybe it's a little bit, look I think at some point things, nothing specific, but hopefully it's prudent to be a little bit conservative and look, weâ\u0080\u0099ll certainly get several chances each quarter during the course of the year to give you our update and again, we'll do our best. We're hoping demand is there, and with our cost and things like that, we've actually â\u0080\u0093 you know, one of the things that I will say, there's a lot of different metrics on our dashboard and I know a lot of your peers focus on the cash, same store NOI which we do too, but we're continuing to push our development yields up. And then probably about second quarter, always think of you know, it's kind of the light switch when amazon kind of said, hey, we overdid it on our space growth over the last couple of years slightly, that's when things have slowed down. So that's tricky for us, but it's good news and that it is really putting things in their tracks and we've seen any number of projects, where people â\u0080\u0093 the forward sales where someone would get a site zoned and permitted and you can ï¬\u0082ip it and make a really good return in the last few years. And I also think our development risk is lower when we're -- it may be a spec building, but we -- we know how the last building that we built in the park lease top and then typically, we have some activity, whether it's our own tenants or just tenant rep brokers in the market to kind of start that new building. So, if you've got below-market leases that are rolling fairly soon, you're probably still in the fours with those, you know pending the market may be threes in Southern Cal, low fours or high threes and then we heard of some cap rates in the fives in different markets, but you know it's one thing for us to hear brokers talk about those, and I know they're being sincere, but until we see some of those trade, and that's where it could get interesting. I love the idea of taking the tenant from park, from building three to kicking off building eight because their lease if it's a couple of years old, which is it is and that original building by now, it's 20% call it below market or whatever that number is, and we can hopefully backfill their space by the time we move them into the new building. And that's probably another thing that's keeping people on the sidelines for new development, a little bit as movement, if you're a merchant developer, movement and land prices and construction prices, you'd probably want to wait a little bit to see before you started a new project and hopefully thatâ\u0080\u0099s where we can step in and build some spec developments and get it least, especially if it's within our own tenant fee or the tenants across the street, while the markets are little unstable. Our list of reasons when we track our move out, it's not that the rent was too high, and thankfully I think especially in a rising market like we've been in, 99% of our â\u0080\u0093 even our renewals, if they have a tenant rep broker, so by the time they sit down with us, their own brokers educated them of okay, you can move and go through that cost, but you're going to be paying about the same rent."
}