{
    "symbol": "SFE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-10 18:20:02",
    "content": " Given this macro environment and the fact that we may decide to use Safeguard's capital to support our companies and defend certain of our positions, we have set our 2023 guidance for follow-on deployments at $4 million to $6 million. Safeguard's net loss for the year ended December 31, 2022, was $14.3 million or $0.87 per share as compared to a net income for the year ended December 31, 2021, of $27 million or $1.36 per share. With respect to our ownership interest, we have an aggregate carrying value at December 31, 2022, of $15.4 million as compared to $26.5 million at 2021's year-end. Also with respect to our ownership interest, the third-party debt at this group of 8 companies was approximately $209 million versus $206 million at September 30, 2022. In terms of revenue performance, we reported an 8.7% increase in our group of 8 companies to $141 million for the trailing 12-month period ended September 30, 2022, which reflects the 1 quarter lag. So I just want to -- so first of all, as we indicated, with 3 companies carrying relatively large debt loads and us being incredibly active in working with the companies and the lenders on what the restructuring would look like, our husbanding of cash, just to use the phrase, is -- and the best case scenario is a temporary move to see how these situations resolve, and then we can make a capital allocation decision at that point in time. And then the last one is when you mentioned the $4 million to $6 million range of deployment for 2023 and the other caller asked about a buyback or other uses of capital, is the -- and then you go sort of on to this conversation about sort of rescue financing and other opportunistic situations with our over-levered companies, et cetera. We have $19 million of cash and we spent $6 million -- if you just take the -- like if you're in this situation -- you're in our seat, you'd say, okay, let's assume the high end just to see what our liquidity looks like."
}