{
    "symbol": "TCN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-02 21:18:14",
    "content": " That being said, if we were to shift our criteria to lower target cap rates, let's say 5.25% to 5.75%, we could buy a lot more homes. Although the portfolio experienced higher volume of work orders, as well as cost inflation post-pandemic, we were able to offset this in part by completing 75% of our work orders in-house or 6% more year-over-year, which in turn saves us about $400 per job. Your line is open. We're now doing 75% of work orders on in-house and we've found that when we do work orders ourselves, we're saving about $400 a job, with conscious about $160 a work order, when we do it in-house for instance $500 to $600 a work order if we bend it out, so that's lowered our cost as well. So, between bringing down the prices and doing more work orders in-house, really looking at the scope, we've been able to drop our costs or our cash cost the turn, a home dropped from like $5,200 in September to $3,800 in February, that's a 27% decrease in the cash cost to turn a home. So, the way they think about it is, if you can buy homes at a 5.5% cap rate and then get NOI growth of 4% in perpetuity, that's a 9.5% return and they're happy with that. Your line is open. So, it's a bit of an arc, Nick, but I would say, that if we kind of think about where we're seeing wage growth, we're seeing that moderate probably from about 8%, I would say with our frontline workers narrowed down to maybe 5% or 6%. Your line is open. Your line is open. In terms of new home supply, that's probably down 15% year-over-year and obviously going into 2023 it's going to be very difficult for the builders, whether it's core sale or build-to-rent to add more supply. Your line is open. Going into the quarter, I would say for Q1, we're going to be probably around 12% for the quarter in new lease rent growth and mid-7% for blended, at the beginning of the year to get this pent-up demand. Your line is open. Your line is open. And you're going to see, as Gary mentioned before, let's say, 4% to 5% NOI growth every single year. Your line is open. Your line is open. Your line is open."
}