{
    "symbol": "VQS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-30 14:08:04",
    "content": " Today, we are hosting a conference call to discuss the fourth quarter and full year 2022 financial results for VIQ Solutions Inc. . Before we begin, I would like to point out that certain statements made on today's call contain forward-looking information subject to known and unknown risks, uncertainties and other factors. For a complete discussion of the risks and uncertainties facing VIQ, we refer you to the company's MD&A and other continuous disclosure filings which are available on SEDAR at sedar.com and on sec.gov. With us today, we have Sebastien Pare, CEO; Alexie Edwards, CFO; and Susan Sumner, President and Chief Operating Officer of VIQ, all of whom will be available for questions following the prepared remarks. Welcome, everyone, to our 2022 fourth quarter and full year earnings call. I'll provide some high-level remarks on our results, and then I'll hand it over to Susan, who will discuss our operating results, who will then be followed by Alexie, who will discuss our financial results briefly. We continued to work our way through the post-pandemic Great Resignation, rising interest rates and inflation, currency impact in a tech sector that saw the worst performance in the public markets since the Global Financial Crisis 15 years ago. The migration of our clients and transcription teams to NetScribe, powered by aiAssist, was a key objective to increase efficiency and to rightsize our global head count while boosting productivity. We ended up 2022 with a 48% increase in year-over-year revenue, of which 93% is annual recurring revenue, known as ARR, and a 53% increase year-over-year in our net new bookings. We delivered on our promise to bring end-to-end workflow technologies to clients around the globe to solve key problems like the critical shortage of court reporters in courts, the demand to manage and access the vast amount of data that is recorded and the need to move content securely to the cloud. As our customers find more efficient ways to create and digitize their evidentiary content, we continue to execute on our strategy to extend our AI to targeted verticals through scale, industry-specific content, optimized workflow and human knowledge. With the continual advancements in natural language models from large global speech-to-text companies, it's reliant upon technology service experts like VIQ to lead the implementation of these technologies to shape the transcription industry in core verticals like legal, courts, criminal justice, insurance and media. Successful verticalization requires scale, specialized data, industry-specific workflow and unsurpassed human knowledge, which is at the core of VIQ. As Seb stated, 2022 was a challenging year, but strength and growth comes only through continuous effort and perseverance. We have become laser-focused on performance, productivity, measurement and accountability of all of our teams. I am pleased with how we are improving our execution related to client migration, the utilization of our global workforce, our new global sales footprint and the creation of new innovations that drive our customer success. Australia, representing 57% of our revenue going into 2023, is scheduled to complete these migrations going onto the platform in late 2023, which will further improve the margins. The key attainments in productivity and efficiency gains have positioned us for success with the Australian migration, where we expect to continue driving significant momentum as we experienced in the fourth quarter. Unfortunately, a significant portion of anticipated revenue in Q3 and Q4 was delayed due to the Great Resignation, constraining capacity, slowing the onboarding of our bookings and delaying migrations that would have driven further improvements on gross margin. The second half of 2022 was focused on stabilizing key customers, and we succeeded in renewing or extending all of our major contracts that were up for renewal in 2022 and maintaining an NPS score in the mid-90s. This had a short-term impact on production, and constraining capacity in limiting the onboarding of new agreements that were earmarked to begin in late July and August. We had great wins across products, industries and geographies, and we strengthened relationships with our clients and partners. We expanded our relationship in insurance to include partnerships with 7 of the top 10 U.S. insurance companies, increasing their productivity and expediting access to documentation using our AI-powered technologies. Our FirstDraft has been proven to reduce efforts to transcribe interviews by at least 50%, decrease overhead costs by implementing AI-generated transcripts and to save time on more important investigation tasks. We expanded our global NetScribe footprint, selling to transcription companies, courts and law firms to secure and transform the way transcripts are created. Our technology is making a difference in the way transcripts are created, workflows are processed and information is accessed. Their production workflow is resulting in cost efficiencies; they have greater enterprise functionality compared to their competitors; and they can handle an increased number of projects simultaneously; and best of all, they increased transcriptionist and client satisfaction. We further enhanced our proprietary automated speech recognition technology, which improved efficiency and diarization, along with the usability and accuracy of our FirstDraft in all verticals. Our strategy to remain engine-agnostic ensures that we utilize the best-suited and most efficient engine focusing our R&D investments on industry, geography and customer-centric customization based on the characteristics of the file. Creating the best document is reliant on the engine's ability to learn and take advantage of our vast database of content to accelerate our improvements in AI for targeted industries like insurance, media and courts. The integration with Sony Ci securely manages synced audio and video recording for expedited content creation, enabling the media team to utilize VIQ's AI-powered draft documentation to self-edit or send on for professional verbatim recorded documentation by VIQ's team, which is now utilized by major news and media outlets. We share alignment on bringing cloud-based solutions to legal, law enforcement and courts across EMEA. Despite the headwinds of 2022, largely precipitated by capacity constraints, we renewed all of our major contracts that were set to expire this period. We sacrificed short-term growth to preserve our essential relationships during this time, and we have seen this in our continued customer loyalty. Q4 revenue of $10.2 million, an increase of $2.7 million or 35% from the same period in the prior year, primarily driven by a full quarter of Auscript versus 18 days in the prior year quarter. Gross profit of $4.8 million, an increase of $1.5 million or 45% from the same period in the prior year. Our net loss was $2.2 million, which is a decrease of $1.5 million versus last year. And finally, our adjusted EBITDA was negative $1.2 million, representing a decrease of $0.6 million or 35% from last year. Firstly, we generated revenue of $45.8 million, which was an increase of $15 million or 48% from 2021. Our gross profit was $21.9 million, an increase of $7 million or 47% from the same period in the prior year. Our net loss was $8.7 million, which represented a decrease of $11 million or 56% from 2021. Our adjusted EBITDA was a negative $3.4 million, a decrease of $1.5 million or 31% from the same period in the prior year. The improvement in adjusted EBITDA was mainly driven due to efficiency gains from scalability, cost-cutting measures and lower corporate costs than 2021. On January 13, 2023, we entered senior debt facility with Beedie Investments Ltd with maximum available funds of $15 million. In 2022, we adjusted our focus, aligning our global resources, conducting a 10% reduction in headcount and restructured to improve adjusted EBITDA as we work to evolve into a leaner, more data-driven company without sacrificing our ability to scale and meet customer demands. As we look to begin generating positive free cash flow later this year, we believe this facility provides us with the necessary liquidity to support growth. Sebastien, I was hoping maybe you could speak a little bit to revenue visibility in '23. I noticed there wasn't any conversation in the press release or on the call about targets, goals, which is a little bit of a departure from previous quarters. So we -- what we decided to do is, at this point, to really opt for no specific guidance going into 2023. At this point, we're really, really are focusing on Q1 and Q2. And then we'll come back, I think more openly, kind of halfway through the year with an update in terms of where we're at. Particularly after last year and some of those organic and basically net new bookings that got delayed because of all those environmental constraints that we talk about, we felt it was prudent going into 2023 without really providing any specific guidance. We do have, obviously, a large number of net new bookings that came through last year. Obviously, we're actively trying to accelerate the ramp up of those contracts which will translate into organic growth in Q1 and Q2. We also have a number of very large and mid-sized opportunities with ORdigiNAL, as Susan alluded to, across Europe and EMEA, that are in the process of going into evaluation. So depending on all of those assumptions coming out in the first 6 months of the year, we felt it was more prudent to basically abstain from providing specific guidance knowing that we will come back to you probably later in July with an update. And at that point, once those assumptions have been fully validated and there's been no environmental constraint impacting our capability to scale, then we'll provide a little bit more specific guidance moving forward. And then as you migrate Australia to NetScribe, do you anticipate those gross margins to look more like the U.S., in the mid-50s? I think what we're aiming for is -- obviously, it's a process, it's a journey. It's going to take some time, but now Australia representing 57% of our revenue, then you could appreciate that gaining a 10%, 15% gross margin on that revenue in Australia will be absolutely significant moving forward. But again, we want to be conservative, and those migrations are well underway as we speak, and then we'll provide an update halfway through the year. I would say, Brian, that the new Queensland contract is probably at 90% efficiency right now. In terms of the execution of the bookings from 2022, it's been a slower-than-anticipated onboarding process because of the constraints that I referenced also in my speaking notes, but we are starting to see the implementation and the ramping of the 2 major contracts that came out of 2022. I believe it's in Australia, that is the reason as some courts shut down. You're absolutely correct, basically, 95% of the courts will shut down between Christmas and the end of January. And Q1 is going to be within the same range, I would say, as Q4 or slightly better, based on all seasonality trends. My other question is, with the -- we obviously see the balance sheet at the end of the fourth quarter, and you discussed subsequent events. Plus, we paid fees associated with the financing, and the balance is being absorbed in business -- additional working capital. But the $12 million was -- most of it was utilized to pay down the Crown debt and some fees associated with it, and the balance was absorbed for working capital. And so if you've got any questions or any outstanding that you think will require a little bit more details than these first questions, please do not hesitate to reach out to Laura Kiernan."
}