{
    "symbol": "ATCO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-10 11:31:09",
    "content": " In the second quarter, we sold nine Panamax vessels that were no longer aligned with our long-term fleet strategy and continue seeking opportunities to optimize our fleet portfolio to meet the needs of our customers. In the second quarter, we delivered four fourth and fifth 12,200 TEU newbuild vessels, which commenced 18-year charter with another leading global liner upon delivery. In June, we also delivered our first and second 11,800 TEU vessels, which commenced the five-year charter with another leading global liner upon delivery, with a running total of 117 newbuilds since our IPO in 2005, materially derisking execution. Alongside the strong market conditions for grid stability, we continue to transform the business by strengthening APRâ\u0080\u0099s business development team, developing creative customer solutions and remaining focused on transitioning the company to long-term power opportunities with predictable cash flows. Due to the age, design and predicted future demand, we completed the sale of nine 4,250 TEU vessels in the second quarter, generating approximately $224 million in cash proceeds. Alongside locking in a significant amount of fixed rate debt to fund our newbuilds in 2021, securing $500 million of additional long-dated debt in the second quarter and entering into a $500 million long-term floating fixed rate swap in the first quarter will continue to proactively manage our exposure. Number one, Atlas continued to deliver solid financial results in the second quarter, with strong performance across all metrics and $18.9 billion of high quality long-term gross contracted cash flows, ensuring through-cycle performance amid a normalizing industry environment. Look, I just point everybody to our fully integrated operating platform, not only in terms of the design of vessels and suitability of customer -- for customers through our newbuild program, but also what we do to existing vessels to ensure their relevance within our customerâ\u0080\u0099s fleet."
}