{
    "symbol": "CONN",
    "quarter": 1,
    "year": 2022,
    "date": "2021-06-03 15:38:05",
    "content": " And we’ve just started taking some additional risk here at the end of the first quarter and now into the second quarter, we believe we can capture a significant portion of those Conn’s finance customers that we were declining in the past back over the coming year because our Conn’s business was down 20% plus in the – throughout the pandemic. And now with the new lease-to-own partners, the combination of Conn’s and lease-to-own in the lower end of the – mid to lower end of this credit spectrum in conjunction with that larger addressable market at the higher end, we believe positions us extremely well here, not only for the balance of this year but going forward into the future. And the reason that we’re able – the reason we’re doing that or able to do that is we don’t have to go as far down the credit spectrum with Conn’s financing because our lease – the two lease-to-own partners that we’ve added, we’re letting them pick that lower credit quality customer up that in the past, when we’ve taken more risk, we’ve gone deeper in the credit spectrum. We can get the higher credit quality on the Conn’s side, but also cannot lose those customers on the lower credit quality side because of our lease-to-own partnerships have strengthened so much with the addition of the two partners. So, if you look at those metrics going forward, our expectation is that we can maintain a very strong credit portfolio simultaneously while growing the business through Conn’s financing, through lease-to-own partnership as well as at the higher end of the credit spectrum as well. So, our expectation is we can continue to capture incremental Conn’s finance sales here going in through the second quarter and on the balance of the year and do that while maintaining credit risk at an acceptable level. I don’t expect it to be – to ever get back to those levels, primarily because we don’t want to grow Conn’s financing at the expense of taking sales from lease-to-own or one of the other segments on the credit spectrum. And as you heard me in both our comments as well as in some of my answers to the questions here that we are really – as we are taking risk here, we are doing it in a very different fashion than we have historically, certainly, in the 6 years that I have been here with the company and that we are not going deeper in the credit spectrum because what we don’t want is we believe we don’t want an issue in the future where, because of risk we are taking, that it comes back to bite us from a credit standpoint down the road. So, our intention is to make – to push that credit risk on those lower credit quality customers to the lease-to-own partners and for us, with our Conn’s financing to go with a greater share – to capture a greater share of wallet with a higher credit quality customer."
}