{
    "symbol": "CONN",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-29 14:32:02",
    "content": " Throughout the fiscal year, we successfully navigated unprecedented supply chain challenges and the ongoing COVID-19 pandemic, including the emergence of the Omicron variant to produce record annual earnings of $3.61 per diluted share and the strongest annual retail sales in five fiscal years. According to FICO, U.S. consumers with FICO scores above 650 represents 75% of the population, yet our fast and reliable customer segment represented only 39% of our total retail sales in fiscal year 2022. And we believe that our in-house lease-to-own offering will add approximately $25 million to annual operating income once the program is mature, helping us achieve our fiscal year 2025 revenue and EBIT margin goals. On a consolidated basis, total revenues were $402.5 million for the fourth quarter, representing a 9.4% increase from the same period last fiscal year. On a non-GAAP basis, adjusting for certain charges and credits, we reported net income of $0.33 per diluted share for the fourth quarter compared to $0.91 per diluted share for the same period last fiscal year. Looking at our Retail segment in more detail, total retail revenues for the fourth quarter were $333 million, a 13% increase from the same period last fiscal year. As a percent of retail sales, SG&A expenses were 31.6% for the fourth quarter, compared to 32.2% for the same period last fiscal year. Retail segment operating income was $10.9 million, compared to $12.7 million for the same period last fiscal year as higher retail sales and improved SG&A leverage were offset by lower retail gross margin. The $14.2 million increase from the prior year period was due to higher variable operating expenses associated with sales growth, additional new stores and an increase in advertising costs as we lapped prior year reductions due to the COVID-19 pandemic. As a result, the transition from third-party lease-to-own sales to in-house lease-to-own revenue will negatively impact revenue and profitability in the first two years of the transition beginning in the fourth quarter of this fiscal year. For fiscal year 2023, we expect the combination of the different revenue accounting and incremental costs associated with the lease-to-own business to reduce operating income by $15 million to $20 million. As in-house lease-to-own sales grow in fiscal year 2024, we expect our operating income to be negatively impacted by approximately $25 million to $30 million driven by these two factors. However, by fiscal year 2025, we believe our in-house lease-to-own offering will add approximately $25 million to annual operating income."
}