{
    "symbol": "MYFW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-21 14:24:03",
    "content": " With the strong loan growth in the third quarter driving increase in net interest income, expansion in our net interest margin and a higher level of efficiencies, we were able to generate a substantial increase in net income and earnings per share, despite the unfavorable environment that continues to impact our largest fee generating business. While this was down a bit from the prior quarter, the average rate on new production increased by more than 100 basis points, so we're still generating strong production without compromising on pricing. We're also seeing payoffs start to moderate, so more of our loan production is translating into net loan growth and total loans held for investment increased $205 million from the end of the prior quarter. Turning to trust investment management on slide seven, our total assets under management decreased $359 million from the end of the prior quarter, due to market declines, which more than offset the continued inflow we're seeing from new accounts. Our total gross revenue increased $2.4 million or 8.8% from the prior quarter, which is entirely driven by higher net interest income resulting from our strong loan growth. Our net interest income increased 13% from the prior quarter, primarily due to higher average loan balances and an increase in our net interest margin. Our net interest margin increased 40 basis points in the third quarter to 3.75%, excluding the impact of PPP fees and accretion on acquired loans, our net interest margin increased 47 basis points to 3.77%. Turning now to slide 10, our non-interest income decreased 7% from the prior quarter, primarily due to lower net gain on mortgage loans. This put our  (ph) to adjusted total loans at 77 basis points, which was relatively consistent with the end of the prior quarter and reflective of our strong credit quality and the low level of losses that we have experienced in the portfolio."
}