{
    "symbol": "MYFW",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 18:47:08",
    "content": " We typically see some level of seasonality in the first quarter that impacts our level of loan production, which definitely occurred again this year, particularly in January and February, we’ve also seen an increase in the competitive environment in our markets somewhat driven by new entrance in acquisition activity. Particularly ahead of the coming interest rate increases, we believe that we’re best served by not putting low, long-term fixed rate loans on our balance sheet even if that costs us a bit in terms of loan growth and net interest income in the short-term. This momentum has continued and based on the current trends, we’re seeing loan production – the trends we’re seeing in loan production to start second quarter, we believe that we’ll have good opportunities to redeploy our assets excess liquidity into higher yielding assets in the coming months. As I mentioned earlier, we’re seeing a higher level of loan production and to start the second quarter with the diverse lending platform, we have the ability to be flexible and pivot to whichever asset classes are seeing the strongest demand in presenting the most attractive risk adjusted opportunities at any given point in time. I know payoffs burden that number this quarter, I think in the past, we’ve talked about kind of a mid teams level of loan growth kind of the near/longer term for y’all. Well, I think the starting point has to be, a point that we’ve made before Brady, which is we’re just small enough that a change in the number of payoffs that we get in a quarter, like we saw in Q1 or the amount of loans that actually get funded in a quarter, just has an outsize impact on that quarter’s reported number. And like you say, I mean we’ve been carrying $500 million in the first quarter, mostly at a negative spread because even, that’s a close to zero you’re by the time you’ve pay, you have to, I see insurance, you’re getting zero on it. So excluding mortgage, which does seem to cause a little bit of variation depending on the type and mix of those, our yields are about improving and are about a little bit above 4% on the new loans that we’ve put in the first quarter. I also think that our loan demand is high enough now that we have the luxury to have this pricing and discipline pricing in terms that I talked about, like if you’re fighting for the last dollar growth, maybe that’s harder to have the backbone, but I think with the amount of demand that we’re seeing and the pipelines we’re seeing and the success of our teams and producing these opportunities and maintaining price discipline through, the relationship things we’ve talked about before, and it seems like we’re able to do a good job of that and still grow. Our success in fact was probably neutral because of the liquidity that we already had, but for the longer term, I think that’s going to be a really nice benefit, overall the only real pricing pressure we’ve seen on deposits so far is about 260 million of our deposits are what we call trust cash, which is the cash that’s maintained in trust and investment management balances here. So, if we just do some back of the envelope math, if you had $300 million of excess liquidity or to loan that out at 4% knock off 25% for taxes, that gives you roughly an extra dollar per share of earnings after the first quarter of origination, when, when you'd have your provision that would be associated with it, is that the essentially the right way to think about it, that there’s another buck of earnings potential built into the business as you redeploy just the existing excess cash? The expense guidance kind of clean quarter after the DP conversion of 19.5 million to 21 million per quarter, that seemed like a rather large range to me, because on the low side or high side, it’s a difference basically of like $0.45 a share. I mean, I don’t think anybody’s really proven that, but I do think 1.25 is a very achievable number for us, 1.5 seems like an achievable number, as we grow this thing out, depends on how many new offices we’re opening, depends on how many new people we’re hiring this quarter or next quarter. And so, we have our targeted list and we’re working them and if they decide they want to sell, hopefully they’ll be familiar with us as a really attractive buyer for them that has really good experience in successful acquisitions and being a really good partner post acquisition, which I think, our folks from Simmons would tell you from two years ago, our folks from EMC, the mortgage company would tell you from three years ago."
}