{
    "symbol": "MYFW",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 11:18:13",
    "content": " Along with the higher rates that we're seeing on earning assets and deposit costs that remain well controlled, we saw a significant expansion in our net interest margin in the second quarter. While we had a strong balance sheet growth and a significant interest in -- significant increase in net interest income, our earnings were lower than the prior quarter due to unfavorable market conditions that resulted in a decline in both wealth management revenue and our net gain on mortgages sold. While we expect to see a larger increase in our cost of deposits going forward, given our continued opportunities to grow the loan portfolio and our asset-sensitive balance sheet, we expect to continue seeing expansion in our net interest margin, although not at the same level that we had in the second quarter. Our noninterest income decreased 19% from the prior quarter, primarily due to lower trust and investment management fees resulting from lower AUM caused by market performance and the lower net gain on mortgage loans. As rates increase, it's likely we'll start to see lower demand for commercial real estate loans, but we've built a well-diversified loan production platform, which provides us with the ability to be flexible and focus on whatever asset classes are experiencing the strongest loan demand and present the most attractive lending opportunities at any given point in time. The strong loan production we experienced in the second quarter also increased our unfunded commitments by 14% to $802 million, so that represents another potential catalyst for loan growth if utilization rates increase. If economic conditions and loan demand remains strong, we feel we're very well positioned to continue generating profitable growth, particularly as we start to see larger contribution from some of our newer markets. The strong momentum we see in asset growth and loan growth and earning assets and then you put on top of that, the NIM improvement that we've seen, I mean, that's going to continue to have a significant impact on the earnings in the second half of the year. I mean I talked about -- if you just -- if you take the fee business out altogether and you just look at our net interest income over our operating -- total operating expenses, we've seen really strong operating leverage growth in Q1 and again in Q2."
}