{
    "symbol": "RIBT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 21:57:05",
    "content": "  Operator: Greetings, and welcome to the RiceBran Technologies Fourth Quarter and Full Year 2022 Earnings Call and Webcast. Good afternoon, everyone, and welcome to the RiceBran Technologies Fourth Quarter 2022 Financial Results Conference Call. And for the first time, Golden Ridge delivered a full quarter of positive contribution to adjusted EBITDA in the fourth quarter. We delivered another $10 million plus quarter with year-over-year growth of 32% in the fourth quarter and 34% for the year. However, while adjusted EBITDA losses declined sequentially and year-over-year in the fourth quarter, largely due to a significant improvement at Golden Ridge. Total revenue was $10.6 million in the fourth quarter of 2022, a 32% increase from $8 million in the fourth quarter of 2021. Total revenue was $41.6 million in 2022, a 34% increase from just over $31 million in 2021. Gross losses were $87,000 in the fourth quarter of 2022, down from gross losses of$170,000 a year ago. Gross losses were $759,000 for the full year 2022, a $1.2 million decline from gross profits of $442,000 in 2021. SG&A in the fourth quarter declined 5% to $1.5 million from $1.6 million a year ago. Operating losses declined 71% in the fourth quarter to $1.6 million from operating losses of $5.6 million in the fourth quarter of 2021. Operating losses for the year fell 31% to $7.3 million from $10.6 million in 2021. Operating losses in the fourth quarter and full year of 2021 included $3.9 million in noncash charge for goodwill impairment. Net loss for the quarter was $1.7 million or $0.28 per share compared to a net loss of $5.4 million or $1.04 per share a year ago. Net losses in 2021 included a gain of $1.8 million in the first quarter or forgiveness of the SBA PPP loan and the aforementioned $3.9 million charge in the fourth quarter for goodwill impairment. Adjusted EBITDA losses were $654,000 in the fourth quarter compared to adjusted EBITDA losses of $806,000 in the fourth quarter of 2021. Adjusted EBITDA losses for the full year were $3.8 million in the fourth quarter -- I'm sorry, for the full year compared to adjusted EBITDA losses of $2.9 million for 2021. Lower losses in the fourth quarter stemmed from a significant improvement in contribution from Golden Ridge, while the decline for the year reflected the decline in contribution from our value-add SRB derivatives business. Total cash was $3.9 million at the end of the year, down from $5.8 million at the end of 2021 and $4.4 million at the end of the third quarter of 2022."
}