{
    "symbol": "RIBT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-30 15:37:04",
    "content": "  Operator: Good day, ladies and gentlemen, and welcome to the RiceBran Technologies First Quarter 2022 Earnings Call and Webcast. Thank you, operator, and good afternoon, and welcome to the RiceBran Technologies first quarter 2022 financial results conference call. Hosting the call today are Peter Bradley, Executive Chairman; and Todd Mitchell, RiceBran's Chief Operating Officer and Chief Financial Officer. I want to remind participants that during the call, management's prepared remarks may contain forward-looking statements that are subject to risks and uncertainties. And therefore, we refer you to a more detailed discussion of these risks and uncertainties in the Company's filings with the SEC. In addition, any projections as to the Company's future performance represented by management's estimates as of today, April 28, 2022, and the Company assumes no obligation to update these projections in the future as market conditions change. This webcast and certain financial information provided on the call, including reconciliations of non-GAAP financial measures to comparable GAAP financial measures, are available at ricebrantech.com on the Investor Relations page. During 2021, we successfully developed and began implementation of a strategy to put RiceBran on a path to sustainable growth and profitability. You have begun to see these benefits in the shift in our financial results as revenues are growing, and we move towards positive adjusted EBITDA. Our strong first quarter results reflect structural changes within the Company and much progress, putting the mistakes of prior management behind us as we build the platform for profitable growth. We have successfully increased the focus on value-added products, including new product introductions and strengthening our market reach with our distribution agreement with AIDP. With these structural enhancements complete, I am confident 2022 will be a year of further progress as we accelerate this transition, fully aligning our organization and focus on profitability and enhance our go-to-market strategy with further partnerships. We have a streamlined operation and addressed the issues that have hampered execution, so incremental revenue should continue to leverage as further improvements in profitability enable us to transition to positive adjusted EBITDA as revenues continue to grow and our product mix which shifts away from more of our commodity business. With the Company's transition well underway and our focus moving towards a value-added ingredient strategy, we have reached an inflection point where a change in our governance makes sense. Jean is the Founder of Heggie & Associates, a food industry consultancy that provides strategic marketing counsel to companies and trade associations involved in consumer food, food ingredient and the ag-tech sectors. Jean retired from DuPont Nutrition & Biosciences after a 33-year career in food ingredient marketing, culminating and serving as Global Marketing Lead for DuPont's Protein Solutions business unit. He has served in sales and marketing leadership roles with ChromaDex, a bioscience company focused on healthy aging nutraceuticals; and as COO of Natreon, a proprietary botanical ingredient company. Will was also Global Head of Marketing of Human Nutrition and Health for DSM Nutritional Products, a leader in the development of new nutraceutical ingredients and the world's largest manufacturer of letter vitamins and Omega-3 fatty acids. Jean and Will will bring RiceBran significant consumer-facing sales, marketing and product development expertise. Their expertise and relationships will provide -- will be invaluable as we develop and go to market with value-added ingredient offerings in the companion animal, equine and human market. This transition is being driven by stronger sales initiatives, higher capacity utilization and better operational and logistic execution, all of which translates into enhanced customer relations, which will serve to -- which will continue to serve as a positive catalyst for growth and transition to positive adjusted EBITDA. I'll give you some more detail on our progress in a minute, but let's first have Todd run you through the quarter in more detail. As a result, adjusted EBITDA losses narrowed to $385,000. And crucially, liquidity remained strong with $5.9 million in cash on the balance sheet at the end of the quarter, up modestly from year-end. But we've put in place strategies to mitigate these issues, and we believe the first quarter results demonstrate that we're on the right path. With that said, let's look at the quarter's numbers in a little bit of greater detail. Total revenue was $10.6 million in the first quarter, up 23% from $8.6 million a year ago and 31% from $8 million in the fourth quarter. Strong growth in the quarter was driven by higher core SRB sales and strong results from both MGI and Golden Ridge, while value-add SRB derivative sales declined modestly year-over-year really due to the timing of large customer orders and a real tough comparison year-over-year. We generated a positive gross profit of $502,000 in the first quarter, which compared to a gross profit of $670,000 a year ago. Recent price increases have offset higher input costs, which was higher volumes for our core SRB business. We're seeing some upward pressure on certain larger items, including compensation and insurance, but we've been able to offset these increases with lower expenses on outside consultants and legal. By and large, SG&A has stabilized in the range of $1.7 million, $1.8 million per quarter and should remain there in the foreseeable future. Operating losses in the first quarter were $1.2 million, up slightly from $1.1 million in the same quarter a year ago but down meaningfully from about $1.7 million in the fourth quarter, if you exclude our goodwill write-down in that quarter. Net loss for the first quarter was $1.5 million or $0.03 per share compared to net income of $591,000 or $0.01 per share a year ago. Remember, net income in the first quarter of 2021 included a $1.8 million benefit from the forgiveness of our PPP loan. Adjusted EBITDA loss was $385,000 in the first quarter compared to a loss of $158,000 in the first quarter of 2021. This decline reflected the year-over-year drop in gross profit but again compares favorably to adjusted EBITDA losses of $806,000 in the fourth quarter. Indeed, it compares favorably to every quarter in 2021, except for the first quarter. We ended the quarter with $5.9 million in cash, up slightly from year-end due to favorable working capital trends in the quarter with $190,000 in cash flow from operations during the quarter. Our focus on those products and markets where the value we deliver is recognized, which, in turn, drives higher margin. The first business is derivative product, and you have seen us strengthen our market reach with the AIDP partnership. The second business is our core SRB product, where we focused on expanding penetration into human food and companion animal applications. This has included the launch of new SRB variants, and you will see further additions to our product line through the rest of 2022 to deliver further value to capture an increased share of this opportunity that exists to replace soy, corn and rice-derived ingredients. Linked to our continued focus on manufacturing supply chain efficiencies, we expect the core SRB business to deliver meaningful profitable growth. At MGI, the demand for specialty grains continues to be exceptionally strong, and we are completing long overdue upgrades at the mill to increase capacity and efficiency and broaden the range of products offered. Once these upgrades are completed, MGI will be able to consistently deliver high-quality products valued by our target market, three primary focus market which offers significant upside opportunity. While we have been pleased with our year-over-year improvement in our Golden Ridge facility, it has become clear to us that rice milling should not be a strategic focus for the Company. With the strategic initiatives I've outlined, our expectations are to see each of these business deliver solid growth despite the challenges in the supply chain. But how that business is trending and if you can quantify at all maybe year-over-year improvement at MGI, that would be great. I think our -- the improvements that we've seen at MGI year-over-year are very material, very high double digits, both on the top line and the bottom line. I think that's come from -- there's a certain degree of price inflation in that business, but a lot of it has come from volume and productivity enhancement. And I think that we've done a lot with the business leader there and the team where, in fact, we'll probably be able to mitigate a lot of the historical seasonality you've seen in that business. The update on trends that you're seeing post quarter end and through Q2, especially as we look at some of this value-add SRB. And I think we'll see that business begin to pick up, just on looking at the pipeline and the order book there as we go into the second quarter and the latter half of the year. I think with where our revenue is trending, slight improvements in the mix of the product, and we may be able to bridge that gap. To be honest, it's not for us to comment on Continental Grain's investment strategy, and Ari got other things to do for the Continental portfolio. But I think it's not our place to comment on that, on their investment strategy. I think if you look at what we are doing with the shift in strategy towards specialty ingredients as opposed to being a larger grain operation, I think you can put two and two together there. I think in these challenging times here in the country as a whole, we had a very good quarter. My first question has to do with MGI a little bit that, Peter, last year, you've mentioned the possibility on our first quarter, which ended here, of a pet food combining oats and rice bran. I think we will head down that route, but MGI's core proposition has been so strong. At the moment, we've got more business opportunity that we can handle just a standard product. And with the horse feed, which you always had, it's never been made by RBT or by their customers, so -- and then one more MGI question related to that is that Agweek magazine had an article, and they talked about how the barley is really becoming a demand by pet food companies, 13% protein, and if it sits very well with the animals. And what we're finding in that whole pet food space is that there is strong interest, not just in barley, but also in standard SRB because standard SRB has got even slightly higher protein and has some other benefits. You just mentioned the possibility of doing -- partnering with products with the big India corporation, Narula, who owns the rice mill in Indonesia -- or in Thailand, which has been selling organic brand. I just want a comment, having those new Board members, it sounds like one of them might really help us out with their -- if they're into nutraceuticals and pharmaceuticals, food and all, everything that we handle. As we go to the specialty food ingredients business, it's very different from commodity grain market. And while obviously, as you're very well aware, that's my background. And as you can imagine, I look forward to each conference call, which is very positive on the future, and I'm still waiting for us to quite to get there. I think if you look at the trends, they're headed positively, and I think it's incumbent upon us to deliver them for you. Since this new Board has taken over, in the main, you have under promised and overdelivered, so it's certainly a good trend. Of that $10.6 million of revenue, what percentage of that would be derivatives? We don't break out our businesses, so I'm not going to speak to that because that's not something that we disclose. Sales to AIDP, I would be willing to say were meaningful in the quarter."
}