{
    "symbol": "WERN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-07 21:49:02",
    "content": " Together, our durable dedicated fleet, which includes 63% of TTS trucks and our growing logistics business account for 69% of fourth quarter revenues and is expected to exceed 70% in 2023. Revenues grew 13% due to 5% growth in average trucks, 1% higher revenues per truck, a $41 million increase in fuel surcharges and logistics revenues growth of $29 million, which includes eight weeks of the acquired ReedTMS business. In total, Logistics achieved adjusted operating income of $8 million with a 3.8% adjusted operating margin, down $3.9 million year-over-year and an improvement from third quarter of $2.4 million or an 80 basis point sequential increase. And then I guess maybe for a longer-term question, Derek, if I go back to, I think, last year in the fourth quarter call, you outlined a plan to grow Werner's revenue by 10% a year on a CAGR basis for the next five years. We also indicated at the time, and I'll reiterate today, there's going to be years that don't fall into that 10%-plus type revenue growth because you've got to be smart and disciplined and kind of read the market that you're in. This year, obviously, expectations at this point, just doing the math on the recent acquisitions, we've got a really good head start to that 10%-plus number, but we're going to have our eye this year on cost control, synergies through the implementation that's through the integration probably most importantly, product and portfolio enhancement through these additive acquisitions that we've done and continuing our larger strategy of just building out yet another layer of defense for some of the economic ups and downs and then proving it out. So, if you have only $30 million of gains, you're going to grow the fleet 4% and if it's $50 million, 1%. Looking at the revenue per truck per week and I said it's off a tough comp from last year, but 0% to 3% seems like it's going to be tough to exceed, inflation this year when you talk about driver pay as part of that."
}