{
    "symbol": "WERN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 02:59:09",
    "content": " For third quarter, revenues increased 18% to $828 million, adjusted operating income increased 8% to $79.5 million, and adjusted EPS increased 14% to $0.90 per share. Werner Logistics achieved lower operating income in third quarter compared to a very strong performance in the second quarter due to fewer premium pop-up freight opportunities, intermodal customer and market challenges and softening demand and startup cost in final mile. Revenues grew 18% driven by 4% more trucks, 5% higher revenue per truck, a $50 million increase in fuel surcharges and $29 million of logistics revenue growth. TTS revenues increased 18% due to 4% more trucks, 8% higher rates, higher fuel surcharges, partially offset by 3% lower miles per truck due to a 3% shorter loaded length of haul and a softer freight market. The One-way Truckload revenues net of fuel declined slightly as average trucks increased 1%, rate per mile increased nearly 3% and miles per truck declined 4%. For fourth quarter, we expect our One-Way Truckload revenues per total mile to be in the range of negative 3% to flat compared to fourth quarter a year ago. And so as we look into fourth quarter and you think about the nearly unanimous commentary on a muted peak season with the backdrop of high fuel, high insurance, high labor and rising interest rates, I think you are going to see an increase that will kind of accelerate the process thatâ\u0080\u0099s already underway. I mean, again, looking back at a couple of prior cycles and really looking at the last 8 years, I mean, dedicated based on the type of business we do, how difficult it is to accomplish, how defensible it is because of its complexity, weâ\u0080\u0099ve seen an environment where the type of customers we work with that are winning in their space is continuing to grow even during recessionary times, they need those fleets. And then the last piece thatâ\u0080\u0099s mixed in there is honestly, good news that in the short-term doesnâ\u0080\u0099t look so great, and thatâ\u0080\u0099s about $1 million of start-up costs in Final Mile because of the success of that dedicated Final Mile product that we have and the number of implementations that we endured in the third quarter that donâ\u0080\u0099t start â\u0080\u0093 that start to reap benefit in Q4 and then certainly going forward. The other thing I would point you to is that we do expect dedicated revenue per truck per week year-over-year to still, despite all of this backdrop we have been talking about, the largest portion of our fleet, itâ\u0080\u0099s still our expectation will be up 6% to 8% fourth quarter this year versus a year ago."
}