{
    "symbol": "WERN",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-04 01:20:03",
    "content": " First quarter revenues increased $148 million to $765 million, with 6% truck growth, higher freight rates, increased steel surcharges and strong logistics revenue growth. TTS revenues increased by 21% due to 15% higher rates and $32 million of increased fuel surcharges, partially offset by 5% lower miles per truck. The miles per truck change was due to a lower length of haul resulting from our ECM regional fleet acquisition in July, higher driver turnover, fewer team drivers and the January impact of macro PTS improved its adjusted operating ratio net of fuel by 220 basis points to an 83.6%. Let's compare our superior relative financial performance in the last freight moderation period of 2019 against the strong freight market of 2018, Warner was only one of a few truckload carriers that produced earnings per share growth in 2019 versus 2018. Werner Logistics produced $5.6 million or 158% improvement of adjusted operating income to $9.2 million, resulting from strong revenue growth and 230 basis points of adjusted operating margin expansion. Dedicated revenue per truck per week increased 7.3% in the first quarter, ahead of our expectations due to customer rate increases to offset inflationary cost pressures. For second quarter, we expect our One-way Truckload revenues per total model increased in the range of 14% to 17% over the same period last year. Not just in Dedicated, but even on the one-way truckload side, we now have at the right point in the cycle, we now have over 1/3 of that network under long-term agreements that we've spent many, many quarters to set up and accomplish -- and we think they're fair and equitable for both sides, both the customer and us, but they do give us a degree of insulation as we look forward. And as I previously indicated, we think there's a fairly strong possibility that June ends up returning to pre-COVID Junes, which was an opportunity for an end-of-quarter push with very strong booking levels that really were muted somewhat in the last 2 years because every month was so strong, you didn't see the sudden or noticeable uptick in June that used to exist for many, many years."
}