{
    "symbol": "IT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 11:16:11",
    "content": " Q2 research revenue were 17% in the second quarter, total contract value growth was 15%, retention remained very strong. Research revenue in the second quarter grew 14% year-over-year as reported and 17% on an FX neutral basis, driven by our strong contract value growth. Global business sales contract value was $936 million at the end of the second quarter, up 23% year-over-year, which is above the high end of our medium term outlook of 12% to 16%. Second quarter consulting revenues increased by 14% year-over-year to $121 million, on an FX neutral basis revenues were up 20%. Consulting contribution margin was 42% in the second quarter up 120 basis points versus the prior year with better than expected revenue, higher utilization rates and a mixed benefit from strong growth in contract optimization. SG&A increased in the quarter as a result of increased hiring in sales and G&A functions, higher commission expense, following strong CV growth in 2021 and a $12 million one-time real estate charge. Our conferences booking for both the exhibitors and attendees was very strong and that's been reflected in our guidance going forward, I believe the consulting business had one of the best quarters we've ever had with revenues of 20%, backlog up 45%. Your line is now open. Your line is now open. And so the fact that we've grown our GBS head sales headcount faster over time, not with this quarter, but if you look at like over the last since 2019, we've grown our GBS sales headcount at compound growth rate of about 60% a year, I'm sorry about 5% a year. What does it look like when in-person conferences come back into the portfolio and what does it look like as we catch up on headcount and then continue to grow and invest to support and sustain future growth and so the way to think about that low-twenties number is yes, it's an update but it's also a view towards what do we think the underlying margins of the business are that we can modestly expand on. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}