{
    "symbol": "IT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-01 12:22:03",
    "content": " We also delivered better than planned EBITDA margins, reflecting the strong third quarter, enthusiastic demand for our in person conferences and continued success in balancing cost discipline with investing for future growth we are again increasing our 2022 guidance. As we discussed the last three quarters 2021 research performance benefited from several factors including QBH tenure mix, NCVI phasing within the quarters and year, record retention rates and strong non-subscription growth. With 12% to 16% research CV growth, we will deliver double digit revenue growth with gross margin expansion sales cost growing in line with CV growth and G&A leverage, we can modestly expand margins. Your line is now open. I thought for Jene, you talked about 80% associate growth and having the capacity you need and being caught up on hiring but then it seemed like in Craigâ\u0080\u0099s comments, youâ\u0080\u0099re still calling up some areas where youâ\u0080\u0099re still in the process of doing catch up hiring and youâ\u0080\u0099re maintaining the low 20s underlying margin target despite seemingly run rating above that on a seasonally adjusted basis. And then, obviously notable, the big step up in GTS quota bears, I guess, just to what extent, are you seeing signs of unmet demand that youâ\u0080\u0099re fulfilling, and I donâ\u0080\u0099t know if thatâ\u0080\u0099s showing up in the new business sold metric with GTS which also has the tough comp, just trying to understand to what extent maybe the 12%, or 12.5% whatever was CV growth in GTS has been governed down because of some sales capacity constraints that youâ\u0080\u0099re addressing versus to what extent this is about getting out ahead of demand and building capacity into whatâ\u0080\u0099s still a good demand momentum environment. Your line is now open. Your line is now open. Your line is now open. So weâ\u0080\u0099re focused on ending the year of double digit in a quarter bearing headcount, again, really making sure that weâ\u0080\u0099re set up to roll into 2023 with full territories and a more tenured sales force etc. There can obviously be a lot of puts and takes, but what Iâ\u0080\u0099d say is we expect to end the year for both GTS and GBS with strong double digit quarter bearing hires growth on a year-over-year basis. Your line is now open. Your line is now open. And that through the combination of the investments weâ\u0080\u0099re making, the size of the market opportunity opportunities in productivity, etc, that we can grow the business, the top line at double digit growth rates, and modestly expand margins from that underlying margin in the low 20s. To summarize todayâ\u0080\u0099s call for the third quarter weâ\u0080\u0099d really another strong performance across the business, achieve double digit growth in contract value revenue EBITDA and EPS with strong growth in all practices, all industry sectors across every size client and in every region."
}