{
    "symbol": "CLVT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 15:07:09",
    "content": " Fourth quarter revenue was $675 million, an increase of $115 million compared to the same period last year, driven primarily by inorganic growth from the ProQuest acquisition as well as a 0.5% organic growth, both of which were partially offset by a substantial foreign exchange translation headwind as the U.S. dollar remained strong against primarily the pound sterling and euro compared to the same period last year. Full year revenue was $2.66 billion, an increase of $783 million for growth of more than 40%. Adjusted diluted EPS, which excludes the impact of onetime items like the impairment, was $0.22 in Q4, a $0.02 improvement sequentially over Q3 and a $0.01 decrease over Q4 of last year, bringing the full year to $0.85, a $0.13 or 18% increase over 2021. Operating cash flow was $137 million in the quarter, an increase of $119 million over Q4 of 2021, bringing the full year to $509 million, which is an increase of $185 million over last year. When we look at the full year top and bottom line growth compared to the same period last year, it was driven by 4 key factors: first, organic growth of 2.6% added nearly $50 million to the top line and converted to profit at a 35% margin. Free cash flow was $91 million in the fourth quarter, an increase of $105 million over last year's fourth quarter and topped $300 million for the full year, which was just over $100 million higher than the full year of 2021. For the full year, the profit growth I outlined on the prior page was partially offset by higher interest cost from the debt used to fund the ProQuest acquisition, higher cash taxes on the increase in taxable earnings, higher working capital requirements and the increased capital spending largely from the ProQuest business. We do anticipate about a 75% profit conversion on the full year revenue growth of approximately $20 million at the midpoint of both ranges as a result of the carryover impact of the ProQuest cost synergies, which should help drive nearly 50 bps of margin expansion. Our accelerating organic growth, the divestment of the MarkMonitor business, the carryover impact of the ProQuest cost synergies and foreign exchange will drive this year's expected top and bottom line growth over last year. Our working capital requirements are expected to level off this year, yielding an improvement of about $65 million, augmenting the profit growth and lower onetime costs partially offsetting by the cash interest increase, leading to an operating cash flow improvement of about $230 million. But really, much of the improvement next year is going to come in Life Science & Healthcare as we continue to see the recovery in the consulting practice that I highlighted as well as stronger execution compared to a pretty challenging last year in portions of our transactional business in that segment."
}