{
    "symbol": "VEV",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 19:35:09",
    "content": " Revenue totaled $14.9 million for the six months ended June 30, 2022, as compared to $37.1 million in the six months ended June 30, 2021. Gross profit in the quarter ended June 30, 2022 totaled $1 million, or 8.7% of revenue, as compared to $1.7 million, or 11.1% of revenue, for the quarter ended June 30, 2021. Gross profit totaled $1.2 million, or 8.3% of revenue for the six months ended June 30, 2022, as compared to gross profit of $5.1 million, or 13.8% of revenue for the six months ended June 30, 2021 Gross margins were affected by product mix and the low volume of buses delivered. Cash provided by operating activities in the six months ended June 30, 2022 totaled $0.2 million, as compared to cash provided by operating activities of $12 million in the first half of 2021. Net loss in the quarter ended June 30, 2022 was $3.8 million, or $0.10 per share, as compared to a net loss of $0.3 million, or $0.01 per share, in the second quarter of 2021. Net loss for the six months ended June 30, 2022 was $6.7 million, as compared to net income of $1.3 million for the six months ended June 30, 2021. Adjusted EBITDA loss for the three months ended June 30, 2022 totaled $1.3 million, as compared to an adjusted EBITDA of $0.2 million in the same year ago quarter. Adjusted EBITDA loss for the six months ended June 30, 2022 was $3.3 million, as compared to an adjusted EBITDA of $2.3 million for the six months ended June 30, 2021. Cash and cash equivalents as of June 30, 2022 totaled $9.4 million, as compared to $4.4 million as of December 31, 2021. Looking ahead, our expanded dealer network, new facility coming online and strengthen supply chain are position us for a ramp up of productions and significant growth in the months ahead as we deliver upon our $90 million U.S. backlog. No, I think Ferndale the only issues that weâ\u0080\u0099ve seen there and what our contractors brought to our attention is that switch gear and theyâ\u0080\u0099re trying to work with itâ\u0080\u0099s a large U.S., company thatâ\u0080\u0099s supplying that switch gear, and theyâ\u0080\u0099re even trying to look to see if they can find a use switch gear for us to put in there."
}