{
    "symbol": "BXSL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 12:37:02",
    "content": " Net investment income increased 29% quarter-over-quarter to a record $0.80 a share, which represented a 12.4% annualized net investment income yield on third quarter NAV. In September, we raised our regular quarterly dividend by 13% to $0.60 a share, which represented a 9% annualized yield based on September 30, NAV. So first, the third quarter represents the beginning of a material expansion of our earnings, BXSL out earned its dividend by 33% driven by a favorable asset liability profile, with virtually 100% floating rate investments and 58% fixed rate debt at an average coupon of less than 3%. September 30, base rate of 3.5% had been in effect for the entire quarter, we estimate that third quarter NII would have been 13% higher or an additional $0.10 per share. In the third quarter, net investment income was $132 million, or $0.80 per share, which was up 29% from $0.62 last quarter. GAAP net income in the quarter was $96 million, or $0.58 cents per share, up 23% quarter-over-quarter despite 36 million of net realized unrealized losses, largely resulting from unrealized mark-to-market declines as credit spreads continue to widen. We ended the third quarter with $9.7 billion of total portfolio investments, which are approximately 100% floating rate at a weighted average yield of 9.1% compared to $5.5 billion of outstanding debt with a weighted average cost of just 3.7%. During the quarter, we bought back nearly 7 million shares for approximately $164 million at a weighted average price of $23.82, representing an 8% discount to NAV. Lastly, turning to the outlook, we believe we are very well positioned to grow earnings meaningfully in the coming quarters as rates on our nearly 100% floating rate investments continue to reach that higher. As Brad mentioned, we estimate our third quarter NII per share would have been $0.10 higher, or $0.90 total, if the average base rate would have been at the September 30 level for the entire quarter, all else being equal. And we're seeing so far quarter-over-quarter EBITDA growth of around 4% or 5% in our software sector, average EBITDA of those business is $184 million."
}