{
    "symbol": "VLDR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 17:46:05",
    "content": " With me on the call today are Dr. Ted Tewksbury, Velodyneâ\u0080\u0099s Chief Executive Officer and Mark Weinswig, Chief Financial Officer. On today's call, we will discuss Velodyneâ\u0080\u0099s second quarter fiscal financial results and provide an outlook for the third quarter. shortly after the market closed today, Velodyne issued a press release announcing its second quarter 2022 financial results. Please refer to our press release and our SEC filings, including our most recent 10-K and 10-Q for a discussion of factors that could cause the companyâ\u0080\u0099s actual results to differ materially from these forward-looking statements. Please also note unless otherwise stated, all results and projections discussed in this call are non-GAAP. Management provides non-GAAP metrics because it uses them for budget-planning purposes and for making operational and financial decisions and believes that providing these non-GAAP financial measures to investors as a supplement to GAAP financial measures, help investors evaluate Velodyneâ\u0080\u0099s core operating and financial performance and business trends consistent with how management evaluates such performance and trends. In addition, management believes these measures facilitate comparisons with the core operating and financial results and business trends of competitors and other companies. Billings of $12.5 million and revenue of $11.5 million, both came in within our guidance range for the second consecutive quarter. Demand for our products remained robust and thanks to the tireless efforts of our team, we were able to procure adequate quantities of critical components to meet the majority of our customers' requirements. I'd now like to share more about our second quarter business results, provide an update on the status of our transformation, and discuss our outlook for Q3. Velodyne continues to be one of the most diversified suppliers of LiDAR solutions with superior performance, power efficiency, and reliability as differentiators across key industries. In Q2, we saw increased customer traction across all three of our target markets; industrial and robotics, intelligent infrastructure, and autonomous vehicles, roughly half our sensors shipped into the industrial robotics and infrastructure markets. Within industrial and robotics, our LiDAR-based solutions are being used across an increasingly diverse set of applications including last mile delivery robots, truck docks, cargo handling and shipping. In infrastructure, use cases include traffic systems, vehicle to infrastructure networks and security, space and asset monitoring. Lastly, we are seeing demand for our solutions in virtual and augmented reality applications, such as mapping, entertainment and online interactions. The other 50% of units shipped in the quarter were for L4 and L5 robotaxis and autonomous shuttle customers, who depend on Velodyne's sensors to power their systems. During the quarter, we also expanded our customer reach with several new multiyear agreements. This proliferation of nonautomotive use cases validates our thesis that the first wave of commercial lidar adoption will be dominated by industrial automation, robotics and intelligent infrastructure. According to research firm, Yole, these segments are estimated to be a $2.8 billion per year total available market by 2026. As I enter my third full quarter as CEO of Velodyne, I continue to be pleased with the progress we've made on the turnaround plan I announced in the February earnings call. To highlight just a few examples, we accelerated the outsourcing of manufacturing to our low-cost contract manufacturer in Thailand with completion targeted for next year. This transition will significantly advance our efficiency in operations, allowing us to increase capacity, improve yields, reduce costs and expand gross margins. We defined our next-generation product road maps, encompassing highly differentiated sensors, software and solutions that we expect to be introduced over the next 18 to 24 months. Recently, we've implemented other changes that will enhance Velodyne's governance and leadership, including the appointment of Mark Weinswig as our new Chief Financial Officer, the addition of seasoned and highly experienced new Board members that will help management take the company to the next level and the redistribution of stock ownership, including a dramatic reduction in founder ownership. From day one, I have emphasized the priority of scaling lidar into a profitable, growing business, delivering attractive shareholder returns. As we look forward to the remainder of 2022 and 2023, we are taking steps to align our expense structure with our revenue expectations. Before handing the call over to Mark, I want to offer some commentary around our guidance for the third quarter. However, based on information from our suppliers, we expect supply challenges will extend into 2023 making it difficult for us to fully support all of this demand. Combining all of these factors, we expect billings to be between $10 million and $12 million and revenue to be between $8 million and $11 million. Our cost reduction initiatives, including the expanded use of outsourced manufacturers, improvements in operating efficiencies and the growth of offshore design center capabilities will deliver incremental improvements in the third quarter of 2022, with the full benefit expected to be realized in the second half of 2023. I'm very excited about joining the Velodyne team during this pivotal time, and I look forward to contributing to the next stage of Velodyne's evolution. We have a healthy balance sheet with approximately $230 million in cash and equivalents, providing us with the capital to execute on our strategic plan. In the first quarter, the accounting for the Amazon warrants had a non-cash impact of $5.3 million on our revenue. License and service revenue was $1.9 million, compared with $1.8 million in the first quarter. Billings were $12.5 million, compared with billings of $11.5 million in Q1. The second quarter was impacted by $2.2 million in losses from the discontinuation of a product line, as Ted discussed previously. GAAP operating expenses were $37.5 million, compared with $39.6 million in Q1. Non-GAAP operating expenses were $31.8 million, compared with $35.1 million in the prior quarter. With approximately $230 million in cash and investments at the end of the quarter, our capital and liquidity remains healthy. As we move through the year, I look forward to discussing the progress we are making in improving our financial performance as we balance the need to develop new products and invest in long-term growth while streamlining our operations to reduce our cash burn. Every day, we see exciting new examples of lidar being used to make our communities safer, our supply chains more efficient and our planet greener. With over 73,000 of our lidar sensors shipped to date into our three target markets, industrial and robotics, intelligent infrastructure and automotive, Velodyne is leading the way. We have completed a top-to-bottom analysis of the business and are investing in new programs to deliver the highest return on investment, while simultaneously implementing cost reductions to accelerate our time to break even. In closing, I want to thank our stakeholders, including investors, customers and suppliers for their continued support. Last quarter, the supply chain issues were pushing your sensor ASPs higher and the units were lower because of higher component costs and that increased your pricing power. Wondering how you're thinking about pricing trends for the remainder of 2022 because of those underlying components, the increasing cost of those components. First of all, maybe I can just provide a little bit of background on the supply chain because there's really two separate components here. The first being the company's specific component with respect to our specific FPGAs, as you're aware, some of those were nearing end of life, and we had to replace them and went through a design retrofit procedure to do that. In the meantime, as we scramble to procure scarce components, we do expect that ASP is could continue to go up in order to offset the increased price of components. For my follow-up, Ted, you mentioned when you joined the company that priority number one was to ramp Lidar adoption in the industrial robotics market. While at the same time, lower the cost for Lidar for the passenger vehicles, I believe you'd mentioned kind of below $30. And we're really seeding that market across an enormously broad range of applications, some of which I discussed in the prepared remarks. So as those designs start to go to production, we expect to see an inflection point where revenue will start to grow in the next one or two years in industrial robotics and infrastructure. As far as automotive is concerned, as you know, there are two segments there, there's the autonomous vehicles where there's a very good product market fit with the products that we already have. And as you saw, 50% of our revenue in the second quarter came from the AV segment, specifically robotaxis and autonomous shuttles. With respect to passenger vehicles, as we've talked about in past calls, our discussions with OEMs and Tier 1's in the automotive industry and we've talked to all of them. The feedback has been loud and clear that prices have to come down below $500, preferably in the $300 to $400 range. And we have designs in progress right now that we expect to be ready for production when those markets materialize, which is probably still two or three years away\n Thank you. As far as outdoor applications, we're seeing outdoor space monitoring, in parking lots and stadiums, community spaces, our IIS solution, for example, is a great solution to monitor the safety of public spaces, as well as intersections and traffic systems to monitor traffic, make traffic flows more efficient and also reduce congestion, greenhouse gases and all that good stuff. In addition, we see Sidewalk delivery applications, truck docks, the applications are immense, and it seems that they're growing every day. We see applications in agriculture, in mining, sending lidar into hazardous locations where people don't want to go, so that's just a quick few examples for outdoor applications. And then many others as well, including data centers, fulfillment centers, procurement centers the -- there's just an enormous range of applications in industrial and robotics. The first component being to increase our ASPs through full system solutions, as we've talked about before, that provide the hardware sensor together with the software and the ML capabilities and analytics to help business obtain insights. So we're not just giving a business, a point cloud, we're allowing them to actually derive business insights and analytics from our products. And then in parallel with that, as Mark talked about in the prepared remarks, we're realigning our cost structures with revenue, bringing down OpEx and identifying a lot of opportunities for cost efficiency across the organization. So curious, if you could give some more color around why the Velarray was exited and then what that means for your other products that are based on that architecture, that would be great. So as I mentioned earlier, we're rationalizing our products and development and really investing our limited engineering resources on those products that have the greatest chance of success, and that meet our requirements for profitability. The H800 was really one of our first solid state sensors, and we used it to test the market. And while H800 offered outstanding performance and power efficiency, we heard loud and clear from customers that they need much lower pricing. Second question, just thinking about the guidance going forward, I'm assuming you're down a little bit quarter-over-quarter, and I'm assuming that's primarily on the product side rather than the licensing side. Again, the strength is coming from industrial and robotics as well as the intelligent infrastructure with continuing contributions from AVs. And as I explained earlier, we are well underway in redesigning our Pucks to use new FPGAs, which we expect to get us out of this company specific supply constrained by the end of the year. We're getting great customer traction in industrial, robotics and intelligent infrastructure. We have a new game-changing product road map of high-performance, low-cost sensors and solutions."
}