{
    "symbol": "SKYT",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-15 20:50:52",
    "content": " With our quarterly revenue run rate now firmly established above the mid $40 million level, our gross margin performance in Q2 demonstrates that we have now suppressed that breakeven threshold and that incremental revenue growth will bring significant flow through to margins and profitability as we forecast sequential revenue growth in the forthcoming quarters. We are pleased with the progress made in Q2, so sequential improvement and a revenue pipeline, increased fab efficiency and output significant improvements to gross margin and EBITDA improving once again, closing in on breakeven at a negative $1.6 million for the quarter. Furthermore, now that we have established positive gross margins in the mid $40 million revenue range, as we add these incremental revenue drivers, we expect to see very significant gross margin flow through and I look forward to continuing to report on our progress towards our near-term and long-term gross margin objectives in the forthcoming quarters. First, I will remind you that wafer services revenue in the first quarter of 2022 included an accounting adjustment of $8.2 million for work in process inventory being recognized as revenue pursuant to the new frame agreement with Infineon. Moving now to ATS revenues, the nearly $30 million recognized in the quarter represents an 11% increase year-over-year and a 12% increase over Q1 2022. After excluding tool revenues for each period, ATS growth in Q2 was 20% year-over-year and 15% quarter-over-quarter, and effectively backfield all of the decline in wafer services revenue, which was expected due to the Q1 accounting adjustment. Also worth noting is that in Q3 to-date, we are now very close to our full Minnesota fab headcount target, which means we will see fewer additional labor costs that will need to be added above our expected Q3 run rate as we grow revenues from this new hire base in the mid to high $40 million range. So as you consider these three components of our cost structure, wafer services keeping the fab full, ETS adding significant accretion to margin as we increase the volume of R&D wafers moving through the fab, and about $8 million per quarter of cost that will either phase out or become absorbed as we grow these programs in the next few years. And we are still continuing make those investments for the long-term in the company, we talked about every quarter the importance of the Rad-Hard technology, and heterogeneous integration and afforded that we are doing both of those doing about continued investment, each quarter, the depreciation from the Rad-Hard, and the cost of revenue from Florida, $4 million to $5 million a quarter."
}