{
    "symbol": "SKYT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 23:02:08",
    "content": " The result was Q1 revenue upside of approximately $8 million, which was more than offset by higher costs attributed to the WIP inventory, resulting in a slightly negative reported gross margin for the quarter. While the accounting impact resulted in significant upside in our Q1 revenues, our prior growth forecasts for the full year had already reflected our expectations for better pricing and the recognition of all WIP revenue in Q1 is effectively a pull-in of expected finish wafer sales from the next couple of quarters. Importantly, for our long term model, our results and expectations are consistent with our prior target of achieving positive gross margins at the mid $40 million revenue level. To aid in the comparability of our quarterly results, our non-GAAP gross margin adjust for equity based compensation, which was immaterial before the IPO, as well as the impact of unusual or episodic items, such as the inventory write-off in Q4 and tool sales, which typically is pass-through revenue that unique to Q1 of last year was highly profitable. The expected revenue growth in 2022, coupled with our new baseline revenue level, and improved pricing, have established positive gross margins in the mid $40 million revenue range and positions as well for gross margin expansion later this year. Total revenue for the first quarter of 2022 was $48.1 million, which was essentially flat year-over-year and up 25% sequentially from the fourth quarter. First, ATS revenue in the first quarter of 2022 included just $1 million of tool revenue, compared to an unusually high $15.4 million of tool revenue in the first quarter of 2021. Second, Wafer Services revenue in the first quarter of 2020 to include the pull-in of $8.2 million of revenue related to the new Frame Agreement with Infineon. Excluding the WIP revenue adjustment, which was an acceleration of revenue from future quarters, gain at higher prices, Wafer Services revenue would have been $13.2 million, up 33% year-over-year on a comparable basis. Increase revenue in both ATS and Wafer Services continues to track well against our revenue growth targets for 2022, as we continue to ramp production and with new customers and programs. Non-GAAP costs of revenue, which adjust for cost of tool sales, equity-based compensation and Florida startup costs, as well as the inventory write-down was $46.6 million in the first quarter of 2022, up 61% from $28.9 million in the first quarter of 2021. Non-GAAP SG&A was $9.7 million in the first quarter of 2022, compared to $8.2 million last year, adjusted EBITDA was a loss of $4.8 million, declining from a positive $5.6 million in the first quarter of last year and flat with the fourth quarter of last year, reflecting the increased cost of revenue and the negative gross margin on Infineon were recognized in the first quarter of 2021 revenue. Q1 2022, adding inventory reflects the $11 million adjustment for an Infineon offset by increased inventory purchases in support of anticipated revenue growth. So, if you're looking at the second quarter, I think you're looking at it in the appropriate fashion, looking at our Q1 wafer services revenue, backing out to $8.2 million, which was the one time pull-in and basing growth for second quarter and beyond off of that baseline of about $13.2 or $13.3 million."
}