{
    "symbol": "SKYT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-13 23:20:21",
    "content": " Q4 revenues exceeded our expectations and were a record $65.1 million, growing 24% higher than our previous record set in Q3. Unlike the $4.7 million revenue recognition event, we expect the higher levels of revenues resulting from productivity gains to continue in the forthcoming quarters and therefore, we are pleased to report today that we see the $60 million level as our new expected partly baseline from which to grow. As we enter another growth year for SkyWater, we expect gross margins to range between 15% and 20% as we anticipate quarterly revenues continuing at the $60 million-plus level. As Steve will detail later, our quarterly revenue growth in 2023 and the resulting gross margin performance will depend on a number of factors, most notably on our mix of ATS programs, customers and tool derived revenues. When coupled with increased absorption of our fixed cost of revenues from our new RadHard and Florida fab investments and more favorable contributions from our Wafer Services business due to improved mix, we anticipate continued gross margin acceleration positioning SkyWater consistently in the high 20s to low 30s level as we exit 2024. And finally, as we look beyond 2025 to the second half of the decade, SkyWater expects our chips-enabled capabilities and other strategic initiatives to ignite accelerated growth in our company as we aggressively drive towards our long-term revenue objective to be $1 billion semiconductor foundry within this decade. As a result, we exited 2022 with a new quarterly baseline revenue level of approximately $60 million which was still modestly stronger than what we were expecting this time last quarter. The stronger revenue performance in ATS can be primarily attributed to productivity gains which allowed us to execute on large ATS programs, such as Phase 2 of the RH90 program, leading us to exit 2022 with a higher baseline of revenues and gross profit from which to grow. And as Tom mentioned earlier, the revenue recognition event that was $4.7 million of 100% profit benefited gross margin by approximately 600 basis points. Wafer Services driving our target fab utilization, ATS adding significant accretion to margin as we increase the volume of R&D wafers moving through the fab and $8 million to $9 million per quarter of costs that will either phase out or become absorbed as we grow the RadHard program and Florida operations in the next few years. As we look to the first quarter, with revenues expected to be at or above the new baseline $60 million level we expect gross margins within the range of the 15% to 20%, similar to the normalized levels achieved in the second half of 2022. Given the strong revenue growth and significant improvements in gross margin, adjusted EBITDA was a record $10.3 million. In the context of one of the other questions in your prepared comments here about gross margins, where you just finished at 20%, excluding the big contract revenue recognition and you're expecting 15% to 20% seems like that's implicitly stating you're not expecting any more improvement or stabilization in productivity."
}