{
    "symbol": "OCUL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-06 23:07:06",
    "content": " Based on these dynamics, the company is guiding initial DEXTENZA net product revenue for the full year 2023 to be between $55 million and $60 million, representing potential growth of approximately 10% to 20% over 2022. Total net revenue which includes both gross DEXTENZA product revenue, net of discounts, rebates and returns which the company refers to as total net product revenue and collaboration revenue, was $14.1 million for the fourth quarter of 2022 and represents 18% growth over the prior quarter and 15% growth over the same period in 2021. DEXTENZA net product revenue was $13.9 million for the fourth quarter of 2022, an increase of approximately 17% sequentially over the prior quarter and up 14% over the comparable quarter of 2021. Research and development expenses for the fourth quarter of 2022 were $13.5 million versus $12.6 million for the comparable period in 2021 driven primarily by an increase in personnel, offset by both a reduction in overall clinical trial expenses and a delay in the timing of clinical trials. General and administrative expenses were $8.3 million for the fourth quarter of 2022 versus $7.5 million in the comparable quarter of 2021, primarily due to an increase in personnel-related costs, including stock-based compensation. Overall, the company reported a net loss of $71 million or a loss of $0.92 per share on a basic basis and a loss of $0.97 per share on a diluted basis for the full year ended December 31, 2022, versus a net loss of $6.6 million or a loss of $0.09 per share on a basic basis and a loss of $0.98 per share on a diluted basis in 2021. We were excited to be able to share with the world our 10-month interim results from the U.S.-based Phase I trial for OTX-TKI in wet AMD, building further evidence of a potential product profile that could set the standard of care for durability in the treatment of wet AMD and diabetic retinopathy."
}