{
    "symbol": "OCUL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 23:30:16",
    "content": " We believe the Phase 1 data presented highlights OTX-TIC’s ability to provide a clinically meaningful decrease in intarocular pressure, or IOP, comparable to travoprost as early as two days following administration and for as long as six months, six or more months with a single implant while preserving corneal health, representing its potential for a unique and differentiated drug product profile. Net revenue, which includes both gross product revenue net of discounts, rebates, and returns, which the company refers to as total net product revenue combined with collaboration revenue was $13.2 million for the first quarter and represented an 81% increase over the same period in 2021. Net product revenue have the extends in the first quarter of 2022 with $12.5 million versus $6.7 million in the comparable quarter of 2021, reflecting an approximate 87% increase. Research and development expenses for the first quarter were $13.1 million versus $10.9 million for the comparable period in 2021, driven primarily by an increase in unallocated expenses, predominantly unallocated personnel costs and increased clinical trial costs. Net loss in the first quarter of 2022 included a $7 million non-cash gain in the fair value of the derivative liability associated with the company’s convertible notes, driven by a decrease in the price of its common stock during the quarter. The U.S.-based trial of OTX-TKI evaluating a single 600 microgram implant plus anti-VEGF injection versus standard of care every eight week Eylea is now fully enrolled, and we expect to announce six month interim data in the third quarter of 2022. So the growth you’re projecting for DEXTENZA in 2022 in the surgical setting, can you maybe quantify how much is that is coming from increase penetration that you alluded to versus expectations for increased volumes and working through that estimated backlog."
}