{
    "symbol": "OCUL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-07 20:45:05",
    "content": " In addition to moving OTX-TKI into a Phase 2/3 trial for wet AMD in quarter three of 2023, we also plan to initiate a Phase 1 trial in diabetic retinopathy in the first quarter of 2023. While Iâ\u0080\u0099ll let Peter elaborate on the opportunity in diabetic retinopathy and our new clinical development plans, I want to highlight that with the current data and depending on the outcome of Phase 1 diabetic retinopathy trial as a follow-up meeting with the FDA, we believe that we may be in a position to enter a Phase 3 pivotal in diabetic retinopathy in the first quarter of 2024. In addition to wet AMD, we plan to initiate a Phase 1 trial evaluating OTX-TKI for the treatment of diabetic retinopathy in the first quarter of 2023 and Peter will give more information on this trial. At AAO, we announced plans to advance OTX-TKI into a Phase 2/3 trial in wet age-related macro degeneration as well as initiate a new trial in a new indication, evaluating OTX-TKI for treatment of diabetic retinopathy. In addition to wet AMD, we plan to initiate a Phase 1 trial to evaluate OTX-TKI in diabetic retinopathy in the first quarter of 2023. Based on the positive interim results in our U.S.-based Phase 1 trial in wet age-related macular degeneration, we believe that OTX-TKI should perform well in the Phase 1 diabetic retinopathy trial. With the current data and depending on the outcome of the Phase 1 DR study and a follow-up meeting with the FDA, we believe that we may be in a position to move aggressively and to initiate our first Phase 3 pivotal trial, OTX-TKI for the treatment of diabetic retinopathy in the first quarter of 2024. All right, your line is now open. All right, your line is now open. When it comes to non-proliferative disease, most of these patients would qualify for treatment, but we currently donâ\u0080\u0099t treat those patients with any of the FDA-approved products, which would be Lucentis or Eylea because it requires so frequent injections as Anthony said at the outset, thatâ\u0080\u0099s where we think we offer the â\u0080\u0093 a good choice because these are patients who would improve their diabetic retinopathy with a treatment theoretically, our treatments would last seven, eight, nine, maybe even longer months. The reason why is because we believe that the Phase 1 programs that weâ\u0080\u0099re using supply us with ample validation of wet AMD, which we believe we already have and diabetic retinopathy, which, of course, we expect to be able to see before we start those later-stage clinical trials."
}