{
    "symbol": "JRVR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-02 10:30:19",
    "content": " Good morning, everyone, and welcome to the James River Group second quarter 2022 earnings conference call. For a discussion of such risks and uncertainties, please see the cautionary language regarding forward-looking statements in yesterday's earnings release and the risk factors in our most recent Form 10-K and Form 10-Qs and other reports and filings we have made with the Securities and Exchange Commission. Undoubtedly, we remain a leader in the E&S market and our teams across the entire organization have executed exceptionally well on their business plans. To that end, I am extremely pleased that all three of our segments produced an underwriting profit during the second quarter, demonstrating the strong earnings potential of our company. Turning to macro conditions briefly and remaining mindful of the state of the broader economy, the majority of the markets that we operate in remain quite healthy. Clearly, the excess and surplus lines marketplace continues to benefit from pockets of industry dislocation as admitted market underwriting discipline remains broadly in-force, driving sustained pricing improvement in the E&S sector. In aggregate, we've experienced renewal rate increases for 22 consecutive quarters or 5.5 years compounding to 58.1%. As a reminder, the rate change information that we have historically cited is exposure adjusted. We have not seen any overall change in market dynamics that would lead us to believe that our pricing momentum in E&S should not persist through at least the end of this year, if not longer. Before I turn it over to Sarah, let me share some additional highlights from the results of our second quarter. In our E&S segment, we experienced strong rate increases, significant premium growth and notable profitability driven by a 14.1% positive renewal rate change, gross premiums increased 24.6%, while net premiums grew by 22.8%. Consistent with our results last quarter, we saw broad-based positive growth in rate trends across the segment with 10 of our 13 underwriting divisions experiencing double-digit premium growth for the second consecutive quarter. Our largest underwriting divisions led the way in terms of growth, excess casualty and general casualty were both up more than 30% from the prior year quarter with continued strong trends in our renewal book. Submission activity continues to remain robust, particularly in our renewal portfolio where we have a much higher conversion ratio. As alluded to previously, renewal rate change increased sequentially from 8.4% in the first quarter to 14.1% in the second quarter. As we've experienced over the last few years, rate changes have fluctuated a bit from quarter-to-quarter and we expect that dynamic is likely to continue. On a year-to-date basis, our renewal rate change is 12%, which is comfortably ahead of both our planned rate increase and expected loss cost trends for the segment. For the quarter, the headline rate increase is driven by some of our larger underwriting divisions like excess casualty, but we also had double-digit rate increases in a number of product lines, including general casualty, sports and entertainment, healthcare and excess property. From our perspective, we think it's safe to say that for a few of these classes, certainly for excess property and excess casualty, capacity still remains fairly tight for many industries. From a profitability perspective, our E&S combined ratio was 83.8%, again broadly consistent with our results from the first quarter of this year. In Specialty Admitted, results followed many of the same trends we shared last quarter as our topline was impacted by continued rate pressure in the workers' compensation market. In total, our workers' compensation related premiums declined approximately 14% during the second quarter and 13% on a year-to-date basis. Excluding workers' compensation and a program partner that was acquired late last year, our fronting and program business premiums have increased approximately 20% during the first half of the year. Turning to Casualty Reinsurance, we wrote $8 million of premium during the second quarter as we non-renewed or reduced our participation from several treaties. The combined ratio for the segment was 93.2% and included no reserve development, resulting in $2 million of underwriting profit for the second quarter. Overall, we are excited by the performance of the group and the broad contributions to earnings from each of our underwriting segments as well as the growth in our investment income. For the first half of the year, adjusted net operating return on tangible common equity was 15.5% even adjusting for the change in accumulated other comprehensive income, which benefited our and most competitors returns on tangible common equity this quarter. As we did between the first and second quarters of last, we slightly raised our workers' compensation related loss pick this quarter given the impacts of continued soft rate and some activity in the book. As mentioned earlier, investment income was $14.7 million this quarter. Overall, our weighted average book yield improved sequentially from 2.75% to approximately 3% during the quarter and current reinvestment rates are about 100 basis points ahead of that. Lastly on investments, realized losses were about $17 million this quarter, largely due to our senior secured bank loan portfolio and less so to our investment grade preferred portfolio. In total, our equity exposure, which is largely preferred in bank loan portfolio represent about 11% of our portfolio including cash. We ended the quarter with tangible common equity of $376.7 million and tangible equity of $521.6 million, which includes the Series A preferred we issued during the first quarter. While the interest rate moves impacted GAAP equity, our key rating agency and debt facility leverage ratios exclude the impact of AOCI changes and also give significant or full equity credit to the preferred securities in our capital structure. Given this as per our debt facilities, our leverage ratio was 23% this quarter, unchanged from last quarter. In conclusion, James River ended the second quarter at excellent financial and strategic position. I think we've spoken to this before with trend for our portfolio in the mid-single-digit range with certain lines of business perhaps as high as maybe 200 basis points or so higher and we look at all of our assumptions regularly as part of our quarterly review process in the event we feel we need to make a change as we did with workers' comp we address it. And when you think about our portfolio as well as some of the more concerning areas relative to inflation, remember our Excess Property Unit is less than 5% of our E&S segment. So in essence, we view exposure trend is a bit of an offset to loss trend and fortunately the markets we operate in have remained fairly healthy and I would suggest that the majority of our portfolio captures inflation impacted exposure basis. But from a rate perspective, we've been collecting positive rate change. So, yes, more broadly at the halfway point in 2022 with rate change at positive 12%. We're not only well in excess of our view of loss trend, but ahead of our rate change assumption in our 2022 business plan and that speaks to margin expansion, margin expansion especially when you consider that we collected 13% of positive rate in both 2021 as well as 2020. And then when it comes to the economy, anything you're seeing in your SME client base that makes you think there is any kind of slowdown that's ongoing. Yes, it's component of what we see on a quarterly basis, premium audits occur over the course of the entire year. Yes, I think the best I can say is compared to where we are in a book yield basis, it's about 100 basis points higher. Meyer, I think across our composite portfolio, it's not terribly different from where the end -- from where we were at the end of the quarter. So over the last month or so, but that's how I frame that in terms of what we're looking at current reinvestment rates across the whole portfolio. I would say, well over 90% of our limit profile is $5 million or less on a gross basis. So it's not as long as you might think or as long as you may think of just relative to tail concerns with other excess players that play throughout a program, top of the tower and mid-tower or et cetera. So that, depending on what the primary exposure base is driving the risk, it's going to obviously speak to the tail of that component of the book. But not - I would say, not out of the realm of how we think about it to be a couple of years longer than, let's say, our primary GL. First, Sarah, I think last quarter, you were telling us maybe 19% to 21% of the tax rate. And that's - I think just as a quick reminder, that's due to the losses that we experienced in Bermuda related to the LPT in the first quarter that's going to push up the effective tax rate. You obviously seen a nice improvement in your rate activity rate levels in this quarter, whereas a lot of the people in the industry are experiencing a moderation and meaningful deceleration in rates achieved. Well again, I've seen some of the same dynamics that you're referencing, particularly in the admitted market. Like I said in my earlier comments, I think the headline increased just relative to rate for us is driven by some of our larger underwriting divisions, like excess casualty, where we saw rates at double-digit increases. I mean, we're generally seeing healthy rate increases across our E&S segment. And in most underwriting divisions, renewal rate changes have been well ahead of where we expected them to be in 2022. So broadly favorable market conditions, I think, suggests that we can continue to push the pricing momentum that we have certainly throughout the rest of the year. Well, it's been a real positive in terms of where we've seen growth in our submissions. Again, like the first quarter, we saw double-digit increases in our renewal submissions, 16 points up quarter-over-quarter in the second quarter. And for us, that's just very efficient use of our underwriters' time because our conversion ratios are so high on our renewal book. So we continue to see that as very steady growth over prior, just relative to holding on to our renewals longer, which is great again, particularly given the rate change we've been experiencing over the last couple of years. So we've been talking about the rate erosion in our workers' comp portfolios, particularly in California, for some time, as rates have been softening for several years. And it's important to just note that, again, we have two very distinctively different portfolios, one focused in the Southeast, and the other, a California program. For us, pricing for our large California workers' comp program for 2022 is down roughly 13%, which is certainly greater than anticipated. As for the releases, we've been writing individual risk workers' comp for a long time at Falls Lake or Specialty Admitted, and we've been writing our large California program since 2016. And again, we've written these portfolios in both instances for a number of years. Again, if you think about what that book is, small Southeastern exposure in those years, for the most part. And then obviously, the California book, we're looking at six years out. And if I just look at the first half of the year, premiums are down by $64 million. Well, I would just say broadly, again, if you think about where we finished the year in 2021 and the fact you said we're going to take $100 million out and where we finished through the halfway point we're kind of there or kind of on the pace that you might expect. Yes, I would just say that the first half of the year, last year was significantly larger than the second half of the year, Tracy, just to kind of put that in context, not every quarter is even - and that's one way to frame it. I think the other piece is, as we said, as Frank said in his comments, we're going to look at every single renewal and every single opportunity in a quarter-by-quarter basis and make those decisions as the market comes to us."
}