{
    "symbol": "NURO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 17:23:05",
    "content": "  Operator: Good morning, and welcome to the NeuroMetrix Fourth Quarter and Full Year 2022 Earnings Call. On this call, the company may make statements which are not historical facts and are considered forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. You should not rely on forward-looking statements because actual results may differ materially as a result of a number of important factors, including those set forth in the earnings release issued earlier today. Please refer to the risks and uncertainties, including the factors described under the heading Risk Factors in the company's periodic filings with the SEC available on the company's Investor Relations website at neurometrix.com and on the SEC's website at sec.gov. Thank you, Latanya, and thanks to all of you who are joining our CEO, Dr. Shai Gozani and myself for today's Q4 and full earnings -- and full year 2022 earnings call. Our neurodiagnostics are DPNCheck and ADVANCE, and our neurotherapeutics are the Quell product line. Earlier today, we reported Q4 revenue of $1.8 million and full year 2022 revenue of $8.3 million. In both the quarter and the full year, revenue was up slightly from the prior year. Aftermarket sales across all product lines were about 82% of total revenue in both periods, and both were up from about 80% in the prior year periods. Sector-wise, Medicare Advantage was up 21%, reflecting primarily organic growth, and international grew by 9%. For the full year, DPNCheck posted 10% growth with Medicare Advantage up about 13% and offsetting an approximate 9% decline in international sales. The Q4 gross margin rate was 67% versus 68% in 2021 and full year, the gross margin rate was 70% versus 72% prior year. However, the 2022 shift in sales mix to higher-margin DPNCheck products provided some offset to these higher raw material costs. OpEx was lower by 7% or $161,000 from Q4 of last year, a reduction of $400,000 from last year and R&D raw material costs was partially offset by higher personnel costs across the organization. Full year OpEx increased by $2.3 million, and this is the effect in 2022 of our 2-year $4 million infrastructure program, which covers product development, commercialization talent, IT systems, governance and other topics. We ended the year with $21.2 million in cash and investment securities, and we maintain a simple debt-free capital structure. And the third is to advance the Quell neurotherapeutics program, which may lead to additional indications and an expanded addressable market. Regarding DPNCheck, we have a value-based commercial team focused on increasing DPNCheck adoption in the Medicare Advantage market. This includes large medical groups, health systems and health assessment companies, where a substantial portion of their patients are covered under Medicare Advantage. However, in the past several weeks, substantial uncertainty was injected into Medicare Advantage due to sweeping changes proposed by the Centers for Medicare & Medicaid Services, or CMS. On January 30, 2023, CMS issued a final rule regarding the Medicare Advantage Risk Adjustment Data Validation, or what's called the RADV program, that is used to recover improper risk adjustment payments to Medicare Advantage plans. And then on February 1, 2023, CMS issued its 2024 Medicare Advantage Advance Notice, which included significant changes to the hierarchical condition category, or HCC, risk adjustment model for calendar year 2024. These have broad implications for Medicare Advantage space and if adopted, would substantially revise the risk adjustment environment and do include limitations on HCC codes for some types of peripheral neuropathies. These events do not alter the fundamental clinical premise behind DPNCheck that our customers strongly believe, which is that peripheral neuropathy is a common and debilitating condition in the elderly, and the early and accurate detection of DPNCheck is essential to minimizing complications and reducing overall health care costs. However, the eventual impact of the proposed program changes on DPNCheck sales is unclear at this time. First, we fully launched our second-generation device called DPNCheck 2.0 in the fourth quarter. Another important R&D program is the DPNCheck cloud, which is a data analytics platform that allows our customers to monitor and optimize their DPNCheck implementation and address key population health questions through a family of web-based dashboards. As of the fourth quarter of last year, Quell was no longer available over the counter. As a reminder, fibromyalgia is a complex chronic pain syndrome that affects as many as 10 million people in the United States. We are in the midst of the strategic launch which started in late fourth quarter that is intended to optimize the effectiveness of our prescription management solution, to refine the clinical and marketing messaging and to collect key performance indicators that will allow us to plan further commercial expansion. We have a growing number of physicians, many of which are key opinion leaders in fibromyalgia and chronic pain who are now regularly writing Quell prescriptions for their patients with fibromyalgia. Our next commercial decision will occur in late Q2 of this year, at which time we may expand our sales operations if we are satisfied with the business metrics collected during the strategic launch. If everything falls into place as we hope, Quell revenues may resume growth later this year. As I mentioned, the third element of our growth strategy is to develop the Quell neurotherapeutics pipeline beyond the initial fibromyalgia indication. The program that is furthest along is for chemotherapy-induced peripheral neuropathy, or CIPN, which affects as many as 70% of people who received chemotherapy. And NIH and National Cancer Institute funded multicenter, double-blinded, randomized, sham-controlled trial has been underway for the past couple of years and recently completed enrollment. Thank you for joining us this morning on the conference call, and we look forward to keeping you updated as we go through this year."
}