{
    "symbol": "NURO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 10:58:04",
    "content": " On this call, the company may make statements, which are not historical facts and are considered forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. You should not rely on forward-looking statements, because actual results may differ materially as a result of a number of important factors, including those set forth in the earnings release issued earlier today. Please refer to the risks and uncertainties, including the factors described under the heading Risk Factors in the company’s periodic filings with the SEC available on the company’s Investor Relations website at neurometrix.com and on the SEC’s website at sec.gov. Our business model is one of recurring revenue from an installed customer base and our principal products are DPNCheck, a diagnostic technology providing rapid point of care detection of peripheral neuropathy and Quell, an over-the-counter wearable neurostimulation technology that is indicated for symptomatic relief of lower extremity chronic pain. Revenues in our first quarter of 2022 were $2.3 million, up 6.8% from Q1 of last year. On a sequential basis, revenues increased by 26.5% from Q4 2021. Within DPNCheck revenue, high margin aftermarket sales which are primarily single patient use biosensors represented nearly 87% of revenue versus 81% a year ago. In this sector, revenue growth was 15% year-on-year and 52% sequentially from the seasonally slow fourth quarter of last year. The growth was driven by price increases during 2021 and biosensor unit volume increases, which reflected increased testing by our customers. Our recently deployed Medicare Advantage commercial team will play a crucial role in maintaining and accelerating Medicare Advantage growth in 2023 and forward and this reflects the typically long sales cycles with MA payers, Medicare Advantage payers and providers. Outside of the U.S., our DPNCheck sales to Japan and China grew 19% year-on-year, with the growth being attributable to biosensor unit volume. Gross profit and revenue was $1.8 million in the quarter, up from $1.6 million comparable quarter last year. The largest element of the year-on-year variance was a $450,000 one-time credit for technology fees that was recorded in Q1 of last year depressing that quarter’s spending. Sales and marketing spending increased by $465,000 year-on-year, primarily reflecting personnel costs for the development of the DPNCheck commercialization team and G&A spending increased by $174,000 primarily relating to personnel cost. Net loss for the quarter was $959,000 versus $60,000 in Q1 of last year. On a per share basis, the net loss was $0.14 versus $0.02 in Q1 of 2021. Regarding the balance sheet, we ended Q1 with cash and investments of $23.8 million. Our overall year-over-year revenue growth of 7% was entirely driven by our DPNCheck business, which grew about 16%. This growth was mostly organic, reflecting increased utilization by our existing customers and the benefits of higher prices implemented in 2021. Over the course of the first quarter, we built our value-based commercial team – our value-based care commercial team, which focuses on DPNCheck utilization and Medicare Advantage to 4 individuals that are highly experienced in Medicare Advantage sales, marketing and clinical operations. Revenue for our other two product lines, Quell and ADVANCE contracted in Q1 as they are currently managed, provided positive operating contribution. However, we are planning for Quell to resume growth in 2023 subject to a positive regulatory outcome which I will discuss. As we have noted over the past couple of years, we are transitioning Quell from a non-specific over-the-counter treatment for chronic lower extremity pain to a focused prescription neurotherapeutic platform, starting with the treatment of the symptoms of fibromyalgia. Public disclosure of the study results will take some time, but preliminary findings could come out before the end of the year, and definitely in the first half of 2023. Another DPNCheck related milestone is launch of the DPNCheck cloud, which is a data analytics platform that will allow customers – allow our customers to easily monitor and optimize DPNCheck implementation, and address key population health questions through a family of web based dashboards. In terms of the overall 2022 revenue, we expect it to increase relative to 2021 driven by the growth of the domestic DPNCheck business. This will be partially offset by a temporary decrease in Quell revenue as the business transitions from over the counter to prescription neurotherapeutics, as well as a continued downward trend in advance revenue, which is a legacy business that lacks attention due to our focus on other priorities. We expect a modest increase in operating expenses reflecting investment in our DPNCheck, and Quell growth initiatives. And we anticipate a modest increase in net loss due to relative timing up on these investments and the resulting revenue growth which as I have noted, will come mostly in 2023. However, we expect to end the year with about $20 million on the balance sheet. Well, thank you very much for listening in on our Q1 conference call and we look forward to keeping you updated over the balance of the year."
}