{
    "symbol": "SMCI",
    "quarter": 2,
    "year": 2023,
    "date": "2023-01-31 19:59:05",
    "content": " First, revenue for the second quarter of fiscal year 2023 totaled $1.803 billion, up 54% year-on-year, above our guidance range of $1.7 billion to $1.8 billion. Our fiscal second quarter non-GAAP earnings per share grew over 271% year-on-year at $3.26 compared to $0.88 a year ago, far exceeding the high end of our guidance range of $2.64 to $2.90. With our 50% still available capacity in Taiwan and the soon coming more cost-efficient campuses in Malaysia, we continue to expect a 20% to more than 50% year-over-year growth for the coming years, and we remain on track to reach our long-term growth objectives of $20 billion annual revenues in the long run. I am pleased to report Q2 fiscal 2023 revenues of $1.8 billion, up 54% year-on-year and down 3% sequentially. We recorded $970 million in our Enterprise and Channel vertical, representing 54% of Q2 revenues versus 45% last quarter, up 29% year-over-year and up 15% quarter-over-quarter. The OEM appliance and large datacenter vertical achieved $766 million in revenues, representing 42% of Q2 revenues versus 50% last quarter, this was up 172% year-over-year and down 17% quarter-over-quarter. Our emerging 5G/Telco/Edge/IoT segment achieved $67 million in revenues, representing 4% of Q2 revenues versus 5% last quarter. Taking a look at operating expenses, Q2 OpEx on a GAAP basis decreased by 4% quarter-over-quarter and increased 8% year-over-year to $122 million. On a non-GAAP basis, operating expenses decreased 7% quarter-over-quarter and increased 5% year-on-year to $109 million. For the third quarter of fiscal 2023 ending March 2023, we expect net sales in the range of $1.42 billion to $1.52 billion, GAAP diluted net income per share of $1.75 to $2.02 and non-GAAP diluted net income per share of $1.88 to $2.14. For the fiscal year 2023 ending June 30, 2023, weâ\u0080\u0099re maintaining our guidance for revenues from a range of $6.5 billion to $7.5 billion, GAAP diluted net income per share from a range of $8.50 to $11.00 and non-GAAP diluted net income per share from a range of $9 to $11.30. The outlook for fiscal year 2023 fully diluted GAAP EPS excludes (sic)  approximately $33 million in expected stock-based compensation and other expenses, net of tax effects that are excluded from non-GAAP diluted net income per common share."
}