{
    "symbol": "RVLV",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 02:18:02",
    "content": " I would also like to remind you that this conference call will include forward-looking statements, including statements related to economic conditions and their impact on consumer demand and our business, operating results and financial condition; our cost and inventory management; our growth, including growth in active customers, and market opportunities and related macroeconomic and industry trends; our partnership with Muus Collective; our plans to expand FWRD Renew and introduce the FWRD Brand Ambassador program; our future events; and our outlook for net sales, gross margin, operating expenses and effective tax rate. Our net sales increased 10% in the third quarter compared to the prior year period, on top of 62% growth in Q3 2021 compared to Q3 2020. As expected, profitability was lower year-over-year due to reduced gross margins, higher return rates and other cost pressures discussed in detail on last quarterâ\u0080\u0099s conference call. Importantly, net income and adjusted EBITDA increased 25% and 22%, respectively, compared to the third quarter of 2019, further illustrating our track record of profitable growth. Successful execution of our marketing and merchandising investments led to growth of 84,000 active customers during the third quarter, expanding our active customer base to 2.2 million, an increase of 34% year-over-year. Shifting gears to net sales performance by geography, our U.S. net sales increased 10% and international net sales grew 12% year-over-year in the third quarter of 2022. Our net sales results in Europe and in the UK went from high single digit year-over-year growth during the month of July to negative year-over-year growth comparisons in net sales for the month of September, coinciding with currency exchange rates becoming much more challenging later in the third quarter. FWRD net sales for the third quarter increased 17% year-over-year, an encouraging result in the current environment and considering the prior-year comparison as well. As a reminder, our net sales in the third quarter of 2021 had increased 62% compared to the third quarter of 2020, and had even grown sequentially from net sales in the second quarter of 2021, which is not our typical seasonality creating a very difficult year-over-year comparison. By territory, domestic net sales increased 10% year-over-year and international net sales increased 12%, despite the currency headwinds that became progressively more challenging throughout the third quarter. Selling and distribution costs deleveraged 158 basis points year-over-year and remained a significant headwind, yet importantly came in at a lower percentage of net sales on a sequential basis than in the second quarter of 2022. Marketing leveraged by 265 basis points year-over-year, better performance than implied by our outlook commentary last quarter, primarily due to lower, but still significant, brand marketing investment year-over-year highlighted by the very successful events held in September during Fashion Week that Michael talked about. The decreases in both measures year-over-year primarily reflect lower net income, which included much higher tax rates and cash payments for income taxes that increased by $14 million in 2022, as well as the increased investments in inventory during the first half of the year. Looking at our net sales trends early in the fourth quarter though the month of October, net sales increased approximately 3% year-over-year, against a more difficult year-over-year comparison than we have faced in the first nine months of the year. Given the uncertain macro environment and considering that our year-over-year comparisons are even more difficult for the balance of the fourth quarter, we encourage investors to model further moderation in our year-over-year net sales comparisons for the balance of the fourth quarter from the approximately 3% year-over-year growth in October. As a basis of comparison, recall that our net sales in the fourth quarter of 2021 a year ago increased 70% year-over-year. Consistent with the commentary on last quarterâ\u0080\u0099s conference call, we expect our gross margin for the fourth quarter of 2022 to be sequentially lower than the third quarter of 2022, primarily due to our expectation for a lower mix of full price sales on a sequential basis versus the third quarter of 2022. Selling and Distribution: We expect selling and distribution costs as a percentage of net sales in the fourth quarter to be relatively consistent with the 17.3% in the third quarter, and slightly lower than our outlook provided last quarter. We expect our marketing investment to be between 16% and 16.5% of net sales in the fourth quarter, higher year-over-year, but lower sequentially versus the third quarter of 2022 and also lower than our prior outlook."
}