{
    "symbol": "MKTX",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 16:22:03",
    "content": " In our unique Live Markets all-to-all order book, we are continuing to gain traction across both rates and credit with a new quarterly record ADV in U.S. Treasuries of $25 billion, up 38% year-over-year and record volumes and active clients in corporate bond Live Markets. We registered a record $14 billion in portfolio trading volume, emerging market, local market trading reached a new record of 22%, municipal bond trading ADV was a record $288 million, which benefited from the integration of MuniBrokers and we launched our MarketAxess 400 Index to create a highly tradeable corporate bond index as well as Axess All Prints, a real-time European fixed income trade tape. For the first quarter, a record 32% of our global credit trading volume came from clients outside the U.S. Additionally, the number of active institutional investor and dealer traders set a new record at approximately 11,200 traders. Our Live Markets for treasuries reached record volume of $1.5 trillion during the quarter, an increase of 40% from last year and a record $2 million trades up 64%. Trade automation on MarketAxess reached new records in the quarter, growing to 49.3 billion in volume and over 280,000 trades, reflecting increasing client adoption and higher levels of client penetration. Your line is open. Your line is open. Your line is open. Your line is open. And if you look at Q3 and Q4, where we had very little credit spread volatility, our quarterly transaction cost savings from open trading delivered to clients, we're around $125 million or $130 million per quarter. Your line is open. Your line is open. So I really think there's a higher velocity embedded in these new trading protocols that we're delivering, whether it's automation or Live Markets, it is giving a certain subset of the client population trading strategies that they just haven't deployed in the credit market before. Your line is open. I think you're clearly going to see sustained volatility in rates and when that price dispersion grows, every period in history, the open trading transaction fee advantages that we have drive our market share higher. If you look at the records that we're setting across, not just our products, but also automation which is largely driven by high grade and high yield activity, but a record of 49 billion in the first quarter, which is up 36% from a year ago. We have a long way to go and really it will leverage not only our automation tools, but the liquidity that we deliver through a growing open trading solution across high grade, high yield munis, treasuries, all of the products that we offer here, automation cuts across every one of those products and continues to grow and continues to be in high demand from our largest clients. Your line is open. Your line is open. And if you really look at this quarter more broadly, you see records, we mentioned many of these, but record total trading volume, record treasury volume, record emerging market volume, record muni volume, record PT volume, record automation volume, record number of active clients, record Mid-X volume, our record diversity dealer volume, record on Live Markets."
}