{
    "symbol": "MKTX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 14:48:05",
    "content": " We continue to execute our growth strategy and delivered the second consecutive quarter of record market share gains across nearly all of our products, strong increases in trading volumes, and significant execution cost savings for clients through our unique all-to-all trading protocol Open Trading. U.S. corporate and emerging markets debt outstanding in the market has been growing at three-year compound growth rates of approximately 4% and 9% respectively, which, when combined with higher rates, sets a strong foundation for trading growth in the institutional client e-trading space. Third quarter revenue was $172 million, up 6% driven by strong growth in trading volume and record market share gains, but was negatively impacted by the lower duration of U.S. high-grade bonds traded and a strengthening U.S. dollar. Our growth in total credit and total rates commission revenue was driven by healthy increases in our trading volume and estimated market share, but was partially offset by lower average fee capture across U.S. high grade. Your line is open. Your line is open. Your line is open. And we're seeing higher and higher demand from our clients around that unique data that they can use on a daily basis to help construct the most liquid portfolio, particularly given the liquidity challenges that we're seeing in the market in this time. Your line is open. Your line is open. Your line is open. And so there -- we're feeling that demand from our clients to help them solve automation solutions that they need for their trading, and we're seeing that obviously in the growth with -- seeing record automation at $52 billion in the quarter, up 36% over the year. Your line is open. Your line is open. There's -- one of the key elements, as I mentioned, is that we've seen a number of clearing firms, firms that clear on behalf of others step out of the market over the years because of the challenges around capital treatment for that clearing of treasury business. Your line is open."
}