{
    "symbol": "MKTX",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 14:49:02",
    "content": " We achieved record levels of estimated market share across both credit and rates, driving a new quarterly record for global credit trading volume. In summary, strong growth in trading volume, broad based market share gains and increasing momentum in new product areas, including U.S. Treasuries and municipal bonds are driving significantly improved operating performance. We believe that this is a key contributor to our broad based market share gains across high grade, high yield, emerging markets, dollar corporates and Euro bonds, as reflected in our record composite corporate bond estimated market share of 20.2% which is up from a pre-pandemic share of 15.6% in Q1, 2020. Automated trading on MarketAxess reached new records in the quarter, growing to 57.6 billion in volume and over 305,000 trades reflecting very strong adoption despite the increase in volatility. Our growth in other credit and rates commission revenue was driven by healthy increases in our trading volume and estimated market share, but was partially offset by lower average fee capture across high-grade and other credit. The decrease in other credit fee capture was driven principally by product mix shift as a result of the increase in EM local markets trading volume, which has a lower average fee capture as these are rates focus markets. And Richard I would just add, as we see fee capture picking up as that yield curve adjusts, and our clients start trading across the curve, we don't see that increase in capture impacting our share growth either. As you know, we continue to believe that we see lots of reasons for optimism on velocity with the increase in market participation, including lots of new and interesting clients continuing to come online in credit trading, and the 40% compound growth rates we're seeing in trading automation with both dealers and investors and the new liquidity tools that we just talked about. But that's why our OT or open trading alternative liquidity solution did actually see some positive yield in the second quarter and gains across many of the different products in terms of overall volumes, but also penetration within those products."
}