{
    "symbol": "LDI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 21:29:14",
    "content": " Our pull through weighted rate lock volume of $12 billion for the second quarter resulted in quarterly total revenue of $309 million, which represented a 20% or 39% decrease from the first quarter. Adjusting for the $69 million increase in the provision for repurchase loss reserve, our pull through weighted gain on sale margin would have been 205 basis points or near the higher end of our guidance for the quarter. Reflecting the net growth of the portfolio, servicing fee income increased from $111 million in the first quarter of 2022 to $117 million in the second quarter of 2022. Our total expenses for the second quarter of 2022 decreased by $88 million or 8% from the prior quarter, driven primarily by lower personnel expenses, including both salaries and volume-based commissions and lower marketing expenses. The second quarter included charges of $41 million for goodwill impairment, $6 million of real estate and other intangible asset impairment, $4 million of severance benefits and $3 million of consulting and other professional expenses related to Vision 2025. Net of these items and the $69.2 million increase in the provision of purchase loss reserves, our adjusted second quarter pre-tax loss would have been $130 million. As a reminder, we expect to recognize additional charges during the second half of 2022 as part of our Vision 2025 Plan including severance and benefits related charges, currently anticipated between approximately USD25 million and USD28 million, charges related to the exit of real estate now approximately $6 million to $8 million and approximately $7 million to $9 million of outside service costs. No, I think -- I think really if you look at the $375 million to $400 million full-year run rate cost savings, about 65% of those are going to be in the people area, with the balance being a blend of other third-party and infrastructure related as well. How much of the $375 million to $400 million of expense saves that you laid out has already been achieved as of the second quarter with the $520 million of operating expenses that you reported, excluding the $41 million of goodwill impairment."
}