{
    "symbol": "TTE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 11:52:09",
    "content": " Debt adjusted cash flow came in at $12 billion for the third quarter, down 12% from the second quarter, mainly due to lag effect in the dividends received by equity affiliates. Integrated gas, renewable and power iGRP, posted record adjusted net operating income of $3.6 billion this quarter, up $1.1 billion from the second quarter, and cash flow of $2.7 billion driven by higher LNG prices and strong trading activities inline with previous quarter. Operating cash flow for iGRP was $4.4 billion in the fourth quarter, including a positive impact on working capital due to the reduced margin growth and seasonality in the gas and power supply business. The E&P segment generated adjusted net operating income of $4.2 billion and cash flow of $6.4 billion in the third quarter, down about $0.5 billion and $1 billion, respectively, throughout the second quarter, because of lower production. The combined Downstream segment generated $2.4 billion of adjusted net income and $2.9 billion of cash flow in the third quarter, an outstanding performance even if decreased compared to the record set in second quarter, thanks to strong distillate margin, and a good trading performance comparable to previous quarter. To put this into perspective, over the first nine months, the Downstream generated 4 point -- sorry, $8.4 billion of cash flow, twice the level of the same period last year, and more than enough to cover the entire regular dividend for the year. At a company level, over the first nine months of 2022, we generated operating cash flows before working capital changes of around $37 billion, an increase of 85% over the same period last year. Thank you very much. I had two questions, please. So we made, I remind you, $4 million -- $4.1 million impairment in the first quarter, mainly remain $3 billion or $3.5 billion impairment in Q2, mainly on  value, and this semester -- this quarter, sorry, so an additional $3.5 billion. Thank you very much. Thank you very much. Thank you very much. Thank you very much. Thank you very much. I had two questions, please."
}