{
    "symbol": "CMCSA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-28 12:04:11",
    "content": " You can see with our first quarter results, where we added 194,000 customer relationships and 262,000 broadband subscribers, while on the financial side, Cable generated 5% revenue and 6.5% adjusted EBITDA growth, with 44% adjusted EBITDA margins. So Comcast is truly in a unique position of growing EBITDA, generating a robust level of free cash flow while making important organic investments in long-term growth initiatives and also increasing our return of capital to shareholders, which totaled $4.2 billion this quarter through a combination of $3 billion in buybacks and $1.2 billion in dividends, the largest return of capital for any quarter in our history. Broadband revenue increased 8%, driven by strong customer additions over the past 12 months and nearly 4% growth in average revenue per customer in the quarter. For video, revenue declined 1.5%, driven by customer net losses totaling $1.7 million over the past 12 months, including $512,000 in the quarter, partially offset by higher average revenue per customer due to a residential rate increase at the beginning of this year. Last, voice revenue declined 9.8%, primarily reflecting customer losses totaling 725,000 over the past 12 months, including 282,000 net losses in the quarter and reflects our shift to more converged broadband mobile offers. Media revenue increased 36% to $6.9 billion, including Peacock revenue, which grew more than 5x year-over-year to $472 million in the quarter. Last, at Theme Parks, revenue increased by $941 million to $1.6 billion, and we generated EBITDA of $451 million, reflecting improved results at each of our parks compared to last year when Orlando and Japan were operating at limited capacity and Hollywood was closed due to COVID-19. For the first quarter, Sky revenue of $4.8 billion was consistent with the same period last year as solid growth in the U.K. was offset by our results in Italy, where we continue to transition through the reset in our Syria broadcast rights, which we won't begin to lap until the back half of this year. Sky's EBITDA increased 71% to $622 million driven by our strong performance in the U.K. and improved results in Italy and Germany, where we benefited from lower sports programming costs due to resets in our sports rights."
}