{
    "symbol": "CMCSA",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 13:14:05",
    "content": " Digging into the third quarter, our results at Cable Communications again underscore the impressive consistency in this business, with 5% EBITDA growth and 120 basis points of year-over-year margin expansion bringing us to 45.1%, our highest margin on record. Revenue decreased 1.5% to $29.8 billion, reflecting the comparison to last year's quarter, which included the Tokyo Summer Olympics as well as a headwind from currency translation at Sky and our international theme parks due to the strengthening dollar. Cable revenue increased 2.6% to $16.5 billion, driven by higher rate and volume in residential broadband as well as growth in business services, wireless and advertising. Business services revenue increased 9.4% or approximately 5% excluding the acquisition of Masergy, which closed at the beginning of last year's fourth quarter. We continue to see healthy performance across our diverse customer segments including SMB, mid-market and enterprise with this quarter's organic growth driven by a mix shift to a higher data speeds and increased sales of our advanced services, as well as rate increases and growth in our customer base. Partially offsetting the growth from these revenue drivers was video revenue, which declined 4.4%, driven by year-over-year customer net losses partially offset by 6% ARPU growth due to a residential rate increase at the beginning of this year. Non-programming expenses increased 2.5% driven by growth in other expenses due to an increase in bad debt compared to last year, reflecting a return to more normalized levels and increased technical and product support expenses driven by growth in our wireless business as well as the addition of Masergy. Cable EBITDA increased 5.4% to $7.5 billion in the quarter with Cable EBITDA margins improving 120 basis points year-over-year, reaching a record high of 45.1%. Starting with total NBCUniversal results, revenue decreased 4.3% to $9.6 billion, reflecting the difficult comparison to last year, which included $1.8 billion from the Tokyo Olympics included in our media segment. Excluding the Olympics, Media revenue increased 4.4% driven by Peacock with revenue of $506 million, which more than doubled compared to last year. Distribution revenue increased 4.6% reflecting growth at Peacock driven by increases in paid subscribers compared to last year, as well as higher contractual rates at our networks partially offset by linear subscriber declines that accelerated sequentially. We continue to expect Peacock's EBITDA loss will be roughly $2.5 billion for the year, with the fourth quarter's loss reflecting the cost of new content. Excluding Peacock Media EBITDA in the third quarter decreased 21% reflecting the difficult comparison to last year's Tokyo Olympics, as well as revenue pressure at our linear networks. EBITDA increased $358 million to $537 million for the quarter primarily reflecting the higher theatrical and content licensing revenue, partially offset by the corresponding higher programming and production costs, and also the benefit of the timing of marketing costs that we incurred in the second quarter for films in the third quarter. For the third quarter, Sky revenue was consistent compared to last year at $4.3 billion, as low single-digit growth in the UK was mostly offset by lower revenue in Italy and Germany. Sky's EBITDA decreased 15.5% to $701 million, primarily reflecting the timing of sports costs, again, due to the early start of the football seasons and the shift of matches into the third quarter to accommodate the timing of the World Cup in the fourth quarter. Operator, next question please. Operator, next question, please. Operator, next question please. Operator, next question, please. Operator, next question please."
}