{
    "symbol": "MCO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-02 16:57:09",
    "content": " So against a backdrop of geopolitical turbulence and volatile markets, Moody’s first quarter revenue was $1.5 billion, that’s down 5% from the prior year period. With the decline in issuance in the first quarter and our expectation for continued subdued levels of opportunistic issuance for the balance of the year, we have updated our full year 2022 guidance and we now project Moody’s revenue to be approximately flat relative to the prior year. Moody’s revenue was down just 5% from a year ago, reflecting the diversity and resilience of our business portfolio and while MIS revenue decreased 20%, MA revenue was up 23% or 9% on an organic basis, driven by strong customer demand for our solutions. In the first quarter, MIS revenue declined 20% from last year’s record level as geopolitical concerns, rising yields and elevated economic uncertainty contributed to a 25% decrease in rated issuance. Our updated full year 2022 guidance incorporates the following specific macroeconomic assumptions, the 2022 U.S. and euro area GDP to expand by approximately 3.5% to 4.5% and 2.5% to 3.5%, respectively, and global benchmark rates to increase from historic lows with U.S. high yield spreads moving slightly above the historic average of approximately 500 basis points and inflation rates to remain elevated and above Central Bank targets in many countries. The contraction from the record prior year period was primarily driven by a decline in revenue attributable to volatility in the capital markets, which is really resulting from that heightened uncertainty given sort of the quarter’s geopolitical events. Our guidance for expenses over the full year assumes an increase in spending from the first quarter to the fourth quarter in the range of about $70 million to $90 million, and that’s because we anticipate steadily increasing organic investment activity through the cycle and that will be weighted towards the second half of the year. My first question, Rob and Mark, what sort of -- I am curious what sort of macro environment are you expecting here, say, by year end for the U.S. treasury rate or do you think trying and also the Fed rate at year end, what’s sort of embedded in your mind when you put out this global debt issuance outlook of down mid-teens? In the first quarter, just to put a couple of numbers around that, in terms of investment grade, we saw globally around 11% eligible investment grade issuers actually come to the market in the first quarter and that’s meaningfully below what we have seen over the last two years. And yes, we think this is a short-term cyclical headwinds and as we translate that then to MIS transaction revenue, we expect that to be balanced really between the first half and the second half of 2022, when historically, and I think this is the point that you are getting at on average, the second half has only contributed, let’s call it, 46%-ish of the year’s aggregate revenues. Similar to 2021 seasonality, we would expect MA’s organic investments to steadily increase throughout the year and that’s going to be commensurate with our ongoing revenue growth and those investments to be primarily weighted towards the second half of the year."
}