{
    "symbol": "MCO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-31 15:18:05",
    "content": " So it's going to take some time for these issues to resolve and for debt market activity to fully resume but refunding needs and pent-up issuance demand and baseline economic growth, they all point to a recovery in issuance, which we expect to pick up in the second half of the year. If I look at MA, we forecasted full year 2023 total revenue will increase by approximately 10%, and that's underpinned by broad-based strength across all lines of business. And as such, we expect MA's first quarter adjusted operating margin to be similar to our actual fourth quarter 2022 margin before improving through the remainder of the year, obviously, as revenue increases and as we realize the benefits of our cost savings. And while we don't typically provide expense growth forecast by segment, given we anticipate the majority of our 2023 strategic investments to support MA revenue growth opportunities, the full year segment operating expense guidance would be along the lines of low to mid-single-digit percent decline in MIS and a high single-digit percent growth in MA. Part of the reason why it was maybe a little bit lower than what I thought was the CapEx sort of staying at the $300 million range, roughly, let's call it like 5% of revenue. When I look at MA's ARR in the fourth quarter coming in at 10% and then the guide really is for it to accelerate to low double digit in '23, I just felt with that accelerating backlog, the bias for MA organic revenue growth would be above 10%. Your medium-term outlook, you said that's five years here, you're talking about low to mid-single-digit MIS revenue growth long term, which is the same range that you're giving for this year. And so as that -- if that mix shift changes back to what we've seen over the last, call it, six, seven years pre-pandemic, then yes, I think in that case, we'd see faster corporate growth that might provide some upside to the way we think about the medium-term targets."
}