{
    "symbol": "MCO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 15:37:16",
    "content": " Now taking the reduced MIS revenue guidance and the impact of foreign exchange into account, we now forecast Moody's full year 2022 revenue to decline in the high single-digit percent range and adjusted earnings per share are now projected to be in the range of $9.20 to $9.70. So for example, we remain committed to organically invest $150 million in areas this year like product development, sales distribution capacity as well as an additional $50 million into our -- and back to our employees, and that's going to be balanced against some of the new cost efficiencies, which are derived from the 2022, 2023 Geolocation Restructuring Program that we announced this morning. In terms of free cash flow guide for the year, what we wanted to do is to reflect the year-to-date global free cash flow of $628 million, and that was down around 49%, primarily on, to your point, the lower net income that's been driven by the reduction in MIS revenue due to significantly curtailed issuance. The midpoint of our revised full year 2022 free cash flow guidance of $1.4 billion to $1.6 billion does imply a free cash flow to U.S. GAAP net income conversion ratio, that's approximately 100%, and that's very much in line with our historical conversion levels. I guess what I'm asking specifically is in prior periods of issuance declines, and that's obviously what we're looking for 30% down, we've seen a pretty big snapback and I think a lot of people expect that to happen again next year. If we've got modest economic growth, which is the outlook, I think, kind of in the near to medium term, let's call it low single digits, then translate that to issuance growth and low single digits is probably a reasonable assumption based on history like I was just talking about. That's one example, but I'm going to come back to the key takeaway here for Decision Solutions because we've had some volatility in the revenue from quarter-to-quarter is look at ARR and ARR for Decision Solutions is 11% in the quarter, same as last quarter. When we set our medium-term outlook for MIS revenue in particular, we did build in a period of stress and economic stress into the model as the setting of our medium-term target really followed the point that you're making to historically strong years of issuance in 2020 and 2021."
}