{
    "symbol": "UHS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 12:24:06",
    "content": " So, I think on the acute side, there are specific headwinds, again, most of which I think Marc elaborate on, one â\u0080\u0093 and probably the biggest one is $100 million of COVID-related reimbursement that includes the Medicare 20% add-on, the Hertz  reimbursement and Medicare sequestration waver all of which get phased out at one point or another already phased out in 2023. I think the other main issue is that even though, again, as Marc commented, weâ\u0080\u0099re expecting premium pay to decline another one-third, maybe another $150 million, $160 million in 2023, what our experience has been is that the savings from that, and there certainly are some savings, but the savings from that are offset to a large degree by increased base wages, recruitment incentives, sign-on bonuses, that sort of thing. So looking at the two segments discretely, I think as weâ\u0080\u0099ve suggested a number of times in the past, we thought that as COVID volumes declined, the recovery in the behavioral business would be more accelerated than in the acute in large part because there was never any benefit to increased COVID volume in the behavioral business. And with regards to your question on inpatient versus outpatient, I mean, I think weâ\u0080\u0099re seeing what many are seeing, which is a continued shift to outpatient that has been accelerated through the pandemic weâ\u0080\u0099re trying to continue to do a lot of the things that weâ\u0080\u0099ve been doing in the last few years, which is to ensure that we have the proper paste load in our inpatient surgical areas especially with the increases in costs for staffing those areas, we want to make sure that we have the proper acuity. So as far as your first question on start-up losses, Kevin, we mentioned in â\u0080\u0093 or I mentioned in todayâ\u0080\u0099s call that we had $10 million in the quarter, I think we had said at the in our third quarter call that we had $45 million of year-to-date start-up losses. As far as just sort of how we think about 2023, is it sort of kind of a clean post-pandemic year, Marc made comments in his opening remarks about the idea that, number one, I think we view 2023 as a transition year, and we do so because I think one of the lessons that weâ\u0080\u0099ve learned during the pandemic is that even as COVID volumes decline, there is this sort of transition period as nurses returned to their regular jobs and physicians return to their regular practices and patients return to their regular utilization practices, et cetera."
}