{
    "symbol": "UHS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 13:51:04",
    "content": " Your line is now open. As far as underlying base wage rates, I think as weâ\u0080\u0099ve noted before, they have gone from sort of pre-pandemic increases also on the acute side specifically, from, letâ\u0080\u0099s say, 3%, 3.5% to something more like 4.5% to 5%. I think, what I would say is, we continue to believe that the historic levels of growth that weâ\u0080\u0099ve experienced in our behavioral business of mid-single-digit volume growth, 3%, 4%, 5% same-store patient day growth year-over-year, we believe thereâ\u0080\u0099s certainly still achievable once we can get beyond the current labor scarcity. Your line is now open. Your line is now open. Your line is now open. And again, Iâ\u0080\u0099ll repeat sort of what I said earlier, I think we have a view that as COVID volumes decline and we settle into sort of more of an endemic kind of an environment where there are not these extraordinary opportunities for nurses to chase premium dollars that are four times or five times their base salary that weâ\u0080\u0099ll see a bit more of a return to historic norms of nurses returning to full-time jobs, et cetera. Your line is now open. I think the fundamental challenge that we faced in our acute care business in Q2 was that as COVID volumes declined and they declined rapidly, we were unable to replace them at the same pace as we did, letâ\u0080\u0099s say, in 2021 with elective and scheduled procedures and the more acute and more profitable sorts of procedures that have sort of go missing during the COVID surges. Look, weâ\u0080\u0099ve talked about this for some time that, yes, we think there are a significant number of acute care hospitals who have existing behavioral services either a dedicated floor or a discrete building in which theyâ\u0080\u0099re offering behavioral services, but feel like theyâ\u0080\u0099re not terribly efficient or focused on delivering those services and are looking for a partner who is more expert, more experienced in doing that. Your line is now open. But I donâ\u0080\u0099t know that itâ\u0080\u0099s in any particular service line or payer I think, again, it is more than anything a reflection of the fact that we are slowly getting our arms around the labor scarcity issue, increasing our net hires, experimenting â\u0080\u0093 maybe not even experimenting anymore, but implementing new patient care models that rely somewhat less on RNs and on other caregivers so that the ultimate total care thatâ\u0080\u0099s given to patients and attention thatâ\u0080\u0099s given to patients is the same and itâ\u0080\u0099s the same quality, but just not as reliant on registered nurses. Your line is now open. Your line is now open."
}