{
    "symbol": "GOLF",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-07 05:14:03",
    "content": " And with this performance validation as a backdrop, I am pleased to report that Acushnet followed up 33% full year sales growth in 2021 by delivering first quarter sales of $606 million, an 8% constant currency increase or 4% gain on a reported basis as compared to Q1 2021. Golf balls were up 6% as we comped against last year's record Pro V1 launch and managed tight availability caused by raw material shortages, which have limited our production levels. And coming off last year's 29% growth, the Titleist gear business was down 17% in the quarter and has been impacted by supply shortages from last summer's Vietnam factory closures, port congestion and warehousing and fulfillment backlogs at our Midwest DC. As Tom will address, Acushnet's inventory at the start of Q2 was about $120 million higher than last year, which will help as we seek to keep pace with demand and replenish channel inventories. Consolidated net sales were $606 million, up $25 million or 4% reported and almost 8% level FX compared to last year. Gross profit for the first quarter was $317 million, up $6 million or 2% versus 2021, and gross margins were 52.3%, down 120 basis points. Our consolidated inventory at the end of Q1 was $449 million, which was up 36% from Q1 of the prior year with increases across all segments. Although we were able to increase our inventory levels during the quarter to better enable us to meet the continued high demand for our products, we are not yet at our desired inventory levels as demonstrated by our days sales and inventory, which were down to 128 days compared to 146 at the same time last year. We now think that's going to be closer to 45% for the year, and we certainly were higher in Q1 and we'll see continued elevated cost in airfreight for certainly the second and third quarter. Well, I think the EMEA situation is first half driven, but I do think EMEA, and particularly the U.K., is in line for a strong year and a large part of that is going to be driven by golf tours, I would say, and we see it in participation where there was modest growth in Japan and modest growth in Korea in the first quarter."
}