{
    "symbol": "AUID",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 20:23:12",
    "content": "  Operator: Ladies and gentlemen, thank you for standing by and welcome to the Q1 Fiscal Year 2022 Earnings Conference Call and Webcast. After the speaker's presentation, there will be a question-and-answer session. With me on today's call are Tom Timo, CEO Tripp Smith, our President and CTO, Stuart Stoller, our CFO, and Graham Rod, our General Counsel. By now, you should have access to today's press release announcing our first-quarter 2022 results. Throughout this conference call, we will be presenting certain non-GAAP financial information. Before we begin our formal remarks, let me remind everyone that part of our discussion today will include forward-looking statements, such forward-looking statements are not guarantees of future performance, and therefore, you should not put undue reliance on them. These statements are subject to numerous risks, and uncertainties that could cause actual results to differ materially from what we expect. Some of these risks are mentioned in today's press release, others are discussed in our Form 10-K and subsequent filings, which are made available at www.sec.gov. Welcome everyone to today's call, during which we'll talk about the market drivers and our progress made in the first quarter of 2022. Grace, let's turn to Slide 3. Whether it's Lapsus$ hacking Microsoft, and Okta, the solar wins breach or gaining operator losing $500 million in cryptocurrency gaming funds. Recent estimates indicate that by 2025, the total global cost of cybercrime is expected to reach $15 trillion. Even the white house has instructed all federal agencies and contractors to adopt zero trust with a specific directive to discontinue support for authentication methods that fail to resist phishing, including onetime codes or push notifications. And just last week on May, 5th, World Password Day, the three big tech giants, Microsoft, Apple, and Google, teamed up with the FIDO Alliance, which we are a part of, to announce, they will create an infrastructure for expanded support of a common password list sign-in standards. We believe that this announcement significantly enhances prospects for authID products, as it indicates the industry is moving to a password-less future in which our biometric identity authentication could play an integral part. In short, device authentication by itself simply does not provide an indisputable audit trail of who made a purchase or who transferred funds. Our verified platform solves this problem because we couple something you have, your FIDO2 device, typically an iPhone or an Android device or a laptop with something you are, your verified selfie. Together, these factors deliver the highest identity assurance secured by a seamless user experience. We continue to build a solid team, which brings a diversity of backgrounds and experience to help shape our strategy, products, and culture. Here, we highlight several hires and promotions made in sales and technology in the last few months. In addition, Joe Trelin joined our Board of Directors, bringing to the company invaluable industry experience in technology and product management as the former Chief platform officer of Clear and a former executive of NBC Universal and Amazon.com. And as we announced last month, Stuart Stoller, our long-time CFO will retire, and Annie Pham will succeed him as our CFO in June. On behalf of our entire team, I want to thank Stuart for your dedication and help and shaping our mission and building critical processes to support our growth. Over the course of her career, Annie has demonstrated active in across all aspects of finance, particularly with software, subscription and SaaS business models like ours. Annie also brings broad experience in public company and SEC reporting, secondary offerings and complex accounting transaction. Since the requirement for frictionless user experience is present in every sales conversation, the technology enhancements we made in the first quarter are helping our sales initiatives. These releases include a sleeker user interface, the incorporation of additional language preferences, and enhanced artificial intelligence algorithms that improve both the accuracy and speed of the user experience. Joining the Microsoft partner program with a low code deployment of verified to provide biometric authentication for Office 365 and Azure, broadens the distribution of our verified CloudConnect integration. In February, we received US PTO Notice of Allowance of our patents to be issued tomorrow on May 10th. This patent protects verified multi-factor authentication methodology, which combines an accountholder's explicit consent for a transaction, with identity verification, and secures it with a unique, digital signature. Last week, we announced independent confirmation by iBeta that our Passive liveness detection achieved conformance with ISO 30107-3 Level 1 and Level 2 standards for Presentation Attack Detection, or as it's known PAD, with a perfect score. Best-in-class liveness detection is critical to ensuring strong protection from penetration attacks, spoofing, and other social engineering attacks, that have plagued others in our industry. This is just one aspect of our commitment to continuous platform enhancements so that we may deliver the highest levels of security and build a safer, next-generation, digital identity landscape. In the first quarter of 2022, we signed agreements with a U.S. medical certifying board, a FinTech provider of tax information to more than 50 lenders, as well as a leading platform for medical professionals. Also, through our U.S channel partners, we added several Fin Tech customers who offer consumer, auto and medical financial services. Using a proven playbook to generate leads, we are building a robust pipeline that focuses on those verticals most impacted by the rising threats of cyber attacks and account takeovers, including cybersecurity vendors, healthcare and Fin Tech companies that provide both financial services and crypto currencies. From launching our MVP or minimum viable product in October, our team has executed extremely well to rapidly deliver engaging marketing and sales campaigns and product enhancements that speed adoption and implementation with low code integration. As a result, we expect that we will start reporting on our identity KPIs in our next quarterly results call in early August. Those KPIs include identity booked ARR, identity deferred revenue, and identity annual recurring revenue. Now, let me turn the call over to our CFO, Stuart Stoller, to provide an overview of our financial results for the first quarter. Following my remarks to compare the quarter ended March 31, 2022 with the quarter ended March 31, 2021, unless specified otherwise. Total revenue primarily derived from legacy business for the three months ended March 31, '22 was unchanged from last year at $0.6 million. Operating expenses for the first quarter of 2022 was $5.9 million, an increase of approximately $3.1 million, principally due to higher non-cash compensation expenses of $1.3 million, as well as higher salary technology and marketing costs. First-quarter 2022 adjusted EBITDA loss, which is adjusted earnings, are earnings before interest taxes, depreciation, and amortization, and other non-cash or non-recurring items was $2.9 million dollars up from an EBITDA loss of $1.3 million dollars. As announced in our press release, we initiating plans to exit all legacy businesses in order to minimize cash investment on them going forward and to maintain our focus on growing our core verified biometric identity or authentication revenue. As a result, we expect our core identity revenue specifically our KPIs, our booked annual recurring revenue BAR and deferred revenue will expand in 2022. With respect to our multi-pay subsidiary in Columbia, we will incur certain costs associated with it's employees and other contractual obligations. Multi-pay will continue to service it's customer base in the interim, as we look to minimize all costs. We're not yet able to determine the est -- we are not yet able to estimate the cost to be incurred as a result of this decision, but our current estimates are that cash costs will not exceed $250,000. We have not recorded the potential costs or write-down in the three months ended March 31, 2022. In addition, we're planning to exit the South African cards plus business, and will seek a buyout of our interest. If we are successful in selling our interest, we would expect a net cash inflow as a result of the planned exit of this business. Based on these preliminary discussions, we have decided to write down the value of the cards plus intangible assets and have recorded a non-cash impairment charge of approximately a $144,000 in the three months ended March 31, 2022. In the three months ended March 31, 2022, these businesses contributed approximately $0.4 million in revenue, and these businesses had a net loss of approximately $57,000. Turning to Slide 9. with respect to our $22.5 million financing, it included 9.2 million of three years 9.75% convertible notes, $3.3 million solid sale of stock and $10 million of evolving credit facilities. Furthermore, we were able to extend the maturity of our pre -existing $0.7 million convertible note from February '22 to December 31, 2022. Lastly, the maturity date of the 9.2 million new convertible notes is March 31, 2025, with no principal payments until then. And as a result of the financing, our cash-on-hand as of March 31, 2022 was $13.8 million, and working capital totaled approximately $12 million. Looking ahead, we anticipate our cash burn rate to approximate a million dollars a month, and then improving as we aired revenue from our core operations. We iterate our previous guidance, we estimate having sufficient cash to fund operations through 2023 and estimate being cash flow positive as we enter 2024. Finally, as this will be my last quarterly earnings conference call before I retire, I would like to thank the investors, the current and former board members, and my current and former colleagues for wonderful five and a half years. I also want to welcome Annie Pham as she prepares to take over the CFO role, and I will continue to be available on a consulting basis to ensure a seamless transition. You mentioned the announcement by the three major tech companies, Apple, Google, and Microsoft, and I wondered what you - if you could expand a little more on what you believe the impact is of these three, announcing that they're working towards a common goal. First and foremost, when you've got an early-stage company that is offering something highly disruptive to the marketplace, there's a number of things you need. First, you need a large market; there's no question that authentication is a very large market opportunity. You need highly differentiable in defensible IP; I think with the combination of our success, positioning our product in the market and the patent success portfolio that we built, we are both highly differentiated and highly defensible. And it's not very often that you see Apple, Google, and Microsoft agree on much, but they have agreed for a framework for password list, log in, and identity authentication. That means that today, when I log into my Gmail, my Apple ID, or my Microsoft Office 365, I use a username and password, not for much longer. Because when Apple, Google, and Microsoft make it that easy for you to login, every other major institution that deals with consumers, is going to have to do the same thing, which begs the question that authID is uniquely positioned to answer. Who is the person that's making the transaction, not what is the device that's making the transaction. This is why this news is really exciting to all of us at authID, market timing is now. And to Apple, Google and Microsoft, let's add the fourth horseman, Amazon. And while I think all can see the convenience they're adding to their customers by allowing them to log in with their device, I think it is a big leap to think that Amazon AWS, Apple iCloud, Microsoft Azure, and Google Cloud are all going to cooperate on the same cloud platform. And we built a highly defensible product that meets an enormous market opportunity, where thanks to Apple, Google, and Microsoft, the market timing is now. Well then in closing, every headline of fraud, every story of phishing attack, and even last week's announcement, further validates that we are on the right track, and that authID is the right solution, to support a world with secure password-less biometric authentication, delivers fortified security and strong identity insurance. We look forward to continuing to grow our sales pipeline, delivering value to our customers, and to reporting our metrics and guidance on our very next earnings call. Ladies and gentlemen, this concludes today's conference call."
}