{
    "symbol": "VTSI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-31 23:42:10",
    "content": " Joining us for todayâ\u0080\u0099s presentation are the companyâ\u0080\u0099s Chairman and Co-CEO, Bob Ferris; Co-CEO, John Givens; and Chief Financial Officer, Alanna Boudreau. Before we begin the call, I would like to provide VirTraâ\u0080\u0099s Safe Harbor statement that includes cautions regarding forward-looking statements made during this call. During this presentation, management may discuss financial projections, information or expectations about the companyâ\u0080\u0099s products and services or markets or otherwise make statements about the future, which are forward-looking and subject to a number of risks and uncertainties that could cause actual results to differ materially from the statements made. Finally, Iâ\u0080\u0099d like to remind everyone that this call will be made available for replay via a link in the Investor Relations section of the companyâ\u0080\u0099s Web site at www.virtra.com. Now, Iâ\u0080\u0099d like to turn the call over to VirTraâ\u0080\u0099s Chairman and Co-CEO, Mr. Bob Ferris. After the market closed today, we issued a press release that provided our audited financial results for the full year ended December 31, 2022, along with highlighted business accomplishments. As a brief overview for today's call, I'll begin by providing highlights for the fourth quarter and full year 2022. We generated record bookings and grew revenue for the 17th consecutive year, increasing the top line 16% to a record 28.3 million. On top of this, we delivered another year of solid profitability, generating 3.6 million of adjusted EBITDA and 2 million of net income. In addition to the strong financial performance we delivered last year, we achieved several significant operational milestones that have positioned us for long-term success. We made judicious investments in our technology that from a competitive standpoint, further differentiated our products in the market. These efforts included refinements to our software and upgrades to certain accessories, like our VirTra Threat-Fire device and Drop-In Recoil Kit capabilities, which make our solutions more indispensable and effective. In fact, I even state that anyone who attended ITSEC and tried out all small arms training options at the show would walk away realizing that VirTra is the gold standard, an accomplishment that is a result of enormous investment in both time and resources. Much of the financial investment is in the rearview mirror, like our VirTra Volumetric Video or V3-enabling technology, but we will continue to prioritize cost effective enhancements to ensure exceptional value for our customers. In Q4, we introduced our breakthrough technology V3, which has the potential to provide a step function advancement in training content for our customers. High quality realistic content is a key differentiator for attracting and retaining customers in our market, and V3 helps us to continue building upon our advantage in this essential area. Our investments have strengthened our position in every major aspect of training simulation, making us more competitive for 2023 and beyond. The move in our Chandler, Arizona headquarters is near complete, and we're looking forward to having the core of our operations centralized under one roof. In addition to driving efficiencies, the 83,000 square foot facility houses the most advanced development and production facilities in the industry, an attractive selling point for customers and partners alike. In the fourth quarter, we also officially opened our facility in Orlando, Florida. We hosted an open house event in October where we showcased our products and provided immersive training demonstrations to military, law enforcement, industry contractors and government officials. She has extensive experience overseeing accounting activities for public companies, and most recently led accounting activities for a publicly listed global industrial laser company. Her experience with public company reporting and her strong management skill set make her a great fit for VirTra, and she has already begun to make meaningful contributions to our financial operations. In the fourth quarter last year, we added Gregg Johnson to our Board. As background, Gregg was the primary advisor at our board on our successful effort to list our stock on NASDAQ, and he was a member of VirTra's advisory board. He is one of the most accomplished, thoughtful and well connected leaders in the law enforcement industry. And he brings a tremendous level of expertise in public safety, tactical training, operational growth, and command accountability to our team. Our government revenue increased by 33% from the prior year, from 16.8 million to 22.4 million due to improved success in the law enforcement market as well as an increase in federal government police contracts. Internationally, we saw a 6% decrease in our revenue to 4.2 million from 4.4 million, which was a result of contract timing. As a reminder, the STEP program provides recurring revenue for VirTra that also offers an easier on ramp for smaller agencies interested in our solution, but are perhaps budget constrained for an outright purchase. In 2002, STEP revenue was 2.9 million representing 10% of total sales and growing 48% from the prior year. In summary, our financial and operational performance in 2022 was strong and left us well positioned to continue our profitable growth path into 2023 and beyond. As Bob alluded to earlier in the call, the finalization of our move into our Chandler, Arizona headquarters and additionally our facilities in Orlando have helped in many ways, but especially as it pertains to product manufacturing, sales, order fulfillment and customer success. These capabilities have already begun to show meaningful improvements in efficiency, product quality, which allows us to fulfill orders quicker and reduce our backlog at a much higher rate. As I talked about in the third quarter call, the Orlando facility is an extension of our military sales effort and serves as the East Coast hub for customer service, live demonstrations and meeting site for prospective customers. With Orlando being the acquisition epicenter of the military simulation market, we are in a strategic position to provide our expertise to the industry that is seeking cutting edge solutions. The convenience factor is huge for major customers and prime contractors alike, and the live demonstration capabilities just down the street, now that's a business developerâ\u0080\u0099s dream. In fact, it's my opinion that as of today, for the military market, VirTra has more staff, more expertise, more technology, more investments to benefit the customers, and more relevant capacity than any other company in the industry. Regarding staff and our operations, we worked diligently throughout 2022 to improve our ERP system and we are in a much better position to realize operating efficiencies going forward. Additionally, we are beginning to build out our teams to further support our customers in a scalable fashion. We introduced a dedicated quality team to ensure that we are putting out the best product possible and we have vastly improved our customer support function, including field service representatives that are not only meant to increase customer satisfaction but increase our ability to install more systems, reducing the backlog. Moving specifically to military operations, we are seeing strong interest and have been hard at working to build the pipeline. In tandem with being able to build relationships in person with military and government officials, my extensive experience in military simulation market and time served in the U.S. Army have brought me many strong connections that will be critical to our growth in this market. And finally, having a strong product offering is critical to the success of this market as is true in any industry. Our October open house event was a great success and sparked new promising leads while introducing and more importantly, a mature leading product from the law enforcement industry to our military community and existing customer contacts. Looking ahead, our operational and technological advancements in 2022 have bolstered our competitive position and placed us on solid growth trajectory for the years ahead. The growing demand and constructive funding environments for VirTraâ\u0080\u0099s innovative training solution gives us confidence in our ability to capitalize on the robust pipeline of opportunities in law enforcement, military and international markets. So now that I'm approaching a year at the company, I'd like to reflect on my findings and our corrective actions regarding the company's performance expectations and the focus that we brought to the table. The company's made some huge mistakes, including the ERP implementation. Inexperienced staff in key leadership positions, lack of processes, lack of timely financial reporting, this all added to problems. But despite the major business setbacks, the company has managed to show some modest growth. There are two reasons for that modest success in my opinion, a superior product that's second to none, and aligned staff dedicated to those they serve. Keep in mind, we weren't able to really start working on significant change until our filings were completed, we removed the red flags and after the reorganization in August of 2022, and we still have a lot of work to improve sales, supply line, inventory management, and finalizing our capital improvements. It's a pleasure to be speaking to you today and to review our audited financial results for the fourth quarter and the full year ended December 31, 2022. In my first few months at VirTra, I've already seen our team's remarkable dedication to our customers and equally strong commitment to our mission. With that, I'll get started on the Q4 and full 2022 financial update. Our total revenue for the fourth quarter of 2022 was 8.7 million, which was up slightly from the 8.6 million of revenue we recognized in the fourth quarter of last year. For 2022, total revenue increased 16% to a record 28.3 million from 24.4 million in 2021. As a result of our operational streamlining, we were able to deliver the first 16 systems of a large federal contract within 90 days of purchase order receipt. Gross profit margin for the fourth quarter of 2022 was 61.4%, an improvement from 32.7% in the fourth quarter of last year. And for 2022, gross profit increased to 16.3 million from 11.4 million in 2021. Gross profit margin for 2022 was 57.4%, an increase from 46.7% for 2021. For 2022, net operating expense was 13.7 million compared to 10 million in 2021. The increase was primarily due to a 74% increase in our sales and marketing spend from our increased participation in industry trade shows and the associated travel as well as a 39% increase in R&D expenses, and an increase in one-time costs related to the facility move and re-launching our ERP system. For the fourth quarter of 2022, we recorded operating income of 1.9 million compared to a loss of 0.2 million in fourth quarter of 2021. For 2022, our income from operations was 2.6 million, an improvement from the 1.5 million of 2021. This was an increase of a net income of 13,000, or less than $0.01 per diluted share in the fourth quarter of 2021. For 2022, net income totaled 2 million or $0.18 per basic and diluted share, which compares to a net income of 2.5 million or $0.25 per basic and diluted share for 2021. Our adjusted EBITDA, a non-GAAP metric for the fourth quarter of 2022, was 1.7 million compared to 0.5 million in the fourth quarter of 2021. For 2022, adjusted EBITDA totaled 3.6 million, an increase of 1.2 million in 2021. For fourth quarter and full year 2022, we received booking totals of 6.4 million and 33 million, respectively. Furthermore, we define backlog as the accumulation of bookings from signed contracts and purchase orders that are not started or uncompleted and cannot be recognized as revenue until delivered in a future period. As of December 31, 2022, our backlog totaled 27.7 million which was up 20% from December 31, 2021. As of December 31, 2022, we had unrestricted cash and cash equivalents of 13.5 million compared to 15.7 million at the end of third quarter. From a working capital standpoint at the end of fourth quarter, we had 24.3 million in working capital, a decrease from the 25.7 million at the end of Q3. VirTraâ\u0080\u0099s cash balance decreased as we continued the construction of the new building, which has increased our property, plant and equipment balance, and we saw an increase in our accounts receivable and unbilled revenue as items shipped to our customers at the end of the quarter. In closing, 2022 was a successful year for onboarding tremendous new talent and implementing the right processes for VirTra to win and service larger volumes of business. With new operational systems in place, we expect to build out our business pipeline in both our law enforcement markets, international markets and military markets in 2023. Just want to start, Bob, with sort of your last comment on the sales pipeline. But overall, we're still seeing people willing to spend money on effective training solutions. And so with that, it seems like there's a continued emphasis on how do we properly train people for lethal force. We plan to continue that, but it's a constant effort, much more than we had to do three or four years ago on doing that. And with the ERP reimplementation, we're able to manage our vendor pipeline much better. The only thing that we see remnants of the supply chain issues is that when the vendor makes a mistake on a larger order, it does take a little bit longer because they don't have stock and supply. But yes, a little bit -- it's getting a lot, lot better. One thing that differentiates VirTra in our market is we have teams of engineers on staff, many of whom have worked at VirTra for years. And other companies we compete with, many times they hire a 1099 staffer or they hire a firm to do a project and then it goes dormant and then years later to modify it or change it, it's a big problem. So by VirTra having teams of engineers and having enough scale in our industry to afford to do that, when things like that happen we have a much easier time in accommodating it because we have that kind of trained staff on site versus trying to track down what company did it or what 1099 employee did it for us. But was this a case of a sales strategy not being well thought out or not going after the right customers, any additional color would be helpful. And classic mistake, if you took every business case from Harvard that talks about implementation of large systems, I think someone uses a roadmap to make all the mistakes every single one that people have made. And so unraveling that, the problem with that is so systemic because if that's the heartbeat of the organization, it messes up all your processes, everybody was trying to manage things separately, with spreadsheets and all of that is part of the reasons why financials weren't complete. But now that that's all been corrected and we're continuing to take advantage of the ERP, there were things that weâ\u0080\u0099re taking advantage of that makes the business much more streamlined. And the effort of the folks that are here now really have jumped in, and we're seeing where we're building reports where we're catching things way ahead of time, and we're not sending things out incorrectly. In the operation piece, we've changed how we're now building systems in separate job groups. And keeping those customers and keep dripping them so that they'll spend additional revenue with us, that's kind of a model. Our internal goal and our stretch goal is that once we get a PO, we want the systems going out the door in 30 days, but the staff themselves have challenged themselves to once we get an order, it'll be out the door in seven days. I would just add that if VirTra was able to achieve 30 days, that would probably break all records in our industry. If we hit seven days, there's not a company that's been able to sustain that speed of delivery. But seven day turnaround on product would be an incredibly efficient, very streamlined process and an operational system which would be a bit of a miracle in our industry. One, we haven't raised the price as much and so a lot of the price increases on some of the products, we just had a modest price increase. But now getting to the point where we have all of our costs accounted for, both labor, our COGS are fully laid out, we're able to stay competitive by raising those margins. They'll go up a little bit -- they'll go up some more, because we have some more efficiencies in areas that weâ\u0080\u0099re cleaning up and finalizing those processes and making it much more robust. But I would say maybe 10% higher is kind of where I would -- it would be a fair target over the next 18 months, because we might improve some quality, we might have a little increasing costs to improve some quality. I think we'd also be able to take advantage and make the margins higher by technology, reducing some of the equipment. And then --\n I'd also like to note that in the history of military simulation training, when companies have been able to win larger military contracts, they get a lot more economies of scale on those, whereas police contracts are often smaller and are more diverse equipment, which makes it a bit tougher to have larger margins on. And last for me will be you started to touch on or actually answer my last question, so with the efficiencies you're done and are able to achieve with the systems now more streamline, your G&A has actually gone down two quarters in a row. Right now, the way we're building the scalability of the company would be to handle growth without having a lot of expense. We invested in the ERP system and are reinvesting in it to get it improved and much more effective than the first implementation where we had a lot of problems, as John mentioned. If we see a good return on investment, then, John and I, we want to be the most competitive company in the industry. We would prefer to move into the mode of higher efficiencies on SG&A, a reduction of capital spend now that V3 is set up, and a lot of our construction is done. I think it's going to -- even as we increase business, I don't think we'll reach equilibrium. Please know that we are dedicated more than ever before to building shareholder value and building the world's most effective simulation training products, so that the war fighter and the law officer can serve their country, accomplish their mission, and make it home safely. With 2023 off to a strong start, I firmly believe the best days for VirTra are ahead of us."
}