{
    "symbol": "VTSI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-19 12:37:06",
    "content": " Before the market opened today, we issued a press release that provided our financial results for the second quarter and 6 months ended June 30, 2022, along with highlighted business accomplishments. In our commercial segment, which includes military sales through a prime contractor, revenue grew over fivefold in the first half of the year to $5.2 million as we continue to penetrate key markets where VirTra has a competitive solution. It's a pleasure to be speaking to you today to review our financial results for the second quarter and 6 months ended June 30, 2022. For the 6 months ended in 2022, total revenue increased 52% to $14.8 million from $9.7 million in 2021. For the 6 months ended in 2022, gross profit increased 48% to $8.4 million from $5.7 million in the 6 months ended in 2021. For the 6 months ended in 2022, net income totaled $1.4 million or $0.13 per basic and diluted share, which compares to net income of $1.2 million or $0.13 per basic and diluted share for the 6 months ended in 2021. For the 6 months ended in 2022, adjusted EBITDA totaled $2.3 million, an increase from $1.8 million in the 6 months ended in 2021. And John, just to be clear, and one reason John was ready to jump in on that question too is, John -- even though we talk about John's military market expertise, which is pretty close to second to none, from my 29 years in the simulation industry, he is actually actively involved in VirTra at the highest level for both sides. But yes, we're anticipating that we will be seeing a lot of positive results from the fact that we might have done a military project at a considerable discount than we would normally charge for our products just to make sure we got our foot in the door, to make sure that we got the product developed to the way the military would want it and almost likely to pay the R&D project where we would have spent our own money to go do it, but we were able to actually get it offset or funded by a customer, which is -- you may know our history, we're a company that really began with bootstraps and we're normally a company where if we want to put money in our bank, we need to go make profitable products and have earnings, and that's how we do it."
}