{
    "symbol": "ECOR",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-06 11:25:28",
    "content": " Iâ\u0080\u0099m pleased to report that revenue for the three months ended September 30, 2022, was almost $2 million, a healthy 33% increase over $1.5 million in the year ago period. Gross margins expanded nicely to 87% and net cash used in operations was about $4.6 million for the quarter ended September 30, 2022. Revenue from the U.S. commercial headache channel was $411,000 for the quarter ended September 30, a 160% increase from $158,000 in the third quarter of 2021. Net sales from the Department of Veterans Affairs or the VA and the Department of Defense, or DoD, were $1.1 million, an increase of 21% as compared to $946,000 in the third quarter of 2021. A total of 113 VA and DoD military treatment facilities have purchased gammaCore products through September 30, 2022 as compared to 96 through the third quarter of 2021. Revenue from channels outside the United States increased 9% to $417,000 in the third quarter of 2022, as compared to $383,000 for the third quarter of 2021, and we look forward to steady growth in this channel through the rest of 2022. For the third quarter ended September 30, 2022, electroCore reported net sales of almost $2 million as compared to $1.5 million during the same period of 2021. Total operating expenses in the third quarter of 2022 were approximately $7.3 million, an increase of approximately $2.2 million from $5.1 million in the third quarter of 2021. Research and development expense in the third quarter of 2022 was $1.6 million as compared to $470,000 for the same period in 2021. Selling, general and administrative expense in the third quarter of 2022 was $5.7 million compared to $4.6 million for the same period in 2021. Net cash used in operating activities during the quarter ended September 30, 2022, was approximately $4.6 million as compared to $3.4 million in the third quarter of 2021. Cash, cash equivalents and restricted cash at September 30, 2022, totaled approximately $21.9 million as compared to approximately $34.7 million at December 31, 2021. I see many potential growth drivers in the remainder of 2022 and 2023, including continued penetration of the VA DoD channel in the United States, continued penetration of the UK market, growth in our U.S. commercial channel, driven by cash pay business models and direct-to-consumer advertising, while we continue our efforts to gain commercial insurance coverage, and expansion of our international business through our distributor network and added traction within the UK e-commerce store. And so, the combination of our field sales personnel and the associated 1099 reps working in concert with our inside sales and our customer experience team were getting better and better at that high touch, staying in contact with the supply chain folks at the VA hospitals, as well as just our increased ability to open up new hospitals, partly because of the team that we put together, and letâ\u0080\u0099s face it, the pandemic is still receding, and so the VA hospital system is slowly but surely adjusting to the new normal and letting us in."
}