{
    "symbol": "ECOR",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 08:01:18",
    "content": " Revenue for the second quarter of 2022 hit a record $2.2 million, increasing approximately 70% over the second quarter of 2021 and approximately 14% sequentially. Gross margins expanded to 83% and net cash used in operations was about $3.2 million for the quarter ended June 30, 2022. Net revenue from the U.S. commercial headache channel was $501,000 for the quarter ended June 30, 2022, a 382% increase from $104,000 in the second quarter of 2021. Net sales from the Department of Veterans Affairs or the VA and Department of Defense, or DoD, were $1.2 million, an increase of 53% as compared to $779,000 in the second quarter of 2021. A total of 106 VA and DoD military treatment facilities have purchased gammaCore products through June 30, 2022, as compared to 85% through the second quarter of 2021. Revenues from channels outside the United States and exclusive of the Teijin license fee increased 8% to $419,000 in the second quarter of 2022 as compared to $387,000 for the second quarter of 2021 and we look forward to continuing growth in this channel for the rest of 2022. For the second quarter ended June 30, 2022, electroCore reported net sales of $2.2 million as compared to $1.3 million during the same period of 2021. Gross profit for the second quarter of 2022 was $1.8 million as compared to $895,000 for the second quarter of 2021. Total operating expenses in the second quarter of 2022 were approximately $7.6 million, an increase of approximately $1.5 million from $6.1 million in the second quarter of 2021. Research and development expense in the second quarter of 2022 was $1.3 million as compared to $825,000 for the same period in 2021. Selling, general and administrative expense in the second quarter of 2022 was $6.3 million as compared to $5.3 million for the same period in 2021. Net cash used in operating activities during the quarter ended June 30, 2022, was approximately $3.2 million as compared to $1.7 million in the second quarter of 2021. Cash, cash equivalents and restricted cash at June 30, 2022, totalled approximately $26.6 million as compared to approximately $34.7 million at December 31, 2021. Looking ahead, for the third quarter of 2022, we expect net revenue to approximate Q2 2022 levels and net cash usage to be between 4.5 and $5 million. I see many potential growth drivers through 2022 and 2023, including continued penetration of our VA/DoD channel in the United States, continued penetration of the United Kingdom market, growth in our U.S. commercial channel driven by cash pay business models and direct-to-consumer advertising, while we continue our efforts to gain commercial insurance coverage and finally, expansion of our international business through our distributor network and added traction within the U.K. e-commerce store."
}