{
    "symbol": "TRTX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 21:27:04",
    "content": " In management's judgment, this significant increase was warranted by the rapid and material weakening of the debt capital markets and the investment markets for office properties, which we have observed since we downgraded eight office loans at the end of the first quarter of this year, and that pace is especially accelerated during the past four months. Please proceed with your question. Please proceed with your question. Please proceed with your question. And I think that what you're seeing and hearing from us as we think through our CECL reserve is just trying to reflect the fact that it's really more about the capital markets activity, appetite for real estate -- sorry, appetite for office lending has really tapered off into the end of the year. So over the past quarter with what -- with our nearly $1 billion of investments, all of those investments for finance be non-mark-to-market structures, but we've been sort of holding that CLO reinvestment capacity in our back pocket a bit and really first exploiting both the A-note or note-on-note market first and then second, potentially looking at the CLOs for financing options. Please proceed with your question. And right now, they're basically coming to lenders like TRTX and saying and effectively bridging that with us until -- so I would describe it to really like have it be more succinct from my response, I would say, it's more of a bridge towards capital market stabilization than a bridge towards a really heavy business plan that's going to take three to four years. I would say, secondly, in terms of -- given that -- again, we're not the equity, we're the debt, and we're generally coming in at roughly 65% approximately LTV, given our discount to values and the available financing that really still remains in multifamily, we still feel really confident about the multifamily sector as a space where we want to be orienting our investments. Please proceed with your question."
}