{
    "symbol": "CYAD",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-05 09:38:03",
    "content": " Before we begin, I would like to remind everyone that today's event may contain forward-looking statements within the meaning of applicable securities laws, including the Private Securities Litigation Reform Act of 1995. Forward-looking statements may involve known and unknown risks and uncertainties, which may cause actual results, financial condition, performance or achievements of the company to differ materially from those expressed or implied by such forward-looking statements. A list and description of these risks, uncertainties, and other risks can be found in the company's U.S. Securities and Exchange Commission filings and reports, including in its annual report on 20-F filed with the SEC on March 24, 2022 and subsequent filings and reports by the company. The company expressly disclaims any obligation to update any such forward-looking statements made on this call to reflect any change in its expectations with regard thereto or any change in events, conditions or circumstances on which any such statement is based, unless required by law or regulations. Let me now turn the call over to Michel Lussier, interim Chief Executive Officer of Celyad Oncology. Thank you, Sara and thank you, everyone, for joining us today for our financial results and operational results update call for the first half of 2022. We will start today with an operational and clinical update, followed by an overview of the financials and outline, we expect key milestones of the company over the next several months. So, there has been many change to the company in terms of the clinical candidates and leadership in the first half of the year. David has been with the company almost eight years and he felt this timing was a natural transition as the new Head of R&D Dr. Eytan Breman, takes over to continue our work on our shRNA platform and discovery CAR T programs. So, while we've had many changes in the past few months, we look forward to focusing our efforts on four major pillars of the business to maximize all potential value drivers of the company in the coming months and years. We introduced this platform last year and although we did make the decision in April to stop development of CYAD-203, our allogeneic shRNA-based IL-18 armored NKG2D CAR T candidates. I want to note that we're making promising progress in multiple discovery programs focused on the core expression of IL-18, including the expiration of backup allogeneic NKG2D receptor CAR T candidates, which leverage this platform. Currently, our armored CAR Ts are engineered to release IL-18 providing the opportunity to drive increased potency of our cell therapy by impacting the CAR T and the local tumor microenvironment, especially important for the treatment of solid tumors. Moving to our pipeline, our next pillar, we've had challenges and opportunities related to our allogeneic CAR T candidates this year and are happy to announce that our trials are getting back on track where they should be. At the end of July, we received notification from the FDA that they are lifting the clinical hold put on our investigational candidate CYAD-101. In addition, enrollment for the dose escalation portion of immunity IMMUNICY Trial with CYAD-211 has been steady with one patient enrolled per month and we're excited about the data we're generating and we'll share this year. As Michel just discussed, we have several updates related to our pipeline in the first part of 2022. Let's first turn to CYAD-101 Celyadâ\u0080\u0099s first-in-class non-gene edited clinical candidate that co-expresses the NKG2D receptor and the novel TCR inhibitory molecule or TIM, which interferes with native CD3 zeta â\u0080\u0093 reducing the signaling of the TCR complex. Of note, CYAD-101 is the only investigational candidate from the company using the TIM technology. And in December 2021, began the CYAD-101-002, otherwise known as KEYNOTE-B79 clinical trial. This phase 1b trial is evaluating CYAD-101 followed by Merck's anti-PD-1 therapy KEYTRUDA in refractory mCRC patients with microsatellite-stable mismatch repair-proficient disease, a difficult indication for immunotherapies to date. As Michel just mentioned, the FDA has lifted the clinical hold previously put on this trial. Our second Phase 1 trial evaluates CYAD-211, a potential first-in-class allogeneic CAR T candidate engineered to co-express a BCMA targeting CAR and a single shRNA, which interferes with the expression of the CD3Î¶ component of the TCR complex. CYAD-211 is currently in the dose escalation portion of the Phase I IMMUNICY-1 trial, which is evaluating the tolerability and clinical activity of a single infusion of CYAD-211 following preconditioning with cyclophosphamide and fludarabine, that is CyFlu, in patients with relapsed and refractory multiple myeloma. Initial data from IMMUNICY-1 showed all patients had detectable CYAD-211 cells in the peripheral blood, although engraftment to date has been short lasting. Now, our current segment of IMMUNICY-1 follows an enhancement for the depletion regimen with the aim of improving cell expansion and persistence and to potentially maximize the clinical activity of CYAD-211. In addition, we are also evaluating increased dose of CYAD-211 within the IMMUNICY protocol, which might help drive additional clinical beneficial â\u0080\u0093 clinically beneficial responses. For this trial, we plan to share additional clinical data during the second half of 2022. We've made great progress, particularly with our shRNA technology in previous and current clinical candidates. We have continued to expand our research efforts into how to best leverage the dynamic potential of the shRNA platform, including multiplexing and targeting immunoevasion and its potential to serve as a backbone for  using our proprietary shARC franchise. Turning to our financials, I would just like to remind you all that full financial details available on the Celyad Oncology website in both French and English languages. Our research and development expenses were â\u0082¬10.5 million for the first half of 2022, compared to â\u0082¬10 million for the first half of 2021. The â\u0082¬0.5 million increase was mainly driven by intellectual property filing and maintenance fees to strengthen intellectual property prosecution and also by the increase of employees expenses related to movement of employees through the year 2021 and 2022, to support the group's free clinical and clinical programs. This increase has been partly compensated by the decrease of clinical activities, mainly due to the Phase 1b, CYAD-101-002 KEYNOTE trial, which was on clinical hold during the second quarter of 2022. General and administrative expenses were â\u0082¬6.2 million for the first half of 2022, compared to â\u0082¬4.8 million for the first half of 2021. The increase was associated with an increase in insurance costs combined with the increase of employee expenses, mainly related to movements of employees with the six-months period ended June 30, 2022. Net other income for the first half of 2022 was â\u0082¬1.6 million, compared to a net order income of â\u0082¬1.8 million for the first half of 2021. Net loss for the first half of 2022 was â\u0082¬14.1 million or   per share, compared to a net loss of â\u0082¬14.9 million or â\u0082¬1.02 per share for the same period in 2021. As of June 30, 2022, the company had a treasury position of approximately â\u0082¬14.4 million or $15 million. As of June 30, 2022, the total number of basic shares outstanding were 22.6 million, which is similar to the situation of 31 of December 2021. So, in closing, we're looking forward to this renewed sense of focus and strategy for Celyad Oncology. As mentioned previously, we will be exploring four main pillars of strategy to further leverage all possible value drivers for the company. These include examining the way we're using our manufacturing expertise, our intellectual property portfolio, our clinical pipeline candidates, and our current R&D endeavors. So, one of the â\u0080\u0093 both of the patients who had past â\u0080\u0093 have a history of exposure to   around about six months away. So, we felt having seen that we should use six months if you like as a baseline because obviously we had other patients who have been treated within six months, who had not had severe adverse effects. But if we take six months of baseline and then a conservative, sort of washout time, five half-lives of , for example, takes you out to about 10 weeks. We're having a very broad portfolio ranging from allogeneic patents to NKG2D, shRNA, and a lot of patents also developed internally, organically at Celyad. Well, basically, if you could get back years ago when Celyad and even previously  got engaged in cell therapy, it was very difficult for early stage companies not to have a GMP facility because it was not available. And in the past, we've come through periods where because of timing of clinical studies our resources were underutilized and we have a history in the past of, for example, having other companies in the cell therapy to take   some of our space."
}