{
    "symbol": "ATEX",
    "quarter": 3,
    "year": 2023,
    "date": "2023-02-14 16:57:02",
    "content": " And in addition to the pipeline on each call, we've shared many other examples of the momentum we are experiencing, whether it be in the form of experimental licenses, LOIs, participation in key industry events or additional details on specific contracts, our goal has and continues to be to provide investors with a level of transparency that demonstrates the progress we are making in moving each utility and the entire sector to execute on our goal of being the de facto private wireless broadband provider to utilities. I'm proud of all of the accomplishments of our team at Anterix and the combined contributions of our entire ecosystem, who remain steadfast focused on ensuring private broadband networks, unlock the most significant outcomes possible to ensure we are able to address the generational challenges faced with today's electric grid. I mean, what's unusual in this kind of conservative audience of utility executives is to see them well ahead of a contracting process and demonstrating this intent through so many kinds of factors that we're going to go through. And absolutely, I see them as actually opportunity creating as utilities have experienced what the limitations are of those systems in terms of what they can do and how do they drive future growth of digitization of assets over time and definitely continue to see kind of how broadband then becomes a complement and/or a life cycle replacement to those technologies as we start looking to higher end, more broadband intensive or lower latency demanding applications starts really driving the conversation towards where broadband LTE comes into play. Specifically, our understanding is there's some technical and encumbrance challenges that, that band doesn't -- can't really be used for the same sort of unencumbered private broadband systems on LTE, 4G, 5G but I know we've had a conversation about that before and happy to take any more of that off-line, if you'd like. So then you have this opportunity to show these other utility companies that it's in use in a network or what further development is required of the existing customers, to provide an adequate use case to get people off the hump, if that's part of the issue of why they're not moving forward with whatever next step you needed to move forward on."
}