{
    "symbol": "WFG",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-27 18:52:06",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to the West Fraser Q3 2022 Results Conference Call. During this conference call, West Fraser's representatives will be making certain statements about West Fraser's future financial and operational performance, business outlook and capital plans. Such statements involve certain risks, uncertainties and assumptions, which may cause West Fraser's actual or future results and performance to be materially different from those expressed or implied in these statements. Additional information about these risk, factors and assumptions is included both in the accompanying webcast presentation and in our 2022 annual MD&A and annual information form, which can be accessed on West Fraser's website or through SEDAR for Canadian investors and EDGAR for United States investors. I would like to remind everyone that today's call is being recorded, Thursday, October 27, 2022. And I would now like to turn the conference over to Ray Ferris, President and Chief Executive Officer. And good morning, and thank you for everyone for joining our third quarter 2022 earnings call. And I'm joining today's call from Greenville, South Carolina, which is home of West Fraser's Advanced Controls and Development Center. Joining me on the call from Greenville is Chris McIver, our Senior Vice President, Marketing and Corporate Development, along with the few other senior leaders. If you give me a bit, I'd like to take a few minutes to describe just what our team in Greenville does and the role we expect them to play in support of our broader efforts of further improving our operational and cost performance as we continue our transformation into a leading global wood products company. For background, the Advanced Control Center was an initiative launched by the Norbord team in 2020 to support the 12 North American OSB facilities in best-in-class safety, operational performance and the sharing of best practices. Following the completion of the Norbord acquisition in February 2021, our platform has now grown to 13 OSB operations and specifically 22 sawmills in the US South. Although, the center will support other regions, we believe the critical mass we now have in the US South is an important strategic advantage of scale upon which to execute and support technology transfer to more rapidly advance the highest safety, automation and operational efficiencies, which are key to further driving our low-cost strategy. To do this, it's important that we have the best people and processes in place, and that's where the Advanced Control Center comes in. At a high level, the advanced controls and development centers key objectives are to train, educate and develop our employees to deploy and utilize best-in-class automation and control skill, to share in real-time best practices on safety and operational excellence and to be an  in developing and implementing the latest automation, automation and robotic technologies. With that, I will now give a brief overview of key financial highlights of West Fraser's Q3 results and then pass the call to Chris Virostek for additional comments. In the third quarter, West Fraser saw a further improvement in transportation constraints that had challenged our financial results earlier this year, while concurrently, we saw market demand weaken with rising mortgage rates impacting near-term housing affordability. Against this backdrop, we achieved solid financial results for the quarter, generating $426 million of adjusted EBITDA, representing a margin of 20% of sales. In terms of capital allocation, we invested nearly $150 million in capital equipment this quarter, while continuing our track record of returning significant capital to our shareholders by repurchasing $182 million of our shares and also paying out $27 million in quarterly dividends. The company has now repurchased approximately 39 million common shares through our normal course issuer bids and with the completion of two substantial issuer bids since early 2021, representing approximately 72% of the shares issued in respect of the Norbord acquisition. Notwithstanding this return of capital and soft in marketing demand, our balance sheet continues to offer significant financial flexibility, which remains a key priority for us in our capital allocation strategy. With that, I'll review I'll now turn the call over to Chris for additional details and comments. Our North America EWP segment generated $215 million of adjusted EBITDA, down from $623 million in the prior quarter. While lumber generated $160 million of adjusted EBITDA, a decline from $449 million in the prior quarter. In Europe, adjusted EBITDA was $24 million versus $54 million in the second quarter. Cash flow from operations in the third quarter was $433 million, while cash net of debt increased quarter-over-quarter to $789 million, even as we repurchased $182 million of our common shares in the quarter. While we did experience a notable improvement in transportation in the third quarter, particularly in Western Canada, we are reducing our annual SPF guidance, lumber guidance. We now expect SPF shipments to be modestly below the bottom end of the prior guidance range of $2.83 billion board feet, maintaining our guidance for SYP shipments, which we expect to fall within the range of 3 million to 3.2 billion board feet this year. In Europe, we are seeing a continuation of the slowing demand we discussed last quarter. And as such, we now expect OSB shipments to be at the bottom end of the guidance range of 1 million to 1.2 million square feet on a 3/8-inch basis this year. Lastly, given the rate of expenditures in the first three quarters of 2022 and because we now expect project spending to carry into 2023 for a number of our projects that are underway, we are tempering our 2022 capital expenditures guidance to be approximately $450 million as compared to the prior guidance range of $500 million to $600 million. We continue to see weakening demand for a number of our products, particularly for those serving new home construction markets as rising mortgage rates appear to be impacting affordability. And while we still see positive medium to longer-term market supply and demand fundamentals for our key products, we are acutely aware of these near-term headwinds. Given this uncertainty, further changes to operating schedules across our production platform, maybe required to manage raw material supplies, inventory levels, transportation and our integrated fiber supply chain. Consistent with recent quarters, across much of our supply chain, we continue to experience greater than usual inflationary cost pressures and availability constraints for labor, energy and raw materials, such as resins and chemicals and to a lesser extent, transportation. And as Chris mentioned, we certainly recognize the uncertainty surrounding rising interest rates and the potential impact that these and other factors may have on near-term housing affordability and the potential of short-term fluctuations in demand for our building products. However, it's important to note that while new home construction is a key market for our company, today's West Fraser is much more diverse and resilient than the West Fraser of the past, in part because of our deliberate actions that we've taken across the company. Not only do we have exposure to different geographic markets today, but the relative mix of our demand drivers has changed over time with significant growth coming from segments that are not as tied to new home construction. To this end, market exposure for our lumber segment, as you can see on slide 8 that repair and remodeling markets have become much more significant drivers of industry lumber demand over the past 20 years. Comprising just one quarter of industry demand in 2000, those same repair and renovation markets now represent nearly 40% of North American lumber demand. Similarly, on slide 9, it is clear that both repair and renovation and industrial markets are now much larger contributors to North American industry demand for OSB. Demand from these two end markets has increased substantially over the last 20 years, growing from just 22% to approximately 33% of total OSB demand over that period. What this data tells us, industry data tells us is that while new home construction will continue to be a key driver of to building products demand in North America, repair renovation in industrial markets have become more significant drivers of overall demand for our products. Further, the repair renovation industrial end markets historically tend to have significantly less demand variability through the cycle than that of new home construction. Much as we did with Opelika and Dudley projects, we will continue to operate the existing mill as we construct 255 million state-of-the-art lumber manufacturing complex at Henderson. Undertaking this type of brownfield project, allows us to pursue our low-cost strategy while leveraging the current mills existing ecosystem, including a skilled workforce, abundant fiber, close proximity to strong end markets and an existing outlet for our mill residuals. Once completed, the Henderson Mills capacity will nearly double and at full production, we estimate the mid-cycle EBITDA will increase by almost 4 times the current mid-cycle EBITDA. In summary, while demand markets were challenging in the third quarter, and we see near-term headwinds impacting the business. Just as important, we have the people and the talent to continue to move the company forward and create value, whether organically or through acquisitions if and when attractive M&A opportunities arise. Overall, we remain optimistic about the company's longer-term prospects as well as continued growth in the use of sustainable and renewable products. Can you reconcile the capacity multiple, which looks like it's almost 930 per 1000 board feet with the 12% IRR target, that IRR looks pretty similar to what you guys would have targeted for Dudley and Opelika, and I'm just wondering if you can reconcile that transparency for me. Sean, I think there's been a number, of announcements around there, I think, and it also depends how not all mills are all sort of constructed equivalent. I would say, what we've done here is build on what we learned from Opelika and Dudley. And what we've seen certainly with the tremendous success we've had in Angelina, which I think if you look at it at a reasonable comparison that's fairly equivalent, I think, on a valuation standpoint there. Look, I think our view of mid-cycle has typically been, I think, a conservative one and we typically try to do better on these things around that. I think in the case of green the other brownfield's -- we've been quite pleased to exceed our expectations, but we've approached this one just as conservatively. I would just say, look, it's hard to -- again, all things aren't created equal. And I would say, Sean, this for West Fraser, and how we look at our company, and where our operations are and where we want to be, this is really a continuation of our East Texas and quite frankly, part of our Arkansas strategy. And so, we understand the synergies that I think it brings for us, I would say. And -- so when we think of pricing and ramp-up schedules, our conservative nature comes up, our expectations would be to do better in both. But it's a reflection of, I think, our nature in the company, but also to be strategic on what we do. Second question, U.S. South log costs, you -- in the MD&A, it was mentioned the inflation you've seen there. Well, I can't -- I mean, I can't -- I don't have a center, but they probably wouldn't be meaningful anyway. What I would say is that is that certainly, we've seen some regions much quicker and whether that's weather and/or weather and then whether it's pulp or others, we've seen it, but it's certainly seen a shift in a couple of regions to do that. But I think the industry data out there, Sean, would probably be the best place to source someone \n Okay. Thanks, Sean\n Your next question will come from Hamir Patel of CIBC Capital Markets. Ray, you -- some of the charts in the investor presentation show the company's view that North American lumber and OSB markets are kind of sized for $1.5 million US housing starts. And so look, what I would say is, is that I don't want to get region-specific, because I do think these things move around. But I would say our operating philosophy will be the same, which is -- we have to have economic locks. We have to have a transportation that will accept the customers' orders, and we have to have words to do that, and we'll adjust our as needed to meet either one of those factors. I would say, if I were to comment on something, certainly, energy and fiber costs are issues throughout Europe, as a general statement. First question I had is, Ray, I wondered if you can just help us at all, in how you're thinking about demand over the next few quarters. Well, Mark, so Chris and Chris don't think we're getting to answer enough questions. Yes, that's a very difficult question to answer, quite frankly. I guess what I'm just trying to get at, Chris, is how much of a buffer this is creating in the short term just because the builders have a lot of backlog to work through. What I would say is that our inventory levels both in panels and lumber are very comfortable levels, and we'll see what happen there \n I mean, Mark, just from my perspective, I mean, I think we all look at the same numbers as far as completions and starts. And I think in the near term, Iâ\u0080\u0099ll pick a number, whether it's the next quarter or two, I -- demand has been more resilient than what we've -- I think some of the numbers would indicate in. By saying that, I think the unknown is how much more will interest rates go up. How fast will they go up and at what patient elevation and I think within that, it's really hard to predict what the impact will have. One, you've been quite clear as you work down at Allendale that you're going to start that up and you see the market being there for the product. One is that, look, we've made that investment based on what we think are very good long-term fundamentals. So -- and I would say, a general comment would be, when we look across our portfolio, we are going to make sure. So rather than speak specifically to Allendale, is â\u0080\u0093 that will be the â\u0080\u0093 whether we start up in Q1 or end of Q1 as we plan or whether we adjust based on â\u0080\u0093 I think we're going to make sure that all the fundamentals are in place across our operating portfolio. I'm just curious, Ray, if we look out over the next three to five years, we're seeing capacity shrink a lot out in BC. I'm just trying to think, we have less SPF supply. At the same time, -- we've got a lot more southern pine capacity. Hey, Mark, what â\u0080\u0093 you are correct in that typically you see slightly different end uses for both SYP and SPF. That's just what we're seeing, but it's pretty much anyone's get us as where it ends up. One thing I might add, Mark, would be I think we agree with your thesis or how you support that thesis. I think we'll â\u0080\u0093 I think over time, I think we'll be â\u0080\u0093 I think the thesis is good. What is â\u0080\u0093 need to be understood is that, there is a very tight supply chain and transportation is a more critical issue today and going forward than it has been historically. Look, we did expect to see something and particularly as we get into August, that's been very difficult to see with things that are going on there. But I think in a couple of quarters, we're going to have more visibility I think the industry will have more visibility exactly what the impact of those sanctions have been. Yes, that's pretty -- it's hard to draw a line to those. So, energy costs have gone -- slight certainly more in Europe than we've seen generally in North America. So, I can make the same discussion in North America is that you'll see regional dislocation that may or may not get correct, and it does move around, I think, this past few quarters, has been an example of that is moving around and we would expect to move around further over the next three quarters. I would say that all of our offshore markets have been slower than historical for sure, including Japan. Obviously, Russia is a good, we've seen a depressed market in China. I know sometimes in the -- with some of the new projects that have been announced in the industry, I think there are some fairly significant incentives that affect the capital cost. I mean the local community has been very supportive of us there, but that $255 million is the total capital cost. Well, it's a great question, Mark. But I would say, historically, you need to get beyond the mid-term elections. And I guess, if there was an opportunity, for whatever the factors are that might create a catalyst to have discussions, my guess or opinion would be at some time later next year. Well, listen, thank you, Michelle, and very much appreciate everybody's time on the call. As always, Chris and myself, -- but really, Chris and Robert, who is our Director of Investor Relations, are available to follow-up on other questions. We would like to thank everyone for their participation, and you may now disconnect your lines."
}