{
    "symbol": "KMT",
    "quarter": 4,
    "year": 2022,
    "date": "2022-08-02 11:17:01",
    "content": " Adjusted operating margin increased 340 basis points year-over-year, a significant improvement especially given the challenges, which included continuing supply chain issues, COVID-related lockdowns and absenteeism, the Ukraine conflict, high inflation, and the effect of $25 million of temporary cost actions in the first half of fiscal year 2021. Accordingly Q4 adjusted EBITDA margin was relatively flat this quarter compared to the prior year at 19.1% with net price offsetting raw material costs, operational excellence initiatives, higher volume and lower incentive compensation, mostly mitigating higher manufacturing costs, including costs from depreciation, COVID-19 absenteeism, supply chain constraints, and FX. For the quarter, sales of $530 million improved 3% year-over-year and 7% on an organic basis from $516 million in the fourth quarter of last year. Price offsetting raw material cost increases, Operational Excellence initiatives, volume and lower incentive compensation, mostly mitigated higher manufacturing costs, including costs from depreciation, COVID-19 absenteeism, supply chain constraints and FX. But that being said, and what we try to help you with especially in the first quarter in terms of your modeling, is we can still be confident saying that the underlying operating leverage of the business that we would expect from the simplification/modernization investments, when thereâ\u0080\u0099s actually a volume increase that that equals piece volume to plants, we still feel very good that, that will lever at our typical â\u0080\u0093 in the typical range that I think many of the analysts on the phone are using something around 50%. Yes Julian so, yes, when we think about that the $30 million in the first quarter, absolutely that is covering Iâ\u0080\u0099ll call it all three sources of inflation material wage in general, and yes, as weâ\u0080\u0099re talking about the $22 million in the fourth quarter, that is purely just raw material."
}