{
    "symbol": "MRVI",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 22:56:06",
    "content": " Today, we reported $191 million in total revenue, $133 million in total adjusted EBITDA and $0.37 in adjusted fully diluted EPS for the quarter. Revenue for the first 3 quarters of the year was $678 million, up 19% compared to the prior year similar period. R&D spend in the quarter was over $5 million, which compares to about $2 million from Q3 2021 as we continue to increase our R&D spend and focus on -- both on work around our CleanCap franchise as well as other novel innovations. That calculation of adjusted free cash flow, a non-GAAP measure, is based on our adjusted EBITDA of $133 million less capital expenditures in the quarter of $14 million. Our Nucleic Acid Production business represented 91% of our total revenue in the quarter and generated $134 million in adjusted EBITDA, a 77% adjusted EBITDA margin. Our Base Nucleic Acid Production business, excluding CleanCap revenue from our major COVID-19 vaccine customers was down from Q3 2021 as our prior year had a large non-COVID-related order to one of our customers to support numerous of their non-COVID-related programs. Our Biologics Safety Testing business and delivered $13 million of adjusted EBITDA in the quarter, a 79% EBITDA margin. Corporate expenses that are not included in the segment adjusted EBITDA totals were $14 million in the quarter, up from the Q3 2021 levels of $10 million, mainly due to investments in key personnel and systems that drive and support growth as well as the additional investments in key leadership positions for both R&D and our commercial areas. We are tightening our full year 2022 EBITDA guidance, a non-GAAP measure, to the range of $650 million to $660 million compared to our previous guidance range of $640 million to $660 million, increasing the midpoint by $5 million. For the fourth quarter, we expect total revenues of approximately $207 million; COVID-related CleanCap revenue of about $127 million; base business revenue of about $80 million, which would represent growth of 65% over Q4 of 2021; adjusted EBITDA of around $147 million, which would be a margin of 71% and adjusted EPS of about $0.33. As it relates to the other adjustments needed to get to our non-GAAP adjusted EBITDA range, our expectations for 2022 include interest expense between $21 million and $23 million; depreciation and amortization of $30 million to $32 million; equity-based compensation, which we show as a reconciling item to be about $17 million to $19 million; and as stated earlier, we expect our net capital expenditures to be about $50 million to $55 million, the vast majority tied to our new facility expansion. We see that, that in combination with our estimated $100 million in COVID-related CleanCap revenues, resulting in an adjusted EBITDA margin range of 40% to 50% next year. And Michael, I would add on that one, too, the -- if you step back and look at it, when you think about a pure life sciences company in sort of the cutting edge part of the field that's growing the base business at 20% or greater as we indicated, and delivering margins above 40% on the EBITDA line is a pretty compelling both investment opportunity and a pretty compelling business for us to run. We'll have some like -- even though slightly -- it's a different customer this time around in the fourth quarter, driving some CleanCap stand-alone demand in the fourth quarter of this year that's already locked in, in the fourth quarter of 2022 and some continued good momentum on our mRNA services business that will result in that strong Q4 finish to 2022 in the non-COVID business."
}