{
    "symbol": "MRVI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-07 12:17:07",
    "content": " Today, we reported $243 million in total revenue for the quarter, growing 10% compared to the prior year. Our adjusted EBITDA of $188 million was up 15% over the prior year, and we reported a record 78% adjusted EBITDA margin for the quarter. This top-line growth resulted in adjusted EBITDA of $375 million for the 6-month period, which represents a 77% EBITDA margin. Our Nucleic Acid Production business had revenue of $225 million in the second quarter, up 17% year-over-year. When we updated you last, after the first quarter, we thought the 2022 CleanCap revenues directly attributable to our major COVID-19 vaccine tumors would be about $630 million for the year, midpoint of our guidance of 12% growth over 2021 levels. Given the difficult to predict market dynamics in regard to demand for vaccines and rosters, and the delayed time lines for previously expected booster campaigns, we are revising our 2022 guidance to effectively de-risk our outlook, which will lower the full year COVID-19 related CleanCap revenue range by about $20 million from the prior guidance. Weâ\u0080\u0099re now assuming that this full year COVID CleanCap total will range between $600 million and $620 million for 2022, leaving $260 million to go in the second half at the midpoint. Just after our IPO in November, we reported that Maravai generated $284 million in revenues and $169 million in adjusted EBITDA for the full year of 2020. Today, less than 2 years later, our team revenues are $920 million, and our adjusted EBITDA is $693 million, more than 4 times our IPO levels. Our second quarter revenue was $17 million of Biologics Safety Testing, down 4% from last year. Income from operations was $181 million in the quarter from operating margin was 74% R&D spend in the quarter was $4 million, which compares to $1 million from Q2 2021, and as we continue to increase our R&D spend as a percentage of revenue at this quarter of the base business. Adjusted EBITDA GAAP measure was $188 million for Q2 2022, compared to $164 million for Q2 2021. That calculation of adjusted free cash flow and non-GAAP measure is based on adjusted EBITDA of $188 million less capital expenditures in the quarter of $33 million, with purchases of property and equipment, and construction cost incurred for office, a portion of which are considered improvements and will be reflected as prepaid and other assets in accordance with GAAP, further offset by government funding recognized. Production business fueled the most portion of the revenue growth for the second quarter, Nucleic Acid Production represented 19% of the companyâ\u0080\u0099s total revenue in the quarter and generated $186 million in adjusted EBITDA. CleanCap revenues from our major COVID-19 vaccine customers were approximately $178 million in the second quarter of 2022, compared to $155 million in the second quarter of 2021. Our Biologics Safety Testing business contributed 7% of the companyâ\u0080\u0099s revenue in the second quarter, slightly below our internal estimate, mostly attributable to the ongoing pandemic lockdowns in China, and our ongoing decision not to ship into Russia, as Cygnus branded products, which compares virtually all of this segmentâ\u0080\u0099s business were down less than $1 million in the quarter or 4% in 2021. Our Biologics Safety Testing business at $14 million of adjusted EBITDA in the quarter, thatâ\u0080\u0099s an 81% EBITDA margin. Corporate expenses that were not included in the segment adjusted EBITDA were $12 million in the quarter, up from the Q2 2021 levels of $10 million, mainly due to investments in key person and systems to drive and support growth. This is down $4 million or just less than 5% at the midpoint from our previous guidance, included in that range is our estimate for 2022 revenues actually attributable to our major COVID-19 vaccine customers to be about $610 million for the midpoint or down about $20 million from our previous expectation as we saw customers reduce Q4 demand down to their contracted minimums. Taking into consideration these adjustments to 2022 guidance, we expect overall revenue growth of 12% over 2021 levels at the midpoint, including just over 30% in our business, including revenue from COVID-19-related CleanCap and about 10% in our BST segment. On our strong first half margin profile, our adjusted EBITDA guidance, a non-GAAP measure, is narrowed to a range of $640 million to $660 million, a change of approximately $20 million, up 3% at the midpoint compared to our previous guidance range of $650 million to $690 million. Based on this updated adjusted EBITDA guidance, adjusted fully diluted EPS and non-GAAP measure is expected to be in the range of $1.70 to $1.80 per share, compared to our prior $1.74 to $1.90 per share. As implied by your guidance and our first half actual results, the second half of 2022 is forecasted to be between $393 million and $423 million with the third quarter expected to be between $190 million and $200 million in revenues and the fourth quarter is slightly higher. Based on the lower second half revenues as compared to the first half and in consist of product mix, and continued growth initiative investments, we expect our EBITDA margin in the second half of the year to be about 70%, resulting in an approximate full-year range representing our updated guidance of about 73%. Statistically due to the EPS is based on the assumption that all Class B shares are converted to Class A shares, which results in a forecasted fully diluted share count estimated at $256 million for the full year of 2022. Our expectations for 2022 include interest expenses between $22 million and $25 million; depreciation and amortization of $30 million to $35 million; equity-based compensation, which we showed as a reconciling item from GAAP to non-GAAP EBITDA to be $18 million and $20 million. Look, I think if you look back at what Carl presented when you were talking about valuation and you look at that point in time, that 2020 year that we had there, we had $280 million revenues, $100 million in COVID CleanCap, and a 60% EBITDA margin, weâ\u0080\u0099re going to be bigger than that."
}