{
    "symbol": "MRVI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 21:37:09",
    "content": " Today, we reported $205 million in revenue for the quarter, and our adjusted EBITDA of $130 million led to adjusted earnings per share of $0.35 per share. Our base business revenue of $81 million marks a record revenue quarter, up 67% over the fourth quarter of 2021, demonstrating the continued widespread uptake of messenger RNA platform technologies across multiple therapeutic infectious disease vaccine and immuno-oncology programs. Full year revenue was a record $883 million and net income was $491 million, with adjusted EBITDA margins coming in at 72%. The remaining $66 million of base NAP revenue represents our largest quarter ever for the base business, up 101% over quarter four of last year. For the full year, total Nucleic Acid Production revenue was $813 million, growing 14% over 2021 with the base NAP revenue at $213 million, growing 38%. For the full year, our BST revenue of $70 million grew just over 2% from 2021 levels. Our strong fourth quarter resulted in a full year revenue total of $883 million, performing in excess of that initial guidance for 2022. On our call about a year ago, we also provided initial 2022 adjusted fully diluted EPS guidance for 2022 of   $1.80 per share, solidly within that narrow range. The primary reason for this was that the fourth quarter had about a $12 million in specific noncash related inventory write-offs and reserves, mostly tied to excess or expiring CleanCap materials and unfavourable manufacturing charges associated with lower expectations for COVID-related demand in the near term as well as customers' conversion from RUO to GMP grade materials. That calculation of adjusted free cash flow, a non-GAAP measure, is based on our adjusted EBITDA less CapEx which were $130 million and $30 million in the quarter, respectively, and $638 million and $47 million for the full year, respectively. However, since the end of the year, we've also collected over half of the $139 million in year-end accounts receivable that reflected the strong fourth quarter revenues. Our Nucleic Acid Production or NAP segment, which includes products from our trialing and research MyChem and Solulink assets and starting in January of 2023 will include the contributions from Alphazyme, had revenues in the fourth quarter of $189 million and adjusted EBITDA of $135 million, a margin of 71%. For the year, for NAP, revenue was $813 million, adjusted EBITDA was $638 million or a margin of 79%. These had revenues of $15 million in the fourth quarter and adjusted EBITDA of $11 million, a margin of 73%. Corporate expenses, which support both our segments and Maravai corporate efforts, including the shared service functions of executive leadership in resources, finance and accounting facilities, legal compliance, IT, quality and Corp Dev and strategic marketing, totaled $17 million in the quarter and $55 million for the year. As we sit here at the end of another year, we look back over the course of the last four years for Maravai and underlying all the highs and lows is a very solid base business, one that has grown steadily from $124 million in total revenues in 2018 to $283 million in 2022, a base business CAGR of 23%. We currently anticipate 2023 revenues to be in the range of $420 million to $460 million, with an assumption of around $100 million in CleanCap revenues for COVID-related vaccine demand. Overall, we see the base business revenues in the range of $320 million to $360 million which would reflect base growth of just over 20% at the midpoint over the comparable 2022 base business revenues of $283 million. The range is based on the following additional expectations as listed on Slide 25: Interest expense, as I discussed; net of interest income between $20 million and $22 million; depreciation and amortization between $36 million and $40 million equity-based compensation, which we show as a reconciling item between GAAP and non-GAAP EBITDA to be between $34 million and $38 million. Lastly, our Pacific Center facility is on target for completion in the first half of 2023 and will house our corporate functions as  Overall, the completion of these facilities in 2023 provides us with key foundational facilities to support long-term growth and can support revenue volumes of $2 billion plus at full utilization. To support the completion of these strategic capital investments, we anticipate capital expenditures in 2023 and we had a net range of $55 million to $65 million, with roughly $40 million of that tied to the Pacific facility build-outs that I mentioned. As for the cadence of estimated financial performance for 2023, we see revenues starting lightly in Q1 in a total range of around $75 million to $80 million and increasing thereafter. So I think you'll see that as we progress throughout the course of '23, starting low on the base business in NAP and then kind of trending sequentially each quarter based on how we see it today is, we'll see those type of standalone CleanCap orders for non-COVID indications, pretty light here in the first part of the year as people use that for their current phases and then pick up again in the second half."
}