{
    "symbol": "GERN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-11 20:27:07",
    "content": " I am personally very excited that we are only five months away from the first of these exciting milestones, which is the disclosure of topline results from our IMerge Phase 3 trial in lower risk MDS that are expected in early January of 2023. If the lower risk MDS topline results are positive and these regulatory activities are successful, we expect U.S. approval and commercial launch of imetelstat in lower risk MDS in the first half of 2024. First, the durability of independent -- transfusion independents that was observed in Phase 2 addressed what these hematologists cited is the most significant current unmet need for the lower risk MDS patients. These key attributes, as well as a manageable safety profile from the Phase 2 study give us confidence that the outcomes in the Phase 3 trial have the potential to address the unmet needs of the approximately 33,000 patients with lower risk MDS in the U.S. and largest five EU markets who are relapsed and refractory to ESAs. These include the lower risk MDS Phase 3 topline data, the build-out of the U.S. commercial team and plan, the IMpactMF Phase 3 data from the interim analysis, and the unique product attributes of imetelstat that are expected to allow it to successfully address unmet needs. For example, the decrease in R&D expenses for the three months and six months period of 2022 compared to the same period in 2021, primarily reflects the net result of decreased manufacturing costs due to the timing of imetelstat manufacturing batches, partially offset by increased personnel related expenses for additional headcount and higher consulting costs related to preparations for topline results and regulatory submissions in lower risk MDS. The decline in general and administrative expenses for the six months ended June 30, 2022, compared to the same period in 2021, primarily reflects the net results of reduced consulting costs related to modernizing the internal infrastructure to support potential commercial launch and lower legal fees, partially offset by higher personnel related expenses for additional headcount. Under current planning assumption, we expect to have approximately $130 million in cash and marketable securities at the time of the lower risk MDS topline results in early 2023. This expansion of our debt facility provides potential access of up to $50 million in additional non-dilutive capital in 2023, which is the year in which we expect lower risk MDS topline results and if the data are supportive, U.S and EU regulatory filings thereafter. We believe the additional $50 million from potential additional debt proceeds when added to the projected exercise proceeds from outstanding warrants and our current financial resources will be sufficient to fund our projected level of operations, which include stage-gated activity for potential U.S. commercial launch of imetelstat in lower risk MDS until the middle of 2024."
}