{
    "symbol": "GERN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 20:53:05",
    "content": " Before we begin, please note that during the course of this presentation and question-and-answer session, we will be making forward-looking statements regarding future events, performance, plans, expectations and other projections, including those relating to the therapeutic potential and potential regulatory approval of imetelstat, anticipated clinical and commercial events and related timelines, the sufficiency of Geronâ\u0080\u0099s financial resources and other statements that are not historical fact. With positive top line results from IMerge Phase 3 in hand, we now have a charted path towards several potentially significant regulatory and commercial catalysts which we expect will further enhance the value of imetelstat. We believe continued progress in the other areas I described, such as relapsed/refractory MF, frontline MF, higher-risk MDS and AML, lymphoid malignancies and the discovery of potential next-generation telomerase inhibitors, we will explore how imetelstat and telomerase inhibition may provide potential benefit to many more patients. We expect this messaging to highlight imetelstatâ\u0080\u0099s differentiating qualities as seen in the top line results, which include the broad efficacy across MDS subtypes, including both RS+ and RS- patients, the durability of continuous transfusion independence, the totality of clinical benefit, which includes a reduction in transfusion burden and significant increases in hemoglobin levels, the strong evidence of potential disease modification, and what we believe is a favorable benefit risk profile. The fiscal year 2023 guidance reflects costs to support planned regulatory submissions in 2023, ongoing clinical trials, IMerge Phase 3, IMpactMF, IMproveMF and IMpress as well as preclinical studies in lymphoid malignancies and discovery research for next-generation telomerase inhibitor, manufacturing commercial inventory for imetelstat, preparation for potential U.S. commercial launch of imetelstat in lower-risk MDS and projected increases in headcount as well as interest payments on outstanding debt. If those assumptions are updated later in the year due to changes in our plans, including in response to potential revised timing of FDA approval and potential U.S. commercial launch of imetelstat in lower-risk MDS, then we plan to update guidance at that time. Based on our current operating plan and our expectations regarding the timing of the submission and potential acceptance and approval of our planned NDA by the FDA and the potential commercialization in the U.S. for the use of imetelstat in adult patients with lower-risk MDS, we believe that our existing capital resources will be sufficient to fund our projected operating requirements through the end of the third quarter of 2025, which includes potential U.S. commercial launch of imetelstat in lower-risk MDS in the first half of 2024."
}