{
    "symbol": "UNVR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 11:56:05",
    "content": " We've delivered over $1 billion in adjusted EBITDA and return over $400 million to shareholders during the year, as we execute on a capital allocations strategy bonds between share repurchases, acquisitions, and investments for sustainable growth. Adjusted earnings per diluted share was $0.47 in the quarter, a decrease from $0.60 in the prior year's fourth quarter, whereas full year adjusted EPS was $3.40 a share, an increase of 53% year-over-year. Cash from operations in Q4 was $376 million, reflecting a reduction in networking capital, and cash from operations for the full year was $546 million higher by 88% year-over-year. Adjusted EBITDA for Q4 was $175 million and margins decreased across the board except for LATAM, primarily due to lower gross profits, which were partially offset by operating efficiencies in some regions. As a result, we expect our adjusted EBITDA performance for the first quarter to be in the range of $200 million to $220 million, and for the full year, we expect our performance to be in the range of $900 million to $930 million. For year ended 2023, we are targeting networking capital of 14% to 14.5% of annualized quarterly sales by year-end, and expect networking capital to be a source of cash given the lower sales in 2022 and our initiatives to improve our networking capital efficiency. As previously mentioned, in 2022, we delivered over a $1 billion in adjusted EBITDA with sustained positive net free cash flow, which we use to buyback over $400 million of shares. We continue to believe in our 2025 goals and expect to deliver an adjusted EBITDA margin greater than 9% with 50% net free cash flow conversion, ROIC of greater than 20%, and adjusted EPS greater than $4.50. Net of capital expenditures, we continue to believe our business will generate approximately $1.5 billion in net free cash flow from 2023 to 2025, and we expect to execute against our $1.5 billion share buyback authorization over the next four years. If I take your EBITDA midpoint of $915 million for 2023, and I gross that up at Nick's margin, midpoint of 8.3%, I get about $11 billion of sales, which seems to imply that you would expect sales to go down. And Josh the expected -- and Josh, the expected EBITDA benefit on a reported basis for the year would probably be $10 million to $15 million added to the guidance level."
}