{
    "symbol": "ABC",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-04 10:10:03",
    "content": " As we move into the second half of 2022, we remain focused on carrying this momentum forward and building on our core strength by advancing our strategic imperatives of leading with market leaders, leveraging our infrastructure to increase efficiency access and the customer experience, investing in innovation to further drive our differentiation, expanding on our leadership in specialty and contributing to healthier outcomes around the world Our global base of key anchor customers and our strategic partnership model allows us to integrate ourselves into our customers' operations and deepen our relationship with market leaders across the healthcare supply chain. AmerisourceBergen finished the quarter with adjusted diluted earnings per share of $3.22, a 27% increase with strong operating income growth in both our US Healthcare Solutions segment and International Healthcare Solutions segment. Segment operating income was $730 million, representing growth of 11.4% versus the second quarter of fiscal 2021, driven by the important work we are doing to distribute COVID treatments and good performance across our businesses. US Healthcare Solutions segment operating income margin increased 7 basis points in the quarter, primarily due to fees earned relating to the distribution of government-owned COVID treatments. As a result of our strong performance in the first half of our fiscal year and to reflect continued momentum in the second half, we are raising our fiscal 2022 adjusted EPS guidance from a range of $10.60 to $10.90 to a new guidance range of $10.80 to $11.05, reflecting growth of 17% to 19% from the prior fiscal year, resulting from the increase in our expectations for full year consolidated operating income. In the US Healthcare Solutions segment, we are increasing operating income guidance to be in the range of $2.42 billion to $2.48 billion, representing growth of 7% to 10%. As I said earlier, the US Healthcare Solutions segment operating income includes around a $0.60 full year contribution from COVID-19 treatment distribution, which is generally in line with the COVID treatment expectation we had embedded in last quarter's guidance. Our International Healthcare segment's businesses are performing well including Alliance Healthcare, which is performing above expectations at our original budgeted foreign exchange rates; assuming exchange rates in the month of April continue for the second half of the fiscal year, the foreign exchange impact on our actual dollar results for the full year would be north of $80 million when comparing expectations versus constant currency, meaning using the prior year exchange rates. As a result of the increase in our US Healthcare Solutions operating income guidance and results in the International Healthcare Solutions segment largely mitigating the foreign exchange headwind, we are raising our expectations for consolidated operating income growth to be at least in the high teens percent range, up from growth in the high teens percent range. And I'll start out by saying that we're really pleased that we're able to increase full year guidance of three key metrics: consolidated operating income, and US Healthcare Solutions segment operating income and EPS. It's -- that contribution from COVID products distribution was higher than expected in the second quarter, but we view that as a pull-forward and our full year expectations from COVID product distribution are largely unchanged around $0.60 in the US and $0.10 internationally."
}