{
    "symbol": "ABC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-02-02 12:32:05",
    "content": " As I’ve said over the past year, we are proud to be a part of the solution to support the government response to the pandemic in the U.S. As pharmaceutical innovation continues to expand treatment resources to respond to the pandemic, we are playing an even greater role to leverage our infrastructure and expertise to support efficient access to COVID-19 therapies in partnership with the federal government. The newly authorized oral COVID treatments are a milestone in the efforts to curb the impact of the virus, and we are supporting their distribution to sites of care across the U.S. Our robust public-private partnerships with pharma manufacturers and the U.S. government demonstrate the value of AmerisourceBergen’s intellectual confidence as we have utilized our commercial strength and ability to collaborate effectively to quickly create solutions in the health care system. Outside the U.S., AmerisourceBergen’s network of global businesses Alliance Healthcare, World Courier and Innomar in Canada are playing a pivotal role in supporting the COVID-19 vaccination efforts across 30-plus countries. Alliance Healthcare’s foundation in wholesale distribution and the International segment’s significant footprint in complementary value-added services and solutions parallel AmerisourceBergen’s U.S. capabilities and provide us with a strong global platform for sustainable, long-term growth and value creation in service to our global biopharmaceutical manufacturer partners. Through our independent pharmacy network, Good Neighbor Pharmacy, or GNP, in the U.S. and Alliance’s Alphega network in Europe, we have continued to strengthen our relationship with these providers and support their ability to expand access to critical health care solutions. In our Alliance Healthcare business, we are also seeing significant growth in Alphega’s membership as independent pharmacies recognize the value of working with Alliance and the services we offer. Segment revenue increased by 2.7% to $53 billion driven by an increase in sales to one of our larger customers and growth in our specialty physician services and MWI Animal Health businesses, offsetting a $1.1 billion decline in sales of the commercial COVID-19 therapy. As a result of our updated expectations for the operating income impact of COVID therapies, we are raising our fiscal 2022 U.S. Healthcare Solutions segment operating income guidance to a range of $2.375 billion to $2.45 billion representing growth of 5% to 9%. Charles, your line is now open. Eric, your line is now open. And the role that we’ve done with in COVID therapies distributing over 100 million vaccines worldwide by doing all the lateral flow tests in the UK – well Korea getting early vaccines out in some difficult areas in Europe, but also probably, most pivotally, the role we play in the U.S. with the antiviral therapies and the tremendous data and relationships that we’ve developed, working with the U.S. government and the state and counties to get these therapies out. And in particular, within U.S. Healthcare Solutions, we increased the operating income guidance by $50 million at both the low end and the high end of the range, and that’s due to higher COVID-19 therapy sales than we had originally expected. Eric, your line is now open. Charles, your line is now open."
}