{
    "symbol": "TMC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-15 20:22:07",
    "content": " Now in the third quarter of 2022, the net cash used in operating activities amounted to $8.7 million, compared to $10.4 million for the third quarter of 2021. Now regarding our balance sheet as of September 30, 2022, we closed the quarter with cash balance of $67 million, which includes approximately $30 million of funds raised through the August pipe financing, and again, we believe gives us at least runway for the next 12 months with that cash position. For the nine months, beginning 2022, TMC reported an operating loss of $62.8 million and a net loss of $61.4 million or $0.27 per share for the first nine months of 2022 compared to the operating loss of $121.3 million and a net loss of $121.5 million or $0.61 per share for the nine months ended September 30, 2021. The net loss for the nine months ended September 30, 2022, included exploration and evaluation expenses of $40.3 million, versus $80.2 million for the same period in 2021. Exploration and evaluation expenses decreased in the first nine months of 2022 compared to the same period in 2021, as a result of a decrease in offshore campaign activity following the completion of NORI Area D environmental baseline campaigns in the fourth quarter last year, a decrease in share-based compensation partially offset by an increase in the expenses incurred in 2022 for the PMTS trials and collective test monitoring survey work. Finally, in the first nine months of 2022, the net cash used in operating activities amounted to $46.8 million, compared to $28.3 million for the first nine months of 2021. Excluding nonrecurring items, free cash flow for the first nine months of 2022 was negative $47.8 million, compared to negative $23.3 million in the same period of 2021. The increased cash spending in the first nine months of 2022 included payments made for various offshore campaigns, including a $10.5 million payment to Maersk relating to 2021 campaigns, a $10 million payment to Allseas of their second milestone payment and increased payments for environmental monitoring costs and the PMTS trials."
}