{
    "symbol": "TMC",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-23 22:25:24",
    "content": "  Operator: Good afternoon, everyone and thank you for participating in The Metals Company Fourth Quarter and Full Year 2022 Corporate Update Conference Call. Before we go further, I would like to turn the call over to CFO, Craig Shesky, as he reads the companyâ\u0080\u0099s Safe Harbor statement within the meaning of the Private Securities Litigation Reform Act of 1995 that provides important cautions regarding forward-looking statements and information about the use of non-GAAP measures. Please note that during this call, certain statements made by the company will be forward-looking and based on managementâ\u0080\u0099s beliefs and assumptions from information available at this time. These statements are subject to known and unknown risks and uncertainties, many of which maybe beyond our control, including those set forth in our Safe Harbor provisions for forward-looking statements that can be found at the end of our fourth quarter 2022 corporate update press release. Such statements may also be found in our annual report on Form 10-K for the year ended December 31, 2021 and other reports subsequently filed with the SEC, including our upcoming 10-K for the year ended December 31, 2022. Additionally, please note that the companyâ\u0080\u0099s actual results may differ materially from those anticipated and except as required by law, we undertake no obligation to update any forward-looking statements. Our remarks today may also include non-GAAP financial measures, including with respect to free cash flows and additional details regarding these non-GAAP financial measures, including reconciliations to the most directly comparable GAAP financial measures can be found in the slide deck being used with this call. Thank you, Craig and good afternoon and thank you all for joining us today for our fourth quarter 2022 corporate update call. The fourth quarter saw some incredible and historic milestones for TMC, NORI, and our strategic partner and shareholder, Allseas. The single biggest milestone, of course, was the first integrated collection and lift of polymetallic nodules in the CCZ since the 1970s, in which 4,500 tons of nodules were collected and over 3,000 tons were lifted to the surface. The test and the monitoring campaign running in parallel also collected over 200 terabytes of environmental data and that data will help us better understand absolute impacts of nodule collection, while lifecycle analysis can help us better understand relative impacts. On that front, the full benchmark lifecycle analysis previewed on our last call, but now released in full after third-party review shows that the NORI-D project model performed better in almost every impact category analyzed than all land-based throughout chosen for comparison. And then earlier this month, we announced that Bechtel, a global leader in engineering, procurement and construction will collect and compile the technoeconomic studies being done by various consultants which are required for NORI to lodge its application for an exploitation contract with the ISA. And even in its early stages, we have already seen this partnership open many doors for us given the instant credibility that comes with the Bechtel name. Also this month, we announced a non-binding MOU with Pacific Metals Company, or PAMCO in Japan, to evaluate the tolling of 1.3 million tons of wet polymetallic nodules per year at PAMCOâ\u0080\u0099s Hachinohe smelting facility starting in 2025. Our partner and shareholder, Allseas, has made available to us the $25 million unsecured credit facility maturing in May 2024. We also announced a strategic partnership with low carbon royalties in which we contributed a 2% gross overriding royalty on NORI in exchange for $5 million and a 35% equity stake in LCR, and importantly, a right to repurchase up to 75% of the royalty at a fixed IRR return. And in the coming years, LCR has the potential to be an important additional source of capital to bring NORI-D and other TMC projects into production, given their talented management teamâ\u0080\u0099s track record of valuation creation and accretive deal-making. Finally, you may have seen the news in December that we put in place a $30 million ATM program to potentially issue shares opportunistically in the open market with the help of our bankers at Stifel and Wedbush. So on the agenda, we are going to take you through the following items on the call, an overview of the recent headlines in the market, a regulatory update, an update on the NORI-D project, a recap of our near-term milestones and our financial update. So anyone scanning the press on the topic of deep sea nodules would have noticed a large pickup in coverage recently from the likes of the New York Times, Bloomberg, Reuters, had a very worthwhile piece from Steven LeVine in The Electric just this week, which Iâ\u0080\u0099d recommend. Belgiumâ\u0080\u0099s contractor, GSR, announced investment from leading offshore contractor Transocean, who will also provide GSR with the Samsung 10,000 drillship Olympia for conversion into a nodule production vessel ahead of its system integration test currently scheduled for 2025. In December 2022, Japan announced plans to possibly begin extracting rare earth elements from the mud on the Western Pacificâ\u0080\u0099s deep sea bottom as early as 2024, budgeting $44 million for trial extraction equipment. And just this month, Chinaâ\u0080\u0099s state owned newspaper recognized TMCâ\u0080\u0099s leadership position in the industry and announced its intention to invest further into the development of technologies to recover polymetallic nodules. But while the Chinese and Russian funded production dominates the nickel picture on land, thatâ\u0080\u0099s not the case for seafloor nodules, herein lies the opportunity for nations and companies worried about supply chain security for battery metals. Collectively, our NORI and TOML projects rival todayâ\u0080\u0099s largest producers both in Russia and Indonesia. And NORI and TOML were ranked earlier this year by Mining.com as the worldâ\u0080\u0099s largest undeveloped nickel projects, larger than other projects in the pipeline in Canada and the U.S. and about an order of magnitude higher in grade. And speaking of grade, this chart plots the nickel equivalent grade on the Y-axis and nickel equivalent resource size on the X-axis comparing some of the more prevalent nickel projects for which data is available. And focusing on the bubbles in gray, some nickel projects have high grade and some have a large resource, but very few have both. The scale of our resource can also be measured in terms of how big of a gap it can fill in the clean energy transition with each little car on this page, representing the metal required to electrify 1 million vehicles with a 75-kilowatt battery on an NMC 811 chemistry. Our NORI and TOML areas contain in situ qualities of nickel, copper, cobalt, and manganese equivalent to the requirements of about 280 million vehicles or roughly the entire U.S. passenger fleet. And to deliver on energy transition goals, countries like the U.S. need to tap unconventional resources like nodules that can truly move the needle for nickel-rich battery chemistries. Shifting gears, as some of you may have read, UN member states reached a landmark agreement this month focused on the conservation and sustainable use of marine biodiversities of area beyond national jurisdiction or BBNJ, as we know it. But I would remind our listeners that the International Seabed Authority has already exceeded this target with 43% of the Clarion Clipperton Zone of the Pacific Ocean, home to 90% of all nodule exploration activity set aside for protection, far more than is under exploration. As we speak, the ISA session is in progress in Kingston, Jamaica, with the focus on the financial regime, regulations and standards and guidelines working hard to stick to the roadmap that has been laid out on this page. Earlier this month, we announced that Bechtel will collect and compile the technoeconomic studies currently being compiled by various consultants, which are required for NORI to lodge its application for an exploitation contract with the ISA. And with their extensive experience working on historic infrastructure and mining projects, itâ\u0080\u0099s incredibly exciting to have a partner of Bechtelâ\u0080\u0099s caliber onboard to help NORI deliver a first-of-its-kind exploitation contract application to the ISA and ultimately bring this important resource of energy transition metals online in a responsible way. So with the help of another of our industry leading partners, Hatch, we developed a new zero-waste flow sheet that uses almost all of the nodules masked while producing zero tailings. And over the last year, we have been searching for the right partner to help us from pilot stage to commercial stage production. And we still might find a way to work together in the future, but another opportunity presented itself last year, a turnkey option to potentially process our modules in an RKEF facility, which already exists. Earlier this month, we announced that we had signed a non-binding MOU with PAMCO of Japan to evaluate the tolling of 1.3 million tons or more of polymetallic nodules per annum at the Japanese smelting facility starting in 2025. PAMCO will undertake the studies to estimate the cost of processing nodules using their existing facilities and to identify any additional equipment requirements, which are currently expected to be minimal. In fact, the 22-ton sample of the nodules collected in last yearâ\u0080\u0099s test has already been offloaded at their facility for testing. PAMCO have been smelting nickel laterite ore at their facility since 1965 and its plant seems well suited to deploy our new zero solid waste flow sheet, particularly because these nodules behave very similarly to nickel laterites in the smelting process. And working with PAMCO can help us achieve our stated capital-light strategy to get into initial commercial production, potentially reducing both our time to market and our upfront costs. This slide lays out some of the key attributes of the NORI-D project, which gives a sense of how much progress has been made and why itâ\u0080\u0099s of increasing interest among strategic partners. As I mentioned, we were pleased to report in the fourth quarter that Allseas and NORI achieved all significant pilot collection system milestones while collecting approximately 4,500 tons of seafloor polymetallic nodules and over 3,000 tons were lifted up to 4.3 kilometer long riser to the Hidden Gem vessel. Iâ\u0080\u0099d like to play a short video where you can hear from the TMC and Allseas team onboard the vessel, just a few of the team members among the hundreds who made this historic achievement of reality. Weâ\u0080\u0099re working with some of the worldâ\u0080\u0099s leading marine research institutions to amass one of the most comprehensive data sets ever compiled of the deep sea, some of which are highlighted on this page. Our team is preparing to submit the first batch of this data to the ISA, and we expect that it is likely the most extensive deep-sea data set of its kind on the planet. And the expert engineers at Allseas are leveraging the data and learnings from our offshore trials to optimize designs to further reduce our impacts, including plume and noise generation. And this data is also central to the development of safe operating parameters being developed in partnership with CSIRO and NIWA on the adaptive management system, or AMS, as we know it. Of course, what often gets missed in the media reporting on the environmental impacts is that there is simply a lot less life to begin with in this part of the ocean. Weâ\u0080\u0099re talking about 1,500x less biomass per square meter when compared to the biodiverse rainforest under which most future nickel supplier would otherwise come from in Indonesia. And as weâ\u0080\u0099ve been saying for years, these nodules come with no social displacement, no deforestation, no digging, no blasting, no drilling, no child or forced labor, and importantly, no tailings. So rather than just talk about it, we took action and engaged a blue-chip metals research firm, Benchmark, to undertake a life cycle assessment of the environmental impacts of the NORI-D project, and how they compared to producing the same metals from conventional land ores using typical processing routes. Across every single impact category measured, the nickel products derived from nodules outperformed every land-based source in this analysis, including carbon and waste impacts. Zooming in on one metric, the graph shows the global warming potential per kilogram of nickel in nickel sulfate with the NORI-D project having the lowest footprint of all assessed alternatives, lowering emissions by between 70% to 80% on average, including with 70% lower global warming potential. And of course, the beauty of assessing our projects impacts before it even begins, is that we can work diligently to improve its environmental profile well in advance of commencing commercial operations. This study is part of the growing course of information based on science and real-world field data, which support the case for nodules as a key enabler of the clean energy transition. And Iâ\u0080\u0099d now like to turn it over to Craig to discuss project economics, valuation and our financial results. And in March 2021, AMC Consultants issued an SEC Regulation S-K 1300 compliant initial assessment of the project economics for the NORI-D area. And that initial assessment, which was a point-in-time analysis, arrived at a net present value of $6.8 billion for NORI-D at the beginning of 2021. But if you run that same model simply by updating it for current metal prices, the net present value of NORI-D would be approximately $13 billion, again on just 22% of our total estimated resource. Looking back on 2022, we havenâ\u0080\u0099t had all of them, though weâ\u0080\u0099ve completed most of our stated milestones, particularly those on the project development side. These next critical milestones include, of course, continued progress from the ISA working as we speak on the final exploitation regulations, NORI submitting an exploitation application for the NORI-D area, the ISA then granting an exploitation contract over the NORI-D area. So when you look at us in the public markets and wonder why it is weâ\u0080\u0099re still trading around 1%, 1.5% of net present value, we think progress on those milestones will get us training to where we should relative to public comparables, 20%, 30%, 40% of net present value at this stage of production. In the last quarter of 2022, TMC reported a net loss of $109.6 million, $0.41 per share compared to TMCâ\u0080\u0099s net loss of $19.8 million or $0.09 per share for the same period in 2021. G&A expenses of $7 million versus $15.4 million in Q4 2021, partially offset by a gain of $1.3 million due to a decrease in the value of our warrants. The increase in exploration expenses was mainly a result of a recording of $69.9 million for the Allseas warrant, and that was recorded at the March 2021 deep green share value date, and that was $7 per share, again at that point in March 2021. So that, along with $8.7 million related to the 10.85 million shares issued to Allseas as completion payment following the successful conclusion of the pilot collection system trial, those are really the big movers within that number. General and administrative expenses decreased in the last quarter of 2022 compared to the last quarter of 2021, reflecting a reduction in share-based compensation and a reduction in communication and advertising costs, partially offset by higher personnel, legal and other expenses associated with being a public company. In the last quarter of 2022, the net cash used in operating activities amounted to $19.8 million compared to $27.8 million for the last quarter of 2021. Excluding non-recurring items, free cash flow for the last quarter of 2022 was negative $20 million compared to negative $27.8 million in the last quarter of 2021. And regarding our balance sheet as at December 31, 2022, we closed the quarter with a cash balance of $46.8 million. After the achievements we reported in November, we really focused on adding names to the ecosystem working hard on the first of this kind project. Weâ\u0080\u0099ve succeeded in adding more credibility to this project with the help of brand names like Benchmark, PAMCO, Bechtel, all of the participants in the ESG handbook for Marine Minerals and of course, the continued unwavering support of Allseas. Our focus for the next quarter and the rest of 2023 is to continue building partnerships, some of which can help on the financing front and craft the best possible exploitation application contract. Just a follow-up on that, you mentioned that they are looking at processing 1.3 million tons a year or you said or more. So, 1.3 million is about the capacity of one line or thereabouts, and you have room to expand it if there is enough material that you could provide them to process? And you have what looks like arranged a $25 million, I guess I can call it a 18-month float or so, you said by the end of â\u0080\u009824. And we were so delighted that also has agreed to extend this credit facility because we do have a lot of people at the table, and we â\u0080\u0093 as we spend more money, it adds more certainty to the project. And of course, most of the money, like more than 80% of every dollar we spend is at the project level. And then just the last question on the Benchmark Mineral Intelligence report, I would assume it helps you with your efforts as you mentioned it certainly gives more gravitas to your claims of environmental impact. I mean we were â\u0080\u0093 we of course, completed an LCA some years ago, but the observers were saying, yes, but there are a couple of teams people part of that and wasnâ\u0080\u0099t independent enough. You have to look through the lens of a multi-tiered LCA to look at a broad range of impacts, and this project just shines at all levels. And so 227 pages of findings, I hope you get to read it because itâ\u0080\u0099s exciting and it just highlights some of the benefits that this resource offers compared to the known alternatives. I mean 18 months ago, President Macron put aside â\u0082¬300 million to fast track the development of the license area in the CCZ. And â\u0080\u0093 but we hope through the very thorough science that we are funding and other contractors are funding as well, not just us, that those green influences will actually swing our way because itâ\u0080\u0099s a â\u0080\u0093 we have seen in Europe this year with the heavy dependency on Russian gas, that there are trade-offs that need to be made. And of course, the impacts of land-based nickel production, in particular, and mining in general, are there for us all to see. But I think I would look at our capital-light strategy as evidence that shareholder returns are always going to be front of mind for us, including everything else that we consider with respect to all of our stakeholders. But as we get down the road and get into production and get to free cash flow positivity, one thing that we are going to have to look at is the first project, NORI-D, thatâ\u0080\u0099s still just 22% of our resource portfolio. And depending on where our share price is at the time, we might think itâ\u0080\u0099s a better return to invest any of the cash flow we have back into the project. Yes, if we think about the $8.7 million payment to Allseas for the collector test as a rough estimate of costs associated with collection of 3,000 tons of nodules, how should we think about fixed and variable costs as we get closer to production. We laid out that at full-scale steady-state production on NORI-D, you would be expecting roughly $503 per ton of revenue versus roughly $200 per ton of total cost. And keep in mind that when we are starting initial small-scale production on Project Zero, the economics are not going to be as high as that, which would imply a 60% plus EBITDA margin. When we look at where things might end up with PAMCO, we are feeling very good about what thatâ\u0080\u0099s going to mean for our EBITDA margin and free cash flow positivity on Project Zero. One data point to look to in March 2022 in the non-binding term sheet signed with Allseas, it was guided to â\u0082¬150 per ton of costs initially for Project Zero to personal new collection and then shipment to shore. I think itâ\u0080\u0099s important to keep in mind that again, what you have seen over the last several quarters has been many hundreds of people at sea working tirelessly at a project, but now we are at the stage that the campaigns are mainly done. There are also â\u0080\u0093 of course, we did the collector test, which was many months at sea and also had a second vessel. So, the going-forward cost for our company, public company expenses and personnel costs, etcetera, we really think that if needed, we could get down below $5 million per quarter. So, with that number out there, we think as we have shown with this â\u0080\u0093 some of these financing options over the last few months, we are going to be able to do what we can to take step-by-step to funding that number and make sure that we are doing it and as low with as little dilution as possible. It may be in the form of a one big transaction potentially with the partner, if you are talking about an earning or stake sale or other asset level possibilities, but we have the tools at our disposal to get there in many different ways. And so because we have completed a lot of the trials in 2021 and 2022 on the pilot processing, itâ\u0080\u0099s â\u0080\u0093 we felt we needed to bring back nodules, but the truth is we canâ\u0080\u0099t sell them."
}