{
    "symbol": "ARLO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-07 19:27:06",
    "content": " Forward-looking statements include statements regarding our potential future business, operating results and financial condition, including descriptions of our revenue, gross margins, operating margins, earnings per share, tax rates, expenses, cash outlook, guidance for the first quarter and full year 2023, transition to a services first business model, the commercial launch and momentum of new products and services, strategic objectives and initiatives, market expansion and future growth, the effect of our anticipate awareness campaign on future growth, partnership with various market leaders, continued new product and service differentiation, supply chain challenges, transportation costs and the impact of COVID-19 pandemic on our business, operating results and financial condition. Revenue was $118.5 million, which was down year-over-year, but non-GAAP gross profit rose 2% year-over-year. Arlo produced total revenue for the full year of $490.4 million, a growth of 13% year-over-year and within the range of the guidance we provided at our Analyst Day a year ago. Our service revenue was up more than 30% to $136.5 million, while our service costs were up less than 10% exhibiting the leverage that drove a 7 percentage point increase in service gross margin to 67%. To be clear, when looking at total service revenue, and our annual recurring revenue, Arlo service business is growing at roughly 50% year-over-year, has 70% gross margins and we expect the next 12 months of service revenue to be nearly $200 million. Arlo service business is growing at roughly 50% year-over-year, have 70% gross margins and should grow 45% plus to reach nearly $200 million in 2023. Driven by our services business, Arlo is expected to cross over to non-GAAP profitability in Q2 of this year and to reach full year non-GAAP operating margin of nearly 5% for 2023. Revenue for the full year 2022 was $490.4 million, up nearly 13% year-over-year and within our original annual guidance range. Our strategic shift to a services first operating model was instrumental in driving our year end ARR to $137.8 million, up 53% year-over-year and thereby providing greater predictability and visibility into our ability to deliver near term revenue and profitability targets. Our service revenue for Q4 was another record at $38.3 million, an increase of $9.9 million or 35% year-over-year and an increase of $2.9 million or 8% quarter-over-quarter, driven by the addition of 189,000 paid accounts in the quarter. Our service revenue for the full year 2022 was $136.5 million, an increase of $33 million or 32% year-over-year driven by the addition of 795,000 paid accounts in the year and a robust install base of 1.9 million subscribers at the year end. Our product revenue for the full year 2022 was $353.9 million, an increase of $22.3 million or 7% year-over-year. Our non GAAP gross profit for the full year 2022 was $140.9 million, up $28.9 million or 26% year-over-year. Total non-GAAP operating expenses for the full year 2022 were $146.9 million, up $23.8 million or 19% year-over-year. For the 2023 full year, we expect revenue to be in the range of $460 million to $490 million factoring in our cautious outlook for product sales, potential headwinds in the European region and heightening level of optimism and visibility for growth in our service business."
}