{
    "symbol": "NAPA",
    "quarter": 2,
    "year": 2023,
    "date": "2023-03-08 19:57:06",
    "content": " First, we delivered nearly 5% organic net sales growth at the high-end of our expectations for the quarter and lapping the robust 18% growth we realized in the prior year period. And fifth, our highly diversified approach to grape sourcing and wine production coupled with clear visibility into our cost structure enabled us to deliver strong results up and down the P&L with adjusted gross profit margin and adjusted EBITDA margin each several hundred basis points above the prior year period and also ahead of our plan. As anticipated, our high margin DTC channel delivered robust growth in the quarter benefiting from the previously mentioned change in cadence of the Kosta Browne Single Vineyard Series offering from the first quarter into the second quarter, as well as the highly successful inaugural Kosta Browne Burgundy offering. Second quarter gross profit was $55.2 million, an increase of $5.7 million or 11.5%, compared to the prior year period. Given our strong year to date performance and confidence in our ability to execute throughout the remainder of the year, we are raising our guidance for fiscal year 2023, which now calls for net sales of $398 million to $404 million, reflecting approximately 7% to 8.5% organic volume led growth. To reflect our second quarter and first half outperformance, we now expect adjusted gross margins for fiscal 2023 to reflect modest expansion, which is an improvement versus our prior guide of flat to down approximately 50 basis points year-over-year. It's generally fully subscribed and then we've seen the same thing with this quarter and that gives us a lot of confidence into our Q4 plans as well, because a big piece of the growth in Q4 is the Kosta Browne Appalachian offering. In addition to that, we're seeing really strong performance from our Decoy Limited offering, which is our Blue Label, and that has margins that are favorable to our Decoy Wine brand, which we're seeing as well, but in regard to your question on inflation, we've talked about that in the past and we've made those pricing adjustments to accommodate for that and we feel very confident that we're getting the results that we anticipated."
}