{
    "symbol": "ZTS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-04 13:25:02",
    "content": " I'm pleased to say Zoetis delivered another strong quarter with 8% operational growth in revenue and 9% operational growth in adjusted net income, driven once again by the strength of our companion animal portfolio. As anticipated, our livestock portfolio continued to face challenges, declining 1% operationally in the second quarter, largely due to generic competition primarily in U.S. cattle and declines in swine products in China due to lower pork prices and COVID-related supply constraints. Our key dermatology products continue to demonstrate strong growth, 22% operationally for the first half, and we see opportunity to expand in underpenetrated markets especially internationally and introduce life cycle innovations like Apoquel chewable tablets. Meanwhile, our operational growth in international has remained steady throughout the first half of the year at 8% despite COVID lockdowns in China and revenue reductions in Russia and Ukraine due to the war. Companion animal products continue to be the primary driver of growth, growing 14% operationally with livestock declining 1% on an operational basis in the quarter. Meanwhile, our key dermatology products, Apoquel and Cytopoint, had significant global growth again with $315 million of revenue, representing 16% operational growth against a robust prior year in which these products were 22% operationally in the second quarter of 2021. Sales of livestock products declined 1% operationally in the quarter, negatively impacting growth across the portfolio were global generic competition for Jackson and the War in Ukraine. Volume growth in our international and companion animal portfolio was 10% in the second quarter, and we also saw growth across our injectable products, including monoclonal antibodies, vaccines and Cytopoint. Adjusted operating expense increased 10% operationally with SG&A growth of 8% operationally, driven by promotional and marketing expenses related to key brands and new product launches as well as T&E cost beginning to return to pre-COVID levels. I think you can expect that to continue in the back half of the year when you consider, as Kristin just mentioned, Solensia will be fully launched in the second half in the U.S. here, we'll continue to see growth in Trio and with Librela, which we expect to be a blockbuster in the EU this year, we delivered $21 million in the first quarter, $26 million in the second quarter."
}