{
    "symbol": "FNV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-05 14:35:23",
    "content": "  Operator: Good morning, ladies and gentlemen, and welcome to the Franco-Nevada Corporation’s First Quarter 2022 Results Conference Call and Webcast. This call is being recorded on May the 5th, 2022. Following the presentation, we will conduct a question-and-answer session where you may ask a question through the phone line or webcast. I would now like to turn the conference call over to your host, Bonavie Tek, Vice President of Finance. Accompanying this call is a presentation, which is available on our website at franco-nevada.com, where you will also find our full financial results. Paul Brink, President and CEO of Franco-Nevada, will provide some introductory remarks; followed by Sandip Rana, Chief Financial Officer of Franco-Nevada, who will provide a brief review of our results. I will now turn the call over to Paul Brink, President and CEO of Franco-Nevada. The energy contribution was particularly strong, offset somewhat by lower precious metal deliveries. With slightly lower precious metals deliveries than expected from Cobre, Candelaria and Sudbury. Gas prices in particular remain above $7 per Mcf, almost double the 375 per Mcf we used to compile our guidance with. Our efforts continue to be recognized, in last month, we were named through Corporate Knights List of Best 50 Canadian Corporate Citizens. Detour Lake has seen further expiration success, and Agnico is now considering an underground mine and an even larger throughput expansion. The Tasiast 24K expansion is ongoing, and currently it's operating around 21,000 tons per day. At Malartic, the Odyssey project construction is on track and over time, more of East Goldy appears to fall on our royalty claims. When the industry has access to capital, it typically drives our organic growth. Our asset handbook launched at our recent Investor Day, highlighted impressive resource growth in the portfolio. We had a couple of small additions to the portfolio during the quarter 6% NSR on the Caserones copper mine in Chile, and a 2% NSR on claims that cover a portion of the Castle Mountain gold mine, where we have an existing royalty on the broader property. We're generating robust cash flow, 231 million in the quarter. Earlier this year, we increased the dividend to $0.32 a share or roughly $61 million per quarter. Looking forward, our business development team is very active, principally looking to finance new gold mines. As Paul mentioned, the company reported strong financial results for first quarter 2022. Just to remind you of one of the changes with our reporting, beginning last quarter, we did begin including energy revenues in our gold equivalent ounce total. On Slide 4, we have highlighted the gold and gold equivalent ounces sold for the three months ended March 31, 2022 and 2021. Overall, GEOs sold increased slightly compared to prior year with Q1 2022 GEOs sold being 178,614. As we had highlighted during our year-end financial results call, we were expecting less GEOs in 2022 from a few specific assets, Hemlo, Antamina and Antapaccay. At Hemlo, Barrick produced less gold ounces from Franco lands, resulting in a lower NPI than prior year despite a higher gold price. At Antapaccay, the operator is mining through a lower grade zone and was impacted by low recoveries during the quarter. We expected 2022 to be more of a normalized year similar to previous years, with a range of 2.8 million to 3.2 million silver ounces being delivered. At Cobre Panama, our largest asset, GEOs were relatively flat year-over-year, with 29,495 being sold, compared to 29,622 a year ago. First quarter was impacted by some scheduled plant maintenance, which should not be a factor in second quarter. Although Candelaria GEOs were higher year-over-year, there was some impact from delays and shipments. For diversified GEOs, our Vale Royalty resulted in just over 9,000 GEOs for the quarter. This does include about 2,400 GEOs related to prior year. As you know, each quarter we make an estimate of what the royalty will be, with the actual amount being announced by Vale in late March and September of each year. As a result, you will see adjustments to our accruals twice a year in Q1 and in Q3. Slide 5 highlights our total revenue and adjusted EBITDA announce for the three months ended March 31, 2022 and 2021. As you can see from the bar charts, revenue and adjusted EBITDA has increased year-over-year, the company recorded 338.8 million in revenue in first quarter and 286.6 million in adjusted EBITDA, a margin of 84.6% was achieved. The WTI oil price averaged $94.29 per barrel during the quarter, a 63% increase from prior year. Natural gas prices also increased significantly, with Henry Hub averaging $4.57 an Mcf during the quarter compared to $2.73 a year ago. As you turn to Slide 6, you'll see the key financial results for the company. As mentioned with the increase in GEOs sold and commodity prices, the company had strong revenue growth for the quarter. Depletion was higher at 74.6 million versus 71.2 million a year ago, due to the increase in GEOs sold, but also recording depletion related to the Vale Royalty, which was not present last year. Finally, with respect to taxes, the effective tax rate for the quarter was 16.5%, which is higher than the 15% we have trended to previously. Adjusted net income was 177.2 million, a 10% increase over 2021, while adjusted net income per share was $0.93, an 11% increase compared to prior year. Slide 7 highlights the continued diversification of the portfolio, which we consider one of the strengths and differentiators of Franco-Nevada. With respect to asset diversification, Cobre Panama was our largest revenue generator at 17% of total revenue for the quarter, followed by Antapaccay in Candelaria at 8%. Our largest exposure to revenue being generated by any one operator is 17%, which is First Quantum, who operates Cobre Panama. For first quarter 2022, the cash cost per GEO, which is essentially cost of sales divided by gold equivalent ounces sold, was $244 per GEO. This amount will fluctuate depending on the mix of royalty versus stream GEOs, including mining and energy. But as you can see at current average gold prices, the company generates significant margins. In a rising commodity price environment, we expect to benefit fully as the cost per GEOs sold should not increase significantly. Here, we have highlighted our quarterly revenues and our quarterly corporate administration and share-based compensation expenses since our IPO. As you can see, revenues have grown significantly over the period shown, while corporate costs have remained fairly stable. With the increase in the Franco-Nevada share price during the quarter, there was a corresponding increase in this expense. Management believes, we can continue to add to our portfolio and grow our business without adding significant cash overhead to the company. Effective March, 2022 the $100 million credit facility held by one of our subsidiaries was not renewed. At this time, we have one corporate facility for $1 billion, and when including this with our cash and cash equivalents, total available capital at March 31st, 2022 is $1.7 billion. So obviously, there was higher grades at site during the quarter, and so you got more GEOs then you really thought you would get in your outlook. I think Jason speaking here, what we would point you to is guidance, which is really what we’ve based our outlook upon as part of their forecasted mining sequence. I don't think they've put guidance out there, but once they have a better grip on that grade reconciliation and are comfortable that they can keep the dilution low, I expect that they -- there's a chance that they would increase their production outlook. Your second part of your question, the assets that were higher or below our expectation, I think most were in line. But they're still mining and stockpiling ore, Candelaria did have some delays on shipments. But otherwise, most assets were in line with our expectations. I mean, your energy assets segment obviously, is phenomenal, not a surprise. And you're the only precious metals royalty company in our coverage universe at least that has this kind of leverage to energy prices, and we're -- I mean -- Paul mentioned this earlier, in quite the inflationary environment. And I mean, just from what we modeled out there's not all that many large scale projects coming online in the next few years, but then again interest rates are going up. Yeah, perhaps a comment on the outlook and more or so where we are active right now is on the precious metal side. It's always a balance, you'd love to do most of your deals when commodity price are week, you get a better return on the prices. I'd say that's the sort of environment we in certainly for gold equities, there is some gold equity availability, but the not at crazy prices. So I'd say that the gold price setup, we're very bullish on long-term gold prices. The industry is building mines, we do think it's a good time to be financing new gold mine builds. Also, because of the balance of our portfolio, we're not looking to add more energy assets at the moment. Maybe my first question is on the Caserones Royalty, not so much on the acquisition itself. We know Dave Cole, who runs EMX from way back when we were all working at Newmont, and I have been intrigued by the business that he's built over time. I think they stand out amongst the small royalty companies, and where many companies are competing to buy assets in what's probably an overheated market, their businesses is -- got a large component, which is around royalty generation, where they prospect generating, selling on the properties and keeping royalties. Where it all came together as is, yes, they had acquired a portion of this royalty before, which put them in the driving seat in terms of acquiring the second portion, and they included us in that transaction, and we decided to make the investment at the same time. Maybe another question, or maybe it's related or maybe it's not related. As you said, the competitive nature of the industry at least on a smaller end is now ultra competitive. I'd say, from our perspective, Cosmos, it's always -- we see good prospects to do private deals. We've always found that in doing private deals, we believe we can get a better return on capital. I do see the rationale, obviously, for smaller players size does matter more in terms of relevance to investors. I think, Sandip, you sort of mentioned it, but I noticed that for the iron ore revenue, $16.8 million in the quarter of which $4.5 million is related to the second half of 2021. As you mentioned, it gets trued up twice a year to make an estimate. But also noticed that, in Q1 iron ore prices increased quite a bit compared to Q4 last year, even compared to when it peaked earlier on last year as well. I guess part of that is also, we don't have complete visibility to the prices that Vale is selling the iron ore at because they have entered into certain contracts. So, we are just taking sort of the average price for the quarter and making our best estimate. And obviously, we also estimate the deductions that get applied against the royalty. So in theory, yes, if you are in a rising iron or price environment, you’d get positive adjustment. Just wanted to talk to you, you said the portfolio performed as expected. Two assets that were different from for us were number one, Hemlo and number two, Gold Quarry. Just starting with Hemlo, much stronger than we had expected. You had provided guidance for us earlier, but this seems to have done very well in Q1. So there is small component of Q1 revenue for Hemlo, Tanya, that was related to prior year. So as you know, we make an estimate on the NPI, and then it gets chewed up each quarter based upon what Barrick reports to us. Going forward, I would expect it to be less than Q1 for each quarter for the rest of the year. My guess, it's probably going to be about half to 60% of what we achieved in Q1 going forward. Again, it's an unknown. Costs were in line with prior year, just that the production was less on our realty ground. With respect to Gold Quarry, last year in Q1, we had a true up for the previous year. And so year-over-year, it looks like there is a large variance for Gold Quarry, but the amount that we recorded for Q1 was our expectation. Are we getting any more from Gold Quarry than the rest of the year, because we expect -- \n It'll be next to next to nothing basically. All I can say is that, right now we are on-track to achieve our guidance, Tanya, for both, the precious metal side and on total GEOs. And then maybe just, Sandip, just on the global minimum tax. I know we ask you all the time, but it is now in the Canadian Federal Budget 2022. Yes, it was part of the Canadian Federal Budget that was released a couple of weeks ago. It's definitely moving forward in terms of process, there's lots of articles out there that are saying it's going to be tougher to implement as well to get everybody on site, I think there was an article in the financial post this morning on the global minimum tax and getting everybody aligned. I think with everything that's going on in the world right now, I think 2023 is optimistic. I think, it was early 2023, now they're -- I think they're saying to the end of 2023. And then my final question, just on M&A and I know I ask this all the time, and see that you're doing a lot of smaller royalty deals under 50 million. In terms of mine builds, I would say, yeah, there continues to be a decent pipeline, especially on the gold side of projects that are moving forward towards development. On the small royalty side, as we typically say, we look across the spectrum. So if we see good royalties, even if they're smaller, we like to add those optionality within the portfolio. I'd say across the spectrum, but on the gold side, that's the typical type of side that you might see. I will now turn the Q&A session over to Bonavie Tek, who will take questions from the webcast."
}