{
    "symbol": "WDFC",
    "quarter": 2,
    "year": 2023,
    "date": "2023-04-06 21:12:02",
    "content": " Today, we reported net sales of $130.2 million for the second quarter of fiscal year 2023, which was relatively constant compared to the same period of last year. Sales in the Americas, which includes the United States, Latin America and Canada were up 15% in the second quarter to $62.9 million. Maintenance product sales in Canada increased 12% in the second quarter, primarily due to the favorable impact of price increases, which were partially offset by unfavorable changes in foreign currency exchange rates and weaker economic conditions. Sales in EMEA, which includes Europe, Middle East, Africa and India were down 13% in the second quarter to $46.8 million. On a constant currency basis, sales would have decreased 4% compared to the second quarter of last year. Sales in our EMEA direct markets, which accounted for 74% of the region's sales in the second quarter declined by 2% during the quarter compared to last year. Sales in our EMEA distributor markets, which accounted for 26% of the region sales in the second quarter decreased by 35% during the quarter compared to last year. In total, our EMEA segment made up 36% of our global business in the second quarter, over the long term, we anticipate sales within this segment will grow between 8% to 11% annually. Sales in Asia Pacific, which includes Australia, China and other countries in the Asia region were down 4% in the second quarter to $20.5 million. On a constant currency basis, sales for Australia would have increased by 10% compared to last year. In our Asia Pacific distributor markets, sales were down 11% compared to last year, primarily due to lower sales of WD-40 multi-use product driven by weaker market demand and economic conditions as well as the timing of customer orders. On a constant currency basis, sales would have increased by plus 7% compared to last year. In total, our Asia Pacific segment made up 16% of our global business in the second quarter as the long term, we anticipate sales within this segment will grow between 10% to 13% annually. So consolidated sales of our flagship brand are down 1% in the second quarter and 7% year-to-date, we have a high level of confidence that the WD-40 multi-use product will return to solid growth this fiscal year. Despite this disappointing result, we've experienced significant growth in priority markets like the United States, Mexico and China, where sales of WD-40 multi-use products have increased year-to-date by 13%, 12% and 10%, respectively. On a constant currency basis, net sales would have increased 4% compared to the second quarter of last year. In the second quarter, our gross margin was 50.8% compared to 50.4% last year. In the second quarter, our cost of doing business was 33% compared to 30% last year, but it did improve from 36% in the first quarter as revenues improved and we continue to manage our expenses. This quarter, our cost of doing business increased by $3.3 million or 8% due to higher employee-related expenses and increased travel and median expenses compared to the prior year second quarter. Although our cost of doing business increased, our cost of doing business as a percentage of sales was impacted more significantly due to the lack of revenue growth this quarter compared to the prior year second quarter. EBITDA was 19% of net sales this quarter, which is down from 21% compared to last year, but an improvement from 17% in the first quarter. Net income for the second quarter was $16.5 million versus $19.5 million in the prior year, reflecting a decrease of 15%. On a constant currency basis, net income would have declined 10% compared to the second quarter of last year. We expect strong sales in the remaining two quarters of fiscal year 2023, but the recovery of our sales volumes impacted by the disruptions caused by our pricing actions has been slower than we originally anticipated, and we no longer believe that we will fully recover those losses in the back half of this year."
}