{
    "symbol": "WDFC",
    "quarter": 1,
    "year": 2023,
    "date": "2023-01-09 18:46:04",
    "content": " Today, we reported net sales of 124.9 million for the first quarter of fiscal year 2023, which was a decrease of 7%, compared to last year. On a constant currency basis, net sales would have decreased by less than 1%, compared to the first quarter of last year. Maintenance product sales in Canada increased 7% in the first quarter, primarily due to the favorable impact of price increases, which were mostly offset by unfavorable changes in foreign currency exchange rates and weaker economic conditions that resulted in lower levels of demand. On a constant currency basis, sales would have decreased 15% over the first quarter of last year. Sales in our EMEA direct markets, which accounted for 70% of the region sales in the first quarter, declined by 21% during the quarter, compared to last year, due to the impact of changes in foreign currency exchange rates and reduced demand driven by weaker market and economic conditions. Sales in our EMEA distributor markets, which accounted for 30% of the region sales in the first quarter decreased by 43% during the quarter, compared to last year. Though consolidated sales of our flagship brand were down 12% in the first quarter, with every confidence WD-40 Multi Use Product will return to growth this fiscal year. In the first quarter, sales of WD-40 Specialist were up 23%, compared to last year. In the first quarter, e-commerce sales rolled back and were up 51%, compared to the first quarter of last year. On a constant currency basis, net sales would have decreased and significantly compared to the first quarter of last year. This quarter, our cost of doing business increased by $1.4 million or 3%, due to increased travel and meeting expenses and higher employee-related expenses, compared to the prior year's first quarter. EBITDA was 17% of net sales this quarter, which is down significantly, compared to last year, primarily due to lower sales and higher operating expenses this quarter, which was offset by an improvement in our gross margin percentage."
}