{
    "symbol": "BLFS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 22:08:09",
    "content": " We believe our Biopreservation media franchise could easily reach $250 million in revenue within five years, reflecting 30-plus percent annual growth. New Q3 customer sites by product line, included 14 more now using Biopreservation media, 11 new ThawSTAR users, 12 new EVO Cold Chain end users, 14 new Cryogenic Freezers and Accessory Customers, 114 new Sterling ULT Freezer and Accessory customers, 18 new BioStorage customers and 10 new Cell Processing customers now using Sexton products. For Biopreservation media, we also remain confident that each customer clinical application, if approved, could generate revenue in a range of $500,000 to $2 million annually. We estimate that annual revenue for Sexton reagents and consumables used in approved customer therapies ranges from $500,000 to $1 million for both CellSeal vials and HPL Media. In our final three revenue platforms, storage and storage services, which includes evo Cold Chain Rentals and SciSafe Storage Services, we either shipped first use products or engaged for initial services with 30 new customer sites in Q3, 18 for storage services and 12 for evo. Cell processing platform revenue was $18.1 million, up 57% over the same period in 2021 and organic growth was 50%. Freezers and thaw systems platform revenue was $15.3 million, total and organic growth was down 13% over the same period in 2021. Storage and storage services platform revenue was $7.3 million, with both total and organic growth of 56% and over the same period in 2021. Total revenue for the nine months ended September 30, 2022, was $117.5 million, an increase of 44% over 2021 with organic growth of 44%. Full year 2022 platform revenue is now expected to be between $67 million to $68 million, an increase of 49% to 51% over 2021 and organic growth of 42% to 43%. Full year 2022 platform revenue is now expected to be between $66 million and $68 million, reflecting supply chain challenges on our cryogenic freezer product line. For our storage and storage services platform, we increased the bottom range by $4 million and increased the top range by $3 million and is now expected to be between $27 million to $28 million with total and organic growth of 54% to 59% over 2021. So what gives us confidence that the estimated range of annual revenue of an approved therapy of $500,000 to $2 million per year can hold, a lot of anecdotal data and looking at revenue from our customers who have approved therapies. There will be several of these catalysts that stack up on each other every quarter and then year-over-year here, all of which we believe is easily going to support my comment a minute ago of just media alone growing modestly, and I say modestly relative to a lot of other tools and services, but modestly at 30%-plus annually, getting to $250 million in revenue of super high-margin recurring, very sticky, written into BLA kind of revenue."
}