{
    "symbol": "BLFS",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 21:40:29",
    "content": " Total revenue was $40.5 million, up 30% from Q2 2021 with organic revenue growth of 44% and Biopreservation media revenue growth of 46%. To put a bow on it, this was a noncash accounting adjustment, and it does not reduce our confidence in meeting both our guidance for 2022 nor our 2024 exiting aspirational financial goals, which include $250 million in revenue, 50 points of adjusted gross margin and 30 points of adjusted EBITDA margin. New Q2 customer sites by product line included 17 now using Biopreservation media, 10 new ThawSTAR users, 11 new evo cold chain end users, 10 new cryogenic freezer and accessory customers, 110 new Stirling ULT freezer customers, 30 new biostorage customers and 14 new self-processing customers now using Sexton products. In our final three revenue platform, Storage and Cold Chain Services, which includes Eagle Cold Chain Rentals and SciSafe Storage Services, we either shipped first use products or engaged for initial services with 41 new customer sites in Q2, 30 for storage services and 11 for evo. Revenue for the second quarter 2022 totaled a record $40.5 million, representing a 30% increase over 2021. Organic revenue increased 44%, driven by Biopreservation media revenue of $14.1 million, which was up 46% versus Q2 2021. Revenue for the six months ended June 30, 2022 totaled $76.8 million, an increase of 60% over 2021 with organic growth of 45%. Adjusted EBITDA for the second quarter of 2022 was positive $1.5 million compared with positive $3.7 million for the second quarter of 2021, and negative $814,000 for the first quarter of 2022. Taking into consideration our adjusted EBITDA of positive $1.5 million, cash used in Q2 2022 was related to working capital adjustments of $13.4 million primarily due to timing, which includes $7 million increase in accounts receivable and $3.1 million increase in inventories. We have tightened full year 2022 revenue guidance to be in the range of $160 million to $166 million, reflecting year-over-year growth of 34% to 39% and organic growth of 37% to 43%. Cell processing platform; increase the low range by $3 million and the high range increase by $2 million, reflecting high demand for biopreservation media, and the platform is expected to be between $67 million to $69.5 million, an increase of 49% to 55% over 2021 and organic growth of 42% to 47%. Freezers and thaw systems platform; decrease the low range by $4 million and decrease the high range by $6 million, and is expected to be between $70 million and $71.5 million, reflecting lower than expected revenue for our ULT product line. In regard to our aspirational financial goals, for the Q4 2024 run rate, we are confident in our targets of $250 million in revenue, 50% adjusted gross margin and 30% adjusted EBITDA. And three, to say it one more time, we remain very confident that we will achieve our Q4 2024 run rate aspirational financial goals of $250 million in revenue, 50 points of adjusted gross margin and 30 points of adjusted EBITDA. Let's just cover that part first, then I'll make a commentâ\u0080¦\n So consumables, over 60% of the $250 million and capital equipment, which would be the freezers and thaw systems, under 40% of the $250 million."
}