{
    "symbol": "BLFS",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-16 21:55:22",
    "content": " Iâ\u0080\u0099ll start off by noting the strong performance our team delivered in Q4 to conclude 2022 with continued execution on our key initiatives of gaining new CGT and biopharma customers, driving continued adoption of our cell processing and storage and storage services platforms and making meaningful supply chain and quality improvements in our freezers platform. Iâ\u0080\u0099ll remind you now what our three platforms are: first, cell processing, which includes biopreservation media and Sexton cell processing products; second is our freezers and thaw systems platform comprised of cryogenic liquid nitrogen freezers and Sterling ULT mechanical freezers and automated thawing Instruments; and finally, storage and storage services, which includes our SciSafe storage services and our evo cold chain management offering. New Q4 customer sites by product line included 15 now using biopreservation media, 7 new ThawSTAR users, 12 new evo cold chain end users, 13 new cryogenic freezers and accessory customers, 139 new Stirling ULT freezer and accessory customers, 26 new BioStorage customers and 5 new Cell Processing customers now using Sexton products. In our final three revenue platforms, storage and storage services, which includes evo cold chain rentals and SciSafe storage services, we either shipped first use products or engaged for initial services with 38 new customer sites in Q4, 26 for storage services and 12 for evo. To wrap up new customers acquired in 2022, the full year estimates by product and service line include 69 for biopreservation media, 33 for Sexton cell processing solutions, 99 for SciSafe Storage Services, 43 for evo cold chain management, 82 for Cryogenic Freezers, 461 for ULT Freezers, and 35 for Thaw Systems. Total revenue for the fourth quarter of 2022 totaled a record $44.3 million, representing a total increase of 19% and organic increase of 18% over Q4 of 2021, driven by a 35% increase in biopreservation media revenue. The Q4 2022 adjusted gross margin was impacted by a late Q3 2022 stock grant to the operational team, which increased approximately $1 million over Q3 2022 or 2.3 percentage points of Q4 2022 revenue. For the full year of 2022, GAAP operating expenses were $307.3 million, which includes non-cash intangible impairments totaling $110.4 million in Q2 and Q4 of 2022 related to the Global Cooling acquisition, compared with full year 2021 GAAP operating expenses of $154.3 million. Full year revenue is expected to be in the range of $188 million to $202 million reflecting year-over-year and organic growth of 16% to 25% and an expected split of 45% in the first half of the year and 55% in the second half, excluding COVID-19-related revenue year-over-year growth of 26% to 35%. Total revenue expectations for 2023 include the following platform contributions, Cell Processing platform $89 million to $93 million, an increase of 30% to 35% over 2022. Freezers and Thaw Systems platform $72.5 million to $79 million, an increase of 9% to 18% over 2022, excluding COVID-19-related revenue year-over-year growth of 13% to 23%."
}