{
    "symbol": "WPM",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-04 13:47:03",
    "content": " Relative to the third quarter of the prior year, this represented a decrease of 13% primarily due to lower production at Salobo and the closure of the 777 mine. Revenue for the third quarter of 2022 amounted to $219 million, representing a 19% decrease relative to Q3 2021 due to a 12% decrease in commodity prices combined with a 7% decrease in sales volumes. Gross margin for the third quarter of 2022 decreased 33% to $102 million, reflecting not only the 19% decrease in revenues but also a higher proportion of sales volumes being attributed to PMPAs having a higher unit cost, primarily Yauliyacu. During the third quarter of 2022, the company terminated its Keno Hill PMPA in exchange for $141 million of common shares in Hecla Mining. Including the Keno Hill disposition, net earnings amounted to $196 million in the third quarter of 2022, a 45% increase relative to Q3 2021. Operating cash flow for the third quarter of 2022 amounted to $154 million or $0.34 per share compared to $201 million or $0.45 per share in the prior year, representing a 24% decrease on a per-share basis. During the third quarter of 2022, the company disbursed $59 million of dividends, invested $31 million relative to the Goose PMPA, $15 million relative to the Marathon PMPA and $1 million relative to the Cotabambas early deposit agreement, highlighting that these projects are advancing, fueling Wheaton's future organic growth. In the third quarter, Salobo produced 44,200 ounces of attributable gold, a decrease of approximately 20% relative to the third quarter of 2021 due to lower throughput. In the third quarter, the Stillwater mines produced 1,800 ounces of attributable gold and 3,200 ounces of attributable palladium, a decrease of approximately 38% for gold and 37% for palladium relative to the second quarter of 2021. During the quarter, the Constancia mine produced 560,000 ounces of attributable silver and 7,200 ounces of attributable gold, an increase of 8% on silver production and a decrease of 16% on gold production relative to the third quarter of 2021."
}