{
    "symbol": "WPM",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-12 15:28:07",
    "content": " The Companyâ\u0080\u0099s precious metal interests produced 163,000 gold equivalent ounces or GEOs in the second quarter of 2022 comprised of 68,000 ounces of gold, 6.5 million ounces of silver, 3,900 ounces of palladium and 136,000 pounds of cobalt. Revenue for the second quarter of 2022 amounted to $303 million, representing an 8% decrease relative to Q2 2021 due to a 5% decrease in the average realized gold equivalent price combined with the lower sales volumes. During the quarter, the Voiseyâ\u0080\u0099s Bay mine produced 136,000 pounds of attributable cobalt, a decrease of approximately 64% relative to the second quarter of 2021, primarily due to lower grades during the ongoing transitional period between the depletion of the Ovoid open pit and the ramp-up to full production of the Voiseyâ\u0080\u0099s Bay underground project. Wheatonâ\u0080\u0099s estimated attributable production in 2022 is now forecast to be 300,000 to 320,000 ounces of gold, 22.5 million to 24 million ounces of silver, and 35,000 to 40,000 gold equivalent ounces of other metals, resulting in production of approximately 640,000 to 680,000 gold equivalent ounces. And then, as you said, the sale of Keno, the updated mine plan from Stillwater, and I would say the other factor thatâ\u0080\u0099s come in is that weâ\u0080\u0099re now starting to see the shape of copper world, Rosemont and the reduction -- expected production in the early years, even though thereâ\u0080\u0099s significant growth in terms of total ounces to be received from Rosemont, itâ\u0080\u0099s going to start at the Copper World area. In closing, we believe that we are very well positioned to continue delivering value to all of our stakeholders for a number of different reasons: firstly, by having low and predictable costs, which when coupled with leveraged, increase in commodity prices, result in some of the highest margins in the entire precious metals space; secondly, by offering our shareholders exposure to our diversified portfolio of long-life, low-cost assets and the strong organic growth embedded within it; thirdly, by returning value to shareholders through our unique cash flow-linked dividend policy; and lastly, by being a leader amongst precious metal streamers in sustainability and by supporting our partners and the communities in which we live and operate."
}