{
    "symbol": "FUN",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-03 16:36:05",
    "content": " On a trailing 12-month basis through the end of the second quarter, we've generated $509 million of adjusted EBITDA, which adds -- surpasses our record performance in 2019. Adjusted EBITDA for the quarter, which management believes is a meaningful measure of the company's park level operating results, totaled $171 million representing an increase of $7 million or 5% compared with the second quarter of 2019. Shifting the focus to our preliminary results for the last 5 weeks and operating trends through the first 7 months of the year, over the past 5 weeks, our parks have entertained 6.1 million guests and generated $421 million of net revenues. Based on our preliminary July results through the first 7 months of the year, we've entertained 15.4 million guests and generated net revenues of $1.03 billion, representing an increase of 17% or $152 million compared to the first 7 months of 2019. These record results, combined with strong resort bookings drove deferred revenues to $307 million at the end of the second quarter representing an increase of $73 million or 31% from the end of the first quarter of 2022 and an increase of $15 million or 5% when compared to deferred revenues at the end of the second quarter of 2021. The high points are certainly the stickiness and sustained momentum that we're seeing in guest spending levels, while the law of big numbers kicks in and maybe on a percentage, July has pared back a little bit per cap growth more towards 24% versus 26-ish percent in Q2, that's -- in terms of absolute dollars, we're still seeing very consistent trends in guest spending. As we evaluate what we saw the whole of this year, we looked back and increasingly, and we've seen this over the last several years, pre-pandemic, we're becoming more back half heavy in terms of our results, that really reflects the strength of July and August, the huge appeal of our Halloween event and the revenues we generated in October. So as we look at the back half of the year and beyond, we've got an opportunity now to higher base of season pass-holders to renew and as we start building our plans for '23 with the capital we'll announce next week, we're really excited about the demand we think we can drive in the health of the business. So turning it all the way through, we think there's an opportunity to take a balanced view of capital allocation, make sure we invest enough to keep the business healthy, start at a rate where we can grow the distribution and reward all of our unitholders, but also take advantage of what, as I said earlier, what the market gives us is we're not really getting credit for the distribution or credit for the free cash flow we're generating over time, which has been the strength of our -- both our approach to the business and the strength of our business model. I think what's most encouraging, though, as Richard said, when you look at the long lead indicator, and you think about record number of season passes, record amount of deferred revenue on the books and then think about 80 -- approximately 80 incremental operating days from here forward, that's a very compelling set of facts that can lead towards, as I said in my prepared remarks, a meaningful pickup from -- of the variance that we've seen year-to-date. It's part of what's been a motivating factor behind you, maybe recall us talking about over the last year or so in certain markets, a little bit of a pivot away from more seasonal positions to more year-round part-time or full-time positions in the company that drove a little bit of some of our operating cost increase that we've talked about the last couple of quarters."
}