{
    "symbol": "FUN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-16 14:59:06",
    "content": " Excluding the impact of the sale leaseback transaction, operating costs in the quarter would have been down 9% compared to the first -- to the fourth quarter of 2021 or 7% on a per operating day basis, a key performance metric we are closely monitoring as we continue to better manage costs and improve operating margins going forward. Adjusted EBITDA, which management believes is a meaningful measure of the company's park level operating results increased $15 million year-over-year to a record $88 million in the fourth quarter. Moving on to the cost front; for the full year, operating costs and expenses this past year totaled $1.29 billion, up $298 million compared to 2019, including increases in cost of goods sold, operating costs and SG&A expense. The increases in operating costs and SG&A were primarily due to the impact of general cost inflation over the 3-year period particularly around labor costs as well as the full year inclusion of the Schlitterbahn parks, which weren't acquired until mid-year 2019. The year-over-year unit decrease reflects a slow start to the sales program due to poor fall weather as well as a return to normal purchasing patterns coming out of the pandemic, with more than half of our season pass sales cycle remaining, including the spring window that accounts for more than 40% of total sales, we remain focused on maintaining pricing, driving increased unit sales and matching or exceeding the record sales performance of our 2022 season pass program. Going into 2023, we will continue to prioritize revenue growth, which will be driven by demand from marketable capital and continued investment in food and beverage highlighted by big new anchor restaurants at our 2 largest parks, Cedar Point and Knott's Berry Farm, recovery of the group channel, which will be led by youth and school bookings in the spring and corporate business throughout the balance of the year and expanded park operating calendars over the first half of the year. I think as Richard said in the call, coming into this year, the focus was on driving revenue and returning to historical demand levels as quickly as possible, think we saw that the benefit of that in the fourth quarter when we did get back to historical levels. As we look to push top line revenue and attendance higher much like we did some years ago when we started adding days in late September and October with Halloween events and then November and December with WinterFest events, at some point, it's about finding more opportunities for guests to visit and finding more opportunities for us to sell season passes and the all-season products that go along with those things."
}