{
    "symbol": "FUN",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-02 16:22:02",
    "content": " Third, our trailing 12-month adjusted EBITDA at the end of the quarter totaled $537 million which was 6% better than the adjusted EBITDA of $505 million we delivered in fiscal 2019. In the third quarter, we entertained 12.3 million guests and generated record net revenues of $843 million, representing 12% or $90 million increase compared to the third quarter of 2021. The increase in out-of-park revenues reflects incremental third quarter results at Castaway Bay and Sawmill Creek Resort, 2 properties that were closed for renovations during the third quarter last year as well as higher occupancy rates and higher ADRs across the majority of our resort portfolio. Meanwhile, in-park capital spending in the quarter totaled $62.62, down 3% compared with the third quarter last year. In the quarter, combined per capita spending on food and beverage, merchandise and games increased to $22.28, up 2% from last year and up 31% from pre-pandemic levels. Based on -- based primarily on the expanded operating calendar, our parks had approximately 1 million more seasonal labor hours in the current period compared to the third quarter last year, accounting for more than 35% increase in operating costs. Adjusted EBITDA which management believes is a meaningful measure of the company's park level operating results, increased $29 million in the third quarter to a record $362 million compared to $333 million for the third quarter of 2021. Based on preliminary results for the 5-week period which had 177 total operating days, in-park per capita spending was $64.91 and out-of-park revenues totaled a record $21 million. For the comparable 5-week period in 2021 which had 176 operating days, net revenues totaled $219 million on total attendance of 3.2 million guests, in-park per capita spending of $64.97 and out-of-park revenues of $19 million. Based on these preliminary October results, through the first 10 months of the year, we've entertained 24.9 million guests and generated $1.68 billion in net revenues, representing an increase of 22% or $306 million compared to the first 10 months of 2019. Over this same period, in-park per capita spending was $61.72, up 27% from 2019 levels and out-of-park revenues totaled $195 million, up $40 million or 26% from the same period in 2019. Excluding the extensions in the prior year quarter, deferred revenues would have been up approximately $7 million or 4% year-over-year, including results from early fall sales of 2023 season passes and related all-season products. During the first 9 months of the year, cash flow from operations totaled $412 million, vesting our comparable 2019 performance by $23 million or 6%. Through the first 9 months of the year, we used $264 million to fully repay the company's term loan, bringing total debt outstanding down to $2.3 billion and net leverage back to pre-pandemic levels at 3.7x trailing 12-month adjusted EBITDA at the end of the quarter. When I look back on where we are year-to-date through the third quarter, weâ\u0080\u0099re down approximately 1 million seasonal hours to 2019."
}