{
    "symbol": "ORGO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 22:17:05",
    "content": " So beginning with a review of our revenue for Q4, we reported net revenue of $115.5 million for the fourth quarter, a decrease of 10% year-over-year, which was driven by a decrease â\u0080\u0093 a 10% decrease in our sale of Advanced Wound Care products and a 6% decrease in sale of our Surgical & Sports Medicine products. Net revenue for the fourth quarter of 2022 was $115.5 million, down 10%. Our Advanced Wound Care net revenue for the fourth quarter of 2022 was $108.8 million, down 10%. And lastly, net revenue from Surgical & Sports Medicine products for the fourth quarter of 2022 was $6.7 million, down 6%, with net revenue from PuraPly products for the fourth quarter of 2022 was $56.8 million, down 9%. Operating expenses for the fourth quarter of 2022 were $79.7 million compared to $75.5 million last year, an increase of 4.2% or 6%. The increase in operating expenses in the fourth quarter of 2022 was driven by a $3.1 million or 38% increase in research and development costs and a $1 million or 2% increase in selling, general and administrative expenses compared to the prior year period. Excluding these non-operating items and non-cash intangible amortization of $1.2 million in both periods, non-GAAP operating expenses for the fourth quarter of 2022 increased 7% year-over-year, driven by higher clinical study-related spending in support of our ReNu studies and mid-single-digit growth in SG&A expense. Operating income for the fourth quarter of 2022 was $8.7 million compared to operating income of $19.8 million last year, a decrease of $11 million. Net income for the fourth quarter of 2022 was $7.5 million compared to $51 million last year, a decrease of $43.5 million. For the 12 months ending December 31, 2023, the company expects net revenue between $450 million and $462 million, representing a year-over-year change in the range of flat to an increase of approximately 2% as compared to net revenue of $450.9 million for the year ended December 31, 2022. The 2023 net revenue guidance range assumes net revenue from Advanced Wound Care products of between $420 million and $428 million, representing a year-over change of down 1% to up 1% as compared to net revenue of $422.2 million for the year ended December 31, 2022. Net revenue from Surgical & Sports Medicine products between $30 million and $34 million, representing an increase of 5% to 19% year-over-year, as compared to net revenue of $28.7 million for the year ended December 31, 2022. And net revenue from the sale of our PuraPly products of between $180 million and $200 million, representing a decrease of approximately 26% to 18% year-over-year, as compared to net revenue of $242.7 million for the year ended December 31, 2022. For 2023, we expect the first quarter revenue in the range of approximately $95 million to $100 million or 21% to 22% of our full year 2023 net revenue."
}