{
    "symbol": "ORGO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-09 18:50:04",
    "content": " Beginning with the review of the results for Q2, we reported net revenue of $121.4 million, a decrease of 1% year-over-year, driven by a 2% growth in our sales of our advanced wound care products and a 35% decrease in the sale of our surgical and sports medicine products. We updated our full guidance for 2022, which now calls for a net revenue range of $465 million to $490 million, representing a year-over-year change in revenue of down 1%, up 5% on a reported basis and up 2% to 7% year-over-year on an adjusted basis. Net revenue for the second quarter of 2022 was $121.4 million, down 1%, and excluding ReNu and NuCel, we grew adjusted net revenue by 3%. Our Advanced Wound Care net revenue for the second quarter of 2022 was $113.8 million, up 2% year-over-year. Net revenue from Surgical and Sports Medicine products for the second quarter of 2022 was $7.6 million, down 35% driven by the suspension of marketing of our ReNu and NuCel products in connection with the expiration of the FDA's enforcement grace period on May 31st, 2021. Net revenue from PuraPly products for the second quarter of 2022 was $69.4 million, up 84%. Gross profit for the second quarter of 2022 was $94.7 million or approximately 78% of revenue, compared to 75.7% last year and represented a record gross margin for the company, reflecting the impressive gross margin potential in our model in the years to come. Operating expenses for the second quarter of 2022 were $82.8 million, compared to $69.7 million last year, an increase of $13.1 million or 19%. Total other expenses for the second quarter of 2022 were $0.8 million, compared to $2.4 million last year, a decrease of $1.7 million or 69%, driven primarily by the reduced interest rate for borrowings under our new credit agreement signed in August 2021. Adjusted EBITDA of $18.6 million for the second quarter of 2022 or 15.3% of net revenue, compared to adjusted EBITDA of $25.1 million or 20.4% of net revenue last year. For the 12-months ended December 31st, 2022, the company now expects net revenue of between $465 million and $490 million, representing a decrease of approximately 1% to an increase of 5% year-over-year or 2% to 7% growth on an adjusted basis. Our full-year 2022 guidance range now assumes sales of our amniotic products will at the midpoint of our full-year net revenue range decrease approximately 15% year-over-year in 2022, compared to our prior guidance range, which assume growth of 12% year-over-year."
}