{
    "symbol": "ORGO",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 21:24:06",
    "content": " Beginning with a review of the third quarter, we reported net revenue of $116.9 million, an increase of 3% year-over-year, driven by a 2% increase in sales of our advanced wound care products and a 15% increase in the sale of our surgical and sports medicine products. Sales of our PuraPly products increased 12% year-over-year, a long-term strategy to introduce new products and line extensions have enabled access to multiple sites of care including new physician specialties and continued to drive strong demand for this well-established highly differentiated PuraPly brand. Simply stated we are navigating an unexpected challenges in one of our key markets considering the circumstances we have developed and delivered year-over-year growth in sales of our advanced wound care products during the same -- the first nine months of 2022 fueled by our team's success and leveraging our diversified portfolio of products, including impressive growth from our PuraPly brand, with sales have increased 37% year-over-year for the first nine months of 2022. We've updated our full year 2022 guidance which now calls for net revenue in the range of 448 million to 465 million, which at the midpoint represents a decline of approximately 2% year-over-year on a reported basis, and essentially flat year-over-year on an adjusted basis. Our advanced wound care net revenue for the third quarter of 2022 was 109.5 million, up 2% year-over-year, and net revenue from surgical and sports medicine products for the third quarter of 2022 was 7.3 million up 15%. The increase in operating expenses in the third quarter of 2022 was driven by a 17 million or 27% increase in selling, general and administrative expenses, and 0.6 million or 7% increase in research and development costs compared to the prior year. Excluding these non-operating items and non-cash intangible amortization of 1.2 million and fair value of contingent consideration of 0.9 million in the prior year period, non-GAAP operating expenses for the third quarter of 2022, increased 19% year-over-year. Total other expenses of third quarter was 0.6 million compared to 3.4 million last year, a decrease of 2.8 million or 83%, driven primarily by the prior year period, including 1.9 million of loss on extinguishment of debt, which did not impact the financial results in the third quarter of 2022. Turning to a review of our 2022 net revenue guidance, which we updated in our press release this afternoon, for 12 months ending December 31, 2022, the company now expects net revenue between 448 million and 465 million, representing a decrease of approximately 1% to 4% year-over-year, and roughly flat on an adjusted basis excluding sales of ReNu and NuCel for the first five months of 2021. Our full year 2022 guidance range now assumes sales of our amniotic products will decrease at the midpoint of our full year net revenue range of approximately 28% year-over-year in 2022 compared to prior guidance, which assumed a decline of approximately 15% year-over-year. Sales of our non-PuraPly and non-amniotic products which collectively formed a group called PMA and other will decrease at the midpoint of the range approximately 19% year-over-year in 2022 compared to our prior guidance, which assumed a decrease of 17% year-over-year. Total GAAP operating expenses will increase approximately 15% to 16% year-over-year compared to our prior expectation of growth and range of 13% to 16% year-over-year, which includes the non-operating charges of 4.8 million related to the 275 Dan Road project."
}