{
    "symbol": "ORGO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 21:49:01",
    "content": " In Q1, we reported net revenue of $98.1 million, a decrease of 4% year-over-year, driven by flat growth in sales of our Advanced Wound Care products and a 39% decrease in the sale of our Surgical & Sports Medicine products. Excluding net revenues from these products, total net revenue increased 1% year-over-year on an adjusted basis in the first quarter. Lastly, in our PMA and other products, net revenue declined 14% year-over-year in the first quarter, driven by the expected impact of the suspension of Dermagraft manufacturing as part of our multi-year plan to consolidate manufacturing at our campus in Canton. We remain confident in our full-year 2022 guidance expectations, which calls for net revenue in the range of $485 million to $515 million, representing growth of 4% to 10% year-over-year on a reported basis and growth of 6% to 13% on an adjusted basis. Net revenue for the first quarter of 2022 was $98.1 million, down 4% and excluding ReNu and NuCel, we grew adjusted net revenue by 1%. Our Advanced Wound Care net revenue for the first quarter of 2022 was $91 million, essentially flat year-over-year. Net revenue from Surgical & Sports Medicine products for the first quarter of 2022 was $7.2 million, down 39% driven by the suspension of marketing of our ReNu and NuCel products in connection with the expiration of the FDA's enforcement grace period on May 31, 2021. Net revenue from PuraPly products for the first quarter of 2022 was $53.3 million, up 29%. Operating expenses for the first quarter of 2022 were $72.2 million compared to $64.4 million last year, an increase of $7.7 million or 12%. The increase in operating expenses in the first quarter was driven by a $5.3 million increase in selling, general and administrative expenses and a $2.4 million increase in research and development costs compared to the prior year period. Operating income for the first quarter of 2022 was $0.9 million compared to an operating income of $12.6 million last year, a decrease of $11.7 million. Total other expenses for the first quarter of 2022 was $0.7 million compared to $2.5 million last year, a decrease of $1.7 million or 70% primarily driven by the reduced interest rate for borrowings under the new credit agreement signed in August of 2021. Net income for the first quarter of 2022 was $0.1 million compared to net income of $9.9 million last year, a decrease of $9.8 million. Adjusted EBITDA of $5 million for the first quarter of 2022 or 5% of net revenue compared to adjusted EBITDA of $16 million or 15.6% of net revenue last year and we provided a full reconciliation of our adjusted EBITDA results in our earnings press release issued early this afternoon. For 12 months ending December 31, 2022, the company continues to expect net revenues between $485 million and $515 million, representing an increase of approximately 4% to 10% year-over-year. And by the way, a reminder, our 2021 revenue results include approximately $11 million in revenue attributable to our ReNu and NuCel products during the five months ended May 31, 2021 at the end of FDA enforcement grace period. Gross margins of approximately 76%, total GAAP operating expenses will increase approximately 10% to 15% year-over-year compared to our prior expectation for growth in the range of 9% to 13% year-over-year, and this increase is related to incremental restructuring expenses of approximately $3.2 million related to the next phase of our Canton consolidation. Total interest and other expenses of approximately $3.5 million, GAAP tax rate of approximately 25% compared to guidance, which assumed a GAAP tax rate in the low single-digits, non-cash D&A and non-cash stock comp expense of approximately $12 million and $6 million respectively and weighted average diluted shares of approximately $134 million."
}