{
    "symbol": "CPF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 18:05:20",
    "content": " I'd like to turn the call over to Mr. David Morimoto, Senior Executive Vice President, Chief Financial Officer. As we review the financial results of the second quarter of 2022 for Central Pacific Financial Corp. With me this morning are Paul Yonamine, Chairman and Chief Executive Officer; Catherine Ngo, Executive Vice Chair; Arnold Martines, President & Chief Operating Officer; and Anna Hu, Executive Vice President and Chief Credit Officer. During the course of today's call, management may make forward-looking statements. Starting with the tourism sector, month to date, July 2022, average air arrival counts are exceeding 90% of pre-pandemic levels from 2019. Visitor spending is strong, with $1.56 billion total for the month of May, which was an increase of 10.6% compared to the same month in 2019. The housing market in Hawaii remains very strong, with the Oahu Median single family home price at $1.1 million in June 2022, which is up 12% from the previous year. Other factors contributing to a favorable Hawaii economic outlook include a significant increase expected in Department of Defense Military spending, which is already the second largest sector of Hawaii's economy, with $7.7 billion in annual spending in 2020. Additionally, Honolulu's $9 billion plus rail construction project continues to move forward with construction of the first phase completed and expected to be operational by year end. Finally, $600 million in state funding was recently awarded for Native Hawaiian housing, which will lead to significant home construction over the next five years. Lastly with the possibility of a national economic recession increasing, it is important to note that the Hawaii economy whether the great financial recession better than most state. Hawaii, single family median home price fell 11% between 2008 and 2011 compared to a 24% decline nationally. Additionally, Hawaii's unemployment rate peaked at 7% in 2009, whereas nationally it rose to 10% during the same time period. With Hawaii's continued strength, we anticipate Hawaii will again outperform the rest of the nation during this cycle. Following on to Paul's remarks with Hawaii's economic strength and our solid balance sheet, we believe Central Pacific is well positioned for potential economic downturn. Our asset quality continues to be very strong, with non-performing assets to total assets remaining at 7 basis points as of June 30. Additionally, total criticize loans are less than 2% of total loans. Additionally, our construction portfolio was nearly 30% of total loans in 2008 compared to just 3% of total loans today. Next, I'd like to share the really great news that was announced last month, we were pleased and honored to be named the number one best bank in Hawaii by Forbes for 2022. Thank you, Catherine, in the second quarter through our successful business development efforts. Our total loan portfolio increased by 127 million, or 2.5%, sequential quarter, and 10% on an annualized basis. The growth was broad-based across most loan types, except for the CNI portfolio, which included decreases in PPP loans as that portfolio continues to wind down. Despite the rising rate environment due to our strength in the purchase market, and key relationships with our real estate joint venture companies. During the second quarter, we continued our mainland diversification strategy with purchases of select consumer, unsecured, and auto portfolios from our established partners. The purchases during the quarter were all within our established credit criteria, and had a weighted average FICO score of 735. As of June 30, total mainland consumer unsecured, and auto purchase loans were approximately 7% of total loans. We also continue to selectively participate in mainland commercial real estate, or CNI loans. Our teams are focused on specific mainland markets, primarily on the West Coast, where we have built considerable experience and expertise. We believe these opportunities complement our Hawaii franchise nicely as it provides diversification and typically higher yields, while fitting within our risk guidelines. We have a healthy loan pipeline and with our strong sales management discipline, and outstanding team or relationship managers, we are expecting our positive long growth trends to continue throughout the remainder of 2022. During the second quarter, core deposits grew $35 million or 0.6% from the prior quarter. Additionally, our average cost of total deposits in the second quarter held steady at just six basis points. Finally, Japan continues to be a key strategic focus area for us given our strong relationships there. Our initiatives are driving success, with an increase in our deposits from the Japan market, as well as a solid pipeline of opportunities. During the second quarter, we were able to successfully execute on a number of initiatives that positively impact shareholder value, including terminating and settling our defined benefit pension plan, which resulted in a one-time settlement charge of $4.9 million. Following the settlement, the company has no further defined benefit, pension plan liability or ongoing pension expense recognition, which will save us about $700,000 annually. Also during the second quarter, we sold all of our Visa Class B shares for a gain on sale of $8.5 million. On the branch and real estate front, we consolidated two of our smaller branches into nearby locations, bringing our total branch count as of June 30 to 28 branches. Finally, our Banking-as-a-Service FinTech strategy continues to progress well, and we are on track for the Swell app public launch later this quarter. Turning now to our financial results, net income for the second quarter was $17.6 million or $0.64 per diluted share. Net interest income for the second quarter was $53 million, which increased by $2 million from the prior quarter, primarily due to an increase in loan balances and yields. Normalizing for the impact of PPP in both quarters, net interest income increased by $3 million and the net interest margin increased 13 basis points sequential quarter. We anticipate that our margin will trend up further in the second half of this year as loan yields rise, and we manage our deposit pricing, which has historically had low beta repricing. During the quarter, there was also a loss of bank owned life insurance due to significant market volatility during the quarter, we have certain company owned life insurance policies use to hedge our deferred compensation plans. Other operating expense for the second quarter was $45.3 million, which included the one-time settlement charge on our defined benefit pension plan. Going forward, we expect that quarterly recurring total other operating expense will be in the $41 million to $43 million range. At June 30, our allowance for credit losses was $65.2 million, or 1.23% of outstanding loans. In the second quarter, we recorded a $1 million provision for credit losses due to loan portfolio growth, and net charge-offs. The effective tax rate increased slightly to 26% in the second quarter, as a result of less tax exempt BOLI income. Going forward, we expect the effective tax rate to be in the 25% to 26% range. And during the second quarter, we repurchased 174,000 shares, at a total cost of $4.2 million or an average cost per share of $24.18. Additionally, our Board of Directors declared a quarterly cash dividend of $0.26 per share, which will be payable on September 15 to shareholders of record on August 31st. To conclude Central Pacific had another solid quarter and continues to be well positioned in all key areas including liquidity, sensitivity, capital and asset quality, the environment continues to evolve rapidly but with our asset sensitive balance sheet, high quality loan and investment portfolio, as well as our strong capital base, we expect to continue to deliver strong performance, we have a differentiated strategy that will enable us to expand and diversify our franchise, making us a leader in our market. I just wanted to start on deposits, it's great to see the continued non-interest bearing growth. Just curious any commentary you might have on the deposit front and trends you're seeing whether you're starting to see some more rate pressures, obviously I mean, the Hawaiian economy tends to be much more rational. But we're very focused on making sure that we maintain our low cost deposit base, we're going to really stay focused on our digital offering. And we're hoping that a lot of our business development trips to Japan and trying to get more Japanese corporate and individual depositors here, which will naturally be low cost. We're not taking the higher costs government deposit route just yet, I think we have a very robust deposit pipeline. In the first half of the year, we saw some good opportunities for loan growth, and we took advantage of that. We believe there as Paul mentioned, we believe there's some great opportunities to grow core deposits to our digital strategies in Hawaii, on the Mainland and in Japan. And then touching on the organic growth outlook, could you maybe just touch a bit on demand, you talked about some of the economic trends in Hawaii, but just curious where you're seeing the most opportunities, how pipelines are trending, whether this quarter maybe saw some pull forward of demand, just given rising rates. Yes, hi, David, this is Arnold, you know we are pretty optimistic about long growth going into the second half of the year. Particularly, we're seeing a, continue to see a lot of activity in the commercial real estate area, as well as resi. And again, we're guiding to roughly $41 million to $43 million per quarter for the next several quarters. And the reason it's slightly higher, that guide is slightly higher than the normalized second quarter is a result of deferred comp. So again, the deferred comp plan had a rough above second quarter. I think if you take it for the full year, it's going to be roughly 2% to 3% over 2021 is just what we've been consistently guiding towards. We -- our equity stake is 19.9%, or voting share position and 4.9%. That's one thing on well, just another thing to add to what David mentioned, is that, you know, we've been very pleased with our ability on cost control. We did move 330 million from AFS to HTM in the first quarter, and then you're correct in the second quarter, we moved an additional 400 million. So today we're roughly, I think today we're roughly about 57% AFS, 43% HTM. And then with the deposit beta staying low, and the improvements in loan yields, that you're seeing is, would it be a reasonable to expect another 13 basis point increase in the margin this quarter. Again, obviously, a lot of things in play, but with the June 75, and the additional 75, likely today, we are guiding to a similar sequential quarter increase in the coordination. We were able to hold deposit rates flat with the 75 basis points in June and additional 75 in July, we are starting to see some movement in deposit. But again, we think we have quite a bit of room with total deposit costs at six basis points. And Arnold, I think I think you we're speaking I just want to make sure I heard this, right. No, so it's been consistent throughout the quarters in the past. Your mainland unsecured was about 4% of loans, and then your mainland snip was like 2% or 3%. Maybe starting with the snick what's Hawaii, what's mainland, and I don't know if this is for you or for Anna or David. Yes, our total commercial real estate on the mainland is about $309 million. Okay, so Mainland Auto is $126 million. So I'd say that it's going to stay early around the percentages that, we have today, it's pretty much stayed around there. Got it, got it. And then just staying on lens, can you just give us a refresh in terms of where you are on office exposure, what that total looks like any color you can give us around office or so, Office Mainland versus Office Hawaii and then same question, I guess on leverage loans and not just leverage loans. So for Office, on our total commercial mortgage book it is running about $189 million. Okay, I was going to break it down into Hawaii and Mainland for you. So for Office, the Hawaii portion is $110 million. And that represents about 8% of our total book, our total commercial mortgage book, I should say. And that's about 6% of our total commercial mortgage book, 1.5% of our total loan with a weighted average LTV of 49%. Sure, on our leverage loans, it's relatively small, it's about $30 billion as of June 30. Great, maybe just that's super helpful. And maybe just circling back on this 12 Elevate, as you think to start this and I guess Paul this is more question for you, I know this target a 650 average FICO as we've seen some banks pulled back from this type of lending. Is there any plans to sort of tweak that and I definitely appreciate that you're going to start small, fold it and watch it. And naturally, Anna, who's here today was instrumental in creating their credit policy, and I am as a board member, and also as a bank sponsor, we will make sure that there is adherence to our credit policy. And thanks for bringing up that point on FICO scores, because our plan over the next two to three quarters is to limit our exposure at about $8 million. And as we've said all along, we're going to start small, we're going to take a look at KPI dashboard on a daily basis, and make sure that we iterate, we pivot and we can very well adjust FICO scores or any other criteria as we see fit, especially if it starts to exceed 6% default rate, where Elevate is essentially giving us a preferred security interest. So, if at any time we see those defaults exceeding 6%, we're going to pivot on a lot of our lending criteria. And definitely, I hear you, but I think also I remain concerned, Elevate has a market cap of $60 million. Yes, and that's not really the target per se, but that's a minimum threshold that we plan to start off the process again to really start small and iterate. And if that 650 starts, and we start to see a lot of defaults, Laurie, obviously, we're going to ratchet it up, and we have all of the authority and ability to do so, I think the key is going to be around execution. And really our ability to execute, I think in the last four years, and this sounds rather self fulfilling, but whether it be rise 2020, or the guidance we've been giving to the street, or PPP loans, we've executed and this is not going to be any different. David, maybe just last question, if we could go back to expenses. So you had two branches, obviously that closed in the quarter. Yes, Laurie, there was one-time branch closure expenses of about $300,000 in the second quarter. Okay, so I guess so if I'm netting out your defined benefit, I'm netting out the branch closures, I mean, we're basically at $40 million on a quarterly run rate which is pretty substantially below your guide of $41 million to $43 million. So in the second quarter, our normal bank owned life insurance earned about $0.5 million, but the deferred comp hedge BOLI loss above $1.5 million. Got it, got it."
}