{
    "symbol": "ATIP",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 22:25:24",
    "content": " Until then, referrals per day in the first quarter were approximately 91% of the pre-COVID level full year 2019 while visits per day in the first quarter were approximately 84% of the full year 2019 level. Net patient revenue was $139 million, increasing 5% year-over-year, driven by higher volumes partially offset by lower rate per visit. Rate per visit was $103.6, sequentially decreasing 1.4% from $104.51 in the fourth quarter of 2021 and 4.2% year-over-year from $107.56 in the first quarter of 2021. Salaries and related costs in the first quarter of 2022 were $87 million, an 8.4% increase year-over-year from $81 million due to both more clinical FTE and wage inflation. Rent, clinic supplies, contract labor and other in the first quarter of 2022 was $52 million a 19.2% increase year-over-year from $43 million due to having more clinics and higher cost per clinic. PT rent and other costs per clinic during the quarter was approximately $54,000 and sequentially increasing 6.9% from $51,000 in the fourth quarter and 14.1% from $48,000 in the first quarter of 2021. Our provision for doubtful accounts during the first quarter was $5 million or approximately 3.7% of net patient revenue, which is trending favorably when compared to the first quarter of 2021 at 5.4% of net patient revenue. While visit volume and revenue were higher year-over-year, a lower rate per visit combined with clinician wage inflation, greater use of contractors and higher G&A led to lower margins driving the remaining $13 million increase in operating loss when compared to Q1 of the prior year. Cash generated during the first quarter was $46 million broken down between $27 million used to fund operations, $9 million used in investing activities and $82 million generated from financing activities. Finally, regarding new clinics, as Jack mentioned we opened 12 de novo clinics in the first quarter of 2022 and continue to expect to open between 20 and 30 new clinics for the full year 2022 focused on markets where we see outsized opportunities for growth."
}