{
    "symbol": "ATIP",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-08 23:07:03",
    "content": " Salaries and related costs in the second quarter of 2022 were $89.6 million, and 11% increase year-over-year from $80.9 million in Q2 of the prior year, due to more clinical FTE, a higher level of support staff in the clinics and wage inflation. PT salaries and related costs per visit during the quarter were $53.64, a 3% decrease quarter-over-quarter compared to $55.47 in the first quarter, driven by improved labor productivity and partially offset by continuing wage inflation. Comparing year-over-year, we saw an 11% increase from $48.22 in the second quarter of 2021, primarily due to increases support staff per clinician, wage inflation and lower productivity. Rent, clinic supplies, contract labor, and other in the second quarter of 2022 was $50.4 million, a 14% increase year-over-year from $44.1 million in Q2 of 2021, due to more clinics and a higher cost per clinic driven by greater contract labor usage. PT rent and other cost per clinic during the quarter was $53,000 sequentially decreasing 3% from $54,000 in the first quarter of 2021, primarily due to seasonal spend related to clinic events and increasing 11% year-over-year from $48,000 driven by greater use of contract labor given the continuing tight labor market relative to 2021. SG&A during the quarter was $31.8 million, a 21% increase year-over-year from $26.4 million in Q2 of 2021, primarily due to higher public company operating costs, non-ordinary legal and regulatory costs and a contingency recorded related to a profitable settlement arising from a payor dispute on historical claims. Excluding these non-cash charges, the remaining $21.1 million increase in operating loss was primarily due to continuing tight labor market resulting in wage inflation of greater use of contractors and higher SG&A expenses as previously discussed. Your line is now open. Your line is now open. Your line is now open. Your line is now open. Your line is now open."
}