{
    "symbol": "ICL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 12:09:02",
    "content": " Our policy to return to our shareholders up to 50% of annual adjusted net income, resulted in a dividend of $29.18 per share, up more than 450% versus $5.26 in the second quarter of last year. In the quarter both potash and metal magnesium prices were higher and our average potash realized price per ton came in at $750, which was up $469 year-over-year and up $149 from the first quarter of this year. Turning to Slide 8 and our Phosphate Solutions division, where record sales of $915 million were up nearly 60% year-over-year, while EBITDA of $315 million was up more than 130%. Turning to Slide 9 and Innovative Ag Solutions, where positive fertilizer momentum continue as we expanded on our strategic execution and delivered all-time record sales of $700 million up 110% and EBITDA of $155 million was also an all-time quarterly record and up 356%. Second quarter adjusted operating income of $1,139 million was up more than 380% and adjusted operating margin of 39.5% was up dramatically from 14.6% in the second quarter of last year. For phosphate solutions even as prices for phosphate commodity soared, we maintained our long-term strategic focus on specialty sales, which represented 54% of total phosphate sales in the second quarter. For the second quarter of last year, our tax expense was $64 million and reflected an effective tax rate of 30%. And second, remember that once the war started, there was a rush to stock and to make sure that supply was -- would be available, so distributors stocked up and Brazil that takes about 12 million tons a year took 7 million tons in the first half of the year. So there is still no need for immediate supply in June or July, but at the same time, Brazil is going to be taking 12 million tons because the potash is needed for the soil, they can't skip a year which is different than different soil types and in Europe, for example, where we see about 20% demand destruction in Europe, so those 5 million tons are going to be acquired. We sold almost 750,000 tons versus 400,000 tons last year, so it means that about 80% of our allocation to Brazil were sold in the first half, because we were opportunistic that prices were higher and we did what we do in competition. So potash prices in the second half lower than in the first half, but in addition to that fourth quarter will be softer in Industrial Products and phosphate in our Phosphate division and that's not an unusual thing and it was factored into our original forecast, hope that helps."
}