{
    "symbol": "ICL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 14:51:02",
    "content": " In addition, weâ\u0080\u0099ve had record year-to-date operating cash flow totaling $1.6 billion and our focus on long term cash generation resulted in very strong quarterly free cash flow of $429 million, which was up nearly 200%. Record third quarter sales were $437 million and up 13%, while record third quarter EBITDA of $170 million was up 40% year-over-year. While bromine prices in China declined from the peaks we saw at the end of last year and the higher prices we saw in the first half of this year, third quarter prices were relatively in line with the third quarter of last year and have risen somewhat in recent weeks. Turning to Slide 7 and our potash business, where sales of $854 million were up more than 100% year-over-year, EBITDA of $537 million was up nearly 350%, and EBITDA margin of 63% was up significantly over the 30% margin we reported in the third quarter of last year. As I just mentioned, our operations in the Dead Sea delivered record production for both the third quarter and the first nine months of the year, and as expected our average potash price in the third quarter moderated from the second quarter; however, average potash realized price per ton came in at $652 or nearly $700 CIF, which was up $335 year-over-year. Turning to Slide 8 and our phosphate solutions division, where third quarter sales of $766 million were up nearly 30% year-over-year while EBITDA of $239 million was up 70%. Overall, significant EBITDA margin expansion was achieved, improving to 31% from 24% in the third quarter of last year as phosphates specialty margin increased from 15% to 24%. Growing solutions delivered a record third quarter with sales of $629 million, up 25% over the prior year, and EBITDA of $127 million, which was up 90%. Our turf and ornamental results were slightly ahead of last year with both businesses showing positive improvement in most regions, and like all our growing solutions, this business had to contend with both higher costs and lower availability of raw materials in the quarter; however, we have been able to offset these increases across growing solutions with premium pricing. First quarter adjusted operating income of $928 million was up nearly 200%, and adjusted operating margin of 36.8% was up dramatically from 17.6% in the third quarter of last year. Turning to Slide 19, higher prices also made a significant contribution to adjusted EBITDA, and once again on a segment basis, all four of our businesses contributed to the year-over-year improvement with significant margin expansion and cash generation across the board. One is around bromine compounds, where first of all our view of the world is value over volume; and second, weâ\u0080\u0099re in annual contracts where when there is significant over-demand in the first parts of the year, then there is less quantities left for the back side of the year, and also seasonally fourth quarter--third quarter and fourth quarter are weaker with fourth quarter expected to be less than third quarter, but itâ\u0080\u0099s a perfectly normal cycle - again, value over volume."
}