{
    "symbol": "FL",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-22 09:00:03",
    "content": " So as we walk through our Lace Up Plan today, you will see how our key actions from a relaunch of the Foot Locker brand to new store concepts, to exciting brand partnerships, to relaunch of our loyalty will all work together to drive even more loyalty and growth with these key segments. In addition to more consumers and more brands driving the future of sneaker culture, there are also more shopping occasions that are providing Foot Locker opportunity to expand our reach and increase wallet share from our existing customers. The core tenets of this experience will be the following: clear sneaker leadership demonstrated through our brand selection, expanded assortments and crisp storytelling; dedicated men's and women's and kids spaces so that we are more inclusive of all sneaker shoppers and can provide exceptional choice in merchandising variety; a digitally connected retail environment with stripers who can access a seamless omni-channel experience, including access to inventory across our entire store fleet; and finally, deliberate design choices that optimize our front of house sales productivity while also maximizing our back-of-house operational productivity. Our brand awareness of 74%, while strong, is still below that of Foot Locker's 90%, demonstrating that we still have consumers who aren't thinking of KFL as their first sneaker destination. The way we'll do this is 3 key strategies: First, we'll be scaling new concepts with bigger footprints to offer more engaging experiences with a broader product assortment; second, we'll be strengthening our portfolio off-mall, while also optimizing risk and rationalizing underperforming stores; and third, we will optimize our international portfolio with key focus on European markets and transitioning Asia to a licensed model. But we think that all -- we know that all the things we outlined today, which relates to how we think about relaunching our brands, our brand access, our tools to create our own demand around loyalty, better e-commerce, CRM capabilities, all add -- and really optimizing where we place those resources, right, thinking about the best growth banners and putting our resources there drive that growth that we're talking about. And I think when we -- as we develop our footwear business to be more brands across more categories, we have a lot of opportunity in apparel through private label to really address those opportunities, whether it's from a performance or a lifestyle perspective because, certainly, the broader footwear reach creates a lot broader apparel opportunity, and we're going to focus most of that broader payroll opportunity through our private label area. So the entire plan that we're working on is really focused around how do you broaden and appeal to more people for more occasions, whether it's in the Foot Locker banner, specifically where I think is our broadest opportunity as well as how we do that through WSS and atmos separately. Well, one of the ways to think about this is minting new customers into the category, which I think actually Foot Locker has a pretty unique role in introducing whether it's through Kids Foot Locker graduating into Foot Locker or just as we bring a lot more attention to sneaker culture through the relaunch of the Foot Locker brand."
}