{
    "symbol": "FL",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-19 13:19:02",
    "content": "  Operator: Good morning, everyone, and welcome to Foot Locker's Second Quarter 2022 Financial Results Conference Call. Management undertakes no obligation to update these forward-looking statements, which are based on many assumptions and factors, including the impact of COVID-19, effects of currency fluctuations, customer preferences, economic and market conditions worldwide and other risks and uncertainties described more fully in the company's press releases and reports filed with the SEC, including the most recently filed Form 10-K or Form 10-Q. Welcome, everyone, to Foot Locker, Inc.'s second quarter earnings call. To remind everyone, last quarter, we updated our definition of non-GAAP earnings to exclude all minority investment gains and losses, and our second quarter and year-to-date non-GAAP results for 2021 have been recapped to reflect that. Today, we'll begin our prepared remarks with Dick Johnson, Chairman and Chief Executive Officer; Frank Bracken, Executive Vice President and Chief Operating Officer, will provide more color on our operations and some of our strategic initiatives. Andrew Page, Executive Vice President and Chief Financial Officer, will then review our quarterly results and financial position in more detail and provide color on our updated 2022 guidance. Before we dive into the discussion of our second quarter results, I would like to speak briefly about the other news we announced this morning: My planned retirement and the appointment of Mary Dillon as Foot Lockerâ\u0080\u0099s next CEO. We have made significant progress against our strategic objectives in recent years, which has allowed us to broaden our customer base, while deepening our connection to the sport and sneaker communities. With the ongoing momentum we have built in our business, the Board and I believe now is the right time to complete the CEO transition. She has established a remarkable track record over a career spanning more than three decades that has included leadership roles at companies including Ulta, McDonald's and PepsiCo. I'll be staying with the company through January 31, 2023 as Executive Chair of the Board and then as a senior adviser until early April of next year. In connection with the leadership transition, the Board will be separating the Chair and CEO roles and our current Lead Independent Director, Dona Young, will serve as non-executive Chair effective February 1 next year. I've had the privilege of spending the largest part of my career, the last 30 years as part of the Foot Locker family in nearly eight rewarding years as CEO. It has been an honor to lead this remarkable team and be part of building Foot Locker into the global leader it is today, sitting right at the heart of sport and sneaker communities. Over the years, we have turned a brick-and-mortar company into a broad house of brands with an increasingly engaged and interactive online retail community. We have a tremendous foundation, and I'm excited to see Mary take the business to its next level. The consumer is undoubtedly under pressure, especially at the lower end income range, which we began to see in our business as we progress through the quarter. Despite those headwinds, our team's hard work and dedication drove very strong results with total sales down 9.2% versus the record year last year, but up 16.4% versus 2019. To remind you, our strategic direction of expanding our customer base through our diversified product offering is supported by three key pillars. First, consumers want choice and they value a multi-brand experience. And third, we have superior brand equity in the marketplace that we are leveraging to capture new customers across our portfolio of banners. Our second quarter results continue to validate those three pillars and demonstrate that our increasing ability to grow our customer base by bringing the consumer a broader and richer product offering across our brands, categories and channels is yielding positive results. While our overall comps were down 10.3%, our non-Nike sales in our core banners were actually up high single digits, with many of our top 20 vendors posting strong gains. For example, we continue to see outsized gains in brands like Converse and Vans which were both up over 20%. And New Balance at Crocs, which were both up over 50% this quarter, with Crocs continuing to benefit from successful projects like Crocs and SZA and the Crocs General Mills collection. Also, our partnership with Puma, including exclusive access to LaMelo Ball products continues to drive new heat to the basketball category with the MB.01 remaining one of our best-selling shoes. Part of that strength is coming from our control brands, which grew over 40% as we fill in gaps in the branded assortment, to round out our offering to consumers with unique products, including our partnerships with Don C and Melody Ehsani. Given our strong heritage brand equity and our knowledgeable sales force, we operate as a validator of trends and brands in the sneaker community, which is an important part of our value proposition to both consumers and to brands. One great example of that is the performance running footwear category, where we are working with some of the fastest-growing brands to help them connect with a younger consumer, while also helping us extend our consumer reach. As we announced last quarter, this summer, we began rolling out HOKA to select stores and online at footlocker.com, and we are extremely pleased with the reception so far in the early days. Our elevated partnership with adidas is still in the early days, but it is off to a great start with the brand being given stronger positioning in most of the fleet, enhanced presentation starting to be rolled out and more collaborative marketing plans being developed. The work on our global partnership continues, and we remain optimistic about where the enhanced relationship will take us. As we develop new partnerships and add more choice and excitement to our portfolio, we are confident in our ability to both deepen our relationships with existing customers and grow our customer base. After a strong start in May, we saw trends slow in June, which continued through mid-July. As trends soften, the promotional environment has become more intense, especially in apparel but also in footwear. In the back half of July, trends started to pick up meaningfully, especially in our earliest back-to-school markets. So as we look to the third quarter, we are excited about back-to-school and the strong start so far as well as the energy we are bringing to the market this fall and holiday seasons with upcoming releases like the LaMelo Ball's MB.02, the Trae Young 2 as well as new introductions from New Balance and key launches from Jordan and YEEZY. Our view is that the back-to-school season will be strong, but we do see increased uncertainty from them until the holiday season begins given the more challenging macroeconomic environment. In our broad offering across price points, including the value that WSS provides, gives our customers more options to engage with us, depending on their spending power. Also, we believe the growing emphasis on fitness and self-care will continue to drive demand for workout care, including sneakers and activewear. We have a number of strategic assets at our disposal, including strong vendor relationships, which we can use to manage our order flow and a flexible real estate portfolio to allow us to adjust our banner fleet. Finally, I want to update you on some of our ESG efforts, ahead of the release of our fiscal year 2021 impact report next week. Earlier this year, we made our strongest environmental pledge to date by issuing a net zero greenhouse gas emissions ambition by 2050 or sooner in alignment with climate scientists recommendations. We have also recently passed the second anniversary of our lead commitment to support the Black community, including a pledge to invest $200 million over five years. So far through this effort, we have invested over $50 million to support Black-owned brands and creators, venture capital firms and efforts to create pathways for over 70 persons of color to work in our corporate offices through an internship program. It is embedded in how we strive towards positive outcomes for our team members the communities we serve, our customers, suppliers, shareholders and the planet, and I'm especially proud of our accomplishments in these areas. With our strategies working in a category that remains vibrant, we couldn't be more excited about the direction and potential of our business going forward. Now I'll pass the call over to Frank to discuss our banners growth, recent changes to our portfolio, our loyalty program and our omnichannel evolution. Starting with our off-mall pivot and banner portfolio, we remain confident in our strategies as we deliver additional proof points across our community and Power doors, test new large-format consumer experiences, grow our WSS and Atmos banners and expand internationally. In the second quarter, we opened or converted 25 new Foot Locker community and Power stores giving us nearly 100 doors in these formats on the way towards our goal of 300 globally by 2024. This global strategy manifested locally in the second quarter including new store openings in Washington, D.C., Houston, Paris, Berlin, Florence and Melbourne. Our ability to connect and serve consumers in a hyper localized way through these stores is giving us a unique competitive advantage in the marketplace, a strategy that both consumers and our vendor partners are giving us credit for. Our community and Power stores continue to deliver sales above their plan and to outcome their regional benchmarks in the fleet, giving us ongoing conviction in our rollout of the formats. The consumer reception so far has been very strong, with both conversion and average ticket well above the company average and increasing sales momentum within our performance-based assortment, led by performance running, performance basketball and cleated footwear. We are also seeing promising results from our Kids Foot Locker community store concept, which we call House of Play. This test store in an underserved neighborhood in the Miami market is a large-format elevated experience which enables us to expand our assortment, provide community connectivity to kids and their parents, and test new ideas and brands. The traffic, conversion rate and customer satisfaction at this concept store put it amongst the top doors in our entire fleet. We have also been able to test new brands like Steve Madden, which led to a larger store rollout in Q3 for back-to-school. And the larger format allows us to test additional size and apparel categories, such as our baby assortment, which again tested well and led to a larger store program. Combined with our strong community activation and engagement, we look forward to opening two more House of Play doors in time for the holiday season in the Baltimore community, as well as our first on-mall test store in Miami. First, we announced the sale of our Eastbay Team Sales business, historically approximately 1% of our annual sales, which will enable our enterprise to be more efficient in capital and resource allocation in service of our consumer-led strategies. Second, we confirm that we will be fully consolidating our Eastbay consumer e-commerce business into Champ Sports as one banner, completing the integration of those two banners that began in 2019. The full integration of the Eastbay retail business into our Champs Sports banner will allow us to more effectively serve the modern athlete, being more efficient with marketing spend and our operating model. WSS, our large format off-mall value banner focused on Hispanic communities, continues to perform above our original plans. WSS has opened nine new stores this year, including two openings in the first week of the third quarter. We are well on track to have approximately 120 stores open by the end of this year, and 200 stores opened by 2024 as we deliver against our $1 billion sales target. In Q2, we also opened our second distribution center dedicated to replenishing WSS stores in Texas and to support future expansion Eastward. And in the third quarter, we will open our first WSS stores on the East Coast as we look to serve and connect with the diverse Hispanic communities of South Florida. A steady calendar of collaborations and consumer engagement drove even deeper connections with consumers, including our first NFT launch in partnership with Karafuru and HYPEBEAST as well as exclusive access and pop-up retail with our partners at New Balance. And finally, we opened the first atmos paint women's concept shop outside of Japan, in Jakarta, Indonesia. This month, we expanded our licensing partnership with MAP Active, which successfully operates our stores in Indonesia. In the first week of the third quarter, we completed the global rollout of our new Foot Locker e-commerce platform with the successful implementation in Singapore and Malaysia. Meanwhile, our FLX membership program continues to help us better know and serve consumers. FLX serves as a platform to capture consumers' data and better understand their wants and needs, enabling greater personalization. We are now capturing over 70% of sales through our members in the U.S., up from 50% just two years ago. In addition to personalization benefits, FLX also acts to incentivize our best consumers to stay engaged with our banners and shop more with us as our members continue to spend 10% more than non-members. Lastly, we also continued to roll out our drop ship program across vendors and regions to give our consumers a seamless extension of choice and to allow us to test new products and categories. Starting this fall, our customers will be able to shop a much more extensive selection online for their favorite fan gear across major sports leagues and teams at footlocker.com, kidsfootlocker.com and champsports.com in the U.S. The partnership and assortment will grow through the fall season as we add more leagues, more teams and more athletes heading into the important holiday shopping season. And as customers build their show of pride outfits, they will also be able to find a new pair of sneakers and other activewear to complete the look. So in summary, we are making meaningful progress across all of our banners and regions to better know and serve consumers through choice, convenience and community. When we reported our first quarter on May 20, our recent sales trends were at the high end of our expectations within the context of still lapping stimulus. But into June, we saw a slowdown versus our expectations in traffic amidst the rapid uptick in inflation, especially in the U.S. Although more dramatic in our lower income customer base, the softening was across the board. While the back-to-school trends are very encouraging, given the uncertainty in the macroeconomic environment, we are still tempering our expectations for the balance of the year. Our second quarter total sales decreased 9.2% compared to the record levels achieved last year, but were up 16.4% compared to 2019. On a comparable basis, sales declined 10.3%, though non-Nike sales in our core business grew high single digits as we remain on strategy with rebalancing our product assortment. For the quarter, our global fleet was open 99% of available days versus approximately 90% last year. When comparing to 2019, while our brick-and-mortar traffic is down, our conversion is actually still meaningfully higher, showing a high level of intent from our customers when they visit our stores and the strong execution by our merchandising and in-store teams. Our digital penetration was 16.9% in the second quarter this year, down from 20.1% last year, but above the 14.3% from 2019. North America comps overall were down 16.1% given last year, we're still benefiting from heavy fiscal stimulus in the U.S. Overall comps in EMEA grew 4.5%, with strength across markets, particularly in France, where our investments in elevated real estate and local marketing drove double-digit growth. In APAC, comps were up 17.7%, with strong performance in both Pacific and Asia regions as we lapped some store closures in Australia and parts of Asia benefited from reduced travel restrictions. WSS, which contributed $137 million in sales for the quarter, comped down low single digits, well ahead of our other U.S. banners despite fiscal stimulus having a meaningful impact on that business and being the most exposed to recent low-income consumer weakness. atmos, which contributed $48 million to sales, grew low double digits versus their results last year, continuing its strong trends. Merchandise margins fell by 260 basis points driven by higher markdowns of the promotional environment quickly picked up to more normalized levels in the quarter, higher supply chain costs and the addition of WSS and atmos. As a reminder, WSS and atmos carry a somewhat lower merchandise margin though lower occupancy makes them overall gross margin-neutral. At quarter end, our inventories were 52% above last year and up 34% compared to 2019 as flow of products has improved and previously delayed products came in. For the second quarter, our SG&A rate came in at 21.9% representing deleverage of approximately 210 basis points driven by labor wage inflation, which continues to pressure our cost base more than anticipated. Depreciation expense was $51 million versus $48 million last year, driven mainly by the inclusion of WSS and atmos. And our non-GAAP tax rate came in at 30.0%, above last year's rate of 27.4%, driven by the geographic mix of our income. During the quarter, we repurchased 1.4 million shares of our common stock for $40 million and paid $38 million in dividends. We are pleased with our solid performance in Q2, especially against last year's record performance. We are front-footed in running our strategy, which includes diversifying our assortment, our real estate and our omnichannel offering as we successfully expand our customer base. We spaced and navigated a number of headwinds that were not contemplated in our guidance that we provided in May, most notably the rapid uptick in inflation, which has more quickly forced our customers to make difficult spending decisions. Based upon our current visibility, we expect these macro headwinds to put pressure on consumer spending through the back half of the year. Foreign exchange rates have become less favorable and we sold our Team Sales business which, while only approximately 1% annually, does impact our total sales range for the back half. We still expect to see comps down 8% to 9% for the year, which embeds the better second quarter performance, offset by a softer-than-expected back half which we now assume will be down approximately 10% to 12% with Q4 still expected to be the toughest comp. Our total sales range for the year, however, does come down given less favorable foreign exchange rates and the divestiture of our same-sales business. We plan to open approximately 100 new doors in 2022, including 40 community and Power stores while closing a total of 190 stores. WSS and atmos have experienced some construction timing delays, and we now see 20 new WSS stores and two new atmos stores down slightly from our original expectations for the year, though having no impact on our long-term view of the banners. Overall, our store count will be down approximately 3% in 2022, with square footage down less than 2%. On gross margin, we are adjusting our outlook to account for better occupancy trends as our occupancy mix of stores in the portfolio has developed better than we expected; somewhat better supply chain costs for the balance of the year, which are partially offset by the pickup in the promotional environment. We feel good about our inventory in terms of quality and newness and think it puts us in position for a strong back-to-school season, but we do have to compete in the more promotional environment. As a result, we are now estimating a 320 basis point to 330 basis point decline in overall gross margin for the year, better than our prior range of down 360 basis points to 380 basis points. Note, we expect inventory growth to slow from here but remain up at the end of the year as we diversify our assortment. As a result, we now see our expense rate in the range of up 60 basis points to 70 basis points compared to 2021, up from the prior range of flat to up 20 basis points. We, therefore, expect our non-GAAP EPS in 2022 to come in at the lower end of our original earnings guidance or a more explicit range of $4.25 to $4.45, which reflects that we expect the back half to be more challenged than we originally anticipated at the beginning of the year. Our balance sheet remains a strategic asset for our business, with nearly $400 million in cash and $600 million undrawn on our credit facility and strong coverage and leverage metrics. Our CapEx plan for 2022 remains unchanged at $275 million to be used towards new store openings and ongoing technology and omnichannel investments, which include the new distribution facilities outwear opening in Reno, Nevada to serve the core business and the WSS facility we just opened in Houston. Before I close out our prepared remarks, let me say on behalf of the entire Foot Locker family, Dick, thank you for your caring leadership, friendship and long-lasting impacts you have made on this organization. And as we look at where we are from the company, the strong momentum that we've got, the foundation that's been built, the transformation that the team is leading and ultimately, the strength of the team, we decided that now is the right time to make this transition. And Mary is a person that I've known through my association with and has value similar to our core values and the company continues to be focused on retail, which is so important and understands off-mall retail. But ultimately, I think that she's a great leader and will be a strong asset to the company. I'm going to be around and help with that transition, and it's the right time. I know this has been a topic now for several calls, but just based on what you've seen over the last few months and now with back-to-school, maybe trending a little bit better, but still tempering your outlook. Well, there's a lot of external pressures. The traffic is up because people are sending their kids back to school and people are going back to school with new sneakers, new backpacks, new shorts, new T-shirts, new fleece. The caution, and I think Andrew talked about and I talked about it and I think Frank did as well, that it's really those times when there's not a superior call to action for the consumer that we worry a little bit about the duress that they're under economically. But given our assortment, given our connectivity with the consumer, given the engagement in the communities, we think that we win in these times when the consumers are out and shopping. So the timing just ends up and sort of came through the supply chain in lumps this spring and the inventory is up, but we feel really good about it in terms of it being good quality product from rig vendor partners and the consumer certainly having an appetite for it. I think we're back near the 2019 levels, but my hope -- and again, there's not a lot of science behind it because everybody has different situations with their inventory levels. But again, I think the inventory is rationalized, it's marked down cadence a little bit. I think, Dick, spot on with regard to what we're seeing in the promotional environment, definitely came into the year anticipating that the promotional environment would pick up and really had a belief that it would pick up and not be on par where it was in 2019. But really, we're seeing the promotional environment really be fairly in line with where it was in 2019. And as a result of that, I mean, we definitely thank the opportunities from a more favorable-than-expected promotional environment in the front half of the year and reflected in our updated guidance, what we anticipate to be a more promotional environment in the back half of the year. But to Dick's point, we're hoping and anticipating this. We've created some great stories around footwear and apparel connectivity, which has allowed that apparel. So our inventory in footwear, in the growth, we're about equal in footwear and apparel, but our commitment on the apparel front continues to be that we're going to grow that as a percentage of our business. I think it's a reflection of a very deliberate strategy to grow our apparel business across all genders, men's, women's and kids. We know that when consumers have a multiunit basket, that over 40% of those trips have multiple brands as well. And first question, as it relates to the non-Nike sales momentum that you've seen, you called out some really robust momentum, it sounds like in performance running. Our work with New Balance, our work with Puma, the accessibility that we've got and the exclusivity that we've got with the LaMelo Ball product has been significant. I called out HOKA and On in the running category, really trying to -- they're trying to connect with the younger consumer. At the same time, we're broadening that assortment and bringing new product to our existing customers. And as we continue to grow our adidas relationship, we're seeing good movement on the adidas side as well. So again, truly, as we become more of a house of brands, we continue to see strong performance from Nike, certainly, but we continue to grow other brands faster. When you think about WSS and the workwear occasion, a great momentum around workwear, Eurostar, which is our private label boot, Caterpillar and Carhartt, also great brands that are growing rapidly. And then we mentioned Homefield, which is our expression to serve the modern athlete in champssports.com, great momentum in cleated footwear across multiple brands. And then just as a follow-up, on the gross margin guide, it sounds like you're taking the gross margin guide up a little bit but revising the earnings guide down. So within the gross margin line and with the expectation that the promotional environment is likely to get a little bit worse, maybe just walk us through a little bit of the puts and takes within that line that drive your increased confidence in why gross margin should be higher from where you initially expected it to be. I mean, if you look at the gross margin line, I mean, we are anticipating and feeling from the merch side, about 60 bps of improvement from a supply chain perspective. And as you think about the stores that we've added online and the stores that we've taken offline, we ended up having a better occupancy leverage in that change in mix of our stores. Curious if there have been any changes or further developments on the timing of the lower Nike allocation, just what that looks like for the back half of the year. Well, again, the supply chain is, I think Andrew called out in our prepared remarks, got better during the quarter but it still was not as predictable as it was prior to some of the problems that we faced in '20 and '21. And obviously, the consumer voted in the quarter pretty positively when they were out shopping for back-to-school. I mean we saw really nice traffic patterns changed in many of the tourist cities, but as Andrew talked about, even in the non-tourist cities, we saw growth in traffic, which, again, the 99% open days this year versus 90 last year, a lot of those closures from a year ago were in Europe. And clearly, there's inflation in EMEA as well, but the consumer is out, they're shopping. They're clearly more about the running silhouette and the indoor soccer silhouettes that have always been important in Europe, a little less on the performance basketball. But as you look at even at the market level, a couple of dozen markets were up double digits across the quarter. The only softness was in the UK, it's well documented, the sort of inflation and the pound there and some of the struggles with the consumer base there. And a lot of the investments we've made in real estate, I mentioned a few, Paris, Berlin, Florence across some of our key cities are paying real dividends, elevating the experience, driving traffic and also providing a better conversion opportunity for our consumers. I guess my first question is actually something that's probably smaller kind of, I think, in the long-term strategic plan. So as it relates to NFTs, certainly, one of the big impetus of our atmos acquisition was the ability to be able to test and lean into that faster consumer. And if you think about the home market of Japan, South Korea, where the brand is also very strong. And so it was natural to test NFTs in those markets for us through the atmos brand, had very good results. But we really look at it as a learning opportunity and something, as we think about future capabilities, as you cited, something we're going to continue to test and innovate and learn. I think there's many, many opportunities to bundle NFTs with actual physical products, and that's part of the journey there. And so we're very pleased with the initial results, more importantly, capability and the ability to test and innovate into the future. With regards to inventory, as we talked about in our prepared remarks, inventory is up about 52% compared to the prior year and up in the mid-30s compared to 2019. We -- as a matter of ability to pull levers, over the last two years, especially during COVID, a lot of the opportunities to pull different levers were not available. Right now as we look at our inventory, again, we feel really good about the freshness of it. And to the extent that as we lean into leverage, the ability to take advantage of vendor allowances, the ability to take advantage of cancellations, the ability to take advantage of returns, those things have -- those opportunities have come back into play as we now start to exit the supply constraints that many retailers were experiencing on the pandemic. And certainly, as we think about the digital opportunity as we think about the things that Mary accomplished with Ulta, her understanding of off-mall retailing and big-box retailing, all things that we're moving towards she became a logical choice, and I think a great choice to take the leadership over at the company and move us into the next chapter in the next phase. As I talked about, strategically, she understands where we're going, certainly, she'll come in and take a look at the work we've got in progress. But she's such a quality leader, a quality person that I think that I'm very confident about the timing of this and the candidates that we've selected. They provide great storytelling, great opportunity to introduce innovation, which is something very important to our vendors as well as to consumers. So while the stores themselves not only are outperforming our expectations and outperforming their regional comps, they also create an omni effect, which is really, really important as you think about return on investment for us. So we're very happy with the different expressions across Homefield, across House of Play, in our Foot Locker community stores, which is a global strategy."
}