{
    "symbol": "EB",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-28 23:37:07",
    "content": " We sold nearly $3.3 billion in  gross ticket sales; we grew revenue by 39%; we launched our first ad product for creators; and through our demand generation efforts, we helped creators generates over $680 million in ticket sales. To boost demand generation, we're improving the consumer experience, adding Apple Pay and Express Checkout added nearly $17 million in extra gross ticket sales for creators in 2022. And with a small, but growing contribution of incremental revenue from subscriptions and advertising, our revenue take rate increased by another 0.25 point year-to-year and revenue per ticket rose 6% versus last year's fourth quarter. So, Eventbrite-driven gross ticket sales was nearly $700 million in the year and the Q4 run rate is closing in on $1 billion and we help really source nearly a third of paid ticket for creators already. But I know what I mean, we had great success in the holidays around the holiday events and New Year's Eve events and really kind of tailoring advertising enabled experiences that creators could use to get consumers looking for those kind of events. So, I think we're looking for a bit of a rebound in growth domestically But we've -- in the last 90 days, we've seen, like you said, really strong growth overseas in particular, even beyond our top five or six markets coming out in the rest of the world, craters knocking on the door, consumers are coming to a bench for ticket sales. And Justin on the profitability target, we expect to be at that 20% or better before the end of next year and factors that would make it be earlier in the year would be faster, stronger, more successful transition to marketplace, more of the high margin subscription and advertising revenue, strong uptake and no resistance on the pricing actions that we've had and continued good economic conditions. We did some tests during the holidays when we spent about $80,000 on consumer marketing and we drove 20% growth in holiday related revenue, which I think is a testament to some of the ways in which we can help induce that demand generation, while not having to really hike the investment there."
}