{
    "symbol": "YEXT",
    "quarter": 1,
    "year": 2023,
    "date": "2022-06-08 22:46:04",
    "content": " ARR growth in the direct business reflects product adoption and indicates that we are landing new customers and renewing and upselling existing customers, a good indication that our customers value our product and that our value proposition is intact in spite of challenging execution over the last few quarters in our go-to-market. Further, customers with ARR over $100,000, was 613 at the end of Q1, up 8% year-over-year and also excludes small business customers and third-party resellers. And that's -- I think that's a challenge because when people move around inside the customers, we often have to restart initiatives and retrain adoption and things like that, that are really important from a client success standpoint. It's also a big part of our decision to seek a Global Chief Revenue Officer who would be focused across not just the sales organization, but the customer success organization in order to make sure that we're building upon our efforts to better operationalize the entire go-to-market machine. Now in years past, there wasn't a clear set of metrics for us to operate against, and what we spent the last quarter on is really metering much of that product experience, much of that consumer experience, all driving towards eventually being able to -- hopefully in this next quarter, being able to at least measure adoption across a very, very large customer base that we have. For higher -- for larger customers, ones specifically in the enterprise, the upper enterprise, then also having a customer success, folks who are going in and sort of taking the self-serve information and really helping those larger customers implement it themselves or make sure that they are implementing it, that's a really big piece of it. The other thing I mentioned, and I'll say it again because I think it's really important is that sometimes -- especially for a multiproduct platform company like we are, sometimes you have to do things for clients that may not be in -- have the best impact from a very near-term revenue standpoint, but they create the fertile ground for the bigger opportunity."
}