{
    "symbol": "RKT",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 19:52:05",
    "content": " We have invested in the pillars of our platform for decades with more than $7 billion invested in our trusted brand, leveraging important performance marketing insights strengthened by more than 200 million client records in our vast data lake, investing heavily in cutting-edge technology, attracting the best talent in the industry and growing our premier enterprise partnerships. During the first 3 months of 2022, the value of our mortgage servicing rights increased by $1 billion or 19% compared to Q4 including newly-created MSRs and the mark-to-market adjustment to $6.4 billion. While the mark-to-market change in MSR portfolio value is excluded from our adjusted net income metrics, it's worth noting that the positive market adjustment on the portfolio was $739 million in the first quarter, which is countercyclical in a rising rate environment. And that's the first step in the process is that you've got to see that capacity that was built up to handle $4.5 trillion come out to more of a $2 trillion, $2.5 trillion market, which is I think where we think we're going to be at. So this is why we're seeing our second quarter expenses coming down roughly $200 million from $1.6 billion in the first quarter to about $1.4 billion in the second quarter, excluding the onetime charge of the $50 million to $60 million related to our voluntary career transition program. And if you annualize that run rate, if you think about $200 million coming out from Q1 to Q2, another $20 million coming out in the third quarter when we fully implement all the savings from the transition program, it's about $880 million of annualized expenses that we're going to be taking out here. And that actually is an interesting opportunity perhaps because as we think about and generally spend a lot of time thinking about or talking about the management of this business, when she referenced on an annualized rate, $800 million or $880 million of cost savings that we've now taken action on."
}