{
    "symbol": "RKT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 23:27:04",
    "content": " So this rewards program allows our clients, and we saw that in the first few hours â\u0080\u0093 or I should say, days of the program, 70 million points distributed, 17,000 actions taken, that starts to prove out what we've heard from our client base that a program like this that allows them to participate, engage, drive down cost, and we'll continue to expand the program and the value it has to our platform, that's a critical piece of the puzzle that we've been building. So if you think about and one of the driving forces for this platform tech build that we've been doing for years now is to think, well, how can we have 5 million clients in our database, how can we have 7 million clients in our database, how can we engage those 24 million people that have already created a Rocket account, so as we see rates shift and adjust, if there's an opportunity to help folks, we're not marketing to a $2.5 million client base, we're marketing to a $10 million client base, and that's the vision of what we're creating. So we're watching the growth of this each and every day, clients in, engaging, reading, giving us data, and all of that is what we will use to determine â\u0080\u0093 and Brian touched on this â\u0080\u0093 are the investments, are the marketing dollars leading to the engagement that we know in the future will lead to loan origination because when that turns, the profitability we receive is order of magnitude greater than what we might invest today that will not be highly profitable right now because we're focused on what it will be in the future. We'll roll out additional technology products here in the coming quarters that allow those clients to be engaged, have them join rewards, and drive down their closing costs, all while participating more and learning more about Rocket, it gives us a strategic advantage to win those purchase clients and have confidence that our marketing dollars today will pay off in the future, meaning we can continue to spend them. And the only other thing I'll add is translating that directly to loan volume â\u0080\u0093 to go out and acquire a loan today, especially if you're basically buying the loan, if you don't have any brand, if you don't have any follow-up mechanisms, if you don't have any engagement, you're going to buy the loan, put it on your platform, you've got to think about it as that one-time value. That's how we're talking about the 24 million Rocket account users that we've got and this robust content rewards program that we're going to engage them with because when you have confidence, kind of like an Amazon, I sign somebody up, maybe they buy a book today, but I know once I get that book, it won't be but a few months and now it will be the tie pods and it will be the dog food, and that buying continues to grow. That's how we're thinking about where we would deploy our capital, particularly to the acquisition of a client versus simply â\u0080\u0093 not that we don't think about buying â\u0080\u0093 or marketing and generating a closed loan, but we're not out just trying to buy closed loan volume or drive a closing that doesn't have any long-term value for us. So, as we do marketing, and we're bringing clients in and they're joining our rewards program, and then they're thinking about how they're going to save money in a rising rate market, they have access to all those different strategies to benefit their financial situation, not just a cash out on their first mortgage. When we think about, and this goes back to our capital allocation, when we think about all of the opportunities that we've got here on the table and our retail brand, the millions of clients that know Rocket, that have already created an accountant at Rocket, all the services top to bottom funnel that we're building out and have executed or not and now we're just kind of hemming together, for us, we balance that against buying a correspondent loan. We have the ability to say, let's understand what our retention rate will be with that client over the long term, with purchase, with refinance, with capturing real estate fees when they purchase a new home through our Rocket Homes company, with a personal loan that they may do through Rocket Loans with other additional products now that we've built out that technology to be loan agnostic and gives us the ability to add other loan programs for our client base. So we can filter that through and think about the marketing dollar we're spending today and have much greater confidence on the long-term or the lifetime value of that client, so you may see us do a loan and someone would look and say, on that particular transaction, that loan cost the company $500."
}