{
    "symbol": "UMBF",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 15:20:26",
    "content": " Net interest income increased 3.9% sequentially driven by a nearly $1 billion increase in average loans, positive asset mix and the impact of rising rates. Our Fed account, reverse repo, and cash balances further declined to $1.5 billion and now comprised as 4.3% of average earning assets with a blundered yield of 2.30% compared to 83 basis points in the second quarter. Loan yields increased 74 basis points from the second quarter to 4.46% with a cycle-to-date beta of approximately 37%, 61% or about $12.1 billion of loans are variable rate with 60% of those repricing in the next quarter and 71% repricing within the next 12 months. As we look ahead, there are a lot of variables at play thatâ\u0080\u0099ll impact the trajectory of our net interest margin, including the depth and duration of the fed tightening cycle, outlook for equity market and that impact on deposits expected this intermediation of DDA balances as ECR rates increased as well as our own need to generate deposits through targeted campaigns to fund loan growth. Total brokerage income increased $1.4 million or nearly 12% compared to the second quarter, despite market related compression of approximately 3% in the underlying money market balances. So when you think about new clients, right, so yes, right the last grade cycle we did go down to 32% composition, but this time around I think we feel like itâ\u0080\u0099ll be higher than that as the rate cycle peaks, because weâ\u0080\u0099ve been adding new clients with DDA balances as well, particularly in small business, Mariner talk about the efforts in small business and how that has driven some DDA growth. So with more than 50% of our loans repricing within 12 months, weâ\u0080\u0099ve got the repricing of the current book, the back book, and then a significant portion of our loan growth is from new customers and all of that new customer growth comes in at a higher yield to our loan asset betas were 54 on a linked quarter basis and 37 cycles a day."
}