{
    "symbol": "UMBF",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 11:19:05",
    "content": " This was driven largely by an over $1 billion increase in average loans, which is a 21% increase on an annualized basis, the impact of rising rates, positive asset mix shift and loan fees. DDA balances remained steady from the last quarter and represent 40% of average deposits, compared to 42% in the third quarter and 41% in the fourth quarter of last year. Our Fed account reverse repo and cash balances rebounded slightly to $1.8 billion and outcome price 5.1% of average earning assets with a blended yield of 3.65%, compared to 2.3% in the third quarter. Net interest margin expanded 7 basis points for the third quarter, the largest positive NIM impacts included approximately 52 basis points from loan repricing, loan fees and mix, 34 basis points for the benefit of free funds and 7 basis points from reduced liquidity balances and rate. As we look ahead, there are a lot of variables at play that will impact the trajectory of our net interest margin, including the depth and duration of Fed tightening cycle, outlook for equity markets and that impact on deposits expected disintermediation of DDA balances as ECR rates further increased and our own need to generate additional deposits through targeted campaigns to fund loan growth. Outside of these gains, we saw positive results from several businesses, including $31 million of additional brokerage fees related to higher 12b-1 and money market revenue share income, despite market related compression of 11% in the underlying money market balances, compared to year end 2021. The 2.8% linked quarter increase was primarily driven by an increase of $2.6 million in processing fees, largely software costs related to the ongoing modernization of core systems $2.1 million in additional marketing and business development expense, driven by increased advertising for various campaigns and projects and $1.8 million of increased charitable giving included in other expense."
}