{
    "symbol": "UMBF",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-30 11:47:05",
    "content": " On the other side of the balance sheet, average total deposits for the quarter decreased 3% or 12.2% on an annualized basis compared to the first quarter, while average DDA balances increased slightly and comprised 45% of average deposits. As shown on Slide 21, our Fed account, reverse repo, and cash balances declined to $3.7 billion and now comprised 10.5% of average earning assets, with a blended yield of 83 basis points compared to 30 basis points in the first quarter. Fee income compared to the first quarter was impacted by the $66.2 million gain on that sale as well as other market-related valuations, including a reduction of $10.5 million in company-owned life insurance income and a $4.9 million negative change in the security gain or loss line related to other equity positions and a $4.2 million reduction in derivative income from back to back swaps. Maybe starting off on the deposit side, just as you're thinking about funding this continued strong loan growth, clearly you have plenty of on balance sheet liquidity with a 60% loan to deposit ratio, you have $400 million of deposits coming on later this year from the ONB deal. And if you take the run-off piece on through the first half of the year here, really it comes down to about a $0.5 billion, $500 million that would be indicative of what's happened to the whole industry as opposed to the whole you're seeing because the rest of it would have been kind of that typical seasonality of our deposits. But I would say, obviously with the 25 basis points that we got in the second quarter, those are probably a little faster than probably for the industry and for us as well, but we continue to expect modest margin expansion going forward based on where we see loan pricing. And if we -- I think in prior quarters, you've talked about looking back to 2019, I think when where brokerage fees were in -- for the whole year, they were $31 million. So clearly, we see some opportunities as interest rates stay elevated, to be able to mimic the $12 million, $12.5 million run rate you saw in the second quarter."
}