{
    "symbol": "NDAQ",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-19 12:14:06",
    "content": " Nasdaq delivered strong third quarter results with $890 million in net revenues, a 6% increase compared to the prior year period and a 9% on an organic basis, excluding the impacts of the changes in FX rates in acquisitions and divestitures. Our Solutions segment delivered total revenue of $584 million during the third quarter, an 8% increase from the prior year period or 10% organically, excluding the effect of FX and an acquisition. Revenue in our market data business increased by 2% from the prior year period and 5% organically, excluding the impact of FX, primarily due to an increase in proprietary data revenues from international clients. Our Market Services segment delivered net revenues of $305 million during the third quarter, a 4% increase versus the prior year period or 8% higher organically, excluding the impact of FX. Finally, our Corporate Platforms segment delivered revenue of $168 million in the third quarter, an 8% increase from the prior year period or 11% organically, excluding the impact of FX and an acquisition. Revenues in our IR and ESG services businesses increased 13% organically, underscoring the strong demand for our technology-based and consultative solutions during the period. The 6% increase in reported net revenue of $890 million is the net result of organic growth of 9%, including a 10% organic increase in the Solutions segment, and an 8% organic increase in Market Services, partially offset by a 3% negative impact from changes in FX rates and the net impact of acquisitions and divestitures. Our market infrastructure technology business grew 6% as compared to the prior year period and 8% organically, excluding the impact of FX. The Corporate Platform segment operating margin of 44% increased 2 percentage points compared to the prior year period, driven by a combination of recent growth in the listed issuer base and lower marketing expenses due to the subdued IPO environment. I think that it's interesting because on the one hand, we are building a new custody solution from line one of code, but we are actually leveraging the -- what we're calling the marketplace services platform to support the liquidity capabilities that we're delivering on top of that custody solution. And I think that, that allows us to understand -- we brought in some talent that's what I would call digital native talent to really support building the custody solution and yet they're working with our existing Market Tech team and to make sure that we're leveraging all of the capabilities we've been building over the last five years to support the liquidity that we're putting on top of the custody solution."
}