{
    "symbol": "NDAQ",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-20 12:31:03",
    "content": " We achieved a record $893 million in net revenues, a 6% increase compared to the prior year period and 9% on an organic basis, excluding the impacts and changes in FX rates and acquisitions and divestitures. Annualized SaaS revenues totaled â\u0080\u0093 sorry, $679 million in the second quarter of 2022, growing at an even faster rate of 12%, which reflects strong demand for our anti-financial crime solutions and investment analytics offerings. Turning next to specific highlights from our business segments, our Solutions segment delivered combined total revenue of $582 million during the second quarter, a 10% increase from the prior year period or 12%, excluding the impact of FX. In our Investment Intelligence segment, we delivered $283 million in total revenue in the second quarter, an 8% overall increase from the prior year period and 10%, excluding the impact of FX with growth contributions from across the businesses during the quarter. Revenue in our market data business increased by 1% from the prior year period and 3% excluding the impact of FX, primarily due to an increase in proprietary data revenues from international clients. In our index business, we saw revenue growth of $17 million or 16% versus the prior year period, driven by positive net flows of $71 billion over the last 12 months, including $25 billion of inflows during the especially challenging beta environment experienced in the first half of 2022. Our flagship eVestment analytics offerings saw continued strong user adoption, both across our asset owners and asset managers and drove annualized SaaS revenues for the Investment Intelligence segment to increase 12% versus the prior year period to $215 million. Turning next to our Market Technology segment, we delivered $131 million in total revenues in the second quarter, a 12% increase from the prior year period. And trade management services revenues hit a new quarterly high of $87 million, up 7% versus the prior year, reflecting an increase in demand for connectivity and infrastructure services. Finally, our Corporate Platform segment delivered revenue of $168 million in the second quarter, a 13% increase from the prior year period, driven primarily by our expanded listed issuer bases across both our U.S. and Nordic listing franchises as well as growth in demand for our IR and ESG services. Revenue increased 15% to $107 million as the number of Nasdaq-listed corporate issuers, excluding SPACs, increased 9% compared to the prior year period. The 6% increase in reported net revenue of $893 million is the net result of organic growth of 9%, including a 12% organic increase in the Solutions segment, and a 4% organic increase in Market Services partially offset by the net impact of acquisitions and divestitures and a 2% negative impact from changes in FX rates. Turning to Slide 11, as Adena mentioned earlier, ARR totaled $1.97 billion, an increase of 9% from the prior year period, while annualized SaaS revenues totaled $679 million, an increase of 12%. Starting with Market Technology, revenue increased $14 million or 12% with $10 million of the increase due to the impact of the deferred revenue write-down on Verafin in the prior year period. The Corporate Platforms segment operating margin of 46% increased 4 percentage points compared to the prior year period, driven by a combination of recent growth in the listed issuer base and lower marketing expense due to the subdued IPO environment. We delivered record quarterly revenues, 12% organic revenue growth in the Solutions segment and a 54% non-GAAP operating margin, resulting in what we see as strong momentum thus far in 2022 that we can build upon moving forward. Your line is open. Your line is open. Your line is open. In terms of the bigger question that you asked regarding organic growth, I think that the first thing I would say is we really are pleased with the performance of the business, and we do have â\u0080\u0093 we provide mission-critical software and analytics solutions to corporates, to other exchanges, to banks and brokers and to investment management firms. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}