{
    "symbol": "NDAQ",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-20 11:32:05",
    "content": " We achieved a record $892 million in net revenues, a 5% increase compared to what was itself a very strong prior year period when the company previously set a quarterly record on trading revenues. Annualized SaaS revenues totaled $655 million in the first quarter of 2022, representing 34% of our total company ARR, reflecting particularly strong growth in our anti-financial crime and investment analytics businesses. Our Solutions segment businesses delivered combined total revenue of $576 million in the first quarter, a 15% increase from the prior year period, driven from several of our businesses, including our anti-financial crime offerings, our index and investment analytics offerings; the expansion of our listed issuer base as well as strong demand for our IR and ESG services. In our Investment Intelligence segment, we delivered $284 million in total net revenue in the first quarter, an 11% increase from the prior year period, with contributions across the business during the quarter. In our Index business, we saw revenue growth of $20 million or 20% versus the prior year period, driven principally by growth in ETP assets, which saw positive net flows of $75 billion over the last 12 months, including meaningful inflows during the especially volatile first quarter itself. And in our Investment Analytics business, revenues grew 13% from the prior year period driven by the sequential impact of strong sales across asset owners, asset managers and private markets throughout 2021. We delivered $124 million in total net revenues in the first quarter, a 24% increase from the prior year period. Our anti-financial crime technology business had a very strong first quarter, achieving 71% increase in revenues versus the prior year period, partially driven by the partial quarter inclusion of Verafin in the prior year period, the phasing out of revenue write-down associated with the acquisition as well as by strong organic growth with the majority of that coming from the fraud and anti-money laundering, which we call FRAML Solutions. Finally, our Corporate Platform segment delivered record net revenue of $168 million in the first quarter, a 15% increase from the prior year period, driven primarily by our continued leadership in new listings across our U.S. and European markets as well as growth in demand for our IR and ESG services. The 5% increase in reported net revenue of $892 million is the net result of organic growth of 6%, including a 13% organic increase in the Solutions segment, partially offset by a 4% organic decrease in Market Services compared to a record net revenue high in the first quarter of 2021, and the contribution from Verafin as well as impact from divestitures, partially offset by the negative impact from changes in FX rates. The increase primarily reflects a positive $18 million impact from the acquisition of Verafin, which occurred near the middle of the first quarter of 2021, and $9 million in organic revenue growth, led by our anti-financial crime technology business. We delivered record quarterly revenues, 13% organic revenue growth in the Solutions segment and a 52% non-GAAP operating margin, what we see as an incredibly strong start to 2022 that we can build upon moving forward."
}