{
    "symbol": "FEIM",
    "quarter": 2,
    "year": 2023,
    "date": "2022-12-20 21:39:04",
    "content": " One of our key customers, large government-like prime contractor has communicated that they experienced 15% growth in satellite business over the past year, anticipate sustained growth of 10% to 15% annually over the coming years, and as a result, is interested in engaging FEI and development of advanced technology appropriate for what they refer to as proliferated low earth orbit satellite systems often referred to as large systems of small satellites. Before I give you the financial report for the second quarter of fiscal â\u0080\u009823, I just wanted to give you a brief explanation relating to the delay in filing the 10-Q as well as the restated fiscal â\u0080\u009822 10-K. During the preparation of the current 10-Q for the period ending October 31, â\u0080\u009822, we realized there was a formula error in the calculation that split contract assets and contract liabilities from a net presentation to a gross presentation. It was also determined that when the fiscal year Form 10-K for the period ended April 30, â\u0080\u009822 was filed with our stated fiscal year â\u0080\u009821 contract assets and contract liabilities shown gross as opposed to net as was shown in the fiscal year â\u0080\u009821 annual report on Form 10-K, the footnote was deficient in that it did not disclose to the reader that the fiscal year â\u0080\u009821 contract assets and contract liabilities will change from net to gross. It is a GAAP requirement to disclose the change that were made with regards to the fiscal year â\u0080\u009821 presentation changes in the annual report on Form 10-K for the period ending April 30, â\u0080\u009822. For the 6 months ending October 31, â\u0080\u009822, consolidated revenue was $17.2 million compared to $25.9 million for the same period of the prior fiscal year. Revenues from non-space U.S. government and DOD customers, which are recorded in both the FEI-New York and FEI-Zyfer segments were $8 million compared to $10.6 million in the same period of the prior fiscal year and accounted for approximately 47% of consolidated revenue compared to 41% for the prior fiscal year. For the 6 months ending October 31, â\u0080\u009822, gross margin and gross margin rate decreased as compared to the same period in fiscal year â\u0080\u009822. For the 6 months ending October 31, â\u0080\u009822 and â\u0080\u009821, SG&A expenses were approximately 23% and 26% respectively of consolidated revenue. The decrease in SG&A expense for the 6 month ending October 31, â\u0080\u009822 as compared to the prior year was largely due to decrease in professional fees as well as one-time reductions to stock option expense related to forfeitures and deferred compensation expense. R&D expense for the 6 months ending October 31, â\u0080\u009822 decreased to $1.7 million from $2.7 million for the 6 months ending October 31, â\u0080\u009821, a decrease of $1 million and was approximately 10% and 11% respectively of consolidated revenue. For the 6 months ending October 31, â\u0080\u009822, the company recorded an operating loss of $5.4 million compared to an operating loss of $1.4 million in the prior year. For the 6 months ending October 31, â\u0080\u009822, the company recorded a tax provision of $2,200 compared to $2,300 for the same period of the prior fiscal year. Consolidated net loss for the 6 months ending October 31, â\u0080\u009822 was $5.4 million or $0.58 per share compared to $1.1 million net loss or $0.12 per share in the prior fiscal year. Our fully funded backlog at the end of October â\u0080\u009822 was approximately $56 million compared to approximately $40 million for the previous fiscal year end April 30, â\u0080\u009822. The companyâ\u0080\u0099s balance sheet continues to reflect a strong working capital position of approximately $28 million at October 31, â\u0080\u009822 and a current ratio of approximately 3.9:1. In fact, we â\u0080\u0093 I just notice made note of the fact that we got a little over $4 million of new business in the third quarter and a significant chunk of that is a contract, which we will utilize the results of some of that R&D to develop smaller devices."
}