{
    "symbol": "FEIM",
    "quarter": 3,
    "year": 2023,
    "date": "2023-03-10 18:16:03",
    "content": " The 3 months ended January 31, '23 consolidated revenue was $10.6 million compared to $12.2 million for the same period of the prior fiscal year. Revenues from non-space U.S. government and DOD customers, which are recorded in both the FEI-New York and FEI-Zyfer segments, were $5 million compared to $4.3 million in the same period of the prior fiscal year and accounted for approximately 47% of consolidated revenue compared to 35% for the prior fiscal year. For the 3 months ended January 31, '23, gross margin and gross margin rate increased as compared to the same period in fiscal year '22. For the 3 months ended January 31, '23 and '22, SG&A expenses were approximately 22% and 23%, respectively, of consolidated revenues. The decrease in SG&A expense for the 3 months ending January 31, '23 as compared to prior-year period was largely due to a decrease in payroll and associated costs related to the previously announced workforce reduction. R&D expense for the 3 months ended January 31, '23, decreased to approximately $780,000 from $1.1 million for the 3 months ending January 31, '22, a decrease of approximately $345,000, and were approximately 7% and 9%, respectively, of consolidated revenue. For the 3 months ending January 31, '23, the company recorded operating income of approximately $325,000 compared to an operating loss of approximately $720,000 in the prior year. For the 3 months ending January 31, '23, the company recorded a tax provision of $3,000 compared to $1,000 for the same period of the prior fiscal year. Consolidated net loss for the 3 months ending January 31, '23, was approximately $316,000 or $0.03 per share compared to an approximately $735,000 net loss or $0.08 per share in the previous fiscal year. Our fully-funded backlog at the end of January '23, was approximately $54 million compared to $40 million for the previous fiscal year ending April 30, '22. The company's balance sheet continues to reflect the strong working capital position of approximately $20 million at January 31, '23 and a current ratio of approximately 1.7:1."
}