{
    "symbol": "FEIM",
    "quarter": 1,
    "year": 2023,
    "date": "2022-09-13 18:45:01",
    "content": " For the three months ended July 31, 2022, consolidated revenue was $8.2 million compared to $13 million for the same period of the prior fiscal year. The components of revenue are as follows: Revenue from commercial and U.S. government satellite programs was approximately $3.5 million, or 42%, compared to $6.7 million, or 52%, in the same period of the prior fiscal year. Revenues from non-space U.S. government and DOD customers, which are recorded in both the FEI-New York and FEI-Zyfer segments were $4.1 million compared to $5.5 million in the same period of the prior fiscal year and accounted for approximately 50% of consolidated revenue compared to 42% for the prior fiscal year. For the three months ended July 31, 2022, gross margin and gross margin rate decreased as compared to the same period in fiscal year '22. For the three months ended July 31, '22 and '21, selling and administrative expenses were approximately 24% and 34%, respectively, of consolidated revenues. The decrease in SG&A expense for the three months ended July 31, '22, as compared to the prior year period end is largely due to decrease in professional fees as well as a reduction in stock option expense and deferred compensation expense. R&D expense for the three months ended July 31, '22, decreased to $1.1 million from $1.4 million for the three months ended July 31, a decrease of $300,000 and were approximately 14% and 10% of consolidated revenue. For the three months ended July 31, '22, the company reported an operating loss of $3.1 million compared to an operating loss of $1.7 million in the prior year. Consolidated net loss for the 3 months ended July 31, '22 was $3.1 million or $0.33 per share compared to $1.6 million net loss or $0.17 per share in the prior fiscal year. Our fully funded backlog at the end of July '22 was approximately $40 million, similar to the previous fiscal year-end, April 30, '22. The company's balance sheet continues to reflect the strong working capital position of approximately $31 million at July 31, '22 and a current ratio of approximately 2.3 to 1. Michael, your line is live. Michael, your line is live."
}