{
    "symbol": "PNW",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-03 18:09:04",
    "content": " A few of the provisions that will benefit APS customers the most include the creation of an 8-year production tax credit for existing nuclear facilities, the inclusion of the EV and EV infrastructure tax credits, new credits for storage and hydrogen, a 10-plus year extension of the clean energy tax credits and a 3-year extension of the existing PTC and ITC. So I think the real benefit to this, and this is kind of the key that I was trying to emphasize in the commentary, is that if we can use the react, that renewable energy adjustor to pass through the tax benefit concurrently with the investment, it really unlocks value for customers, which has been RFPs when we're pursuing those. Again, I think the benefit of being able to flow those tax credits and the other incentives through an adjustment mechanism means you're not waiting multiple years to rate cases before you can get that benefit to customers. So it's really the combination of the smoother capital recovery, but also gradualism on the rate impact, the ability to reflect the tax credit benefits immediately and then to increase some of the ownership benefits, which is going to provide long-term benefits to customers. A couple of reasons, and Jeff alluded to these, one with IRA and now being able to pass through production tax credits to customers, this mechanism, and using the existing renewable energy mechanism, really provides an avenue for us to be able to pass on that savings to customers without being able to include those carrying costs for capital investments. So it's a good opportunity for us to be able to simplify the bill, simplify adjustments throughout the year for our customers,  and then really just focus on the base rate changes going forward. And Sophie, your point on  important change here really on addressing that would be the -- using the renewable energy adjustment mechanism to both flow back the tax credits to customers, but then also to get more  investment. And the way we think about it and that move in our guidance range up to that $880 million to $895 million is when we think about the average we're taking to mitigate some of that cost inflation, you compare actual 2021 O&M to the new '22 guidance range in that midpoint, you're talking about just over 2.5% increase year-over-year."
}