{
    "symbol": "RIGL",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-03 23:01:05",
    "content": " As Omicron faded, and we moved into March, we were able to have more in-person interactions than ever during the past two years, exceeding our previous high in November by more than 25%. As Omicron faded, and we moved into March, we were able to have more in-person interactions than ever during the past two years, exceeding our previous high in November by more than 25%. We have also seen in early market research interviews that physicians appear to be receptive to using chronic therapies, as many have acknowledged the need for a long-term tolerable treatment options for wAIHA patients who are refractory to or unsatisfied with steroids. When we looked at this Phase 2 data to see how many subjects would have met the FDA agreed approvable primary endpoint, which is greater or equal than 10 and greater or equal than plus 2 from baseline on three consecutive available time points, we see that about 29% of patients on fostamatinib did meet those criteria. The increase in costs and expenses was primarily due to increased commercial activities related to the sales force expansion in late 2021, increased research and development costs for the development of Rigel's RAK1/4 inhibitor program, and increased personnel related costs and stock based compensation expense, partially offset by decreased research and development costs related to our Phase 3 clinical trial of fostamatinib for warm autoimmune hemolytic anemia, and our ongoing Phase 3 clinical trial of fostamatinib in hospitalized patients with COVID-19. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions. For Dr. Piatek just a quick one, I don’t know if I might have missed it, but if you can speak on your belief of the receptivity of your colleagues and yourselves of TAVALISSE and warm AIHA, as I say, given the current dynamics of how you're treating patients and the relapse rate, there is a kind of entrenchment of sorts with current therapies and your colleagues are looking for something novel or you know, just your brief thoughts on it would be helpful for us. Please proceed with your questions. Please proceed with your questions. Please proceed with your questions."
}