{
    "symbol": "SBH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-05-07 05:14:14",
    "content": " When we look at key factors such as Sally U.S. and Canada's Net Promoter Score of 83, and 17 million loyalty members comprising 76% of sales in Q2, we know our core customer is highly engaged. As Denise previously mentioned, the net sales decline is primarily attributable to operating 142 fewer stores versus last year and a combination of macro factors at both Sally and BSG. Sally Beauty's net sales declined 3.1% with comparable sales down 0.5%, while operating 126 fewer stores versus a year ago. Gross margin at Sally expanded 40 basis points to 58.8% compared to the prior year as we continue to generate solid product margins, driven primarily by pricing leverage, in addition to a smaller write-down of COVID-related personal protective equipment inventory compared to our second quarter last year. For the full year, we now expect the following: net sales approximately flat to down 2%, net store count to decrease by approximately 1% to 2%, driven primarily by Sally U.S. stores as we continue to optimize our portfolio; gross margin expansion of 40 to 60 basis points; and GAAP operating margins and adjusted operating margins to be approximately 11%. And we talked a little bit in the script about marketing mix modeling, we're doing a lot more in getting smarter about how we're leveraging our performance marketing dollars be reaching the right customer in the right way and combining that with personalization, and to really work to get the relevant references for add-on products, reengaging her when the care options that go along with her color treatment she might have just done. As I mentioned and how that's impacting a customer's basket, basket was actually up from Q1 to Q2 on the Sally side of the business and -- but it was down versus last year, where last year had the stimulus effect that really did have people spending in those higher cost categories. The categories, I think, that we're all working on a little bit more, and I think more so on the Sally side or some of the secondary categories where just getting those things fully back in stock the way we would like to see them, whether that's styling tools and some of the cosmetics businesses or skin care businesses, we see that opportunity being part of the second half of the year. We clearly do know that last year in the second quarter and into the third quarter, those higher ticket items through COVID, where people were a little flush with extra cash with the stimulus, as well as we're spending a little bit more time at home, doing different things like that, those tools really were bought in a little higher rate than we would have seen even in prior years."
}