{
    "symbol": "VMI",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-21 15:40:22",
    "content": " Sales grew 27% year-over-year due to continued strong end-market demand, our team's focused efforts to increase volume across our footprint and continue pricing actions. Infrastructure sales grew 24% year-over-year with double-digit sales growth in all product lines led by higher volumes, primarily in Renewable Energy, Telecommunications and TDS, as well as favorable pricing globally. Second quarter operating income of $122.9 million or 10.8% of net sales grew 35% year-over-year, driven by higher volume, improved fixed cost leverage and our ability to successfully execute on pricing strategy. We delivered great results this quarter as market demand remains robust and order activity is strong, evidenced by another quarter of record revenue while growing record global backlog of $2 billion, up nearly 25% from year-end 2021. And then when you look at Infrastructure, let's assume that we're going to grow mid-single-digit volume growth pretty much across those infrastructure product lines is the way I would look and the remainder would be pricing. And so as long as we stay very close to the utilities on their demand profile, as long as we are continuing to build productivity year-over-year which everyone expects from their operations teams and then really putting the right capital, smart capital, I'll call it, towards those productivity things, that's where we're going to pack the market. Risk factors described from time to time in Valmont's reports to the Securities and Exchange Commission, as well as future economic and market circumstances, industry conditions, company performance and financial results, operating efficiencies, availability and price of raw material, availability and market acceptance of new products, product pricing, domestic and international competitive environments, geopolitical risks and actions and policy change of domestic and foreign governments."
}