{
    "symbol": "KLXE",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 15:23:03",
    "content": " Looking forward to 2023, we expect Greene's revenue and adjusted EBITDA of $70 million to $75 million and $18 million to $20 million, respectively, on a full year basis. During the fourth quarter, KLX generated $223.3 million in revenue, which was towards the top end of the previously provided guidance range and delivered adjusted EBITDA of $37.3 million, similarly near the top end of the guidance range. We also generated near record levels of quarterly net income and earnings per share, generating $13.2 million and $1.07 in Q4 2022, respectively. Adjusted EBITDA increased approximately $100 million year-over-year, and net income and EPS improved $102 million and $12 per share, respectively. For the fourth quarter, revenues were $223.3 million and similar to our Q3 results were driven by continued strong pricing and utilization across our drilling, completion, production and intervention activities. Net income and EPS for the fourth quarter were post-merger KLX records at $13.2 million and $1.07, respectively, representing a 19% and 11% sequential increase also respectively. The segment increased its revenue by 9.2% sequentially, generating revenue of $74.8 million in the fourth quarter. The sequential increase in cash was largely driven by $12 million in operating cash inflows, $15 million in opportunistic share sales under our ATM program and continued monetization of $5 million in obsolete assets and noncore real property. We ended the year with almost $102 million in total liquidity, an 18% sequential increase consisting of $57.4 million of cash on hand and $44.4 million of available borrowing capacity based on the December 31 ABL borrowing base certificate. Yesterday, we released standalone 2023 guidance of revenue of $925 million to $975 million and adjusted EBITDA margins of 16% to 18%. Pro forma for the subsequent announcement of the Greeneâ\u0080\u0099s transaction, we are updating full year guidance to a revenue range of $975 million to $1.04 billion and an adjusted EBITDA margin range of 17% to 19%. And if you think about Q4's run rate, you're on a revenue run rate of $892 million and an adjusted EBITDA run rate of approximately $149 million, $150 million of EBITDA."
}