{
    "symbol": "LBRDK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-17 14:05:18",
    "content": " Liberty here have had a long positive relationship working with Chris Winfrey and are excited by his strategy, that he's articulated both to the board and the marketplace even with the investments in the business, the increase in the stock price, Charter and Liberty Broadband both offer attractive free cash flow yield in a growth vehicle. And we do think that many shareholders, other than Liberty would is positive because given the increased investments in by Charter in 2023, many productive high-returning assets, nonetheless, they are investing more in the business and less in buybacks, the buyback will go down quite a bit, on a relative basis, and we would be able to ameliorate that or less than that by taking our 26% off the table, the 26% that goes to us. So I remain -- Liberty remains quite enthused about Charter's prospects, and the fact that we're buying back and have continued to buy back all the way through is some indication of that, though we do have these issues around attacking our own exchangeable, which is effectively deciding how much we're going to take on a current basis or the future basis given we're going to issue some kind of other likely equity. Greg, just -- I'm noticing with some interest news flow around the big RSN complex at Diamond, which is a big source of programming cost for the cable industry and they've acknowledged that they've missed an interest payment and their speculation that they're moving towards some type of bankruptcy and this presents, I think, an opportunity for this to be we thought we considered and I was -- you guys -- and you have a very interesting positioning on both sides as a distributor of these networks through Charter and as owner of sports team through the Braves on a different equity call, but maybe you can come in here a little bit. I think on the first point, once we get through our financing, we'll look at the -- with the charter stock prices, what the Liberty Broadband stock price is, if there's the discount, what our long term, if there's more clarity around the taxes -- all of those factors will weigh, but it's quite possible and probably more likely that we'll be back to buying -- using 100% of free cash flow. That said, we're projecting the benefits of that program to go away sometime early in '24 and our bad debt to return to more normal levels because we think in the current political environment with the Republicans in control of house, it's unlikely that the funding necessary to continue ACP would be provided and the actual termination date of the program when it runs out of money is unknown, but it's likely in the first half of '24."
}