{
    "symbol": "FBIN",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 04:27:03",
    "content": " Focusing now on the 2022 performance of Fortune Brands Innovations continuing businesses, the company generated sales of $4.7 billion for the full year, down 2% from 2021. Finally, Pat will provide highlights on our financial results, and Dave will share our thoughts around our future financial performance expectations for 2023, including how we intend to manage the P&L and balance sheet through the anticipated period of softness while advancing our previously communicated long-term goal of achieving a net sales growth CAGR of 6% to 9%, operating margins of 20% to 22% and EBITDA margins of 23% to 25%. Operating margins were 17.3% for the fourth quarter and 17.1% for the full year, an improvement of 110 basis points and a decline of 20 basis points, respectively. Now turning to our individual businesses, beginning with Water Innovations, sales declined 9% in the quarter and 7% for the year driven by lower-than-expected volumes, including lower sales in China and inventory destocking throughout the channel, following our industry-leading 2021 service level performance. Water Innovations' operating margins were an impressive 24% for the quarter and 24.2% for the year, driven by continuous operating improvement, fixed cost reduction initiatives and price realization. Turning to Outdoors & Security, sales for the fourth quarter were $490 million, down 5%, or down 7% excluding the 53rd week and FX, driven by channel inventory reductions, the softer market environment and strong prior year comparables, partially offset by acquisitions. Based on these assumptions, we expect full year net sales to be down 5% to 7% with operating margins between 16% and 17%, implying decremental operating leverage of between 25% and 30%. On an operating margin standpoint, and this is where there's a bit of departure here from the full year and so I'll talk to that in a minute, but operating margin, we expect the first quarter to be at 12.5% to 13%. So looking at first half, second half cadence, for the first half, inclusive of that first quarter that I just talked through, we see a first half sales decline between 7% and 9% and a first half operating margin between 15% and 15.5%. But then as we look to the second half, we see a sales decline between 3% and 5% and an operating margin between 17% and 18%, which implies a decremental margin better than 20%, which is more in line with our historical performance during a down market. And so as we look going forward and continue to have those conversations, it's one of the things that gives us confidence that, hey, based on our market expectations for right now and our sales forecast for the year, there are some pockets of inventory in the channel that need to come out to normalize in the first quarter, as I mentioned, within Outdoors and Water."
}