{
    "symbol": "BOOT",
    "quarter": 3,
    "year": 2022,
    "date": "2022-01-28 01:54:05",
    "content": " Our business continues to perform extremely well as third quarter total sales grew 71% on a two year basis, with retail stores up 71% and e-commerce up 70%. E-commerce sales in the third quarter grew 70% compared with the same period two years ago, and EBIT increased more than 200% over the same time, as our focus on enhancing the profitability of our e-commerce business continues to drive exceptional results. It was a fantastic quarter for exclusive brands as penetration grew 570 basis points compared to the same period two years ago, representing 28.3% of sales in the third quarter. Income from operations was $92 million, or 19% of sales in the quarter, expanding 670 basis points compared to $35 million, or 12.3% of sales in the two year ago period. Please proceed with your question. Help us to bridge – if we think about pre-pandemic, 6% to 7% same-store sales, that's basically what you did in the three years into the crisis. So we're really pleased with the execution across the board, new stores, comp stores, the expanded market and we do expect that when we outlined our guidance for next fiscal year, we'll likely come out with a number that's higher than 10% new units. Please proceed with your question. There is little doubt in our mind that the overall market for we're calling a Country customer is bigger than the overall market for a Western customer so theoretically there's new brands, BROTHERS AND SONS on the men's side, Cleo & Wolf and the ladies side could be every bit as big as our Western customer. Please proceed with your question. Again, looking at growth against the two year ago period, you have to remember it gets a little bit tricky, as you look back to March two years ago and the onset of COVID and the sharp decline that we saw in sales are, so something to factor in as you look at the two year occupancy and buying leverage, it's going to be a little bit tricky to model there. Please proceed with your question. When you take our current run rate, any growth in e-com, which we expect will happen, plus 10% to 12% to 13% new stores growing each year, we'll hit two billion faster than three years, I think. Please proceed with your question. Please proceed with your question. Please proceed with your question. So it's been several years now, where our same-store sales have been driven in part, typically roughly half of our same-store sales growth has been driven by the addition of new customers into the Boot Barn brand. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. I think the way we're looking at it is, the plus 89% on the two year basis, and really the consistent sales that we're seeing, really an acceleration from third quarter is how we're looking at. So I think the best way for you to think about it is to kind of anchor back to what the Jim's, both of them said, which is we're kind of targeting or believe that an EBIT rate in the 12% to 14% rate next year makes sense when we reinvest in marketing and store labor and things normalize. Please proceed with your question."
}