{
    "symbol": "BOOT",
    "quarter": 2,
    "year": 2022,
    "date": "2021-10-28 00:54:15",
    "content": " And finally, the consistency of the business has been remarkable with 32 consecutive weeks of more than 55% growth in sales on a two year basis with every one of the 13 weeks in Q2, 60% or better. In combination with strong top line performance, merchandise margin during the quarter was very healthy, increasing 320 basis points over the same period two years ago, driven primarily by better full price selling and growth in exclusive brand penetration. The strength in sales, both in stores and online, helped drive earnings of $1.25 per diluted share compared to $0.26 in the same period two years ago. During the second quarter, we saw consistently strong sales growth across our stores business, continuing the momentum that began building in the fourth quarter last year and accelerated during the first quarter. Our exclusive brand performance continued it's momentum from the first quarter, with growth of 750 basis points compared to the same period two years ago, amounting to 28.8% of net sales in the second quarter. Turning to current business; our third quarter is off to a strong start with total consolidated sales growth on a two year basis through the first four weeks of our third quarter, increasing 67% with a continuation of strong expansion in merchandise margin. Please proceed with your question. Please proceed with your question. Please proceed with your question. So when you take those two factors, less availability of the national brands and a relatively higher price point, given the fact that they're passing along the freight expense to us and you couple that with our exclusive brands group that we're able to share the product and frankly did a better job of managing the freight expense, it made our exclusive brands more available and perhaps more price competitive. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. And then, following up on the exclusive brands and how well you've handled supply chain issues out there, it sounds like your relative value perception of your exclusive brands has improved significantly in your customers' eyes and maybe that's part of why you're taking some share."
}