{
    "symbol": "MED",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-21 22:37:04",
    "content": " With customer retention levels having returned to normal and the continued focus on managing our cost structure, our full focus is on executing a more rigorous approach to customer acquisition, which continues to be pressured by changing customer purchasing behavior, and changes to the social media platforms our Coaches used to share the OPTAVIA programs with prospective customers. First, we work to implement programs that help Coaches attract new audiences to the OPTAVIA program, bringing in new customers who are looking for Lifelong Transformation in their health and wellness journey. Coaches continue to spend the same amount of time on this important activity, but the adjusted acquisition rate means that Coaches are reaching and subscribing fewer new customers per coach to the OPTAVIA health and wellness plan. We currently have a number of coach development initiatives in the pipeline to incentivize existing coaches to help newer customers on their own coaching journey, and expect to see some of these programs come online in the first half of the year, as well as throughout the rest of 2023. Average revenue per active earning OPTAVIA Coach for the fourth quarter was $5,538, a year-over-year decline of 12.4% driven by continued pressure from last yearâ\u0080\u0099s disruption in customer retention, continued softness in customer acquisition, and the unoptimized coach and customer tenure. Excluding these onetime expenses on a non-GAAP adjusted basis, gross profit decreased 11.7% to $245.8 million in gross profit margin decreased 80 basis points to 72.9%, primarily reflecting inflation outpacing pricing adjustments, partially offset by lower shipping costs due to reduced express shipping compared to the prior year. Finally, we believe that along with our more than 60,000 active earning OPTAVIA Coaches, we will be able to navigate the new business environment in the coming quarters, and we are confident in our long-term 15% growth and 15% operating income targets. In closing, we have built a robust business over the course of the past 6 years, developing a coach-based model and a transformational system that is a powerful force for personal health and wellness change for coaches and customers across the United States and around the world."
}