{
    "symbol": "LZB",
    "quarter": 1,
    "year": 2022,
    "date": "2021-08-18 10:48:07",
    "content": " Written same store sales for the La-Z-Boy Furniture Galleries network increased 10% versus the prior year quarter and has grown at a compound annual growth rate of 13% across the last two years since pre-pandemic, demonstrating the continued strength of demand for our La-Z-Boy branded products. Joybird continued on its strong growth journey, writing 31% more business than in last year’s first quarter and growing at a compounded annual growth rate of 35% across the last two years. On a consolidated basis, fiscal ’22 first quarter sales increased 84% to a record $525 million, reflecting strong demand, capacity increases, and a comparison to the fiscal ’21 first quarter when we restarted our plants at reduced capacity after a month-long shutdown, and most retailers were closed for a portion of the quarter due to COVID-19. Compared with the pre-pandemic fiscal ’20 first quarter, sales increased 27% for a compounded annual growth rate of about 13%. Compared with the pre-pandemic fiscal ’20 first quarter, sales were 23% higher for a compounded annual growth rate of 11%. Compared with the pre-pandemic fiscal ’20 first quarter, sales increased 27% for a compounded annual growth rate of 13%, reflecting strong execution at the store level. Last year’s first quarter margin was negative 6.8% with the period marked by a significant reduction in delivered sales due to delays in product deliveries from COVID-related manufacturing shutdowns in April as well as retail closures, with some store closures extending into June. From the pre-pandemic fiscal ’20 first quarter, delivered sales increased 125% for a compounded annual growth rate of about 50%, reflecting Joybird’s strong positioning in the direct-to-consumer marketplace as well as excellent end-to-end execution by the team. Pulling all this together, consolidated non-GAAP gross margin for the fiscal ’22 first quarter decreased 270 basis points versus the prior year quarter, primarily driven by significant increases in commodity and freight costs in addition to start-up costs associated with the expansion of our manufacturing capacity and labor challenges in our wholesales businesses."
}