{
    "symbol": "LZB",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-22 12:20:03",
    "content": " Record delivered sales for our wholesale segment, record delivered sales and profits for our company-owned retail segment, strong delivered sales and profit performance for Joybird, returns of $118 million to shareholders through dividends and share repurchase, the highest level in our history, and the launch of Century Vision, our growth strategy through our centennial year in 2027. For the full fiscal year, written same-store sales for the La-Z-Boy Furniture Galleries network increased 1% and were flat for the Company-owned retail segment. And compared with fiscal 2020, written same-store sales for the entire network as well as for our company-owned retail segment grew at a compound annual growth rate of approximately 15% over the last two years. On a consolidated basis, fiscal '22 fourth quarter sales increased 32% to a record $685 million versus the prior year quarter, reflecting higher pricing and surcharges, increased unit production and the extra week in the quarter, which increased sales by approximately $49 million. Consolidated GAAP operating income increased to a record $79 million and non-GAAP operating income was a record $65 million, an increase of 24% versus last year's fourth quarter. Sales increased to a record $2.4 billion, up 36% versus the prior year, reflecting strong demand, ongoing manufacturing capacity increases, higher pricing and surcharges and the extra week in Q4, which increased sales by approximately $49 million. Starting with our Wholesale segment, delivered sales for the quarter grew to a record $513 million, a 34% improvement compared with the prior year period and increased 24%, excluding the extra week. For the quarter, our Retail segment delivered sales were a record $233 million, a 20% increase over prior year's fourth quarter and 12% higher excluding the extra week. Retail posted record high non-GAAP operating profit dollars and non-GAAP operating margin increased to 13% versus 12.2% in the prior year quarter, driven primarily by fixed cost leverage on the higher sales volume. Joybird delivered a great quarter with record delivered sales of $53 million, a 40% increase versus the prior year quarter and a 30% growth rate adjusting for the extra week of sales. Taking all these factors into consideration, we now expect delivered sales for fiscal '23 first quarter to be up 7% to 10% versus the first quarter of fiscal '22 in a range of $560 million to $575 million."
}