{
    "symbol": "LZB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-16 11:07:06",
    "content": " Yesterday afternoon following the close of market, we reported our fiscal ’22 third quarter results, which included delivered consolidated sales of a strong 22% versus last Q3, including record delivered sales and operating profit for our company owned retail segment. Ongoing strong demand versus pre-pandemic levels $32 million, returned to shareholders through dividends and share repurchases in the quarter, bringing our year-to-date total up to $96 million and all time high and closing on 2 important acquisitions to five La-Z-Boy furniture gallery stores in the Alabama market and the Furnico (ph) Manufacturing Company in the UK. This had a significant near-term impact on the efficiency of our manufacturing capacity ramp plans, affecting both sales and profit performance 3:27 Within our own manufacturing operations, which comprise the majority of our wholesale business, lack of availability of component parts, including electronic chips and actuators, continued to disrupt production plans but at a higher level than we expected. 8:14 Turning back to the top line and demand for our products, written same-store sales for the La-Z-Boy Furniture Galleries Network increased 3% in the fiscal ’22 third quarter and we are at 9% compared with the pre-pandemic fiscal ’20 quarter for a compound annual growth rate of 4% across the 2 years. 8:52 For our company own stores, our retail segment written same-store sales were down 1% versus the prior year third quarter and up across the two years at a compound annual growth rate of 4%. 10:02 And our Joybird business continues on its strong growth trajectory this quarter, writing 27% more business this Q3 than last year's third quarter with an extremely impressive compound annual growth rate of 51% across the last 2 years. 10:51 On a consolidated basis, fiscal ’22 third quarter sales increased 22% to $572 million versus the prior year quarter, reflecting continued strong demand and ongoing manufacturing capacity increases as well as the effects of pricing and surcharge actions. Starting with our wholesale segment delivered sales for the quarter grew 21% to $423 million compared with the prior year period, driven by pricing and surcharge actions as well as higher volume. 13:16 For the quarter, our retail segment delivered sales increased 19% to an all-time record $197 million, delivered same-store sales increase 16% versus the year ago quarter. Retail posted record high non-GAAP operating profit dollars and non-GAAP operating margin increased to 12.2% versus 8.9% in the prior year quarter, driven primarily by fixed costs leverage on the higher delivered sales volume in discipline expense management. When a consumer walks in and they're paying more money for product, and we're telling them it's still going to take them 4 to 6 months to get that product and our sales -- our written sales are still strong, that's a good indication that the brand is strong and that some of the concerns that are out there, that you've written about around stimulus checks going away and other doom and gloom on the industry, we're a little bit more bullish from that standpoint, from an industry perspective, because we're able to weather the higher prices and the longer lead times."
}