{
    "symbol": "MTDR",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 15:53:02",
    "content": " And I think, it's important, we think long-term around here to look at more -- look at the quarter as much as you want, but we ask look longer too at one year, because some of the things that we're deferring on now sets us up for 2024. So we have a practice, if we're going to connect wells, we -- if possible, we try to set them up for the first quarter of the year, so we get a full year's benefit. And so, now, it's about 1% -- little over 1% of the value and I think it's a great buying opportunity because you can clearly see the vision ahead 2020 -- this year is going to be a very strong year, but 2024 is going to be even better as everything gets set up. The question I have is, you talked about setting up for 2024, it looks like you guys are going to have, I think, it's 62 drilled and uncompleted wells at the back half of this year, which, I believe, is a little bit in excess of what you normally carry. Well, the first thing I'd say is, we're at a point in time and especially this year, I'd be wary of looking at things just on a quarter basis, that you got to look a little longer rather than limited to an arbitrary deadline of this quarter or this year, but either we'll play it as the operations dictates exactly how we're going to do it. But if we didn't have Advance, you'd see growth much better than the 3% that you're talking about, and -- but you take out a couple of rigs, puts your focus on the new properties and taking advantage of that opportunity to connect up your pipeline, we think that's a better program. To Joe's point about trying to keep our options open, we do expect these wells to be kind of end of 2024, but if the drilling guys go faster and the completions guys go faster, I think there's always a chance that they could cycle them forward, bringing on a little bit sooner, but it's just too early to tell at this point in the year. And so, that's just something that you're thinking through kind of into the future and otherwise, that -- as we expand into Lea County, those capital expenditures on the Midstream side are 100% Matador's, and not 51% like they are in San Mateo."
}