{
    "symbol": "UIHC",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 20:11:04",
    "content": "  The first quarter had a core loss of $29.3 million, which reflects a reduced net earned premium combined with elevated catastrophe losses from 10 PCS events and higher loss severity on both attritional and CAT claims. While losses are down $21.4 million or 21% year-over-year, the net loss ratio is up significantly due to the 30% reduction in net earned premium. On page four of our investor presentation, highlights that our core loss included $28.6 million of current accident year net retained CAT losses and $1.4 million of prior year reserved development driven primarily by CAT events. CAT losses in the current quarter stem from ten new PCS events with estimated gross losses of approximately $43 million that were all within our $15 million retention but subject to recovery from our quota share reinsurance, reducing the net amount retained. Gross premiums written for the quarter of $279.5 million declined $32.2 million or approximately 10% and gross premiums earned a $319.2 million decreased 11%, due to the continued exposure management in our personal lines portfolio, as well as the cancellation of all policies in New Jersey, consistent with our plan to transfer that business to HCI Group. Ceded earned premiums were $218.3 million, a decrease of $7.6 million or 3.6% year-over-year due primarily to more business being ceded via the 100% quota share reinsurance programs for the Northeast and Southeast Regions, and the 25% structured quota share placed at year-end. Other items included in total revenues during the first quarter were $3.1 million of fee income that decreased $6.1 million year-over-year due primarily to the renewal rights sale for the Northeast Region included in the prior year, along with lower policy fees as we decreased our personal lines and policies written. Net investment income of $2.5 million declined year-over-year due to lower invested assets, and net investment losses of $1.8 million were caused by fixed income sales during the quarter needed to meet liquidity needs, as well as unrealized losses from equity securities of $2.3 million. UPC's first-quarter net loss and loss adjustment expense was $91.4 million, a decrease of $24.4 million or 21% year-over-year. Our balance sheet as of March 31st, included total assets of $2.4 billion, including cash and investments of approximately $909 million, which decreased $56.1 million or $5.8% from year-end."
}