{
    "symbol": "FRME",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-26 14:35:05",
    "content": " When adjusted for PPP income and Level One acquisition expenses, our Q2 2022 earnings per share totaled $1.01, an increase of $0.13 per share or 15% over the linked Q1 2022's adjusted total of $0.88. The top of the page offers a breakdown of the core loan growth by our business units, it was another solid quarter of active engagements with our clients and prospects that delivered an annualized growth rate of more than 20% excluding the PPP loans and the day one balances of Level One. With the Close the Level One, our on-balance sheet mortgages have exceeded $1.5 billion and grew organically in the quarter by $225 million. Total loans on line two, which Mike has covered in detail in his remarks, increased over $2 billion during the quarter with Level One contributing $1.6 billion through the acquisition, coupled with organic loan growth of $468 million. Deposits increased $1.7 billion during the quarter, which included $1.9 billion from the Level One acquisition reflecting a decline in deposit balances of $266 million. Mark covered earnings per share for the quarter, which was reduced by CECL Day one provision, which you can see on line 12 of $16.8 million and the elevated level of non-interest expense on line 14, which included $12.5 million of acquisition costs. Mark covered operating earnings per share with -- which was an increase of 13%, which excluded PPP fee income, which totaled $19 million in the year-to-date 2021 results and $2.8 million in year-to-date 2022 results. With the closing of the Level One Bank acquisition, we recorded a CECL Day one allowance for the purchased credit deteriorated loans in the amount of $16.6 million, as well as a CECL Day one allowance for non-purchased credit deteriorated loans that was recorded through provision expense in the amount of $14 million. Also recorded through provision expense this quarter was $2.8 million of reserve for Level One's unfunded commitments, bringing total provision expense for the quarter of $16.8 million. Compared to the prior quarter total of $105.1 million, the increase in core net interest income was $25.6 million, $18.3 million of which was contributed from the loan and deposit portfolios of Level One. Adjusting for the fair value accretion and the impact of PPP loans, brings us to a core net interest margin of 3.19%, which is shown on line 10, an increase of 22 basis points from last quarter's NIM of 2.97%, reflecting the asset sensitivity of our balance sheet. Non-interest income totaled $28.3 million for the quarter with total customer related fees of $25.8 million, an increase of $2.8 million reflecting the addition of Level One Bank fees, which are primarily in service charges on deposits and gain on the sale of mortgage loans. Total expenses for the quarter totaled $97.3 million, which was elevated due to acquisition costs incurred during the quarter of $12.5 million, $10 million of those acquisition costs were one-time charges, $3 million of which was for severance and retention bonuses, reflected in salaries and benefits and the remainder was mostly contract termination charges and advisory fees, which are recorded in the professional and other outside services line in the income statement and reflected in the other category on this chart. This resulted in NPA's and 90-days past due, up $2.1 million and as a percentage of loans and ORE of 0.47%, dropping down to classified loans in line seven or loans with a well-defined weakness with the addition of $73.5 million of classified loans we ended the -- of Level One classified loans."
}