{
    "symbol": "FRME",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-26 15:47:08",
    "content": " Now, if you turn to Slide 5, net income totaled $70.3 million for the quarter compared to $47.7 million in the fourth quarter of 2021. Reported EPS for the fourth quarter totaled $1.19 without any required adjustments compared to Q4 2021 of $0.89, a 33% increase. When adjusted for those two items, which totaled $60 million, our year-to-date 2022 EPS totaled $4.20, which is 24.3% better than 2021's total of $3.38. Total loans on line 2, which Mike covered in his remarks, increased $344.1 million, or 11.8% through organic growth during the quarter, which was offset by PPP loan forgiveness of $6.5 million to arrive at the $337.6 million you see in the variance column. Pre-tax pre-provision earnings totaled $83.8 million this quarter, a 9% increase over last quarter when excluding acquisition costs. Rising yields on earning assets offset somewhat by higher deposit costs drove higher profitability this quarter, which is reflected in the increase in net interest income on Line 11 of $8.6 million over prior quarter. Adding to the quarter-over-quarter profitability was lower non-interest expense, which declined $6.7 million, bringing our net income on Line 17 to $70.8 million, an increase of nearly $7 million over Q3 or 11%. So when excluding acquisition costs, Day 1 CECL provision and PPP loan income, EPS for 2022 totaled $4.20 and 2021 totaled $3.38 for an increase of 24% reflecting strong core organic growth and profitability and the contributions of the Level One acquisition. On the top right, you can see the yield on the portfolio remains stable given we aren't reinvesting in bonds, although the total portfolio balance only declined $31 million from last quarter, the portfolio actually declined $130 million from pay downs, maturities, and sales of bonds. Line 1 shows net interest income on a fully tax equivalent basis of $155.3 million, when you back out non-core interest income items such as fair value accretion on Line 2 and the impact of PPP loans shown on Line 3. Compared to the prior quarter total of $143.1 million, the increase in core net interest income was $9.4 million, reflecting our higher loan yields. Adjusting for fair value accretion and the impact of PPP loans brings us to a core net interest margin of 3.65%, which is shown on Line 10, which is an increase of 18 basis points from last quarter's core NIM of 3.47%. Although, gains on the sale of mortgage loans remained at a modest level this quarter, mortgage loan production is still strong despite fourth quarter lower seasonal purchase trends as $217 million in loans were originated this quarter. So turning to Slide 18, in the quarter, we experienced strong commercial loan growth, as Stu mentioned a moment ago, originated by our middle market lending team, which for us, our companies with revenue generally between $10 million and $500 million. And finally, we moderated the pace of portfolio, residential mortgage growth as we shifted back to a more originate and sell model, adding $89 million after several very strong quarters of portfolio growth. So after a quarter of 11.8% loan growth and combined annual organic loan growth of 13.9% or $1.3 billion for the year, the composition between C&I, non-owner occupied CRE and investment â\u0080\u0093 excuse me, and residential mortgage loans remains in balance and substantially similar to what it was at the beginning of the year. Classified loans on line seven or those loans with a well-defined weakness increased roughly $8 million to $215 million or 1.79% of loans, which remains comparable to pre-pandemic levels. Given the continued strong environment, weâ\u0080\u0099ve been able to balance the migration of new non-performing loans against the resolution of existing non-performing loans making $200,000 of improvement in the quarter on line 13 and only an increase of $5.8 million for the year after we added $9.4 million of Level 1 non-accrual loads."
}