{
    "symbol": "FRME",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-26 16:37:02",
    "content": " However, excluding PPP income, our Q1 2022 earnings per share totaled $0.88 compared to $0.78 from last year, an increase of nearly 13%. During the quarter, revolver commitments increased over $125 million to new and existing clients and the utilization rates of the revolvers move closer to 45%. Deposit growth returned to a more normalized growth level, as you can see on line 4, once we get past the forgiveness of the remaining PPP loans which had a period end balance of $49 million, liquidity management should normalize as well, where we are funding loan growth with our deposit growth and cash flow roll off from our investment portfolio. As Mark mentioned, excluding the income from PPP loans, earnings per share this quarter was $0.88 and $0.78 in Q1 of 2021 which is EPS growth of 13% year-over-year. You will see on Line 17 that net income totaled $48.6 million, an increase of $800,000 from prior quarter despite declines of $1.7 million in PPP fee income which also demonstrates our strong operating leverage. Like many of our peers, we experienced a decline in the tangible common equity ratio which you can see on Line 6 and the tangible book value per share on Line 24 of $1.95 or 7.7% during the quarter due to changes in unrealized gain loss on available-for-sale securities which takes me to my next slide, Slide 9 which shows our investment portfolio highlights. In the bottom left corner, you will see the stated first quarter loan yield declined 14 basis points from last quarter to 3.73%. Excluding the impact of PPP loans, loan yield was 3.64%, a decline of only 6 basis points compared to prior quarter which was driven by the consumer portfolio. As of quarter end, we had active loan floors on 24% of the total loan portfolio, so about $2 billion in loans and nearly all of those will grow out of those loan floors with the next 50 basis point increase which we expect in May. Although total deposits increased $173 million during the quarter, total interest expense on deposits continued to decline and was down $1.3 million compared to prior quarter. When you back out noncore interest income items such as fair value accretion, shown on Line 2 and the impact of PPP loans shown on Line 3, our core net interest income totaled $105.1 million which is shown on Line 4. Adjusted for fair value accretion and the impact of PPP loans brings us to core net interest margin of 2.97% which is shown on line 10, an increase of 5 basis points from last quarter's core NIM of 2.92%. In the quarter, when excluding the $58 million of PPP paydowns, the loan portfolio grew $165 million or 7.2% annualized. This left NPAs in 90 days past due to loans and ORE at 55 basis points, dropping down to classified loans on Line 7 or loans with a well-defined weakness, we continue to see a decline this quarter, down $20 million and ending the quarter at 1.09% of loans. Well, Level One's expense run rate was generally $15 million per quarter and we had modeled 30% cost savings which we believe is achievable."
}