{
    "symbol": "PRTS",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-09 22:35:40",
    "content": "  Operator: Good afternoon, and welcome to the CarParts.com Third Quarter 2022 Conference Call. For a discussion of the material risks and other important factors that could affect results, please refer to the CarParts.com annual report on Form 10-K and 10-Qs as filed with the SEC, both of which can be found on the Investor Relations website. As reported in today's release for Q3 2022, our team achieved our best third quarter sales on record of $165 million, up 16% versus the same period last year and marking our 11th quarter in a row of double-digit year-over-year sales growth. Like many throughout the United States, our customers are not immune from the inflationary pressures causing them to tighten their belts. First, many of our items are less discretionary as consumers push to keep their vehicles on the road longer; and second, we believe that as continue to be pressured by high interest rates and inflation, some customers who were previously Do-It-For-Me customers will step into the do-it-yourself space in order to save money. Regardless of the circumstances that bring customers to CarParts.com, we remain committed to simplifying their journey and removing the stress from auto repair and maintenance. Towards this endeavor, our team has continued executing on our 4 areas of focus: outstanding customer service, operational excellence, financial discipline and innovation. Whether it is placing an order over the phone with one of our trained agents or helping connect the customer to a certified mechanic, simplifying and removing the friction of auto repair is at the forefront of everything we do. As a reminder, over 1/3 of our e-commerce revenues come from repeat customers, and we will continue to focus on improving our experience to get that number higher over the long term. Aligning people, process and strategy with the needs of our customers is in our DNA. As many of you know, our legacy system was over 15 years old, and we're extremely thankful for the amazing work of our technology and business teams over the last 2 years to get us to a best-in-class platform. As reported in today's release, we generated another quarter of strong adjusted EBITDA of $6.3 million, up 173% from a year ago. In times of market uncertainty, profitable growth and free cash flow generation are more important than ever and where we continue to focus our energy and resources. Last quarter, we launched a new Do-It-For-Me capability on our website where customers in select markets can see installation pricing and book an appointment for certain part names at a certified repair shop in their area. We recently surpassed 1,500 bookings with this service and are finding from our customers that this is a compelling value proposition. Of course, it's still very early for this new solution, but we believe that continued momentum will allow us to refine and optimize the technology and logistics to provide a seamless customer experience. From a pricing standpoint, in some cases, shopping on our website may offer customers an opportunity to pay less for parts and labor than they would for just the parts at a brick-and-mortar or dealership. We believe this is a highly compelling offering, especially in times when consumers are trying to be mindful of their spend, and we are working on the messaging in test markets. In Q3, we generated revenue of $165 million, up 16% from the prior year period. For the month of October, we continue to see double-digit year-over-year revenue growth. We remain committed to balancing growth, profitability and free cash flow generation. Gross profit for the quarter was $56.1 million, up 19%, with gross margins improving 70 basis points to 34.1% this year versus 33.4% last year in the same period. The improved gross margin continues to reflect purchasing and freight optimization as well as our use of advanced pricing algorithms, all being driven by our data science and supply chain teams. Net loss for the quarter was $0.9 million, mostly driven by noncash expenses. At the quarter end, our cash position was $16.7 million, and our inventory was $155 million. On the fulfillment side, we are now at over 1 million square feet of fully built-out warehouse space that can reach 98% of our customers within 2-day transit time. We continue to invest in best-in-class technology tools to drive operational efficiencies throughout our network, but most importantly, bring in the best talent to build a world-class supply chain. While we intend on expanding our footprint in the coming years to get closer to our customers, at this point, we see an opportunity to get more shipments out of our existing network. Thank you, Ryan, and everyone, for joining today's call. We continue to focus on our customers, our people and our core business. We see staying laser-focused on positive unit economics, free cash flow generation, operational efficiencies and delivering an outstanding customer experience as key to building an exceptional and durable company for our long-term stakeholders. Our first question comes from the line of Thomas Forte from DAD Co.\n Dave and Ryan, congrats on a really good quarter. Obviously, historically, we've been mostly focused on performance marketing. Now over the next couple of years, I think there's an opportunity to invest in customer experience. Like if you think of our supply chain, getting closer to the customer or our assortment expanding to have collision and mechanical parts on top of traditional marketing. And I think for us, it's still early, and there's an opportunity to capture more and more customers over the long term. Obviously, for us, and as David already mentioned in his prepared remarks, we're laser focused on the balance between growth and profitability, specifically focusing on gross profit dollars. We're very, very laser-focused on how we allocate capital. And I think taking a step back for us, the #1 priority is maintaining a strong foundation for the business, and we have no reason to raise capital at these levels. And then also, it's a little bit of the revenue weakness that you'll see at the top line in the fourth quarter because of people deferring spend to do Christmas purchases or travel. Third quarter, I think historically, we've had fairly okay profitability at the bottom line or fairly consistent. As I mentioned in my prepared remarks, first month of Q4, we continue to see double-digit growth. Just that's the second quarter in a row, I believe you've seen sequential decline. So when we drive efficiencies through the business, whether it's marketing or fulfillment or call center, that flows to the bottom line. The fixed portion, obviously, we try to maintain through generic financial discipline, such as making sure every head count is really going to add an ROI or every technology contract is going to have an identifiable ROI. And as a follow-up, with the mobile mechanic, the 1,500 bookings, I think you mentioned. But I think that over time, this is probably 1 of the biggest opportunities and the biggest game changer for our company. it's going to be a long-term process, and it's still very early, but I'm excited about it. For us, again, going back to it, the focus is going to be on maximizing gross profit dollars. It's really about nominal gross profit dollars, the way we look at it internally. I think, yes, if you're talking about the macro, I'm glad you're bringing it up because it's something that's been popping up a lot and want to make sure we address it. I think we're doing a lot of things right between our supply chain, our technology investments and the team that we've built over the last 4 years. But to your point, like our customers are not immune to inflation. I think what's important is for companies like us, especially after experiencing hypergrowth or transformation is to acknowledge that the environment is changing. Now for me, I think we can keep the same aggressive mindset and be laser-focused on building a great business, but at the same time, kind of playing defensive moves and the fiscally conservative and create resilience in the business. And I think I just want to emphasize the fact that the focus is on profitability, free cash flow, doubling down on the fundamentals and servicing our customers. I also think that you're going to see some of our competition not as ready for the macroeconomic environment as we are, and there might be an opportunity for us to capture market share. The other thing, too, is because they're not capturing the margin on the parts that they sell, we're allowing them to charge a slightly higher price and have the margin on the labor to make up for that loss. I think it's still early, but I think what I wanted to emphasize is that this is -- this is an initiative that we've been talking about for a while. And for the last 7 months, we've basically made like a big push. I wanted to make sure that people understand, yes, we have now over 1,000 customers that are going through the experience, and it's working. But at a minimum, we're starting to see traction and to see that there's a need for that. One thing that's interesting is even though the mechanic may charge a little bit more on the labor, our customers are still getting a huge benefit. So I recently looked at one application, a customer through our website could get a headlight installed fully through one of our certified repair shops that we're partnered with and do that for cheaper than driving to a local brick-and-mortar, buying the park, coming home and realizing they don't know how to install it. So especially going to recession, I think that's a very compelling offering. So the mechanics are winning, our customers are winning. Obviously, we're going to sell more parts. Obviously, in November and December, typically you have a little less pricing power because to Ryan's point, some of the spend gets deferred. I think we've done a good job at building those -- the data science capabilities, and we constantly evaluate pricing basically in real time. Net-net, I think we've done a pretty decent job at absorbing the impact of inflation and transportation costs. And obviously, we've got to focus on delivering an experience versus trying to be always the lowest price. So I think the main focus for us now and long term is  figuring more value to the customer in terms of quality, in terms of service levels and not just pricing."
}