{
    "symbol": "MCK",
    "quarter": 4,
    "year": 2022,
    "date": "2022-05-05 18:48:05",
    "content": " Looking ahead, to our fiscal 2023, our guidance of $22.90 to $23.60 of adjusted earnings per diluted share includes organic growth of the underlying businesses, improved operating leverage and a balanced approach to capital deployment. Excluding the contribution from COVID-19-related items in both fiscal 2023 and fiscal 2022, and net gains from McKesson Ventures in fiscal 2022, we expect adjusted earnings per diluted share to grow 9% to 14% year-over-year. During the fourth quarter of fiscal 2022, we recorded a GAAP-only charge of $343 million related to our agreement to sell the UK retail and distribution business. In fiscal 2022, our European operations, including held-for-sale accounting treatment impacts, contributed $409 million of adjusted operating profit or $1.97 per diluted share. We're exiting the year with solid operating performance, delivering fiscal 2022 fourth quarter earnings per share of $5.83, and for the full year, earnings per share of $23.69. Excluding these items and the impact of fiscal 2021 inventory impairment charges related to personal protective equipment and other related products, fiscal 2022 earnings per diluted share increased 31% year-over-year. For the fourth quarter, consolidated revenues of $66.1 billion increased 12%, driven by growth in the US Pharmaceutical segment due to increased volumes of specialty products, including higher volumes from retail national account customers and market growth, partially offset by branded to generic conversions. Gross profit was $3.4 billion for the quarter, an increase of 6%, primarily driven by our Medical-Surgical Solutions segment, resulting from prior year inventory charges on PPE and related products, and increases in patient care visits in our primary care business. Operating profit of $1.2 billion for the quarter was an increase of 3%, led by solid operating performance across the segments, partially offset by the distribution of COVID-19 vaccines and ancillary supplies for the U.S. government and lower contribution related to COVID-19 tests. When excluding the impact related to the distribution of COVID-19 related products, net gains associated with McKesson Ventures equity investments and the prior year PPE impairments in the Medical-Surgical segment, operating profit increased 8%. Moving below the line, interest expense was $43 million in the quarter, a decrease of 17% due to the net retirement of approximately $1.1 billion of long-term debt in fiscal 2022, including a previously announced tender offer in the second quarter of fiscal 2022. And ramping up our consolidated results, fourth quarter diluted weighted average shares outstanding were 149.2 million, a decrease of 7% year-over-year resulting from share repurchases throughout fiscal 2022. Revenues were $53.7 billion, an increase of 14%, driven by increased volume of specialty products, including higher volumes from retail national account customers and market growth, partially offset by branded to generic conversions. Operating profit decreased 4% to $780 million, due to lower demand of COVID-19 vaccine distribution, partially offset by growth in distribution of specialty products to providers and health systems. COVID-19 vaccine distribution provided a benefit of approximately $0.06 per share in the fourth quarter, compared to $0.26 in the third quarter of fiscal 2022. For the full year, operating profit increased 8% to $2.9 billion, driven by growth in distribution of specialty products to providers and health systems and the contribution from COVID-19 vaccine distribution. In the Prescription Technology Solutions segment, revenues were $1 billion, an increase of 29%, as a result of volume growth related to biopharma services, including third-party logistics services and increased technology service revenue, partially resulting from the growth of prescription volumes. In the fourth quarter, operating profit in the Medical-Surgical Solutions segment included $0.22 of earnings per diluted share contribution related to COVID-19 tests and $0.20 of earnings per share -- per diluted share contribution related to the kitting, distribution and storage of ancillary supplies for COVID-19 vaccines for the US government. Excluding the impacts of these COVID-19 related items, and the prior year inventory charge on PPE-related products, operating profit increased 26% due to growth in the primary care business. On an FX adjusted basis, revenues were $8.8 billion, an increase of 3%, driven by sales to new customers in the Canadian business and year-over-year volume recovery in our distribution businesses, partially offset by the divestiture of our Austrian business, which closed during the fourth quarter of fiscal 2022. On an FX adjusted basis, operating profit increased 10% to $152 million due to the reduction of depreciation and amortization on European assets under agreements to sell and increased volumes in the pharmaceutical distribution business. During the quarter, mark-to-market valuations related to our equity investments within our McKesson Ventures portfolio resulted in net losses of approximately $6 million, compared to net gains of $44 million in fourth quarter of fiscal 2021. In fiscal 2022, McKesson had net gains related to our equity investments within our McKesson Ventures portfolio of approximately $98 million or $0.47 per share. And finally, in the fourth quarter, we incurred opioid related litigation expenses of $26 million and incurred $130 million for the full year fiscal 2022. Excluding the impacts related to the US government's centralized COVID-19 vaccine and kitting distribution programs, COVID-19 tests and net gains associated with McKesson Ventures equity investments, which were recorded in fiscal year 2022, we anticipate operating profit to increase 3% to 9%. Wrapping up our consolidated guidance, our fiscal 2023 earnings per diluted share outlook is $22.90 to $23.60, which includes $0.20 to $0.60 of contribution attributable to the following COVID-19-related items: $0.05 to $0.20 related to the US government's vaccine distribution; less than $0.05 related to the kitting storage and distribution of ancillary supplies; and $0.15 to $0.35 related to COVID-19 tests. Excluding the impacts of these COVID-19 related items from both fiscal 2023 guidance and fiscal 2022 results and the $0.47 related to net gains associated with the McKesson Ventures equity investments in FY 2022, our fiscal 2023 guidance indicates approximately 9% to 14% growth over the prior year. Our outlook includes approximately $0.05 to $0.20 related to COVID-19 vaccine distribution for the US government in the first quarter of fiscal 2023, which is aligned to the current contract timing and volume distribution schedule provided by the CDC and the US government. When excluding the impact of COVID-19 vaccine distribution for the US government, we anticipate 3% to 5% operating profit growth, which is consistent with the long-term growth target we provided for the US Pharmaceutical segment at our recent Investor Day event. Excluding the impact of these COVID-19-related items, we anticipate operating profit to increase 8% to 14%, primarily as a result of growth in the primary care business. Just to conclude, McKesson delivered a strong fiscal 2022 with double-digit adjusted operating profit growth and I am excited about the continued progress of our company priorities into fiscal 2023."
}