{
    "symbol": "GD",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 12:58:05",
    "content": " Here, we beat last quarter's revenue by $876 million or 8.8%, operating earnings by $129 million or 11.7%. For the full year, we had revenue of $39.4 billion, up 2.4%, net earnings of $3.4 billion, up 4.1% and earnings per fully diluted share of $12.19, up $0.64, a 5.5% increase. It was another solid quarter with operating cash flow of $669 million, which brings us to $4.6 billion of operating cash flow for the year. After capital expenditures, our free cash flow for the year was nearly $3.5 billion, a cash conversion rate of 102%, slightly ahead of our target for the year of 100% of net income. At midyear 2022, we told you to expect revenue of about $8.6 billion and an operating margin of around 12.9%. Revenue in the quarter was $2.18 billion, and it's up 15.5% from the year ago quarter. Fourth quarter revenue of $2,970 billion is up 3.4% over the year ago quarter. Marine Systems has grown revenue from $8 billion in 2017 to $11 billion in 2022, this is a 5.3% compound annual growth rate with an average increase of $600 million per year. Our forecast to you in July of last year anticipated revenue of about $10.8 billion, operating margin of 8.3% and operating earnings of $896 million. Earnings for the year of $1.23 billion were down 3.8% on a 40 basis point contraction in margin to 9.8% as a result of the mix shift between product and service revenue as GDIT reported its highest margin since the CSRA acquisition and its highest ever earnings, but Mission Systems was down for the reasons discussed. We also paid $345 million in dividends in the fourth quarter bringing the full year to $1.4 billion, and we repurchased approximately 440,000 shares of stock in the quarter, bringing us to over 5 million shares for the year for $1.2 billion at just under $226 per share. Continuing the better than expected performance in 2022, we expect the group to hold steady again in '23 with revenue of $7.3 billion and operating margin once again towards the high end of their reliable 14% to 15% range at 14.7%. As a result, the group's revenue for 2023 will remain essentially flat at $10.9 billion as well their operating margin rate at 8.1%. The resulting shift in the group's revenue mix, with stronger service activity but lower hardware volume would yield an operating margin in the 9.5% range, sustaining their industry leading performance, albeit slightly lower than 2022."
}