{
    "symbol": "GD",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-26 12:25:46",
    "content": " Revenue is up, $407 million or 4.3% against the third quarter last year. Aerospace had revenue of $2,350 billion and operating earnings of $312 million with a 13.3% operating margin. Operating earnings up $50 million more, up 19.1% on higher revenue and a 60 basis point improvement in margins. The first point and perspective since the end of the third quarter of 2021, Aerospace total backlog has grown $4,362 billion, to reach a very robust $19.1 billion. On a sequential basis, Combat Systems revenue is up $122 million or 7.3%, while operating earnings are up a very significant 10.6% on a 50 basis point improvement in operating margin. Revenue of $2.8 billion is up $132 million, 5% over the year ago quarter. Operating earnings are $238 million in the quarter, up $9 million or 3.9% on operating margins of 8.6%. This segment has revenue of $3.71 billion in the quarter, down $49 million from the year ago quarter or 1.6%. Operating earnings of $285 million are down $42 million or 12.8% on a 120 basis point reduction in operating margin, exclusively attributed to Mission Systems and largely related to the issues impacting revenue. This brings us to $3.9 billion of operating cash flow through the first 9 months of the year, which also includes the ongoing collections on our large international combat vehicle contract according to the contract restructure that occurred back in 2020. Including capital expenditures, our free cash flow was just over $1 billion for the quarter and $3.3 billion year-to-date, yielding a conversion rate of 137% through the first 9 months. For the first 9 months, we're at 2.2% of sales, but 2.5% remains our full year target, so obviously an implied uptick in capital investments in the fourth quarter. We also paid $345 million in dividends during the quarter, bringing the total deployed in dividends and share repurchases through the first 9 months to just over $2.1 billion. The net result at the end of the third quarter was a cash balance of $2.5 billion and a net debt position just under $9 billion, down over $1.5 billion from this time last year. At this point, we continue to expect our interest expense for the year to be approximately $380 million, including the assumed repayment of $1 billion of notes that mature in the fourth quarter. The increase in backlog was particularly notable given a headwind from foreign exchange rate fluctuations of approximately $275 million in the quarter and $650 million year-to-date, with the vast majority of the impact in Combat Systems. Incidentally, the FX fluctuations also negatively impacted Combats revenue by $55 million in the quarter and $123 million in the first 9 months of the year due to the surging dollar versus the euro and the British pound. I know that there's the $1 billion maturity coming in November, but curious maybe, Phebe, how you're thinking about capital deployment in a broader sense, obviously, cash flow coming in ahead of expectations. So I think as David asked earlier in terms of impacts to aerospace in the quarter, you saw the nice margin improvement, frankly, even a little bit ahead of where we were expecting, which is why as Phebe alluded, we think we'll -- the group perform better for the full year."
}