{
    "symbol": "ISSC",
    "quarter": 3,
    "year": 2022,
    "date": "2022-08-12 17:12:09",
    "content": " I would remind our listeners that certain matters discussed in the conference call today, including new products and operational and financial results for future periods and forward-looking statements that are subject to risks and uncertainties that could cause actual results to differ materially, either better or worse from those discussed, including other risks and uncertainties reflected in our company's 10-K, which is on file with the SEC and other public filings. In the third quarter, we continued our steady growth with revenues up 12% and operating income up 41%, ending the quarter with over $14 million of cash and no debt. As this installed base grows, it creates opportunities in adjacent markets, while also delivering a steady demand for customer service, which is now running at approximately $1 million per quarter. For the third quarter, revenues were $6.9 million, up 12% from $6.2 million a year ago. Growth was primarily attributable to continued strength in the sales of flat panel displays for retrofit programs to commercial air transport customers, as well as Autothrottle sales to the general aviation market, especially Pilatus under the company's PC-24 contract. Finally, we generated over $1.3 million in customer service revenues this quarter, as a result of a growing portfolio of installed IS&S products. Total operating expenses for the third quarter of fiscal 2022, were $2.4 million up from $2.2 million in the same quarter a year ago. Net income for the quarter was $1.4 million or $0.08 per share compared to $2.7 million or $0.16 per share a year ago, which included a $1.5 million tax benefit. For the third quarter of 2022, we recorded $359,000 in taxes where in a year ago, we had a $1.5 million tax benefit due to the reversal of a deferred tax asset valuation allowance. We generated $3 million of operating cash in the third quarter and $6.4 million, over the first nine months of fiscal year 2022. Well I appreciate the sentiment that you expressed, but the difference between the cash on the balance sheet and what you say you need to run the enterprise on an ongoing basis is a considerable margin for an entity that's generating something in the order of $30 million a year in sales. Like from organic growth, I mean, it seems to me add one point, when you had other products and it was quite a different business that you were for example generating $60 million in revenue or whatever."
}