{
    "symbol": "ISSC",
    "quarter": 4,
    "year": 2022,
    "date": "2022-12-14 17:34:01",
    "content": "  Operator: Greetings and welcome to the Innovative Solutions and Support, Inc. Fourth Quarter and Fiscal Year 2022 Earnings Conference Call. I would remind our listeners that certain matters discussed in the conference call today, including information about new products and operational and financial results for future periods are forward-looking statements that are subject to risks and uncertainties that could cause actual results to differ materially, either better or worse from those discussed, including other risks and uncertainties reflected in our company's 10-K, which is on file with the SEC and other public filings. Fiscal 2022 marked a strong year of financial performance, revenues up 20.4% with 27.7 million compared to fiscal 2021. We increased gross profit to 60.7 million in 2022, an increase of over 30%, compared to fiscal 2021. For the full-year, operating expenses achieved leverage with a decrease as a percent of sales 34.1% in 2022, compared to 38.5% in 2021. As a result fiscal 2023, we anticipate our total R&D spend to approximate 13% of sales as compared to around 10% in fiscal year 2022. To conclude, we believe that our performance in fiscal 2022 capture top line growth and demonstrated the strong operating leverage opportunity in our business. Revenues increased 5.7% to 7.3 million in the fourth quarter, compared to 6.9 million in the fourth quarter a year ago. New orders in the fourth quarter were approximately 6.5 million in backlog as of September 30, 2022 was 11.8 million. Fourth quarter gross margin expanded by almost 400 basis points to 61.5%, compared to last year. Total operating expense were 2.2 million in the fourth quarter, compared to 2.1 in the prior year fourth quarter. Fourth quarter net income was 1.6 million or $0.09 per share, compared to 1.5 million or $0.09 per share in the fourth quarter of fiscal 2021. Net income for fiscal 2022 reached another record of 5.5 million or $0.32 per share, compared to 5.1 million, or $0.29 per share, in fiscal 2021. Not that profitability in fiscal 2022 exceeded fiscal 2021, which at that point in time was our most profitable year in more than a decade. As we highlighted during our fiscal 2021 financial results, net income was aided by a $1.1 million tax benefit from the release of deferred tax valuation allowances in the third quarter of fiscal 2021. There was no such corresponding benefit in fiscal 2022, which coupled with the tax expense of 1.8 million, drove a net income differential of 2.9 million from 2021 to 2022. On a GAAP basis, full-year net income was 5.5 million or $0.32 per diluted share, compared to 5.1 million or $0.29 per diluted share. Net income would have been 5.6 million or $0.32 per diluted share, compared to 3.1 or $0.18 per diluted share a year ago with a normalized tax rate. Looking forward to fiscal 2023, we anticipate that operating cash flow and cash on hand will reflect the payment of taxes, our continued investment in engineering development, both R&D and engineering development contract programs, as well as capitalizing on potential inorganic opportunities."
}