{
    "symbol": "SWX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 17:43:07",
    "content": " We announced the close of the MountainWest South Williams on February 14, 2023, and with the $1.1 billion in net proceeds going towards debt reduction at Southwest Gas Holdings, creating more flexibility with our balance sheet and financing needs. Depreciation and amortization alone increased by nearly $10 million from the prior year due to increases in average gas plant and service, which includes pipeline capacity reinforcement, pipe replacement work, franchise requirements and new infrastructure. The past year, Centuri experienced considerable cost headwinds from high inflation and fuel costs as well as customer supply chain challenges stemming from equipment delays with expenses increasing $574 million over the prior period. With Southwest Gas Corporation, we plan to continue to make considerable investments in CapEx of roughly $665 million to $685 million per year through at least 2025 to support infrastructure development and system improvements for our growing customer base. And then just with respect to overall interest cost at the utility, I think it's as we had planned the year, we had anticipated pushing down about $250 million from Southwest Holdings to Southwest Gas that did not happen. So that's going to be a primary driver I think as Justin alluded to, we're bringing in a consultant that's going to look at the overall cost structure just in the context of the utility but also at the holdings level given the go-forward plan with respect to Century, we will continue and obviously, you can appreciate this as we embark on executing on the Century spend, which we're laser-focused on now, we're going to incur expenses associated with that. So when -- and then I think you answered it in response to Ryan's question, but basically, as part of the spin and the reduction -- the deleveraging at Century, one of the options could be to put maybe an additional $300 million of Hold Co debt on the pro forma Southwest Gas company."
}