{
    "symbol": "CM",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-24 12:21:06",
    "content": " On today's call, I'll provide an overview of our first quarter results as well as an update on our strategy for successfully navigating the current economic environment with a clear path forward to achieving our 2025 objectives and targets that we laid out at our Investor Day last year. We also continue to invest in our future growth differentiators, including our Direct Financial Services platform, which has delivered 3-year revenue CAGR of approximately 15% with revenues over $1 billion for the last 12 months. Record revenues of $5.9 billion and pre-provision pretax earnings of $2.7 billion were up 8% and 6%, respectively, from a year ago, benefiting from balance sheet growth across our business, higher interest rates and strong trading activity. Non-interest income of $2.7 billion was up 15% from the prior year, supported by growth in trading income, which was particularly strong this quarter and is expected to moderate. Revenues of $1.4 billion were up 4% from a year ago, benefiting from strong results in Commercial Banking, partially offset by market headwinds, which impacted our Wealth Management business. Slide 15 shows U.S. Commercial Banking and Wealth Management results in U.S. dollars, where we delivered net income of $159 million, down 15% from the prior year due to higher credit provisions. Strong loan growth of 12%, deposit growth of 4% and expanded margins supported the higher net interest income, while in our wealth business, particularly strong annual performance fees, somewhat offset the negative impact of market appreciation. Revenues of $129 million were up 23% from a year ago, driven by the impact of higher margins and FX translation on our international banking business, partly offset by lower income and treasury. Thank you, very much. Thank you, very much. We're assuming the mortgages in Canada -- what we're seeing is good positive momentum and the new commitments in terms of margins more towards normal, not quite back to normal, but we're assuming, again, conservatively, we don't quite get back to normal, but it's better than what it was maybe last year. So what's happening here is we're focusing on executing on the strategy we've laid out for a number of years, and the investments in our platform are really allowing us to deliver results in the most difficult of times for our clients or the most challenging times."
}