{
    "symbol": "BGRY",
    "quarter": 2,
    "year": 2022,
    "date": "2022-08-13 15:29:06",
    "content": "  Operator: Good morning, and welcome to the Berkshire Grey Q2 2022 Earnings Conference Call. Good morning, everybody, and thank you for joining Berkshire Grey's Second Quarter 2022 Earnings Conference Call. Leading today's discussion will be Berkshire Grey's Founder and Chief Executive Officer, Tom Wagner; and our Chief Financial Officer, Mark Fidler. Following management's prepared remarks, we will open up the call to questions. Before we get started, we would like to inform you that certain statements made during this conference call may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act. As a reminder, we will be referring to some non-GAAP financial measures during today's call. A detailed reconciliation of GAAP and non-GAAP measures can be found in our earnings press release today, which will be furnished to the SEC and is available now on our IR website. Today, Mark and I are going to update you on our quarterly performance, our operational execution, our long-term strategic alignment with customers and the continued favorable macro environment driving the need for automation. First, let's talk about the quarter. In the second quarter, we delivered revenue of over $23 million, growth of almost $19 million year-over-year and well ahead of expectations. Through July, we secured $23 million in new orders this year, of which approximately $20 million were secured since our last earnings call. We've made good progress with winning new orders and expect more to come in the second half, which is consistent with what we've shared previously. During the second quarter, we actively deployed our solutions with 8 customers across 16 sites throughout the United States and Canada. In fact, most of the orders we received this year are follow-on orders with existing customers. Our deployment teams are executing and our technology continues to exceed customer expectations, which is important for us to meet our growth goals. Continuing the execution theme, we're making progress on improving products' margins. Mark will provide more color shortly, but we have achieved cost improvements for all of our products, which will be realized for deployments in 2023. Now I'd like to discuss the strategic matter involving one of our major customers, FedEx. As many of you know, we've been deploying our RPSi solution at FedEx sites for a couple of years now. The RPSi solution, which stands for Robotic, Product, Sortation and Identification, takes in small packages like those produced by e-commerce. And with one system, singulates, scans and sorts these items, so they can make their way through the FedEx network. Based on the success of RPSi last year, we have also secured orders for other BG technology solutions within different operating units at FedEx. Due to our technology and execution, we built a foundation of trust and partnership with FedEx. First, we secured an order from FedEx to develop a new AI robotic automation solution to help improve the efficiency of their package handling operations globally. Most importantly, the new system will address a significant need as we believe there is no other solution available today to automate this process. Once the initial development program is complete, we expect it will lead to additional commercial orders. Further, the solution can be sold to many others since it addresses an issue that is commonplace for retailers and logistics companies alike. So by doing this work with FedEx, we build on our relationship and create a new differentiated solution for them, while expanding our market opportunity over the long term. Because this arrangement is very strategic in nature, we also entered into an agreement to grant FedEx a warrant to purchase Berkshire Grey common stock. Specifically, Berkshire Grey has granted FedEx a warrant to purchase approximately 25 million shares of our common stock, which vests incrementally. The full vesting of all 25 million shares occurs upon the ordering of or payment for at least $200 million of our goods and services prior to December 31, 2025. Finally, last week, we also announced that we and FedEx intend to finalize the master system purchase agreement this year, which will streamline and expedite the procurement process for Berkshire Grey solutions across all FedEx operating companies globally. As evidence of the importance of our relationship to FedEx, John Smith, CEO of FedEx Ground, commented about our announcement on LinkedIn stating FedEx announced it's extending its strategic partnership with Berkshire Grey to develop extensive AI robotic automation solutions throughout all stages of the global supply chain. We also went on to state I'm especially excited to continue the work that initially began at FedEx Ground, integrating robotics into our operations to safely and effectively sort the increasing number of small packages entering our network through e-commerce. John's commentary underscores the value of Berkshire Grey at their organization, and we're delighted with the strong relationship between our companies. As we stated on our last earnings call, one of our goals is to build on our success of repeat orders with customers and move our customers into long-term strategic relationships. The agreements with FedEx certainly marked progress in achieving that goal, and we continue to work on others. As we've described, we made industry-leading AI-enabled robotic systems to fulfill e-commerce and retail orders and handle e-commerce packages as they make their way to your door. In fact, one customer recently commented that they were able to more than triple their productivity per square foot by implementing BG and their distribution centers. We, as consumers, demand fast fulfillment of orders, fast and efficient shipping and if we go to a retail store, we want to find the items we're looking for in the store. Now when it comes to competitive advantage for our customers, recall nearly every retailer and e-commerce company competes for consumer dollars. Our automation allows our customers to redeploy existing employees to perform higher value-add functions, which further improves operational costs, particularly when inflationary pressures persist. As such, our commercial teams are busy as ever, working with existing customers and prospects to offer real solutions to real problems. In summary, we're delighted with our Q2 revenue growth, recent orders and our strategic agreements with FedEx. Revenue for the quarter was $23 million, an increase of over 400% year-over-year and well ahead of consensus estimates. And since we've become more efficient with our deployment processes as we've installed more systems, we've been able to realize revenue on some projects sooner than anticipated. Since our last earnings call, we secured new orders of $20 million through July, including the new order from FedEx that Tom talked about as well as orders from other customers. Clearly, we're excited about the overall strategic relationship we've established with FedEx and the growth opportunity it represents. Our backlog is approximately $100 million, including the order we received in July. So far this year, most of the orders represent follow-on orders from existing customers. Our commercial teams continue to be very busy actively engaged with existing customers and new prospects, and we expect orders in the second half to be higher than the first half as previously communicated. First, our mature products, which were already generating positive margins are improving further as we realize efficiencies with each new deployment. Second, we're making excellent progress on all of our product cost reduction initiatives. As you'll recall, one of our new products we announced late last year realized negative margins, which impacted overall gross margins last year and this year. We recently implemented several design changes and improved deployment times that will result in lowering this product's overall cost by 10% so far and we expect further improvements this year as well, which will all be in place for deployments for next year. Another example relates to our most recently released product, which is being deployed for the first time this year. We have already implemented design changes and have improved deployment time substantially, which will reduce costs by over 20% for those systems to be deployed next year. We continue to make progress reducing the cost of all of our products, and we're encouraged by our efforts to date. Finally, we've been raising prices for future orders for many of our products, which will also help bolster margins as well. While overall gross margin is still expected to be slightly negative for 2022, we're on plan to achieve overall positive gross margin in 2023 and beyond, and we remain confident in our ability to achieve our run rate operating metrics of approximately 50% gross margin in the long term. Total OpEx for the quarter was $28.5 million, excluding stock-based compensation. We expect all of these initiatives will reduce our annualized cash burn by about $20 million, and we will start to see that benefit toward the end of the third quarter. Adjusted EBITDA, which is defined as loss from operations adjusted primarily for depreciation, stock comp expense and changes in the fair value of warrants was negative $30.3 million in the second quarter, a modest improvement from Q1. On the balance sheet, we ended the quarter with over $108 million of cash and no debt. As mentioned since our last call, we secured $20 million in orders. And with the July orders, we have a backlog of $100 million, providing good visibility for revenue. Included in that backlog is the remaining deployment of a large system with Target, one of our strategic customers. We have been working with them over the last several months to expand the scope of our project, which has the potential to increase our opportunity with them, not just on this existing project, but for new facilities as well. As a result of these discussions, the current project schedule has shifted, which will have a short-term impact on revenue this year, but has the potential to increase our overall opportunity with them next year and in the future. As such, we're updating our revenue forecast for 2022 to be between $70 million and $80 million. Our technology is proven, in production and driving tangible ROI for Fortune 100 customers. And our backlog, combined with our growing pipeline provides us with either greater conviction about our long-term growth prospects. The -- when it comes to Target, you're aware, they've deployed our technology. We are in discussions with them on a change in scope, which means the deployment could be larger long term, but it's not expected to deliver revenue this year as originally anticipated. And I would add for sort of the long term, Target was -- has been a very strategic customer for us. The fact that we've done projects with them already, we've proven the technology with them. From a growth perspective for some of our partnerships, and we have named partners, for instance, like Swisslog, they have their own go-to-market engine, their own customer base where they have established relationships. And for relationships that are like that with Swisslog, then we will do go-to-market sharing and do pursuit and help customers together as a joint activity. Some of these other partnerships, though also include things like systems integrators, who are helping us to install systems and make them operational and so forth in a cost-effective fashion. Generally, there's an element of go-to-market in many of those and in an element of efficiently deploy solutions in those and then technology-centric relationships as well like ABB. Well, I guess, let's say, cash saving initiatives, I think, to the tune of $20 million annualized reduction to your annual cash burn. You're at $108 million cash, no debt. We do expect that we still need to raise capital in order to fully execute our business plan, and we remain confident that when the time comes for us to do that, that we'll be able to do so. I guess, starting with the Target news, I'm curious in terms of the change there with the scope. So again, if I go -- if we go back to what I said before, which is we've deployed systems with Target, they can see what our -- they see what the technology can do. They see what our capabilities are as they look to see what the needs are within their, not only in the existing facility, in which we're currently deploying, but also with facilities into the future, they're seeing what we could do for them. And by the way, it's not just with Target that we're doing this, we're doing this with all of our customers with whom we've been working with and had repeat deployments with. As we deploy, and we are very successful with the deployments, the customers are actually seeing the benefit. They're ordering more as evidenced by all the orders that we've had this year so far, almost all of them were repeat orders. We're going to continue to work towards -- with all of our strategic customers and other customers towards these sort of long-term relationships, whether they're through master purchase agreements or multiple facility rollouts, that's the goal with all of them. It sounds like it's not just logistics, but it's maybe it's applicable to your entire customer base. Once it's deployed, we expect that FedEx will be eagerly consuming it as well as it is marketable and addressable to everybody else, who does retail and e-com. The other pieces that we publicly shared is the intent to execute the master system purchase agreement and the warrants and so forth, along with the $200 million in goods and services prior to December 31, 2025, in order to enable those fully. Well, so yes, of course, the number is -- we expect to be much greater over the long term with FedEx. The way that we've structured the vesting schedule for those -- for the warrants is based on a $200 million sort of expectation, that's what's going to be purchased by the end of 2025. So for at least the next couple of years or so, it's going to be the existing products that will be sort of credited towards that, if you would. As I mentioned, we expect to realize revenue under that arrangement over the next 12 months or so. Just want to confirm that your growth trajectory is, in fact, somewhat different from the rest of the industry given the nature of what you're doing. Andrew, we haven't really heard our customers pausing on their automation plans. The customers all have that pressure, which is they have to become more efficient and reduce operating costs. It seems like well over 18 months -- 18, 24 months to implement something meaningful. Labor costs continue to hit multi-decade high, probably -- you need more automation, probably more picking product, yet there's this natural delay as to how these organizations implement these large-scale solutions and changes to how they do business. If I understand your question, Andrew, I think, yes, the inflationary pressures from -- due to labor as well as labor shortages have really -- we've seen what it's been doing to the bottom line for a lot of these businesses in the industry. And while it does take time for them to plan, particularly on a large scale, the rollout of the technology from what we've seen, they're still doing that. What we've recently sort of signed with FedEx and not just the products that we're selling to them now, but addressing a real problem, a real need of theirs. The repeat orders that we're getting from really all of our customers, including strategics. I think those are the kind of the proof points that they're still feeling the pressures that we've been talking about for a couple of years now, even before COVID. So these are the kinds of things, and they're all thinking big. And it takes time to plan these things out as we see in like with what we're talking with Target, but we haven't seen a pause, and so we expect that things will continue to accelerate over time. And then for next year, as the scope of the project, it seems like there is a chance that it will increase materially. We typically have favorable payment terms from our customers, Target included where we're receiving significant upfront payments, sometimes on the order of 30% to 50% of the total project can be paid upfront. At this time, I would like to turn the conference back over to Tom Wagner for any closing remarks."
}