{
    "symbol": "FBK",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-18 12:59:10",
    "content": " That number is higher than the $63.8 million to $64.3 million that we guided to for the quarter as we accelerated a few of our internal projects geared towards organizational efficiency into the third and fourth quarters as we expect continued growth in our banking segment non-interest expenses due to inflationary pressures on wages, and we continue to hire customer-facing and back office talent. But going back to what Michael was talking about on that mark to market, you have to mark your mortgage loans held for sale, and so if you go back to the third quarter of last year, we had $750 million in mortgage loans held for sale; end of this quarter, we had $97 million, and so if you think about that reduction in what youâ\u0080\u0099re marking and you have to step that down, which weâ\u0080\u0099ve had to step down over the last four quarters, and so--and thatâ\u0080\u0099s down to $97 million at this point, so it canâ\u0080\u0099t drop that much further from there. Itâ\u0080\u0099s the same way with some of these associates - weâ\u0080\u0099ve hired a lot of--weâ\u0080\u0099re looking at revenue producers across our footprint, but in addition to that, the bank--First Bank, if you go back to 2000, it was about a--Iâ\u0080\u0099m sorry, in 2020, it was about a $6 billion institution, and then if you look at 2022, itâ\u0080\u0099s a $12 billion institution, so weâ\u0080\u0099ve also gotten opportunity on the operations side, on the risk management side, even places--especially in Birmingham, weâ\u0080\u0099ve really grown our operational muscle and our administrative muscle in Birmingham through some disruption down there, and weâ\u0080\u0099ve even--you know, our Chief Risk Officer came to us from Texas. We still expect, I guess relative to the last three quarters, modest loan growth over the next couple quarters, so youâ\u0080\u0099ll still see some balance sheet growth, and deposit costs, as I say, itâ\u0080\u0099s the change, right, itâ\u0080\u0099s going to increase but I still think that thereâ\u0080\u0099s net interest income expansion in that for sure. We feel certainly that the economy is going to be slower, likely even a recession, but that being the case, we look around and go, well, our markets continue to outperform and will likely continue to outperform in a recession, so we put all those things into the mix and consider them all, and thatâ\u0080\u0099s what weâ\u0080\u0099ve come up with, is weâ\u0080\u0099re going to be on the low side of that 10% to 12%, maybe even below."
}