{
    "symbol": "FBK",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-17 12:41:02",
    "content": " But we also think that especially in the last half of the year, you begin to see balances leave those and we think that that a lot of the â\u0080\u0093 I guess, I call it the low hanging fruit for â\u0080\u0093 that you knew would likely be leaving probably left in the fourth quarter or I'd say in the second half of the year, but I'm also qualifying that by saying we're not sure to be honest with you. And so, obviously, we had a big deposit quarter and it was expensive and we expected it to be especially as we get deeper in, but if you look at where we were headed from a loan to deposit ratio in, sort of the way that our   trending with three quarters and 20% plus loan growth and knowing that deposit growth is going to get difficult. And if that's coming at still an incremental 4%-ish margin just given your kind of December NIM guide and the difference in your deposit costs and new loan yields, I mean, that 6% to 7% expense growth is still coming with NII growth in 2023. And one of the things I tell them is, hey, you joined First Bank, you need to feel like you â\u0080\u0093 and some people by the way would really like this analogy and some people are envious of it, but Iâ\u0080\u0099d say you need to feel like you just signed a scholarship with University of Alabama to play football because we go to â\u0080\u0093 that's exactly what â\u0080\u0093 Iâ\u0080\u0099d say, we compete for the national championship every year. And then going forward, you expect â\u0080\u0093 it's put you in a position that now you're expecting more deposit loan growth to be, kind of in-line and thus keeping the loan-to-deposit ratio roughly where it is. So, as we move forward with our budget and look at â\u0080\u0093 into the year â\u0080\u0093 we've traditionally said, we'd be 10% to 12% loan growth organically, and for the year, we could be a little less than that, but we certainly anticipate a healthy â\u0080\u0093 some healthy loan growth during the year. And then one other thing, I haven't talked about this in a long time, back when we â\u0080\u0093 going back three or four years ago, we used to talk about it all the time, our balance sheet is almost 100% direct customer funding and direct customer loans. And so, while I think that's probably a bigger â\u0080\u0093 a concern for the industry, and I say all the time, every bank thinks their credit is great, and they're not going to be the ones. And we were comfortable with that even though we've tried to be absolutely as conservative as we could be in managing the loan portfolio and in managing that ACL, and we've kept it at â\u0080\u0093 it's still at 1.44% of loans held for investment, which we, again, find to be quite high actually in terms of â\u0080\u0093 if you look at it relative to loss experience."
}