{
    "symbol": "AUVI",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-24 11:47:05",
    "content": " Net sales of approximately $3.3 million, representing an increase of $1 million or 45.1%, for the three months ended March 31, 2022, as compared to net sales of approximately $2.3 million  to the disinfection segment, which increased $1.2 billion, largely as a result of the strategic acquisitions of KES Science in Q3 and Q4 of 2021 respectively. Gross profit increased approximately $225,000 or 24.3%, for the three months ended March 31, 2022, as compared to the three months ended March 31, 2021, driven primarily by volume growth from the disinfection segment. SG&A costs for the three months ended March 31, 2022, increased to approximately $3.1 million as compared to $1.6 million for the three months ended March 31, 2021. This increase of approximately $1.4 million was driven primarily by the expansion of total equity  increased $0.3 million year-over-year as headcount increased from 31 at March 31, 2021 to 89 at March 31, 2022. During the quarter ended March 31, 2022, the company's determined that a triggering event had occurred as a result of a settlement agreement with Scientific Air, a quantitative impairment test on goodwill determined that the fair value was below the carrying value. And as a result, the company recorded a full goodwill impairment charge of approximately $1.1 million on the condensed consolidated statements of operations during the three months ended March 31, 2022. Also as a result of this settlement agreement, the previous owners of Scientific Air agreed to  shares that were part of the original  2022 the company recorded a loss on change in fair market value of restoration of  result of the settlement agreement, the company recorded a gain on the settlement of contingent consideration of $1.7 million. The company recorded a net loss of approximately $1.6 million for the three months ended March 31, 2022, compared to a net loss of approximately $1 million for the three months ended March 3120 21. On a non-GAAP  EBITDA was a loss of approximately $1.2 million for the three months ended March 31, 20 2, which was an increase of approximately $0.8 million as compared to the three months ended March 31, 2021."
}