{
    "symbol": "TBI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-01 21:45:27",
    "content": " If you recall In the fourth quarter of 2021, PeopleReady benefited from a demand surge across the business, as our customers found themselves in desperate need for labor during the peak of a post-COVID recovery creating a year-over-year headwind this year. The remaining decline of two points reflects PeopleReady's underlying revenue trend for the quarter, which was roughly in line with the total revenue decline for this business unit in Q3 2022. And so, we're really trying to look at managing this business to maximize the amount of profit over complete economic cycle and with where labor conditions are and the tightness of the labor pool that's not just for our customers, it's for us too. It's sold face-to-face, things happens service-wise that need adjustments, we need good people that know our business, know our technology, know our processes and most importantly, our customers' needs change through the year. The underlying trends still hold are holding up quite steady our PeopleManagement business was low single digit in growth in the fourth quarter that held on a monthly basis going in the first quarter, though, we're seeing some softening there. Now the PeopleScout business in and of itself is a little bit more lumpy because the revenue per customer is - the proportions to the total revenues is a higher, there's not near as many customers there as there is in, say, a PeopleReady business, so it can be lumpy at times, but I wouldn't - I'd be really surprised to see that kind of revenue decline again on a year-over-year basis. So we're seeing a surge in some of our shorter-term offerings like recruiter on demand and some project RPO work where we're able to support our customers rapidly with their needs now, while they sort through what their hiring volumes are going to be for the long term. We're expecting the revenue decline in Q1 for the PeopleScout business to be pretty close to what we had this quarter, albeit from a different path."
}