{
    "symbol": "CBT",
    "quarter": 1,
    "year": 2023,
    "date": "2023-02-10 10:58:02",
    "content": " In the first fiscal quarter, we delivered adjusted earnings per share of $0.98, despite significant headwinds, including lower demand in China due to significant levels of COVID outbreak, elevated levels of customer destocking across most value chains and softness in key end markets in Performance Chemicals. Adjusted earnings per share for the first quarter of fiscal 2023 was $0.98 and compared to $1.29 in the first quarter of fiscal '22, with growth in the Reinforcement Materials segment offset by declines in the Performance Chemicals segment. The increase was driven by improved unit margins from higher pricing and product mix in our 2022 calendar year customer agreements, partially offset by 5% lower volumes and a $5 million unfavorable foreign currency impact in the quarter. Looking to the second quarter of fiscal 2023, we expect the Reinforcement Materials EBIT to improve both year-over-year and sequentially due to the outcome of our calendar year 2023 customer agreements. Volumes in our specialty carbons and compounds and fumed oxide  product lines declined by 10% to 15%, largely due to elevated levels of year-end destocking, softness in key end markets and the impact from the COVID-19 outbreak in China. Fixed costs increased by $8 million in the quarter driven by our new capacity adds, including the new specialty carbons plant in Xuzhou, China and the newly acquired plant for Battery Materials in Tianjin, China. However, we expect volumes to continue to be lower on a year-over-year basis in the second quarter largely due to lingering effects from the COVID outbreaks in China, partially offset by another strong quarter of volume growth in Battery Materials. As we move to the second half of the year, we expect volumes across our larger product lines to continue to improve each quarter with the second half of fiscal 2023 back to more normalized levels."
}