{
    "symbol": "BKU",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 14:56:10",
    "content": " I would now like to turn the call over to your host, Susan Greenfield, Corporate Secretary. Good morning, and thank you for joining us today on our third quarter 2022 results conference call. Before we start, Iâ\u0080\u0099d like to remind everyone that this call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that reflect the companyâ\u0080\u0099s current views with respect to, among other things, future events and financial performance. Any forward-looking statements made during this call are based on the historical performance of the company and its subsidiaries, or on the companyâ\u0080\u0099s current plans, estimates and expectations. The inclusion of this forward-looking information should not be regarded as a representation by the company that the future plans, estimates or expectations contemplated by the company will be achieved. Such forward-looking statements are subject to various risks and uncertainties and assumptions, including without limitations, those relating to the companyâ\u0080\u0099s operations, financial results, financial condition, business prospects, growth strategy and liquidity, including as impacted by external circumstances outside the companyâ\u0080\u0099s direct control. The company does not undertake any obligation to publicly update or review any forward-looking statements, whether as a result of new information, future developments, or otherwise. Information on these factors can be found in the companyâ\u0080\u0099s annual report on Form 10-K for the year ended December 31, 2021, and any subsequent quarterly report on Form 10-Q, or current report on Form 8-K, which are available at the SECâ\u0080\u0099s website, www.sec.gov. Net income came in at $87.9 million or $1.12 per share, like  37% increase in EPS, ROE came in at 13.5%, weâ\u0080\u0099re very happy with those results. This growth in earnings really driven because of NIM expansion, Iâ\u0080\u0099d like to remind everyone that weâ\u0080\u0099re not very asset-sensitive or little asset-sensitive. But, I think, weâ\u0080\u0099re writing business at better margins, which is helping. So our margin expanded by 13 basis points compared to last quarter were  this quarter, last quarter, we were at 2.63%. And if I remember well, third quarter of last year, we were at 2.33%, so nice trajectory there. This was pushed partially offset by declines in mortgage warehouse, which is a slight decline in Pinnacle and Bridge as well. Consistent with similar trends at the Fed tightening, deposits declined by $1.1 billion. Our non-interest DDA declined by $851 million, but NIDDA now it still stands up 32% of total deposits. Iâ\u0080\u0099d like to remind everyone that this journey of building NIDDA, which is like 5 years in the making now, when we started on this journey, which was letâ\u0080\u0099s say going back in 2017, our DDA balances were just 14% of our total deposits. Even before the pandemic, which was, letâ\u0080\u0099s say the end of 2019, we were only at about 17.5% and today weâ\u0080\u0099re at 32%. Weâ\u0080\u0099ll talk a little more time will get into the details of where just coming from a large part about, half of it is coming from one particular business line, and Tom will shed some more light on that. But despite that for this year for 2022, if you stick like a 9-month view, NIDDA is down by $182 million, because in the first part of the year we were growing NIDDA this quarter we shrunk. I think last quarter unless we were at 30 basis points, so 30 to 78 basis points now. Really quick, the last week of this quarter, we were hit by Hurricane Ian, happy to report that there was no significant damage to our facilities, our people are all safe. So far, the information that weâ\u0080\u0099ve compiled, we donâ\u0080\u0099t expect a material impact on credit. Having said that, we did put $5 million into our provision just in case as the next few days and weeks roll on, we might have a credit here. Therefore, that purposes we did take a $5 million provision thatâ\u0080\u0099s included in our numbers. Weâ\u0080\u0099re looking very hard during every walk around to find any issues that they might be out there, because as the economy is slowing, itâ\u0080\u0099s natural to be very, very careful. This quarter also, it was a very healthy decline of $175 million. Excluding the guarantee portion of our SBA loans, the NPA ratios stood at 32 basis points, which is a very small uptick from prior quarter. And annualized net charge offs for the 9 months, not this quarter, this quarter was very low, but for the 9 months stood at 16 basis points that compared to 0.9 basis points of net charge-offs for last year. As you already know, the Board did authorize another $150 million buyback, sometime mid-September, we have executed about $11 million of that already through the end of the quarter, and weâ\u0080\u0099ll continue to judiciously execute on that as time goes on. So if you take all the buybacks that weâ\u0080\u0099ve done so far through the end of September, I think the number comes to about $337 million. In terms of quickly updating the guidance that weâ\u0080\u0099ve given you, we expect loan growth for the year to come out at about mid-single-digits, driven again by C&I and CRE. By the way, CRE was a positive quarter, which is â\u0080\u0093 we have not said that now in many, many quarters. So we finally have â\u0080\u0093 itâ\u0080\u0099s not a very big positive, but it is a positive quarter and we were very happy about that weâ\u0080\u0099re now sort of inflected onto the other side of nice  growing CRE. C&I still will be the largest driver of growth, C&Iâ\u0080\u0099s small business, middle market lending, all doing well, my clients are very healthy. In terms of deposits, I think deposits, this will be a challenging environment, I expect deposits this coming quarter to be under pressure, somewhat both NIDDA and total deposits. Weâ\u0080\u0099re expecting another 75 basis points here in a few days, and then another move in December. So having said that margin, overall should still â\u0080\u0093 weâ\u0080\u0099re still positively biased when it comes to margin. Overall, we still think there is a room for margin expansion in the fourth quarter. In terms of, overall, I usually actually start with this talking about, what is seeing the economy. My comments will be very similar to what I said last quarter, which is that weâ\u0080\u0099re cautiously optimistic. Weâ\u0080\u0099re looking very hard to see if there are any cracks appearing anywhere, but weâ\u0080\u0099re not finding that. Weâ\u0080\u0099re talking to smaller banks, bigger banks, non-banks. Weâ\u0080\u0099re trying to see where trouble will emerge, but weâ\u0080\u0099re not seeing it yet. Having said that, weâ\u0080\u0099re not sitting and assuming that everything will be fine, we are taking a view that long-term, there will be a significant slowdown. And sometime next year, we just have to be careful. So we are on the scale of that 1 to 10 that I described on the call last quarter, we say about the same way we were around the six in terms of cautiousness and optimism, and weâ\u0080\u0099ll keep revising it as more data comes along. But, Florida is doing very well and weâ\u0080\u0099re very thankful that the Hurricane missed us for the most part. So driving a little bit more into the loan number, as Raj said, of course C&I and CRE segments grew by $444 million for the quarter with $375 million coming from C&I and $69 million coming from CRE. It was the first CRE increase, as Raj said, that weâ\u0080\u0099ve had, in quite some time, we were happy with it. On the C&I side, itâ\u0080\u0099s kind of a continuation of what we have seen all year long, which is strong growth and commitments. And pretty broadly based across all industry sectors, if they look at some of the supplemental information that Leslieâ\u0080\u0099s provided, and you look kind of industry by industry, itâ\u0080\u0099s pretty broadly based across 6 or 7 major industries, the largest ones that we have exposure to so we were happy with that growth for the quarter again. In CRE segment, the largest growth that we had was in the industrial area, which is an area that we have been focusing on increasing our industrial portfolio, we say $9 million of growth in the industrial base. We did have â\u0080\u0093 we thought it would be just slightly better, but we did have a few loan closings, they got delayed at the very end of the quarter in Florida due to the impact of Ian that pushed into the fourth quarter. On the mortgage warehouse side, as Raj said, they declined by $194 million at pretty historic low utilization rates in response to the macroeconomic environment, around the residential real estate business. Itâ\u0080\u0099s a cyclical business, we recognize that. Thereâ\u0080\u0099s been no deterioration in the client base, but we canâ\u0080\u0099t outrun the cycle right now in that business. In the aggregate, we saw a runoff of $77 million in Pinnacle and Bridge, we continue to â\u0080\u0093 struggle to find the right profitability opportunities and margin opportunities in that business. Weâ\u0080\u0099re being selective in those segments, to make sure that theyâ\u0080\u0099re profitable for us and help us and what weâ\u0080\u0099re trying to accomplish. As we look forward into this quarter, C&I and CRE pipelines, look strong, weâ\u0080\u0099re already seeing good growth in the quarter. So, overall, Iâ\u0080\u0099m optimistic about kind of core growth in those markets heading into the fourth quarter. From a deposit perspective, as Raj mentioned, total deposits declined by $1.1 billion for the quarter, of which, $851 million with NIDDA. Weâ\u0080\u0099ve made over the last few years a major investment in this segment, and balances can be cyclical as well. And, in general, we see very strong new account growth across all areas of the bank. I think, you can also see that reflected in service charge income, which year-over-year was up 13% from the quarter-over-quarter was up 2.8%. So given the environment of increased earnings, credit rates and things like that, to be up over in service charges, I think itâ\u0080\u0099s good reflection in the fact that weâ\u0080\u0099re continuing to generate a lot of new opportunities for new account business throughout the bank. We saw some general decline in the corporate deposit base over the quarter that was really kind of all episodic, no real relationship losses, but you may have had a dividend recap or a large insurance company pay, reinsurance cost or other things that were not related to any account loss opportunity. All of the areas where we saw some account run down in the corporate business was all really reflective of sort of transactions within longstanding accounts where we have kept those relationships, so weâ\u0080\u0099re not overly concerned about that, and for the most part thatâ\u0080\u0099s growing back. We also saw some decline in municipal deposits for the quarter, which tends to be kind of seasonal as you come into the municipal deposit quarter. Overall, the loan to deposit ratio ended the quarter at 89%. Consistent with the guidance we gave you at the beginning of the quarter, we did see the NIM increase this quarter to 2.76% from 2.63%. In all of us, we saw resetting and coupon on variable rate instruments, new production and new securities purchases at wider spreads and higher rates that drove that increase. Cost of total deposits were 78 basis points for the quarter, up from 30 basis points last quarter, we have added some term in the deposit book, we did that intentionally. We continue to expect betas to be lower this cycle, in part because NIDDA represents a larger portion of the book. And Iâ\u0080\u0099ll draw your attention to Slide 6 in our deck when you have a chance to look at it where you can see that deposit costs are by all categories lower today at September 30, with a Fed upper bound of 3.25% then they were at 12/31/2019 with a Fed upper bound of 1.75%. And I get that weâ\u0080\u0099re still midstream in this hiking cycle, but I still think that supports our expectation that betas will be lower this cycle than they were last cycle. As Raj said, we do expect NIM expansion in the fourth quarter, probably not quite as much as we saw in Q3. But we do expect NIM to continue to expand even if we have some amount of additional NIDDA runoff, which we hope doesnâ\u0080\u0099t happen. The reserve as a percentage of loan was flat to the prior quarter at 54 basis points, not really seeing any deterioration in credit of notes. And, as Raj mentioned, the qualitative ACL includes $5 million related to the potential impact of Hurricane Ian. The main reason for the increase in non-interest income compared to the prior quarter was really the mark we took on some preferred stock investments in the prior quarter, and that did not recur this quarter, so just comparison quarter-over-quarter thatâ\u0080\u0099s the main reason for that variance. Increases in non-interest expense for primarily in the comp and technology lines, as weâ\u0080\u0099ve been guiding to all along as we invest in both people and technology to support our future growth and business strategy. In technology, weâ\u0080\u0099re making investments in digital payments, and in certain aspects of our infrastructure, particularly around data and integrations. I will say that, back at the beginning of the year, we gave you guidance of an increase in expenses of mid- to high-single-digits. And thatâ\u0080\u0099s exactly where weâ\u0080\u0099re coming in, and thatâ\u0080\u0099s exactly where we expect to land. I will point out in that other non-interest expense line, thereâ\u0080\u0099s a $2.3 million charge in there related to a write-off of a specific technology investment where we just decided to go in a different direction. Your line is open. I was curious whether if we could start on expense base, I know, you just said that thereâ\u0080\u0099s write-down or write-off on one item. But can you think about the base overall, and then you gave pretty solid guidance at the beginning of the year is held true for that mid-single-digit, upper-single-digit range, but when you think about this year relative to potentially next year. So I would be, I think, going to hold on that one until our next earnings call, because whatever I say, I might independently eat my words in one direction or the other. When you think about loans, in general, itâ\u0080\u0099s good to see the CRE rebound, hopefully, that trend continues higher. When you just think broadly speaking, I know that thereâ\u0080\u0099s the initiativeâ\u0080\u0099s kind of outside the initial footprint. I think if â\u0080\u0093 listen, we didnâ\u0080\u0099t talk much about â\u0080\u0093 in our comments, we didnâ\u0080\u0099t say much about Atlanta, which has been a big focus for us this year. But all the senior people, whether itâ\u0080\u0099s C&I, CRE, its credits underwriting, its treasury services, everyone is in place. Dallas, which is a different strategy, itâ\u0080\u0099s also on track, again, deposit only not loans. We have been doing some work trying to understand the lending side in Texas, whether itâ\u0080\u0099s something we want to play, and when we want to do that, we donâ\u0080\u0099t have a decision on that yet. Also weâ\u0080\u0099re looking at some other markets and you wonâ\u0080\u0099t be surprised by them, theyâ\u0080\u0099re not going to be out in Ohio or the West Coast or something, itâ\u0080\u0099s going to be somewhere in the eastern seaboard markets that we may already be servicing a little bit out of Florida or out of New York. But like I said, we were deliberate in taking these steps, we just donâ\u0080\u0099t jump in. But sometime next year, we might introduce another market. And, where weâ\u0080\u0099re not seeing growth is in places like Bridge, as Tom talked about. Weâ\u0080\u0099re looking at the best places to deploy capital, and wherever we donâ\u0080\u0099t find the good risk reward. Yeah, I might add from a product perspective, since you asked that, I think as you look across the Southeast, from a CRE viewpoint, itâ\u0080\u0099s clear that the fundamentals are very strong. In industrial, which we had a good quarter in industrial, theyâ\u0080\u0099re strong in grocery-anchored retail that is predominantly service oriented, and population shifts and really all of the southeast markets from a multifamily perspective are very strong. So, I think, as we think about our plan going forward, those are probably the asset segments and categories where we will look to increase portfolio and we think in Florida and in other parts of the southeast. Your line is open. But, yes, I think weâ\u0080\u0099ll continue to see that go up. And now there was nothing unusual that really drove that itâ\u0080\u0099s just purely keep on resets on the variable rate portion of the portfolio, and which is the majority of the portfolio in new purchases and hire better spreads. Most of that is because itâ\u0080\u0099s a short portfolio, a short duration bond portfolio, thatâ\u0080\u0099s a great move as aggressively as the Fed is moving them just see the benefit. Or do you think youâ\u0080\u0099ll be more active like youâ\u0080\u0099d have been historically,\n I think we ran out of our buyback middle of the quarter, if I remember wellâ\u0080¦\n Kind of early in the quarter. So weâ\u0080\u0099re in the markets, even now weâ\u0080\u0099re under a 10b5-l with multiyear  plan. We have said that we will be even more opportunistic, given the volatility that weâ\u0080\u0099re seeing in the market. So weâ\u0080\u0099ve already, I mean, in the 2 weeks, from middle of September to the end of September, we did $11 million already. So thatâ\u0080\u0099s a decent healthy clip, because the stock was weak at that time. Weâ\u0080\u0099re perhaps a little bit more opportunistic in our approach, and in times where we donâ\u0080\u0099t think that those opportunities are going to arise. And then finally, for me, optically, if you look at your reserve, and if you back out the mortgage warehouse loans, I mean, itâ\u0080\u0099s running at 55 basis points, which relative to peers is kind of thin. I think the mortgage portfolio overall, which is a big slug of the portfolio, carries very low reserves. Theyâ\u0080\u0099re not zero, but I think itâ\u0080\u0099s disclosed in our slides. I think itâ\u0080\u0099s like 11 basis points or something like that, very low reserves. So, thatâ\u0080\u0099s just an extremely high credit quality portfolio, very high FICOs, very low LTVs, almost no historical charge-offs. Pinnacle carries almost no reserve, thatâ\u0080\u0099s an investment grade portfolio really shouldnâ\u0080\u0099t be zero, but we canâ\u0080\u0099t get away with that. I think even our CRE portfolio, LTVs are so favorable that even in the event of default, it throws off very low LGDs. Itâ\u0080\u0099s easy to talk about these macro GDP and unemployment numbers, but particularly in the Florida footprint, economic trends and demographics are still very strong, so all of that weighs on the blunt instrument of just comparing our reserve level to that of other banks. It is outside compared to other banks, and it is a jumbo portfolio with a very, very pristine credit. So, I think, you have to consider whatâ\u0080\u0099s in the portfolio, when you do a kind of broad-based comparison to peer averages. Itâ\u0080\u0099s a pretty loan loss historically, itâ\u0080\u0099s tended to be episodic, not systemic. Your line is open. And then on the new loan yield front, I think it was around 4.3% last quarter. And Iâ\u0080\u0099m calculating around like a 35% loan yield beta, give or take. On average for the quarter new loan yields were about 5.25 now much lower at the beginning of the quarter than at the end, because obviously we saw rates and spreads move a lot during the quarter. Butâ\u0080¦\n Yeah, what I would maybe add to that is, when you look at the kind of core portfolio today from a C&I and CRE perspective. So, if you looked at our CRE, thatâ\u0080\u0099s not different for C&I than itâ\u0080\u0099s historically been, but if you looked at the CRE portfolio, 4 or 5 years ago, we were taking more on balance sheet rate risk and smaller CRE loans today. A lot of hard work over the years in terms of changing, do what just Tom describe, right, going from a fixed rate through a floating rate shop. That has been also a 3-year, 4-year transformation, slowly changing the business to be that and that is helping us today. Just at a high level, I mean, the bank is vastly different today than it was 4 years ago, the deposit base is different, run down the multifamily, different loan composition. That our clients come back to us for repeat business, we donâ\u0080\u0099t lose clients. We may lose them on price and something stupid like that, but we never lose them, because somebody is â\u0080\u0093 Iâ\u0080\u0099ll give you an example, Iâ\u0080\u0099m on a board of a nonprofit. And this nonprofit is raising some debt in the market, obviously BankUnited is not going to be participating, but I happen to be sort of running that process and Iâ\u0080\u0099m looking at the incumbent bank and the CFO of this organization said to me, I wish these people were just a little easier to deal with, itâ\u0080\u0099ll be so much better if we just did business with them. And without naming all the incumbent bankers and who Iâ\u0080\u0099m talking about, but just listening to that, you would never hear something like that about BankUnited. I think that part of the reason why the clients love us is, I think, we have over the last few years created a culture in the organization. The talented people continue to join us from other organizations that have great client relationships, and appreciate the culture and entrepreneurialship that the organization has and drive for innovation and just the values that our company has. But if we think internally what weâ\u0080\u0099ve done under the principles that Raj set forth, I think talented people want to be part of this company, and thatâ\u0080\u0099s a big advantage. But weâ\u0080\u0099re here both Leslie and I, and even Tom are available to take any questions if they come up today and tomorrow whenever."
}