{
    "symbol": "BKU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-21 13:45:01",
    "content": " Please be advised, today's conference may be recorded. I’d now like to hand the conference to your host today, Susan Greenfield, Corporate Secretary. Good morning, and thank you for joining us today on our first quarter 2022 earnings conference call. On the call this morning are; Raj Singh, our Chairman, President and CEO; Leslie Lunak, our Chief Financial Officer; and Tom Cornish, our Chief Operating Officer. Before we start, I'd like to remind everyone that this call may contain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 that reflect the company's current views with respect to, among other things, future events and financial performance. Any forward-looking statements made during this call are based on the historical performance of the company and its subsidiaries, or on the company's current plans, estimates and expectations. The inclusion of this forward-looking information should not be regarded as a representation by the company that the future plans, estimates or expectations contemplated by the company, will be achieved. Such forward-looking statements are subject to various risks and uncertainties and assumptions, including, without limitation, those relating to the company's operations, financial results, financial condition, business prospects, growth strategy and liquidity, including as impacted by external circumstances outside the company’s direct control. The company does not undertake any obligation to publicly update or review any forward-looking statements, whether as a result of new information, future developments, or otherwise. Information on these factors can be found in the company's annual report on Form 10-K for the year ended December 31, 2021, and any subsequent quarterly reports on Form 10-Q, or current report on Form 8-K, which are available at the SEC's website, www.sec.gov. Let me start by some comments about the economy, our markets that we are in, and generally how we see the outlook for things that we don't control but impact our business. We are seeing a robust economy in Florida, have been for quite some time, and even New York has improved quite a bit over the last couple of quarters. Of course, the usual issues with labor constraints and inflation, that's nothing new, but overall, home prices are up. Then there's the other view, which is the capital markets view, which we get by looking at our Bloomberg screens all day long these days, is, this was a very volatile quarter, and probably the most volatile quarter in quite some time. So, especially in fixed income, we saw obviously the yield curve go up to where it is, but we also saw spread widening pretty much across the board in fixed income assets. So, that gives us a little bit of pause when we think about sort of the medium to long-term as in maybe next year that there may be a slowdown. Again, it's - that can change and we'll keep monitoring it, but those are the sort of inputs we're taking into account as we are thinking about how to execute the strategy. This quarter, we came in at 2.50. just for comparison, last quarter I know there was a lot of noise in the numbers, but if you go back to quarter one of last year, we were at 2.39. I think we ended the quarter for spot balances, the deposit pricing was around 16 basis points. I think this is the bottom in terms of deposit pricing, to state the obvious. It looks like this quarter, there will probably be a 100 basis points increase between the May and the June meeting. So, I think deposit pricing will start to rise from here on, but it's nice that we were able to work it down to 16, 17 basis points. If you remember, last time the Fed reduced rates - started raising rates in the last cycle, our cost of funds bottomed out in the - somewhere in the 50, 55 basis point range. So, we're very happy where we've been able to - what we've been able to do with our deposit franchise. By the way, we also had $688 million of DDA growth this quarter. That was deliberate effort, actually started last quarter, fourth quarter, and into mostly done in this quarter. We did shrink our deposits - interest rates and deposits, but DDA - and the DDA growth that we got, the $688 million, was pretty widespread. And even before I get the question about how much of this was core or wasn't, I'd say a vast majority of it was core. So, outside of that, everything was core deposit growth. Average loans increased $586 million, but end of period loans declined $227 million. The biggest driver in that decline is mortgage warehouse business, which came down roughly $400 million, which it's returning to its normal seasonal trend. The last couple of years because of the pandemic, they've been sort of outlier years, but now we see that business returning to its normal cadence, which is March being the slowest time in terms of utilization. And then it starts to build from here into June and generally into the third quarter, before starting to slow down in the fourth quarter again. So, we're seeing that return. First quarter is always our slowest quarter, even outside of the mortgage warehouse business. But in terms of pipelines, we’re pretty excited about what we're seeing in our pipeline, both C&I and CRE. We've been shrinking CRE for many years, but we see momentum in that and look forward to that optimistically. Just taking a 12-month view, which I often say, you should always look at on a 12-month rolling basis instead of looking at any one quarter. Over the last 12 months, NIDDA, non-interest DDA, grew $1.7 billion. Our total deposits grew about $800 million, $809 million. This is all excluding - and loans, excluding PPP, grew $841 million. So, loan growth, deposit growth is roughly in line, and DDA was really the big story. Credit really quick, nothing but good news here. Again, as expected, but nevertheless, good to see the numbers. And by the way, if you carve out the guaranteed portion of the SBA loans, then the NPL stood at 47 basis points. Criticized classifieds, which have been declining steadily every quarter, that trend continued. It came down by another $280 million, which we were happy about. Just to put it in context, last year for the full year, we were at about 29 basis points. Our buyback program, we bought back $82 million of stock in the first quarter. So, after many false starts with the virus and what have you, we eventually are back to the new normal. You've heard me talk a lot about sort of the vision of the company and what we're trying to build long-term, which is a relationship-based middle market, small business bank. A relationship-based bank, our most important currency is trust. Newsweek announced that they ranked all the banks in the country on a trust factor, and we were ranked number fourth most trusted bank in the country, and we've been very proud of this achievement, and we're celebrating it at the company. We have hired the head of the C&I business, the head of the CRE business, our head of healthcare practice, which is a vertical already is in Atlanta. So, that bench strength is getting in place, and we are moving into our offices, I think within the next week or so. In fact, in Atlanta, I think we've already booked our first piece of business, a pretty marquee name on the C&I front. So, to follow up on Raj’s comments on Atlanta and the Dallas expansion, there's a number of other strategic initiatives that we have in place for the year that we've also made some key hires. We've brought in a sponsor finance leader in our New York market, focusing on sponsor finance business. We've recently hired a new trade finance and supply chain finance leader in the Miami market, in Florida, and New York, and the Southeast are great export markets for us. And as Raj said, New York is on the move and we have hired a middle market banking leader for the Long Island market. So, a lot of good successes on the hiring front over the last couple of months that we're optimistic about. Covering deposits and loans just a little bit more, as Raj mentioned, total deposits declined by $897 million. Most of that runoff was in what we believed to be interest rate-sensitive accounts, broker deposits, and interest-bearing accounts that are higher on the beta side. As Raj mentioned, overall growth was $688 million. So, that strategy of new relationships expanding, winning singles and doubles in key relationships every quarter, is continuing, and it’s an important part of our overall strategy. On the loan side, as Raj mentioned, average loans increased by $586 million for the quarter, although adding a point, and they were down $227 million, predominantly due to the large decline in the mortgage warehouse business that Raj explained. I'd also point out that the C&I book grew by $122 million in balances for the quarter, but was also up $345 million in total commitments for the quarter. That was broad throughout the corporate banking business, the commercial banking business, and our small business, and over across a number of different industry segments. So, we feel really good about C&I growth for the rest of the year. As Raj said, pipelines are very healthy for near-term business in the second quarter. So, with that, I'll turn it over to Leslie for more details on the quarter. We did see a fair amount of dislocation in the fixed income market, and we were opportunistic, especially in the month of March, we stepped in and deviated from what was our original plan. In fact, the plan was to shrink it, but we looked opportunistically and we saw spreads that are at really amazingly wide spreads. So, we stepped in and we grew the bond portfolio all towards the end of the quarter. So, you don't see the impact of that in the P&L really this quarter. But that's just an explanation on why the bond portfolio grew, totally opportunistic. So, a couple of highlights from the quarter, a little more detail around the numbers. To break that down a little bit, the yield on investment securities increased to 173 from 154. So, we're already starting to see the impact of rising rates and widening spreads on the portfolio yield as new purchases are coming on at higher spreads. I wouldn't say any one single factor drove that, but at a high level, we still saw for most of Q4 and Q1 of 2022, loans that were coming on, were coming on at a little bit lower yield than loans that were running off the portfolio. The total cost of deposits declined by two basis points quarter-over-quarter, and the cost of interest-bearing deposits declined by three basis points. We've issued some callable CDs and some brokerage CDs, and put some cashflow hedges on against the deposit book. If we exclude all of those instruments from the cost of interest-bearing deposits, it would have been about three basis points lower for the quarter. We also saw the cost of FHLB advances decline to 111 from 186, and that's really due to the runoff and termination of borrowings and related hedges at higher rates and the addition of new advances at lower prevailing rates. We still expect double digit growth in net interest income for the year, and further expansion in the NIM over the course of the year, probably most concentrated in the back half of the year as we really see the impact of rising rates on the loan portfolio. The extent to which we see the NIM expand, obviously will depend in part on how competition around deposit pricing evolves. The reserve remained consistent as a percentage of loans, 54 basis points at March 31, compared to 53 basis points at December 31, 2021. Some of the factors impacting the reserve for the first quarter, one was a - or the largest was a $12.8 million increase in qualitative overlays related to economic uncertainty, particularly around inflationary concerns and the impact of all the things the Fed is doing, rising rates, quantitative tightening, as well as the war in the Ukraine, and some lingering uncertainty around the pandemic. The economic forecast offset - partially offsetting that, drove a $4.9 million decrease in the reserve, an increase of $5.6 million related to updated assumptions, the most significant being updated repayment fees assumptions, and an offsetting decrease of $6 million related to various changes in the portfolio, new loans, run off, risk rating migration, et cetera. Again, criticized and classified commercial loans declined by $280 million this quarter. Total non-performing loans decreased by $55 million to $151 million this quarter, and that $151 million includes $42 million of the guaranteed portion of SBA loans on non-accrual. All of these unrealized losses are attributable to increasing rates, and to a lesser extent, widening spreads, all brought on by the Fed's actions and expectations about further quantitative tightening. Moving a security to held and maturity doesn't change the economics or the risk profile associated with holding the security, and simply eliminates any flexibility that we have in managing our bond portfolio. The silver lining in this is that we've been able to purchase securities towards the end of March at some very attractive spreads, and we're already seeing some of that in the increase in the yield on securities this quarter. Related to this in the first quarter, we also took a negative mark through the P&L of $10.5 million on some preferred stock investments that we hold at the holding company, also attributable to rising interest rates. Other notes on non-interest income, I want to point out that the growth in non-interest DDA and changes we've made to our sales strategy and product suite in the treasury management area, resulted in a 22% growth in deposit service charge revenue, compared to the first quarter of 2021. Again, response to what's going on in the fixed income markets, lower BOLI revenue, and a little bit lower income from our customer derivative program this quarter, which can also be somewhat episodic. On the non-interest expense front, comp expense declined by $3.5 million for the quarter. This was really related to the special employee bonus we paid in the fourth quarter of 2021, that was $6.8 million. I would say from a comp standpoint, Q1 is probably a pretty decent run rate for comp for the rest of the year, while some of the typically higher first quarter stuff will moderate. Raj, your comments seem to indicate that there's not going to be any slowdown on the buyback. I think in the short to medium term, I don't think there's anything there. I think long-term, you always have to look at growth prospects. But in the short-term, defined as the next three, four months, I don't see really much of that changing. So, that's why I say that I think we’ll get done sometime over the next few weeks with the authorization we have in place. But I fully expect - I think we have a board meeting in the middle of May, actually a shareholder meeting in the middle of May. It might be at that, or if not that, maybe shortly thereafter, I think we'll be asking for another authorization. And then just thinking bigger picture, I mean, I know we haven't touched on BankUnited 2.0 in a while. I think as of early last year, you'd already achieved the $40 million of cost saves and were working on the $20 million of revenue synergies. And then as you think longer term or maybe more intermediate term, growth is picking up. Rates are moving higher, and we're just in an environment to see some nice positive operating leverage. That is the near-term goal, is to hit 1% ROE, double digit ROE on a consist basis. I mean, we hit that with - from time to time, but to be consistently above that is the short-term target. We're not betting the ranch on rates going up, but we are slightly asset-sensitive. And it is - the last two years of this pandemic, it didn't do any permanent damage to the balance sheet for us or for most banks, but what it did was, that opportunity cost of not having grown our C&I business, not having sort of improved our asset mix, that is the real cost of kind of slowing us down in what batch we were on to achieving higher profitability. Now that the pandemic feels almost behind us, I don't think it'll be ever fully behind us, but for the most part feels behind us and we’re returning to normal, it is to pick up and those lost 18 months in terms of C&I growth, CRE growth, to actually execute on that and build margin and build revenue and build profitability \n Yes. Raj, just to interject, at the end of the quarter, there was $94 million left in the buyback authorization. In fact, for any business that we've started, we've never disclosed exactly what we're trying to do in the short, medium, long-term. And - but I will say this much, that if you look back at any business we've started, we've never come out, especially on the lending side of the business, and said we're going to do hundreds of millions of dollars right off the bat. So, in the first year of these initiatives, they don't move the needle for the company. Look at Orlando, look at Jackson, look at our mortgage warehouses, all of these things generally the takeoff is slow, but once we are comfortable, once you've gone through a cycle and audit and exam cycle, we get the confidence to say, okay, let's get into a higher gear. So, I would expect more growth next year than this year. But - and by the way, for Texas, just to clarify, I've said this in the past, that is more a deposit play, at least in the short-term, and not a loan play. So, it's a full-service play. They have their target they have to hit over the next year, two, and three, but I don't think they are going to move the needle for the company in 2022. I think the forward curve is expecting saying last - at last check, it was like 50, 50, 50 over the next three Fed meetings. And when you think about the margin today, is it fair to say that the gain that we just saw linked-quarter is something that we can kind of expect over the next couple of quarters, or is this outside improvement - go ahead. So, I would say over the rest of the year, I feel more confident now than I felt when we spoke last about margin expansion. And I - honestly you know this, Ben, I don't really think about this on a quarter-by-quarter basis, but I think we'll see good expansion over the rest of 2022. I still tend to think you'll see more of it in the back half, just as commercial loans get added to the balance sheet, as higher spreads - at higher spreads, and begin to have more of an impact on the margin. Historically, you guys have had 1Q has always kind of been a bit of the high-water mark, and I know you gave guidance last quarter. Raj, I wanted to go back to your comment on warehouse, one of the few optimistic comments on this business. So, the purchase business is still pretty decent. Now, there's a chance that if rates keep rising the way they are, that the purchase market will be impacted as well. We don't - if rates stabilize where they are, at 5% mortgage rate, while it sounds terribly high compared to where it was in December, it's still not that crazy in terms of killing the purchase market. We have all these spigots of lending, I call them, and it's a - on a $35 billion sheet, it’s $700 million in outstanding. So, for that business line and for the people who are in that, obviously, it is everything. But for us as a company, even if we're off a little bit here or there, it doesn't really impact the numbers that much, because it's not the tail wagging the dog. Maybe it doesn't return to normal, but I'm looking at where utilization is now, and I went back and I looked at every March from the time we started the business. The last two years were the exception, but we're always in the 30$ to 40% range in March, and then by June, it starts to be in the 55-ish range. That's sort of a very, very consistent curve of utilization year after year after year, with the exception of the last two years. So, I'm looking at that and saying, it looks like it's returned to normal, but there is a chance that the purchase volumes will also come down. If the 30-year rate goes to 6%, which it could, seeing how fast it has come to five or even higher, yes, you could see an impact, and utilization may not go back up. But even if it doesn't, if it goes to only 40% or 45%, it's not that much of a - that big a business for us. It was 12%,\n But I would also emphasize Raj’s comment that our commitment level remains strong. So, we actually expect our commitments will go up in the second quarter. And I think part of it is, we remain well positioned in the relationships we're in. Sometimes in this business, contracts, people consolidate lines. Outside of the warehouse business, the C&I utilization levels are increasing slowly but steadily. So, over the last six months, we've seen every month a few basis points up and up and up. And I don't want to go out too much on a limb and say it'll return to normal by the end of the year, but I think we will see improvement from where it is today, because now we've had about five, six months of consistent improvement every month a little bit at a time. I would also add, that we guided in January to mid to high single digits total loan growth for the year ex-PPP, which at this point actually has become pretty irrelevant. And that's …\n We expect this to be a growth year for CRE, and it'll be our first growth year in CRE in the aggregate since 2017. So, and we do expect this 2022 to be a CRE growth year. It's in New York City multifamily, but not like the old days. It's not retail and it's not CBD, central business district, office. It is some office, some medical office space, some suburban office, and even a little bit of retail when it makes sense, but it’s really on a sort of exception basis. So, it is - there's no one asset class that I would point to. I would also add that when you look at the differences in the portfolio, the level of sponsors that are coming back into the market the last six to eight months, and that's what we're seeing in our pipelines, it is a level of sponsorship that we feel very good about. Throughout most of last year, what you saw in the market was really kind of short-term bottom fishers looking for deals. The entry level point now and the loans that we have in the pipeline that I think will certainly lead to growth, especially in New York, are serious long-term investors in the market and very serious sponsors. Obviously, your loan to deposit ratio is still much lower than historic levels. I think what - so first and foremost, we're not letting up on our DDA growth effort. So, we want to keep bringing in new business. We've had a lot of success with it, and maybe we don't want to get off that discipline. As rates rise and eventually ECRs rise, there will be a little bit of a headwind on DDA growth, not from new business coming into the bank, but just generally commercial customers not needing to keep that much in balances to avoid fees. So, that will be the headwind that us and every other commercial bank is going to have later in the year. But other than that, DDA growth - I can't tell you how busy we are in the back-office onboarding new clients. It's actually a problem that we're trying to address, that our people are working ungodly hours to onboard clients. In terms of the rest of the deposit book, I think the guidance we gave you is that we're looking for very little or no growth in total deposits, because eventually we want to kind of balance things out. This increase in deposits, while we're all sort of modeling away what this will have - how this will all play out, it's going to be quite different from last time. Last time around, if you remember, slower or lower longer was the words used over and over again, describing how the Fed will lift off rates. I mean, what took three years to do last time for the Fed, I think the Fed is going to do that in a matter of three quarters, if not less. So, I think we just have to kind of just be careful in a very fast-moving market to stay on top of that and predict what will happen with deposit flows. But overall, we're not defining success by growing the total deposit book, but by growing the DDA book. That's really what we're sending our people to do, and that's what I think builds long-term profitability, long-term franchise value for us. And then in June, I mean, we'll be about 125, 150 basis points of Fed funds. And to your comment on FHLB, Jared, we’re still very comfortable with where wholesale funding is on our balance sheet and the loan to deposit ratios. And 90 days ago, we would've thought the bond portfolio would've amortized down this quarter. We ended up not including the fair value mark, growing that portfolio by $700 million. That's really the shift right there, from thinking it would be down $300 million, to it being up $700 million. And it was just an opportunistic move that we made right at the end of the quarter, and it'll even out. When we look at the fair value adjustment, the $10.5 million charge through the securities gains, what did - so you must have obviously sold some securities. Can you share what you - the balances that you sold and what the … \n No, I don't have all those details in front of me. So, the yield on what we purchased for the quarter, Jared, was - for the whole quarter was in the mid twos, and what we sold was in the mid one. So, that gives you - towards the end of the quarter, what we were purchasing was in the mid threes. First of all, we don't have a mortgage origination in sale business. We had some loans that were kind of caught in the process of modification right then, and got modified at lower than prevailing rates, and ended up being repooled at a loss. But I will say the total yield on that EBO portfolio for the first quarter, including the interest yield and net loss, were still over 4%. And then I was hoping you could share with us your thoughts around, or forecast on deposit betas and loan betas over the next, call it, 12 months,\n I think where we sit with deposit betas, I would say we project them to be significantly lower than they were last time we were in a rising rate cycle. I hesitate to put a specific number out there, because any number I would put out there would be heavily assumption-driven. So, we don't have historical data that we can confidently base all of those assumptions on, but we are highly confident that we'll see lower betas than we saw last time around on the deposit side. I mean, we haven't yet, but …\n It'll definitely happen this quarter, given we're expecting 100 basis points move. So, the first move we then - maybe, Leslie, just to be absolutely correct, there may have been one or two clients where we had to do … Individual clients. No, not across the board, but it will happen, I'm sure, this quarter. Obviously, those Metro New York City markets have been heavily disrupted by M&A. So, the world's going to be different in 90 days and probably a year given rates, as Raj had mentioned. And I'm curious, do you think that the combination of higher interest rates and some continued expense operating leverage is really going to position BankUnited for much stronger profitability kind of as your return on assets, PP&R returns, et cetera. But yes, I do think we're going to continue to see margin expansion. While we are going to see an increase in interest expense, I think the- not interest expense, in non-interest expense, operating expenses, I think the increase in revenue will outpace that. Now, I'm not making a prognostication for any one particular quarter when I say that, but I do think that'll be the trend. And, Raj, you had mentioned earlier about loan rates getting higher at the end of March. I think the Fed stepping out of the market and letting private markets do their thing, is really, really the best news that we've had in the last 90 days. I think overall, it's a good thing. Nobody likes to see their bond portfolio get marked like every bank has seen this quarter, but I think we're all doing better business and healthier business for that reason. I think, no matter what asset class you look at, and you can go look that up on Bloomberg, things have widened. I mean, rates are obviously where they are, but spreads have widened. I mean, we've seen it now for about a month, wider spreads. And the loan portfolio, especially the commercial business, the news comes late over there of widening spreads, but it is getting there, and we're seeing it come into the business that we're doing. And if it sustains, that's good for us and for every other bank that is in the market. So, the Fed stepping out was the biggest news this quarter, and I think it's good news. Thanks, everyone, for joining us and we'll see you again in 90 days, if not sooner."
}