{
    "symbol": "YOU",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-16 14:17:10",
    "content": " We have with us here, Ms. Caryn Seidman-Becker, Co-Founder, Chairman and Chief Executive Officer; Ken Cornick, Co-Founder, President and Chief Financial Officer. In addition, we've included some non-GAAP financial measures in our discussion. Reconciliation to the most directly comparable GAAP financial measures can be found in today's 8-K. With that, I'll turn the call over to Caryn Seidman-Becker, Co-Founder, Chairman and Chief Executive Officer of Clear. At Clear, we love travel and we love airports. As pandemic restrictions recede and people hit the road, consumers are spending a larger share of their wallet on travel experiences. When we compare the numbers to 2019, we find the vast majority of our airports have already exceeded pre-pandemic levels. You see it in record-high new joins, trial conversions and family attach rates. In the last month, we have opened new Clear Plus lanes at three California airports, San Diego, Ontario and Palm Springs. Network expansion is important as it drives growth in the new market and lifts existing markets, both from a gross add and retention perspective. We are seeing record numbers of travelers using Reserve powered by Clear to book time slots for TSA screening in advance in cities like Phoenix, Seattle, L.A., Orlando, Newark and Calgary. As people come to expect technologies designed to make their lives easier, more travelers are utilizing Clear's free Home to Gate tool to tell them exactly when to leave for their flight and even reserve an Uber ride ahead of time. We're excited about the platform side of our business and after a very successful fourth quarter, we continue to sign new partnerships and build our product and partner pipelines. As it's still in its early days, the platform metrics can appear lumpy with timing mismatches between new deals signed and bookings versus enrollments in utilization. With domestic travel back and physical and digital identity more important to trust and experiences than ever before, it is an exciting time at Clear. Our free cash flow, coupled with cash on the balance sheet, puts Clear in a strong position with great long-term growth and significant capital allocation opportunities. Our financial performance in Q1 was better than we expected, with revenue up 79% and bookings up 74%, driven by growth in Clear Plus as well as new deals on the platform side. As we discussed last quarter, our focus remains on growing members, bookings and free cash flow. Our business model is strong and following several years of platform investments as well as the normalization of airport staffing levels post pandemic, we are seeing operating leverage. As we told you last quarter, we expect moderating year-over-year expense growth in 2022. A quick word on retention, we reported 95.3% net member retention in the quarter which remains above our long-term expectations of the upper 80s. We are really pleased with how retention has trended coming out of the pandemic and there are structural reasons for the strength like network expansion, strong operational execution, customer centricity and brand passion, as we discussed in our letter. In addition, some of the strength also relates to win-backs of the excess churn we saw during the pandemic. As a reminder, the net retention calculation is the sum of gross retention plus win-backs. So in other words, gross retention which is in the low to mid-80s, is netting to the mid-90s with the benefit of win-backs. Later this week, we are raising the retail price of Clear Plus subscription for the first time in our history by $10 to $189 for new members. This quarter, we added some disclosure around stock-based compensation expense. As owner-operators, we're strong believers in driving economic returns and we are mindful of the true cost to shareholders of share count growth. At Clear, we have constructed a thoughtful, long-term total rewards program that encourages an ownership mentality while we remain focused on limiting dilution over time. Along those lines today, we announced a $100 million share repurchase program. As Clear owners, we're focused on economic capital allocation to maximize long-term returns, including opportunistic share repurchases. Our cash and equivalents balance at 3/31 was $663 million, thus, we have ample liquidity to support repurchases as well as our growth initiatives, both organic and inorganic. In Q2, we expect GAAP revenues of $99 million to $101 million and total bookings of $110 million to $114 million, excluding any contribution from TSA PreCheck. We're making steady progress in our launch time line, setting us up for go live in the next several months. And then separately, we're also seeing the Clear brand kind of pop up in various different verticals, seeing it in hospitals and others. Interestingly, we really haven't kick-started any internal initiatives around that, so it's really organic. So yes, that's the expectation for people coming out of the pandemic but also automation which drives cost efficiencies for partners is a driver and also connected experiences. So as I talked about that return, airports, airlines, hotels, car rentals, ride shares, you're seeing that desire across all of those and they also have a lot of partnerships between them. To your point, maybe you experienced Clear at HSS here in New York City. We are seeing a lot of... Oh, is that where you saw it? Yes, well, hopefully, you're feeling okay. So both on the digital front door, telehealth, telemedicine as well as the physical experience. And then, the last thing I would say is we are seeing interest from, I would call it, digital trust. We did buy Atlas Certified at the very end of the fourth quarter and this concept of knowing you and that you are certified or licensed for certain use cases, right, or jobs is also really important. So I would say it's broad-based, both online and off-line. The last piece I would add is as Clear builds a lot of partnerships to help employees and employers return to work and obviously, that's incredibly important right now, thinking about that hybrid work environment which is now both physical and digital, we think there's a lot of opportunities there. On the airport count, you mentioned 43 today. And then looking ahead, nice progress with three airports today in the quarter. In terms of where we see the opportunities, we don't announce partnerships before we sign them, so stay tuned. Where we're focused internationally is, I would call it, the Americas, from Canada to South America, Western Europe as really our first focus and that's in multiple different kinds of products. When I think about good, better, best and I think we talked about this last quarter, right, we have Reserve, we'll be launching PreCheck enrollment, we have Clear Plus and more products coming. So Dana, I'll take the B2B and then I'll let Ken talk to PreCheck as well as expense and operating leverage. As I talked about in my commentary, it's an earlier-stage business. The platform metrics, right, there can be mismatches between new deals signed and bookings versus enrollment utilization. In this quarter, we signed a large platform deal that contributed to bookings but didn't yet launch. So it doesn't yet have an impact on members and utilization as opposed to our Clear Plus business, when you enroll, you pay typically in the same quarter. Or in Q4, as we were successful driving new members with our Raiders partnerships but then the NFL season ended, so we didn't have gross adds or utilization from that partnership in this quarter. So it's really what -- the guidepost you should be looking for are both product launches and partner announcements, some partners will run throughout a year and some partners would be in a quarter or an event. Dana, so on the PreCheck piece, look, we're making really good progress. And look, we're confident that we're well positioned to launch in the next several months, so I'll leave it at that. If I could just add to that, I was recently with some of our engineers who were showing off the product demonstration and we're incredibly excited to launch it. And also for travelers and I know our airport partners are also excited for the launch, the ability to leverage our really well-positioned enrollment locations and our amazing staff of ambassadors and team of ambassadors across the country, starting at 4:30 in the morning and ending at 10 or 11:00 whenever a certain lane or enrollment area closes, we are -- ready and incredibly excited to bring those to travelers. So your last question on expenses, look, I'll reiterate what we said last time which is we expect a moderating growth rate in the year-over-year expenses. As you know, we've had a couple of years of investment in the platform. Last year, we spent the year normalizing our staffing levels to pre-pandemic levels after cutting them in 2020. And again, I'll point to our free cash flow generation. You mentioned last quarter, same-store bookings grew 50% year-over-year. Yes, we wanted to give some additional disclosure just to help everyone understand the true growth dynamics of the business on a same-store basis as well as how widespread the growth is. In general, we are seeing strong same-store growth. But we are seeing very, very widespread, strong same-store growth across our base. We're really pleased with the pipeline, integration is going well and we remain very excited about those two acquisitions and what we can do to accelerate their growth as well as how they will help us accelerate our growth. When I talked about automation, I think that businesses are fully understanding that the hours required to manually check and confirm individual credentials and licenses are staggering. When you think about health care or you think about online platforms for anything from caretakers to plumbers, the need and hours and people required to ensure compliance is really high. And I do think there's an appreciation of both, right, integrating the credentials as well as verified identity. So -- and I think with the Clear brand, there were some aha movements for partners. So right now -- so in the past, we've actually raised those prices. So for example, when we first launched Delta, it came in at $79 and $99 and those are now $109, $119. No, it's not a renegotiation. Got it, that's super helpful. As we mentioned, we're not going to raise price for existing members this year. But certainly, in the future, if prices were increased, you would see dollar retention exceed net member retention because of the price increase, if that makes sense. So it's been a small impact, not yet significantly material. Well, if you're talking about the Whyline acquisition, there's a small impact there but again, not yet reaching the level of significant materiality. And so could you guys just give us maybe a little additional context, if it's possible sort of what might be -- like what all do you see that's not been mentioned yet, if anything, the dynamics that are driving the strong same-store sales growth that you guys have been seeing? We launched our first airport Orlando, mind you, as Ken talked about price increases at $179 in 2010. And so I think the more places that Clear shows up, this concept of early product market fit which is really frictionless experiences and giving people back their most precious asset and that is time with a trusted brand, I think it all sews together. And I think Clear is a bastion of tranquility in a sea of stress, not only in travel but in sports and other use cases as well. And so when you look at our member growth which is up more than 100% versus year-over-year and then the airport side up double over 2019, I think it's the power of the network. Incredible, people talk about our ambassadors being just incredible and the greatest part of the airport. The platform is stronger, faster, iris touchless, I could keep going. And again, I think we were probably early in 2010 but the desire for frictionless experiences and a trusted brand which is why we wrote the letter that we did on both the privacy side and the customer experience. Well, we do expect it to settle in above pre-pandemic levels and we're seeing that. So I said upper 80s and that is above pre-pandemic levels and among...\n Look, we're going to work really hard to make sure it's as high as possible."
}