{
    "symbol": "AEO",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-26 20:52:01",
    "content": " Joining me today for our prepared remarks are Jay Schottenstein, Executive Chairman and CEO; Jen Foyle, President, Executive Creative Director for AE and Aerie; Michael Rempell, Chief Operating Officer; and Mike Mathias, Chief Financial Officer. Before we begin today’s call, I need to remind you that we will make certain forward-looking statements. The company undertakes no obligation to publicly update or revise any forward-looking statements whether as a result of new information, future events or otherwise, except as required by law. Total revenue increased over last year, but was well below our expectations. Now as we look to rebalance assortments and right set plans for the current environment, I’m confident we will see improvement. Over the past few years, great work has been done to optimize the real estate portfolio and strengthen product margins, and that work continues to generate underlying benefits. Regarding our new logistics business, Quiet platform, has been actively signing up new customers. In the second half of this year, we look forward to introducing more real good products across our brands, demonstrating our commitment to environmentally responsible and sustainable design and production. Before I turn the call over to Jen, I want to underscore our laser focus on resetting our plans and making improvements across areas of opportunity. In the first quarter across brands, we faced difficult comparisons as we lapped extremely strong demand last year. Despite this, Aerie delivered good results, especially factoring in the outsized growth in 2021. First quarter revenue grew 8%, reflecting a strong 27% 3-year CAGR. Excluding swim, Aerie revenue grew 15% with intimates, leggings, apparel and beauty and also accessories also posting growth versus last year. OFFLINE by Aerie grew in the strong double digits, lapping a triple-digit growth as it continued to scale its assortment and customer base. Our spring campaign promoting happiness was a huge success, making #AerieREAL the number two trending hashtag on TikTok. As the leader in women’s inclusivity and empowerment, we continue to push the envelope on innovation, and we ensure our customers feel our passion for our great product and the best customer experience and a brand that they can be proud to shop. For the fall season, we have exciting new product launches, and these are excellent additions to the Aerie collection. Looking out longer term, I remain extremely confident in the Aerie and the OFFLINE potential growth. As we cycled a terrific season last year, sales trends were a bit more challenging. Revenue declined 6%, reflecting a negative 2% 3-year CAGR as we refocus our assortment and real estate footprint. Although we had a number of good performers, including dresses, accessories, jeans and men’s overall, demand fell short of our plans. In addition to rightsizing the inventory, we also see an opportunity to strike a better balance across our key styles. I continue to be proud of our leading jeans business, which is up double digits across both genders compared to the first quarter 2019. In the first quarter, we re-launched our new Members Always campaign with the TikTok #challenge that garnered almost 3 billion views. With the new team in place, we are now starting to see new processes and energy fuse together to drive the business forward. I love what I’m seeing for future seasons, including this coming back to school, and I believe this new leadership team and structure will set us up for success. Across brands, our teams are rolling up their sleeves to innovate, test and learn and to use all the learnings we’ve had over the past years to get stronger, better and faster. Although the environment could remain choppy, we are excited by the new trends and fashion, and we are prepared to deliver a strong fall season to our customers. Our mobile app continues to show strong momentum, driving more than one-third of e-commerce sales and traffic in the quarter. As we’ve indicated in the past, mobile customers are our most engaged digital shoppers. This quarter, we introduced Shop the Look, enabling customers to browse and shop head-to-toe looks, curated by our stylists. Additionally, we also enhanced our search capabilities to return more relevant results and prioritize best sellers for our customers. And although lead times have improved slightly in the quarter, they are also still longer than any prior history. That being said, we do currently expect that freight costs for the fall and holiday seasons will benefit from lower ocean and air freight rates. And regarding product costs, we’ve been successful at keeping costs in check through a number of mitigation measures, including platforming fabrics, diversifying production facilities and leveraging our scale to find efficiencies. However, beginning in the fourth quarter, we expect to see some pressure from product input costs, specifically higher cotton costs. In this dynamic and inflationary environment, we are regularly reviewing our pricing strategies and our promotional activity to optimize both sales and margins, and we do believe that there’s good opportunity for us in the second half of the year. In the first quarter, we saw further reductions in our number of shipments per order and shipped our digital orders faster with a 13% reduction in delivery times. Jay highlighted a few of our significant new customers in his comments, and we’re looking forward to adding more in the coming months. We believe that edge fulfillment, share distribution and shared logistics is going to be as transformative to retail as the shift to omnichannel was a few years ago. Although we are still in the early stages of this, I’m very encouraged by our momentum and the potential that we see in this business. And with that, I’m going to turn the call over to Mike. As the team has indicated, the top line was well below our expectations, while our plans baked in an impact of cycling stimulus and pent-up demand from last year, we underestimated the magnitude. As a result of the top line miss, expenses deleveraged driving an operating profit result well under our plan. Based on our first quarter performance and the current macroeconomic environment, we have moved quickly to reset our plans for the rest of the year. This includes meaningful adjustments to both inventory and expenses, which I’ll discuss throughout the call today. Brand revenue declined 1%, below our expectation of a mid- to high single-digit increase. Compared to pre-pandemic 2019, total revenue was up 19% and brand revenue was up 16% or $141 million. The gross margin rate of 36.8% contracted 540 basis points, primarily reflecting headwinds to merchandise margins from higher freight costs of approximately 340 basis points. As discussed last quarter, the integration of our supply chain acquisitions also adversely impacted the gross margin, driving 120 basis points of deleverage. Compared to first quarter 2019, merchandise margins continue to reflect markdown and promotional discipline. Additionally, rent dollars are down versus 2019, and leveraged as a percentage of sales, reflecting our measured approach to store openings and closures. Turning to expenses, SG&A deleveraged 270 basis points compared to the first quarter of 2021. The mid-teens dollar increase was in line with the guidance we provided last quarter, led by higher wages for store associates and hours to support the recovery in store operating capacity compared to last year. Beginning in the second quarter, I expect year-over-year dollar growth in the low to mid single-digits. First quarter operating profit of $42 million, reflected a 4% operating margin. Consistent with the new accounting standard for convertible notes, our diluted share count of 220 million, recognized with the full 49 million in shares of the unrealized dilution associated with converts. Breaking down the individual brand performance, Aerie revenue increased 8% and comparable sales declined 2% following outsized growth last year. Operating profit was $43 million, reflecting a 13.4% margin. This was well below last year as we lapped a near perfect period of strong demand, while experiencing higher freight costs and expense deleverage related to the sales miss. Despite headwinds to the quarter on a multiyear basis, Aerie’s growth trajectory remains intact. As I said earlier, we’re adjusting our forward plans to be more consistent with these long-term trends and remain very confident in Aerie’s path from here. This was well below an exceptional period last year, mirroring the headwinds I just discussed to Aerie profit results, including higher freight costs. Compared to pre-pandemic 2019 levels, the operating profit and margin was stable, reflecting the benefits of our more focused brand strategy. We have downsized our North America store footprint from 891 stores in the first quarter of 2019 to 815 stores in the first quarter of 2022, reflecting a mid-single-digit reduction in gross square footage. As we right size and rebalance ads, inventories and current operating expenses, I expect to see improvements to operating profits for the second half. Consolidated ending inventory costs, was up 46% compared to last year. From a brand standpoint, Aerie and AE also drove half of the increase. Total inventory units were up 24% due to higher in-transit and on-hand inventory, including 7 points of growth related to Aerie and OFFLINE new store openings. Based on current demand trends, we’re resetting inventory for the second half, and will clear through excess spring goods in the second quarter. For the full year, we expect capital expenditures to be approximately $275 million. Turning to real estate, we continue to be pleased with our returns on new Aerie openings with first year returns of approximately 50%. In the first quarter, we opened 12 new Aerie stores, including a mix of stand-alone and Aerie OFFLINE side-by-side formats. For AE, we continue to make progress towards our long-term target of rightsizing the brand store footprint. Looking ahead, we maintain significant flexibility to adjust our footprint further with 40% to 50% of our fleet available for lease action each year. While first quarter brand performance has played out differently versus our original plan, as I noted earlier, our results continue to show meaningful progress on key strategic pillars outlined in our Real Power. For the second quarter, we will be entirely focused on clearing out excess spring inventory. We expect higher markdowns as we clear through excess inventory, combined with continued freight inflation and the impact of our supply chain acquisitions to result in a gross margin rate of approximately 33%. As we said earlier, we’re axing expense reductions and expect second quarter SG&A to be up in the mid-single-digit range. As we reset the shifts in the macro environment, we’re lowering our outlook for the full year. Using 2019 as a gauge, we expect to deliver operating profit above the full year profit of $314 million. We expect to enter the second half better aligned with demand with a more balanced inventory position and leaner expense base, driving improved margins and profitability relative to the first half. In terms of our longer-term outlook, we will provide an update as we see greater visibility into our business in the macro environment. With that, I’ll open it up for questions. We mentioned in Aerie as we think of the OFFLINE business, how exciting that business is. So we’re pretty excited about that category, Matt. But going back to Aerie, I’m really pleased. And if you think about that business, it’s definitely more penetrated on the direct side where we do most of the business there and direct business was softer than stores. So again, fairly isolated, which I like because we’re almost through the swim season, and we’re pretty excited about some of the launches that are coming your way for Aerie. And like I mentioned, all of those businesses in Aerie, they are nice – they did great. Thinking about AE, look, the denim business remains strong. But if you look back to prior years, it’s still our second best volume season. So pretty excited because we know how important that business is for the Eagle, and certainly is a category that we look forward and we re-merchandise to for Q3 and Q4, like we had some learnings in Q1. And look, we’re learning and we’re moving ahead. There is always a learning in retail, and that’s how we’re thinking about the business. So that’s in our cost inventory on the balance sheet, as we all know. Looking at the 24% increase in units, I’ll say that – a couple of things. One, we’re coming off of last year’s March-April hyper stimulus period. So on that plus 24% units can gauge about third of that is just missing the plan and having to clear through spring and summer goods, as we talked about, that we will do here in Q2. And then I did forget one of the piece of that inventory, we do have quite a bit of new Aerie and OFFLINE openings that we have inventory on hand for as well. As you know, we’ve got a big sort of non-comp base that’s new to last year. On the EBIT front, yes, I mean, look, that’s essentially – Jen did a great job answering our trend line. We’re on this multiyear trend where Aerie is looking to double to ‘19, to double from 3 years ago. That’s phenomenal still, that 25% plus CAGR. So we hope that’s conservative, but we’re planning the business that way. If it’s accounting for that revenue trend line that’s 7, 8 points off of – at least through the first 4 months of the year here at 7, 8 points off of what we thought when we came into the year. So if we roll that through the rest of this year with some of those cost pressures, that’s the guidance. And I think for the back half, the work we expect to see impact or benefit the back half. A lot of the work we’re doing is to make sure going into 2023, we have that expense base reset to where we want it to be going into next fiscal year. But for now, it’s a prudent place to be. Please proceed with your question. And then also back-to-school, assuming back-to-school is going to impact the July business. Given you’re lapping the child tax credit from last year, and maybe some pent-up demand because there wasn’t a lot of in-person school in 2020. So yes, February, the trend the last year was stronger. But again, that was prior to lapping stimulus that really hit mid-March and through April in terms of the benefit from the stimulus last year. And quite honestly, I think we’ve learned now that the macro impact to the business from where we planned it, it’s a little different. And we planned it higher, we planned wrong, and now we’re going to reset our plans around that. The thing that’s been consistent, very consistent through the first quarter and even now into May is our multiyear trend line and I think we all hate continue to do this. But we’re still talking about 2019 because it is a grounding point, knowing the volatility of the last couple of years in ‘20 and ‘21. So Aerie has been very consistent on this doubling ‘19 trend, 25% CAGR over the 3 years. So again, that’s why we’re setting these plans up for the remainder of the year this way. But again, we’re planning the business for the brands on this trend line that we’ve seen on this multiyear basis through the first 3.5 months. So the answer to your question – you’re July, I mean that is really essentially what we’re doing for the remainder of this year with – I hope that there is some potential upside to that, but it’s – again, it’s the right place to position inventory. Please proceed with your question. And then, Jen, if you could address for me something that’s confusing me is, I love the assortments at Aerie, but they seem to be overlapping a lot with a lot of the women’s assortment at Eagle. Janet, again, I need to hear you, I’m sorry, Janet. And our famous four categories like I mentioned in my first response are set up to go and – so for instance, using denim as an example, not only did we look at our wash and our fit and making sure that we have the right qualities for both men’s and women’s and distorting there. I mean, Janet, we don’t have an issue actually in men’s. And women’s, like I said, this is the most important thing. And I think what I am seeing for the future, we are going to get really psyched around these assortments. We were just too aggressive on the plan, that’s all. Look, I like the profit margins in American Eagle. I mentioned in Aerie are that our great businesses get stronger in the back half, OFFLINE, which we have seen great results. So, it’s really swim. So, as that seasonality takes hold, I think I feel really good about where we are headed in Aerie. So, not only do we have a new team in place, but we have a whole new process where we actually – I can see the various lines during similar weeks, which I think is a huge advantage. So, that’s what we are working towards. Not getting too aggressive, making sure that we are protecting the margins, rebuilding assortment and setting up the plans to beat. Please proceed with your question. But I feel like as a company, American Eagle has just done so much work operationally and technology that you are coming into this tough period a very different company than you were in the past. And at the same time, you have a fashion trend in denim that’s playing to your company’s strength. Because it feels like compared to past times when we have had these moments with the consumer or inflation or anything else, the company is much better positioned. I think like you said, we put a lot of money in our technology. I think we have the best – like the best team out there, period. Please proceed with your question. I think traditionally, you have mentioned that store and e-com profitability has been relatively in line with one another. I think the way I have described this before, is – I mean obviously, we look at the channels in terms of productivity, both in top line trend and then the profitability flow-through coming through both channels. At the end of the day, though, I don’t like to talk about channel profitability all that much because we are looking at delivery efficiencies. So, it’s really about efficiencies through the P&L because as we know, our customers don’t really shop channels. So, channel profitability in general is not that different, and we are working through the expense line items that attach to each transaction to find optimal – to find ways to optimize. I think it’s the best way to answer that question without getting into a lot of accounting because a lot of our accounting around channel profitability is allocations, which we don’t like to get into. So, it is just finding efficiencies related to every transaction and the cost of every transaction is a way we like to think about it. Please proceed with your question. Yes, I think from a spring and summer perspective in terms of how we play in the business, we expect to be clean going into back-to-school. And when I say clean, we have reset our plans multiple times now for the back half to so that our average inventory is in line with these trend expectations and the trends we have been seeing for almost four months now. So, on average, for those seasons, we are really happy with the way inventory is positioned against our current trend line. At the end of each quarter on the balance sheet, again, you are going to see some apples-and-oranges comparisons in terms of just timing of inventory. From a gross margin perspective, we provided the 33% for the second quarter, which is where we think we will be to get through the goods we own right now. When we look to the back half, we do expect to see improvement in Q3. Q4, we typically – again, we get a little more promotional, just the nature of the holiday period. So, gross margin is typically a little lower, but we do expect to see significant improvement to last year’s rate because of that $60 million impact from airfreight. And I think Michael hit in his prepared remarks, we do not expect to incur much air freight at all in the fourth quarter compared to that $60 million number. So yes, our supply chain business, actually, I think what Mike said in the prepared remarks was performed a little bit better than expected in Q1. Clearly, positioning inventory closer to customers, being able to get supply chain efficiencies, being able to have fast and efficient delivery, it is the future. I said earlier, to me, it’s the same as when retailers all decided to go omnichannel or most decide to go omnichannel a few years ago, we are going to look back at this moment. And we are going to say positioning inventory on the edge, using shared capacity to do that, is as transformative to the retail landscape as omnichannel changes were years ago. Please proceed with your question. The first is, you guys seem to be pretty disciplined in terms of your SKU count on markdowns, particularly in comparison to 2019 levels. And so I just wanted to – understand how you are thinking about, obviously, you have some inventory you are going to move through here in Q2. And like I said, you heard the numbers, I am very pleased with the results, looking at 2019 and the volume that we were able to drive in bottom just way more productive. Look, we are in the business of having edited, well-defined assortments. Aerie, we have pretty much always been really disciplined there, some learnings in OFFLINE as we have expanded that assortment and that was really from back in Q3 last year. That’s really where we saw some opportunity, and we worked on that as a team, and I am feeling like we are in a really good place there. On raw material inflation, we had platform fabric, I had mentioned last year very aggressively all the way through back-to-school this year. And Q4, we do start to feel cotton price increases, but it’s more than offset by the transportation benefits that we are going to get. And actually, when you look at the receipt IMU in Q4, it’s really very close to what pre-pandemic levels were also. It’s not anything in terms of choice or SKU counts, elevating again and becoming undisciplined. That’s not – I think Jen said, I just want to make sure that’s clear. I was thinking more like a SKU count on a markdown basis, like it’s still pretty clean compared to 2019 levels. And maybe that’s a reflection of the fact that you do have less SKUs, period."
}