{
    "symbol": "AEO",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 18:07:02",
    "content": " Please proceed with your question. As we -- Mike mentioned it, as we start to hurdle these new store openings, we feel like there's definitely some comp growth in these stores because, as you know, we go into a new market, we have to get the digital side of the business up and going. Please proceed with your question. So we have two new potential growth vehicles for the company as well as it's just nice to see women's that business round out that -- and all that I can say is, because of our test and scale and our logistics platform and our ability to get goods here, we're pretty pleased on how we can chase these goods and get back into business on the American Eagle side. Please proceed with your question. It's interesting, our new stores, we're feeling very encouraged by but we still have a portion of the business inside of the Aerie -- inside of select Aerie stores, whether there's an OFFLINE store in the mall or not, we still are learning in the Aerie stores. So early signs, if you look at the last few quarters and you look at these stores as we're anniversarying them, are very positive that what these stores are doing for the business is going to mirror history, which is going to give us multi-years of growth. Please proceed with your question. Please proceed with your question. Please proceed with your question. Please proceed with your question. I think -- if you think about the minus 2% for fourth quarter, John, I think we talked about the factors all that non-comp, the 150 stores that we added over the last couple of years, the 60 we added this past year, even more specifically, is those anniversary that comp gap that you do the math on Q4 was a 10-point gap with total revenue up 8 comp minus 2. Please proceed with your question. And I think we've learned some things over the last year, and I think you'll see us start to pick up momentum in some of these new ideas and really attack what we own and what I think we are famous for, including bralettes being one of the businesses that I would like to say we really we're one of the first to really dominate in that business. We have new launches coming forward, starting in Q3, a really exciting launch in Q4 that I think will definitely separate us from our competition, and we're going to continue to build on all the equity that we built on in both brands as far as building our AURs, building that quality, and -- the customer is willing to pay, we're seeing that because they trust us."
}