{
    "symbol": "AEO",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-07 21:25:03",
    "content": " While down to last year, our digital business has seen significant growth over the past 3 years, with revenue up 60% to second quarter 2019. This reflected higher in stocks as we lapped supply chain disruption last year, earlier receipts of back-to-school and fall goods, reflecting improved lead times and higher units to support new Aerie and offline store openings. You may proceed with your question. You may proceed with your question. So the combination of those two factors plus the â\u0080\u0093 Michael talked about the 20 stores we opened in the quarter and the ramp-up of the new stores weâ\u0080\u0099ve opened in general, those three factors, you could take Aerieâ\u0080\u0099s operating rate from 3% to double digit in the second quarter alone. So weâ\u0080\u0099re very confident in being double digit in the back half, and weâ\u0080\u0099re looking forward to â\u0080\u009823 already benefiting from all this growth, 30% plus square footage growth from these 100 locations and focusing on at least the mid-teen operating rate, if not better, in terms of how weâ\u0080\u0099re setting up our plans for next year. You may proceed with your question. As far as AEâ\u0080\u0099s trend, if I think that was the first part of your question, yes, I think we expected coming into Q3 on top of a very hyper back-to-school season last year with really not having a 2020 back-to-school, stimulus checks out there again, starting in July last year, just that pent-up demand and the amount of money that came to us going back to school in the brand because we are such a back-to-school destination. You may proceed with your question. You may proceed with your question. You may proceed with your question. You may proceed with your question. Itâ\u0080\u0099s very â\u0080\u0093 something we are very focused on, not just for the back half, but we are really â\u0080\u0093 I think itâ\u0080\u0099s a major opportunity for us next year in terms of improved profitability obviously, for the brand, but then impacted the company as well."
}