{
    "symbol": "INT",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-23 22:16:15",
    "content": " Consolidated revenue for the full year was a record $59 billion, up $28 billion are at 8% year-over-year, related to the increase in average fuel prices, as well as volume increases across all of our business segments compared to 2021. Consolidated gross profit for the fourth quarter was $282 million, that's a 31% year over year increase, and full year gross profit was $1.1 billion, up $300 million or 38% year over year. Our aviation segment contributed $111 million of gross profit in the fourth quarter, a slight increase compared to the results in the fourth quarter of last year. For the full year aviation gross profit was $357 million, a decrease of 8% compared to 2021, principally associated with the negative impact of the steeply backwardated market in the first half of this year or last year, as well as the reduction of government related activity as a result of the troop withdrawal from Afghanistan in the summer of 2021. The Marine segment generated fourth quarter gross profit of $56 million, that's an 85% year over year increase. Our land segment delivered gross profit of $116 million in the fourth quarter, that's a 54% year over year increase. With our '22 results reflecting full year flyers results, as you can see on the webcast slide, total North American commercial and industrial gross profit derived from gasoline, diesel and lubricant sales, including our car lock activity in nearly 450 network sites across the U.S. increased from 20% in 2021 to 47% in 2022. For the full year 2023, we may focus on driving further year-over-year improvement in gross profit by capitalizing on organic and inorganic growth opportunities and identifying greater efficiencies in our North American land fuels business, while also accelerating growth in our sustainability related business activities. For the full year, interest expense is currently expected to exceed 2022 by approximately 15% to 20%, principally related to the first quarter as interest rates had already increased by the second quarter of 2022. During the fourth quarter, operating cash flow was negative $91 million despite the negative operating cash flow in the fourth quarter and the negative cash impact of backwardation on our aviation results in the first half of 2022, we did generate $138 million of operating cash flow for the year."
}