{
    "symbol": "STE",
    "quarter": 3,
    "year": 2022,
    "date": "2022-02-09 13:52:03",
    "content": " After today's presentation, there will be an opportunity to ask questions. And good morning, everyone. Speaking on today's call as usual, be Mike Tokich, our Senior Vice President and CFO, and Dan Carestio, our President and CEO. This webcast contains time-sensitive information that is accurate only as of today, any redistribution, retransmission, or rebroadcast of this call without the expressed written consent of STERIS is strictly prohibited. Many important factors could cause actual results to differ materially from those in the forward-looking statements, including without limitation, those risk factors described in STERIS's securities filings. An addition on today's call, non-GAAP financial measures including adjusted earnings per diluted share, adjusted operating income, constant currency organic revenue growth, and free cash flow will be used. Additional information regarding these measures, including definitions is available in today's release, including reconciliations between GAAP and non-GAAP financial measures. And good morning, everyone. It's once again, my pleasure to be with you this morning to review the highlights of our third quarter performance. For the quarter, constant currency organic revenue increased 9%. Growth was driven by organic volume, as well as 100 basis points of price. Acquisitions added $333 million to revenue, which is broken down by segment in the press release tables. To assist you with your modeling within the healthcare segment of the approximately $210 million in acquired revenue, about 60% is consumable revenue from both Key and Cantel Medical. Gross margin for the quarter increased 90 basis points compared with the prior year to 45.1% as favorable productivity, pricing and acquisitions were offset by higher material and labor costs. We continue to face increased material labor costs, which totaled about $10 million in the quarter. As we look at the fourth quarter of the fiscal year, we expect increased pressure on material labor of approximately $20 million, about twice as much as we anticipated, just one quarter ago. For the full fiscal year, we anticipate absorbing approximately $45 million, an unplanned material labor costs. And as anticipated, we are seeing operating expenses such as travel and sales and marketing costs return, somewhat limiting EBIT margin growth. The adjusted effective tax rate in the quarter was 21% higher than last year, but in line with our expectations. We now expect the full-year tax rate to be approximately 21.5%, reflecting year-to-date actuals at our expectations for the fourth quarter. Our Balance Sheet continues to be a source of strength for the company at the end of the quarter, cash totaled $359.1 million. As anticipated, this is declined from the prior year due to costs associated with acquisitions and integration of Cantel Medical acquisition and higher Capital spending year-over-year. In particular, growth in our ASG segment remains very strong with 21% constant currency organic growth year-to-date. Healthcare has also rebounded nicely with 13% constant currency organic revenue growth in the first nine months and record backlog of $382 million at the end of the quarter. As our backlog in healthcare and Life Sciences suggests, the underlying demand for our products remains very strong. The integration of Cantel is progressing ahead of our expectations, as we indicated last quarter. Reflecting our strong performance to-date, we are increasing our constant currency, organic revenue outlook to the high end of our previous range and now anticipate approximately 11% growth for fiscal 2022. We are also increasing our earnings per diluted share outlook and now expect earnings to be in the range of $7.85 to $7.95, or $0.10 above the high-end of our prior outlook. We completed the divestiture of our renal business, which will reduce both revenue by about $45 million and diluted EPS by about $0.05 in the quarter. In addition, we expect supply chain and inflation to be incrementally worse by about 10 million sequentially, as Mike discussed. However, we're leaving some room on the downside of our earnings range to reflect the continued uncertainty. Our first question will come from Matthew Mishan with Key Bank, please go ahead. If I'm modeling it correctly, I'm coming in somewhere in the fourth quarter, around 5%, which would be a sequential deceleration. And then also, how should we be taking into account your ability to shift on healthcare Capital Equipment backlog given the, really, the massive number you have in orders versus maybe in a difficult DDI in supply chain and getting those actual customers. And we've also baked in what we believe is some slowdown that we saw in January and continuing into some of February in terms of procedures as it relates to Omicron, in particularly across the U.S. We believe we've got that appropriately factored into our expectations. And we have, in our model, forecasted that we're providing an assumption that there's going to be some hold-back of equipment that won't go, just due to timing. It's more of an issue of some extent, our customer’s appetite to receive that equipment within the quarter. Nonetheless, that I think what we've stated before there was about somewhere around $20 million increase in backlog that we would have attributed to deferral or supply chain issues and things of that nature. I don't think Matt that will flush that out this quarter, and I think it would be unreasonable to expect that in the current environment, but we'll carry that backlog forward into the first quarter of next year. As we look at the corporate costs, the corporate costs or the other costs, as low as  did come down significantly from 2Q into 3Q. So yeah, we do we did anticipate that we are going to get more cost synergies and you are exactly right, those are going to show up first in the corporate side, as we have taken the opportunity to reduce the redundancy of the corporate costs, reduce the redundancy of the CEO, CFO. And as Dan spoke earlier, we anticipate overachieving those cost synergies in this fiscal year by about $10 million. The other thing that we're seeing, and I think we're like everybody else as our operating expenses have been bouncing around, especially around travel. We were anticipating more travel in the third quarter, which didn't happen. So there was nothing really transitory, and in those numbers that would necessarily bounce back significantly into the fourth quarter. Yes for the most part, I mean, the all the variance that I would see being out there is we are starting our fourth-quarter is the New Year from a calendar year from a benefit standpoint. So you will see some benefits costs that are normally higher, but year-over-year, those should be equal. And the other thing is at the end of the day, where does the management bonus occurring if there is an over achievement, obviously, you will see that also reflected in the fourth quarter. Good morning, everyone and congrats on a great quarter. I know it's a little bit early for fiscal -- the next fiscal year guide, but just maybe with broad strokes as we look at the business following on Matt it's an initial question. Capital in particular in healthcare, really has stepped up over the last several years and you do have a record backlog that you just alluded to won't pull-through all the way here in the fiscal 4Q. However, what I would say is the capital-spending we're seeing from large hospital systems, in particular across the U.S., and as well as surgery centers, and things like that nature, is unprecedented right now. And we're well-positioned with a really strong portfolio of Capital Equipment in Life Sciences, and then also in our surgical business, and our IPT business. And really what I'm getting at here, do we is this a stair-step where we're kind of flattening out here in these record levels for a little bit. But as the mix continues to shift, you have a chance for another step-up in margin, or do we need to think about the operating margin contribution from here really becoming more a function of volume through the plant expansion at the AST side. I think in terms of AST, I would definitely point to volume and we have a number of legacy older plants that are quite full, tend to contribute at the high end of margin the portfolio. But in aggregate with the total business, it doesn't really have a significant impact because there's been a steady diet of those plants coming on over the last few years. We would expect -- with the exception of OpEx coming back, we would expect the margin rate in the ASP business pretty much. In terms of the Life Science business, the one caveat there is that there is some lumpiness to our capital shipments from quarter-to-quarter. In a whole, as we continue to grow consumables at a nice rate, that will have an impact on the overall margin of the business. However, if we keep taking orders on the capital side of the business like we have, I'm not sure that that is going to hold up. So if you're going to adjust the model going forward, there was there was a small piece that was at the Life Sciences business, but nothing really material. Again, our best guess is it's around $0.05, so I wouldn't dramatically change for next year if it's $0.04 or $ , who knows, but again, more IR Matthew  than anything more directionally, didn't give you an indication. And then, just the really strong AST growth. I think it's in the past, you had had some kind of COVID benefit in there from PPE and things like that. Yes, its demand from our normal med-tech customers, and PP&E is diminished back to pre - COVID levels or less than right now. Then just finally given the strong backlog, great to see that, increase in backlog. They would move a little quicker through the plant, but the percentage increase that we have in backlog is unreasonable to expect our factories to turn as the same rate that we were six or nine months ago Realistically. And like I said, I don't think we're going to flush that through this quarter. It's going to take some time for those things, working themselves out. And the other thing too is a lot of these orders because a lot of it, long-term capital investment from particularly the healthcare sector, they're not asking for them to be delivered on March 15th necessarily. A bit of a spot, but Mike, I think you said leverage is at 2.6 and obviously the last  you did have been very . As I mentioned, we have brought leverage down below 2.6 times at the end of Q3, obviously, with the additional payment of about a $170 million that we will put forward for the Renal divestiture. Obviously, leverage will continue to drop lower than that by the end of the fiscal year. So right now, we are have the ability to more than one times for from a leverage standpoint to do something from an M$A standpoint. We will start getting back to more, I'll call tuck-ins, but again as everybody knows, we've been really more focused on the integration of both Key surgical and Cantel Medical. But we are getting back towards, with leverage being below 2.5 at this point going forward. We are back to looking at opportunities to continue to grow the business, but more from a tuck-in standpoint as what you've seen in the past. Are you sort of reporting this on a lag basis where you buy inventory at a higher cost, a couple of months ago. And then it starts coming through in January, February, March, or these the spot prices that you're seeing in the current market that could actually flow through in FY'23. Know this, this will be the actual amount we anticipate based upon the inventory turns at our various capitalization that we're talking about. Is it something in which is getting better through on us, at least on a spot basis, where you see going out a couple of more months, the prices are starting to come down, or should we think about this $20 million level incrementally flowing through into next year?"
}