{
    "symbol": "PANL",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-10 13:04:04",
    "content": " During a period of broader market volatility, our diverse portfolio of stable, long-term transportation contracts, leading positions in higher-margin ice-class trade routes and larger owned fleet culminated in a strong third quarter performance, one highlighted by significant year-over-year growth in operating cash flow and adjusted EBITDA, together with another consecutive quarter of profitability, as our realized TCE rates outperformed the market index by 41%. We ended the third quarter with cash and equivalents of $118 million, an increase of nearly $70 million versus the year ago period, while our ratio of net debt to trailing 12-month adjusted EBITDA was 1.2x at third quarter end, down from 2.9x in the prior year period. Third quarter TCE rates were $24,107 per day, a premium of more than 40% to the average published market rates for supramax and panamax vessels, which is supported by our long-term COAs and the seasonal Ice Class demand during the quarter. The decline in revenue was more than offset by lower charter hire expenses, which declined by $53 million year-over-year to $50.6 million during the quarter driven by a decrease in charter in days due to the expansion of our owned fleet and our flexible charter-in strategy, allowing us to supplement our own fleet with short-term chartered-in tonnage at prevailing market rates when needed to meet cargo demand. In total, our reported GAAP net income attributable to Pangaea for the third quarter was $18.8 million or $0.42 per diluted share, a decrease of $8.2 million or $0.18 per diluted share relative to the third quarter of last year. Excluding the impacts of the derivative instruments as well as other non-GAAP adjustments, our reported adjusted net income attributable to Pangaea during the quarter was $23.3 million or $0.52 per diluted share, an increase of $1.6 million or $0.04 per share compared to the third quarter of last year."
}