{
    "symbol": "FLUX",
    "quarter": 1,
    "year": 2023,
    "date": "2022-11-10 20:44:05",
    "content": " In the first quarter fiscal '23, we received $9.7 million in customer purchase orders from existing and new Fortune 500 customers, reflecting the timing of deliveries with customer new forklift orders. The new orders for Q1 '23 decreased 17% to $9.7 million compared to $11.6 million in Q4 '22, due to the lumpiness from timing of deliveries of customer new forklift orders, although not reflecting slowing of customer demand. In order to mitigate supply chain disruptions that we do have and support timely deliveries, our inventory turns during the quarter increased from 3.4 turns to 3.6 turns, as improved manufacturing capacity and production processes, including progress implementing Lean Manufacturing, help increase throughput, reducing the time to fulfill customer orders. Our current potential pipeline of customers continue to expand with two new Fortune 500 customers this past quarter, and a full product line that caters to large fleets who seek a relationship partner to meet their ongoing needs. During the quarter, inventory increased to 18.9 from 16.3 at June 30 to mitigate supply chain disruptions and support time deliveries, as I mentioned previously, and inventory turns as mentioned as well have continued to improve from 3.4 to 6.2, to 3 -- from 3.4 to 3.6 turns during the quarter, reflecting the sourcing and production improvements I have highlighted. As Ron mentioned, revenue for the fiscal first quarter of 2023 increased by 184% to $17.8 million, compared to $6.3 million in the fiscal first quarter of 2022. Research and development expenses decreased to $1.2 million in the fiscal first quarter of '23, compared to $2 million in the fiscal first quarter of '22 was primarily due to timing of expenses related to our development and testing of new products. We ended the fiscal quarter of '23 with $300,000 in the - in cash and have our $8 million working capital line of credit with Silicon Valley Bank, of which $1.4 million is currently available and our 5 million LOC facility of which there's $4 million of signed committed debt availability."
}