{
    "symbol": "FLUX",
    "quarter": 2,
    "year": 2023,
    "date": "2023-02-09 18:49:04",
    "content": " In the second quarter of fiscal 2023, we received $20.7 million in customer purchase orders from existing and new Fortune 500 customers, reflecting the alignment of timing of deliveries with customer new forklift orders. Our current and potential pipeline of customers continues to expand with two new Fortune 500 customers this past quarter, and a full product line that caters to large fleets who seek a relationship partner to meet their ongoing needs. Price increases on new orders, increased back volumes, more competitive shipping costs, lower costs, more reliable and secondary suppliers of key components, improved manufacturing capacity and production processes, new product designs to lower costs and finally, transition of product lines to a new modular platform, all of these are part of our plan to accelerate gross margin improvement. As Ron mentioned, revenue for the fiscal second quarter of 2023 increased by 123% to $17.2 million, compared to $7.7 million in the fiscal second quarter of 2022. Research and development expenses decreased to $1.2 million in the fiscal second quarter of 2023, this is compared to $2.1 million in the fiscal second quarter of 2022 and this was primarily due to lower staff lending expenses and timing of expenses related to development of our new products. We ended the fiscal second quarter of 2023 with $200,000 cash and we have our $14 million working capital line of credit with Silicon Valley Bank, as well as our $5 million credit facility of which there's $4 million of signed committed debt availability. So run that line out and you'll see that when you do that it's in the very near future, you'll see the very impressive quarter-over-quarter, quarter-over-prior year increases in our margin, and getting to that breakeven is a combination of continuing growth of revenue projection, to cover our infrastructure and operating costs that are in place to bring on these new large customers that we can serve, and most importantly retain and keep happy."
}