{
    "symbol": "ONB",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-25 16:07:13",
    "content": " In closing, we will continue to demonstrate the strength of our expanded franchise with commercial loan growth for the third quarter of nearly 17%, significant improvement to our net interest margin because of our deposit franchise, and continued strong credit, capital and efficiency metrics. As we look forward, we expect the loan portfolios to continue to grow, margins to continue to expand driven by our below peer deposit costs, organic growth of our wealth management client base, disciplined expense management and continued savings from our merger synergies and strong relative credit metrics. Thank you for your question. Thank you for your question. No, I think $225 million is a good launching point and base to move off of into 2023 and you layer in some you know merit increases as we talked about weâ\u0080\u0099re not going to stop hiring. Thank you for your question. Chris, your line is now open. You know I think if you look at you know, Brendonâ\u0080\u0099s expense guidance and expanded margin you know I think modest improvements are expected but itâ\u0080\u0099s not going to be and maybe as quickly as we got to 50%, 51%. Thank you for your question. You know I think like everybody else, weâ\u0080\u0099re wondering about you know what next year brings us but you know the pipeline was our second highest pipeline of $5.4 billion, Brendon told you our accepted category is not meaningfully, I mean so you know we continue to expect the portfolios to grow just the pipeline down after we closed you know, $2.4 billion this quarter, but weâ\u0080\u0099re really not slowing down at all. I think internally, we are meeting our own expectations around our growth in that business for â\u0080\u0093 from the organic acquisition of new clients, and Nashville and you know our high-net-worth teams are off just a really strong start. Thank you for your question. Chris, your line is now open. Thank you for your question."
}