{
    "symbol": "ATY",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-09 11:33:03",
    "content": " We reported record total revenue for Q4 2022 of $40 million, which was driven by strong annualized and sequential sales growth from illumin of 121% and 70% respectively. Total revenue for the fourth quarter of 2022 was $40 million, as I previously mentioned, up 9% from Q4 2021 of $37 million, and up 38% sequentially compared to $29 million in Q3 of this year. For the fiscal year 2022, total revenue was $121 million, mostly flat with $122 million of the prior year. Revenue from managed services during the fourth quarter was $26.6 million unchanged from Q4 of last year, and a 30% increase sequentially from Q3 of this year of $20.4 million. For the fiscal year 2022, revenue from managed services was $81 million, compared to $91.8 million in 2021. Self-service revenue for Q4 2022 was $13.4 million, an increase of 31% compared to $10.2 million in the prior year, and a 57% increase sequentially compared to the $8.5 million in Q3 2022. For the fiscal year 2022, self-service revenue was $40.1 million, a 33% increase compared to the $30.2 million in 2021. And for the 3 months and 12 months ended December 31, 2022, illumin revenue was $22.5 million and $53.7 million respectively, compared to $10.2 million and $26 million in revenue in the comparable 2021 periods. Our gross profit or net revenue, which is defined as the total revenue less media-related costs was $19.4 million in Q4 2022, an increase of 1% compared to $19.1 million in Q4 2021. Gross profit or net revenue for the fiscal year 2022 was $60.8 million, compared to $63.6 million in 2021. Our total operating expenses for the fourth quarter of 2022 were $19.6 million, compared to the $16.1 million in the same period last year, and $16 million in Q3 of this year. And as a result, we've generated EBITDA in Q4 2022 of $2.4 million, compared to $5.9 million during the same period in 2021, and $1.6 million in Q3 of this year. For the full-year 2022, adjusted EBITDA was $5.8 million, compared to $20.3 million in 2021. The net loss for Q4 2022 was $0.8 million compared to net income of $2.7 million to the same quarter last year, and $3.2 million in Q3 2022. For the full fiscal year 2022, our net loss was again $0.8 million compared to net income of $11.8 million in 2021 due to the factors I described earlier."
}