{
    "symbol": "SWKH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-11-11 11:23:05",
    "content": "  Operator: Good morning, and welcome to the SWK Holdings Third Quarter 2022 Financial Results Conference Call. I would now like to turn the conference over to Jason Rando, Tiberend Strategic Advisors. Good morning, everyone, and thank you for joining SWK Holdings third quarter 2022 financial and corporate results call. Yesterday evening, SWK Holdings issued a press release detailing its financial results for the three months ended September 30, 2022. Before beginning today's call, I would like to make the following statement regarding forward-looking statements. Today, we'll be making certain forward-looking statements about future expectations, plans, events and circumstances, including statements about our strategy, future operations and the development of our consumer and drug product candidates, plans for future potential product candidates and studies and our expectations regarding our capital allocation and cash resources. Actual results may differ materially due to our risks and uncertainties, including those detailed in the Risk Factors section of SWK Holdings 10-K filed with the SEC and other filings we make with the SEC from time to time. SWK Holdings disclaims any obligation to update information contained in these forward-looking statements, whether as a result of new information, future events or otherwise. Joining on today's call from SWK Holdings is Jody Staggs, President, Interim CEO; and Yvette Heinrichson, Chief Financial Officer. Thanks, Jason, and thanks, everyone for joining our third quarter conference call. This has been a productive past few months for the SWK team, and I look forward to sharing our progress. And I also want to thank my predecessor, Winston Black, who has left SWK in a strong position. Since 2012, SWK has completed transactions with nearly 50 parties, funding almost $700 million. Our focus is financing in the $5 billion to $25 million range, and we have created a niche and non-name-brand  sponsored situations, a memory competitive field. We also focus on smaller off-the-road royalties, while most larger competitors gravitate towards Tier 1 high-profile royalties. During the third quarter, our effective yield was 14.3%, while our realized yield was 17.5%. However, in the third quarter, we closed 225 million financings with larger borrowers, demonstrating that our platform is valuable to companies on the larger end of our target range. I think our financial assets are somewhat obvious to all, and you can certainly review these in the press release in the marketing deck. The first is our existing portfolio of yielding finance receivables and other tangible book value assets, and this is about $19.14 a share. The second is our deferred tax asset, which is on our books for $1.45 a share. And the third is our insurance  assets, which are on our books for just over $1 a share. Our corporate team currently is six, which will increase to seven next week, and we anticipate adding a couple of additional investment professionals in 2023. While the team isn't large, the team does possess the skill set specific to succeed in our market vertical. The third intangible asset is an extensive proprietary deal sourcing via our network of executives, Board members, intermediaries, co-lenders and former deal partners. And fourth, we have a strong underlying track record with a 20% IRR and 1.4 times MOIC on 30 exits. Looking ahead, our leadership team is energized to build upon these valuable assets as we seek to scale our platform and drive per share value. To facilitate this, we are evaluating added leverage to our balance sheet, and we will do this in a responsible fashion and being mindful to our particular financing assets. Our current $22 million ABL is too small for SWK, and we're working with our existing lender to address this, and we hope to have an update on this by year-end. But based on recent specialty finance bond offerings and considering our asset yields, we continue to think this is an attractive alternative. First, we will improve our return on equity, which is a metric closely linked to how financial equities trade as a percent of both value. And secondly, the additional capital allows us to pursue more financings, which helped develop the SWK team and our ecosystem. In the medium term, we're also exploring a third-party asset management strategy. SWK has a platform, know-how and track record that is valued. We are in the early stages of exploring what might be possible here and anything we do will require finding the right partner and, of course, we will need to benefit our shareholders. These initiatives are focused on driving SWK's value per share, which is our North Star. One way we can augment this metric is more capital allocation and, in particular, repurchasing stock at attractive valuations. During the third quarter, we repurchased over 34,000 shares at a $17.49 average cost via our 10b5 program. Itâ\u0080\u0099s important that our shareholders know, we have a sophisticated board which balances the return that can be achieved by buying back stock with return from making additional loans and royalties. We don't focus on the stock price on a day-to-day basis, but over a reasonable period of time, the Board and Management Team want the stock price to reflect the value of our assets and platforms. Given SWK's strong foundation as well as a clear path to scaling the platform and driving shareholder returns, you can understand why the team is energized by the opportunity presented to us. While our portfolio companies are not immune to the current economic and capital market challenges, our outlook for the remainder of 2022 and into 2023 is optimistic. However, we are also playing offense and targeting several financing opportunities, as the ongoing market volatility makes our non-dilutive structures attractive to companies in need of capital. With that, I would like to turn the call to our new CFO, Yvette Heinrichson, for an update on our financial performance for the quarter. SWK and our shareholders will benefit from initiatives that Yvette is spearheading, including optimizing our capital structure and streamlining processes required to support financial receivables growth. As of September 30, 2022, SWKâ\u0080\u0099s total investment assets grew by 8% to $222.2 million from $206.3 million for the third quarter of the previous year. Please note that, that quarter end figure does not include portfolio movement post quarter end. At the end of the quarter, the weighted average projected effective yield of our finance receivables portfolio, including non-accrual positions, was 14.3%. As Jody mentioned earlier, this is above SWKâ\u0080\u0099s historical range and represent an increase from 13.8% from a year ago. SWK reported non-GAAP tangible financing book value per share at $19.14 as of September 30, 2022. That's a 9.4% increase from $17.50 as of September 30, 2021. This figure excludes the deferred tax assets, intangible assets, goodwill and contingent consideration payable. The finance receivables segment's adjusted return on tangible book value was 11.1% as of September 30, 2022. For the third quarter 2022, SWK reported total revenues of $13.6 million. The decrease in finance receivables segment revenue was primarily due to a $1.3 million net decrease in royalty income, which was primarily due to the achievement of return premium that caused a step down in royalty rates. GAAP net income for the third quarter of 2022 totaled $6.6 million or $0.51 per diluted share, compared to $2.2 million or $0.17 per diluted share for the third quarter of 2021. For the third quarter 2022, adjusted non-GAAP net income generated by our finance receivables segment was $6 million compared to $7.7 million for the third quarter of 2021. In conclusion, SWKâ\u0080\u0099s fundamentals are strong and the current market conditions are ideal for our custom financing solutions. So to get started, I was just wondering about the update on timing for adding leverage to the balance sheet. I think the first step, I expect us to have an update, very new term on math, so fourth quarter on the ABL. The second step, which we think could be the unsecured debt. The 10 years down, and it's potentially opening up a window here. So, if the market is open and we can get kind of the paperwork lined up, it's something that I think we can get done in a reasonable period of time. I don't want to say an exact date and fourth quarter would be aggressive, but I think the watch word, I want to convey is there's a sense of urgency to get these things done. You mentioned you are currently at 6% and looking to be at 7%, I believe. So, we have an investor professional starting Monday and the -- that will bring our investment team to four, including me, and then our financial -- financing accounting team to three. If we can make those two hires -- and those aren't -- they are not things that need to happen tomorrow, I think that really puts the team in a great spot and gives us the kind of throughput unit to scale the platform. So, right now, I think we've got a decent baseline. We can add those two, I think we're going to be in great shape, and we just need to find the right people. Yes, that's a good process for that, and that makes a lot of sense. If you had capital right now, I think we would have several deals that we would be pushing at close. So, the rates may be roughly the same as the things we've looked at, but we're looking to finance better assets, higher quality assets, more equity, better lender terms. And then the returns on those, of course, is data returns look amazing, but we're really not focused there right now. So, pipeline is strong, lots of flow, and we're really just trying to sift through the things that kind of make sense for SWK. Yes, just to echo Winston, the quarter -- these are -- as I said, there are seats that were planned quarters and years ago under his leadership. So SWK, invests in OIA, so we have that already taken care of. But if you go to sort of the GP LP fund, which would be the hardest to do, I think, particularly as we would be first-time fund boats. I think -- yeah, I think you're right the cost to do that would be higher the regulatory cost, we would need that IR outreach and of course, you've got to find those LPs that would require help. If you go all the way to the other side of a kind of like a fund of bond or maybe there's a general credit group that wants to allocate to cost space, I think the cost and the regulatory bond there is much lower. Now at the same time, you should expect the fees to scale from what's right as well. And I guess my next one since most have been expanded upon already is obviously, you've shown great progress at Cara got another milestone, and you just presented your data for Ovarest in I think, last month. And I'm just kind of wondering what might be the next step there, both from a regulatory standpoint. Do you launch in on your own, which obviously that goes to a Phase 3 would be a higher cost structure. So given the leadership change and consider we've owned Enteris for three years, I feel like it made sense to just evaluate where we are and kind of where we're going with Enteris. So I'm working with the Enteris team and an adviser to really assess value, evaluate the assets and also the cost structure. But we'll be able to tell you more, I think, in the fourth quarter. So just as a general comment, I think that's important to note. In terms of what exactly that means, we're going to understand more as we do this evaluation party and work with the team, the third-party. SWK's not funding the base story, just to be very clear. So interesting asset, SWK is not in the drug development business, full stop. I mean just there's been so much interest in that space, the French government coming out and making it a priority to work on endometriosis."
}