{
    "symbol": "HYFM",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-10 21:22:09",
    "content": " On this basis, adjusted gross profit was $22.3 million, or 20% of net sales in the first quarter, down slightly from $23.4 million or 21% of net sales last year. Selling, general, and administrative expense increased to $43 million in the first quarter of 2022 compared to $16.8 million in the year ago period. The increase in SG&A was primarily due to $13.5 million increase in amortization expense, again, due to stepped-up asset values from the acquisitions, distribution center relocation costs, acquisition and integration-related costs, and certain other noncash expenses detailed in the back of today's earnings release. Adjusted SG&A expense, which adjusts for these items, was $19.2 million, or 17.2% of net sales in the quarter, versus $13.5 million, or 12.1% last year, primarily driven by an increase in compensation costs, facility costs, and insurance expenses. Reported net loss was $23.3 million, or $0.52 per diluted share in the first quarter compared to income of $4.9 million, or $0.13 per diluted share, last year. Adjusted net loss for the quarter was approximately $7.8 million, or $0.17 per diluted share, compared to an adjusted net income of $7.2 million, or $0.18 per diluted share, in the year ago period. Lastly, adjusted EBITDA decreased to $3.1 million in the first quarter from $9.9 million in the prior year period. Adjusted EBITDA margin decreased to 2.8% from 8.9% in the prior year period, driven primarily by higher SG&A expenses relative to net sales in the period comparisons as well as the $3.2 million inventory reserve I mentioned earlier. But we all can't forget that if you use Headset dispensary data, then people are still buying more cannabis through the dispensaries than they were last quarter, than they were a year ago, which suggests that consumption is still growing, and eventually, that's going to balance out inventory and get demand and inventory and growing back in balance, and you'll see growth return to the category."
}