{
    "symbol": "ACST",
    "quarter": 4,
    "year": 2022,
    "date": "2022-06-21 14:54:04",
    "content": " Forward-looking statements during this conference call may include, but are not limited to the success and timing of regulatory submissions of the planned Phase 3 study for GTX104 and Acastiâ\u0080\u0099s other pre-clinical and clinical trials, regulatory requirements or developments and the outcome of meetings with the FDA, changes to clinical trial designs and regulatory pathways, legislative, regulatory, political and economic developments and cost associated with Acastiâ\u0080\u0099s clinical trials. Given that we conducted our last conference call only about a month ago when we announced the positive results of our PK bridging study for GTX104, we plan to keep today's prepared remarks covering our fiscal year 2022 rather brief, allowing for more time at the end for questions. SAH is estimated to affect about 50,000 patients per year in the United States alone and based on our market research we believe that GTX104 represents a total available market in the United States of more than $300 million. The objective of this important PK study is to compare the bioavailability of three different doses of GTX102 to an oral solution of betamethasone, which is only available in Europe and to the injectable form a betamethasone, which is available in the U.S. Based on the FDA's guidance following the PK bridging study and assuming the PK bridging study meets its primary endpoint, we plan to conduct a Phase 3 safety and efficacy trial in A-T patients, which is expected to be initiated in the first half of 2023. Research and development expenses, net of government assistance for the year ended 31st 2022 totaled $5.6 million, compared to $4.2 million for the year ended March 31st 2021. Our research and development during the year March -- ended 31st 2022 was focused primarily on advancing our three clinical development programs for our GTX104, 102, and 101 drug candidates. Next year -- I'm sorry, net loss for the year ended 31st 2022 was $9.8 million or $0.27 per share compared to a net loss of $19.7 or $1.33 per share for the year ended 31st 2021."
}