{
    "symbol": "HGV",
    "quarter": 4,
    "year": 2022,
    "date": "2023-03-01 12:10:12",
    "content": " We had a solid contribution from new buyer channels, which has been a key area of focus and investment, with continued strength in leisure demand and good execution from our teams, we've been successful at activating our package sales pipeline to drive tour growth, which generates NOG and importantly, embeds future value into the business. We've built a strong foundation to build upon in 2023 and beyond with our new membership, new programming, new destinations and rebranded resorts we think that our value proposition is the strongest that it's ever been, which is why we're seeing such a great response from our owners and new buyers. From the first half of the year, prior to our investment, to the second half of the year, we saw strong improvements in new buyer tour flow and contract sales pace against 2019 that well exceeded the growth from our owner channel and helped to drive solid NOG growth of 3.9%. Real estate S&F expense of $243 million for the quarter was 38% of gross contract sales, similar to third quarter levels and reflecting our investments in the new buyer channel. If you look at our new buyer tour flow compared to 2019 in Q1, we're at 60%; Q2, 68%; Q3, 74%; Q4, 78% and our expectations is that that trend is going to continue building, because our activations have really picked up, and our package pipeline is well over 0.5 million packages that we have in the pipeline. So as we've indicated for several quarters, we think the mix shift as we shift into more new buyers will moderate our VPG from these 22-highs, more on a glide path to what we've been saying for a number of quarters now to about 10% to 15% above what we saw in 2019. As Mark was talking about the package sales, we're well over $0.5 million year-over-year, that's increased 18%, but the investment we've made to activating those packages, I think is really underscored by the fact that the percent activated has grown 80% year-over-year."
}