{
    "symbol": "HGV",
    "quarter": 1,
    "year": 2022,
    "date": "2022-05-09 16:16:03",
    "content": " In fact, we produced a number of records this quarter including record VPGs driven by record close rate, record sales to domestic U.S. buyers of white, and the biggest March contract sales ever at both HGV and Diamond, all of which supported another quarter of EBITDA above 2019's combined levels with very impressive margin gains. We've also made solid progress on our cost synergies, ending the quarter at a run rate of $120 million in savings versus the $74 million run rate last quarter and we've identified an additional $25 million of synergies, bringing our total cost synergy target to $150 million. Contract sales for the quarter were $509 million, or 96% of 2019's pro forma combined sales. As we've benefited from several positive drivers in the quarter, we made solid progress on our synergy initiatives in the first quarter with a run rate cost energy captured now at $120 million versus $74 million that we recorded in Q4. And as you saw on our release today, we've identified additional initiatives allowing us to raise our cost synergy target to $150 million from our prior estimate of 125 million plus, we also generate a contract sales in a more efficient way than expected with stronger VPG outpacing the recovery and tours, which produce high flow through and drove the strongest Q1 margin performance in our history as a public company. I'm also happy to say that our performance in the quarter and better than expected deleverage, coupled with our increased outlook on EBITDA and cash flow, have enabled us to resume our share repurchase program earlier than anticipated with a $500 million authorization. At quarter end, we had $439 million of remaining capacity in our warehouse facilities, of which we had $154 million of notes available to securitize and another $238 million of mortgage notes we anticipate being eligible following certain customary milestones, such as first payment, feeding, and recording. Following quarter end, we were also able to consolidate the legacy HGV and DRI warehouses into a single $750 million facility with significantly better pricing on both used and unused basis."
}