{
    "symbol": "RH",
    "quarter": 3,
    "year": 2022,
    "date": "2022-12-08 18:45:02",
    "content": " Itâ\u0080\u0099s that discipline and long-term thinking that has enabled us to set new standards for financial performance in the home furnishings industry and our results now reflect those of luxury brands as we delivered 20.8% adjusted operating margin in the third quarter, also exceeding our outlook despite the dramatic slowdown in the housing market. This leads to our long-term strategy of building the world's first consumer-facing architecture, interior design and landscape architecture services platform inside our Galleries, elevating the RH brand and amplifying our core business by adding new revenue streams while disrupting and redefining multiple industries. And the introductions we're going to make across the entire portfolio, but the new gallery design that we're going to unveil, and we'll go through and remodel and redesign all of our current Galleries and refresh all of those, as well as the platform we're building globally for the brand is going to once again transform RH and then put us in a position where we create massive strategic separation. I don't think anybody on the phone has either and the impact on the housing market, especially when you look at it versus the housing market that was overinflated and run up by COVID, you're going to have some wild swings here. We're trying to just look at the patterns and look ahead and say, what's the best way to play this, where we come out and we really are positioned for the next five to 10 years, not the next two to three quarters or even the next five or six quarters. I think we were in seven countries or something like that and -- in the factories and meeting with the factory owners and talking about scaling not only what they're scaling up now, but what's coming next, which is -- I mean, you've just seen the first little introduction of Contemporary. I mean I think it's going to be -- we're going to own this entire kind of esthetic and look and be no different than how we approach 2008, 2009, when we took kind of the European Belgian kind of aesthetic and we went out there and owned it and did it at scale. And when you're going into kind of a storm that you haven't seen before, you don't want to sail -- or let's say, you're not in a sailboat, but you're in a boat -- you don't want to spend all your fuel before you can see the shore and run out and be floating around out there. I mean we're not -- if we were a company that had like 5% to 8% operating margin or even 10% or 12% operating margin, and you hit a downturn like this, that could be sustainable and it pulls you down and you might have a cash flow problem, yeah, then you're going to make decisions like that."
}