{
    "symbol": "RH",
    "quarter": 2,
    "year": 2022,
    "date": "2022-09-09 00:40:04",
    "content": " It's that discipline and long-term thinking that has enabled us to set new standards for financial performance in the home furnishings industry, and our results continue to reflect those of the leading luxury brands as we delivered 24.7% adjusted operating margin in the second quarter, also exceeding our outlook. The wine room would be seen -- the wine kind of impact and experience we started to create in San Francisco, where just the wine selection and curation -- if you come to RH New York for dinner, I mean, you're just going to see a completely different wine list. And what I love is the big moves we've made are all directionally right, are strategically right, whether it's Contemporary, whether what we have in the pipeline, that we're working on, whether it's the investments of RH In-Your-Home, whether it's the -- what we're doing in Europe, which I think, again, is going to be extraordinary. So there's -- I just look at the -- like how people are playing the game, what people are doing, what's like -- I just go like I like where we're at. Yes, we just believe what we're doing is going to position our brand correctly, elevate it and render it more valuable and that it all -- that's why we call it an ecosystem. It's just we choose to do it our own way and tend to -- and let us -- instead of like letting things kind of dribble out there and get a lot of impact or get noticed, we tend to kind of pull back, build an idea, build a big idea and then try to break through the clutter. There's -- in a market like we're going into, there may be businesses we want to acquire. So there's a lot of things you can do when you're in the position we're in and you've got optionality and 've got a really good business model that you can capitalize in any kind of a market, especially if we're heading into a recession. So it's just -- yes, we're just always looking at a lot of things, and we get people that bring us a lot of options and look at things. I mean I know it's mainly about advertising for the RH brand, which makes perfect sense to me, but I was just wondering if -- how we should be thinking through the financial implications, particularly given those room rates. But I think our restaurant -- I mean the restaurant of the Guesthouse, if you combine it with the Champagne and Caviar Bar, which is 32 seats, kind of in a cellar underground, I mean, between those 2 things, I think it's going to definitely be by far the highest volume, just food and beverage kind of restaurant experience we've ever done. And so -- but I think because it's so unique and so extraordinary that, I don't know, let's say, a difficult person is getting -- I mean the higher-end hotels like the Marcus and the Carlisle and other people are starting room rate at probably $1,300 to $1,600. Let's look at -- I think if you find -- if you just go look at the best hotels in New York City and even the new Aman, if you go in there and ask for a tour of the room, they'll probably give it to you because I don't think -- they opened, and it's not the quality level I would expected. I think it will demand a price that maybe no one has seen in New York and great level of exclusivity and scarcity that -- kind of like the luxury brand, kind of like a Birkin bag, so to speak. So that's why we feel relatively calmly with the numbers that we're giving you because we kind of -- when you don't feel calm is when you can't see the board and you can't see the game and you can't see the next several moves, you can't anticipate. Michael, just to clarify. Michael, just to clarify. Like even if we have a recession, could it be 18, 1 year because we're investing in that, yes, like that's not the relevant point unless -- I got it. I'm just so happy though that we had the courage to do the first one in New York because guys -- some people tell me, \"Oh, you have to do the first one in Nashville or Birmingham, Alabama or somewhere where there's not going to be all the critics and you can learn it.\""
}