{
    "symbol": "CAE",
    "quarter": 2,
    "year": 2022,
    "date": "2021-11-11 19:19:08",
    "content": " The pursuit of an expanded growth opportunities pipeline has so far netted CAE's nine accretive acquisitions, including the most recent announcement of our agreement to acquire Sabre’s AirCentre airlines operations portfolio, a highly valuable suite of flight and crew management and optimization software solutions, designed to enable airlines to operate their businesses with efficiency and precision. And with the expected closing of the AirCentre operations in our Q4, we will be using our existing liquidity, which will drive our net debt to cap higher, probably a little above the 40% but we're expecting quickly leveraging in the next fiscal year with the Harris cash generative business, organic business and with the cash flow accretiveness of this new acquisition. Well, it’s still early days with L3Harris but I'm quite comfortable when I'm saying that we're going to deliver -- the L3 Harris -- the old legacy L3Harris business and the synergies that we're -- that together that we're going to generate, we're going to be achieving the margins that we talked about when we acquired the business. And I can tell you, there's a palpable optimism out there as vaccination rates increase and that's on U.S. And when we're basically talking to airlines specifically in those areas like the United States, where we are seeing that increase in activity, because the vaccination rates are high and where level of infection is low, we can see a lot of activity as testimony by the rise in sales -- our sales activity, which is not only testimony to the orders that we've announced so far but in terms of the activity that I see, which is quite nice at the moment, the levels. So to me, that is a trend, we predicted that trend that this is an environment where there's going to be a lot more opportunities for people considering us as a really only viable global third-party option, where -- and in fact -- because pre-COVID you do 1 million hours plus a year of training, we offer a very, very good alternative. We're signing contracts for new airlines, we're signing contracts for overflow training agreements, where people want excess capacity right now in a lot of cases because -- the immediate -- like right now, or they want to ensure that they will have it as they ramp up operations to be able to seize the opportunity afforded by increased passenger traffic."
}