{
    "symbol": "NCNO",
    "quarter": 2,
    "year": 2022,
    "date": "2021-09-01 23:27:08",
    "content": " Total revenues for the second quarter of fiscal 2022 were $66.5 million, an increase of 36% year-over-year. Professional services revenues were $12.6 million in the quarter, growing 34% in the second quarter of fiscal 2022, reflecting solid billing and utilization rates on projects outside the U.S. We enjoyed a particularly strong quarter in international revenues. Non-U.S. revenues were $10.8 million or 16% of total revenues in the second quarter, up 129% year-over-year. Non-GAAP gross profit for the second quarter fiscal 2022 was $41.9 million, compared with $29.1 million in the second quarter of fiscal 2021, an increase of 44% year-over-year. Sales and marketing expenses for the second quarter of fiscal 2022 were $16.8 million or 25% of total revenues, compared to $11.9 million or 24% in the second quarter of fiscal 2021. Research and development expenses for the second quarter of fiscal 2022 were $16.9 million or 25% of total revenues, compared to $12.3 million or 25% for the second quarter of fiscal 2021. General and administrative expenses for the second quarter of fiscal 2022 were $10 million or 15% of total revenue, compared to $6.6 million or 14% in the second quarter of fiscal 2021. Non-GAAP net loss attributable to nCino for the second quarter of fiscal 2022 was $2.3 million or $0.02 per share, compared to non-GAAP net loss attributable to nCino of $581,000 or $0.01 per share in the second quarter of fiscal 2021. The portion of RPO greater than 24 months was up 92% over fiscal 2021 to $301 million, reflecting the large long-term contracts signed in the second quarter, which should position us quite well for continued topline growth. For the third quarter, we expect total revenues of $66 million to $67 million, subscription revenues are expected to be between $54 million and 55 million, non-GAAP operating loss is expected to be approximately $5.5 million and $6.5 million and non-GAAP net loss attributable to nCino per share is expected to be $0.06 to $0.07, based on a weighted average of approximately 936.6 million shares outstanding. We are increasing our guidance for the full year 2022 as follows; total revenues of $263 million to $264 million, subscription revenues are expected to be between $216 million to $217 million, and we expect non-GAAP operating loss for fiscal 2022 to be $21 million to $22 million and non-GAAP net loss attributable to nCino per share to be $0.22 to $0.23 based upon a weighted average of approximately 95.9 million shares outstanding. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open. Your line is open."
}