{
    "symbol": "NCNO",
    "quarter": 4,
    "year": 2022,
    "date": "2022-03-31 23:15:06",
    "content": " We achieved $274 million in total revenues in fiscal year 2022, an increase of 34% over fiscal '21. Shortly before this call, we issued a press release announcing one of those key wins, a new expansion deal with Wells Fargo, one of the big four banks in the U.S. As you recall, we first signed Wells Fargo for commercial lending in the second quarter of fiscal '22. Josh will touch on specifics of our international business shortly, but it was a strong year as we planted the nCino flag in numerous new markets from Germany to Japan, to France, to Spain, to South Africa, while continuing to grow our more mature international markets, such as Canada and the U.K. Another major highlight for us in the fourth quarter was completing our acquisition of SimpleNexus, a leading cloud-based mobile-first homeownership software company. Before I dive into the specifics, I'd like to remind everyone that nCino's growth strategy is based on four key pillars, continued expansion of our market-leading Commercial Banking solution, international expansion, nIQ and growth of our retail and consumer products, including SimpleNexus. Note that in fiscal year '22, nCino increased the number of customers using our U.S. retail lending and deposit account opening solutions by 37% and 46%, respectively. Total revenues for the fourth quarter of fiscal 2022 were $75 million, an increase of 32% year-over-year. Subscription revenues for the fourth quarter were $62.8 million, an increase of 40% year-over-year, representing 84% of total revenues. Fiscal year subscription revenues were $224.9 million, an increase of 38% year-over-year, representing 82% of total revenues. Professional services revenues were $12.2 million in the quarter, growing 5% year-over-year as we continue driving more professional services business to our partners. Fiscal year 2022 professional services revenues were $49 million, an increase of 17% year-over-year. Non-U.S. revenues were $12 million or 16% of total revenues in the fourth quarter, up 54% year-over-year. Non-GAAP gross profit for the fourth quarter of fiscal 2022 was $46.7 million, an increase of 38% year-over-year. Of our nCino bank operating system customers, 271 contributed greater than $100,000 to fiscal '22 subscription revenues, an increase from 224 in fiscal '21. Of these 271 customers, 47 contributed more than $1 million to fiscal '22 subscription revenues, compared to 36 at the end of the prior year. Please note that our guidance assumes a little over $7 million of annualized subscription revenues from PPP will churn in the first and second quarters of fiscal '23, which does present some headwinds to organic growth rate."
}