{
    "symbol": "FI",
    "quarter": 2,
    "year": 2021,
    "date": "2021-08-03 15:22:06",
    "content": " Good morning, and welcome to the Frank's International conference call to discuss our second quarter results. Our speakers today, as shown on slide 2 of the earnings presentation, are Mike Kearney, Chairman, President and Chief Executive Officer; and myself, Melissa Cougle, Senior Vice President and Chief Financial Officer. We delivered solid second quarter results, with adjusted EBITDA increasing 85% sequentially. Customer activity levels have continued to increase across all of our segments and geographies, starting with revenue growth of 8% sequentially in our Tubular Running Services segment. In our Tubular segment, revenue increased 42% sequentially, with strong tubular deliveries and higher drilling tool activity, including an international tubular delivery. Although, we experienced a pullback in our Tubular segment in the first quarter, we did see the expected improvements in both domestic and international tubular deliveries in the second quarter and believe the second half of the year will bring more steady progress, barring any unplanned delays in deliveries. During the second quarter, revenue increased 14% sequentially showing strong growth. The company was able to translate these increases into significantly improved profitability with adjusted EBITDA of $12.4 million, an increase of 85% from the prior quarter. The teams of both respective companies are dedicated to creating one of the strongest oilfield service companies in the industry and providing some of the most innovative solutions to our customers globally Second, Frank expects to experience additional improvement in the second half of the year, as we maintain a strong line of sight on additional rig deployments and project start-ups. Finally, we will continue to focus on operational execution, capital discipline and cost reduction efforts, which has enabled us to maintain one of the strongest balance sheets in the oilfield services space. As we approach the closing of the Expro merger, I would like to reiterate my continued thanks to all of our employees for their hard work and dedication to the Frank's organization. Many thanks to everyone on the call, for your continued interest in Frank's."
}