{
    "symbol": "RC",
    "quarter": 2,
    "year": 2021,
    "date": "2021-08-05 14:30:50",
    "content": " Building off a record first quarter, our SBC lending segment grew 17% quarter-over-quarter originating a record $1.1 billion with increased volume across all loan products. First transitional loan origination posted a record $807 million across 47 loans, the segment benefiting from post COVID demand by strong sponsors looking to either acquire our reposition previously underperforming assets. Originations in the quarter were $146 million, a record for our business and 190% growth from last quarter's volume. Additionally, increased production in our SBA, Freddie Mac and residential businesses resulted in a servicing asset that grew to over $12.9 billion in service loans resulting in a 23% increase in servicing revenue to 13.4 million. In the quarter, we sold $102 million of SBA loans compared to $36 million in the first quarter at average premiums of 13%, likewise, Freddie Mac SBL sales rose 8.5% to $181 million with premiums averaging 169 basis points. Additional income statement items of note include a $4.2 million increase in income from joint venture as our CRE equity investments, move through the execution of business plans and a $6.1 million increase in operating expenses due to increased employee compensation accruals, increased dollars allocated to marketing and technology efforts and a $3.7 million expense related to PPP production. At quarter end, the remaining Anworth assets included a $168 million of RMBS securities, $84 million of residential loans and $26 million of REO, all of which are expected to be liquidated over the next two quarters. Okay, great that's helpful and then just one on PPP on the balance sheet, I think is still about $2.2 billion of PPP loans, how many quarters do you estimate that it should takes for those loans to run off the balance sheet. Yes, certainly over the next few quarters with PPP, I would say 11 as a base and when you add in 95 million plus of income plus the carry-on PPP loans in addition to our, a core business that is certainly trending towards that $0.40 range. I just want to focus on the margin, the gains on margins on the multifamily like you said was $169 million on the Freddie and the SBA net sale premiums grew 13% although was normalized levels are they running above historical averages."
}