{
    "symbol": "RC",
    "quarter": 4,
    "year": 2021,
    "date": "2022-02-25 10:58:04",
    "content": " 2:54 In our small business lending business, fourth quarter originations of SBA 7(a) loans equalled $136 million, capping a record $481 million in total 2021 production, more than double 2020. We closed the year as the sixth largest SBA lender and we'll continue to gain market share with a rollout of new programs, including SBA Express small loan for which we originated $5 million in the quarter and USDA for which we obtained a license. In 2021, our equity capital increased 54% to $1.3 billion, comprising $240 million in M&A and $167 million in common and preferred equity issuance. Compared to the traditional mREIT equity growth strategies or secondary issuance, we continue to support growth in our SBC market share through accretive M&A including the fourth quarter signing of the $550 million merger with mosaic real estate credit. Further, high-risk assets rated 4 or 5 on our 1 to 5 risk rating scale declined 22 basis points to 5.4% of our SBC portfolio and remained consistent at 7.5% of our SBA portfolio 7:29 Now Ready Capital is uniquely positioned regarding the impact of rising rates and widening credit spreads on mREIT dividend yield and book value. Gains from the sale of SBA 7(a) loans declined $3.4 million, primarily due to an 11% reduction in loan sale activity as well as the decision to sell 20% of the activity for a higher future IO strip. 12:46 As expected net revenue from residential mortgage banking activity declined 37% to $8.1 million, due to both lower quarter-over-quarter production and margins, which declined to 75 basis points in the quarter. This included raising $490 million of incremental corporate capital including $350 million of 4.5% senior secured five-year notes, $110 million of 5.5% senior unsecured seven-year notes and $30 million in equity via our ATM. 31:12 And then as far as the credit component, we haven't -- at least in the CMBS -- I'm sorry, in our niche, which is typically below $50 million, we're definitely not seeing a significant decline in credit metrics in terms of debt yield, debt service coverage ratio and as is LTVs or on the stabilized loan, the actual appraised values."
}