{
    "symbol": "LPLA",
    "quarter": 1,
    "year": 2022,
    "date": "2022-04-29 00:07:08",
    "content": " Your line is open. As we think through the cycle, you guys have significant amount of cash still sitting in money market funds is really form of sort of the overflow, I guess because bank demand wasn’t there for the last couple of quarters. How are you thinking about the ability to transfer them back into ICA, especially when money market fund yields feel like we’ll start to rise and already higher than what clients would be able to get and their kind of ICA cash balances. Alex, and I think I’ll hit just kind of cash sweep dynamics overall that I think will hit on the exact point you asked there, and I think you highlighted the money market balance is really a function of overflow as opposed to rate seeking behavior. Your line is open. Your line is open. Your line is open. Look, I think our framework hasn’t changed, we first focus on organic growth and looking at opportunities to deploy that capital, even when at a place of strength in order to enhance our ability to differentiate and grow organically. Your line is open. And look, even in a down market, if we get some extended down equity market, that typically works as a tailwind to recruiting as once you get sort of past that sort of initial stage of that more challenging market, and advisors have kind of acclimated to that, they’ll begin to pick up and use that time as an opportunity to look around and see how they strengthen their business strategically. Your line is open. And I think this is where we see investments in our core operating platform, think service, compliance and operations and how we’re really exploring how do you digitize all of them to the extent that you can, and the scalability of the model really becomes interested not only in being able to facilitate those much higher growth rates on a sustainable basis, but also in the efficiency gains that you pull through it. Your line is open. Your line is open. Your line is open."
}