{
    "symbol": "CSX",
    "quarter": 3,
    "year": 2022,
    "date": "2022-10-20 18:20:29",
    "content": " Your line is open. Your line is open. I think the best way to think about that is to take the $42 million we talked about, which was the out-of-period expenses related to the tentative Union agreement, strip that out of labor -- and that's the employee run rate that you're probably going to want to use going into Q4 as well as into the first half of next year before the next increase takes place in July of 2023. Your line is open. But as we get into next year, I think there's plenty of opportunity for us to drive some efficiencies and take some of the cost out to help offset the inflationary headwinds that we're going to see. Your line is open. Your line is open. Hey Tom, on the trucking environment and other things, I think what you have to remember is we don't really operate in the spot market when the truckers are getting 30%, 40% rate increases, that's not what was occurring on our end, and we have a lot of long-term agreements with customers that they understand. Your line is open. And we're feeling it out in the field the discussions that we have -- Joe and I have spent a lot of time out in the field over the last few weeks and the discussion points our men and women who are making this happen each and every day, whether it's on the ground or in the towers on the service side delivering, everyone is feeling it. So, we're demand ultimately settles out, I think, is somewhat of a question, but we do see from a share perspective, and that's an important thing, a lot of opportunity to win wallet share with existing customers and we see a lot of new customers willing for maybe the first time coming to us and saying, well, how does rail work and how could we provide a service for us. Your line is open. So to be clear, we're really focused, as you've heard over and over tonight about the opportunity to keep this momentum going and leverage our great operating model the team has put in place here to free up that capacity with the manpower to then allow for us to naturally provide more volume to our customers that they're asking for. Your line is open. And so on the customer side, challenging our team, especially Steve was coming on the technology side and all of us here to think about what would it take to be able to provide the type of service our customers should expect from us in 2022 and beyond in terms of not only living up to our commitment around the trip plan compliance or having cars ready or those kind of things, but also around visibility, around transparency and communication because some of the frustrations that we experienced on the other side of this was really around transparency and visibility, and there's lots of opportunity for us to get better as an industry and frankly, as a company in that regard. Your line is open. So that's the real impetus around ONE CSX is bringing our team together, after all we've been through with the transformation of the operating model and COVID and labor negotiations and all these things to build from where we are and say, we're going to be one team working together, supporting each other, appreciating each other and delivering for our customers. Your line is open. So we are continuing to prep ourselves to move great, I think I answered the question on what happens if there's a bit of a downturn in business, we're going to stay forward-looking and we're going to try to drive this opportunity like it's never been done before. Your line is open. Your line is open."
}