{
    "symbol": "CSX",
    "quarter": 4,
    "year": 2022,
    "date": "2023-01-25 21:12:04",
    "content": " But you referenced the fact that there's been some conversation for quite some time that our challenges were manpower levels and then how that affected the fluidity of the network, we're seeing, as you just referenced, the performance that comes from game of manpower levels where we want them to be and running this network the way it was run prior to the pandemic, which is a very strong operating team. And we don't pay -- we don't spend a lot of time thinking about the other Class 1 railroads, but I do believe we probably have a little bit higher percentage of our businesses, obviously, exposed to that international market where we've had a great, great success, and we see a long-term outlook that's very positive for us. And as I've learned a lot about this industry, about this business, there's a lot of variability and a lot of independence when it comes to the work that's done now in the field, because this is not a factory assembly line where you're stationed in a certain position and you've got a cycle time to meet, and if you don't make it, all bells and whistles go off. And that's just human nature, and that's really what's important about this relationship is that listening to our employees, resolving their issues, working on things that improve their efficiency and their work life balance and their work life experience and safety and other things, leads to a better service product for our customers, which ultimately leads to a better business for everyone, including our employees. I mean, again, TPC, whether it's carload, intermodal, all the rest of it that you see that we've put out there, we're starting to get back to our -- as a matter of fact, we're beyond our record numbers on some of those service metrics. So that's why we've been so focused on getting the manpower where it needs to be and really getting -- making sure that we're focusing on the right metrics for the business, and I'm really pleased with where we are. And I think what's probably a little bit underappreciated what's happened in some of the things that we've seen in some of the major markets that we serve today is -- and I had referenced this previously on other earnings calls, we were in that 60%, 70% type of order fill rates pretty much through most of 2022. And so, that's embedded in what some of the guidance that we provided today and why we have a confidence around accelerating or beating that GDP number is that we're going to go and capture those orders and those demand that the customer has out there this year with the replenished workforce and all the things that the operations team is doing. I think Jamie answered the question on the network side, we have a lot of capacity to grow into and it's -- we're going to use that capacity and go after wallet share with our existing customers and identify new customers. We're future -- we're looking into the future, really important that we -- Kevin and I obviously are -- as we stated here today, work really close together to see not only what's happening today, but what's happening in six months from now, what's happening a year from now. But as we continue to move forward, we're looking at continuing to build our numbers up so we can get to a point where we can cover vacation time and making sure that our employees get the time off that at times they've struggled over the last couple of years. So, we are -- it's probably one of the first times in a couple of years, I've been on one of these calls, and I can say we're comfortable that our headcount is at a good spot and continuing to move into a good spot as we move into the year."
}