{
    "symbol": "CVI",
    "quarter": 4,
    "year": 2022,
    "date": "2023-02-22 18:14:02",
    "content": " We are pleased to announce that the Board of Directors has authorized a 25% increase in the fourth quarter regular dividend to $0.50 per share, which will be paid on March 13, 2023, to shareholders of record at the close of market on March 6, 2023. For the fourth quarter of 2022, our net income attributable to CDI shareholders was $112 million, earnings per share was $1.11 and EBITDA was $313 million. Our fourth quarter results included an unfavorable inventory valuation impact of $39 million, a negative mark-to-market on our estimated outstanding rent obligation of $26 million and unrealized derivative losses of $10 million. Excluding the above-mentioned items, adjusted EBITDA for the quarter was $388 million and adjusted earnings per share was $1.68. Adjusted EBITDA in the Petroleum segment was $282 million for the fourth quarter, driven by high utilization rates at our refineries and strong product cracks in the Mid-Con. Our fourth quarter realized margin adjusted for inventory valuation, unrealized derivative losses and RIN mark-to-market impacts was $21.01 per barrel, representing a 56% capture rate on the Group 3 2-1-1 benchmark. RINs expense for the quarter, excluding the mark-to-market impact, was $116 million or $5.70 per barrel, which negatively impacted our capture rate for the quarter by approximately 15%. Cash provided by operations for the fourth quarter of 2022 was $99 million, and free cash flow was $44 million. Material uses of cash in the quarter included $131 million of RIN purchases, $55 million of capital and turnaround spending, $39 million of cash taxes and $18 million of cash interest, in addition to $141 million paid for the CBI third quarter regular and special dividends. Total consolidated capital spending for the full year 2022 was $203 million, which included $86 million in the Petroleum segment, $41 million in the Fertilizer segment and $69 million on the RDU and the pretreater. For the full year 2023, we estimate total consolidated capital spending to be approximately $200 million to $225 million and turnaround spending to be approximately $50 million to $60 million. We ended the quarter with a consolidated cash balance of $510 million, which includes $86 million of cash in the Fertilizer segment. We estimate direct operating expenses to range between $95 million and $105 million, total capital spending to be between $40 million and $50 million and turnaround spending to be between $35 million and $45 million. For the Fertilizer segment, we estimate our first quarter 2023 ammonia utilization rate to be between 95% and 100%, direct operating expenses to be approximately $55 million to $65 million, excluding inventory impacts, and total capital spending to be between $5 million and $10 million. For renewables, we estimate first quarter 2023 total throughput to be approximately 20 million to 25 million gallons, direct operating expenses to be between $2 million and $4 million and total capital spending to be between $20 million and $30 million. We continue to make progress on the pretreater at the Wynnewood unit -- at Wynnewood, with the completion still expected to be early third quarter at a capital cost of approximately $95 million. We expect this project to cost approximately $120 million over the next 3 years, and we'll -- we will -- and we estimate our alky capacity will increase by 2,500 barrels per day once online."
}