{
    "symbol": "SAIA",
    "quarter": 2,
    "year": 2022,
    "date": "2022-07-27 18:04:06",
    "content": " But when we look at these facilities, at markets that we're already in, these are interesting opportunities for us because they -- not only they provide incremental service to the customer but there's an efficiency for us as well. Number one, I guess, as we think about kind of the start-up costs, it seems like with the size of the business, when we think about the expansion in the second half of the year, you're not really signaling any drag on the margins as you open these new facilities. I'd say that -- Amit, remember, in terms of the terminal openings, while there's terminals out there like Atlanta and Northwest or maybe Northeast, when it comes on board next year, that provide opportunities to open up in really good freight markets. I think on the other piece of it, part of the story that is not seen is that we have really focused the last 2 or 3, 4 years on core execution and being able to manage cost efficiencies, productivity through a pretty challenging environment around -- during the pandemic time and all the disruption that came along with that. But the OR -- we think that the impact is very less because we've continuously been raising base rates and focusing on making sure the customer's account earns the proper return for us, excluding what's going on with the fuel bucket. I think you can continue to see us think about an elevated level here as long as the economy is -- the landscape is attractive to us, I think you could see us spend it this 15% to 17% of revenue over the next 2 to 3 years, eventually probably tapering down to kind of a longer-term run rate in the low teens. And I don't think that it's -- to the extent that we actually carry heavier-weighted shipments, it's by choice, maybe it's in a little bit of a backhaul lane or something like that. I think that as you look steady the landscape and if we can differentiate on service and you can just assess the public data that's available around average revenue per bill and I think you'd say that the size performing, providing that great service to customer, that's a differentiated point and we need to be at market. But relative to what -- or I should say, market sort of studies but we're -- versus our own measurement from customers, that is critical and that's what they're telling us. So look, I mean, in general, I mean, higher-value freight, if you think of it that way, if you think of some of our industrial customers, if we're moving critical parts, if you think about maybe an oil services customer, if you're moving some sort of drilling component for a customer and it's time-sensitive and if you're late with it, you could impact production and, therefore, revenue. Sometimes those are shipments that are easier to charge higher prices for and you better deliver the service because you're impacting the customers' business in a big way there versus something that might be more commoditized, a pallet of goods where it's a restocking move or something like that, that's not as critical."
}